{
  "word": "abandoned",
  "pronunciation": "uh·bahn·dond",
  "concise_definition": "adj. 被遗弃的, 被丢弃的; v. 遗弃, 放弃 (过去式和过去分词)",
  "forms": {
    "base_form": "abandon",
    "past_tense": "abandoned",
    "past_participle": "abandoned",
    "present_participle": "abandoning",
    "third_person_singular": "abandons"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Left behind permanently with no intention of returning or reclaiming; describing something that has been deserted by its owner, users, or occupants.",
      "explanation_cn": "指被永久遗弃，且无任何返回或收回意图的状态；描述某物已被其所有者、使用者或居住者丢弃。",
      "example_en": "The abandoned house on the hill had broken windows and overgrown weeds.",
      "example_cn": "山上的那栋废弃房屋窗户破碎，杂草丛生。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used to describe a person or behavior that is unrestrained, wild, or lacking in self-control, often implying a sense of total surrender to emotion or impulse.",
      "explanation_cn": "用于形容人或行为放纵、狂野、缺乏自制力，常暗示完全屈从于情感或冲动。",
      "example_en": "She danced with abandoned joy, completely lost in the music.",
      "example_cn": "她带着毫无拘束的喜悦跳舞，完全沉浸在音乐中。"
    },
    {
      "pos": "verb",
      "explanation_en": "To deliberately give up or stop using, supporting, or continuing something, often due to difficulty, danger, or lack of interest.",
      "explanation_cn": "指因困难、危险或缺乏兴趣而故意放弃、停止使用、支持或继续某事物。",
      "example_en": "They abandoned the car in the snowstorm and walked to the nearest village.",
      "example_cn": "他们在暴风雪中弃车，步行前往最近的村庄。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "deserted",
      "analysis": "“Deserted” (被遗弃的) 与 “abandoned” 非常接近，但更强调“被离开”这一动作本身，常用于描述地点（如军队撤离的基地、空无一人的城镇），语气较中性；而 “abandoned” 更强调被遗弃后的状态，常带有情感色彩，如孤独、破败或绝望。"
    },
    {
      "word_to_compare": "forsaken",
      "analysis": "“Forsaken” (被遗弃的) 带有强烈的感情色彩，常用于文学语境，暗示被深爱或依赖的人或事物所抛弃，带有悲情和背叛感。例如“a forsaken child”。而 “abandoned” 更通用，可指物理或情感上的抛弃，情感强度较低。"
    },
    {
      "word_to_compare": "neglected",
      "analysis": "“Neglected” (被忽视的) 指因疏忽或不关心而未被妥善照顾，但主体可能仍被保留或未完全离开。例如“a neglected garden”仍存在，只是无人打理；而 “abandoned” 意味着彻底的离开和放弃，不再有任何维护或意图回归。"
    }
  ]
}