{
  "word": "abduction",
  "pronunciation": "uhb·duk·shun",
  "concise_definition": "n. 绑架, 诱拐, （解剖学）外展",
  "forms": {
    "plural": "abductions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The unlawful taking or carrying away of a person by force, fraud, or coercion, often for ransom, political leverage, or other criminal purposes.",
      "explanation_cn": "指通过暴力、欺骗或胁迫非法劫持或带走他人，通常用于勒索、政治筹码或其他犯罪目的。",
      "example_en": "The child's abduction shocked the entire community and triggered a massive police search.",
      "example_cn": "这名儿童的绑架事件震惊了整个社区，并引发了大规模的警方搜寻。"
    },
    {
      "pos": "noun",
      "explanation_en": "In anatomy and physiology, the movement of a limb or body part away from the midline of the body, such as raising the arm sideways.",
      "explanation_cn": "在解剖学和生理学中，指肢体或身体部位向身体中线外侧移动的动作，例如将手臂向侧面抬起。",
      "example_en": "The physical therapist guided him through exercises to improve abduction of the shoulder.",
      "example_cn": "理疗师指导他进行锻炼，以改善肩关节的外展功能。"
    },
    {
      "pos": "noun",
      "explanation_en": "A logical fallacy in which a conclusion is drawn from a premise that does not logically follow, often involving false assumptions or misleading context.",
      "explanation_cn": "一种逻辑谬误，指从一个不必然推出结论的前提中得出推论，通常涉及错误的假设或误导性语境。",
      "example_en": "His argument was an abduction: he assumed that because the suspect was near the scene, he must be guilty.",
      "example_cn": "他的论点是一种错误推论：他假设嫌疑人出现在现场附近，就必定有罪。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "kidnapping",
      "analysis": "“Kidnapping”（绑架）是 “abduction” 在非法拘禁语境下的同义词，但 “kidnapping” 更常用于日常语言和法律语境中，专指以勒索或控制为目的的劫持行为；而 “abduction” 语义更广，可涵盖非金钱动机的诱拐（如儿童被陌生人带走）或非刑事语境（如外展动作）。"
    },
    {
      "word_to_compare": "capture",
      "analysis": "“Capture”（捕获）强调通过武力或策略使某人或某物处于控制之下，常用于战争、动物捕捉或逮捕罪犯，不必然涉及非法性或长期拘禁。而 “abduction” 特指对个人的非法强行带走，具有强烈的道德和法律负面含义。"
    },
    {
      "word_to_compare": "adduction",
      "analysis": "“Adduction”（内收）是 “abduction” 在解剖学中的反义词，指肢体向身体中线移动的动作（如放下抬起的手臂）。两者在医学语境中形成对称概念，但语义完全相反，不可互换。"
    }
  ]
}