{
  "word": "absorb",
  "pronunciation": "ab·sawrb",
  "concise_definition": "v. 吸收, 吸引, 使全神贯注, 承担",
  "forms": {
    "third_person_singular": "absorbs",
    "past_tense": "absorbed",
    "past_participle": "absorbed",
    "present_participle": "absorbing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To take in or soak up a substance, especially a liquid or gas, through a surface or material.",
      "explanation_cn": "指通过表面或材料吸收、吸入某种物质，尤其是液体或气体。",
      "example_en": "The sponge absorbed all the water from the spilled glass.",
      "example_cn": "海绵吸干了洒在桌上的水。"
    },
    {
      "pos": "verb",
      "explanation_en": "To engage someone's attention completely, so that they are unaware of other things around them.",
      "explanation_cn": "指完全吸引某人的注意力，使其对周围其他事物毫无察觉。",
      "example_en": "She was so absorbed in her book that she didn't hear the doorbell ring.",
      "example_cn": "她全神贯注地看书，连门铃响了都没听见。"
    },
    {
      "pos": "verb",
      "explanation_en": "To take in and incorporate information, ideas, or knowledge into one's mind or understanding.",
      "explanation_cn": "指将信息、思想或知识吸收并融入自己的思维或理解中。",
      "example_en": "Students need time to absorb the complex theories taught in class.",
      "example_cn": "学生需要时间来消化课堂上讲授的复杂理论。"
    },
    {
      "pos": "verb",
      "explanation_en": "To take on or assume the cost, responsibility, or burden of something, often without passing it on to others.",
      "explanation_cn": "指承担某项成本、责任或负担，通常不转嫁给他人。",
      "example_en": "The company absorbed the loss from the failed product launch.",
      "example_cn": "公司承担了产品发布失败带来的损失。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "soak",
      "analysis": "“Soak”（浸透）强调液体长时间渗透进入多孔材料，常带有物理上的饱和感，如“衣服被雨淋透了”。而 “absorb” 更广泛，不仅用于液体，还可用于能量、信息或责任，且常隐含功能性或主动性，如吸收知识或成本。"
    },
    {
      "word_to_compare": "engage",
      "analysis": "“Engage”（吸引参与）侧重于激发兴趣或参与互动，如“吸引观众注意力”；而 “absorb” 更强调完全沉浸、无意识地被占据，注意力被彻底占据，几乎无法分心。后者程度更深，更被动。"
    },
    {
      "word_to_compare": "incorporate",
      "analysis": "“Incorporate”（合并、纳入）强调将外部元素整合进一个已有系统或结构中，如“将新政策纳入公司规章”。而 “absorb” 更侧重于内部消化、同化，常暗示原主体发生变化或适应，如吸收新文化、吸收损失，带有更强的转化意味。"
    }
  ]
}