{
  "word": "abstracts",
  "pronunciation": "ab·strakt",
  "concise_definition": "n. 摘要, 摘录, 抽象概念; v. 摘要, 提取, 抽象化",
  "forms": {
    "singular": "abstract",
    "third_person_singular": "abstracts",
    "past_tense": "abstracted",
    "past_participle": "abstracted",
    "present_participle": "abstracting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A concise summary of the main points of a longer work, such as a research paper, article, or book, typically including the purpose, methods, results, and conclusions.",
      "explanation_cn": "指对较长作品（如研究论文、文章或书籍）主要内容的简明概括，通常包括研究目的、方法、结果和结论。",
      "example_en": "The journal requires all submissions to include an abstract of no more than 250 words.",
      "example_cn": "该期刊要求所有投稿附上不超过250字的摘要。"
    },
    {
      "pos": "noun",
      "explanation_en": "A concept or idea that exists independently of physical reality, representing a general quality or characteristic rather than a specific instance.",
      "explanation_cn": "指独立于物理现实而存在的概念或思想，代表一种普遍的性质或特征，而非具体实例。",
      "example_en": "Justice, freedom, and beauty are abstracts that vary in meaning across cultures.",
      "example_cn": "正义、自由和美是跨文化中含义各异的抽象概念。"
    },
    {
      "pos": "verb",
      "explanation_en": "To extract or summarize the essential information from a longer text or data set.",
      "explanation_cn": "指从较长的文本或数据集中提取或概括出核心信息。",
      "example_en": "The researcher abstracted the key findings from fifty case studies.",
      "example_cn": "研究人员从五十个案例研究中提取了关键发现。"
    },
    {
      "pos": "verb",
      "explanation_en": "To divert attention away from something; to mentally separate a concept from its concrete context.",
      "explanation_cn": "指将注意力从某事物上转移；或在思维上将一个概念与其具体语境分离。",
      "example_en": "Artists often abstract natural forms to emphasize emotional expression.",
      "example_cn": "艺术家常将自然形态抽象化，以强调情感表达。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "summary",
      "analysis": "“Summary”（总结）是更通用的词，泛指对任何内容的简要复述，不局限于学术或技术文本。而 “abstract” 特指学术文献中标准化的、结构化的简要陈述，通常包含明确的组成部分（如目的、方法、结果）。"
    },
    {
      "word_to_compare": "summary",
      "analysis": "“Summary”（总结）是更通用的词，泛指对任何内容的简要复述，不局限于学术或技术文本。而 “abstract” 特指学术文献中标准化的、结构化的简要陈述，通常包含明确的组成部分（如目的、方法、结果）。"
    },
    {
      "word_to_compare": "concept",
      "analysis": "“Concept”（概念）是抽象思维中的基本单位，泛指任何思想或想法。而 “abstract” 作为名词时，特指从具体事物中提炼出的、脱离实际形态的普遍性概念，常用于哲学、艺术或科学语境，强调其非具象性。"
    },
    {
      "word_to_compare": "extract",
      "analysis": "“Extract”（提取）强调从物质或文本中取出部分，常用于物理或数据层面，如提取精油、提取数据。而 “abstract” 作为动词时，不仅提取信息，还包含提炼、概括、升华的含义，更侧重于认知层面的简化与抽象化。"
    }
  ]
}