{
  "word": "abuse",
  "pronunciation": "uh·byooz",
  "concise_definition": "v. 滥用, 虐待, 侮辱; n. 滥用, 虐待, 侮辱",
  "forms": {
    "third_person_singular": "abuses",
    "past_tense": "abused",
    "past_participle": "abused",
    "present_participle": "abusing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To use something in a wrong, harmful, or excessive way, especially for personal gain or in violation of its intended purpose.",
      "explanation_cn": "以错误、有害或过度的方式使用某物，尤其是为了个人利益或违背其原本用途。",
      "example_en": "He abused his position as manager to favor his friends.",
      "example_cn": "他滥用经理职位来偏袒自己的朋友。"
    },
    {
      "pos": "verb",
      "explanation_en": "To treat someone physically, emotionally, or sexually in a cruel, violent, or harmful manner, often repeatedly.",
      "explanation_cn": "以残忍、暴力或有害的方式对他人进行身体、情感或性方面的对待，通常具有重复性。",
      "example_en": "The child was abused by a caregiver over several years.",
      "example_cn": "这名儿童在数年间一直遭受看护者的虐待。"
    },
    {
      "pos": "verb",
      "explanation_en": "To use offensive or insulting language toward someone, often in anger or to intimidate.",
      "explanation_cn": "以攻击性或侮辱性的语言对待他人，通常出于愤怒或恐吓目的。",
      "example_en": "He abused the driver with vulgar language after the accident.",
      "example_cn": "事故发生后，他用粗俗的语言辱骂司机。"
    },
    {
      "pos": "noun",
      "explanation_en": "The improper or excessive use of something, such as power, drugs, or resources.",
      "explanation_cn": "对某物（如权力、药物或资源）的不当或过度使用。",
      "example_en": "The scandal revealed widespread abuse of public funds.",
      "example_cn": "这起丑闻揭露了公共资金的广泛滥用。"
    },
    {
      "pos": "noun",
      "explanation_en": "Cruel or violent treatment of a person, especially in domestic or institutional settings.",
      "explanation_cn": "对个人的残忍或暴力对待，尤其发生在家庭或机构环境中。",
      "example_en": "She sought help after years of emotional abuse.",
      "example_cn": "她在经历了多年的情感虐待后寻求帮助。"
    },
    {
      "pos": "noun",
      "explanation_en": "Insulting or offensive language or behavior directed at someone.",
      "explanation_cn": "针对某人的侮辱性或攻击性语言或行为。",
      "example_en": "The comments were a form of verbal abuse.",
      "example_cn": "这些言论是一种言语虐待。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "misuse",
      "analysis": "“Misuse” (误用) 侧重于错误地使用某物，通常不包含恶意或暴力意图，更多是因无知或疏忽导致的不当使用，如误用药物或工具。而 “abuse” 暗示更严重的故意性、伤害性或道德败坏，常涉及权力、人身或情感伤害。"
    },
    {
      "word_to_compare": "maltreat",
      "analysis": "“Maltreat” (虐待) 与 “abuse” 在身体或情感伤害的语境中非常接近，但 “maltreat” 更常用于描述持续性的恶劣对待，语气稍显书面和正式，且较少用于非人身对象（如资源、权力）的滥用。而 “abuse” 适用范围更广，涵盖物质、语言、权力等多个层面。"
    },
    {
      "word_to_compare": "exploit",
      "analysis": "“Exploit” (剥削) 指利用他人或资源为自己谋利，通常带有不公正或不道德的性质，但不一定包含直接的暴力或侮辱。而 “abuse” 更强调对权利、信任或安全的破坏，其行为本身即构成伤害，而不仅仅是利益攫取。"
    }
  ]
}