{
  "word": "academic",
  "pronunciation": "ak·uh·dem·ik",
  "concise_definition": "adj. 学术的, 理论的; n. 学者, 大学教师",
  "forms": {
    "comparative": "more academic",
    "superlative": "most academic",
    "plural": "academics"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to schools, colleges, or universities, especially in the context of education, research, or theoretical study rather than practical application.",
      "explanation_cn": "与学校、学院或大学相关的，尤其指教育、研究或理论性学习，而非实际应用。",
      "example_en": "She has an academic background in economics and has published several peer-reviewed papers.",
      "example_cn": "她拥有经济学的学术背景，并发表了数篇同行评审论文。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Concerned with theoretical or abstract ideas rather than practical or real-world applications; often implying impracticality or detachment from everyday concerns.",
      "explanation_cn": "关注理论或抽象概念，而非实际或现实应用；常暗示脱离实际或与日常生活脱节。",
      "example_en": "The debate was purely academic since the policy had already been implemented.",
      "example_cn": "这场辩论纯属理论性质，因为该政策已经实施了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who works in higher education, especially as a teacher or researcher at a university or college.",
      "explanation_cn": "在高等教育机构中工作的人，尤指大学或学院的教师或研究人员。",
      "example_en": "The conference brought together academics from over 20 countries to discuss climate change.",
      "example_cn": "本次会议汇集了来自二十多个国家的学者，共同探讨气候变化问题。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "scholarly",
      "analysis": "“Scholarly”（学术性的）强调符合学术标准、严谨、基于深入研究，常用于形容态度、写作或方法，如 scholarly article（学术文章）。而 “academic” 更广泛，可指机构、环境或理论倾向，有时带有脱离实际的贬义，而 “scholarly” 通常为褒义。"
    },
    {
      "word_to_compare": "theoretical",
      "analysis": "“Theoretical”（理论的）专指基于理论而非实践，强调缺乏实际应用或验证。而 “academic” 可包含理论性，但更侧重于教育或研究体系的背景，有时可中性使用，如 academic discipline（学术学科）。"
    },
    {
      "word_to_compare": "intellectual",
      "analysis": "“Intellectual”（智力的/知识的）强调思维能力、理性思考或对知识的追求，可形容人、活动或兴趣，如 intellectual curiosity（求知欲）。而 “academic” 更具体地指向教育机构和正式研究体系，范围更窄，且常与制度性环境相关。"
    }
  ]
}