{
  "word": "academy",
  "pronunciation": "uh·kem·uh·nee",
  "concise_definition": "n. 专科院校, 学院, 学会, 研究机构",
  "forms": {
    "plural": "academies"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An institution of higher learning, especially one focused on a specific field such as arts, sciences, or military training, often offering specialized education and research opportunities.",
      "explanation_cn": "指专注于特定领域（如艺术、科学或军事训练）的高等教育机构，通常提供专业教育和研究机会。",
      "example_en": "She graduated from the Juilliard School, one of the most prestigious music academies in the world.",
      "example_cn": "她毕业于茱莉亚学院，这是全球最负盛名的音乐学院之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A society or organization dedicated to promoting scholarship, science, or the arts through research, publication, and public engagement.",
      "explanation_cn": "指致力于通过研究、出版和公众参与来促进学术、科学或艺术的团体或组织。",
      "example_en": "The National Academy of Sciences advises the U.S. government on scientific matters.",
      "example_cn": "美国国家科学院就科学事务为美国政府提供建议。"
    },
    {
      "pos": "noun",
      "explanation_en": "A school or training center for specialized skills, such as acting, athletics, or military tactics, often with a rigorous and structured curriculum.",
      "explanation_cn": "指专门培训特定技能（如表演、体育或军事战术）的学校或训练中心，通常具有严格和系统的课程。",
      "example_en": "He enrolled in a police academy to become a detective.",
      "example_cn": "他进入警察学院学习，以成为一名侦探。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "university",
      "analysis": "“University”（大学）通常指综合性高等教育机构，涵盖广泛的学科领域，授予学士、硕士和博士学位。而 “academy” 更侧重于专业性、专门化或精英化的教育与研究，规模通常较小，且可能不提供完整的学位体系。"
    },
    {
      "word_to_compare": "institute",
      "analysis": "“Institute”（研究所/学院）与 “academy” 相近，常用于指专业性机构，但 “institute” 更强调科研或技术应用，如 ‘Institute of Technology’；而 “academy” 更常用于强调传统、声誉或精英培养，如 ‘Academy of Arts’，有时带有体制性或官方色彩。"
    },
    {
      "word_to_compare": "college",
      "analysis": "“College”（学院）在英语中可指大学下属的学院，也可独立存在，提供本科教育。它比 “academy” 更通用，且通常不强调专业训练或精英选拔。而 “academy” 常带有更正式、更专注或更历史悠久的意味，尤其在艺术、军事或学术团体语境中。"
    }
  ]
}