{
  "word": "accelerated",
  "pronunciation": "uhk·sel·uh·rey·tuhd",
  "concise_definition": "adj. 加速的, 增快的; v. 加速 (accelerate 的过去式和过去分词)",
  "forms": {
    "base_form": "accelerate",
    "present_participle": "accelerating",
    "past_tense": "accelerated",
    "past_participle": "accelerated",
    "adverb_form": "acceleratedly",
    "noun_form": "acceleration"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Moving or proceeding at an increased speed or rate, often faster than normal or expected; describing a process that has been made to happen more quickly.",
      "explanation_cn": "以比正常或预期更快的速度进行或推进；描述一个被加快了进程的事物或过程。",
      "example_en": "The accelerated pace of technological innovation is reshaping industries worldwide.",
      "example_cn": "技术创新的加速步伐正在重塑全球产业。"
    },
    {
      "pos": "adjective",
      "explanation_en": "In education or training, referring to a program that compresses content or reduces the standard time required to complete a course or degree.",
      "explanation_cn": "在教育或培训中，指将课程内容压缩、缩短完成所需标准时间的项目。",
      "example_en": "She enrolled in an accelerated degree program to finish her bachelor’s in two years.",
      "example_cn": "她报名参加了加速学位课程，以在两年内完成学士学位。"
    },
    {
      "pos": "verb",
      "explanation_en": "To increase the speed, rate, or progress of something; to cause something to happen more quickly than it otherwise would.",
      "explanation_cn": "指提高某事物的速度、速率或进展，使其比原本更快地发生。",
      "example_en": "The new policy accelerated economic recovery in the region.",
      "example_cn": "这项新政策加速了该地区的经济复苏。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fast",
      "analysis": "“Fast” (快的) 是一个通用形容词，仅描述速度高，不涉及过程是否被主动加快。而 “accelerated” 强调的是“被促进”或“被提升”的速度变化，隐含人为干预或外部因素导致的速率增加。"
    },
    {
      "word_to_compare": "rapid",
      "analysis": "“Rapid” (迅速的) 描述的是事件发生得快，但不一定是从慢到快的转变过程。它侧重于结果的速度，而 “accelerated” 更强调变化的动态过程——即原本较慢，现在被加快了。"
    },
    {
      "word_to_compare": "expedited",
      "analysis": "“Expedited” (加急的) 通常用于行政、物流或流程管理中，强调通过简化程序或优先处理来缩短时间，常带有官僚或制度性干预的含义。而 “accelerated” 更广泛，可用于物理运动、技术发展、学习进程等，不局限于流程优化。"
    }
  ]
}