{
  "word": "accession",
  "pronunciation": "ak·ses·zhun",
  "concise_definition": "n. 加入, 登基, 正式接受",
  "forms": {
    "plural": "accessions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of formally joining or becoming a member of an organization, alliance, or institution, especially by a country or entity entering into a treaty or agreement.",
      "explanation_cn": "指一个国家或实体正式加入某个组织、联盟或机构的行为，尤指通过签署条约或协议而成为成员。",
      "example_en": "The country's accession to the European Union was finalized after years of negotiations.",
      "example_cn": "该国经过多年的谈判后正式加入了欧盟。"
    },
    {
      "pos": "noun",
      "explanation_en": "The formal assumption of power or office, especially by a monarch or head of state upon taking the throne.",
      "explanation_cn": "指君主或国家元首就任职位时的正式就职，尤指登基。",
      "example_en": "The accession of King Charles III was marked by a grand ceremonial procession in London.",
      "example_cn": "查尔斯三世国王的登基以一场盛大的伦敦游行仪式为标志。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of acquiring or adding something, especially a new item to a collection, such as art, artifacts, or documents.",
      "explanation_cn": "指获得或增添某物，尤指将新物品添加到收藏品中，如艺术品、文物或文件。",
      "example_en": "The museum announced the accession of a rare 15th-century manuscript to its permanent collection.",
      "example_cn": "博物馆宣布将一件稀有的15世纪手稿纳入其永久收藏。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "admission",
      "analysis": "“Admission”（准入/承认）强调被允许进入某个系统、场所或组织，常用于教育、医疗或法律语境，侧重于“被接纳”的动作。而 “accession” 更强调主动、正式地加入或就任，具有更强的制度性和仪式性，尤其适用于国家或君主的正式加入或登基。"
    },
    {
      "word_to_compare": "ascension",
      "analysis": "“Ascension”（升天/上升）通常指物理或象征意义上的向上移动，如耶稣升天或地位的提升，常带有宗教或精神色彩。而 “accession” 专指正式就职或加入，是制度性行为，不涉及空间或灵性的上升，更注重法律或政治程序。"
    },
    {
      "word_to_compare": "acquisition",
      "analysis": "“Acquisition”（获得/收购）泛指通过购买、获取或占有而获得某物，常用于商业或收藏领域，强调结果而非过程。而 “accession” 在收藏语境中特指机构正式记录并纳入藏品的程序，具有官方性和档案性，比 “acquisition” 更具制度规范性。"
    }
  ]
}