{
  "word": "accounts",
  "pronunciation": "uhk·kawnts",
  "concise_definition": "n. 账户, 账目, 报告, 描述",
  "forms": {
    "singular": "account"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A record of financial transactions, including debits and credits, maintained by an individual, business, or organization to track income, expenses, assets, and liabilities.",
      "explanation_cn": "指个人、企业或组织为记录收入、支出、资产和负债而维护的财务交易记录，包括借方和贷方项目。",
      "example_en": "She reviewed her bank accounts to ensure all transactions were accurate.",
      "example_cn": "她检查了自己的银行账户，以确保所有交易都准确无误。"
    },
    {
      "pos": "noun",
      "explanation_en": "A formal report or explanation of financial activities, often presented to stakeholders or authorities for transparency and accountability.",
      "explanation_cn": "指为透明度和问责制而向利益相关者或主管部门提交的财务活动正式报告。",
      "example_en": "The company published its annual accounts last month.",
      "example_cn": "该公司上个月公布了年度财务报告。"
    },
    {
      "pos": "noun",
      "explanation_en": "A description or narrative of an event or experience, often emphasizing personal perspective or interpretation.",
      "explanation_cn": "指对某一事件或经历的描述或叙述，通常强调个人视角或解释。",
      "example_en": "He gave a detailed account of the accident to the police.",
      "example_cn": "他向警方详细描述了事故经过。"
    },
    {
      "pos": "noun",
      "explanation_en": "A user profile or login identity on a digital platform, service, or system, used to access personalized content or functions.",
      "explanation_cn": "指在数字平台、服务或系统上的用户档案或登录身份，用于访问个性化内容或功能。",
      "example_en": "I lost access to my social media account after forgetting my password.",
      "example_cn": "我忘记密码后失去了对社交媒体账户的访问权限。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "record",
      "analysis": "“Record”（记录）泛指任何形式的存档信息，可以是文字、音频、视频等，不一定具有财务或叙述性质。而 “account” 更强调有组织、有目的的陈述，尤其在财务或事件描述语境中更具结构性和解释性。"
    },
    {
      "word_to_compare": "statement",
      "analysis": "“Statement”（声明/对账单）通常指简明、正式的摘要，如银行对账单或财务声明，侧重于结果而非过程。而 “account” 更倾向于包含过程、细节和主观视角，内容更丰富、更具叙事性。"
    },
    {
      "word_to_compare": "report",
      "analysis": "“Report”（报告）通常是系统性调查或分析后的正式成果，结构严谨，常用于学术、商业或政府场景。而 “account” 更口语化，可包含个人观察和情感，不一定经过正式分析，但更贴近真实经历。"
    }
  ]
}