{
  "word": "accumulating",
  "pronunciation": "uh·kum·yuh·ley·tihng",
  "concise_definition": "v. 积累, 聚集, 逐渐增加",
  "forms": {
    "base_form": "accumulate",
    "third_person_singular": "accumulates",
    "past_tense": "accumulated",
    "past_participle": "accumulated",
    "present_participle": "accumulating"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To gather or collect something gradually over time, often in increasing amounts, typically through repeated additions or continuous processes.",
      "explanation_cn": "指随着时间的推移，通过反复添加或持续的过程，逐渐收集或聚集某物，通常数量不断增加。",
      "example_en": "She has been accumulating a large collection of vintage books over the past decade.",
      "example_cn": "过去十年里，她一直在积累大量古董书籍。"
    },
    {
      "pos": "verb",
      "explanation_en": "To build up or amass something, especially intangible things like debt, responsibility, or pressure, often to a significant or overwhelming level.",
      "explanation_cn": "指积累（尤指抽象事物）如债务、责任或压力，通常达到显著甚至压倒性的程度。",
      "example_en": "The stress of multiple deadlines is accumulating and affecting her health.",
      "example_cn": "多个截止日期带来的压力正在累积，影响了她的健康。"
    },
    {
      "pos": "verb",
      "explanation_en": "To increase in quantity or value through continuous addition, often in financial, environmental, or scientific contexts.",
      "explanation_cn": "指在金融、环境或科学等语境中，通过持续添加而使数量或价值不断增加。",
      "example_en": "Glaciers are accumulating snow faster than they are melting due to colder winters.",
      "example_cn": "由于冬季更寒冷，冰川积雪的速度超过了融化的速度。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "gathering",
      "analysis": "“Gathering”（收集）强调主动地将分散的物品或信息聚集在一起，常用于具体事物（如收集树叶、数据），动作性更强，且不一定强调时间累积。而 “accumulating” 更侧重于长期、渐进、被动或自然增长的过程，常带有数量逐渐增多的隐含意义。"
    },
    {
      "word_to_compare": "amassing",
      "analysis": "“Amassing”（大量聚集）与 “accumulating” 意义接近，但语气更强，通常暗示积累的数量庞大、令人印象深刻，甚至带有负面或夸张色彩（如囤积财富、武器）。而 “accumulating” 更中性，可用于日常或科学语境，不必然强调规模。"
    },
    {
      "word_to_compare": "building up",
      "analysis": "“Building up”（逐步建立）强调通过持续努力逐步增强或形成某种状态（如体力、信誉），常用于积极语境。而 “accumulating” 更中性，可指任何事物的增加，包括负面事物（如债务、灰尘），且更强调“数量叠加”而非“结构构建”。"
    }
  ]
}