{
  "word": "ace",
  "pronunciation": "ayss",
  "concise_definition": "n. 顶尖人物, 一等飞行员, A牌; v. 轻松通过, 得满分",
  "forms": {
    "plural": "aces",
    "third_person_singular": "aces",
    "past_tense": "aced",
    "past_participle": "aced",
    "present_participle": "acing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who is exceptionally skilled or successful in a particular field, especially in sports, aviation, or academics.",
      "explanation_cn": "指在某一领域（尤其是体育、航空或学业）中表现极为出色或取得巨大成功的人。",
      "example_en": "She's an ace tennis player who has won five Grand Slam titles.",
      "example_cn": "她是一位顶尖的网球选手，曾赢得五项大满贯冠军。"
    },
    {
      "pos": "noun",
      "explanation_en": "A playing card with the highest value in a suit, typically marked with a single symbol (e.g., a single heart, spade, etc.), often symbolizing excellence or luck.",
      "explanation_cn": "指一副牌中花色点数最高的牌，通常用一个符号（如红心、黑桃等）表示，常象征卓越或好运。",
      "example_en": "He drew an ace of spades and felt lucky for the rest of the day.",
      "example_cn": "他抽到了一张黑桃A，当天都觉得自己运气不错。"
    },
    {
      "pos": "noun",
      "explanation_en": "A highly skilled pilot who has shot down a significant number of enemy aircraft during wartime.",
      "explanation_cn": "指在战争中击落大量敌机的顶尖飞行员。",
      "example_en": "The Red Baron was one of the most famous aces of World War I.",
      "example_cn": "红男爵是第一次世界大战中最著名的王牌飞行员之一。"
    },
    {
      "pos": "verb",
      "explanation_en": "To perform exceptionally well in a test, exam, or task, especially by achieving the highest possible score.",
      "explanation_cn": "指在考试、测试或任务中表现极为出色，通常指取得满分或最高分。",
      "example_en": "I aced the math final without even studying last night.",
      "example_cn": "我昨晚根本没复习，却在数学期末考试中得了满分。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "expert",
      "analysis": "“Expert”（专家）强调通过长期学习和经验获得的专业知识与权威性，侧重于知识深度和职业身份。而 “ace” 更强调在具体表现或瞬间成就上的卓越，常带有天赋或运气的色彩，语气更口语化、更生动。"
    },
    {
      "word_to_compare": "champion",
      "analysis": "“Champion”（冠军）通常指在正式竞赛中赢得头衔或奖杯的人，强调结果和荣誉。“Ace” 可以指未参赛但能力超群的人，或在非正式场合中表现顶尖的人，范围更广，不局限于比赛获胜者。"
    },
    {
      "word_to_compare": "genius",
      "analysis": "“Genius”（天才）指具有非凡智力或创造力的个体，常带有先天禀赋的含义，是长期的、本质性的能力。“Ace” 则更侧重于在特定任务或情境中的出色表现，不必然意味着智力超群，可能只是临场发挥极佳。"
    }
  ]
}