{
  "word": "acetate",
  "pronunciation": "a·see·teyt",
  "concise_definition": "n. 醋酸盐, 醋酸纤维素, 醋酸纤维",
  "forms": {
    "plural": "acetates"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A chemical compound derived from acetic acid, commonly used in the form of salts (e.g., sodium acetate) in food preservation, pharmaceuticals, and industrial processes.",
      "explanation_cn": "一种由乙酸衍生的化学化合物，通常以盐的形式（如醋酸钠）用于食品防腐、制药和工业过程。",
      "example_en": "Sodium acetate is often added to snacks to enhance flavor and act as a preservative.",
      "example_cn": "醋酸钠常被添加到零食中以增强风味并起到防腐作用。"
    },
    {
      "pos": "noun",
      "explanation_en": "A synthetic fiber made from cellulose acetate, known for its silk-like texture, luster, and drapability, widely used in textiles and clothing.",
      "explanation_cn": "一种由醋酸纤维素制成的合成纤维，具有类似丝绸的质感、光泽和垂坠性，广泛用于纺织品和服装。",
      "example_en": "Her dress was made of acetate, giving it a smooth, shiny finish that caught the light beautifully.",
      "example_cn": "她的连衣裙是醋酸纤维制成的，呈现出光滑闪亮的质感，在光线下格外迷人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A thin, transparent sheet made of cellulose acetate, historically used for overhead projectors, animation cels, and photographic film bases.",
      "explanation_cn": "一种由醋酸纤维素制成的薄而透明的片材，历史上用于幻灯片投影仪、动画胶片和摄影胶片基底。",
      "example_en": "Old animation studios used acetate sheets to draw characters separately from the background.",
      "example_cn": "旧时的动画工作室使用醋酸纤维片将角色与背景分开绘制。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "polyester",
      "analysis": "“Polyester”（聚酯）是一种更耐用、抗皱且价格更低的合成纤维，常用于日常服装和家居织物。而 “acetate” 更柔软、有光泽，但更易皱、不耐热，常用于高档服装的衬里或装饰性面料，强调外观而非实用性。"
    },
    {
      "word_to_compare": "cellulose",
      "analysis": "“Cellulose”（纤维素）是植物细胞壁的主要成分，天然存在；而 “acetate” 是纤维素经过化学改性（乙酰化）后的衍生物，具有不同的物理和化学性质，如更高的可塑性和光泽度。两者来源相关，但用途和性能差异显著。"
    },
    {
      "word_to_compare": "salt",
      "analysis": "“Salt”（盐）泛指一类离子化合物，如氯化钠；而 “acetate” 作为醋酸盐时，特指乙酸根离子（CH₃COO⁻）与阳离子形成的化合物。虽然醋酸钠是一种盐，但 “acetate” 一词在化学语境中更强调其阴离子结构或衍生物，而非普通食盐。"
    }
  ]
}