{
  "word": "acquired",
  "pronunciation": "uhk·wai·urd",
  "concise_definition": "adj. 后天获得的, 习得的; v. 获得, 买下, 得到 (acquire 的过去式和过去分词)",
  "forms": {
    "base_form": "acquire",
    "third_person_singular": "acquires",
    "present_participle": "acquiring",
    "past_tense": "acquired",
    "past_participle": "acquired"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Not innate or natural; gained through experience, learning, or external influence rather than being inherited or born with.",
      "explanation_cn": "非天生的、非固有的；通过经验、学习或外部影响获得，而非与生俱来。",
      "example_en": "Her fluency in three languages is an acquired skill, not an innate talent.",
      "example_cn": "她流利掌握三种语言是一种后天习得的技能，而非与生俱来的天赋。"
    },
    {
      "pos": "verb",
      "explanation_en": "To gain possession of something, especially through effort, purchase, or gradual process; to obtain or secure something intentionally.",
      "explanation_cn": "通过努力、购买或渐进过程获得某物；有意识地取得或占有某物。",
      "example_en": "The tech giant acquired a startup specializing in artificial intelligence.",
      "example_cn": "这家科技巨头收购了一家专注于人工智能的初创公司。"
    },
    {
      "pos": "verb",
      "explanation_en": "To gradually develop or adopt a habit, trait, or condition over time, often through repeated exposure or practice.",
      "explanation_cn": "通过长期重复接触或练习，逐渐养成某种习惯、特质或状态。",
      "example_en": "He acquired a taste for fine wine during his years in France.",
      "example_cn": "他在法国生活的几年里逐渐养成了对优质葡萄酒的品味。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "inherited",
      "analysis": "“Inherited”（遗传的）指通过基因或血缘从父母或祖先那里获得的特质，是天生的、与生俱来的。而 “acquired” 强调后天通过学习、经验或环境获得，两者在来源上形成鲜明对比。"
    },
    {
      "word_to_compare": "obtained",
      "analysis": "“Obtained”（获得）是一个更通用的词，泛指通过任何方式得到某物，不强调过程是渐进的还是有意识的。而 “acquired” 更常用于描述通过长期努力、学习或逐步过程获得的技能、习惯或资产，带有更强的积累性和目的性。"
    },
    {
      "word_to_compare": "earned",
      "analysis": "“Earned”（赢得）强调通过努力、贡献或成就而应得的回报，常带有道德或价值判断（如 earned respect）。而 “acquired” 更中性，仅描述获得的事实，不隐含是否应得，例如 “acquired taste”（后天培养的口味）未必是努力的结果。"
    }
  ]
}