{
  "word": "across",
  "pronunciation": "uh·krôs",
  "concise_definition": "prep. 横过, 穿过; adv. 横跨, 对面, 在另一边",
  "forms": {
    "comparative": "",
    "superlative": ""
  },
  "definitions": [
    {
      "pos": "preposition",
      "explanation_en": "Moving from one side to the other side of something, typically a surface, space, or barrier; indicating traversal or passage.",
      "explanation_cn": "指从某物的一侧移动到另一侧，通常穿过一个表面、空间或障碍物；表示穿越或通过。",
      "example_en": "She walked across the street to buy some bread.",
      "example_cn": "她穿过街道去买面包。"
    },
    {
      "pos": "preposition",
      "explanation_en": "On the opposite side of something, especially a room, street, or body of water; indicating spatial position relative to a reference point.",
      "explanation_cn": "指在某物的对面，尤其指房间、街道或水域的另一侧；表示相对于参考点的空间位置。",
      "example_en": "The library is just across the park.",
      "example_cn": "图书馆就在公园的对面。"
    },
    {
      "pos": "adverb",
      "explanation_en": "From one side to the other; extending over an area or distance; used to describe the extent of movement or spread.",
      "explanation_cn": "从一边到另一边；延伸覆盖某个区域或距离；用于描述移动或扩散的范围。",
      "example_en": "The news spread across the country within hours.",
      "example_cn": "这则消息在几小时内传遍了全国。"
    },
    {
      "pos": "adverb",
      "explanation_en": "In a position extending from one side to the other; lying or positioned transversely.",
      "explanation_cn": "指处于从一侧延伸到另一侧的位置；横放或横向摆放。",
      "example_en": "He sat across the table, staring at me.",
      "example_cn": "他坐在桌子对面，盯着我看。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "through",
      "analysis": "“Through” 强调从某物的内部穿过，如穿过隧道、森林或人群，暗示三维空间的贯穿；而 “across” 通常指在表面或二维平面上的横越，如过马路、跨河，强调的是从一边到另一边的横向移动。"
    },
    {
      "word_to_compare": "over",
      "analysis": "“Over” 通常表示在某物上方通过，可能不接触表面，如飞过屋顶、跳过水坑；而 “across” 强调接触或横穿表面，如走过桥、穿过田野。两者都可表跨越，但 “over” 更侧重高度，而 “across” 更侧重横向距离。"
    },
    {
      "word_to_compare": "opposite",
      "analysis": "“Opposite” 仅表示位置上的正对面，不包含移动或穿越的含义，如 “The bank is opposite the post office.”；而 “across” 不仅可表位置（在对面），还可表动作（穿过），具有动态和静态双重用法，语义范围更广。"
    }
  ]
}