{
  "word": "act",
  "pronunciation": "akt",
  "concise_definition": "v. 行动, 表演, 起作用; n. 行为, 法案, 戏剧表演",
  "forms": {
    "third_person_singular": "acts",
    "past_tense": "acted",
    "past_participle": "acted",
    "present_participle": "acting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To do something, especially in a deliberate or purposeful way, often in response to a situation or stimulus.",
      "explanation_cn": "指有意识地采取行动，通常是对某种情境或刺激作出的反应。",
      "example_en": "She acted quickly to save the child from the burning building.",
      "example_cn": "她迅速采取行动，从着火的大楼中救出了孩子。"
    },
    {
      "pos": "verb",
      "explanation_en": "To perform in a play, film, or other dramatic production, often by assuming a character or role.",
      "explanation_cn": "指在戏剧、电影或其他表演艺术中扮演角色，通过模仿或表现来呈现人物。",
      "example_en": "He acted the part of a detective in the school play.",
      "example_cn": "他在学校的话剧中扮演了一名侦探。"
    },
    {
      "pos": "verb",
      "explanation_en": "To function or operate in a particular way, especially when referring to systems, mechanisms, or laws.",
      "explanation_cn": "指（系统、机制或法律）以某种方式运作或产生效果。",
      "example_en": "The new policy will act as a deterrent to crime.",
      "example_cn": "这项新政策将起到威慑犯罪的作用。"
    },
    {
      "pos": "noun",
      "explanation_en": "A deed or behavior, especially one that is notable, deliberate, or morally significant.",
      "explanation_cn": "指一项行为或举动，尤其指值得注意、有意识或具有道德意义的行为。",
      "example_en": "His act of kindness touched everyone in the room.",
      "example_cn": "他的善举感动了在场的每一个人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A law or statute formally passed by a legislative body.",
      "explanation_cn": "指由立法机构正式通过的法律或法令。",
      "example_en": "The Civil Rights Act of 1964 was a landmark in American history.",
      "example_cn": "1964年的《民权法案》是美国历史上的里程碑。"
    },
    {
      "pos": "noun",
      "explanation_en": "A distinct section or division of a play, opera, or other performance.",
      "explanation_cn": "指戏剧、歌剧或其他表演中的一个独立部分或幕。",
      "example_en": "The play has three acts, each set in a different century.",
      "example_cn": "这部剧分为三幕，每幕设定在不同的世纪。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "perform",
      "analysis": "“Perform”（表演/执行）更侧重于完成一项任务或展示技能，常用于音乐、体育或仪式性场合，强调技巧和外在表现。而 “act” 在表演语境中更强调角色扮演和情感投入，在非表演语境中则更强调有意识的行为动机。"
    },
    {
      "word_to_compare": "behave",
      "analysis": "“Behave”（表现/举止）通常指符合社会规范或期望的举止，常用于描述人的态度或礼仪，带有道德或纪律色彩。而 “act” 更中性，可指任何行为，无论是否符合规范，甚至可含伪装或虚假之意（如 act like someone）。"
    },
    {
      "word_to_compare": "deed",
      "analysis": "“Deed”（行为/功绩）是名词，专指具体的、有实质影响的行动，尤其强调其道德或法律后果，常用于褒义（如 heroic deed）。而 “act” 作为名词范围更广，可指任何行为，包括中性或负面行为，且可作动词使用，语义更灵活。"
    },
    {
      "word_to_compare": "law",
      "analysis": "“Law”（法律）是泛指社会普遍遵守的规则体系，而 “act” 作为名词特指由立法机关通过的某一部具体法律文件，是“law”的一种具体形式。例如，美国的《清洁空气法》称为 the Clean Air Act。"
    }
  ]
}