{
  "word": "action",
  "pronunciation": "ak·shun",
  "concise_definition": "n. 行动, 行为, 作用, 动作, 诉讼",
  "forms": {
    "plural": "actions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A thing done; a specific deed or activity carried out by a person or group, often with a purpose or intention.",
      "explanation_cn": "指由个人或群体所实施的具体行为或活动，通常带有某种目的或意图。",
      "example_en": "The government took immediate action to address the crisis.",
      "example_cn": "政府立即采取行动应对这场危机。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process of causing change or producing an effect, especially in physics or mechanics; the force or power that produces a result.",
      "explanation_cn": "指引起变化或产生效果的过程，尤指在物理或机械领域中的作用力或产生结果的效能。",
      "example_en": "The action of the wind eroded the cliff over many years.",
      "example_cn": "风的作用在多年间侵蚀了悬崖。"
    },
    {
      "pos": "noun",
      "explanation_en": "A legal proceeding or lawsuit brought before a court to enforce or defend a right.",
      "explanation_cn": "指在法院提起的法律程序，用于主张或捍卫某种权利。",
      "example_en": "She filed an action against the company for breach of contract.",
      "example_cn": "她因公司违约而对其提起了诉讼。"
    },
    {
      "pos": "noun",
      "explanation_en": "The sequence of events or plot in a story, play, or film; the part of a narrative that involves movement and events rather than dialogue or description.",
      "explanation_cn": "指故事、戏剧或电影中的情节发展部分，侧重于事件和动态，而非对话或描述。",
      "example_en": "The movie is full of action, with car chases and explosions every few minutes.",
      "example_cn": "这部电影充满动作场面，每隔几分钟就有追车和爆炸。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "behavior",
      "analysis": "“Behavior” (行为) 更侧重于个体在特定情境下表现出的模式或习惯性反应，常用于心理学或社会学语境，强调内在动机或性格特征。而 “action” 更强调具体的、可观察的、一次性的行为事件，不必然反映长期模式。"
    },
    {
      "word_to_compare": "deed",
      "analysis": "“Deed” (行为、事迹) 通常指具有道德或法律意义的重大行动，常带有正面或负面的评价色彩，如英雄事迹或犯罪行为。它比 “action” 更具庄重性和后果性，而 “action” 是中性词，可指任何大小行为。"
    },
    {
      "word_to_compare": "movement",
      "analysis": "“Movement” (运动、运动潮流) 指一组有组织的、持续性的行动或社会趋势，如民权运动。它强调集体性、长期性和方向性。而 “action” 通常是单次或短期的个体或群体行为，不必然具有组织性或持续性。"
    }
  ]
}