{
  "word": "acts",
  "pronunciation": "aekt",
  "concise_definition": "n. 行为, 法案, 演出; v. 行动, 演戏",
  "forms": {
    "singular": "act"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A deliberate action or deed performed by a person or group, often with moral, legal, or social significance.",
      "explanation_cn": "指个人或群体所实施的有意识的行为或举动，通常具有道德、法律或社会层面的意义。",
      "example_en": "His act of kindness toward the stranger touched everyone in the room.",
      "example_cn": "他对陌生人的善举感动了在场的每一个人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A law or statute formally passed by a legislative body, such as a parliament or congress.",
      "explanation_cn": "指由立法机构（如议会或国会）正式通过的法律或法令。",
      "example_en": "The Clean Air Act was enacted to reduce pollution and protect public health.",
      "example_cn": "《清洁空气法》的颁布旨在减少污染并保护公众健康。"
    },
    {
      "pos": "noun",
      "explanation_en": "A performance or segment of a theatrical, musical, or entertainment program, often divided into parts for structural purposes.",
      "explanation_cn": "指戏剧、音乐或娱乐节目中的一个表演段落或部分，常用于结构划分。",
      "example_en": "The magician's act was the highlight of the evening show.",
      "example_cn": "魔术师的表演是当晚演出的亮点。"
    },
    {
      "pos": "verb",
      "explanation_en": "To behave or conduct oneself in a particular way, especially in response to a situation or stimulus.",
      "explanation_cn": "指以某种方式行事或表现自己，通常是对某种情境或刺激的反应。",
      "example_en": "She acted quickly to prevent the accident.",
      "example_cn": "她迅速采取行动以防止事故发生。"
    },
    {
      "pos": "verb",
      "explanation_en": "To perform in a play, film, or other dramatic production; to portray a character.",
      "explanation_cn": "指在戏剧、电影或其他戏剧性作品中扮演角色或进行表演。",
      "example_en": "He acted the role of Hamlet with great emotional depth.",
      "example_cn": "他以极深的情感演绎了哈姆雷特这个角色。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "deed",
      "analysis": "“Deed”（行为）通常指具体的、可观察的行动，尤其强调其道德或法律后果，常用于褒贬语境（如善行、恶行）。而 “act” 更广泛，可指任何行为，包括短暂的、非道德性的动作，也常用于法律或表演语境，语义范围更广。"
    },
    {
      "word_to_compare": "law",
      "analysis": "“Law”（法律）是泛指一套具有普遍约束力的规则体系，而 “act” 作为名词时特指某一部具体的立法文件，是法律体系中的一个组成部分。例如，‘the Constitution’ 是一部法律，而 ‘the Civil Rights Act’ 是一部具体的法案。"
    },
    {
      "word_to_compare": "performance",
      "analysis": "“Performance”（表演）强调的是整个演出过程的质量、技巧和呈现效果，常用于艺术领域；而 “act” 作为名词时，更侧重于表演的“一个段落”或“一个节目单元”，结构上更碎片化。此外，‘act’ 也可用于非艺术语境，如‘an act of courage’，而 ‘performance’ 一般不用于此义。"
    }
  ]
}