{
  "word": "addict",
  "pronunciation": "uh·dikt",
  "concise_definition": "n. 上瘾者, 成瘾者; v. 使上瘾",
  "forms": {
    "third_person_singular": "addicts",
    "past_tense": "addicted",
    "past_participle": "addicted",
    "present_participle": "addicting",
    "plural": "addicts"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who is physically or psychologically dependent on a substance, activity, or behavior, often to the point of losing control over their life or health.",
      "explanation_cn": "指对某种物质、活动或行为产生生理或心理依赖的人，常常达到失去对生活或健康控制的程度。",
      "example_en": "He is a nicotine addict who has tried to quit smoking for years.",
      "example_cn": "他是一个尼古丁成瘾者，多年来一直试图戒烟。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is extremely enthusiastic about or devoted to a particular activity or interest, often used informally or humorously.",
      "explanation_cn": "指对某种特定活动或兴趣极度热衷或投入的人，常用于非正式或幽默语境。",
      "example_en": "She's a coffee addict—she drinks at least five cups every morning.",
      "example_cn": "她是个咖啡瘾君子——每天早上至少喝五杯。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause someone to become physically or psychologically dependent on a substance or behavior, often with negative consequences.",
      "explanation_cn": "使某人对某种物质或行为产生生理或心理依赖，通常带来负面后果。",
      "example_en": "Social media can addict young people to constant validation and instant gratification.",
      "example_cn": "社交媒体会使年轻人沉迷于持续的认同感和即时满足。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "user",
      "analysis": "“User”（使用者）是一个中性词，仅指使用某种物质或参与某种活动的人，不带有依赖或失控的含义。例如，一个“drug user”可能偶尔使用药物，但未必成瘾；而 “addict” 则明确表示已丧失自主控制能力，具有病理性和强制性。"
    },
    {
      "word_to_compare": "enthusiast",
      "analysis": "“Enthusiast”（爱好者）指对某事物有强烈兴趣和热情的人，但完全出于自愿和理性选择，不会影响正常生活。而 “addict” 暗示了非理性、强迫性行为，常伴随健康或社会功能损害。两者在程度和后果上有本质区别。"
    },
    {
      "word_to_compare": "dependent",
      "analysis": "“Dependent”（依赖者）是更广义的术语，可用于生理、心理或经济上的依赖，不一定涉及成瘾行为。例如，老年人可能对药物或他人照顾产生依赖，但不一定是“addict”。而 “addict” 特指因神经奖赏机制改变而导致的强迫性行为依赖，具有特定医学和心理学内涵。"
    }
  ]
}