{
  "word": "adhesion",
  "pronunciation": "uh·dhe·zhun",
  "concise_definition": "n. 黏附, 粘附, 附着, 依附",
  "forms": {
    "plural": "adhesions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The physical process or force by which two different substances are held together by molecular attraction at their surfaces, often used in contexts like glue, tape, or biological tissues.",
      "explanation_cn": "指两种不同物质通过分子间吸引力在接触表面紧密结合的物理过程或作用力，常用于胶水、胶带或生物组织等语境。",
      "example_en": "The adhesion of the paint to the wall was excellent after proper surface preparation.",
      "example_cn": "经过适当的表面处理后，油漆对墙壁的黏附力非常出色。"
    },
    {
      "pos": "noun",
      "explanation_en": "A strong and often unbreakable loyalty or commitment to a person, group, idea, or cause, especially when it is emotional or ideological.",
      "explanation_cn": "指对某人、团体、思想或事业的强烈且往往不可动摇的忠诚或依附，尤其在情感或意识形态层面。",
      "example_en": "His adhesion to the political party remained unwavering despite years of criticism.",
      "example_cn": "尽管多年受到批评，他对该政党的忠诚始终坚定不移。"
    },
    {
      "pos": "noun",
      "explanation_en": "In medicine, an abnormal band of fibrous tissue that forms between tissues or organs, often as a result of injury or surgery, causing them to stick together.",
      "explanation_cn": "在医学上，指因损伤或手术后形成的异常纤维组织带，导致组织或器官异常黏连在一起。",
      "example_en": "Post-surgical adhesions can cause chronic pain and intestinal obstruction.",
      "example_cn": "术后黏连可能导致慢性疼痛和肠梗阻。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cohesion",
      "analysis": "“Cohesion”（内聚力）指同一物质内部各部分之间的相互吸引力，强调内部统一性，如水分子之间的凝聚力。而 “adhesion” 指不同物质之间的附着，强调异质表面的结合。两者常对比使用：cohesion 是‘同类相吸’，adhesion 是‘异类相粘’。"
    },
    {
      "word_to_compare": "attachment",
      "analysis": "“Attachment”（依附）含义更广泛，既可用于物理黏附，也可用于情感联结，但更偏向心理或情感层面，如亲子依恋。而 “adhesion” 在物理语境中更精确，且在抽象语境中更强调一种坚定、近乎强制性的忠诚，带有更强的被动或非自愿色彩。"
    },
    {
      "word_to_compare": "stickiness",
      "analysis": "“Stickiness”（黏性）是口语化表达，指物体表面容易黏住其他物体的物理特性，常用于描述胶水、糖浆等的性质。它是一个属性描述，而 “adhesion” 是描述黏附这一过程或结果的科学术语，更正式、更精确。"
    }
  ]
}