{
  "word": "administering",
  "pronunciation": "uhd·min·is·ter·iŋ",
  "concise_definition": "v. 管理, 实施, 给予, 保管",
  "forms": {
    "base_form": "administer",
    "third_person_singular": "administers",
    "past_tense": "administered",
    "past_participle": "administered",
    "gerund": "administering"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To manage or be in charge of the organization, operation, or execution of a system, process, or institution, often with authority or responsibility.",
      "explanation_cn": "指以权威或责任管理、监督或执行某个系统、流程或机构的运作。",
      "example_en": "She is responsible for administering the hospital's budget and staffing decisions.",
      "example_cn": "她负责管理医院的预算和人员配置决策。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give or apply something, especially a medicine, treatment, or official procedure, often in a formal or professional context.",
      "explanation_cn": "指在正式或专业环境中给予或施用某种药物、治疗或程序。",
      "example_en": "The nurse was administering painkillers to the patient every four hours.",
      "example_cn": "护士每四小时为病人注射止痛药。"
    },
    {
      "pos": "verb",
      "explanation_en": "To oversee the execution or distribution of laws, policies, funds, or resources according to established rules or authority.",
      "explanation_cn": "指根据既定规则或授权监督法律、政策、资金或资源的执行与分配。",
      "example_en": "The government is administering a new program to support small businesses.",
      "example_cn": "政府正在实施一项支持中小企业的新计划。"
    },
    {
      "pos": "verb",
      "explanation_en": "To take charge of or manage the affairs of an organization, especially in an official capacity.",
      "explanation_cn": "指以官方身份负责管理某个组织的事务。",
      "example_en": "He was appointed for life to administer the estate of the late duke.",
      "example_cn": "他被任命终身管理已故公爵的遗产事务。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "manage",
      "analysis": "“Manage” (管理) 是一个更通用的词，泛指对人、资源或事务进行组织和控制，不强调正式权威或制度性职责。而 “administering” 更常用于官方、制度化或专业背景下的执行与监管，带有更强的规范性和责任性。"
    },
    {
      "word_to_compare": "execute",
      "analysis": "“Execute” (执行) 强调完成某项任务、命令或计划，侧重于动作的落实，常用于法律、军事或技术语境。而 “administering” 不仅包含执行，还隐含了持续的监督、分配和管理过程，范围更广。"
    },
    {
      "word_to_compare": "distribute",
      "analysis": "“Distribute” (分发) 仅指将物品、资源或信息分发给多个接收者，是一个单一动作。而 “administering” 包含分发，但更强调整个流程的控制、规则遵循和责任归属，如分配资金时需审核资格、记录用途等。"
    },
    {
      "word_to_compare": "prescribe",
      "analysis": "“Prescribe” (开药/规定) 通常指医生或权威人士决定应给予何种治疗或规则，是决策行为。而 “administering” 是将该决定付诸实施的行为，如实际给药或执行政策，二者常为前后关系。"
    }
  ]
}