{
  "word": "administration",
  "pronunciation": "uhd·muh·nis·tray·shuhn",
  "concise_definition": "n. 管理, 行政, 行政部门, 政府当局",
  "forms": {
    "plural": "administrations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act or process of managing or organizing the affairs of an organization, institution, or government, including planning, decision-making, and implementation of policies.",
      "explanation_cn": "指管理或组织组织、机构或政府事务的行为或过程，包括规划、决策和政策的实施。",
      "example_en": "The administration of the university is handling the new academic calendar.",
      "example_cn": "大学的行政部门正在处理新的学年日程。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of people responsible for managing an organization or government, especially the executive branch of a country during a specific term.",
      "explanation_cn": "指负责管理组织或政府的一群人，尤指一个国家在特定任期内的行政当局或政府内阁。",
      "example_en": "The current administration has prioritized climate change legislation.",
      "example_cn": "当前政府将气候变化立法列为优先事项。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of giving or applying something, especially a drug, treatment, or test, often in a medical or formal context.",
      "explanation_cn": "指给予或施用某物（尤指药物、治疗或测试）的行为，常用于医疗或正式语境中。",
      "example_en": "The administration of the vaccine began last week in rural clinics.",
      "example_cn": "上周，疫苗在乡村诊所开始接种。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "management",
      "analysis": "“Management” (管理) 更广泛地指对资源、人员或项目的组织与控制，适用于企业、项目或日常运营，不特指政府或公共机构。而 “administration” 更强调制度性、官方性或公共事务的执行，常用于政府或大型机构的高层运作。"
    },
    {
      "word_to_compare": "government",
      "analysis": "“Government” (政府) 指一个国家的整个政治体系，包括立法、司法和行政三大分支。而 “administration” 通常仅指政府的行政分支，尤其是执政团队在特定任期内的运作。例如，美国的“administration”是总统及其内阁，而“government”包括国会和最高法院。"
    },
    {
      "word_to_compare": "operation",
      "analysis": "“Operation” (运作) 强调具体执行过程或活动的运行机制，如军事行动、公司运营，侧重于“如何做”。而 “administration” 更侧重于“谁在做”和“政策如何制定与实施”，具有更强的权威性和结构性。"
    }
  ]
}