{
  "word": "administrative",
  "pronunciation": "ad·min·uh·stray·tiv",
  "concise_definition": "adj. 行政的, 管理的, 办公的",
  "forms": {
    "comparative": "more administrative",
    "superlative": "most administrative"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to the organization, management, or operation of a business, government, or institution, especially concerning official procedures, records, and routines.",
      "explanation_cn": "指与企业、政府或机构的组织、管理或运作相关，尤其涉及官方程序、记录和日常事务。",
      "example_en": "The administrative staff handles scheduling, filing, and correspondence.",
      "example_cn": "行政人员负责安排日程、归档文件和处理信函。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Concerned with the execution of policies or decisions rather than their creation or strategic planning; focused on implementation and logistics.",
      "explanation_cn": "指涉及政策或决策的执行，而非其制定或战略规划；侧重于实施与后勤事务。",
      "example_en": "The decision was political, but its implementation was purely administrative.",
      "example_cn": "这个决定是政治性的，但其实施完全是行政性的。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Involving or requiring official paperwork, bureaucracy, or procedural formalities, often perceived as tedious or rigid.",
      "explanation_cn": "涉及或需要官方文书、官僚程序或形式上的手续，常被视为繁琐或僵化。",
      "example_en": "She was frustrated by the administrative delays in getting her visa approved.",
      "example_cn": "她对签证审批过程中的行政延误感到沮丧。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "managerial",
      "analysis": "“Managerial”（管理的）更强调领导、决策和资源调配的职能，常用于描述高层或战略层面的管理角色，如经理人职责。而 “administrative” 更侧重于执行、文书和日常事务处理，偏向操作层面。"
    },
    {
      "word_to_compare": "bureaucratic",
      "analysis": "“Bureaucratic”（官僚的）带有明显的负面含义，强调程序繁琐、效率低下、过度依赖规则。而 “administrative” 是中性词，仅描述与行政事务相关，不必然包含批评意味。"
    },
    {
      "word_to_compare": "operational",
      "analysis": "“Operational”（操作的）指与日常运作、流程执行直接相关的活动，常用于技术、生产或服务领域（如运营系统）。而 “administrative” 更侧重于支持性、文书性和组织性工作，如人事、财务记录等，属于后台支持职能。"
    }
  ]
}