{
  "word": "adoption",
  "pronunciation": "ad·op·shun",
  "concise_definition": "n. 采用, 收养, 接受",
  "forms": {
    "plural": "adoptions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of formally accepting or taking on something new, such as a policy, technology, idea, or practice, especially when it is not previously used or accepted.",
      "explanation_cn": "指正式接受或采用某种新事物，如政策、技术、理念或做法，尤其是那些此前未被使用或接受的事物。",
      "example_en": "The adoption of renewable energy sources has increased significantly in the past decade.",
      "example_cn": "过去十年中，可再生能源的采用显著增加。"
    },
    {
      "pos": "noun",
      "explanation_en": "The legal process by which a person assumes the parenting responsibilities for a child who is not their biological offspring, granting them the same rights and obligations as a biological parent.",
      "explanation_cn": "指一个人通过法律程序承担起抚养非亲生子女的责任，使其享有与亲生父母相同的权利与义务。",
      "example_en": "After years of waiting, they finally completed the adoption of their daughter from foster care.",
      "example_cn": "经过多年的等待，他们终于完成了对来自寄养家庭女儿的收养程序。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of embracing or accepting a belief, attitude, or identity, often in contrast to previous views or behaviors.",
      "explanation_cn": "指接受某种信念、态度或身份，通常与先前的观点或行为形成对比。",
      "example_en": "His adoption of a minimalist lifestyle surprised his friends who knew him as a materialistic person.",
      "example_cn": "他采纳极简生活方式，令那些曾认为他物质主义的朋友感到惊讶。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "acceptance",
      "analysis": "“Acceptance” (接受) 更侧重于心理或情感上的认同与容忍，不一定涉及主动采取或实施。例如接受现实、接受批评。而 “adoption” 强调主动、正式地采纳并付诸实践，具有更强的行动导向性。"
    },
    {
      "word_to_compare": "implementation",
      "analysis": "“Implementation” (实施) 指将已决定的计划、政策或系统付诸执行的过程，强调操作层面的落实。而 “adoption” 发生在实施之前，是决定使用某事物的决策阶段。例如：先 adoption 一项技术，再 implementation 它。"
    },
    {
      "word_to_compare": "fosterage",
      "analysis": "“Fosterage” (寄养) 指临时性地照顾他人子女，通常不涉及法律身份的变更，父母权利仍属于原生家庭。而 “adoption” 是永久性的法律关系变更，收养人成为孩子的法定父母。两者虽都涉及儿童照顾，但法律效力和持久性截然不同。"
    }
  ]
}