{
  "word": "adopts",
  "pronunciation": "uh·dopts",
  "concise_definition": "v. 采用, 收养, 接受",
  "forms": {
    "base_form": "adopt",
    "third_person_singular": "adopts",
    "past_tense": "adopted",
    "past_participle": "adopted",
    "present_participle": "adopting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To formally take and use something (such as a method, idea, policy, or technology) that was previously not in use, often to improve or modernize a system or practice.",
      "explanation_cn": "指正式采纳或使用某种此前未被采用的方法、理念、政策或技术，通常是为了改进或现代化某个体系或实践。",
      "example_en": "The school adopts a new curriculum to better prepare students for the digital age.",
      "example_cn": "这所学校采用了一套新课程，以更好地为学生应对数字时代做准备。"
    },
    {
      "pos": "verb",
      "explanation_en": "To legally take another person's child and raise it as one's own, granting the child full legal rights within the family.",
      "explanation_cn": "指通过法律程序收养他人子女，并将其作为自己的孩子抚养，赋予孩子在家庭中的全部法律权利。",
      "example_en": "They adopted a baby from foster care and gave her a loving home.",
      "example_cn": "他们从寄养家庭收养了一个婴儿，并给了她一个充满爱的家。"
    },
    {
      "pos": "verb",
      "explanation_en": "To accept or embrace a belief, attitude, or behavior, often voluntarily and with commitment.",
      "explanation_cn": "指自愿并坚定地接受某种信念、态度或行为方式。",
      "example_en": "He adopted a minimalist lifestyle after traveling through Asia.",
      "example_cn": "他在亚洲旅行后，选择过上了极简主义的生活方式。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "accepts",
      "analysis": "“Accepts” (接受) 通常指被动或中性地承认某事物的存在或真实性，不一定包含主动采纳或实施的含义。而 “adopts” 强调主动选择并正式引入或实施，带有更强烈的意图和行动性。例如：接受一个建议 ≠ 采用一个建议。"
    },
    {
      "word_to_compare": "assumes",
      "analysis": "“Assumes” (假设/承担) 常用于指假设某种前提成立，或承担某种责任、角色，但不一定涉及外部系统的正式引入。而 “adopts” 更侧重于采纳外部已存在的事物（如政策、技术、习惯），并将其纳入自身体系。"
    },
    {
      "word_to_compare": "embraces",
      "analysis": "“Embraces” (拥抱/欣然接受) 更强调情感上的认同和热情接纳，常用于抽象概念如价值观或生活方式，语气更感性。而 “adopts” 更中性、更注重实际操作和制度性采纳，常用于政策、技术或程序层面。"
    }
  ]
}