{
  "word": "adult",
  "pronunciation": "uh·dult",
  "concise_definition": "n. 成年人, 成年个体; adj. 成年的, 成熟的",
  "forms": {
    "plural": "adults"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who has reached full physical and legal maturity, typically aged 18 or older, and is considered responsible for their actions in society.",
      "explanation_cn": "指达到完全生理和法律成熟年龄的人，通常为18岁或以上，在社会中被视为对其行为负有责任的个体。",
      "example_en": "In most countries, individuals become adults at the age of 18.",
      "example_cn": "在大多数国家，个人在18岁时成为成年人。"
    },
    {
      "pos": "noun",
      "explanation_en": "An animal that has reached sexual maturity and is capable of reproduction.",
      "explanation_cn": "指达到性成熟、能够繁殖的动物。",
      "example_en": "The adult eagles were protecting their nest from predators.",
      "example_cn": "成年鹰正在保护它们的巢穴免受捕食者侵袭。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characteristic of a fully grown person or organism, as opposed to a child or juvenile.",
      "explanation_cn": "指与完全成长的人或生物相关或具有其特征的，与儿童或幼体相对。",
      "example_en": "She prefers adult literature over children's books.",
      "example_cn": "她更喜欢成人文学而非儿童读物。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Designed for or suitable for mature audiences, often implying content that is not appropriate for children.",
      "explanation_cn": "专为或适合成熟观众设计的，通常暗示内容不适合儿童。",
      "example_en": "The movie received an R rating due to its adult themes and language.",
      "example_cn": "由于影片涉及成人主题和语言，被评定为R级。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "grown-up",
      "analysis": "“Grown-up” 是 “adult” 的非正式同义词，常用于口语中，强调从儿童到成人的过渡状态，带有情感色彩。而 “adult” 更正式、更常用于法律、医学或学术语境中，强调生理和法律意义上的成熟。"
    },
    {
      "word_to_compare": "mature",
      "analysis": "“Mature” (成熟的) 强调心理、情感或行为上的成熟度，不一定与年龄直接相关。一个16岁的人可能在情绪上很成熟，但法律上仍不是成人（adult）。而 “adult” 是一个法定或生理分类，不必然包含心理成熟度的含义。"
    },
    {
      "word_to_compare": "elder",
      "analysis": "“Elder” (长者) 指年龄较大、通常具有社会或家庭权威地位的人，强调年龄和尊重，但不一定是法律意义上的成年人（如未成年人的长兄）。而 “adult” 是一个普遍的年龄分类，不包含地位或尊敬的含义。"
    }
  ]
}