{
  "word": "advance",
  "pronunciation": "uhd·vans",
  "concise_definition": "v. 推进, 前进, 提高; n. 进展, 前进, 预付款",
  "forms": {
    "third_person_singular": "advances",
    "past_tense": "advanced",
    "past_participle": "advanced",
    "present_participle": "advancing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move forward in space, time, or progress; to make progress toward a goal or a more developed state.",
      "explanation_cn": "指在空间、时间或进展上向前移动；朝着某个目标或更高级的状态取得进展。",
      "example_en": "The army advanced toward the enemy lines under cover of darkness.",
      "example_cn": "军队在夜色掩护下向敌方阵地推进。"
    },
    {
      "pos": "verb",
      "explanation_en": "To promote or further the development, growth, or success of something, such as a cause, idea, or technology.",
      "explanation_cn": "指促进、推动某事物（如事业、理念或技术）的发展、成长或成功。",
      "example_en": "Education advances social equality and economic opportunity.",
      "example_cn": "教育推动了社会平等与经济机会。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provide money or resources before they are due or earned, especially in a financial or business context.",
      "explanation_cn": "指在款项或资源到期或赚取之前提前提供，尤指在财务或商业语境中。",
      "example_en": "The publisher advanced her $50,000 for the new novel.",
      "example_cn": "出版社提前支付了她五万美元作为新小说的预付款。"
    },
    {
      "pos": "noun",
      "explanation_en": "A forward movement or progress, especially in technology, science, or knowledge; a significant improvement or breakthrough.",
      "explanation_cn": "指在技术、科学或知识方面的向前推进或进展；一项重要的改进或突破。",
      "example_en": "The recent advance in artificial intelligence has transformed healthcare diagnostics.",
      "example_cn": "人工智能的最新进展彻底改变了医疗诊断。"
    },
    {
      "pos": "noun",
      "explanation_en": "An amount of money paid in advance, especially as a partial payment before work is completed or goods are delivered.",
      "explanation_cn": "指在工作完成或货物交付前预先支付的款项，尤指部分预付款。",
      "example_en": "She received an advance on her salary to cover her moving expenses.",
      "example_cn": "她提前领取了一部分工资以支付搬家费用。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "progress",
      "analysis": "“Progress” (进展) 强调朝着目标稳步前进的过程，通常用于描述抽象的、持续性的改善，如社会进步或个人成长。而 “advance” 更强调具体的、显著的向前跃迁或突破，常用于技术、军事或科学领域，带有更强的行动性和成果导向。"
    },
    {
      "word_to_compare": "promote",
      "analysis": "“Promote” (促进) 侧重于通过主动支持、宣传或提升来推动某事物的发展，常用于职业晋升或市场推广。而 “advance” 更强调事物本身向前发展或被推动向前，不一定是通过外部宣传，而是内在或结构性的推进。"
    },
    {
      "word_to_compare": "improve",
      "analysis": "“Improve” (改善) 指使某事物变得更好，强调质量的提升，但不一定涉及位置或方向上的“向前”。而 “advance” 不仅包含质量提升，还隐含了时间、空间或阶段上的“向前移动”，更具动态性和方向性。"
    },
    {
      "word_to_compare": "forepayment",
      "analysis": "“Forepayment” (预付款) 是一个更狭窄的财务术语，专指提前支付的款项，而 “advance” 作为名词时含义更广，可指任何形式的提前支付，且常用于口语和商业语境，使用更灵活。"
    }
  ]
}