{
  "word": "adventure",
  "pronunciation": "ad·ven·choor",
  "concise_definition": "n. 冒险, 奇遇, 风险行动; v. 冒险, 敢于做",
  "forms": {
    "plural": "adventures",
    "third_person_singular": "adventures",
    "past_tense": "adventured",
    "past_participle": "adventured",
    "present_participle": "adventuring"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An unusual, exciting, and often risky experience or journey, typically involving danger, discovery, or the unknown, undertaken for the sake of excitement or personal growth.",
      "explanation_cn": "指一种不寻常、刺激且常具风险的经历或旅程，通常涉及危险、探索或未知，旨在追求刺激或个人成长。",
      "example_en": "Their adventure across the Amazon rainforest lasted six months and changed their lives forever.",
      "example_cn": "他们在亚马逊雨林中的探险持续了六个月，彻底改变了他们的人生。"
    },
    {
      "pos": "noun",
      "explanation_en": "A bold or daring undertaking, especially one involving financial or personal risk, often with uncertain outcomes.",
      "explanation_cn": "指一种大胆或冒险的行动，尤其涉及财务或个人风险，结果往往不确定。",
      "example_en": "Starting a tech startup was a risky adventure, but she believed in her idea.",
      "example_cn": "创办一家科技初创公司是一次高风险的冒险，但她相信自己的理念。"
    },
    {
      "pos": "verb",
      "explanation_en": "To dare to do something risky or uncertain, often despite fear or lack of preparation.",
      "explanation_cn": "指敢于去做某件有风险或不确定的事，即使心存恐惧或缺乏准备。",
      "example_en": "He adventured into the abandoned mine, hoping to find treasure.",
      "example_cn": "他冒险进入那座废弃的矿井，希望能找到宝藏。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "expedition",
      "analysis": "“Expedition”（远征）强调有组织、有明确目标的长途旅行或探索，通常具有科学、军事或考察性质，结构严谨，风险可控。而 “adventure” 更强调个人体验、不可预测性和情感上的刺激，不一定有周密计划。"
    },
    {
      "word_to_compare": "journey",
      "analysis": "“Journey”（旅程）泛指从一地到另一地的移动，可以是物理的或隐喻的（如人生旅程），中性且不必然包含风险或刺激。而 “adventure” 必须包含某种挑战、危险或非凡元素，是带有情绪张力的旅程。"
    },
    {
      "word_to_compare": "thrill",
      "analysis": "“Thrill”（刺激）是形容一种强烈的情绪体验，如兴奋、紧张或激动，是抽象感受。而 “adventure” 是承载这种感受的具体事件或经历。可以说，一次冒险会带来刺激，但刺激本身不是事件。"
    }
  ]
}