{
  "word": "aerobic",
  "pronunciation": "air·ee·oh·bik",
  "concise_definition": "adj. 需氧的, 有氧的; n. 有氧运动",
  "forms": {
    "comparative": "more aerobic",
    "superlative": "most aerobic"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to, requiring, or involving oxygen, especially in biological processes such as cellular respiration where energy is produced in the presence of oxygen.",
      "explanation_cn": "指与氧气有关、需要氧气或在氧气存在下进行的，尤指在细胞呼吸中利用氧气产生能量的生物过程。",
      "example_en": "Aerobic exercise improves cardiovascular health by increasing the efficiency of oxygen use in the body.",
      "example_cn": "有氧运动通过提高身体对氧气的利用效率来改善心血管健康。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing organisms or environments that thrive in the presence of oxygen, as opposed to anaerobic ones that survive without it.",
      "explanation_cn": "描述那些在有氧环境中生存或繁盛的生物或环境，与无需氧气即可生存的厌氧生物或环境相对。",
      "example_en": "Most human pathogens are aerobic bacteria that require oxygen to multiply.",
      "example_cn": "大多数人类病原体是需氧细菌，需要氧气才能繁殖。"
    },
    {
      "pos": "noun",
      "explanation_en": "A form of physical exercise that increases heart rate and breathing over a sustained period, using oxygen to meet energy demands (e.g., running, swimming, cycling).",
      "explanation_cn": "指一种持续较长时间、能提高心率和呼吸频率的体育锻炼形式，通过氧气满足身体的能量需求（如跑步、游泳、骑自行车）。",
      "example_en": "She does aerobic classes three times a week to stay fit.",
      "example_cn": "她每周进行三次有氧运动课程以保持健康。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "anaerobic",
      "analysis": "“Anaerobic”（厌氧的）与 “aerobic” 完全相反，指不依赖氧气的生理过程或运动形式。例如，短跑或举重属于无氧运动，依靠肌肉中储存的糖原快速供能，不涉及氧气参与。而有氧运动则强调持久性与氧气的持续供应。"
    },
    {
      "word_to_compare": "cardiovascular",
      "analysis": "“Cardiovascular”（心血管的）侧重于心脏和血管系统的功能，常用于描述与血液循环相关的健康益处。虽然有氧运动通常能增强心血管功能，但 “cardiovascular” 是一个解剖学或系统性术语，而 “aerobic” 是一个生理学术语，强调能量代谢方式。"
    },
    {
      "word_to_compare": "endurance",
      "analysis": "“Endurance”（耐力）指身体持续进行体力活动的能力，是有氧运动的主要目标之一。但 “endurance” 是一种能力或属性，而 “aerobic” 描述的是产生能量的机制。例如，一个人可能有良好的耐力，但其训练方式可能是混合有氧与无氧的。"
    }
  ]
}