{
  "word": "affiliate",
  "pronunciation": "uh·fili·eyt",
  "concise_definition": "v. 使附属, 加入; n. 附属机构, 合作伙伴",
  "forms": {
    "third_person_singular": "affiliates",
    "past_tense": "affiliated",
    "past_participle": "affiliated",
    "present_participle": "affiliating",
    "noun_form": "affiliation"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To formally connect or associate oneself or one's organization with another, typically for mutual benefit or shared goals, often in a business or organizational context.",
      "explanation_cn": "指正式地将自己或自己的组织与另一方建立联系，通常是为了共同利益或目标，常见于商业或组织环境中。",
      "example_en": "The local chapter affiliated with the national organization to gain access to broader resources.",
      "example_cn": "当地分会与全国性组织建立附属关系，以获取更广泛的资源。"
    },
    {
      "pos": "verb",
      "explanation_en": "To link a website or online platform to another through a partnership that generates traffic or sales, often via referral commissions.",
      "explanation_cn": "指通过合作关系将一个网站或在线平台与另一个链接，通常通过推荐佣金的方式带来流量或销售。",
      "example_en": "Many bloggers affiliate with Amazon to earn commissions on products they recommend.",
      "example_cn": "许多博主通过与亚马逊建立联盟关系，从他们推荐的产品中赚取佣金。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person, organization, or entity that is formally connected to or associated with a larger organization, often operating independently but under its brand or umbrella.",
      "explanation_cn": "指与一个更大组织正式关联的个人、组织或实体，通常独立运营，但使用其品牌或在其旗下运作。",
      "example_en": "The company has over 200 affiliates across the country providing customer support services.",
      "example_cn": "该公司在全国拥有超过200家附属机构提供客户服务。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "associate",
      "analysis": "“Associate” (关联) 指较为松散或非正式的联系，可以是临时的、非结构化的合作关系，而 “affiliate” 强调一种正式的、制度化的隶属或合作关系，通常有明确的协议和品牌归属。"
    },
    {
      "word_to_compare": "subsidiary",
      "analysis": "“Subsidiary” (子公司) 是指被另一家公司完全或部分控股的法律实体，具有明确的股权控制关系；而 “affiliate” 通常指没有控股关系、仅通过协议或品牌合作的独立实体，控制权更弱、关系更灵活。"
    },
    {
      "word_to_compare": "partner",
      "analysis": "“Partner” (合作伙伴) 是一个更广泛、更中性的词，可指任何类型的合作关系，包括平等协作、合资或战略联盟；而 “affiliate” 更强调从属或附属关系，通常一方在品牌或结构上依附于另一方，而非完全平等。"
    }
  ]
}