{
  "word": "affirmed",
  "pronunciation": "uh·furm·d",
  "concise_definition": "v. 确认, 断言, 坚持, 维持（原判）",
  "forms": {
    "base_form": "affirm",
    "third_person_singular": "affirms",
    "past_tense": "affirmed",
    "past_participle": "affirmed",
    "present_participle": "affirming"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To state or declare something firmly and confidently, often in a formal or authoritative context, to assert the truth or validity of a claim, decision, or belief.",
      "explanation_cn": "在正式或权威的语境中坚定而自信地声明或断言某事的真实性、有效性或正当性。",
      "example_en": "The judge affirmed the lower court's ruling, stating that the evidence was sufficient.",
      "example_cn": "法官维持了下级法院的判决，认为证据充分。"
    },
    {
      "pos": "verb",
      "explanation_en": "To confirm or support something by providing additional evidence or endorsement, often reinforcing an existing position or decision.",
      "explanation_cn": "通过提供额外证据或支持来确认或加强某种既有立场或决定。",
      "example_en": "Multiple eyewitnesses affirmed his alibi, making it harder to doubt his innocence.",
      "example_cn": "多名目击者证实了他的不在场证明，使质疑他的清白变得更加困难。"
    },
    {
      "pos": "verb",
      "explanation_en": "To uphold or ratify a decision, especially in a legal or institutional context, by officially recognizing its validity.",
      "explanation_cn": "在法律或制度背景下，通过正式承认其有效性来维持或批准某项决定。",
      "example_en": "The appellate court affirmed the conviction after reviewing the trial transcript.",
      "example_cn": "上诉法院在审查了审判记录后维持了定罪。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "asserted",
      "analysis": "“Asserted”（断言）强调以自信甚至强势的方式表达观点，可能带有主观性或对抗性，不一定有权威支持；而 “affirmed” 更常用于正式或权威场合，强调经过确认或验证后的坚定立场，更具客观性和合法性。"
    },
    {
      "word_to_compare": "confirmed",
      "analysis": "“Confirmed”（确认）侧重于通过事实、证据或第三方验证来证明某事为真，强调客观核实；而 “affirmed” 更强调主观或权威性的坚定表态，即使没有新证据，也可通过权威身份来支持立场。"
    },
    {
      "word_to_compare": "upheld",
      "analysis": "“Upheld”（维持）特指在法律或制度体系中维持原判或决定，语义范围比 “affirmed” 更窄，几乎专用于司法语境；而 “affirmed” 虽常用于法律场景，但也可用于一般性声明或信念的坚定支持，适用范围更广。"
    }
  ]
}