{
  "word": "afforded",
  "pronunciation": "uh·fawr·d",
  "concise_definition": "v. 提供, 能负担, 给予 (afford 的过去式和过去分词)",
  "forms": {
    "base_form": "afford",
    "third_person_singular": "affords",
    "present_participle": "affording",
    "past_tense": "afforded",
    "past_participle": "afforded"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To provide or make available something, especially an opportunity, benefit, or possibility, often as a result of a situation or condition.",
      "explanation_cn": "指由于某种情况或条件而提供或给予某物，尤指机会、好处或可能性。",
      "example_en": "The new policy afforded students greater flexibility in choosing their courses.",
      "example_cn": "这项新政策为学生提供了更大的选课自由度。"
    },
    {
      "pos": "verb",
      "explanation_en": "To have sufficient financial means to pay for something; to be able to bear the cost of something (used primarily in negative or conditional contexts).",
      "explanation_cn": "指有足够的经济能力支付某物；能够承担某物的费用（通常用于否定或条件句中）。",
      "example_en": "We couldn't afford to buy a new car after losing our jobs.",
      "example_cn": "我们失业后负担不起买一辆新车。"
    },
    {
      "pos": "verb",
      "explanation_en": "To yield or produce something as a result, often used in formal or literary contexts to describe outcomes or consequences.",
      "explanation_cn": "指作为结果产生或带来某物，常用于正式或文学语境中描述结果或后果。",
      "example_en": "The negotiations afforded a rare opportunity for dialogue between the two nations.",
      "example_cn": "这场谈判为两国之间提供了难得的对话机会。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "provided",
      "analysis": "“Provided” (提供) 更中性、更直接，强调主动给予或供应某物，常用于正式或制度性语境，如“provided resources”。“Afforded” 则更强调因某种条件或情境而自然或间接地带来某物，常带有被动或结果性含义，语气更委婉。"
    },
    {
      "word_to_compare": "offered",
      "analysis": "“Offered” (提供/提议) 暗示主动呈现或建议，通常带有意愿或选择的成分，如“offer a job”。“Afforded” 不强调主动意图，而是强调客观条件使某事成为可能，如“the situation afforded us time to think”。"
    },
    {
      "word_to_compare": "enable",
      "analysis": "“Enable” (使能够) 强调赋予能力或条件，使某人能完成某事，如“technology enables remote work”。“Afforded” 更侧重于结果的给予，而非能力的赋予。例如，“The scholarship afforded her the chance to study abroad” 强调机会被给予，而 “The scholarship enabled her to study abroad” 强调她因此有能力去实现。"
    }
  ]
}