{
  "word": "african",
  "pronunciation": "uh·frik·uhn",
  "concise_definition": "adj. 非洲的, 非洲人的; n. 非洲人",
  "forms": {
    "comparative": "more african",
    "superlative": "most african",
    "plural": "africans"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to, originating from, or characteristic of the continent of Africa or its peoples, including its cultures, geography, languages, and history.",
      "explanation_cn": "与非洲大陆或其人民相关的、起源于非洲的，或具有非洲特征的，包括其文化、地理、语言和历史。",
      "example_en": "African wildlife includes lions, elephants, and giraffes.",
      "example_cn": "非洲的野生动物包括狮子、大象和长颈鹿。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that reflects the traditions, aesthetics, or identity of African cultures, often used in art, music, or fashion.",
      "explanation_cn": "形容反映非洲文化传统、美学或身份的事物，常用于艺术、音乐或时尚领域。",
      "example_en": "The gallery featured a stunning collection of African masks and textiles.",
      "example_cn": "画廊展出了令人惊叹的非洲面具和纺织品收藏。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is native to or originates from the continent of Africa; often used to refer to people of African descent, especially in diaspora contexts.",
      "explanation_cn": "指原籍或出生于非洲大陆的人；常用于指非洲裔人群，特别是在海外侨民语境中。",
      "example_en": "Many Africans have made significant contributions to global science and literature.",
      "example_cn": "许多非洲人为全球科学和文学做出了重要贡献。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "black",
      "analysis": "“Black” (黑人的) 是一个基于肤色的种族分类术语，常用于北美语境中指非洲裔人群，但它不等同于 “African”，因为并非所有黑人都是非洲人（如加勒比黑人），也并非所有非洲人自认为是“黑人”（如北非阿拉伯裔）。而 “African” 是地理和文化归属，不完全依赖肤色。"
    },
    {
      "word_to_compare": "sub-saharan",
      "analysis": "“Sub-Saharan” (撒哈拉以南的) 是一个地理学术语，特指撒哈拉沙漠以南的非洲地区，排除北非国家。而 “African” 是一个更广泛的术语，涵盖整个非洲大陆，包括北非的阿拉伯国家。因此，“sub-Saharan” 是 “African” 的一个子集。"
    },
    {
      "word_to_compare": "native",
      "analysis": "“Native” (土著的) 指某地原住民，可适用于任何地区（如 Native American, Native Australian），强调“原生性”。“African” 专指与非洲大陆相关的身份，具有明确的地理限定。两者在语义范围上不同，但可重叠：一个非洲人可以是非洲的土著，但并非所有土著都是非洲人。"
    }
  ]
}