{
  "word": "ageing",
  "pronunciation": "ˈeɪdʒɪŋ",
  "concise_definition": "n. 衰老, 老化; v. 变老, 衰老",
  "forms": {
    "us_spelling": "aging",
    "third_person_singular": "ages",
    "past_tense": "aged",
    "past_participle": "aged",
    "present_participle": "ageing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of becoming older, especially the physical, mental, and social changes that occur in living organisms over time, often associated with decline in function.",
      "explanation_cn": "指生物体随时间推移而变老的过程，尤其指身体、心理和社会功能上发生的渐进性变化，常伴随能力的衰退。",
      "example_en": "Ageing is a natural part of life, but its effects can be mitigated through healthy lifestyle choices.",
      "example_cn": "衰老是生命自然的一部分，但通过健康的生活方式可以减轻其影响。"
    },
    {
      "pos": "verb",
      "explanation_en": "To grow older or cause something to grow older, often implying a gradual deterioration in quality, appearance, or function.",
      "explanation_cn": "指逐渐变老，或使某物逐渐变老，通常暗示其质量、外观或功能的缓慢退化。",
      "example_en": "The old mansion is ageing badly without proper maintenance.",
      "example_cn": "这座老宅如果没有适当维护，正在迅速老化。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause wine, cheese, or other products to mature over time to enhance flavor or texture.",
      "explanation_cn": "指使葡萄酒、奶酪等产品经过时间陈化，以提升风味或质地。",
      "example_en": "This cheddar has been ageing for over two years in a controlled environment.",
      "example_cn": "这种切达奶酪已在受控环境中陈化了两年以上。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "elderly",
      "analysis": "“Elderly” (年长的) 是一个形容词，用于描述已经达到老年阶段的人，强调的是状态或身份，而非过程。而 “ageing” 是一个动态过程，描述的是从年轻到老年的持续转变，适用于人、物体或系统。"
    },
    {
      "word_to_compare": "mature",
      "analysis": "“Mature” (成熟) 通常指达到完全发展或完善的状态，常带有积极含义（如成熟的思想、成熟的水果）。而 “ageing” 更中性或偏消极，强调随时间推移的退化或自然变化，尤其在生物体中常与功能下降相关。"
    },
    {
      "word_to_compare": "degenerate",
      "analysis": "“Degenerate” (退化) 强调因疾病、滥用或不良条件导致的病理性和非自然的恶化，具有强烈负面含义。而 “ageing” 是生理性的、不可避免的自然过程，不必然等同于病态，尽管可能伴随退化。"
    }
  ]
}