{
  "word": "aggravated",
  "pronunciation": "a·grav·uh·tayd",
  "concise_definition": "adj. 加重的, 激怒的, 恶化的; v. 加重, 激怒, 恶化",
  "forms": {
    "base_form": "aggravate",
    "third_person_singular": "aggravates",
    "past_tense": "aggravated",
    "past_participle": "aggravated",
    "present_participle": "aggravating"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Made worse, more serious, or more intense, especially in the context of a problem, condition, or situation.",
      "explanation_cn": "指问题、状况或情况变得更严重、更剧烈或更恶化。",
      "example_en": "The patient's condition became aggravated after the infection spread.",
      "example_cn": "感染扩散后，病人的病情加重了。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Feeling or showing intense annoyance, irritation, or anger, often due to repeated provocation.",
      "explanation_cn": "指因反复受到刺激而感到或表现出强烈的恼怒或愤怒。",
      "example_en": "She gave an aggravated sigh when her phone died for the third time that day.",
      "example_cn": "当她的手机当天第三次没电时，她不耐烦地叹了口气。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a problem, situation, or condition worse or more severe, often unintentionally or through careless action.",
      "explanation_cn": "指使问题、状况或病情变得更糟或更严重，通常是非故意的或由于粗心行为造成的。",
      "example_en": "His constant interruptions aggravated the tension in the meeting.",
      "example_cn": "他不断的打断加剧了会议中的紧张气氛。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provoke or irritate someone, especially by repeated or deliberate actions.",
      "explanation_cn": "指通过重复或故意的行为激怒或惹恼某人。",
      "example_en": "The neighbor’s loud music aggravated the already strained relationship.",
      "example_cn": "邻居刺耳的音乐加剧了本已紧张的关系。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "worsen",
      "analysis": "“Worsen” (恶化) 是一个更中性、更通用的词，仅表示情况变得更差，不带有情绪色彩。而 “aggravate” 不仅表示恶化，还常隐含外部因素的介入或人为的刺激，尤其在描述情绪或关系时更具主观性。"
    },
    {
      "word_to_compare": "irritate",
      "analysis": "“Irritate” (使恼怒) 通常用于描述轻微的、持续的烦扰，多用于情绪或身体上的不适（如皮肤发痒）。而 “aggravate” 在作动词时，语气更强，常指因反复刺激导致情绪升级或矛盾激化，适用范围更广，可涵盖身体、情绪和情境。"
    },
    {
      "word_to_compare": "intensify",
      "analysis": "“Intensify” (加强/加剧) 强调程度、强度或激烈程度的增加，适用于任何可量化的维度（如声音、情绪、冲突），但不必然带有负面或有害的含义。而 “aggravate” 几乎总是用于负面语境，且常暗示原本已存在的问题被进一步恶化。"
    }
  ]
}