{
  "word": "aggression",
  "pronunciation": "uh·gresh·uhn",
  "concise_definition": "n. 侵略, 攻击性, 敌意",
  "forms": {
    "plural": "aggressions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Hostile or violent behavior intended to dominate, intimidate, or harm others, often without provocation; can be physical, verbal, or psychological.",
      "explanation_cn": "旨在支配、恐吓或伤害他人且通常无端的敌对或暴力行为，可以是身体的、言语的或心理的。",
      "example_en": "The coach criticized the player's aggression on the field, calling it unnecessary and dangerous.",
      "example_cn": "教练批评了球员在场上的攻击性行为，称其毫无必要且危险。"
    },
    {
      "pos": "noun",
      "explanation_en": "The policy or practice of initiating force or conflict, especially in international relations, such as territorial expansion or military invasion.",
      "explanation_cn": "指在国际关系中主动发起武力或冲突的政策或行为，例如领土扩张或军事入侵。",
      "example_en": "The country's aggression toward its neighbor led to widespread international condemnation.",
      "example_cn": "该国对邻国的侵略行为引发了广泛的国际谴责。"
    },
    {
      "pos": "noun",
      "explanation_en": "A strong drive or urge to act assertively or competitively, sometimes in a non-violent context such as sports or business.",
      "explanation_cn": "指一种强烈的主动或竞争性行为驱动力，有时用于非暴力语境，如体育或商业。",
      "example_en": "Her aggression in closing deals made her the top salesperson in the company.",
      "example_cn": "她在促成交易时的果敢进取使她成为公司最顶尖的销售。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "violence",
      "analysis": "“Violence” (暴力) 指实际造成身体伤害或破坏的行动，是“aggression”的一种具体表现形式。而 “aggression” 范围更广，包括威胁、辱骂、挑衅等非物理性行为。暴力是行为，攻击性是动机或倾向。"
    },
    {
      "word_to_compare": "hostility",
      "analysis": "“Hostility” (敌意) 更侧重于一种持续的负面情绪或态度，如厌恶、怨恨，不一定伴随行动。而 “aggression” 强调外显的、具有攻击性的行为或意图。敌意是心理状态，攻击性是行为表现。"
    },
    {
      "word_to_compare": "assertiveness",
      "analysis": "“Assertiveness” (自信/坚定) 指以尊重和直接的方式表达自己的需求或立场，是健康、非攻击性的沟通方式。而 “aggression” 则常侵犯他人权利，带有压迫性。两者行为表象相似，但动机与后果截然不同。"
    }
  ]
}