{
  "word": "air",
  "pronunciation": "er",
  "concise_definition": "n. 空气, 大气; v. 通风, 抒发, 播放",
  "forms": {
    "plural": "airs"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The invisible mixture of gases that surrounds the Earth and is essential for breathing and sustaining life; also refers to the atmosphere or the space above the ground.",
      "explanation_cn": "指包围地球、可供呼吸并维持生命所必需的无色无味气体混合物；也可泛指大气层或地面以上的空间。",
      "example_en": "The air in the mountains is fresh and clean.",
      "example_cn": "山里的空气清新洁净。"
    },
    {
      "pos": "noun",
      "explanation_en": "An appearance or manner adopted to impress others, often perceived as artificial or pretentious; commonly used in the plural form 'airs'.",
      "explanation_cn": "指为了给他人留下印象而刻意摆出的姿态或做派，常带有做作或虚伪的意味；多用于复数形式 'airs'。",
      "example_en": "She put on airs at the party, acting as if she were royalty.",
      "example_cn": "她在派对上装腔作势，表现得好像自己是皇室成员一样。"
    },
    {
      "pos": "verb",
      "explanation_en": "To expose something to fresh air to remove odors, moisture, or stale air; to ventilate.",
      "explanation_cn": "指将某物暴露在新鲜空气中，以去除异味、湿气或污浊空气；即通风。",
      "example_en": "We aired out the basement after the flood.",
      "example_cn": "洪水过后，我们把地下室通风了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make something publicly known, especially through media such as radio, television, or the internet.",
      "explanation_cn": "指通过广播、电视或互联网等媒体将某事公之于众。",
      "example_en": "The network aired the documentary last night.",
      "example_cn": "该电视台昨晚播出了这部纪录片。"
    },
    {
      "pos": "verb",
      "explanation_en": "To express or voice one’s opinions, feelings, or grievances, often in a public or formal setting.",
      "explanation_cn": "指在公开或正式场合表达自己的观点、情绪或不满。",
      "example_en": "He aired his frustrations about the new policy during the meeting.",
      "example_cn": "他在会议上倾诉了对新政策的不满。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "atmosphere",
      "analysis": "“Atmosphere” (大气层/氛围) 通常指地球周围的气体层，或抽象意义上的环境氛围（如会议气氛）。它更强调整体性或情境性，而 “air” 更具体地指可呼吸的气体本身，也可用于比喻性表达（如 put on airs）。"
    },
    {
      "word_to_compare": "breath",
      "analysis": "“Breath” (呼吸、一口气) 指人或动物吸入或呼出的空气，强调动作或瞬间的气体交换。而 “air” 是静态的、环境中的气体介质。例如：take a breath（吸一口气） vs. fresh air（新鲜空气）。"
    },
    {
      "word_to_compare": "ventilate",
      "analysis": "“Ventilate” (通风) 是一个更专业、更具体的动词，专指通过空气流通来改善室内空气质量，常用于建筑或医学语境。而 “air” 作为动词含义更广泛，可指任何形式的暴露于空气，包括晾晒、播放内容或表达情绪。"
    }
  ]
}