{
  "word": "airway",
  "pronunciation": "air·wey",
  "concise_definition": "n. 气道, 航空路线, 空中通道",
  "forms": {
    "plural": "airways"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The passage through which air moves into and out of the lungs, including the nose, mouth, pharynx, larynx, trachea, and bronchi; essential for respiration.",
      "explanation_cn": "指空气进入和离开肺部的通道，包括鼻腔、口腔、咽、喉、气管和支气管；是呼吸所必需的生理结构。",
      "example_en": "The patient's airway was obstructed by a foreign object, requiring immediate intervention.",
      "example_cn": "患者的气道被异物阻塞，需要立即进行干预。"
    },
    {
      "pos": "noun",
      "explanation_en": "A designated route or corridor in the sky used by aircraft for navigation and traffic control, often defined by fixed points or radio beacons.",
      "explanation_cn": "指航空器用于导航和空中交通管制的指定空中航线，通常由固定点或无线电信标定义。",
      "example_en": "Commercial flights follow established airways to ensure safe and efficient travel across continents.",
      "example_cn": "商业航班遵循既定的航空路线，以确保跨大陆的安全高效飞行。"
    },
    {
      "pos": "noun",
      "explanation_en": "A system or network of routes for air transport, often operated by an airline company or regulated by aviation authorities.",
      "explanation_cn": "指由航空公司运营或由航空管理机构监管的空中运输系统或网络。",
      "example_en": "The airline expanded its airways to include new destinations in Southeast Asia.",
      "example_cn": "这家航空公司扩展了其航线网络，增加了东南亚的新目的地。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "passage",
      "analysis": "“Passage”（通道）是一个更通用的词，可指任何物体或人通过的路径，如走廊、水道或身体通道。而 “airway” 专指空气流通的通道，尤其在医学或航空语境中具有特定含义，范围更窄、专业性更强。"
    },
    {
      "word_to_compare": "route",
      "analysis": "“Route”（路线）泛指任何从一地到另一地的路径，可用于陆路、水路或航空。而 “airway” 是 “route” 在航空领域的专业术语，特指受管制的空中飞行通道，强调空中交通管理的规范性和安全性。"
    },
    {
      "word_to_compare": "respiratory tract",
      "analysis": "“Respiratory tract”（呼吸道）是医学术语，指从鼻腔到肺泡的整个呼吸系统结构，包含气道（airway）但范围更广，还包括肺泡和肺组织。而 “airway” 通常仅指气体进出的传导部分，不包括气体交换的肺泡区域。"
    }
  ]
}