{
  "word": "albanian",
  "pronunciation": "al·bey·nhee·uhn",
  "concise_definition": "adj. 阿尔巴尼亚的, 阿尔巴尼亚人的; n. 阿尔巴尼亚人, 阿尔巴尼亚语",
  "forms": {
    "plural": "albanians"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to Albania, its people, language, or culture; describing something originating from or characteristic of the country of Albania in southeastern Europe.",
      "explanation_cn": "与阿尔巴尼亚、其人民、语言或文化相关的；描述源自或具有欧洲东南部国家阿尔巴尼亚特征的事物。",
      "example_en": "The Albanian mountains offer breathtaking views and traditional village life.",
      "example_cn": "阿尔巴尼亚的山脉提供了令人叹为观止的景色和传统的乡村生活。"
    },
    {
      "pos": "noun",
      "explanation_en": "A native or citizen of Albania, or a person of Albanian descent.",
      "explanation_cn": "阿尔巴尼亚的原住民或公民，或具有阿尔巴尼亚血统的人。",
      "example_en": "Many Albanians have migrated to Western Europe in search of better economic opportunities.",
      "example_cn": "许多阿尔巴尼亚人为了寻求更好的经济机会迁移到了西欧。"
    },
    {
      "pos": "noun",
      "explanation_en": "The South Slavic language spoken primarily in Albania and Kosovo, with its own unique alphabet and linguistic roots.",
      "explanation_cn": "主要在阿尔巴尼亚和科索沃使用的南斯拉夫语，拥有自己独特的字母系统和语言根源。",
      "example_en": "She is learning Albanian to communicate with her grandmother, who speaks only the native tongue.",
      "example_cn": "她正在学习阿尔巴尼亚语，以便与只会说母语的祖母交流。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "serbian",
      "analysis": "“Serbian”（塞尔维亚语/塞尔维亚人）是邻国塞尔维亚的官方语言和民族称谓，使用西里尔字母和拉丁字母，属于南斯拉夫语支，与阿尔巴尼亚语在语言结构和历史渊源上完全不同。阿尔巴尼亚语是印欧语系中独立的一支，保留了大量古巴尔干语言特征，而塞尔维亚语则更接近其他斯拉夫语言。"
    },
    {
      "word_to_compare": "greek",
      "analysis": "“Greek”（希腊的/希腊人/希腊语）指希腊国家及其语言文化，希腊语是印欧语系中独立的分支，拥有超过三千年的文字历史，与阿尔巴尼亚语虽同处巴尔干半岛，但语言系统、词汇和语法结构差异显著。阿尔巴尼亚语受拉丁语和土耳其语影响更深，而希腊语保留了更多古希腊语特征。"
    },
    {
      "word_to_compare": "balkan",
      "analysis": "“Balkan”（巴尔干的）是一个地理和文化区域术语，涵盖包括阿尔巴尼亚在内的多个南欧国家，如塞尔维亚、克罗地亚、保加利亚等。它不是民族或语言的专有名称，而是泛指该地区共有的历史与政治背景。而 “Albanian” 是特指阿尔巴尼亚民族及其语言，具有明确的民族和语言身份。"
    }
  ]
}