{
  "word": "alexander",
  "pronunciation": "al·ek·san·duhr",
  "concise_definition": "n. 亚历山大（人名），亚历山大大帝；adj. 亚历山大的；n. 亚历山大式剪发",
  "forms": {
    "plural": "alexanders"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to Alexander the Great (356–323 BCE), the Macedonian king who created one of the largest empires in ancient history, stretching from Greece to northwestern India.",
      "explanation_cn": "专有名词，指亚历山大大帝（公元前356–323年），这位马其顿国王建立了古代世界最庞大的帝国之一，疆域从希腊延伸至西北印度。",
      "example_en": "Alexander the Great was renowned for his military genius and visionary leadership.",
      "example_cn": "亚历山大大帝以其军事天才和远见卓识的领导力而闻名。"
    },
    {
      "pos": "noun",
      "explanation_en": "A male given name of Greek origin, meaning 'defender of men', commonly used in Western cultures and historically associated with rulers and warriors.",
      "explanation_cn": "源自希腊语的男性名字，意为“人类的捍卫者”，在西方文化中广泛使用，历史上常与统治者和战士相关联。",
      "example_en": "Alexander Hamilton was one of the Founding Fathers of the United States.",
      "example_cn": "亚历山大·汉密尔顿是美国的开国元勋之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A style of men's haircut characterized by short sides and back with longer hair on top, often styled with volume or a side part, named after the legendary king's iconic hairstyle.",
      "explanation_cn": "一种男性发型，特点是两侧和后部较短，顶部头发较长，常以蓬松或侧分方式打理，因传说中亚历山大大帝的标志性发型而得名。",
      "example_en": "He got an alexander cut to look more professional for his job interview.",
      "example_cn": "他为了在面试中显得更专业，理了一个亚历山大式发型。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "conqueror",
      "analysis": "“Conqueror”（征服者）泛指任何通过武力占领或控制领土的人，是一个通用名词，不特指某个人。而 “Alexander” 作为专有名词，特指亚历山大大帝，是“征服者”中最著名、最具象征意义的代表。"
    },
    {
      "word_to_compare": "king",
      "analysis": "“King”（国王）是一个通用头衔，指任何君主制国家的男性统治者。而 “Alexander” 是一个具体的人名，虽然他确实是一位国王，但该词承载了历史、文化与传奇色彩，远超“国王”这一普通身份的含义。"
    },
    {
      "word_to_compare": "hairstyle",
      "analysis": "“Hairstyle”（发型）是描述所有头发造型的总称，中性且泛化。而 “alexander” 作为发型名称，特指一种具有历史渊源和文化联想的特定剪法，其命名直接关联亚历山大大帝的个人形象，赋予其独特的历史身份。"
    }
  ]
}