{
  "word": "alienation",
  "pronunciation": "ay·lee·en·ay·shun",
  "concise_definition": "n. 疏离, 隔绝, 异化",
  "forms": {
    "plural": "alienations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A feeling of estrangement or disconnection from one's surroundings, society, work, or even oneself, often resulting in emotional detachment or isolation.",
      "explanation_cn": "指个体与周围环境、社会、工作甚至自我之间产生的疏离感或脱节感，常导致情感上的冷漠或孤立。",
      "example_en": "Many workers experience alienation in jobs that offer no sense of purpose or personal fulfillment.",
      "example_cn": "许多工人在缺乏意义感和个人成就感的工作中会感到疏离。"
    },
    {
      "pos": "noun",
      "explanation_en": "The legal transfer of ownership or rights from one party to another, especially in property or land.",
      "explanation_cn": "指财产或土地等权利从一方合法转移至另一方的行为。",
      "example_en": "The alienation of the ancestral estate was finalized after a lengthy court process.",
      "example_cn": "经过漫长的法律程序后，祖传地产的转让最终完成。"
    },
    {
      "pos": "noun",
      "explanation_en": "In Marxist theory, the process by which workers become estranged from the products of their labor, the act of production, their fellow workers, and their own human potential.",
      "explanation_cn": "在马克思主义理论中，指劳动者与其劳动产品、生产过程、其他劳动者以及自身人性潜能相疏离的过程。",
      "example_en": "Marx described alienation as a core consequence of capitalist labor systems.",
      "example_cn": "马克思将异化描述为资本主义劳动制度的核心后果。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "isolation",
      "analysis": "“Isolation” (孤立) 强调物理或社交上的分离状态，通常是外部环境造成的客观结果，如被关在房间里或缺乏人际交往。而 “alienation” 更侧重于主观的心理感受——即使身处人群中，仍可能感到疏离和不被理解。"
    },
    {
      "word_to_compare": "estrangement",
      "analysis": "“Estrangement” (疏远) 通常用于人际关系，特指人与人之间情感纽带的破裂，如亲人或伴侣之间的冷淡。而 “alienation” 范围更广，可涵盖人与社会、工作、自我甚至系统的整体性脱节，具有更强的社会哲学内涵。"
    },
    {
      "word_to_compare": "disconnection",
      "analysis": "“Disconnection” (脱节) 是一个较中性、日常的词，泛指任何联系的中断，如网络断开或沟通失效。它缺乏 “alienation” 所蕴含的深刻情感痛苦与结构性批判，尤其在社会学和心理学语境中，后者更具理论深度和情感重量。"
    }
  ]
}