{
  "word": "allegheny",
  "pronunciation": "al·e·ghe·nee",
  "concise_definition": "n. 阿勒格尼（美国地名，常用于山脉、河流、城市等）",
  "forms": {
    "plural": "Alleghenies"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to the Allegheny Mountains, a major mountain range in the eastern United States, forming part of the Appalachian Mountains.",
      "explanation_cn": "专有名词，指位于美国东部的阿勒格尼山脉，是阿巴拉契亚山脉的重要组成部分。",
      "example_en": "The Allegheny Mountains offer some of the most scenic hiking trails in Pennsylvania.",
      "example_cn": "阿勒格尼山脉提供了宾夕法尼亚州最壮丽的徒步小径之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to the Allegheny River, a major tributary of the Ohio River that flows through western Pennsylvania and western New York.",
      "explanation_cn": "专有名词，指阿勒格尼河，一条流经宾夕法尼亚州西部和纽约州西部、汇入俄亥俄河的重要支流。",
      "example_en": "The city of Pittsburgh was founded at the confluence of the Allegheny and Monongahela Rivers.",
      "example_cn": "匹兹堡市建立在阿勒格尼河与莫农加希拉河的交汇处。"
    },
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to various places named after the mountains or river, such as Allegheny County in Pennsylvania or the former Allegheny City (now part of Pittsburgh).",
      "explanation_cn": "专有名词，指以山脉或河流命名的多个地点，如宾夕法尼亚州的阿勒格尼县，或已并入匹兹堡的前阿勒格尼市。",
      "example_en": "Allegheny County is known for its rich industrial history and cultural institutions.",
      "example_cn": "阿勒格尼县以其丰富的工业历史和文化机构而闻名。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "appalachian",
      "analysis": "“Appalachian”（阿巴拉契亚的）是一个更广泛的地理术语，涵盖从加拿大到美国南部的整个阿巴拉契亚山脉系统。而 “Allegheny” 是其东部的一个子区域，特指宾夕法尼亚、西弗吉尼亚和纽约一带的山地与河流，范围更小、更具地方性。"
    },
    {
      "word_to_compare": "mountain",
      "analysis": "“Mountain” 是通用名词，泛指任何高耸的陆地地形。而 “Allegheny” 是专有名词，特指美国东部的一组具体山脉、河流或地区，具有明确的地理和文化身份，不能与普通名词互换使用。"
    },
    {
      "word_to_compare": "river",
      "analysis": "“River” 是通用名词，指任何流动的水体。而 “Allegheny” 作为专有名词，特指一条具体的河流，其名称承载历史、经济和生态意义，常用于地名、行政区划和文化语境中，具有不可替代的指代功能。"
    }
  ]
}