{
  "word": "alloy",
  "pronunciation": "al·oy",
  "concise_definition": "n. 合金, 混合物; v. 使合金化, 降低纯度",
  "forms": {
    "plural": "alloys",
    "third_person_singular": "alloys",
    "past_tense": "alloyed",
    "past_participle": "alloyed",
    "present_participle": "alloying"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A mixture of two or more metals, or a metal and a non-metal, combined to enhance properties such as strength, durability, or resistance to corrosion.",
      "explanation_cn": "指两种或两种以上金属，或金属与非金属熔合而成的物质，旨在提升强度、耐久性或抗腐蚀性等性能。",
      "example_en": "Stainless steel is an alloy of iron, chromium, and nickel.",
      "example_cn": "不锈钢是铁、铬和镍的合金。"
    },
    {
      "pos": "noun",
      "explanation_en": "A mixture or combination of different elements, often implying a compromise or dilution of purity, especially in a metaphorical sense.",
      "explanation_cn": "泛指不同成分的混合物，常隐喻性地表示纯度的降低或品质的折中。",
      "example_en": "His praise was an alloy of sincerity and flattery.",
      "example_cn": "他的赞美掺杂着真诚与奉承。"
    },
    {
      "pos": "verb",
      "explanation_en": "To combine (a metal) with another element to form an alloy, typically to improve its physical or chemical properties.",
      "explanation_cn": "指将一种金属与其他元素熔合，以形成合金，通常是为了改善其物理或化学性能。",
      "example_en": "Copper is often alloyed with zinc to make brass.",
      "example_cn": "铜常与锌合金化以制造黄铜。"
    },
    {
      "pos": "verb",
      "explanation_en": "To impair or reduce the purity or integrity of something, especially in a figurative context.",
      "explanation_cn": "比喻性地指削弱或降低某物的纯粹性或完整性。",
      "example_en": "The scandal alloyed the reputation of the entire organization.",
      "example_cn": "这起丑闻损害了整个组织的声誉。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mixture",
      "analysis": "“Mixture” (混合物) 是一个更广泛的通用词，指任何物质的混合，不一定是金属，也不一定有功能性的目的。而 “alloy” 特指金属或金属与非金属的熔合，通常是为了获得特定的工程性能，具有技术性和目的性。"
    },
    {
      "word_to_compare": "compound",
      "analysis": "“Compound” (化合物) 是指通过化学键结合形成的具有固定比例和新化学性质的物质，如水（H₂O）。而 “alloy” 是物理混合，成分比例可变，不形成新的化学键，保留各组分的金属特性。"
    },
    {
      "word_to_compare": "blend",
      "analysis": "“Blend” (混合/融合) 强调不同成分的和谐结合，常用于非金属语境，如茶叶、颜色或风格。它不强调结构强化，而 “alloy” 专指通过冶金手段提升材料性能，具有明确的工业和技术含义。"
    }
  ]
}