{
  "word": "ally",
  "pronunciation": "uh·lī",
  "concise_definition": "n. 同盟国, 同盟者; v. 结盟, 联合",
  "forms": {
    "plural": "allies",
    "third_person_singular": "allies",
    "past_tense": "allied",
    "past_participle": "allied",
    "present_participle": "allying"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person, group, or country that joins with another for a common purpose, especially in politics, war, or business, often temporarily or strategically.",
      "explanation_cn": "指为实现共同目标（尤其在政治、战争或商业中）而与另一方联合的人、团体或国家，通常是临时性或策略性的合作。",
      "example_en": "During World War II, the United States and the Soviet Union were allies against Nazi Germany.",
      "example_cn": "在第二次世界大战期间，美国和苏联是反对纳粹德国的盟友。"
    },
    {
      "pos": "noun",
      "explanation_en": "Someone who supports and advocates for the interests of another group, especially one that is marginalized or disadvantaged, even if not a member of that group.",
      "explanation_cn": "指即使不属于某一群体，也支持并为其利益发声的人，尤其常用于支持边缘化或弱势群体。",
      "example_en": "As an ally of the LGBTQ+ community, he speaks out against discrimination in the workplace.",
      "example_cn": "作为LGBTQ+群体的盟友，他公开反对职场中的歧视行为。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form a partnership or alliance with someone or something, especially for mutual benefit or to achieve a shared goal.",
      "explanation_cn": "指与某人或某方建立联盟或合作关系，通常是为了互利或实现共同目标。",
      "example_en": "The two companies allied to develop a new line of eco-friendly products.",
      "example_cn": "两家公司结成联盟，共同开发一系列环保产品。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "partner",
      "analysis": "“Partner”（伙伴）强调平等、长期的合作关系，常用于商业或个人层面，如商业合伙人或婚姻伴侣。而 “ally” 更侧重于为特定目标或利益而临时联合，关系可能不对等，且常带有战略或政治色彩。"
    },
    {
      "word_to_compare": "friend",
      "analysis": "“Friend”（朋友）指基于情感、信任和亲密关系的个人联系，通常是非功利性的。而 “ally” 是基于共同利益或目标的实用型联合，即使没有情感纽带也可以成立。"
    },
    {
      "word_to_compare": "associate",
      "analysis": "“Associate”（关联者）指与某人或某组织有联系或合作关系的人，但关系较松散，不一定有共同目标或承诺。而 “ally” 暗示更紧密、更主动的协作，通常有明确的共同利益或立场。"
    }
  ]
}