{
  "word": "almond",
  "pronunciation": "am·und",
  "concise_definition": "n. 杏仁, 杏树",
  "forms": {
    "plural": "almonds"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The edible seed of the almond tree, typically encased in a hard shell and often consumed raw, roasted, or ground into flour or paste; valued for its nutty flavor and nutritional content.",
      "explanation_cn": "杏树的可食用种子，通常包裹在坚硬的壳内，常以生食、烘烤或磨成粉或酱的形式食用；因其坚果风味和营养成分而备受推崇。",
      "example_en": "She sprinkled chopped almonds over her yogurt for added crunch and flavor.",
      "example_cn": "她往酸奶上撒了切碎的杏仁，增加口感和风味。"
    },
    {
      "pos": "noun",
      "explanation_en": "The deciduous tree (Prunus dulcis) that produces almonds, native to the Middle East and South Asia, widely cultivated for its nuts and ornamental blossoms.",
      "explanation_cn": "指生产杏仁的落叶乔木（学名：Prunus dulcis），原产于中东和南亚，广泛栽培以获取其坚果和观赏性花朵。",
      "example_en": "The orchard was filled with blooming almond trees in early spring.",
      "example_cn": "早春时节，果园里开满了盛开的杏树花。"
    },
    {
      "pos": "noun",
      "explanation_en": "A pale, soft shade of white with a slight yellow or brown tint, often used to describe color in fashion, design, or art.",
      "explanation_cn": "一种略带黄色或棕色的淡白色调，常用于描述时尚、设计或艺术中的颜色。",
      "example_en": "The walls were painted in a soothing almond color to create a warm, inviting atmosphere.",
      "example_cn": "墙壁涂成了柔和的杏色，营造出温暖宜人的氛围。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pecan",
      "analysis": "“Pecan”（山核桃）是另一种常见的坚果，形状更细长，外壳更硬，味道更甜、更油润。而“almond”口感更脆、味道更温和，脂肪含量较低，常用于甜点和健康食品中。两者虽同为坚果，但植物学分类和风味特征不同。"
    },
    {
      "word_to_compare": "walnut",
      "analysis": "“Walnut”（核桃）果仁呈脑状，外壳极硬，味道较苦涩且浓郁，富含Omega-3脂肪酸。相比之下，“almond”味道更清淡、更易被广泛接受，且在素食和无麸质饮食中用途更广。两者在营养结构和烹饪用途上存在明显差异。"
    },
    {
      "word_to_compare": "hazelnut",
      "analysis": "“Hazelnut”（榛子）外壳较薄，果仁呈圆形，味道香甜浓郁，常用于巧克力制品（如Nutella）。而“almond”质地更坚硬，用途更广泛，可制成杏仁奶、杏仁粉等替代品。在素食和无乳饮食中，杏仁的替代性更强。"
    }
  ]
}