{
  "word": "alpha",
  "pronunciation": "al·fuh",
  "concise_definition": "n. 阿尔法（希腊字母表第一个字母）；首领，主导者；α射线",
  "forms": {
    "plural": "alphas"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The first letter of the Greek alphabet, often used symbolically to represent the beginning, origin, or primary element of something.",
      "explanation_cn": "希腊字母表的第一个字母，常被用作象征某事物的开端、起源或主要元素。",
      "example_en": "Alpha is the first step in understanding complex systems.",
      "example_cn": "阿尔法是理解复杂系统的第一步。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or animal that holds the dominant position in a group or hierarchy, often characterized by leadership, confidence, and control.",
      "explanation_cn": "指在群体或等级制度中占据主导地位的人或动物，通常以领导力、自信和控制力为特征。",
      "example_en": "In the wolf pack, the alpha male leads the hunt and makes key decisions.",
      "example_cn": "在狼群中，头狼负责带领狩猎并做出关键决策。"
    },
    {
      "pos": "noun",
      "explanation_en": "In finance, a measure of an investment's performance relative to a benchmark index, indicating excess return generated by active management.",
      "explanation_cn": "在金融领域，指一项投资相对于基准指数的表现，表示通过主动管理所获得的超额收益。",
      "example_en": "The fund manager boasted an alpha of 3.5% over the S&P 500 last year.",
      "example_cn": "这位基金经理去年在标普500指数之上实现了3.5%的超额收益。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of high-energy radiation emitted by radioactive substances, consisting of helium nuclei; also called alpha particles.",
      "explanation_cn": "一种由放射性物质释放的高能辐射，由氦原子核组成；也称为α粒子。",
      "example_en": "Alpha radiation can be stopped by a sheet of paper but is dangerous if ingested.",
      "example_cn": "α辐射可被一张纸阻挡，但若被摄入体内则具有危险性。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "omega",
      "analysis": "“Omega”（希腊字母表最后一个字母）常与 “alpha” 对立使用，象征终结、从属或底层地位。在群体等级中，alpha 是领导者，omega 是最弱或最顺从的成员。二者构成象征性的首尾对比。"
    },
    {
      "word_to_compare": "leader",
      "analysis": "“Leader”（领导者）是通用词，泛指任何带领他人的人，不带有生物或等级体系的隐喻。而 “alpha” 特指在自然群体（如动物群）或社会结构中通过支配地位获得领导权的人，带有更强的生物学和社会等级色彩。"
    },
    {
      "word_to_compare": "primary",
      "analysis": "“Primary”（主要的）强调重要性或优先级，但不隐含支配或控制的含义。而 “alpha” 不仅表示首要地位，还暗含权威、统治和主导行为，语义更丰富且更具动态性。"
    }
  ]
}