{
  "word": "alternate",
  "pronunciation": "awl·tuhr·nayt",
  "concise_definition": "adj. 替代的, 交替的; v. 交替, 轮流",
  "forms": {
    "third_person_singular": "alternates",
    "past_tense": "alternated",
    "past_participle": "alternated",
    "present_participle": "alternating",
    "noun_form": "alternation"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Serving as a substitute or replacement for something else, often used when two options are available and one is chosen in place of the other.",
      "explanation_cn": "作为替代品或替代选项使用的，通常用于两种选择中选其一的情形。",
      "example_en": "She took the alternate route to avoid the traffic jam.",
      "example_cn": "她选择了另一条路线以避开交通堵塞。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Occurring in turns or by turns; happening one after the other in a regular pattern.",
      "explanation_cn": "按顺序轮流发生；以规律的交替模式依次出现。",
      "example_en": "The team plays alternate days to allow for rest and recovery.",
      "example_cn": "球队隔天比赛，以便有时间休息和恢复。"
    },
    {
      "pos": "verb",
      "explanation_en": "To switch back and forth between two or more things, states, or activities in a regular sequence.",
      "explanation_cn": "在两个或多个事物、状态或活动之间按规律来回切换。",
      "example_en": "The lights alternate between red and green every 30 seconds.",
      "example_cn": "交通灯每30秒在红灯和绿灯之间交替变换。"
    },
    {
      "pos": "verb",
      "explanation_en": "To serve as a substitute or replacement for someone or something, especially in a formal or official capacity.",
      "explanation_cn": "担任某人或某物的替代者，尤其在正式或官方场合中。",
      "example_en": "The vice president will alternate for the president during the meeting.",
      "example_cn": "副总统将在会议期间代替总统出席。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "alternative",
      "analysis": "“Alternative” (替代品) 是名词或形容词，强调“可供选择的另一个选项”，通常暗示非默认、非主流的选择，如“alternative medicine”。而 “alternate” 作为形容词时更强调“按顺序轮换”或“临时替代”的性质，不一定是首选之外的选项，而是计划中的备选。"
    },
    {
      "word_to_compare": "switch",
      "analysis": "“Switch” (切换) 指快速、突然地从一个状态或对象转到另一个，常带有主动或技术性操作的意味，如“switch channels”。而 “alternate” 更强调规律性、周期性、系统性的轮流，节奏更稳定，常用于自然或制度化的交替场景。"
    },
    {
      "word_to_compare": "rotate",
      "analysis": "“Rotate” (轮换) 通常用于三个或更多项目按固定顺序循环，如“rotate shifts”或“rotate crops”。而 “alternate” 通常仅限于两个项目之间的来回切换，结构更简单，不涉及多轮循环。"
    }
  ]
}