{
  "word": "amazon",
  "pronunciation": "am·uh·zon",
  "concise_definition": "n. 亚马逊（公司/河流/女战士）",
  "forms": {
    "plural": "amazons"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A large multinational technology company headquartered in the United States, primarily known for e-commerce, cloud computing, digital streaming, and artificial intelligence services.",
      "explanation_cn": "一家总部位于美国的大型跨国科技公司，主要以电子商务、云计算、数字流媒体和人工智能服务而闻名。",
      "example_en": "I ordered the book from Amazon and received it the next day.",
      "example_cn": "我从亚马逊订购了这本书，第二天就收到了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A major river in South America, the largest river in the world by volume of water discharged, flowing through the Amazon rainforest.",
      "explanation_cn": "南美洲的一条主要河流，按水量计算是世界上最大的河流，流经亚马逊雨林。",
      "example_en": "The Amazon rainforest is home to millions of species, many of which are found nowhere else on Earth.",
      "example_cn": "亚马逊雨林是数百万种生物的家园，其中许多物种在地球上其他地方都找不到。"
    },
    {
      "pos": "noun",
      "explanation_en": "A member of a legendary race of warrior women in Greek mythology, often depicted as fierce, independent, and skilled in combat.",
      "explanation_cn": "希腊神话中传说的一群女战士，常被描绘为凶猛、独立且擅长战斗的女性。",
      "example_en": "In ancient myths, the Amazons fought alongside heroes and were said to live in a matriarchal society.",
      "example_cn": "在古代神话中，亚马逊女战士与英雄并肩作战，据说生活在一个母系社会中。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "company",
      "analysis": "“Company”（公司）是一个泛指商业组织的通用词，而 “Amazon” 是一个专有名词，特指全球最大的电商平台之一。使用 “company” 时无品牌指向性，而 “Amazon” 则承载了特定的品牌形象、服务范围和市场影响力。"
    },
    {
      "word_to_compare": "rainforest",
      "analysis": "“Rainforest”（雨林）是描述热带森林生态系统的通用名词，而 “Amazon” 作为专有名词特指地球上最大、生物多样性最丰富的亚马逊雨林。前者是类别，后者是具体实例。"
    },
    {
      "word_to_compare": "warrior",
      "analysis": "“Warrior”（战士）泛指任何战斗者，无论性别或文化背景；而 “Amazon” 特指希腊神话中具有独特文化特征的女性战士群体，带有神话色彩和性别象征意义，是特定文化语境下的专有概念。"
    }
  ]
}