{
  "word": "american",
  "pronunciation": "uh·mer·i·kən",
  "concise_definition": "adj. 美国的, 美利坚的; n. 美国人",
  "forms": {
    "comparative": "more American",
    "superlative": "most American",
    "plural": "Americans"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or originating from the United States of America, its people, culture, or institutions.",
      "explanation_cn": "与美国相关或源自美国的，涉及其人民、文化或制度。",
      "example_en": "American cuisine includes dishes like hamburgers, apple pie, and barbecue.",
      "example_cn": "美国菜包括汉堡包、苹果派和烧烤等菜肴。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characteristic of the values, attitudes, or lifestyle commonly associated with the United States, such as individualism, optimism, and consumerism.",
      "explanation_cn": "具有与美国普遍关联的价值观、态度或生活方式特征，如个人主义、乐观主义和消费主义。",
      "example_en": "The film reflects a distinctly American ideal of self-made success.",
      "example_cn": "这部电影体现了典型的美国式自我奋斗成功的理想。"
    },
    {
      "pos": "noun",
      "explanation_en": "A citizen or national of the United States of America.",
      "explanation_cn": "美国的公民或国民。",
      "example_en": "Many Americans travel abroad to experience different cultures.",
      "example_cn": "许多美国人出国旅行以体验不同的文化。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person of American descent living outside the United States, or sometimes used broadly to refer to any native of the Americas (though this usage is often contested).",
      "explanation_cn": "居住在美国境外的美国后裔；有时泛指美洲原住民（但此用法常有争议）。",
      "example_en": "In Latin America, 'American' often refers specifically to people from the U.S., not the continent as a whole.",
      "example_cn": "在拉丁美洲，'American' 通常特指来自美国的人，而非整个美洲大陆的居民。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "US",
      "analysis": "“US” 是 “United States” 的缩写，通常用作形容词或名词短语（如 US policy, the US government），强调国家实体或官方属性；而 “American” 更广泛地涵盖文化、民族和身份认同，不仅指地理或政治归属，也包含社会和心理层面的特征。"
    },
    {
      "word_to_compare": "native",
      "analysis": "“Native”（原住民/本地人）泛指某地的原始居民或出生地的人，不特指美国；而 “American” 专指与美国相关的人或事物。例如，一个澳大利亚原住民是 native Australian，但不是 American。"
    },
    {
      "word_to_compare": "continental",
      "analysis": "“Continental”（大陆的）通常指欧洲大陆（如 continental Europe）或与大陆相关的特征（如 continental breakfast），与 “American” 在地理和文化上形成对比。在北美语境中，有时用 “continental” 来区分美国与加拿大或墨西哥，但这种用法极少见且易混淆。"
    }
  ]
}