{
  "word": "amplified",
  "pronunciation": "am·pluh·fahyd",
  "concise_definition": "adj. 放大的, 增强的; v. 放大, 增强（动词原形：amplify）",
  "forms": {
    "base_form": "amplify",
    "third_person_singular": "amplifies",
    "past_tense": "amplified",
    "past_participle": "amplified",
    "present_participle": "amplifying"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Made louder, stronger, or more intense, especially through mechanical or electronic means; describing something that has been increased in magnitude or effect.",
      "explanation_cn": "通过机械或电子手段使声音、强度或影响变大、变强或更显著的；描述某事物在量级或效果上被增强的状态。",
      "example_en": "The amplified sound echoed through the stadium, reaching every corner.",
      "example_cn": "经过扩音的声音在体育场内回荡，传到了每一个角落。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Exaggerated or intensified in expression, often to emphasize a point or evoke a stronger emotional response.",
      "explanation_cn": "在表达上被夸大或强化，通常是为了强调某个观点或引发更强烈的情感反应。",
      "example_en": "His amplified version of the story made it sound far more dramatic than it actually was.",
      "example_cn": "他将这个故事进行了夸张的叙述，使其听起来比实际情况戏剧化得多。"
    },
    {
      "pos": "verb",
      "explanation_en": "To increase the magnitude, volume, or intensity of something, especially sound, signals, or effects, using technology or other methods.",
      "explanation_cn": "使用技术或其他方法增加某事物的幅度、音量或强度，尤指声音、信号或效果。",
      "example_en": "The engineer amplified the weak signal to make it detectable by the receiver.",
      "example_cn": "工程师放大了这个微弱的信号，使其能被接收器检测到。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "enhanced",
      "analysis": "“Enhanced”（增强）强调在原有基础上进行优化或提升质量、性能或价值，常用于非物理性增强，如用户体验、图像清晰度。而 “amplified” 更侧重于物理量的扩大，如音量、信号强度，具有更强的“量级提升”含义。"
    },
    {
      "word_to_compare": "intensified",
      "analysis": "“Intensified”（加强）指某种情绪、冲突或状态变得更强烈，常用于抽象概念（如压力、情感），强调内在程度的加深。而 “amplified” 更常用于可测量的物理量或传播媒介的扩大，如声音、电流，具有技术性或工具性特征。"
    },
    {
      "word_to_compare": "magnified",
      "analysis": "“Magnified”（放大）通常指通过光学或视觉手段使物体看起来更大，如显微镜放大图像，强调空间或视觉上的扩大。而 “amplified” 更广泛地用于声音、信号、影响等非视觉领域的增强，不局限于视觉维度。"
    }
  ]
}