{
  "word": "amplification",
  "pronunciation": "am·pluh·fuh·key·shun",
  "concise_definition": "n. 放大, 增强, 扩充",
  "forms": {
    "plural": "amplifications"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of increasing the magnitude, intensity, or volume of something, especially sound, signal, or power, often using electronic or mechanical means.",
      "explanation_cn": "指通过电子或机械手段增加某物的幅度、强度或音量，尤指声音、信号或功率的放大。",
      "example_en": "The amplification of the speaker's voice allowed everyone in the auditorium to hear clearly.",
      "example_cn": "扬声器的音量放大使礼堂里的每个人都能听清楚。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of expanding or elaborating on an idea, argument, or statement to make it more detailed, persuasive, or comprehensive.",
      "explanation_cn": "指对某个观点、论点或陈述进行扩展或详述，使其更详尽、更有说服力或更全面。",
      "example_en": "The lawyer's amplification of the evidence strengthened the case significantly.",
      "example_cn": "律师对证据的详细阐述极大地增强了案件的说服力。"
    },
    {
      "pos": "noun",
      "explanation_en": "In music or rhetoric, the deliberate exaggeration or emphasis of a theme or expression for dramatic or emotional effect.",
      "explanation_cn": "在音乐或修辞中，为达到戏剧性或情感效果而对主题或表达进行刻意的夸张或强调。",
      "example_en": "The composer used amplification of the motif to build tension before the climax.",
      "example_cn": "作曲家通过重复强化主题，在高潮前营造出紧张感。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "enhancement",
      "analysis": "“Enhancement”（增强）侧重于提升质量、性能或价值，通常不涉及物理量级的扩大，而是优化或改进。例如，图像增强、用户体验增强。而 “amplification” 更强调数量或强度的物理性增加，如音量、信号强度的提升。"
    },
    {
      "word_to_compare": "expansion",
      "analysis": "“Expansion”（扩张）指范围、规模或空间的扩大，如公司扩张、城市扩张，强调横向延展。而 “amplification” 更侧重于内在强度、影响力或表现力的提升，可以是抽象的（如论点）或具体的（如声音）。"
    },
    {
      "word_to_compare": "elaboration",
      "analysis": "“Elaboration”（详述）专指语言或思想内容的丰富与细化，常用于写作或演讲中，强调逻辑和细节的补充。它与 “amplification” 在修辞层面有重叠，但 “amplification” 可包含非语言的物理放大，而 “elaboration” 仅限于语义层面的扩展。"
    }
  ]
}