{
  "word": "analogue",
  "pronunciation": "an·uh·log",
  "concise_definition": "n. 类比物, 类似物, 模拟物",
  "forms": {
    "plural": "analogues"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Something that is similar or comparable to another thing, especially in function or purpose, though not necessarily in structure or origin.",
      "explanation_cn": "指在功能或目的上与另一事物相似或可比的事物，尽管其结构或起源可能不同。",
      "example_en": "The human brain is often considered an analogue of a computer in terms of information processing.",
      "example_cn": "就信息处理而言，人脑常被视为计算机的类比物。"
    },
    {
      "pos": "noun",
      "explanation_en": "A non-digital version of something, especially in technology, where continuous physical quantities represent data (e.g., analog clocks, analog signals).",
      "explanation_cn": "指某种事物的非数字版本，尤其在技术领域中，通过连续的物理量来表示数据（如模拟钟表、模拟信号）。",
      "example_en": "Many audiophiles prefer vinyl records as an analogue to digital music formats.",
      "example_cn": "许多音响爱好者更喜欢黑胶唱片，认为它是数字音乐格式的模拟形式。"
    },
    {
      "pos": "noun",
      "explanation_en": "In biology, a structure in one organism that has a similar function to a structure in another organism, even if they evolved independently.",
      "explanation_cn": "在生物学中，指一个生物体中的结构，其功能与另一生物体中的结构相似，即使它们是独立进化的。",
      "example_en": "The wings of a bat and the wings of a bird are analogues — both enable flight, but evolved separately.",
      "example_cn": "蝙蝠的翅膀和鸟的翅膀是类比结构——两者都能实现飞行，但却是独立进化的。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "analog",
      "analysis": "“Analog” 是 “analogue” 的美式拼写形式，两者在含义和用法上完全相同，仅因地域差异而拼写不同。在英式英语中多用 “analogue”，美式英语中多用 “analog”，尤其在技术语境中（如 analog signal）。"
    },
    {
      "word_to_compare": "similarity",
      "analysis": "“Similarity” (相似性) 是一个抽象名词，指两个或多个事物之间具有共同特征的状态或性质，不指具体事物本身。而 “analogue” 是一个具体名词，指代那个具有相似功能或特征的具体对象。"
    },
    {
      "word_to_compare": "equivalent",
      "analysis": "“Equivalent” (等价物) 强调在价值、数量、功能或意义上完全相等或可互换，通常具有更严格的对等关系。而 “analogue” 只要求功能或作用相似，不要求完全等同，允许结构或来源不同。"
    }
  ]
}