{
  "word": "anchored",
  "pronunciation": "an·kurd",
  "concise_definition": "adj. 固定的, 稳定的; v. 锚定, 固定 (anchor 的过去式和过去分词)",
  "forms": {
    "base_form": "anchor",
    "third_person_singular": "anchors",
    "past_tense": "anchored",
    "past_participle": "anchored",
    "present_participle": "anchoring"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Firmly fixed or established in a particular place, position, or state, providing stability or security.",
      "explanation_cn": "牢固地固定在某个地点、位置或状态中，提供稳定性和安全感。",
      "example_en": "The community felt anchored by its long-standing traditions and shared values.",
      "example_cn": "这个社区因长期的传统和共同价值观而感到稳定。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Mentally or emotionally grounded; not easily swayed or unsettled.",
      "explanation_cn": "心理或情感上根基稳固；不易被动摇或扰乱。",
      "example_en": "Despite the chaos around her, she remained anchored in her principles.",
      "example_cn": "尽管周围一片混乱，她仍坚守自己的原则。"
    },
    {
      "pos": "verb",
      "explanation_en": "To secure a boat or ship by attaching it to a heavy object (an anchor) on the seabed to prevent drifting.",
      "explanation_cn": "通过将船与海底的重物（锚）连接，以防止其漂移。",
      "example_en": "The sailors anchored the vessel just offshore before sunset.",
      "example_cn": "水手们在日落前将船锚定在近海处。"
    },
    {
      "pos": "verb",
      "explanation_en": "To establish or fix something firmly as a foundation or reference point, especially in abstract contexts like media, ideas, or narratives.",
      "explanation_cn": "在抽象语境中（如媒体、思想或叙事）牢固地建立或固定某事物作为基础或参照点。",
      "example_en": "The news program was anchored by a veteran journalist with decades of experience.",
      "example_cn": "这档新闻节目由一位拥有数十年经验的资深记者主持。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fixed",
      "analysis": "“Fixed” (固定的) 强调完全不可移动或改变的状态，常用于物理或机械语境，如“fixed position”。而 “anchored” 更强调通过某种外部机制（如锚、基础、信念）实现的稳定，隐含一种主动或依赖性的稳固，语义更丰富，常用于抽象领域。"
    },
    {
      "word_to_compare": "rooted",
      "analysis": "“Rooted” (扎根的) 通常用于比喻，强调源于深层基础或起源的稳定性，如“rooted in tradition”。它更侧重于历史或文化渊源。“Anchored” 则更强调当前的稳固状态，可能通过外力或结构实现，不一定涉及历史深度。"
    },
    {
      "word_to_compare": "secured",
      "analysis": "“Secured” (被保护的/被确保的) 强调防止丢失、入侵或危险，如“secured door”。它关注的是安全防护，而非稳定性或参照性。“Anchored” 更强调定位和支撑，即使在没有威胁的情况下也可使用，如“anchored in values”。"
    }
  ]
}