{
  "word": "anchor",
  "pronunciation": "æn·kər",
  "concise_definition": "n. 锚, 核心人物; v. 锚定, 主持",
  "forms": {
    "plural": "anchors",
    "third_person_singular": "anchors",
    "past_tense": "anchored",
    "past_participle": "anchored",
    "present_participle": "anchoring"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A heavy object, typically made of metal, that is lowered from a ship to hold it in place by gripping the seabed.",
      "explanation_cn": "一种通常由金属制成的重物，从船上放下以通过抓住海底来固定船只的位置。",
      "example_en": "The captain ordered the crew to drop the anchor as the storm approached.",
      "example_cn": "当风暴逼近时，船长命令船员放下锚。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that provides stability, security, or a central point of reference in a system, group, or situation.",
      "explanation_cn": "指在某个系统、团体或情境中提供稳定性、安全感或核心参照点的人或事物。",
      "example_en": "She is the anchor of the family, always calm and reliable in times of crisis.",
      "example_cn": "她是家庭的支柱，总能在危机时刻保持冷静和可靠。"
    },
    {
      "pos": "verb",
      "explanation_en": "To secure or fix something firmly in place, either physically or metaphorically.",
      "explanation_cn": "指将某物（物理上或隐喻上）牢固地固定或定位。",
      "example_en": "The new policy anchors the company’s long-term strategy in sustainability.",
      "example_cn": "这项新政策将公司的长期战略锚定在可持续发展上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To host or present a television or radio program, especially as the main presenter.",
      "explanation_cn": "指担任电视或广播节目的主持人，尤指主要主持人。",
      "example_en": "He has anchored the nightly news for over twenty years.",
      "example_cn": "他已主持晚间新闻长达二十多年。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mooring",
      "analysis": "“Mooring”（系泊）指用于固定船只的整个系统，包括缆绳、浮标和桩等，是一个更广泛的术语；而 “anchor” 仅指其中用于抓地的核心装置。在隐喻用法中，“mooring” 较少使用，而 “anchor” 更常用于比喻稳定的核心。"
    },
    {
      "word_to_compare": "foundation",
      "analysis": "“Foundation”（基础）强调事物得以建立的根本支撑，通常是抽象的、结构性的，如制度或理念的基础；而 “anchor” 更强调在动态或不稳定环境中提供即时的稳定和停驻，具有更强的动态意象，如风暴中的锚。"
    },
    {
      "word_to_compare": "host",
      "analysis": "“Host”（主持）泛指任何节目的主持人，可以是临时或辅助角色；而 “anchor” 特指新闻或重要节目中的核心主持人，通常具有权威性、稳定性和长期性，语义上更正式、更强调责任与中心地位。"
    }
  ]
}