{
  "word": "andromeda",
  "pronunciation": "an·droh·mee·duh",
  "concise_definition": "n. 仙女座, 女神安德洛墨达",
  "forms": {
    "plural": "andromedas"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A constellation in the northern sky, named after the mythological princess Andromeda, visible to the naked eye and containing the Andromeda Galaxy, the nearest major galaxy to the Milky Way.",
      "explanation_cn": "北天星座之一，以希腊神话中的公主安德洛墨达命名，肉眼可见，包含距离银河系最近的大型星系——仙女座星系。",
      "example_en": "On a clear night, you can see the Andromeda Galaxy with the naked eye near the constellation Andromeda.",
      "example_cn": "在晴朗的夜晚，你可以在仙女座附近用肉眼看到仙女座星系。"
    },
    {
      "pos": "noun",
      "explanation_en": "In Greek mythology, Andromeda was a princess chained to a rock as a sacrifice to a sea monster, but rescued by the hero Perseus; she later became a symbol of beauty and deliverance.",
      "explanation_cn": "在希腊神话中，安德洛墨达是一位被锁在岩石上作为海怪祭品的公主，后被英雄珀尔修斯所救；她后来成为美丽与拯救的象征。",
      "example_en": "The story of Andromeda and Perseus is one of the most famous myths in ancient Greek literature.",
      "example_cn": "安德洛墨达与珀尔修斯的故事是古希腊文学中最著名的神话之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A genus of flowering plants in the family Ericaceae, commonly known as andromeda or bog rosemary, native to northern temperate regions.",
      "explanation_cn": "杜鹃花科的一种开花植物属，俗称和洛墨达或沼泽迷迭香，原产于北温带地区。",
      "example_en": "The delicate white flowers of the andromeda plant bloom in early spring in moist, acidic soils.",
      "example_cn": "和洛墨达植物精致的白色花朵在早春时节生长于湿润、酸性的土壤中。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "constellation",
      "analysis": "“Constellation”（星座）是一个泛指天球上由恒星组成的图案或区域的总称，而 “Andromeda” 是其中一个具体的星座名称，具有特定的文化、神话和天文意义。前者是类别，后者是实例。"
    },
    {
      "word_to_compare": "galaxy",
      "analysis": "“Galaxy”（星系）指由恒星、尘埃和暗物质组成的巨大天体系统，如银河系或仙女座星系；而 “Andromeda” 可以指代仙女座星系，但更常指其所在的星座。两者是不同层级的天体概念：星座是视觉划分，星系是物理实体。"
    },
    {
      "word_to_compare": "myth",
      "analysis": "“Myth”（神话）是泛指古代文化中关于神祇、英雄和自然现象的传说故事；而 “Andromeda” 是一个具体的神话人物，是神话体系中的一个角色。前者是整体叙事，后者是其中的组成部分。"
    }
  ]
}