{
  "word": "angelica",
  "pronunciation": "an·juh·lik·uh",
  "concise_definition": "n. 当归, 天使草 (一种药用植物); (复数形式 angelicas) 指该植物的根或种子，也用于指一种香气浓郁的草本植物",
  "forms": {
    "plural": "angelicas"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A tall, aromatic herb (Angelica archangelica) native to northern Europe and Asia, whose roots and seeds are used in traditional medicine, culinary applications, and as a flavoring in liqueurs such as chartreuse.",
      "explanation_cn": "一种原产于北欧和亚洲的高大芳香草本植物（学名：Angelica archangelica），其根和种子被用于传统医学、烹饪以及作为苦艾酒等利口酒的调味剂。",
      "example_en": "The herbal tea contained dried angelica root to aid digestion.",
      "example_cn": "这种草药茶中含有干燥的当归根，有助于消化。"
    },
    {
      "pos": "noun",
      "explanation_en": "In botany and horticulture, the term refers to several species in the genus Angelica, valued for their ornamental foliage and tall, umbrella-like flower clusters.",
      "explanation_cn": "在植物学和园艺中，该词指当归属的多个物种，因其观赏性的叶片和高耸的伞形花序而被栽培。",
      "example_en": "The garden featured angelicas with striking purple stems and white blossoms.",
      "example_cn": "花园里种植着茎干呈深紫色、花朵洁白的当归草。"
    },
    {
      "pos": "noun",
      "explanation_en": "A surname or given name derived from the word 'angel,' often associated with purity or divine qualities, though this usage is rare and mostly literary.",
      "explanation_cn": "源自单词 'angel'（天使）的姓氏或名字，常与纯洁或神圣的品质相关联，但此用法罕见，多见于文学语境。",
      "example_en": "She was known in the village as Angelica, a name that carried the weight of grace and serenity.",
      "example_cn": "她在村子里被称为 Angelica，这个名字承载着优雅与宁静的分量。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "parsley",
      "analysis": "“Parsley”（欧芹）是一种常见的香草，主要用于调味和装饰，气味温和，无显著药用价值。而 “angelica” 具有强烈香气和显著的药用特性，常用于治疗消化系统疾病，且在酒精饮料中作为风味剂使用，用途更广泛、更专业。"
    },
    {
      "word_to_compare": "ginseng",
      "analysis": "“Ginseng”（人参）也是一种传统药用植物，常用于增强体力和免疫力，与 angelica 在药用领域有重叠。但 ginseng 主要来自根部，且多用于东亚医学体系；angelica 则在欧洲传统医学中更常见，其根、茎、种子均可入药，且气味独特，常用于食品调味。"
    },
    {
      "word_to_compare": "fennel",
      "analysis": "“Fennel”（茴香）与 angelica 同属伞形科，外形相似，均有甘甜香气，常用于烹饪。但 fennel 的种子和球茎更常用于日常饮食，而 angelica 的茎常被糖渍作为甜点装饰，其药用成分更复杂，且具有更强的苦味和辛香，使用范围更受限。"
    }
  ]
}