{
  "word": "anglo",
  "pronunciation": "an·glo",
  "concise_definition": "adj. 英格兰的, 英语的; n. 英语使用者, 英裔人士",
  "forms": {
    "comparative": "anglier",
    "superlative": "angliest",
    "plural": "anglos"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to England, the English people, or the English language, especially in contexts involving cultural or linguistic influence outside England.",
      "explanation_cn": "与英格兰、英格兰人或英语相关的，尤其用于描述英格兰以外地区受英语文化或语言影响的语境。",
      "example_en": "The Anglo-Saxon period laid the foundation for modern English literature.",
      "example_cn": "盎格鲁-撒克逊时期为现代英语文学奠定了基础。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person of English descent or a native English speaker, especially in non-English-speaking countries such as the United States, Canada, or Latin America.",
      "explanation_cn": "指英格兰后裔或以英语为母语的人，尤其用于美国、加拿大或拉丁美洲等非英语国家中。",
      "example_en": "In Mexico, many anglos live in the northern border regions.",
      "example_cn": "在墨西哥，许多英裔人士居住在北部边境地区。"
    },
    {
      "pos": "noun",
      "explanation_en": "A compound term used in combinations such as 'Anglo-American' or 'Anglo-Irish' to denote cultural or ethnic ties between England and another region.",
      "explanation_cn": "用于复合词（如 'Anglo-American' 或 'Anglo-Irish'）中，表示英格兰与另一地区之间的文化或民族联系。",
      "example_en": "The Anglo-Indian community has a unique blend of British and Indian traditions.",
      "example_cn": "英印社群融合了英国与印度的独特传统。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "english",
      "analysis": "“English” 是更通用、中性的词，可指语言、国籍或文化，适用于所有语境；而 “anglo” 多用于复合词或特定语境中，带有文化区分或族群身份的色彩，常用于非英语国家中指代英语裔群体，语义更狭窄、更具社会语境性。"
    },
    {
      "word_to_compare": "british",
      "analysis": "“British” 指英国（包括英格兰、苏格兰、威尔士和北爱尔兰）的国籍或文化，范围更广；而 “anglo” 通常仅指英格兰或英语文化，不包括苏格兰或威尔士等非英格兰的英国组成部分，因此 “anglo” 的地域和文化指向更具体。"
    },
    {
      "word_to_compare": "western",
      "analysis": "“Western” 是一个更宽泛的文化术语，泛指欧美文明体系，涵盖政治、哲学、艺术等多个层面；而 “anglo” 仅特指英语文化圈，尤其是受英格兰影响的群体，范围更小、更具体，不包含法语、德语或斯堪的纳维亚文化等其他西方文化分支。"
    }
  ]
}