{
  "word": "annihilation",
  "pronunciation": "an·nuh·lə·ˈshən",
  "concise_definition": "n. 毁灭, 彻底消灭, 湮灭",
  "forms": {
    "plural": "annihilations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The complete destruction or obliteration of something, leaving no trace or existence behind; often used to describe physical, military, or existential destruction.",
      "explanation_cn": "指某事物被彻底摧毁或抹去，不留任何痕迹或存在；常用于描述物理、军事或存在意义上的毁灭。",
      "example_en": "The nuclear war led to the annihilation of entire cities and millions of lives.",
      "example_cn": "这场核战争导致了整个城市和数百万人的彻底毁灭。"
    },
    {
      "pos": "noun",
      "explanation_en": "In physics and particle theory, the process by which a particle and its antiparticle collide and convert their mass into energy, typically in the form of photons.",
      "explanation_cn": "在物理学和粒子理论中，指一个粒子与其反粒子碰撞并将其质量转化为能量（通常以光子形式）的过程。",
      "example_en": "When an electron meets a positron, their annihilation produces two gamma-ray photons.",
      "example_cn": "当一个电子与一个正电子相遇时，它们的湮灭会产生两个伽马射线光子。"
    },
    {
      "pos": "noun",
      "explanation_en": "The total erasure or negation of an idea, identity, or system, often in a metaphorical or ideological sense.",
      "explanation_cn": "指在隐喻或意识形态层面上对某种思想、身份或体系的彻底抹除或否定。",
      "example_en": "The dictator sought the annihilation of all opposition voices through censorship and fear.",
      "example_cn": "独裁者通过审查和恐惧试图彻底消灭所有反对声音。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "destruction",
      "analysis": "“Destruction” (破坏) 是一个更广泛、更通用的词，指任何形式的损坏或毁坏，不一定意味着彻底消失。它可以是部分的、可修复的。而 “annihilation” 强调的是完全、不可逆的消灭，不留任何残余。"
    },
    {
      "word_to_compare": "extinction",
      "analysis": "“Extinction” (灭绝) 通常用于描述物种、语言或文化等的永久消失，强调的是“不再存在”的状态，常用于生物学或文化语境。而 “annihilation” 更强调“被主动摧毁”的过程，具有更强的暴力性和即时性，适用范围更广，包括物质、思想、军队等。"
    },
    {
      "word_to_compare": "eradication",
      "analysis": "“Eradication” (根除) 指系统性地彻底清除某种有害事物（如疾病、杂草、腐败），通常带有积极或治理的意图。它强调方法和过程的彻底性，但不必然伴随物理性爆炸或能量释放。而 “annihilation” 更具毁灭性、冲击性，常带有灾难性或宇宙级的语义色彩。"
    }
  ]
}