{
  "word": "anointed",
  "pronunciation": "uh·noynt·id",
  "concise_definition": "adj. 受膏的, 被选中的; v. 施膏油于, 任命, 祝福",
  "forms": {
    "base_form": "anoint",
    "third_person_singular": "anoints",
    "past_tense": "anointed",
    "past_participle": "anointed",
    "present_participle": "anointing"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having been formally consecrated or set apart by the ritual application of oil, especially in religious contexts, signifying divine selection or sacred authority.",
      "explanation_cn": "指通过仪式性地涂抹油膏而被正式祝圣或分别出来，尤其在宗教语境中，象征被神选中或拥有神圣权威。",
      "example_en": "The anointed king was crowned in a ceremony steeped in ancient tradition.",
      "example_cn": "这位受膏的国王在一场充满古老传统的仪式中加冕。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Figuratively, someone who has been chosen or designated as the preferred or destined leader, often with a sense of legitimacy or divine favor.",
      "explanation_cn": "比喻意义上，指被选中或指定为首选或命中注定的领导者，常带有合法性和神恩眷顾的意味。",
      "example_en": "She was the anointed successor, widely expected to take over the company after her father's retirement.",
      "example_cn": "她是公认的接班人，人们普遍期待她在父亲退休后接管公司。"
    },
    {
      "pos": "verb",
      "explanation_en": "To apply oil or a sacred substance to someone as part of a religious or ceremonial rite, symbolizing blessing, consecration, or empowerment.",
      "explanation_cn": "在宗教或仪式中，将油或其他圣物涂抹于某人身上，象征祝福、祝圣或赋予力量。",
      "example_en": "The priest anointed the child’s forehead with holy oil during the baptism.",
      "example_cn": "神父在洗礼时用圣油在孩子的额头上涂抹。"
    },
    {
      "pos": "verb",
      "explanation_en": "To formally designate or appoint someone to a position of power or responsibility, often with a sense of divine or cultural sanction.",
      "explanation_cn": "正式任命某人担任权力或责任职位，常带有神圣或文化认可的意味。",
      "example_en": "The party anointed their candidate as the official nominee for the presidency.",
      "example_cn": "该党正式任命他们的候选人作为总统职位的正式提名人。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "appointed",
      "analysis": "“Appointed” (任命) 是一个中性、制度化的术语，指通过正式程序或权威决定赋予某人职位，不涉及神圣性或仪式感。而 “anointed” 不仅包含任命，还隐含神圣祝福、天命所归或文化象征的深层含义，情感色彩更浓。"
    },
    {
      "word_to_compare": "chosen",
      "analysis": "“Chosen” (被选中的) 是一个通用词，泛指被选中，可以是随机、人为或偶然的。而 “anointed” 强调被选中是通过特定仪式（如涂油）实现的，具有宗教、传统或象征性权威，暗示一种不可抗拒的天命。"
    },
    {
      "word_to_compare": "consecrated",
      "analysis": "“Consecrated” (祝圣) 侧重于将人或物奉献给神圣用途，使其脱离世俗，常用于教堂、祭坛等对象。而 “anointed” 更强调通过涂油仪式赋予个人领导权或神圣使命，对象通常是人，且常与权力继承或领袖身份直接相关。"
    }
  ]
}