{
  "word": "antagonist",
  "pronunciation": "an·tag·uh·nist",
  "concise_definition": "n. 反派, 对手, 敌人",
  "forms": {
    "plural": "antagonists"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "In literature, film, or drama, the character who opposes the protagonist and creates conflict, often serving as the primary source of tension or obstacle in the story.",
      "explanation_cn": "在文学、电影或戏剧中，指与主角对立、制造冲突的角色，通常是故事中主要紧张感或障碍的来源。",
      "example_en": "The antagonist in the novel is a corrupt politician who manipulates the justice system.",
      "example_cn": "这部小说中的反派是一个操纵司法系统的腐败政客。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person, group, or force that actively opposes or competes against someone or something, not necessarily in a fictional context.",
      "explanation_cn": "指在非虚构语境中，积极反对或与某人或某事物竞争的人、群体或力量。",
      "example_en": "In the battle for environmental reform, the fossil fuel industry has been the main antagonist.",
      "example_cn": "在推动环境改革的斗争中，化石燃料行业一直是主要的对立力量。"
    },
    {
      "pos": "noun",
      "explanation_en": "In biology or pharmacology, a substance that blocks or inhibits the action of another substance, especially a receptor or enzyme.",
      "explanation_cn": "在生物学或药理学中，指阻断或抑制另一种物质（尤其是受体或酶）作用的物质。",
      "example_en": "Beta-blockers are antagonists that reduce heart rate by blocking adrenaline receptors.",
      "example_cn": "β受体阻滞剂是通过阻断肾上腺素受体来降低心率的拮抗剂。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "villain",
      "analysis": "“Villain”（恶棍）通常带有强烈的道德贬义，专指邪恶、有恶意的角色，尤其在童话或超级英雄故事中。而 “antagonist” 是一个中性术语，仅表示对立面，未必邪恶——例如，一个坚持原则的警察可能是主角的 antagonist，但不是 villain。"
    },
    {
      "word_to_compare": "opponent",
      "analysis": "“Opponent”（对手）多用于竞争性语境，如体育、辩论或政治，强调双方在规则框架内的对抗，通常不涉及情感冲突或叙事张力。而 “antagonist” 更常用于叙事结构中，带有更深层的矛盾和情感对抗。"
    },
    {
      "word_to_compare": "adversary",
      "analysis": "“Adversary”（敌手）与 “antagonist” 非常接近，常可互换，但 “adversary” 更强调长期、严肃的对抗关系，常用于政治、军事或哲学语境，语气更正式、庄重。而 “antagonist” 更广泛用于文学和日常语言中，涵盖虚构与现实。"
    }
  ]
}