{
  "word": "anticipated",
  "pronunciation": "an·tish·uh·pey·tɪd",
  "concise_definition": "v. 预期, 预料, 期望; adj. 预期的, 预先的",
  "forms": {
    "base_form": "anticipate",
    "third_person_singular": "anticipates",
    "past_tense": "anticipated",
    "past_participle": "anticipated",
    "present_participle": "anticipating"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To expect or predict something that is likely to happen in the future, often with preparation or planning in advance.",
      "explanation_cn": "指预期或预测未来可能发生的事情，通常伴随着提前的准备或规划。",
      "example_en": "The company anticipated a surge in demand and increased production accordingly.",
      "example_cn": "公司预见到需求激增，因此相应地增加了产量。"
    },
    {
      "pos": "verb",
      "explanation_en": "To deal with or act on something before it actually occurs, in order to prevent problems or gain an advantage.",
      "explanation_cn": "指在某事实际发生之前就采取行动，以避免问题或获得优势。",
      "example_en": "She anticipated his objection by addressing the issue in her opening remarks.",
      "example_cn": "她在开场白中就提到了这个问题，提前回应了他的反对意见。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Something that is planned, prepared, or expected in advance; often used to describe events, needs, or responses that occur before the expected time.",
      "explanation_cn": "指预先计划、准备或预期的事物；常用于描述比预期时间更早发生的事件、需求或反应。",
      "example_en": "The anticipated arrival of the shipment was moved up by two days.",
      "example_cn": "货物的预期到达时间被提前了两天。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "expect",
      "analysis": "“Expect” (期待) 是最通用的词，表示对某事发生的信念或心理预期，不一定包含行动。而 “anticipate” 不仅包含预期，还隐含了为应对该事件所做的准备或主动干预，语义更丰富、更具主动性。"
    },
    {
      "word_to_compare": "predict",
      "analysis": "“Predict” (预测) 强调基于数据、分析或逻辑推断出未来事件，通常用于科学、气象或经济语境，语气更客观、中立。而 “anticipate” 更常用于主观判断，且常伴随情感或策略性反应，如担忧、兴奋或准备。"
    },
    {
      "word_to_compare": "foresee",
      "analysis": "“Foresee” (预见) 指通过洞察力或直觉提前看到未来可能发生的情况，常带有一种智慧或远见的意味，但不必然包含行动。而 “anticipate” 更强调“因预见而采取行动”，是预见与应对的结合体。"
    }
  ]
}