{
  "word": "apostolic",
  "pronunciation": "a·päs·tä·lik",
  "concise_definition": "adj. 使徒的, 使徒传承的, 与使徒有关的",
  "forms": {
    "comparative": "more apostolic",
    "superlative": "most apostolic"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or derived from the apostles, the original disciples of Jesus Christ, especially in the context of Christian doctrine, authority, or succession.",
      "explanation_cn": "与耶稣基督的十二使徒有关，或源自他们的教导、权威或传承，尤其用于基督教教义、教会权威或主教继承的语境中。",
      "example_en": "The church claims apostolic succession, meaning its bishops trace their authority back to the original apostles.",
      "example_cn": "该教会声称拥有使徒统绪，意味着其主教的权威可追溯至最初的使徒。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by the spirit, teachings, or practices associated with the early Christian apostles, often implying simplicity, zeal, or missionary fervor.",
      "explanation_cn": "具有早期基督教使徒所体现的精神、教义或实践特征，常暗示简朴、热忱或传教的激情。",
      "example_en": "The apostolic mission of the early monks was to spread the Gospel to remote villages.",
      "example_cn": "早期修士的使徒使命是将福音传播到偏远的村庄。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used in the name of certain Christian groups that emphasize adherence to the practices and beliefs of the first-century Church, such as the Apostolic Church or Apostolic Pentecostals.",
      "explanation_cn": "用于某些强调遵守公元一世纪教会实践与信仰的基督教团体名称中，如使徒教会或使徒派五旬节派。",
      "example_en": "She belongs to an Apostolic Pentecostal congregation that practices strict dress codes and divine healing.",
      "example_cn": "她属于一个使徒派五旬节教会，该教会实行严格的着装规范并相信神迹医治。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "apostate",
      "analysis": "“Apostate”（背教者）指放弃信仰的人，与 “apostolic” 形成鲜明对立：前者是背离使徒传统，后者是坚守使徒传统。两者词根相同，但语义完全相反。"
    },
    {
      "word_to_compare": "ecclesiastical",
      "analysis": "“Ecclesiastical”（教会的）泛指与教会组织、制度或事务相关的一切，范围更广，不特指使徒传承。而 “apostolic” 专指与使徒直接相关的权威或传统，具有历史和神学上的特殊性。"
    },
    {
      "word_to_compare": "evangelical",
      "analysis": "“Evangelical”（福音派的）强调传播福音、个人归信和圣经权威，虽与使徒传教精神有关，但不必然主张使徒统绪或教会组织的连续性。而 “apostolic” 更侧重于教会权威的传承脉络，而非仅福音传播。"
    }
  ]
}