{
  "word": "appeals",
  "pronunciation": "uh·peelz",
  "concise_definition": "n. 呼吁, 上诉, 吸引力, v. 呼吁, 上诉, 有吸引力",
  "forms": {
    "singular": "appeal",
    "third_person_singular": "appeals",
    "past_tense": "appealed",
    "past_participle": "appealed",
    "present_participle": "appealing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A formal request, especially to a court or authority, to change a decision that has been made.",
      "explanation_cn": "指向法院或权威机构提出的正式请求，要求更改已作出的决定。",
      "example_en": "The defendant filed an appeal against the guilty verdict.",
      "example_cn": "被告就有罪判决提出了上诉。"
    },
    {
      "pos": "noun",
      "explanation_en": "The quality of being attractive or interesting, especially in a way that influences people's emotions or preferences.",
      "explanation_cn": "指某种具有吸引力或趣味性的特质，尤其能影响人们的情感或偏好。",
      "example_en": "The charm of the old town lies in its quiet appeals to history lovers.",
      "example_cn": "这座古镇的魅力在于它对历史爱好者的独特吸引力。"
    },
    {
      "pos": "noun",
      "explanation_en": "An earnest request or plea, often directed at the public or a group to inspire action or support.",
      "explanation_cn": "指一种恳切的请求，通常面向公众或某群体，以激发行动或支持。",
      "example_en": "The charity launched an appeal for donations after the earthquake.",
      "example_cn": "地震后，该慈善机构发起了募捐呼吁。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a formal request to a higher authority, especially a court, to reverse or modify a decision.",
      "explanation_cn": "指向更高权威（尤其是法院）提出正式请求，以推翻或修改某项决定。",
      "example_en": "She appealed the court's ruling to the Supreme Court.",
      "example_cn": "她将法院的裁决上诉至最高法院。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be attractive or interesting to someone, especially in a way that resonates emotionally or intellectually.",
      "explanation_cn": "指对某人具有吸引力或趣味性，尤其能引起情感或理智上的共鸣。",
      "example_en": "The idea of working abroad doesn't appeal to her.",
      "example_cn": "到国外工作的想法对她没有吸引力。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a heartfelt request or plea, often to inspire sympathy, support, or action.",
      "explanation_cn": "指发出真诚的请求或呼吁，通常旨在唤起同情、支持或行动。",
      "example_en": "The mayor appealed to citizens to stay calm during the crisis.",
      "example_cn": "市长呼吁市民在危机期间保持冷静。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "request",
      "analysis": "“Request”（请求）是一个中性、通用的词，指提出某种要求，不一定带有情感色彩或紧迫性。而 “appeal” 更强调情感上的恳求或道德上的呼吁，常用于公共或紧急情境，语气更强烈。"
    },
    {
      "word_to_compare": "attraction",
      "analysis": "“Attraction”（吸引力）是名词，侧重于客观存在的吸引特质，常用于物理或美学层面。而 “appeal” 作为名词时，更强调主观感受——某事物是否“打动”或“引起共鸣”，常用于抽象概念如理念、风格或生活方式。"
    },
    {
      "word_to_compare": "plea",
      "analysis": "“Plea”（恳求）与 “appeal” 在呼吁意义上非常接近，但 “plea” 更常用于法律语境（如 plea bargain）或极度绝望的请求，情感强度更高，有时带有卑微或无助的色彩。而 “appeal” 更正式、更广泛，可用于公共、法律或情感层面。"
    }
  ]
}