{
  "word": "appeal",
  "pronunciation": "uh·peel",
  "concise_definition": "n. 呼吁, 上诉, 吸引力; v. 呼吁, 上诉, 有吸引力",
  "forms": {
    "third_person_singular": "appeals",
    "past_tense": "appealed",
    "past_participle": "appealed",
    "present_participle": "appealing",
    "plural": "appeals"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A formal request to a higher authority, especially a court, to change a decision made by a lower court or official body.",
      "explanation_cn": "指向上级权威（尤其是法院）提出的正式请求，要求更改下级法院或官方机构作出的决定。",
      "example_en": "The defendant filed an appeal against the guilty verdict.",
      "example_cn": "被告就有罪判决提出了上诉。"
    },
    {
      "pos": "noun",
      "explanation_en": "The power or quality of being attractive or interesting, especially in a way that influences people's emotions or preferences.",
      "explanation_cn": "指某种事物具有吸引人、引起兴趣的特质，尤其能影响人们的情感或偏好。",
      "example_en": "The appeal of the countryside lies in its peace and natural beauty.",
      "example_cn": "乡村的魅力在于它的宁静与自然美景。"
    },
    {
      "pos": "noun",
      "explanation_en": "An earnest request or plea, often directed at the public or a group to take action or show sympathy.",
      "explanation_cn": "指恳切的请求或呼吁，通常面向公众或某群体，以促使他们采取行动或表示同情。",
      "example_en": "The charity launched an appeal for donations to help flood victims.",
      "example_cn": "该慈善机构发起了募捐呼吁，以帮助洪灾受害者。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a formal request to a higher authority, especially a court, to reverse or modify a decision.",
      "explanation_cn": "指向上级权威（尤其是法院）提出正式请求，以推翻或修改某项决定。",
      "example_en": "She appealed the court's ruling on the grounds of legal error.",
      "example_cn": "她以法律错误为由对法院的裁决提出了上诉。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be attractive or interesting to someone, especially in a way that resonates emotionally or aesthetically.",
      "explanation_cn": "指对某人具有吸引力或趣味性，尤其能引起情感或审美上的共鸣。",
      "example_en": "Modern art doesn't appeal to everyone, but it speaks deeply to those who understand it.",
      "example_cn": "现代艺术并非人人都喜欢，但对理解它的人来说却能产生深刻共鸣。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make an earnest request or plea to someone, often to inspire action or compassion.",
      "explanation_cn": "指恳切地向某人提出请求，通常旨在激发行动或同情心。",
      "example_en": "The mayor appealed to citizens to stay calm during the emergency.",
      "example_cn": "市长呼吁市民在紧急情况下保持冷静。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "request",
      "analysis": "“Request”（请求）是一个中性、通用的词，指提出希望得到某物或某事的意愿，不带有强烈情感或正式性。而 “appeal” 更强调情感上的恳求或正式程序中的申诉，常带有紧迫性、道德感或法律背景。"
    },
    {
      "word_to_compare": "attraction",
      "analysis": "“Attraction”（吸引力）是名词，侧重于客观存在的吸引特质，常用于物理、美学或性吸引力层面。而 “appeal” 更广泛，可涵盖情感、价值观、理念等主观层面的吸引，且常用于抽象语境，如‘the appeal of freedom’。"
    },
    {
      "word_to_compare": "plea",
      "analysis": "“Plea”（恳求）与 “appeal” 在‘恳求’义项上接近，但 “plea” 更常用于法律语境（如 guilty plea）或极度绝望的请求，语气更强烈、情绪更浓烈；而 “appeal” 更正式、理性，可适用于公共呼吁或司法程序，语义范围更广。"
    }
  ]
}