{
  "word": "applying",
  "pronunciation": "uhp·plahy-ing",
  "concise_definition": "v. 应用, 申请, 施加, 专心致志",
  "forms": {
    "base_form": "apply",
    "third_person_singular": "applies",
    "past_tense": "applied",
    "past_participle": "applied",
    "present_participle": "applying"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To put something into use for a specific purpose, especially a method, principle, or skill, in order to achieve a practical result.",
      "explanation_cn": "指将某种方法、原则或技能用于特定目的，以实现实际效果。",
      "example_en": "She is applying her knowledge of psychology to improve workplace communication.",
      "example_cn": "她正将自己对心理学的知识应用于改善职场沟通。"
    },
    {
      "pos": "verb",
      "explanation_en": "To formally request something, such as a job, admission, or permission, typically by submitting an application.",
      "explanation_cn": "指正式提出请求，如申请工作、入学或许可，通常通过提交申请表进行。",
      "example_en": "He is applying for a visa to study in Canada.",
      "example_cn": "他正在申请前往加拿大留学的签证。"
    },
    {
      "pos": "verb",
      "explanation_en": "To put pressure, force, or a substance onto a surface or area, often with deliberate intent.",
      "explanation_cn": "指有意识地将压力、力量或物质施加于某表面或区域。",
      "example_en": "The doctor is applying a cold compress to reduce the swelling.",
      "example_cn": "医生正在敷冷敷以减轻肿胀。"
    },
    {
      "pos": "verb",
      "explanation_en": "To devote one's attention or effort to a task or activity with focus and dedication.",
      "explanation_cn": "指全神贯注地投入某项任务或活动中，表现出专注与热忱。",
      "example_en": "She is applying herself to learning Mandarin with great determination.",
      "example_cn": "她正以极大的决心专心学习普通话。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "use",
      "analysis": "“Use” (使用) 是一个更通用的词，泛指任何利用某物的行为，不强调目的性或系统性。而 “applying” 更侧重于将知识、技能或原则有意识地、有针对性地用于解决具体问题或实现特定目标，语义更精确、更正式。"
    },
    {
      "word_to_compare": "submit",
      "analysis": "“Submit” (提交) 仅指将申请材料或文件递交给某人或某机构，是 “applying” 在申请场景中的一个动作环节。而 “applying” 包含了整个申请过程，包括准备、提交和后续跟进，语义范围更广。"
    },
    {
      "word_to_compare": "implement",
      "analysis": "“Implement” (实施) 通常指执行一项计划、政策或系统，强调从理论到实践的完整落地过程，常用于组织或制度层面。而 “applying” 更常用于个体层面，指将抽象概念（如理论、技巧）应用于具体情境，范围更小、更灵活。"
    }
  ]
}