{
  "word": "apply",
  "pronunciation": "uh·plahy",
  "concise_definition": "v. 申请, 应用, 施加, 专心致志",
  "forms": {
    "third_person_singular": "applies",
    "past_tense": "applied",
    "past_participle": "applied",
    "present_participle": "applying"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To make a formal request for something, such as a job, admission, or permission, typically by submitting written or online documentation.",
      "explanation_cn": "指为获得某事物（如工作、入学资格或许可）而正式提出申请，通常需提交书面或在线材料。",
      "example_en": "She applied for a scholarship to study abroad last month.",
      "example_cn": "她上个月申请了一项出国留学的奖学金。"
    },
    {
      "pos": "verb",
      "explanation_en": "To put something into use, especially a principle, method, or tool, in order to achieve a specific result or solve a problem.",
      "explanation_cn": "指将某种原则、方法或工具实际运用于特定情境，以达成目标或解决问题。",
      "example_en": "This formula can be applied to calculate the area of any triangle.",
      "example_cn": "这个公式可用于计算任意三角形的面积。"
    },
    {
      "pos": "verb",
      "explanation_en": "To put or spread something onto a surface, often in a thin or even layer.",
      "explanation_cn": "指将某种物质涂抹或施加于表面，通常呈薄而均匀的一层。",
      "example_en": "He applied sunscreen before going to the beach.",
      "example_cn": "他去海滩前涂了防晒霜。"
    },
    {
      "pos": "verb",
      "explanation_en": "To devote one's attention or effort to a task or activity with seriousness and focus.",
      "explanation_cn": "指以认真和专注的态度投入精力于某项任务或活动。",
      "example_en": "If you want to master the piano, you must apply yourself consistently.",
      "example_cn": "如果你想精通钢琴，就必须专心致志地练习。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "request",
      "analysis": "“Request” (请求) 是一个更通用的词，指提出愿望或要求，但不一定涉及正式程序或书面材料。而 “apply” 强调遵循特定流程或提交正式申请，常用于就业、教育等制度性场景。"
    },
    {
      "word_to_compare": "use",
      "analysis": "“Use” (使用) 是最广泛的词，泛指任何利用某物的行为，不强调目的性或系统性。而 “apply” 在表示“应用”时，隐含将理论、方法或规则有针对性地用于解决实际问题，更具目的性和专业性。"
    },
    {
      "word_to_compare": "implement",
      "analysis": "“Implement” (实施) 通常用于政策、计划或系统的全面执行，强调从设计到落地的完整过程，语体更正式、更宏观。而 “apply” 更常用于个体或局部层面的操作，如应用规则、技术或技巧。"
    },
    {
      "word_to_compare": "devote",
      "analysis": "“Devote” (奉献/投入) 强调情感或时间上的长期投入，常与时间、精力、生命等抽象名词搭配，如 devote time to。而 “apply oneself” 是固定搭配，强调专注和努力，更侧重行为上的集中，而非情感上的奉献。"
    }
  ]
}