{
  "word": "appropriation",
  "pronunciation": "uh·pruh·wee·ay·shun",
  "concise_definition": "n. 挪用, 拨款, 占用",
  "forms": {
    "plural": "appropriations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of taking or setting aside money, resources, or property for a specific purpose, especially by a government or official body.",
      "explanation_cn": "指政府或官方机构为特定目的而划拨、占用资金、资源或财产的行为，通常具有法律或行政效力。",
      "example_en": "The congressional appropriation of $50 million for disaster relief was approved last week.",
      "example_cn": "国会上周批准了五千万美元用于灾害救助的拨款。"
    },
    {
      "pos": "noun",
      "explanation_en": "The unauthorized or unethical use of someone else's ideas, cultural elements, or creative work, often without permission or credit.",
      "explanation_cn": "指未经许可或未致谢地使用他人的思想、文化元素或创意作品，常带有道德或法律上的争议。",
      "example_en": "The fashion brand faced criticism for cultural appropriation after using sacred Indigenous patterns in its collection.",
      "example_cn": "该时尚品牌在系列设计中使用了原住民的神圣图案后，因文化挪用而遭到批评。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of seizing or taking control of something, often forcibly or by legal means, for one's own use.",
      "explanation_cn": "指通过强制手段或合法途径将某物据为己有，强调占有行为本身。",
      "example_en": "The appropriation of land by colonial powers led to widespread displacement of indigenous populations.",
      "example_cn": "殖民势力对土地的侵占导致了原住民的大规模流离失所。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "allocation",
      "analysis": "“Allocation” (分配) 是中性词，指根据计划或需求将资源合理分派给不同用途，通常不涉及权力或强制，强调公平与程序。而 “appropriation” 常隐含权力主体单方面决定用途，有时带有排他性或强制性，尤其在政府拨款语境中。"
    },
    {
      "word_to_compare": "theft",
      "analysis": "“Theft” (盗窃) 是明确的刑事犯罪，指以非法占有为目的秘密窃取他人财物，具有主观恶意和违法性。而 “appropriation” 在某些语境下（如文化挪用）虽具道德争议，但未必构成法律意义上的盗窃，有时甚至通过合法程序完成（如政府拨款）。"
    },
    {
      "word_to_compare": "adoption",
      "analysis": "“Adoption” (采用/采纳) 指主动接受并使用某种思想、方法或文化元素，通常伴随尊重、理解与授权，强调正面转化。而 “appropriation” 常带有剥削、去语境化或缺乏尊重的意味，尤其在文化语境中，二者形成道德上的对立。"
    }
  ]
}