{
  "word": "arabic",
  "pronunciation": "uh·rab·ik",
  "concise_definition": "adj. 阿拉伯的, 阿拉伯语的; n. 阿拉伯语, 阿拉伯人",
  "forms": {
    "comparative": "more arabic",
    "superlative": "most arabic"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to the Arab people, their culture, language, or countries in the Middle East and North Africa, especially those where Arabic is the primary language.",
      "explanation_cn": "与阿拉伯民族、其文化、语言或中东和北非国家相关的，尤指以阿拉伯语为主要语言的地区。",
      "example_en": "The architecture of the Alhambra reflects beautiful arabic design.",
      "example_cn": "阿尔罕布拉宫的建筑体现了优美的阿拉伯风格。"
    },
    {
      "pos": "noun",
      "explanation_en": "The Semitic language spoken by over 400 million people across the Middle East and North Africa, written from right to left using a distinctive script.",
      "explanation_cn": "一种闪米特语，由中东和北非超过四亿人使用，使用独特的右至左书写系统。",
      "example_en": "She is studying arabic to better understand Islamic texts.",
      "example_cn": "她正在学习阿拉伯语，以便更好地理解伊斯兰经典。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is native to or identifies with the Arab world, typically speaking Arabic as their first language.",
      "explanation_cn": "指原籍或认同于阿拉伯世界的人，通常以阿拉伯语为母语。",
      "example_en": "Many arabic poets have contributed significantly to world literature.",
      "example_cn": "许多阿拉伯诗人对世界文学作出了重要贡献。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "arab",
      "analysis": "“Arab” (阿拉伯人/阿拉伯的) 是一个更常用、更直接的名词或形容词，指代民族或文化主体，常用于口语和日常语境。而 “arabic” 更强调语言、文字或文化特征的属性，尤其在指语言时，只能用 “arabic”。例如：He is an Arab (他是阿拉伯人)，但必须说 “He speaks Arabic (他说阿拉伯语)”。"
    },
    {
      "word_to_compare": "middle eastern",
      "analysis": "“Middle Eastern” (中东的) 是一个地理政治术语，涵盖包括阿拉伯国家在内的多个民族和语言群体（如波斯人、土耳其人、犹太人等）。而 “arabic” 仅特指以阿拉伯语为母语的民族和文化，范围更窄、更精确。并非所有中东人都是阿拉伯人，但所有阿拉伯人都是中东人。"
    },
    {
      "word_to_compare": "islamic",
      "analysis": "“Islamic” (伊斯兰的) 指与伊斯兰教信仰、宗教实践或教义相关的事物，而 “arabic” 仅指语言或民族属性。虽然许多阿拉伯人信仰伊斯兰教，但伊斯兰文化也包含非阿拉伯民族（如印尼人、巴基斯坦人），而阿拉伯人中也有基督徒和穆斯林以外的信仰者。两者不可互换。"
    }
  ]
}