{
  "word": "arab",
  "pronunciation": "uh·rab",
  "concise_definition": "n. 阿拉伯人, 阿拉伯语的; adj. 阿拉伯的, 阿拉伯人的",
  "forms": {
    "plural": "arabs"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person whose ethnic, cultural, or linguistic origin is from the Arab world, typically speaking Arabic as a native language and often sharing common cultural traditions.",
      "explanation_cn": "指来自阿拉伯世界、以阿拉伯语为母语、并通常共享共同文化传统的民族或个人。",
      "example_en": "Many Arabs live in countries such as Saudi Arabia, Egypt, and Lebanon.",
      "example_cn": "许多阿拉伯人居住在沙特阿拉伯、埃及和黎巴嫩等国家。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to the Arab world, its people, languages, or culture; describing anything originating from or characteristic of the Arabic-speaking regions.",
      "explanation_cn": "与阿拉伯世界、其人民、语言或文化相关的；描述源自阿拉伯语地区或具有其特征的事物。",
      "example_en": "Arab architecture features intricate geometric patterns and domed roofs.",
      "example_cn": "阿拉伯建筑以复杂的几何图案和圆顶屋顶为特色。"
    },
    {
      "pos": "noun",
      "explanation_en": "A member of a Semitic people native to the Arabian Peninsula and surrounding regions, historically associated with nomadic tribes and later with major empires and civilizations.",
      "explanation_cn": "指原生于阿拉伯半岛及周边地区的闪米特民族成员，历史上与游牧部落相关，后发展为重要的帝国与文明。",
      "example_en": "The spread of Islam in the 7th century was closely tied to the expansion of Arab influence.",
      "example_cn": "公元7世纪伊斯兰教的传播与阿拉伯影响力的扩张密切相关。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "middle_eastern",
      "analysis": "“Middle Eastern”（中东的）是一个地理政治术语，涵盖包括阿拉伯国家在内的多个民族和文化群体，如波斯人、土耳其人、犹太人等。而 “Arab” 仅指以阿拉伯语为母语、具有阿拉伯民族认同的人群。因此，所有阿拉伯人都是中东人，但并非所有中东人都是阿拉伯人。"
    },
    {
      "word_to_compare": "muslim",
      "analysis": "“Muslim”（穆斯林）指信仰伊斯兰教的人，无论其民族或语言背景，包括印尼人、巴基斯坦人、土耳其人等。而 “Arab” 是一个民族/语言分类，阿拉伯人中绝大多数是穆斯林，但也有阿拉伯基督徒和犹太人。因此，这两个词属于不同维度：一个是宗教，一个是民族。"
    },
    {
      "word_to_compare": "berber",
      "analysis": "“Berber”（柏柏尔人）是北非的原住民族，主要分布在摩洛哥、阿尔及利亚等地，虽然许多柏柏尔人生活在阿拉伯国家，但他们拥有独立的语言（柏柏尔语）和文化传统，不属于阿拉伯民族。尽管长期受阿拉伯文化影响，他们仍被视为不同的族群。"
    }
  ]
}