{
  "word": "arabian",
  "pronunciation": "uh·rabe·ee·uhn",
  "concise_definition": "adj. 阿拉伯的, 阿拉伯人的; n. 阿拉伯马",
  "forms": {
    "comparative": "more Arabian",
    "superlative": "most Arabian"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or originating from Arabia, the Arabian Peninsula, or the Arab people; describing culture, language, geography, or traditions associated with the Arab world.",
      "explanation_cn": "与阿拉伯半岛、阿拉伯人或阿拉伯世界相关的；描述阿拉伯地区的文化、语言、地理或传统。",
      "example_en": "The Arabian Desert is one of the largest sand deserts in the world.",
      "example_cn": "阿拉伯沙漠是世界上最大的沙质沙漠之一。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Specifically referring to the Arabian horse, a breed known for its elegance, endurance, and distinctive head shape.",
      "explanation_cn": "特指阿拉伯马，一种以优雅、耐力和独特头部轮廓著称的马种。",
      "example_en": "She won first prize with her purebred Arabian at the equestrian show.",
      "example_cn": "她在马术展览上凭借一匹纯种阿拉伯马获得了一等奖。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person from Arabia or of Arab descent; sometimes used in older or literary contexts to refer to an Arab individual.",
      "explanation_cn": "来自阿拉伯或具有阿拉伯血统的人；在较旧或文学语境中用以指代阿拉伯人。",
      "example_en": "The traveler met several Arabian traders along the Silk Road.",
      "example_cn": "这位旅行者在丝绸之路上遇到了几位阿拉伯商人。"
    },
    {
      "pos": "noun",
      "explanation_en": "The Arabian horse, especially when referred to as a specific breed in equestrian contexts.",
      "explanation_cn": "阿拉伯马，尤其在马术语境中作为特定马种的称呼。",
      "example_en": "The Arabian is prized for its spirited temperament and graceful movement.",
      "example_cn": "阿拉伯马因其活泼的性情和优雅的步态而备受推崇。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "Arabic",
      "analysis": "“Arabic” (阿拉伯语的/阿拉伯语) 主要指语言（如 Arabic language）或与语言直接相关的文化特征，而 “Arabian” 更广泛地指地理、民族或特定事物（如阿拉伯马、阿拉伯沙漠）。虽然有时可互换，但 “Arabic” 更侧重语言和文字系统，而 “Arabian” 更具文化与地域整体性。"
    },
    {
      "word_to_compare": "Middle Eastern",
      "analysis": "“Middle Eastern” (中东的) 是一个更宽泛的地理政治术语，涵盖从北非到中亚的多个国家和地区，包括阿拉伯国家、伊朗、土耳其等。而 “Arabian” 仅特指阿拉伯半岛及其阿拉伯民族，范围更小、更精确。并非所有中东国家都是阿拉伯国家，因此两者不可等同。"
    },
    {
      "word_to_compare": "Bedouin",
      "analysis": "“Bedouin” (贝都因人) 指阿拉伯半岛上传统的游牧民族，是阿拉伯人中的一个特定群体。而 “Arabian” 是一个更广泛的民族或地域性术语，包含定居的、城市的阿拉伯人。所有贝都因人都是阿拉伯人，但并非所有阿拉伯人都是贝都因人。"
    }
  ]
}