{
  "word": "arc",
  "pronunciation": "ahrk",
  "concise_definition": "n. 弧, 拱形, 弧线; v. 弧形移动, 弯曲",
  "forms": {
    "plural": "arcs"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A curved line or segment that forms part of the circumference of a circle or other curved shape, often used in geometry, engineering, and design.",
      "explanation_cn": "指构成圆或其他曲线形状一部分的弯曲线段，常用于几何学、工程学和设计中。",
      "example_en": "The bridge was built with a graceful stone arc spanning the river.",
      "example_cn": "这座桥由一道优美的石拱跨越河流。"
    },
    {
      "pos": "noun",
      "explanation_en": "A curved path or trajectory followed by an object in motion, especially one that is visible or dramatic.",
      "explanation_cn": "指物体运动时所遵循的弯曲路径或轨迹，尤其指明显或引人注目的轨迹。",
      "example_en": "The basketball followed a high arc before sinking through the net.",
      "example_cn": "篮球在落入篮网前划出了一道高高的弧线。"
    },
    {
      "pos": "noun",
      "explanation_en": "In storytelling or drama, a long-term development or transformation in a character’s journey, beliefs, or role over the course of a narrative.",
      "explanation_cn": "在叙事或戏剧中，指角色在故事进程中经历的长期发展、转变，如性格、信念或角色定位的变化。",
      "example_en": "The protagonist’s emotional arc from fear to courage is the heart of the film.",
      "example_cn": "主角从恐惧到勇敢的情感转变是这部电影的核心。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move in a curved path or form a curve, often describing the motion of something thrown, launched, or naturally bending.",
      "explanation_cn": "指以弯曲的路径移动，或形成曲线，常用于描述被投掷、发射或自然弯曲的物体的运动。",
      "example_en": "The rainbow arced across the sky after the rain.",
      "example_cn": "雨后，彩虹横跨天空。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "curve",
      "analysis": "“Curve” (曲线) 是一个更广泛、更通用的词，泛指任何偏离直线的形状，可以是连续的、不规则的或抽象的。而 “arc” 特指圆的一部分或规则的、对称的弯曲，通常具有明确的半径和中心点，更具几何精确性。"
    },
    {
      "word_to_compare": "bow",
      "analysis": "“Bow” (弓形) 常用于描述像弓一样的弯曲形状，尤其指两端固定、中间隆起的结构，如桥梁或头发的弯曲。它更强调静态的形态，而 “arc” 更强调动态的轨迹或几何定义的曲线。"
    },
    {
      "word_to_compare": "trajectory",
      "analysis": "“Trajectory” (轨迹) 专指物体在空间中运动的路径，尤其在物理学中强调受力作用下的运动路线。它是一个科学术语，而 “arc” 可以是轨迹的一种形式，但更常用于视觉或文学描述，不局限于物理规律。"
    }
  ]
}