{
  "word": "arcade",
  "pronunciation": "ahr·keed",
  "concise_definition": "n. 拱廊, 游戏厅, 商业街",
  "forms": {
    "plural": "arcades"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A covered walkway, typically lined with shops or stalls, often supported by arches, commonly found in historic or urban settings.",
      "explanation_cn": "一种有顶的通道，通常两侧设有商店或摊位，由拱门支撑，常见于历史街区或城市环境中。",
      "example_en": "The old town center features a beautiful stone arcade with boutique shops and cafés.",
      "example_cn": "这座古镇中心有一条美丽的石拱廊，两旁是精品店和咖啡馆。"
    },
    {
      "pos": "noun",
      "explanation_en": "A venue containing a collection of coin-operated video games, pinball machines, and other amusement devices, especially popular among teenagers and young adults.",
      "explanation_cn": "一种设有大量投币式电子游戏机、弹珠机和其他娱乐设备的场所，尤其受青少年和年轻人欢迎。",
      "example_en": "We spent the afternoon at the arcade, trying to beat our high scores on the racing games.",
      "example_cn": "我们下午在游戏厅度过，试图在赛车游戏中打破自己的最高分。"
    },
    {
      "pos": "noun",
      "explanation_en": "A row of shops or businesses arranged along a pedestrian walkway, often as part of a larger commercial complex or shopping mall.",
      "explanation_cn": "沿步行道排列的一排商店或商业设施，通常是大型商业综合体或购物中心的一部分。",
      "example_en": "The new shopping mall includes a luxury arcade with designer brands and gourmet food stalls.",
      "example_cn": "这座新购物中心包含一条奢侈品拱廊，设有设计师品牌店和美食摊位。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mall",
      "analysis": "“Mall”（购物中心）是一个大型、封闭或半封闭的商业综合体，包含众多商店、餐厅、影院等，结构复杂且功能全面。而 “arcade” 可以是其中的一部分，更强调线性通道或特定风格的商业空间，规模较小，有时是开放式的。"
    },
    {
      "word_to_compare": "passage",
      "analysis": "“Passage”（通道）泛指任何连接两个地点的通道，可以是简单的走廊或隧道，无商业功能。而 “arcade” 特指带有商业或装饰性拱顶结构的通道，具有明确的用途和美学设计。"
    },
    {
      "word_to_compare": "amusement park",
      "analysis": "“Amusement park”（游乐园）是一个大型户外或半户外娱乐场所，包含过山车、旋转木马等大型设施，强调体验式娱乐。而 “arcade” 通常为室内场所，主要提供电子游戏和小型投币设备，规模小、集中度高，更偏向于技能型娱乐。"
    }
  ]
}