{
  "word": "arch",
  "pronunciation": "ahrk",
  "concise_definition": "n. 尖拱, 拱门; v. 弯曲, 弓起",
  "forms": {
    "plural": "arches",
    "third_person_singular": "arches",
    "past_tense": "arched",
    "past_participle": "arched",
    "present_participle": "arching"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A curved structure that spans an opening and supports the weight above it, commonly used in architecture for doorways, bridges, and windows.",
      "explanation_cn": "一种跨越开口并支撑其上方重量的弧形结构，常用于建筑中的门道、桥梁和窗户。",
      "example_en": "The cathedral's stained-glass windows are framed by beautiful stone arches.",
      "example_cn": "大教堂的彩绘玻璃窗由美丽的石拱门环绕。"
    },
    {
      "pos": "noun",
      "explanation_en": "The curved, raised part of the foot that supports body weight and provides balance during walking or running.",
      "explanation_cn": "脚部的弧形隆起部分，在行走或跑步时支撑体重并提供平衡。",
      "example_en": "She has high arches, so she needs special insoles for her shoes.",
      "example_cn": "她的足弓较高，因此需要为鞋子配备特殊的鞋垫。"
    },
    {
      "pos": "verb",
      "explanation_en": "To bend or curve something upward, especially the back or eyebrows, often to express emotion or posture.",
      "explanation_cn": "使某物向上弯曲，尤指背部或眉毛，常用于表达情绪或姿势。",
      "example_en": "He arched his back as he stretched after the long flight.",
      "example_cn": "长途飞行后，他伸了个懒腰，背部弓起。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form or shape something into an arch, especially in construction or design.",
      "explanation_cn": "在建筑或设计中，将某物塑造成拱形。",
      "example_en": "The mason arched the doorway to match the medieval style of the building.",
      "example_cn": "石匠将门道砌成拱形，以匹配建筑的中世纪风格。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bridge",
      "analysis": "“Bridge” (桥) 是一种用于跨越障碍（如河流、道路）的结构，主要功能是连接两端，通常为直线或平缓曲线，强调通行功能。而 “arch” 是一种特定的结构形态，强调弧形承重设计，可作为桥梁的一部分，但本身不一定是连接功能的主体。"
    },
    {
      "word_to_compare": "curve",
      "analysis": "“Curve” (曲线) 是一个通用术语，泛指任何非直线的形状，可以是平缓、不规则或闭合的。而 “arch” 是一种特定类型的曲线——对称、向上凸起、具有结构支撑功能，通常两端固定，语义更具体、更工程化。"
    },
    {
      "word_to_compare": "bend",
      "analysis": "“Bend” (弯曲) 是一个更宽泛的动作动词，指任何方向的弯曲，可以是临时的、随意的，如弯腰、折纸。而 “arch” 作为动词时，特指向上、有力度、有形态的弯曲，常用于身体姿态（如弓背）或建筑结构，带有明确的形状意图和美学/功能目的。"
    }
  ]
}