{
  "word": "archives",
  "pronunciation": "ahr·kivs",
  "concise_definition": "n. 档案, 档案馆, 历史记录",
  "forms": {
    "singular": "archive"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A collection of historical records, documents, or other materials that are preserved for their long-term value, often organized and maintained by an institution such as a library, government, or corporation.",
      "explanation_cn": "指为保存其长期价值而系统收集、整理并由图书馆、政府或企业等机构维护的历史记录、文件或其他材料的集合。",
      "example_en": "The national archives contain original copies of the Constitution and Declaration of Independence.",
      "example_cn": "国家档案馆保存着《宪法》和《独立宣言》的原始副本。"
    },
    {
      "pos": "noun",
      "explanation_en": "A place where such records are stored and preserved, often with controlled access and specialized conditions to prevent deterioration.",
      "explanation_cn": "指用于存放和保存此类记录的场所，通常具有受控的访问权限和特殊环境条件以防止材料劣化。",
      "example_en": "Researchers must apply for permission to visit the city's historical archives.",
      "example_cn": "研究人员必须申请许可才能进入该市的历史档案馆。"
    },
    {
      "pos": "noun",
      "explanation_en": "Digital records or stored data from past events, especially in the context of websites, emails, or media content that is no longer actively updated but remains accessible.",
      "explanation_cn": "指过去事件的数字记录或存储数据，尤其指网站、电子邮件或媒体内容中虽已不再更新但仍可访问的存档资料。",
      "example_en": "You can browse the newspaper's archives to read articles from the 1980s.",
      "example_cn": "你可以浏览报纸的存档，阅读20世纪80年代的文章。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "records",
      "analysis": "“Records”（记录）泛指任何形式的记载，可以是临时的、零散的或非系统性的，如会议记录、医疗记录。而 “archives” 强调经过筛选、系统整理并长期保存的具有历史或法律价值的记录集合，具有更强的权威性和持久性。"
    },
    {
      "word_to_compare": "repository",
      "analysis": "“Repository”（存储库）是一个更宽泛的术语，指任何用于存储数据、文件或物品的地方，可以是物理的或数字的，如代码仓库、数据存储中心。而 “archives” 特指以历史保存为目的的存储，强调内容的时间性和文化价值，而非单纯的存储功能。"
    },
    {
      "word_to_compare": "collection",
      "analysis": "“Collection”（收藏/集合）泛指任何有意识聚集的物品或资料，可能出于兴趣、审美或研究目的，如艺术品收藏、邮票收藏。而 “archives” 专指具有原始性、真实性和历史证据价值的文件集合，其核心在于记录事实而非展示或审美。"
    }
  ]
}