{
  "word": "armed",
  "pronunciation": "ahrmd",
  "concise_definition": "adj. 武装的, 持有武器的; v. 装备, 配备 (arm 的过去分词)",
  "forms": {
    "base_form": "arm",
    "past_tense": "armed",
    "past_participle": "armed",
    "present_participle": "arming",
    "third_person_singular": "arms"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Equipped with weapons, especially for combat or defense; referring to individuals, groups, or nations that have access to and are prepared to use firearms, military hardware, or other means of force.",
      "explanation_cn": "配备武器的，尤指用于战斗或防御；指个人、团体或国家拥有并准备使用枪支、军事装备或其他暴力手段。",
      "example_en": "The armed guards stood at the entrance, ready to respond to any threat.",
      "example_cn": "武装警卫站在入口处，随时准备应对任何威胁。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Figuratively, prepared or equipped with something (not necessarily physical weapons) that provides an advantage or means of defense or offense, such as knowledge, skills, or arguments.",
      "explanation_cn": "比喻义，指配备了某种（不一定是实物武器的）优势或攻防手段，如知识、技能或论据。",
      "example_en": "She was armed with facts and statistics to win the debate.",
      "example_cn": "她掌握了事实和数据，以在辩论中取胜。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provide someone or something with weapons or tools necessary for a specific purpose, especially in a military or protective context.",
      "explanation_cn": "为某人或某物配备武器或工具，以满足特定目的，尤其在军事或保护性语境中。",
      "example_en": "The government armed the local militia to defend the border.",
      "example_cn": "政府为地方民兵配备了武器以保卫边境。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "weaponed",
      "analysis": "“Weaponed” 并非标准英语词汇，虽在极少数非正式语境中被使用，但完全不被接受。正确表达应使用 “armed”。‘Armed’ 是唯一被广泛认可且语法规范的形容词形式，用于描述拥有武器的状态。"
    },
    {
      "word_to_compare": "equipped",
      "analysis": "“Equipped” (配备的) 是更广泛的术语，可指配备任何工具、设备或资源，如装备电脑、工具包或技能。而 “armed” 专指配备武器或攻击性手段，语义范围更窄、更具暴力或军事色彩。两者可互换仅当上下文明确涉及武器时。"
    },
    {
      "word_to_compare": "militarized",
      "analysis": "“Militarized” (军事化的) 指整个系统、机构或区域被改造为具有军事性质，如军事化警察、军事化边境。它强调结构和制度层面的转变，而 “armed” 仅描述个体或群体是否持有武器，不涉及系统性变革。"
    }
  ]
}