{
  "word": "armenian",
  "pronunciation": "ahr·mee·nee·uhn",
  "concise_definition": "adj. 亚美尼亚的, 亚美尼亚人的; n. 亚美尼亚人, 亚美尼亚语",
  "forms": {
    "comparative": "more Armenian",
    "superlative": "most Armenian",
    "plural": "Armenians"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to Armenia, its people, culture, or language; describing something originating from or characteristic of the Republic of Armenia or the Armenian diaspora.",
      "explanation_cn": "与亚美尼亚、其人民、文化或语言相关的；描述源自亚美尼亚共和国或亚美尼亚侨民的特征或事物。",
      "example_en": "Armenian cuisine is known for its rich use of herbs, grilled meats, and yogurt-based sauces.",
      "example_cn": "亚美尼亚菜以其丰富的香草、烤肉和酸奶酱而闻名。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is a native or inhabitant of Armenia, or a member of the Armenian ethnic group, regardless of current residence.",
      "explanation_cn": "指亚美尼亚的原住民或居民，或无论现居何处的亚美尼亚族成员。",
      "example_en": "Many Armenian artists and writers have made significant contributions to global culture.",
      "example_cn": "许多亚美尼亚艺术家和作家为全球文化作出了重要贡献。"
    },
    {
      "pos": "noun",
      "explanation_en": "The Indo-European language spoken by Armenians, written in its own unique alphabet, and one of the oldest living languages in the world.",
      "explanation_cn": "亚美尼亚人所使用的印欧语系语言，使用其独有的字母书写，是世界上现存最古老的语言之一。",
      "example_en": "Armenian has two main dialects: Eastern Armenian and Western Armenian.",
      "example_cn": "亚美尼亚语主要有两种方言：东亚美尼亚语和西亚美尼亚语。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "georgian",
      "analysis": "“Georgian”（格鲁吉亚的/格鲁吉亚人）指与格鲁吉亚国家或民族相关的事物，其语言和文化虽同属高加索地区，但与亚美尼亚语无亲缘关系。亚美尼亚语属印欧语系，而格鲁吉亚语属南高加索语系，两者在文字、语法和词汇上均无直接关联。"
    },
    {
      "word_to_compare": "turkish",
      "analysis": "“Turkish”（土耳其的/土耳其人）指与土耳其国家或突厥语族民族相关的事物。尽管亚美尼亚与土耳其地理邻近且历史上有复杂互动，但土耳其语属阿尔泰语系，与亚美尼亚语在语言结构和起源上完全不同。"
    },
    {
      "word_to_compare": "kurdish",
      "analysis": "“Kurdish”（库尔德的/库尔德人）指与库尔德民族及其语言相关的事物。库尔德语属印欧语系伊朗语支，与亚美尼亚语虽同属印欧语系，但分属不同语族，且库尔德人主要分布在中东地区，与亚美尼亚人在历史、宗教和文化传统上存在显著差异。"
    }
  ]
}