{
  "word": "arming",
  "pronunciation": "ahr·mɪŋ",
  "concise_definition": "v. 武装, 装备; 准备 (用于对抗或防御)",
  "forms": {
    "base_form": "arm",
    "third_person_singular": "arms",
    "past_tense": "armed",
    "past_participle": "armed",
    "present_participle": "arming"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To provide someone or something with weapons or military equipment for defense or attack.",
      "explanation_cn": "指为某人或某物配备武器或军事装备，用于防御或进攻。",
      "example_en": "The government is arming its border patrols with advanced surveillance technology.",
      "example_cn": "政府正在为边境巡逻队配备先进的监视技术。"
    },
    {
      "pos": "verb",
      "explanation_en": "To prepare or equip someone mentally or emotionally for a challenging situation, often by instilling confidence or determination.",
      "explanation_cn": "指在心理或情感上为某人做好应对挑战性情境的准备，通常通过增强信心或决心来实现。",
      "example_en": "Her mentor was arming her with the skills and courage needed to lead the team.",
      "example_cn": "她的导师正在为她提供领导团队所需的能力和勇气。"
    },
    {
      "pos": "verb",
      "explanation_en": "To install or connect a mechanism or system that can be activated to perform a specific function, often for safety or defense.",
      "explanation_cn": "指安装或连接某种机制或系统，使其能够被激活以执行特定功能，通常用于安全或防御目的。",
      "example_en": "The aircraft is arming its self-defense missiles upon detecting hostile radar signals.",
      "example_cn": "当探测到敌对雷达信号时，该飞机将启动其自卫导弹系统。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "equipping",
      "analysis": "“Equipping” (配备) 是一个更广泛、中性的词，指提供任何必要的工具、设备或资源，不局限于武器或对抗性用途。例如，为团队配备电脑或帐篷。而 “arming” 特指提供武器或战斗性装备，具有更强的军事或对抗语义。"
    },
    {
      "word_to_compare": "preparing",
      "analysis": "“Preparing” (准备) 是一个通用词，涵盖所有形式的预先安排，包括心理、物质、时间或资源上的准备。而 “arming” 是 “preparing” 的一种特殊形式，特指通过武装或增强战斗力来准备，语义更具体、更具攻击性或防御性。"
    },
    {
      "word_to_compare": "militarizing",
      "analysis": "“Militarizing” (军事化) 指将一个原本非军事的机构、地区或系统转变为具有军事性质或功能，通常涉及制度性、结构性的转变，如军队进驻校园或警察部队使用军用装备。“Arming” 仅指提供武器，是 “militarizing” 的一个步骤，但不必然导致全面军事化。"
    }
  ]
}