{
  "word": "armoured",
  "pronunciation": "ahr·murd",
  "concise_definition": "adj. 装甲的, 有防护的, 戴盔甲的",
  "forms": {
    "comparative": "armoured",
    "superlative": "armoured",
    "variant_spelling": "armored (US)"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Covered or protected by a layer of metal or other strong material, especially to resist attack or damage, commonly used to describe military vehicles, clothing, or structures.",
      "explanation_cn": "被金属或其他坚固材料覆盖或保护，以抵御攻击或损伤，常用于描述军用车辆、服装或结构。",
      "example_en": "The tank moved slowly across the battlefield, its armoured plating deflecting enemy fire.",
      "example_cn": "坦克缓慢地穿越战场，其装甲板挡住了敌方的火力。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Wearing or equipped with protective armor, especially in historical or ceremonial contexts such as medieval knights or modern ceremonial guards.",
      "explanation_cn": "穿着或配备防护盔甲的，尤其用于历史或仪式语境，如中世纪骑士或现代仪仗队。",
      "example_en": "The armoured knight raised his sword, the clang of his chainmail echoing through the courtyard.",
      "example_cn": "那位身披盔甲的骑士举起了剑，锁子甲的撞击声在庭院中回荡。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Figuratively, describing someone or something emotionally or psychologically protected, often to avoid vulnerability or emotional exposure.",
      "explanation_cn": "比喻意义上，形容某人或某物在情感或心理上受到保护，常为避免脆弱或情感暴露。",
      "example_en": "After the betrayal, she became armoured against any new romantic advances.",
      "example_cn": "经历背叛后，她对任何新的感情追求都筑起了心理防线。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "armored",
      "analysis": "“Armored” 是 “armoured” 的美式拼写，两者在含义和用法上完全相同，仅因英式英语与美式英语的拼写差异而不同。在正式写作中，应根据目标读者选择相应拼写。"
    },
    {
      "word_to_compare": "protected",
      "analysis": "“Protected” (受保护的) 是一个更广泛、更通用的词，可指任何形式的防护，如法律保护、环境保护区或数据加密。而 “armoured” 特指由坚硬材料（如金属）构成的物理性防护，语义更具体、更具物质性。"
    },
    {
      "word_to_compare": "reinforced",
      "analysis": "“Reinforced” (加固的) 强调通过添加材料或结构来增强原有物体的强度或耐久性，不一定用于防御攻击。例如，钢筋混凝土是 reinforced concrete。而 “armoured” 专指为抵御攻击或伤害而加装的防护层，具有明确的防御目的。"
    }
  ]
}