{
  "word": "armor",
  "pronunciation": "ar·muhr",
  "concise_definition": "n. 盔甲, 装甲; v. 装甲, 保护",
  "forms": {
    "plural": "armors",
    "third_person_singular": "armors",
    "past_tense": "armored",
    "past_participle": "armored",
    "present_participle": "armoring"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A protective covering made of metal or other strong materials, worn by soldiers or animals in battle to defend against weapons.",
      "explanation_cn": "由金属或其他坚固材料制成的防护装备，供士兵或战马在战斗中穿戴，以抵御武器攻击。",
      "example_en": "The knight wore heavy steel armor during the medieval tournament.",
      "example_cn": "这位骑士在中世纪比武中穿着厚重的钢制盔甲。"
    },
    {
      "pos": "noun",
      "explanation_en": "A protective layer or structure on vehicles, ships, or aircraft designed to resist penetration by bullets, missiles, or other projectiles.",
      "explanation_cn": "安装在车辆、船舶或飞机上，用以抵御子弹、导弹或其他投射物穿透的防护层或结构。",
      "example_en": "The tank's armor can withstand attacks from most small arms fire.",
      "example_cn": "这辆坦克的装甲能抵御大多数轻武器的射击。"
    },
    {
      "pos": "noun",
      "explanation_en": "A metaphorical defense mechanism or barrier that protects someone emotionally or psychologically from harm or criticism.",
      "explanation_cn": "比喻意义上指一个人为保护自己免受情感伤害或批评而建立的心理或情感屏障。",
      "example_en": "After the betrayal, she put up emotional armor and stopped trusting anyone.",
      "example_cn": "遭到背叛后，她筑起了情感上的铠甲，不再信任任何人。"
    },
    {
      "pos": "verb",
      "explanation_en": "To equip with armor or protective material, especially for military or defensive purposes.",
      "explanation_cn": "为某物（尤指军事装备）加装装甲或防护材料，以增强防御能力。",
      "example_en": "The navy armored its destroyers with reinforced plating to survive torpedo strikes.",
      "example_cn": "海军为驱逐舰加装了强化钢板，以抵御鱼雷攻击。"
    },
    {
      "pos": "verb",
      "explanation_en": "To protect or shield someone or something from potential harm, criticism, or emotional impact.",
      "explanation_cn": "保护某人或某物免受潜在伤害、批评或情感冲击。",
      "example_en": "The company armored its executives with legal teams to handle public scrutiny.",
      "example_cn": "该公司为高管配备了法律团队，以应对公众的审视。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "shield",
      "analysis": "“Shield” (盾牌) 通常指一种手持或可移动的防御工具，强调临时性或局部防护，常用于近身战斗或象征性保护。而 “armor” 是覆盖全身或主体的固定防护系统，更全面、持久，适用于长期或高强度防护场景。"
    },
    {
      "word_to_compare": "defense",
      "analysis": "“Defense” (防御) 是一个更广泛的抽象概念，涵盖策略、系统、制度等所有形式的防护手段，而 “armor” 是其具体物质形态之一。例如，国家的国防包括外交、情报、军队等，而装甲车只是其中的物理装备。"
    },
    {
      "word_to_compare": "protection",
      "analysis": "“Protection” (保护) 是一个通用词，可指任何形式的保障，包括法律、环境、情感等，不特指物理材料。而 “armor” 特指由坚硬材料构成的物理性防护层，具有明确的物质属性和军事/工业语境。"
    }
  ]
}