{
  "word": "arms",
  "pronunciation": "ahrms",
  "concise_definition": "n. 手臂, 武器, 军备, 支臂",
  "forms": {
    "singular": "arm"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The upper limb of the human body, extending from the shoulder to the hand, used for lifting, holding, and manipulating objects.",
      "explanation_cn": "人体从肩膀到手的上肢，用于举起、握住和操作物体。",
      "example_en": "She crossed her arms tightly, signaling her discomfort.",
      "example_cn": "她双臂交叉，表现出她的不安。"
    },
    {
      "pos": "noun",
      "explanation_en": "Weapons or military equipment, especially when considered collectively as a means of warfare or defense.",
      "explanation_cn": "武器或军事装备，尤指作为战争或防御手段的总称。",
      "example_en": "The treaty called for the reduction of nuclear arms.",
      "example_cn": "该条约呼吁削减核武器。"
    },
    {
      "pos": "noun",
      "explanation_en": "A branch or division of an organization, institution, or system, often functioning independently but under the same umbrella.",
      "explanation_cn": "组织、机构或体系中的一个分支或部门，通常独立运作但隶属于同一整体。",
      "example_en": "The research arm of the university has published several groundbreaking papers.",
      "example_cn": "大学的研究部门已发表了几篇开创性的论文。"
    },
    {
      "pos": "noun",
      "explanation_en": "A projecting part or extension resembling a human arm, such as the side of a chair, a lamp, or a mechanical device.",
      "explanation_cn": "类似人臂的突出部分或延伸结构，如椅子的扶手、台灯的臂架或机械装置的臂杆。",
      "example_en": "He adjusted the arm of the lamp to direct the light onto his book.",
      "example_cn": "他调整了台灯的灯臂，使光线照在书上。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "limb",
      "analysis": "“Limb”（肢体）是更广泛的解剖学术语，包括手臂、腿、手和脚，而 “arm” 仅指上肢。因此，“limb” 是上位词，而 “arm” 是其具体组成部分。"
    },
    {
      "word_to_compare": "weapon",
      "analysis": "“Weapon”（武器）指具体的攻击性工具，如枪、刀、导弹等，而 “arms” 作为集合名词，涵盖所有类型的武器和军事装备，语义范围更广，常用于政治或军事语境中。"
    },
    {
      "word_to_compare": "branch",
      "analysis": "“Branch”（分支）泛指任何组织、系统或自然结构的分叉部分，如公司分支、河流支流；而 “arm” 在比喻义中特指具有功能独立性但隶属主体的部门，常用于正式或机构语境，语义更具体且带有组织层级感。"
    }
  ]
}