{
  "word": "arousal",
  "pronunciation": "uh·roh·zuhl",
  "concise_definition": "n. 兴奋, 唤起, 激发",
  "forms": {
    "plural": "arousals"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The state of being physically or emotionally stimulated, often involving increased physiological activity such as heart rate, blood pressure, or neural activation, typically in response to a stimulus.",
      "explanation_cn": "指身体或情绪上被刺激的状态，通常伴随着心率、血压或神经活动的增强，常由某种外部或内部刺激引发。",
      "example_en": "The horror movie caused a surge of arousal in the audience, with many viewers gripping their seats tightly.",
      "example_cn": "这部恐怖电影引发了观众的强烈兴奋，许多观众紧紧抓住座椅。"
    },
    {
      "pos": "noun",
      "explanation_en": "In psychology and physiology, the level of alertness or readiness to respond to stimuli, ranging from drowsiness to intense excitement.",
      "explanation_cn": "在心理学和生理学中，指对刺激保持警觉或反应准备的程度，范围从昏昏欲睡到极度兴奋。",
      "example_en": "Moderate levels of arousal are optimal for performance on complex tasks, according to the Yerkes-Dodson Law.",
      "example_cn": "根据耶克斯-多德森定律，中等程度的兴奋水平最有利于复杂任务的表现。"
    },
    {
      "pos": "noun",
      "explanation_en": "A state of sexual excitement or readiness for sexual activity, often triggered by sensory, emotional, or cognitive stimuli.",
      "explanation_cn": "指因感官、情绪或认知刺激而产生的性兴奋或性活动的准备状态。",
      "example_en": "The film's romantic scenes led to increased sexual arousal among viewers.",
      "example_cn": "电影中的浪漫场景引发了观众的性兴奋。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "excitement",
      "analysis": "“Excitement” (兴奋) 是一个更广泛、更口语化的词，可指任何积极的情绪高涨状态，如节日、比赛或惊喜带来的快乐。而 “arousal” 更强调生理层面的激活，常用于科学语境，尤其在心理学和生理学中，具有更精确的测量意义。"
    },
    {
      "word_to_compare": "stimulation",
      "analysis": "“Stimulation” (刺激) 指引发反应的过程或外部输入，是导致 arousal 的原因，而非状态本身。例如，灯光、声音或图像可以是刺激物，而 arousal 是个体对这些刺激产生的内在反应。"
    },
    {
      "word_to_compare": "activation",
      "analysis": "“Activation” (激活) 是一个更中性的神经科学术语，泛指神经系统或身体系统的启动，可用于描述大脑区域的活动、免疫反应等。而 “arousal” 特指与警觉性、情绪或性反应相关的整体激活状态，具有更强的主观体验和行为导向性。"
    }
  ]
}