{
  "word": "arrange",
  "pronunciation": "uh·reynj",
  "concise_definition": "v. 安排, 整理, 协商, 布置",
  "forms": {
    "third_person_singular": "arranges",
    "past_tense": "arranged",
    "past_participle": "arranged",
    "present_participle": "arranging"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To organize or plan something systematically, especially events, tasks, or meetings, so that they happen in an orderly or effective way.",
      "explanation_cn": "指有条理地组织或计划某事，尤其是事件、任务或会议，使其以有序或有效的方式进行。",
      "example_en": "She arranged a meeting with the client for next Tuesday.",
      "example_cn": "她安排了下周二与客户的会议。"
    },
    {
      "pos": "verb",
      "explanation_en": "To put things in a particular order or pattern, often for aesthetic or functional purposes.",
      "explanation_cn": "指将物品按特定顺序或模式摆放，通常出于美观或实用目的。",
      "example_en": "He arranged the books on the shelf by author and publication date.",
      "example_cn": "他按作者和出版日期将书架上的书排列整齐。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make preparations or come to an agreement about something, often through negotiation or discussion.",
      "explanation_cn": "指通过协商或讨论就某事达成协议或做好准备。",
      "example_en": "They arranged for a taxi to pick them up at the airport.",
      "example_cn": "他们安排了一辆出租车去机场接他们。"
    },
    {
      "pos": "verb",
      "explanation_en": "To compose or adapt music, especially for performance by a specific group or instrument.",
      "explanation_cn": "指为特定团体或乐器创作或改编音乐。",
      "example_en": "The orchestra's conductor arranged the classical piece for a smaller ensemble.",
      "example_cn": "乐团指挥将这首古典乐曲改编为小型合奏版本。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "organize",
      "analysis": "“Organize” (组织) 更强调建立结构、系统或流程，以使复杂事物变得有序，常用于管理、行政或团队协作语境。而 “arrange” 更侧重于具体事物的摆放、安排或协调，范围更窄，更偏向操作层面。"
    },
    {
      "word_to_compare": "plan",
      "analysis": "“Plan” (计划) 指在行动前构思目标、步骤和策略，强调前瞻性与决策过程。而 “arrange” 通常发生在计划之后，侧重于执行层面的具体落实，如安排时间、地点或人员。"
    },
    {
      "word_to_compare": "order",
      "analysis": "“Order” (命令/订购) 作为动词时，可指下达指令或购买商品，与 “arrange” 的“协调”含义部分重叠，但 “order” 更具权威性或交易性。而 “arrange” 更中性，强调协调与配合，不包含强制或购买行为。"
    }
  ]
}