{
  "word": "arrest",
  "pronunciation": "uh·rest",
  "concise_definition": "v. 逮捕, 制止, 吸引; n. 逮捕, 停止",
  "forms": {
    "third_person_singular": "arrests",
    "past_tense": "arrested",
    "past_participle": "arrested",
    "present_participle": "arresting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To take someone into legal custody by authority of the law, typically because they are suspected of or have committed a crime.",
      "explanation_cn": "指依法将某人拘捕并带入法律监管，通常因其涉嫌或已实施犯罪行为。",
      "example_en": "The police arrested the suspect after gathering sufficient evidence.",
      "example_cn": "警方在收集到充分证据后逮捕了嫌疑人。"
    },
    {
      "pos": "verb",
      "explanation_en": "To stop or hinder the progress, growth, or development of something, often abruptly or forcefully.",
      "explanation_cn": "指突然或强力地阻止某事物的进展、增长或发展。",
      "example_en": "The new policy aims to arrest the spread of misinformation online.",
      "example_cn": "这项新政策旨在遏制网络虚假信息的传播。"
    },
    {
      "pos": "verb",
      "explanation_en": "To attract and hold someone's attention completely, often due to something striking or unusual.",
      "explanation_cn": "指因某事物引人注目或不同寻常而完全吸引并留住某人的注意力。",
      "example_en": "Her bright red dress arrested the attention of everyone in the room.",
      "example_cn": "她那件鲜红的连衣裙吸引了房间里所有人的目光。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of taking someone into legal custody by law enforcement authorities.",
      "explanation_cn": "指执法机关依法将某人拘捕的行为。",
      "example_en": "He was released without charge after a 24-hour arrest.",
      "example_cn": "他在被拘押24小时后获释，未被起诉。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden stop or suspension of movement, activity, or process.",
      "explanation_cn": "指运动、活动或过程的突然停止或暂停。",
      "example_en": "The project is now in arrest due to lack of funding.",
      "example_cn": "由于缺乏资金，该项目现已暂停。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "detain",
      "analysis": "“Detain” (扣留) 指暂时限制人身自由，通常不涉及正式指控或刑事程序，可能用于调查、边境检查或行政目的。而 “arrest” 是正式的法律行为，意味着嫌疑人将被控罪并进入司法程序。"
    },
    {
      "word_to_compare": "capture",
      "analysis": "“Capture” (捕获) 更常用于物理上抓住或控制某人或某物，如捕获野生动物、俘虏敌人，或在非法律语境中（如捕获注意力）。而 “arrest” 专指法律授权下的拘捕行为，具有明确的司法含义。"
    },
    {
      "word_to_compare": "halt",
      "analysis": "“Halt” (停止) 是一个中性词，泛指任何类型的停止，可以是自然的、自愿的或临时的，如“halt the car”或“halt the discussion”。而 “arrest” 作为动词使用时，强调的是突然、强力且通常由外部力量施加的制止，常带有紧迫性或戏剧性。"
    }
  ]
}