{
  "word": "art",
  "pronunciation": "ahrt",
  "concise_definition": "n. 艺术, 技艺, 技巧",
  "forms": {
    "plural": "arts"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The expression or application of human creative skill and imagination, typically in a visual form such as painting, sculpture, or music, producing works to be appreciated primarily for their beauty or emotional power.",
      "explanation_cn": "指人类创造性技能与想象力的表达或运用，通常以视觉形式（如绘画、雕塑、音乐）呈现，其作品主要因其美感或情感力量而被欣赏。",
      "example_en": "The museum houses an extensive collection of modern art.",
      "example_cn": "这座博物馆收藏了大量现代艺术作品。"
    },
    {
      "pos": "noun",
      "explanation_en": "A skill or technique acquired through practice, especially one that is not easily explained or taught, such as the art of negotiation or the art of cooking.",
      "explanation_cn": "指通过实践获得的某种技能或技巧，尤其指那些难以明确解释或传授的技艺，如谈判的艺术或烹饪的艺术。",
      "example_en": "She has the art of making everyone feel welcome at her parties.",
      "example_cn": "她有一种让每个人在她的派对上都感到受欢迎的本事。"
    },
    {
      "pos": "noun",
      "explanation_en": "The collective body of creative works produced in a particular culture or historical period, often studied as a field of academic inquiry.",
      "explanation_cn": "指某一特定文化或历史时期所产生的全部创造性作品的总和，常作为学术研究的领域。",
      "example_en": "Renaissance art revolutionized the way artists depicted the human form.",
      "example_cn": "文艺复兴时期的艺术彻底改变了艺术家描绘人体的方式。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "skill",
      "analysis": "“Skill” (技能) 指通过训练获得的完成某项任务的能力，强调实用性与可衡量性，如打字技能或编程技能。而 “art” 在指技艺时，更强调其内在的美感、直觉与个性化表达，常带有主观性和难以复制的特质。"
    },
    {
      "word_to_compare": "craft",
      "analysis": "“Craft” (工艺/手艺) 通常指手工制作的、具有实用功能的作品，如陶艺、木工，强调技术性与传统传承。而 “art” 更侧重于表达情感、思想或美学，不一定具有实用目的。尽管两者界限有时模糊，但 “art” 更倾向于非功利性，而 “craft” 更注重功能性。"
    },
    {
      "word_to_compare": "creativity",
      "analysis": "“Creativity” (创造力) 是一种心理能力或过程，指产生新颖且有价值想法的能力。它是 “art” 的内在驱动力，但本身不是作品或表现形式。而 “art” 是创造力的外在体现或产物，是可被感知、欣赏的具体成果。"
    }
  ]
}