{
  "word": "artists",
  "pronunciation": "ahr·tists",
  "concise_definition": "n. 艺术家, 艺人",
  "forms": {
    "singular": "artist"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who creates art, especially visual art such as painting, sculpture, or drawing, using skill, imagination, and creativity to express ideas or emotions.",
      "explanation_cn": "指通过技能、想象力和创造力创作艺术作品的人，尤指绘画、雕塑或素描等视觉艺术，用以表达思想或情感。",
      "example_en": "The museum features works by famous artists like Picasso and Van Gogh.",
      "example_cn": "这座博物馆展出了毕加索和梵高等著名艺术家的作品。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person skilled in a particular creative field or performance, such as music, dance, or acting, often recognized for their distinctive style or talent.",
      "explanation_cn": "指在某一创造性领域（如音乐、舞蹈或表演）中技艺娴熟的人，常因其独特的风格或才华而受到认可。",
      "example_en": "She is a gifted artist who blends jazz and electronic music in her albums.",
      "example_cn": "她是一位才华横溢的音乐人，将爵士乐与电子音乐融合在自己的专辑中。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who approaches a task or activity with creativity and originality, even outside traditional art forms, such as cooking or design.",
      "explanation_cn": "指即使在传统艺术形式之外，也能以创造力和原创性对待某项任务或活动的人，例如烹饪或设计。",
      "example_en": "He's not a painter, but he's an artist when it comes to arranging flowers.",
      "example_cn": "他不是画家，但在插花方面却是个艺术家。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "creators",
      "analysis": "“Creators” (创造者) 是一个更广泛的术语，泛指任何创造新事物的人，包括作家、程序员、发明家等，不限于审美表达。而 “artists” 更强调通过感官体验（视觉、听觉等）传达情感与美学价值，范围更窄、更具艺术性。"
    },
    {
      "word_to_compare": "performers",
      "analysis": "“Performers” (表演者) 指通过现场演出（如唱歌、跳舞、演戏）向观众呈现作品的人，其核心是“演绎”而非“创作”。艺术家可以是表演者，但表演者未必是艺术家——除非他们赋予表演个人风格与创造性解读。"
    },
    {
      "word_to_compare": "craftsmen",
      "analysis": "“Craftsmen” (工匠) 强调精湛的手工技艺和实用性，作品通常具有功能性和传统规范，如木工、陶艺。艺术家则更注重个人表达、观念创新和情感传达，作品不一定具有实用目的。两者可能重叠，但动机和评价标准不同。"
    }
  ]
}