{
  "word": "article",
  "pronunciation": "ahr·tik·l",
  "concise_definition": "n. 文章, 条款, 物品, 冠词",
  "forms": {
    "plural": "articles"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A written piece, typically published in a newspaper, magazine, or academic journal, that presents information, analysis, or opinion on a specific topic.",
      "explanation_cn": "指刊登在报纸、杂志或学术期刊上的书面作品，旨在就某一特定主题提供信息、分析或观点。",
      "example_en": "She wrote an article on climate change for the national newspaper.",
      "example_cn": "她为国家级报纸撰写了一篇关于气候变化的文章。"
    },
    {
      "pos": "noun",
      "explanation_en": "A distinct clause or provision in a legal document, contract, or set of rules, often numbered for reference.",
      "explanation_cn": "指法律文件、合同或规则中的一项具体条款或规定，通常以编号方式便于引用。",
      "example_en": "According to Article 12 of the treaty, both parties must negotiate in good faith.",
      "example_cn": "根据条约第12条，双方必须本着诚意进行谈判。"
    },
    {
      "pos": "noun",
      "explanation_en": "A distinct object or item, especially one that is manufactured or intended for use or sale.",
      "explanation_cn": "指一个具体的物品或物件，尤指被制造出来用于使用或销售的商品。",
      "example_en": "The store sells a wide variety of household articles, from kitchenware to lighting fixtures.",
      "example_cn": "这家商店出售各种各样的家居用品，从厨具到灯具。"
    },
    {
      "pos": "noun",
      "explanation_en": "A word used to define the definiteness or indefiniteness of a noun, such as 'a', 'an', or 'the' in English.",
      "explanation_cn": "指用于限定名词确定性或非确定性的冠词，如英语中的 'a'、'an' 或 'the'。",
      "example_en": "In English grammar, 'the' is a definite article, while 'a' is an indefinite article.",
      "example_cn": "在英语语法中，'the' 是定冠词，而 'a' 是不定冠词。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "essay",
      "analysis": "“Essay” (散文/论文) 通常指结构更完整、更具个人风格或论证性的长篇写作，常用于学术或文学语境。而 “article” 更广泛，可涵盖新闻报道、科普短文或法律条款，形式更灵活，不一定强调个人观点。"
    },
    {
      "word_to_compare": "item",
      "analysis": "“Item” (项目/条目) 是一个更通用的词，可指任何单独的事物、信息条目或清单中的项，如新闻条目、购物清单中的物品。而 “article” 在指物品时更强调其作为“可销售或可分类的实体商品”，在指文本时则更正式、有内容深度。"
    },
    {
      "word_to_compare": "clause",
      "analysis": "“Clause” (条款/分句) 通常用于语法或法律语境，指句子中的一个组成部分或合同中的一个独立条款。它与 “article” 在法律文本中有时可互换，但 “article” 通常是更高层级的结构单元（如整章中的第几条），而 “clause” 是其下级细分。"
    }
  ]
}