{
  "word": "artist",
  "pronunciation": "ahr·tist",
  "concise_definition": "n. 艺术家, 画家, 手艺人, 表演者",
  "forms": {
    "plural": "artists"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who creates art using skill and imagination, especially in visual forms such as painting, sculpture, or drawing, and whose work is valued for its aesthetic or emotional impact.",
      "explanation_cn": "指运用技巧与想象力创作艺术作品的人，尤指以绘画、雕塑或素描等视觉形式表达，其作品因美学或情感价值而受到重视。",
      "example_en": "Picasso is considered one of the greatest artists of the 20th century.",
      "example_cn": "毕加索被认为是20世纪最伟大的艺术家之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who performs in the entertainment industry, such as a singer, dancer, or actor, often admired for their talent and stage presence.",
      "explanation_cn": "指在娱乐行业从事表演的人，如歌手、舞者或演员，常因其才华和舞台魅力而受到钦佩。",
      "example_en": "The artist received a standing ovation after her final performance.",
      "example_cn": "她在最后一场演出后获得了全场起立鼓掌。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is highly skilled in a particular craft or activity, often implying creativity and personal expression beyond mere technical ability.",
      "explanation_cn": "指在某一特定技艺或活动中技艺高超的人，常暗示其超越单纯技术能力的创造力与个性表达。",
      "example_en": "He's an artist when it comes to fixing old cars—he turns junk into treasures.",
      "example_cn": "他在修理旧车方面是个高手——能把废品变成珍宝。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "painter",
      "analysis": "“Painter”（画家）特指以绘画为主要创作形式的艺术家，是“artist”的一个子类。而 “artist” 范围更广，可涵盖雕塑家、表演者、设计师等。使用 “painter” 时强调媒介和技法，而 “artist” 更强调艺术性与创造性。"
    },
    {
      "word_to_compare": "artisan",
      "analysis": "“Artisan”（手艺人）强调精湛的手工技艺和实用功能，作品通常具有传统性与实用性（如陶器、木工），其价值在于工艺而非纯粹审美表达。而 “artist” 更注重个人表达、情感传达和美学创新，作品常脱离实用目的。"
    },
    {
      "word_to_compare": "performer",
      "analysis": "“Performer”（表演者）专指在舞台上或镜头前进行演出的人，如演员、魔术师、杂技演员，其艺术性体现在动态呈现而非静态创作。虽然 “artist” 可包含 performer，但后者不一定是创作者，而前者通常兼具创作与表现双重身份。"
    }
  ]
}