{
  "word": "arts",
  "pronunciation": "ahrts",
  "concise_definition": "n. 艺术, 文科, 人文科学",
  "forms": {
    "singular": "art"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The various branches of creative expression, including painting, sculpture, music, literature, dance, and theater, that aim to convey beauty, emotion, or ideas through skill and imagination.",
      "explanation_cn": "指通过技巧与想象力传达美、情感或思想的各种创造性表达形式，包括绘画、雕塑、音乐、文学、舞蹈和戏剧等。",
      "example_en": "She studied the arts at university, focusing on classical music and Renaissance painting.",
      "example_cn": "她在大学主修艺术，专注于古典音乐和文艺复兴时期的绘画。"
    },
    {
      "pos": "noun",
      "explanation_en": "The academic disciplines concerned with human culture and thought, such as history, philosophy, languages, and literature, as opposed to the natural or applied sciences.",
      "explanation_cn": "指与人类文化与思想相关的学术领域，如历史、哲学、语言和文学，与自然科学或应用科学相对。",
      "example_en": "The university offers strong programs in the arts and humanities.",
      "example_cn": "这所大学在文科和人文学科方面拥有强大的课程体系。"
    },
    {
      "pos": "noun",
      "explanation_en": "A skill or ability acquired through practice, especially in a creative or technical field; often used in the plural to refer to a person's cultivated talents.",
      "explanation_cn": "指通过实践获得的技能或能力，尤指在创造性或技术性领域中的才能；常以复数形式指一个人所培养的综合技艺。",
      "example_en": "The arts of negotiation and diplomacy require patience and deep understanding.",
      "example_cn": "谈判与外交的艺术需要耐心与深刻的理解。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "art",
      "analysis": "“Art”（单数）通常指单一的艺术形式、作品或抽象概念（如‘艺术是表达情感的方式’），而 ‘arts’（复数）强调多种艺术门类或学科领域的集合，尤其在教育或学术语境中使用更广泛。"
    },
    {
      "word_to_compare": "culture",
      "analysis": "“Culture”（文化）涵盖更广泛的社会实践、信仰、习俗和生活方式，包括语言、宗教、饮食、节日等，而 ‘arts’ 是文化的重要组成部分，但仅限于创造性表达领域。文化是容器，艺术是其中的内容。"
    },
    {
      "word_to_compare": "humanities",
      "analysis": "“Humanities”（人文学科）与 ‘arts’ 有高度重叠，但更侧重于学术研究与理论分析，如哲学、语言学、历史学等；而 ‘arts’ 更强调创作实践，如绘画、作曲、表演等。两者常并列使用（arts and humanities），但 ‘arts’ 更具实践性，‘humanities’ 更具思辨性。"
    }
  ]
}