{
  "word": "aryan",
  "pronunciation": "air·ee·an",
  "concise_definition": "n. 雅利安人, 雅利安的",
  "forms": {
    "plural": "aryans"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A member of a group of ancient Indo-European peoples who migrated into Iran and India in the second millennium BCE, traditionally believed to have spoken early forms of Indo-Iranian languages.",
      "explanation_cn": "指公元前二千纪迁徙至伊朗和印度的一群古代印欧民族，传统上被认为讲早期的印-伊朗语系语言。",
      "example_en": "Linguistic evidence suggests that the Aryans brought the Vedic culture to the Indian subcontinent.",
      "example_cn": "语言学证据表明，雅利安人将吠陀文化带到了印度次大陆。"
    },
    {
      "pos": "noun",
      "explanation_en": "A term misused in the 19th and 20th centuries, especially by Nazi ideology, to describe a supposed 'pure' racial group of Northern European descent, often associated with blond hair and blue eyes.",
      "explanation_cn": "19世纪和20世纪被误用的术语，尤其被纳粹意识形态用来描述一种虚构的、具有北欧血统的‘纯种’种族，常与金发碧眼相联系。",
      "example_en": "The Nazi regime promoted the myth of the Aryan race to justify its racist policies.",
      "example_cn": "纳粹政权鼓吹雅利安种族的神话，以为其种族主义政策辩护。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to the ancient Indo-European peoples or to the linguistic and cultural traditions associated with them.",
      "explanation_cn": "与古代印欧民族或与其相关的语言和文化传统有关的。",
      "example_en": "The Aryan roots of Sanskrit are evident in its grammatical structure.",
      "example_cn": "梵语的雅利安根源在其语法结构中显而易见。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "caucasian",
      "analysis": "“Caucasian” (高加索人种) 是一个人种分类术语，泛指源自欧洲、西亚和北非的群体，基于生理特征（如肤色、面部结构）的科学分类，尽管现代人类学已弃用该分类。而 “Aryan” 原为语言文化术语，后被政治化为种族主义概念，二者在学术上不应混用。"
    },
    {
      "word_to_compare": "indoeuropean",
      "analysis": "“Indo-European” (印欧语系的) 是一个语言学和考古学术语，指使用印欧语系语言的族群及其文化，涵盖从印度到欧洲的广泛区域。它是一个中性、学术性的分类。而 “Aryan” 仅是印欧语系中印度-伊朗分支的子集，且因被纳粹滥用而带有强烈政治和种族主义色彩。"
    },
    {
      "word_to_compare": "nordic",
      "analysis": "“Nordic” (北欧的) 指地理和文化上来自斯堪的纳维亚及北欧国家的人群，强调地域和文化特征，不涉及种族优越论。而 “Aryan” 在纳粹语境中被刻意等同于“北欧人种”，但其定义更模糊、更具意识形态建构性，且包含非北欧的伊朗和印度族群的原始含义。"
    }
  ]
}