{
  "word": "asian",
  "pronunciation": "ay·zhun",
  "concise_definition": "adj. 亚洲的, 亚洲人的; n. 亚洲人",
  "forms": {
    "comparative": "more asian",
    "superlative": "most asian"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or originating from Asia, the largest continent in the world, encompassing diverse cultures, languages, and ethnic groups.",
      "explanation_cn": "与亚洲相关或源自亚洲的，亚洲是世界上最大的大陆，涵盖多样化的文化、语言和民族群体。",
      "example_en": "Asian cuisine includes a wide variety of flavors, from spicy Thai curries to delicate Japanese sushi.",
      "example_cn": "亚洲美食包括从辛辣的泰国咖喱到精致的日本寿司等多种风味。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing people or things associated with the ethnic and cultural heritage of Asia, often used in demographic or social contexts.",
      "explanation_cn": "用于描述与亚洲民族和文化遗产相关的人或事物，常用于人口统计或社会语境中。",
      "example_en": "The university has a growing population of Asian students from China, India, and South Korea.",
      "example_cn": "这所大学的亚洲学生人数正在增长，他们来自中国、印度和韩国。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person whose ancestry or origin is from Asia; commonly used in Western contexts to refer to people from East Asia, Southeast Asia, or South Asia.",
      "explanation_cn": "指祖先或出身来自亚洲的人；在西方语境中常用于指来自东亚、东南亚或南亚的人。",
      "example_en": "She identifies as Asian American and is proud of her Vietnamese heritage.",
      "example_cn": "她自认为是亚裔美国人，并为自己的越南血统感到自豪。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "oriental",
      "analysis": "“Oriental”（东方的）曾是“Asian”的同义词，但如今在英语中被视为过时甚至冒犯性词汇，因其带有殖民主义色彩和刻板印象。现代英语中应使用 “Asian” 以尊重文化多样性。例如，说 “Asian art” 而非 “oriental art”。"
    },
    {
      "word_to_compare": "eastern",
      "analysis": "“Eastern”（东方的）通常指地理或文化上的东方，如“Eastern Europe”或“Eastern philosophy”，范围更广，不一定特指亚洲。而 “Asian” 明确指亚洲大陆及其人民，具有更精确的地域和族群指向。"
    },
    {
      "word_to_compare": "ethnic",
      "analysis": "“Ethnic”（种族的/民族的）是一个更宽泛的术语，泛指任何具有共同文化、语言或血统的群体，如“ethnic minority”。而 “Asian” 是一个具体的族群地理分类，属于 “ethnic” 的子集。不能用 “ethnic” 替代 “Asian”，因为前者缺乏地域明确性。"
    }
  ]
}