{
  "word": "aside",
  "pronunciation": "uh·sīd",
  "concise_definition": "adv. 在一旁, 低声地; n. 旁白, 旁注, 退到一旁",
  "forms": {
    "comparative": "asider",
    "superlative": "asidest"
  },
  "definitions": [
    {
      "pos": "adverb",
      "explanation_en": "To one side; away from the main place, direction, or focus, often to remove or set something apart.",
      "explanation_cn": "向一旁；离开主要位置、方向或焦点，通常用于将某物移开或单独放置。",
      "example_en": "She put the book aside and turned her attention to the phone.",
      "example_cn": "她把书放到一边，转而关注手机。"
    },
    {
      "pos": "adverb",
      "explanation_en": "In a whisper or under one's breath; to speak privately or confidentially, often to reveal a thought not meant for others.",
      "explanation_cn": "低声地、悄悄地；指私下或保密地说话，通常是为了表达不打算让他人听到的想法。",
      "example_en": "He muttered aside, 'I don't trust him.'",
      "example_cn": "他低声说道：‘我不信任他。’"
    },
    {
      "pos": "noun",
      "explanation_en": "A remark made by a character in a play or film that is intended for the audience but not heard by other characters on stage; a brief digression in speech or writing.",
      "explanation_cn": "戏剧或电影中角色对观众所说、但其他角色听不到的台词；言语或写作中的简短离题。",
      "example_en": "The actor delivered a witty aside about the mayor's speech.",
      "example_cn": "演员对市长的演讲发表了一句机智的旁白。"
    },
    {
      "pos": "noun",
      "explanation_en": "A note or comment written in the margin of a text, often to clarify or comment on the main content.",
      "explanation_cn": "写在文本页边的注释或评论，通常用于解释或评论正文内容。",
      "example_en": "The scholar added several insightful asides to the ancient manuscript.",
      "example_cn": "这位学者在古籍上添加了几条富有洞见的旁注。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "beside",
      "analysis": "“Beside” (在……旁边) 是一个表示空间位置的介词，仅指物理上的邻近，如 'beside the table'。而 'aside' 作为副词时强调动作的方向——将某物移开或置于一旁，具有动态性，且常隐含‘暂时搁置’或‘不参与’的语义。"
    },
    {
      "word_to_compare": "off to the side",
      "analysis": "“Off to the side” 是一个短语，与 'aside' 在空间意义上相近，但更口语化、更具体地描述位置。'Aside' 更简洁，且可作名词使用（如旁白），而 'off to the side' 通常仅用于描述位置，不具备抽象或修辞功能。"
    },
    {
      "word_to_compare": "digression",
      "analysis": "“Digression” (离题) 指在谈话或写作中偏离主题的完整段落或较长的偏离，通常有结构上的独立性。而 'aside' 作为名词时，是简短、突然的离题，常用于戏剧或修辞中，具有瞬间性和表演性，更精炼、更富技巧性。"
    }
  ]
}