{
  "word": "assay",
  "pronunciation": "uh·say",
  "concise_definition": "n. 分析, 检验; v. 分析, 检验, 评估",
  "forms": {
    "third_person_singular": "assays",
    "past_tense": "assayed",
    "past_participle": "assayed",
    "present_participle": "assaying"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A chemical or metallurgical test to determine the purity, composition, or quantity of a particular substance, especially precious metals like gold or silver.",
      "explanation_cn": "指通过化学或冶金方法对某种物质（尤其是黄金、白银等贵金属）的纯度、成分或含量进行检测和分析。",
      "example_en": "The lab performed an assay on the ore to determine its gold content.",
      "example_cn": "实验室对矿石进行了分析，以确定其含金量。"
    },
    {
      "pos": "verb",
      "explanation_en": "To analyze or test a substance, especially to determine its quality, composition, or value, often in a scientific or industrial context.",
      "explanation_cn": "指对某种物质进行分析或检验，以确定其质量、成分或价值，常用于科学或工业环境中。",
      "example_en": "Scientists assayed the soil samples for traces of heavy metals.",
      "example_cn": "科学家对土壤样本进行了检测，以寻找重金属痕迹。"
    },
    {
      "pos": "verb",
      "explanation_en": "To evaluate or attempt something, often in a tentative or experimental way, especially in figurative or literary usage.",
      "explanation_cn": "指尝试或评估某事，常用于比喻或文学语境中，带有试探性或实验性的意味。",
      "example_en": "She assayed a new approach to teaching, combining art and science.",
      "example_cn": "她尝试了一种新的教学方法，将艺术与科学结合起来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "analyze",
      "analysis": "“Analyze” (分析) 是一个更广泛、通用的词，适用于任何类型的系统性分解和研究，包括数据、文本、行为等。而 “assay” 专指对物质成分或纯度的科学检测，尤其在冶金、化学和药学领域，具有更强的专业性和技术性。"
    },
    {
      "word_to_compare": "test",
      "analysis": "“Test” (测试) 是一个通用词，泛指任何形式的检验或试验，可以是简单的、非定量的。而 “assay” 特指精确的、定量的化学或物理分析，强调结果的科学性和准确性，常用于需要报告具体数值的场合。"
    },
    {
      "word_to_compare": "evaluate",
      "analysis": "“Evaluate” (评估) 侧重于对价值、效果或重要性进行判断，常用于抽象概念（如政策、表现、风险）。而 “assay” 在作为动词时，更强调通过实验手段获取客观数据，尤其在物质成分检测中，其过程更具体、更技术化。"
    }
  ]
}