{
  "word": "assaults",
  "pronunciation": "uh·swolts",
  "concise_definition": "n. 攻击, 侵犯, 袭击",
  "forms": {
    "singular": "assault"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A violent physical or verbal attack intended to harm, threaten, or intimidate someone, often involving force or the threat of force.",
      "explanation_cn": "指以暴力或言语方式进行的攻击，旨在伤害、威胁或恐吓他人，通常涉及实际使用武力或武力威胁。",
      "example_en": "The victim reported a brutal assault by an unknown man in the parking lot.",
      "example_cn": "受害者报告称，她在停车场遭到一名陌生男子的残忍袭击。"
    },
    {
      "pos": "noun",
      "explanation_en": "A legal term referring to the intentional act of causing another person to fear imminent harmful or offensive contact, even without actual physical contact.",
      "explanation_cn": "法律术语，指故意使他人感到即将遭受有害或冒犯性接触的威胁，即使并未发生实际的身体接触。",
      "example_en": "Shaking a fist at someone in a threatening manner can constitute assault under the law.",
      "example_cn": "以威胁的方式向某人挥舞拳头，在法律上可构成袭击。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden, forceful attempt to overcome or penetrate a defense, often used in military or competitive contexts.",
      "explanation_cn": "指在军事或竞争性语境中，为突破或攻破防御而发起的突然而猛烈的行动。",
      "example_en": "The army launched a coordinated assault on the enemy's fortified position at dawn.",
      "example_cn": "军队在黎明时分对敌方的坚固阵地发起了协同攻击。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "attack",
      "analysis": "“Attack” (攻击) 是一个更广泛、更中性的词，可用于物理、军事、语言或逻辑层面的进攻，不必然包含暴力或非法意图。而 “assault” 更强调非法暴力行为，尤其在法律语境中具有特定含义，通常涉及人身伤害或威胁。"
    },
    {
      "word_to_compare": "battery",
      "analysis": "“Battery” (殴打) 在法律上特指实际造成有害或冒犯性身体接触的行为，是 “assault” 的后续行为。简单来说，assault 是威胁或企图伤害，battery 是实际实施伤害。两者常被并列使用（assault and battery），但单独使用时，assault 不一定包含身体接触。"
    },
    {
      "word_to_compare": "onslaught",
      "analysis": "“Onslaught” (猛攻) 强调持续、猛烈、压倒性的攻击，常用于描述大规模或长时间的进攻，如自然灾害、舆论风暴或军事行动。它比 “assault” 更具规模感和持久性，语气更强烈，多用于比喻或宏大语境。"
    }
  ]
}