{
  "word": "assault",
  "pronunciation": "uh·swawlt",
  "concise_definition": "n. 攻击, 侵害; v. 攻击, 侵犯",
  "forms": {
    "third_person_singular": "assaults",
    "past_tense": "assaulted",
    "past_participle": "assaulted",
    "present_participle": "assaulting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A violent physical or verbal attack intended to cause harm, fear, or injury, often involving intentional force or threat of force against a person or property.",
      "explanation_cn": "指以暴力手段对他人或财产实施的攻击行为，通常涉及故意使用武力或以武力相威胁，旨在造成伤害、恐惧或损失。",
      "example_en": "The victim suffered a brutal assault outside the nightclub.",
      "example_cn": "受害者在夜总会外遭受了残酷的袭击。"
    },
    {
      "pos": "noun",
      "explanation_en": "A legal term referring to the intentional act of causing another person to fear imminent harmful or offensive contact, even without actual physical contact.",
      "explanation_cn": "法律术语，指故意使他人合理地恐惧即将遭受有害或冒犯性的身体接触，即使并未实际发生身体接触。",
      "example_en": "Shaking a fist in someone's face can constitute assault under the law.",
      "example_cn": "在某人面前挥舞拳头可能构成法律意义上的袭击。"
    },
    {
      "pos": "verb",
      "explanation_en": "To physically attack someone with force or violence, often with the intent to injure or overpower.",
      "explanation_cn": "指以武力或暴力对他人进行身体攻击，通常意图造成伤害或制服对方。",
      "example_en": "Soldiers were ordered to assault the enemy stronghold at dawn.",
      "example_cn": "士兵们被命令在黎明时分进攻敌方据点。"
    },
    {
      "pos": "verb",
      "explanation_en": "To confront or overwhelm someone aggressively, especially with questions, demands, or criticism.",
      "explanation_cn": "指以咄咄逼人的方式质问、要求或批评某人，使其感到被围攻或压倒。",
      "example_en": "The journalist assaulted the politician with a barrage of difficult questions.",
      "example_cn": "记者向这位政客提出了一连串尖锐的问题，令其难以招架。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "attack",
      "analysis": "“Attack” (攻击) 是一个更广泛、更中性的词，可用于军事、语言、逻辑或抽象层面的进攻，如“攻击论点”或“网络攻击”。“Assault” 更强调暴力性、人身性或非法性，通常涉及直接的身体或心理威胁，法律语境中更常使用。"
    },
    {
      "word_to_compare": "battery",
      "analysis": "“Battery” (殴打) 在法律术语中特指实际的、非法的身体接触和伤害，是“assault”（威胁）的后续行为。简单说，assault 是威胁，battery 是实施。两者常并列出现（assault and battery），但单独使用时，assault 可以不涉及身体接触，而 battery 必须有。"
    },
    {
      "word_to_compare": "vent",
      "analysis": "“Vent” (发泄) 指情绪上的释放，如愤怒或不满，通常不具攻击性或暴力性，如“vent one’s frustration”。而 “assault” 是主动、有目的的侵犯行为，具有明确的伤害意图，两者在语义强度和行为性质上截然不同。"
    }
  ]
}