{
  "word": "assemblies",
  "pronunciation": "uh·sem·buhlz",
  "concise_definition": "n. 集会, 装配, 组装件, 立法机构",
  "forms": {
    "singular": "assembly"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A group of people gathered together for a specific purpose, such as a meeting, ceremony, or political function.",
      "explanation_cn": "指为特定目的（如会议、仪式或政治职能）而聚集在一起的一群人。",
      "example_en": "The students gathered in the auditorium for the morning assembly.",
      "example_cn": "学生们在礼堂集合参加早会。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process or act of putting together components to form a complete unit, especially in manufacturing or engineering.",
      "explanation_cn": "指将零部件组合成一个完整单元的过程，尤指在制造或工程领域中的装配行为。",
      "example_en": "The car's engine assembly was completed in the final stage of production.",
      "example_cn": "汽车发动机的组装是在生产最后阶段完成的。"
    },
    {
      "pos": "noun",
      "explanation_en": "A complete unit formed by the combination of several parts, often used in technical or mechanical contexts.",
      "explanation_cn": "指由多个部件组合而成的完整单元，常用于技术或机械语境中。",
      "example_en": "The thermostat is part of the climate control assembly in the vehicle.",
      "example_cn": "恒温器是车辆气候控制系统中的一个组装件。"
    },
    {
      "pos": "noun",
      "explanation_en": "A formal legislative body, especially in a country or region, responsible for making laws or representing the people.",
      "explanation_cn": "指一个正式的立法机构，尤其在国家或地区层面，负责制定法律或代表人民。",
      "example_en": "The state assembly passed new environmental regulations last week.",
      "example_cn": "州议会上周通过了新的环境保护法规。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "meeting",
      "analysis": "“Meeting”（会议）泛指任何形式的会面，可以是临时的、非正式的或小规模的，而 “assembly” 通常指有组织、有特定目的、规模较大的正式集会，常带有仪式性或公共性。"
    },
    {
      "word_to_compare": "component",
      "analysis": "“Component”（部件）指一个系统中的单个零件或元素，强调其独立性；而 “assembly” 是多个组件组合后的整体，强调结构的整合性。一个 assembly 由多个 component 构成。"
    },
    {
      "word_to_compare": "convention",
      "analysis": "“Convention”（大会/惯例）通常指大型、周期性、有特定主题的集会，如行业大会或政党代表大会，常具有国际性或专业性；而 “assembly” 更广泛，可指任何规模的集合，包括学校晨会或地方立法机构，更强调聚集行为本身而非主题或频率。"
    }
  ]
}