{
  "word": "assimilation",
  "pronunciation": "uh·sih·muh·ley·shuhn",
  "concise_definition": "n. 同化, 吸收, 消化",
  "forms": {
    "plural": "assimilations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process by which individuals or groups adopt the cultural traits, values, language, or behaviors of another group, often leading to integration or loss of original identity.",
      "explanation_cn": "指个人或群体采纳另一群体的文化特征、价值观、语言或行为模式的过程，通常导致融入或原有身份的丧失。",
      "example_en": "The assimilation of immigrants into mainstream society often requires learning the local language and customs.",
      "example_cn": "移民融入主流社会通常需要学习当地语言和习俗。"
    },
    {
      "pos": "noun",
      "explanation_en": "The biological or physiological process of absorbing and incorporating nutrients or substances into the body for use in growth and repair.",
      "explanation_cn": "指生物体吸收并整合营养物质或其他物质以用于生长和修复的生理过程。",
      "example_en": "Proper assimilation of proteins is essential for muscle development and tissue repair.",
      "example_cn": "蛋白质的正确吸收对肌肉发育和组织修复至关重要。"
    },
    {
      "pos": "noun",
      "explanation_en": "The cognitive process of incorporating new information into existing mental frameworks or schemas, as described in psychology and learning theory.",
      "explanation_cn": "指心理学和学习理论中，将新信息纳入现有心理框架或图式的过程。",
      "example_en": "Children use assimilation to understand new experiences by fitting them into what they already know.",
      "example_cn": "儿童通过将新经验纳入已有的认知框架来理解新事物。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "acculturation",
      "analysis": "“Acculturation”（文化适应）指两个不同文化群体接触时发生的相互文化影响和调整，通常保留部分原有文化特征，是双向过程；而 “assimilation” 更强调单向的完全融入，原有文化特征被取代或消失。"
    },
    {
      "word_to_compare": "absorption",
      "analysis": "“Absorption”（吸收）侧重于物理或化学层面的摄入过程，如液体被海绵吸收；而 “assimilation” 在此语境下不仅指摄入，更强调将摄入物转化为自身结构或功能的一部分，具有更深层的整合含义。"
    },
    {
      "word_to_compare": "integration",
      "analysis": "“Integration”（整合）强调不同部分或群体在保持多样性的前提下和谐共存，常用于社会政策语境；而 “assimilation” 更倾向于消除差异，使个体或群体完全同化于主导文化，隐含身份的消解。"
    }
  ]
}