{
  "word": "associated",
  "pronunciation": "uh·soh·shee·eyt·id",
  "concise_definition": "adj. 相关的, 联系的, 附属的",
  "forms": {
    "base_form": "associate",
    "comparative": "more associated",
    "superlative": "most associated",
    "present_participle": "associating"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Connected or linked with something else, often through a relationship, partnership, or shared context; not necessarily direct but recognized as having a meaningful connection.",
      "explanation_cn": "与某事物有联系或关联，通常通过某种关系、合作关系或共同背景建立；不一定是直接的，但被认定为具有有意义的关联。",
      "example_en": "The company is associated with several environmental organizations.",
      "example_cn": "该公司与多家环保组织有关联。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used to describe someone who is connected to a group, organization, or activity in a secondary or supporting role, rather than as a primary member.",
      "explanation_cn": "用于描述与某个团体、组织或活动有联系但处于次要或辅助角色的人，而非核心成员。",
      "example_en": "She is an associated professor at the university, not a full-time faculty member.",
      "example_cn": "她是该大学的兼职教授，并非全职教职员工。"
    },
    {
      "pos": "adjective",
      "explanation_en": "In psychology or linguistics, referring to a mental or linguistic connection formed between two concepts through repeated pairing or experience.",
      "explanation_cn": "在心理学或语言学中，指通过反复配对或经验在两个概念之间形成的思维或语言关联。",
      "example_en": "The sound of a bell became associated with food after repeated conditioning.",
      "example_cn": "经过反复条件作用，铃声与食物建立了关联。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "connected",
      "analysis": "“Connected” (连接的) 强调物理或逻辑上的直接链接，如电路、人际关系或因果链条，通常更具体和明确。而 “associated” 更侧重于间接、松散或情境性的联系，不一定有明确的路径或机制。"
    },
    {
      "word_to_compare": "related",
      "analysis": "“Related” (相关的) 通常指基于共同起源、性质或类别而存在的内在联系，如亲属关系或概念分类。而 “associated” 更强调外部环境、合作或经验中形成的外在联系，不一定有本质上的相似性。"
    },
    {
      "word_to_compare": "affiliated",
      "analysis": "“Affiliated” (附属的) 通常用于正式组织关系，如医院与大学的附属关系，具有制度性、契约性或官方认可的特征。而 “associated” 更广泛、更松散，可以是非正式或临时性的联系，不必然有正式协议。"
    }
  ]
}