{
  "word": "atomic",
  "pronunciation": "uh·tah·mik",
  "concise_definition": "adj. 原子的, 原子能的, 极微小的, 不可再分的",
  "forms": {
    "comparative": "more atomic",
    "superlative": "most atomic"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or involving atoms, the smallest units of a chemical element that retain its properties; often used in the context of nuclear energy or physics.",
      "explanation_cn": "与原子相关或涉及原子的，即保持元素特性的最小单位；常用于核能或物理学语境中。",
      "example_en": "The atomic structure of carbon is fundamental to organic chemistry.",
      "example_cn": "碳的原子结构是有机化学的基础。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or powered by nuclear fission or fusion, especially in weapons or energy production.",
      "explanation_cn": "与核裂变或核聚变相关的，尤指用于武器或能源生产的原子能。",
      "example_en": "The country is investing heavily in atomic power plants to reduce carbon emissions.",
      "example_cn": "该国正大力投资原子能发电厂以减少碳排放。"
    },
    {
      "pos": "adjective",
      "explanation_en": "So small or basic that it cannot be divided or broken down further; used metaphorically to describe indivisible units of action or thought.",
      "explanation_cn": "极微小或基本到无法再分割或分解的；常用于隐喻，指不可再分的行为或思想单位。",
      "example_en": "The team focused on atomic tasks to ensure precision in every step of the process.",
      "example_cn": "团队专注于每一个不可再分的基本任务，以确保流程中每一步的精确性。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "nuclear",
      "analysis": "“Nuclear”（核的）特指与原子核相关的现象或能量，如核反应、核武器，强调的是原子核内部的力与过程。而 “atomic” 范围更广，可泛指原子层面的一切，包括电子结构、化学键等，不一定涉及核反应。在日常用语中，两者常被混用，但科学上 “nuclear” 更精确。"
    },
    {
      "word_to_compare": "elementary",
      "analysis": "“Elementary”（基本的、基础的）泛指任何最基础、最简单的组成部分，可用于教育、逻辑或结构层面，如“elementary school”或“elementary principles”。而 “atomic” 更强调物理或化学上不可再分的最小单位，具有更强的科学和技术语境。"
    },
    {
      "word_to_compare": "indivisible",
      "analysis": "“Indivisible”（不可分割的）是一个抽象概念，强调整体性，常用于哲学、政治或法律语境（如“a nation is indivisible”）。而 “atomic” 虽然也有“不可再分”的含义，但特指物质层面的最小粒子，具有明确的科学定义，语义更具体。"
    }
  ]
}