{
  "word": "attack",
  "pronunciation": "uh·tak",
  "concise_definition": "v. 攻击, 侵害, 批评; n. 攻击, 突袭, 发作",
  "forms": {
    "third_person_singular": "attacks",
    "past_tense": "attacked",
    "past_participle": "attacked",
    "present_participle": "attacking"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To make a violent or aggressive physical or verbal assault against someone or something, often with the intent to harm, defeat, or destroy.",
      "explanation_cn": "对某人或某物进行暴力或侵略性的身体或言语攻击，通常旨在造成伤害、击败或摧毁。",
      "example_en": "The soldiers attacked the enemy base at dawn.",
      "example_cn": "士兵们在黎明时分袭击了敌方基地。"
    },
    {
      "pos": "verb",
      "explanation_en": "To criticize or challenge someone’s ideas, beliefs, or character in a forceful or hostile manner.",
      "explanation_cn": "以强烈或敌对的方式批评或挑战某人的观点、信念或品格。",
      "example_en": "The politician was attacked in the media for his controversial policies.",
      "example_cn": "这位政客因其有争议的政策而遭到媒体的猛烈抨击。"
    },
    {
      "pos": "verb",
      "explanation_en": "To begin to affect or damage something, especially a disease, system, or structure, often suddenly or severely.",
      "explanation_cn": "突然或严重地开始影响或损害某物，尤指疾病、系统或结构。",
      "example_en": "A fungal infection attacked the roots of the trees.",
      "example_cn": "一种真菌感染侵袭了树木的根部。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden, aggressive action or attempt to harm, defeat, or take control of someone or something, especially in military, sports, or digital contexts.",
      "explanation_cn": "一种突然的、侵略性的行动或企图，旨在伤害、击败或控制某人或某物，尤指军事、体育或数字领域的行动。",
      "example_en": "The cyberattack compromised the company’s entire database.",
      "example_cn": "这次网络攻击导致公司整个数据库被入侵。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden onset or intensification of a disease, symptom, or emotional state.",
      "explanation_cn": "疾病、症状或情绪状态的突然发作或加剧。",
      "example_en": "She suffered an asthma attack during the night.",
      "example_cn": "她在夜间哮喘发作。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "assault",
      "analysis": "“Assault” (袭击) 更强调法律或物理意义上的暴力行为，通常指直接的身体攻击，常用于司法语境。而 “attack” 适用范围更广，可指物理、言语、逻辑或数字层面的进攻，语气上更通用。"
    },
    {
      "word_to_compare": "criticize",
      "analysis": "“Criticize” (批评) 是中性或温和的评价行为，即使带有负面含义，也不一定具有敌意或攻击性。而 “attack” 在作为动词使用时，带有强烈的情感色彩和敌意，常暗示人身攻击或毁灭性批评。"
    },
    {
      "word_to_compare": "infiltrate",
      "analysis": "“Infiltrate” (渗透) 指秘密、隐蔽地进入敌方系统或组织内部，以获取信息或破坏，强调策略性和隐蔽性。而 “attack” 是公开、直接的进攻行为，强调主动出击而非潜伏。"
    }
  ]
}