{
  "word": "attacks",
  "pronunciation": "uh·taks",
  "concise_definition": "n. 攻击, 侵袭, 猛烈批评; v. 攻击, 侵袭, 猛烈批评",
  "forms": {
    "singular": "attack",
    "third_person_singular": "attacks",
    "past_tense": "attacked",
    "past_participle": "attacked",
    "present_participle": "attacking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A violent or aggressive action intended to harm, injure, or destroy someone or something, often physically or militarily.",
      "explanation_cn": "指旨在伤害、损害或摧毁某人或某物的暴力或侵略性行为，通常指身体上或军事上的进攻。",
      "example_en": "The soldiers repelled the enemy's attack on the border outpost.",
      "example_cn": "士兵们击退了敌人对边境哨所的进攻。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden and intense effort to criticize, blame, or undermine someone or something, often in a public or verbal form.",
      "explanation_cn": "指对某人或某事物发起的突然而强烈的批评、指责或破坏行为，常以公开或言语形式出现。",
      "example_en": "The politician faced a media attack over his controversial remarks.",
      "example_cn": "这位政客因争议性言论而遭到媒体的猛烈抨击。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden onset of a disease, symptom, or emotional episode, often severe or unexpected.",
      "explanation_cn": "指疾病、症状或情绪发作的突然发生，通常严重或出人意料。",
      "example_en": "She suffered a heart attack last night and was rushed to the hospital.",
      "example_cn": "她昨晚突发心脏病，被紧急送往医院。"
    },
    {
      "pos": "noun",
      "explanation_en": "In computing, a deliberate attempt to compromise the security, integrity, or functionality of a system, network, or data.",
      "explanation_cn": "在计算机领域，指有意破坏系统、网络或数据的安全性、完整性或功能性的行为。",
      "example_en": "The company's servers were hit by a massive cyberattack last week.",
      "example_cn": "上周该公司服务器遭受了一次大规模的网络攻击。"
    },
    {
      "pos": "verb",
      "explanation_en": "To initiate a violent or aggressive action against someone or something, with the intent to harm or defeat.",
      "explanation_cn": "指对某人或某物发起暴力或侵略性行为，意图造成伤害或击败对方。",
      "example_en": "The team attacked the problem with renewed energy after the meeting.",
      "example_cn": "会议后，团队以新的活力投入到问题的解决中。"
    },
    {
      "pos": "verb",
      "explanation_en": "To criticize or blame someone harshly and publicly, often in writing or speech.",
      "explanation_cn": "指公开而严厉地批评或指责某人，通常通过文字或言语表达。",
      "example_en": "The newspaper attacked the mayor's handling of the budget crisis.",
      "example_cn": "这家报纸猛烈抨击市长对预算危机的处理方式。"
    },
    {
      "pos": "verb",
      "explanation_en": "To begin to affect or afflict someone or something suddenly, especially in the context of illness or emotional distress.",
      "explanation_cn": "指突然开始影响或折磨某人或某物，尤其在疾病或情绪困扰的语境中。",
      "example_en": "A severe headache attacked him as soon as he entered the bright room.",
      "example_cn": "他一走进明亮的房间，剧烈的头痛就突然袭来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To attempt to gain unauthorized access to or disrupt a computer system, network, or data.",
      "explanation_cn": "指试图非法入侵或破坏计算机系统、网络或数据。",
      "example_en": "Hackers attacked the government website to steal sensitive information.",
      "example_cn": "黑客攻击了政府网站以窃取敏感信息。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "assault",
      "analysis": "“Assault”（袭击）通常指更直接、更暴力的身体攻击，常用于法律语境，强调非法暴力行为的即时性和人身伤害性。而 “attack” 范围更广，可包括言语、网络、心理或军事层面的进攻，不一定涉及身体接触。"
    },
    {
      "word_to_compare": "criticism",
      "analysis": "“Criticism”（批评）是中性或温和的评价，即使负面，也通常基于理性分析；而 “attack” 在作为动词或名词时带有强烈敌意和情绪化色彩，意在摧毁而非讨论。例如：‘The review offered criticism’ vs. ‘The review launched a vicious attack’。"
    },
    {
      "word_to_compare": "onset",
      "analysis": "“Onset”（发作）仅指某种状况（如疾病）开始出现的时间点或过程，是中性描述；而 “attack” 在医学语境中不仅指开始，还强调其突然性、剧烈性和破坏性，带有更强的动态和威胁感。"
    }
  ]
}