{
  "word": "attempt",
  "pronunciation": "uh·tamp",
  "concise_definition": "n. 尝试, 试图; v. 尝试, 企图",
  "forms": {
    "third_person_singular": "attempts",
    "past_tense": "attempted",
    "past_participle": "attempted",
    "present_participle": "attempting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An effort or try to do something, especially when the outcome is uncertain or the task is difficult; it may or may not succeed.",
      "explanation_cn": "指为完成某事而做出的努力或尝试，尤其当结果不确定或任务困难时；可能成功，也可能失败。",
      "example_en": "Her first attempt to climb Mount Everest ended in failure due to bad weather.",
      "example_cn": "她首次攀登珠穆朗玛峰的尝试因恶劣天气而失败。"
    },
    {
      "pos": "noun",
      "explanation_en": "A legal or formal effort to accomplish something, often implying intention or planning, even if unsuccessful.",
      "explanation_cn": "指一种法律或正式层面的企图或努力，常暗示有意图或计划，即使未成功。",
      "example_en": "The court ruled that the defendant's attempt to bribe the witness was a criminal offense.",
      "example_cn": "法院裁定被告企图贿赂证人构成刑事犯罪。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make an effort to do something, especially something challenging or risky, without guarantee of success.",
      "explanation_cn": "指努力去做某事，尤其是具有挑战性或风险的事情，但不保证能成功。",
      "example_en": "He attempted to solve the complex math problem in under five minutes.",
      "example_cn": "他试图在五分钟内解决这个复杂的数学问题。"
    },
    {
      "pos": "verb",
      "explanation_en": "To try to commit a crime or achieve an illegal goal, even if not completed.",
      "explanation_cn": "指试图实施犯罪或达成非法目标，即使未完成。",
      "example_en": "The suspect was arrested for attempting to break into the bank vault.",
      "example_cn": "该嫌疑人因企图闯入银行金库而被逮捕。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "try",
      "analysis": "“Try” (尝试) 是更口语化、更通用的词，适用于日常各种努力，语气较轻，不强调意图或后果。而 “attempt” 更正式，常用于书面语或法律语境，暗示更明确的意图或更严肃的努力，有时带有失败的意味。"
    },
    {
      "word_to_compare": "endeavor",
      "analysis": "“Endeavor” (努力) 强调持续、有决心和有目标的努力，通常带有积极、高尚或正式的色彩，常用于描述长期或崇高的目标。而 “attempt” 更侧重于单次、具体的行动，不一定体现持久性或道德高度。"
    },
    {
      "word_to_compare": "seek",
      "analysis": "“Seek” (寻求) 指主动寻找或追求某物或某种状态，强调目标导向的探索过程，如寻求答案、寻求帮助。而 “attempt” 强调的是采取行动去完成某事，即使目标已明确，重点在于“做”的动作而非“找”的过程。"
    }
  ]
}