{
  "word": "attracting",
  "pronunciation": "uh·trak·ting",
  "concise_definition": "v. 吸引, 招引, 使感兴趣",
  "forms": {
    "base_form": "attract",
    "third_person_singular": "attracts",
    "past_tense": "attracted",
    "past_participle": "attracted",
    "present_participle": "attracting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To draw attention, interest, or desire toward something or someone, often due to appealing qualities such as beauty, value, or charm.",
      "explanation_cn": "指由于某种吸引力（如美丽、价值或魅力）而引起他人注意、兴趣或渴望。",
      "example_en": "The bright colors and catchy melody are attracting more listeners to the song.",
      "example_cn": "鲜艳的色彩和朗朗上口的旋律正吸引越来越多的听众关注这首歌。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to move toward or come into contact with something else, often through physical force such as magnetism or gravity.",
      "explanation_cn": "指通过物理力量（如磁力或重力）使某物向另一物移动或靠近。",
      "example_en": "The magnet is attracting metal filings from the surrounding surface.",
      "example_cn": "这块磁铁正在将周围的金属屑吸附过来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To draw in or acquire something desirable, such as customers, investment, or talent, often through strategic appeal or advantage.",
      "explanation_cn": "指通过策略性优势或吸引力，招揽或获得某种有价值的事物，如客户、投资或人才。",
      "example_en": "The city is attracting tech startups with tax incentives and modern infrastructure.",
      "example_cn": "这座城市正通过税收优惠和现代化基础设施吸引科技初创企业。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "appeal",
      "analysis": "“Appeal”（吸引）更侧重于情感或理性上的诉求，常用于描述某物激发兴趣或愿望的能力，但不一定导致实际靠近或获得。而 “attracting” 更强调实际的拉近、吸引或招徕，具有更强的行动导向性。例如：The poster appeals to young people（海报吸引年轻人）强调心理共鸣；The store is attracting crowds（商店吸引人群）强调物理聚集。"
    },
    {
      "word_to_compare": "draw",
      "analysis": "“Draw”（吸引）与 “attracting” 在许多语境中可互换，但 “draw” 更常用于比喻性或视觉性的情境，如“draw attention”或“draw a crowd”，语气较口语化；而 “attracting” 更正式，涵盖范围更广，包括物理吸引（如磁力）和抽象吸引（如魅力、政策）。"
    },
    {
      "word_to_compare": "entice",
      "analysis": "“Entice”（引诱）带有明显的诱导或诱惑意味，常含贬义，暗示通过不完全诚实或过度承诺的方式吸引他人。而 “attracting” 是中性词，仅表示自然或正当的吸引力，不隐含欺骗意图。例如：The ad enticed customers with false discounts（广告用虚假折扣引诱顾客） vs. The museum attracts visitors with rare artifacts（博物馆以稀有文物吸引游客）。"
    }
  ]
}