{
  "word": "attrition",
  "pronunciation": "uh·trish·uhn",
  "concise_definition": "n. 逐渐减少, 耗损, 磨损",
  "forms": {
    "plural": "attritions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The gradual reduction in the number of people in a group, especially through resignation, retirement, or death, rather than through active dismissal or termination.",
      "explanation_cn": "指由于辞职、退休或死亡等原因，群体中人数逐渐减少，而非通过主动解雇或辞退。",
      "example_en": "The company has seen high attrition rates among junior staff due to low salaries and poor work-life balance.",
      "example_cn": "由于薪资偏低和工作与生活失衡，该公司初级员工的流失率很高。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process of wearing down or eroding something through prolonged friction, pressure, or continuous use, often leading to deterioration or loss of effectiveness.",
      "explanation_cn": "指通过长期摩擦、压力或持续使用而导致某物磨损、退化或效能降低的过程。",
      "example_en": "The constant attrition of the cliff face by ocean waves has created dramatic sea stacks.",
      "example_cn": "海浪对悬崖面的长期侵蚀形成了壮观的海蚀柱。"
    },
    {
      "pos": "noun",
      "explanation_en": "In military or strategic contexts, the gradual weakening of an opponent through sustained losses in personnel, resources, or morale over time.",
      "explanation_cn": "在军事或战略语境中，指通过长期的人力、资源或士气损耗逐步削弱对手。",
      "example_en": "The war became a war of attrition, with neither side able to achieve a decisive victory.",
      "example_cn": "这场战争演变为消耗战，双方都无法取得决定性胜利。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "turnover",
      "analysis": "“Turnover” (人员流动率) 通常指组织中员工进出的总频率，包括主动离职和被动解雇，是一个中性统计术语。而 “attrition” 特指因自然原因（如退休、辞职）导致的人员减少，不包含被解雇的情况，更强调‘自然流失’。"
    },
    {
      "word_to_compare": "erosion",
      "analysis": "“Erosion” (侵蚀) 主要用于物理或地理语境，指自然力量（如风、水）对地表的逐步破坏。虽然 “attrition” 在物理意义上可与之互换，但 “erosion” 更强调外部力量的作用，而 “attrition” 可用于抽象领域（如人员、士气）的渐进损耗。"
    },
    {
      "word_to_compare": "depletion",
      "analysis": "“Depletion” (耗尽) 指资源或数量被大量消耗直至接近枯竭，通常暗示一种更剧烈或最终性的减少。而 “attrition” 强调缓慢、持续、渐进的过程，不一定导致完全耗尽，更侧重于过程本身而非结果。"
    }
  ]
}