{
  "word": "authorship",
  "pronunciation": "aw·thur·ship",
  "concise_definition": "n. 作者身份, 作品的创作权, 著作权",
  "forms": {
    "plural": "authorships"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The state or condition of being the author of a written work, including the legal and moral right to claim ownership and credit for its creation.",
      "explanation_cn": "指作为某书面作品作者的身份或状态，包括依法和道德上主张对该作品创作拥有所有权和署名权的权利。",
      "example_en": "The authorship of the manuscript has been disputed by scholars for decades.",
      "example_cn": "这份手稿的作者身份几十年来一直受到学者们的争议。"
    },
    {
      "pos": "noun",
      "explanation_en": "The collective body of works produced by a particular author, often used to refer to their entire literary or intellectual output.",
      "explanation_cn": "指某位作者所创作的全部作品集合，常用于指代其整个文学或智力成果。",
      "example_en": "Her authorship includes ten novels, three essay collections, and numerous academic papers.",
      "example_cn": "她的著作包括十部小说、三部散文集和大量学术论文。"
    },
    {
      "pos": "noun",
      "explanation_en": "The attribution of creative or intellectual responsibility for a work, especially in collaborative or anonymous contexts.",
      "explanation_cn": "指在合作或匿名情境下，对某作品的创造性或智力责任的归属认定。",
      "example_en": "The authorship of the anonymous blog post was later revealed to be a pseudonym used by a well-known journalist.",
      "example_cn": "这篇匿名博客文章的作者身份后来被揭露为一位知名记者使用的笔名。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "copyright",
      "analysis": "“Copyright”（版权）是一个法律术语，指法律赋予创作者对其作品的复制、分发、表演等专有权利，侧重于经济权利和法律保护。而 “authorship” 更强调创作行为本身和作者身份的归属，是权利的前提，但不必然包含法律效力。"
    },
    {
      "word_to_compare": "authorship",
      "analysis": "“Attribution”（署名/归因）是将作品与创作者联系起来的行为或过程，常用于学术引用、艺术标注或数字内容的来源说明。它是一个动作或程序，而 “authorship” 是一种身份或状态。例如，你可以 ‘give attribution’，但你 ‘hold authorship’。"
    },
    {
      "word_to_compare": "creation",
      "analysis": "“Creation”（创作）泛指任何创造性行为或产物，可适用于艺术、音乐、发明等广泛领域，不局限于文字作品。而 “authorship” 特指文字作品的作者身份，具有更强的文本性和文学性内涵。"
    }
  ]
}