{
  "word": "authoritarian",
  "pronunciation": "aw·thuh·righ·tee·ri·uhn",
  "concise_definition": "adj. 专制的, 权威主义的; n. 专制主义者",
  "forms": {
    "comparative": "more authoritarian",
    "superlative": "most authoritarian",
    "noun_form": "authoritarianism"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing a system, style, or person that demands complete obedience and centralizes power in a single authority, often suppressing dissent and individual freedoms.",
      "explanation_cn": "形容一种制度、风格或个人，要求绝对服从，将权力集中于单一权威，通常压制异议和个人自由。",
      "example_en": "The regime is known for its authoritarian control over the media and education.",
      "example_cn": "该政权以对媒体和教育的专制控制而闻名。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by strict discipline, rigid hierarchy, and little tolerance for questioning or autonomy, often in social or organizational contexts.",
      "explanation_cn": "以严格的纪律、僵化的等级制度和对质疑或自主性的低容忍度为特征，常用于社会或组织环境中。",
      "example_en": "Her authoritarian parenting style left little room for her children's opinions.",
      "example_cn": "她专制的育儿方式几乎没有给孩子表达意见的空间。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who supports or advocates for authoritarian principles, especially in politics or governance.",
      "explanation_cn": "指支持或倡导专制原则的人，尤其在政治或治理领域。",
      "example_en": "The politician was labeled an authoritarian by human rights organizations for his suppression of free speech.",
      "example_cn": "由于压制言论自由，这位政治家被人权组织称为专制主义者。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "autocratic",
      "analysis": "“Autocratic”（独裁的）与 “authoritarian” 非常接近，都指权力高度集中。但 “autocratic” 更强调个人独裁者的绝对统治，常带有个人色彩；而 “authoritarian” 可用于描述制度、文化或系统，范围更广，不一定依赖单一领袖。"
    },
    {
      "word_to_compare": "dictatorial",
      "analysis": "“Dictatorial”（独裁的）语气更强烈，通常带有负面道德评判，暗示暴虐、压迫和不合法的权力行使。而 “authoritarian” 更中性，可用于描述非民主但未必残暴的治理模式，如某些威权国家。"
    },
    {
      "word_to_compare": "tyrannical",
      "analysis": "“Tyrannical”（暴虐的）强调统治者滥用权力、残酷压迫人民，带有强烈的道德谴责。它侧重于权力的滥用和对人的伤害，而 “authoritarian” 侧重于权力结构和服从机制，不一定涉及暴力或残忍。"
    }
  ]
}