{
  "word": "autonomy",
  "pronunciation": "aw·tuh·nom·uh·tee",
  "concise_definition": "n. 自治, 自主, 自立",
  "forms": {
    "plural": "autonomies"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The right or condition of self-governance; the ability of an individual, group, or entity to make independent decisions without external control or interference.",
      "explanation_cn": "指个人、群体或实体在不受外部控制或干涉的情况下自主做出决策的权利或状态。",
      "example_en": "The region was granted autonomy to manage its own education and healthcare systems.",
      "example_cn": "该地区被授予自治权，以自行管理其教育和医疗体系。"
    },
    {
      "pos": "noun",
      "explanation_en": "In philosophy and psychology, the capacity of a rational agent to make informed, uncoerced choices based on personal values and reasoning.",
      "explanation_cn": "在哲学和心理学中，指理性个体基于个人价值观和理性思考，做出知情且不受胁迫选择的能力。",
      "example_en": "Respecting patient autonomy is a fundamental principle in medical ethics.",
      "example_cn": "尊重患者的自主权是医学伦理的基本原则。"
    },
    {
      "pos": "noun",
      "explanation_en": "In robotics and artificial intelligence, the ability of a system to operate independently and make decisions without human intervention.",
      "explanation_cn": "在机器人学和人工智能中，指系统在无需人为干预的情况下独立运行和做出决策的能力。",
      "example_en": "The autonomous drone can navigate complex terrain using onboard sensors and AI algorithms.",
      "example_cn": "这架自主无人机能够利用机载传感器和人工智能算法在复杂地形中自主导航。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "independence",
      "analysis": "“Independence” (独立) 强调从外部权威或控制中脱离，常用于国家、组织或个人的政治或经济自由。而 “autonomy” 更侧重于内部决策权的行使，即使在某种隶属关系中（如联邦制下的省份），仍可拥有自治权。"
    },
    {
      "word_to_compare": "freedom",
      "analysis": "“Freedom” (自由) 是一个更广泛、更抽象的概念，涵盖言论、行动、信仰等多方面的无拘束状态。而 “autonomy” 更具体，特指在特定领域内自我管理、自我决定的权利，是自由的一种制度化体现。"
    },
    {
      "word_to_compare": "self-determination",
      "analysis": "“Self-determination” (自决) 通常用于政治语境，指一个民族或群体决定自身政治地位和经济、社会、文化发展的权利，具有强烈的集体性和历史性。而 “autonomy” 可用于个体、组织或地区，范围更广，不一定涉及民族或主权问题。"
    }
  ]
}