{
  "word": "award",
  "pronunciation": "uh·wɔrd",
  "concise_definition": "n. 奖励, 奖品, 奖项; v. 授予, 判给",
  "forms": {
    "third_person_singular": "awards",
    "past_tense": "awarded",
    "past_participle": "awarded",
    "present_participle": "awarding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A prize, honor, or recognition given to someone for achievement, excellence, or service, often in a formal ceremony or by an official body.",
      "explanation_cn": "指为表彰某人的成就、卓越表现或服务而授予的奖品、荣誉或认可，通常在正式仪式中由官方机构颁发。",
      "example_en": "She won the Nobel Prize, the highest award in literature.",
      "example_cn": "她获得了诺贝尔奖，这是文学领域的最高奖项。"
    },
    {
      "pos": "noun",
      "explanation_en": "A legal decision or judgment, especially one made by an arbitrator or court, determining rights or compensation.",
      "explanation_cn": "指由仲裁员或法院作出的具有法律效力的裁决，用于确定权利或赔偿金额。",
      "example_en": "The arbitration panel awarded the plaintiff $500,000 in damages.",
      "example_cn": "仲裁小组裁定原告获得五十万美元的赔偿。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give something officially or formally as a prize, honor, or compensation, often based on merit or legal judgment.",
      "explanation_cn": "指正式或官方地授予某人奖品、荣誉或赔偿，通常基于其贡献、成就或法律裁决。",
      "example_en": "The university awarded her an honorary doctorate for her contributions to science.",
      "example_cn": "这所大学因她对科学的贡献而授予她荣誉博士学位。"
    },
    {
      "pos": "verb",
      "explanation_en": "To decide and assign something, especially money or responsibility, through a formal process such as arbitration or bidding.",
      "explanation_cn": "指通过仲裁、竞标等正式程序决定并分配某物，尤指金钱或责任。",
      "example_en": "The contract was awarded to the lowest bidder after a competitive review.",
      "example_cn": "经过竞争性评审后，该合同被授予了出价最低的投标方。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "prize",
      "analysis": "“Prize”（奖品）通常指竞赛或比赛中赢得的具体物品或奖金，强调物质奖励和竞争性结果；而 “award” 更广泛，可包括荣誉、头衔或法律裁决，不一定通过竞赛获得，且更强调权威机构的正式授予。"
    },
    {
      "word_to_compare": "reward",
      "analysis": "“Reward”（报酬/回报）侧重于对行为或服务的回应，常为非正式或个人性质的回馈，如金钱、感谢或礼物；而 “award” 更正式、制度化，通常由组织或权威机构基于标准或成就颁发，具有公开性和象征意义。"
    },
    {
      "word_to_compare": "grant",
      "analysis": "“Grant”（拨款/授予）多用于指政府或机构提供资金、权限或许可，常用于科研、教育或公益领域，强调资源的分配而非表彰；而 “award” 更侧重于对成就的认可或法律裁决的结果，具有评价性和荣誉性。"
    }
  ]
}