{
  "word": "awkward",
  "pronunciation": "aw·kwerd",
  "concise_definition": "adj. 尴尬的, 不自然的, 笨拙的, 难处理的",
  "forms": {
    "comparative": "more awkward",
    "superlative": "most awkward"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Causing or feeling embarrassment or discomfort due to social unease, lack of grace, or inappropriate behavior.",
      "explanation_cn": "由于社交上的不自在、缺乏优雅或行为不当而引起或感到尴尬或不适的。",
      "example_en": "He made an awkward silence after accidentally insulting the guest.",
      "example_cn": "他不小心冒犯了客人后，现场陷入了一阵尴尬的沉默。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Lacking skill, coordination, or ease in movement or action; clumsy or ungraceful.",
      "explanation_cn": "在动作或行为上缺乏技巧、协调性或自然感；笨拙的、不灵巧的。",
      "example_en": "She gave an awkward smile and fumbled with her keys.",
      "example_cn": "她露出一个僵硬的微笑，手忙脚乱地摆弄着钥匙。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Difficult to handle, manage, or deal with due to complexity, sensitivity, or inconvenience.",
      "explanation_cn": "由于复杂性、敏感性或不便而难以处理、管理或应对的。",
      "example_en": "The company faced an awkward situation when the CEO resigned mid-negotiation.",
      "example_cn": "当首席执行官在谈判中途辞职时，公司陷入了棘手的境地。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Not conveniently arranged or positioned; inconveniently placed or shaped.",
      "explanation_cn": "未被方便地安排或定位；位置或形状不便的。",
      "example_en": "The furniture was arranged in an awkward corner that blocked the doorway.",
      "example_cn": "家具被摆在一个尴尬的角落，挡住了门道。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "embarrassed",
      "analysis": "“Embarrassed”（感到尴尬的）强调的是主观情绪状态，通常指因某种行为或情境而感到羞愧或难堪。而 “awkward” 更侧重于描述情境或行为本身的性质——即使当事人没有感到羞愧，该情境仍可被称为 “awkward”。例如，一个旁观者可能觉得一场对话很尴尬，但参与者并不觉得。"
    },
    {
      "word_to_compare": "clumsy",
      "analysis": "“Clumsy”（笨拙的）主要指身体动作不协调或缺乏灵巧，常用于物理层面的失误，如打翻杯子。而 “awkward” 不仅包含身体笨拙，还涵盖社交、语言、情境等更广泛的不自然或不适感，语义范围更广。"
    },
    {
      "word_to_compare": "uncomfortable",
      "analysis": "“Uncomfortable”（不舒服的）是一个更宽泛的词，可指身体不适（如椅子太硬）或心理不适（如话题敏感）。而 “awkward” 特指因社交或情境的不协调、不合时宜而产生的那种微妙的、令人局促的不适感，更具语境依赖性。"
    }
  ]
}