{
  "word": "babylon",
  "pronunciation": "buh·bil·uhn",
  "concise_definition": "n. 巴比伦, 混乱, 腐败的象征",
  "forms": {
    "plural": "Babylons"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An ancient city in Mesopotamia, located in present-day Iraq, known for its grand architecture, including the Hanging Gardens, and its historical significance as a center of culture, science, and power in the ancient world.",
      "explanation_cn": "古代美索不达米亚的一座城市，位于今伊拉克境内，以其宏伟的建筑（如空中花园）闻名，是古代世界文化、科学与权力的重要中心。",
      "example_en": "The ruins of Babylon still attract historians and tourists from around the world.",
      "example_cn": "巴比伦的遗迹仍吸引着来自世界各地的历史学家和游客。"
    },
    {
      "pos": "noun",
      "explanation_en": "A symbolic representation of moral corruption, decadence, and worldly excess, especially in religious or literary contexts, often derived from biblical references to Babylon as a city of sin.",
      "explanation_cn": "在宗教或文学语境中，象征道德堕落、奢靡腐化与世俗放纵的意象，常源于《圣经》中将巴比伦描绘为罪恶之城的描述。",
      "example_en": "The novel portrays the city as a modern Babylon, where wealth and pleasure mask deep spiritual emptiness.",
      "example_cn": "这部小说将这座城市描绘成一个现代巴比伦，财富与享乐掩盖了深层的精神空虚。"
    },
    {
      "pos": "noun",
      "explanation_en": "A metaphor for any complex, confusing, or chaotic system, especially one involving language, bureaucracy, or technology that is difficult to understand or navigate.",
      "explanation_cn": "比喻任何复杂、混乱或无序的系统，尤指语言、官僚体系或技术等难以理解或应对的结构。",
      "example_en": "The government's paperwork was a true Babylon of forms and regulations.",
      "example_cn": "政府的文书工作是一场真正的巴比伦式繁文缛节。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rome",
      "analysis": "“Rome”（罗马）在象征意义上常代表帝国的权力、秩序与法律传统，有时也象征腐败，但更强调制度性与历史延续性；而 “Babylon” 更侧重于道德堕落、感官享乐与精神背叛，其象征更具宗教批判色彩。"
    },
    {
      "word_to_compare": "sodom",
      "analysis": "“Sodom”（所多玛）在《圣经》中象征极端的性放纵与神的惩罚，其意象更聚焦于性道德的沦丧；而 “Babylon” 的腐败涵盖更广，包括经济剥削、宗教伪善与文化傲慢，是更全面的文明堕落象征。"
    },
    {
      "word_to_compare": "chaos",
      "analysis": "“Chaos”（混乱）是一个中性或抽象的术语，指无序状态本身；而 “Babylon” 是一个具象的文化符号，承载着历史、宗教与文学的多重隐喻，其混乱带有道德谴责与文明批判的深层含义，远比 “chaos” 更富文化重量。"
    }
  ]
}