{
  "word": "badge",
  "pronunciation": "baj",
  "concise_definition": "n. 徽章, 标志, 证章",
  "forms": {
    "plural": "badges"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small, often metal or plastic object worn on clothing to indicate identity, affiliation, achievement, or authority, such as a police officer's emblem or a school pin.",
      "explanation_cn": "一种小型的、通常由金属或塑料制成的物件，佩戴在衣物上以表明身份、隶属关系、成就或权威，例如警察的徽章或学校的校徽。",
      "example_en": "The detective showed his badge to prove he was with the police department.",
      "example_cn": "侦探出示了他的徽章，以证明自己是警察局的成员。"
    },
    {
      "pos": "noun",
      "explanation_en": "A symbol or mark that represents a quality, status, or role, often used metaphorically to describe something that serves as a visible sign of belonging or recognition.",
      "explanation_cn": "一种象征某种品质、地位或角色的标志，常用于比喻意义上，指代某种作为归属感或认可的可见象征。",
      "example_en": "Wearing a volunteer T-shirt is a badge of honor for many community members.",
      "example_cn": "对于许多社区成员来说，穿着志愿者T恤是一种荣誉的象征。"
    },
    {
      "pos": "noun",
      "explanation_en": "In computing, a visual indicator or icon displayed on an app or website to notify users of new information, such as unread messages or updates.",
      "explanation_cn": "在计算机领域，指显示在应用程序或网站上的视觉指示器或图标，用于通知用户有新信息，如未读消息或更新。",
      "example_en": "The app showed a red badge with the number 3, indicating three new notifications.",
      "example_cn": "该应用显示了一个带有数字3的红色徽标，表示有三条新通知。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "emblem",
      "analysis": "“Emblem”（徽记）通常指具有象征意义的图案或设计，强调其代表抽象概念（如国家、组织理念）的符号性，常用于正式或庄严的语境，如国徽。而 “badge” 更侧重于实际佩戴的实体物品，功能性强，常用于身份识别或权限证明。"
    },
    {
      "word_to_compare": "label",
      "analysis": "“Label”（标签）通常指贴在物体上用于标识内容、类别或说明的文字或符号，多为印刷品，不具佩戴功能。而 “badge” 是可佩戴的、具有身份或权威象征的实体标志，更强调归属感和权威性。"
    },
    {
      "word_to_compare": "token",
      "analysis": "“Token”（象征物/代币）可以是任何代表某种意义的物品，但不一定具有公开显示或身份认证的功能，有时是抽象的（如“token gesture”）。而 “badge” 是明确用于公开标识身份、资格或成就的可见标志，功能更具体、更制度化。"
    }
  ]
}