{
  "word": "bag",
  "pronunciation": "bag",
  "concise_definition": "n. 包, 袋; v. 装入袋中, 击败, 获得",
  "forms": {
    "plural": "bags",
    "third_person_singular": "bags",
    "past_tense": "bagged",
    "past_participle": "bagged",
    "present_participle": "bagging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A flexible container made of paper, plastic, fabric, or other materials, used for carrying or storing items.",
      "explanation_cn": "由纸、塑料、布料或其他材料制成的柔性容器，用于携带或存放物品。",
      "example_en": "She carried her groceries home in a reusable cloth bag.",
      "example_cn": "她用一个可重复使用的布袋把杂货带回家。"
    },
    {
      "pos": "noun",
      "explanation_en": "A quantity or amount of something, often used informally to describe a large or unspecified number (e.g., 'a bag of trouble').",
      "explanation_cn": "指某物的数量或总量，常用于非正式语境中表示大量或不确定的数量（如‘一肚子麻烦’）。",
      "example_en": "He’s got a bag of tricks up his sleeve to win the competition.",
      "example_cn": "他有一肚子绝招来赢得比赛。"
    },
    {
      "pos": "noun",
      "explanation_en": "In sports, a term for a score of zero (e.g., 'a bagel' in tennis), or a slang term for a person (e.g., 'a bag of bones').",
      "explanation_cn": "在体育中，指得分为零（如网球中的‘蛋’）；也可作俚语指人（如‘皮包骨头的人’）。",
      "example_en": "She lost the match 6–0, a real bagel.",
      "example_cn": "她以6比0输掉了比赛，真是个‘蛋’。"
    },
    {
      "pos": "verb",
      "explanation_en": "To put something into a bag or container, especially for storage or transport.",
      "explanation_cn": "将某物装入袋中或容器中，尤指为了储存或运输。",
      "example_en": "The hunters bagged several deer during the morning hunt.",
      "example_cn": "猎人们在早晨的狩猎中捕获了几只鹿。"
    },
    {
      "pos": "verb",
      "explanation_en": "To achieve or obtain something, especially through effort or in a competitive context (e.g., bagging a promotion).",
      "explanation_cn": "通过努力或在竞争环境中获得某物（如赢得晋升）。",
      "example_en": "After years of hard work, she finally bagged the CEO position.",
      "example_cn": "经过多年的努力，她终于获得了首席执行官的职位。"
    },
    {
      "pos": "verb",
      "explanation_en": "To defeat or capture someone or something, often used in hunting or slang contexts.",
      "explanation_cn": "击败或捕获某人或某物，常用于狩猎或俚语语境。",
      "example_en": "The police bagged the suspect after a high-speed chase.",
      "example_cn": "警方在高速追捕后抓获了嫌疑人。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sack",
      "analysis": "“Sack”（麻袋）通常指更粗糙、更坚固的袋子，常用于装谷物或垃圾，语义上更偏向实用性和工业用途；而 “bag” 更通用，可指任何材质、大小和用途的袋子，包括时尚手袋或塑料购物袋。"
    },
    {
      "word_to_compare": "container",
      "analysis": "“Container”（容器）是更广泛的术语，包括刚性或半刚性的物体（如箱子、罐子、盒子），强调密封性和结构强度；而 “bag” 特指柔软、可折叠的容器，强调便携性和柔性。"
    },
    {
      "word_to_compare": "bundle",
      "analysis": "“Bundle”（捆、包）指将多个物品捆绑在一起，不一定装在袋子里，可能用绳子、布或胶带固定；而 “bag” 强调物品被收纳在独立的袋状结构中，有明确的边界和开口。"
    }
  ]
}