{
  "word": "bags",
  "pronunciation": "bægz",
  "concise_definition": "n. 袋子, 手提包, 眼袋",
  "forms": {
    "singular": "bag"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A container made of flexible material such as cloth, paper, or plastic, used for carrying or storing items.",
      "explanation_cn": "由布料、纸张或塑料等柔性材料制成的容器，用于携带或存放物品。",
      "example_en": "She packed her clothes into a large canvas bag before the trip.",
      "example_cn": "旅行前，她把衣服装进了一个大帆布袋里。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of hand-held or shoulder-carrying container, typically used for personal items, often made of leather or fabric and designed for fashion or utility.",
      "explanation_cn": "一种手持或肩背的容器，通常用于携带个人物品，多由皮革或织物制成，兼具实用与时尚功能。",
      "example_en": "She carried a designer handbag to the gala dinner.",
      "example_cn": "她带着一款设计师手袋去参加晚宴。"
    },
    {
      "pos": "noun",
      "explanation_en": "Loose, sagging skin under the eyes, often associated with aging or fatigue.",
      "explanation_cn": "眼睛下方松弛下垂的皮肤，常与衰老或疲劳有关。",
      "example_en": "Lack of sleep gave her dark bags under her eyes.",
      "example_cn": "睡眠不足使她眼睛下方出现了黑眼圈。"
    },
    {
      "pos": "noun",
      "explanation_en": "A quantity or amount of something, often used informally to describe a large or unspecified number (e.g., 'bags of money').",
      "explanation_cn": "指某物的大量或不确定的数量，常用于非正式语境（如 'bags of money'）。",
      "example_en": "He made bags of money from his startup.",
      "example_cn": "他从自己的初创公司赚了一大笔钱。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sack",
      "analysis": "“Sack”（麻袋）通常指较大、较粗糙、用于盛装谷物或垃圾的开口式袋子，多为天然材料制成，强调实用性而非美观。而 “bag” 更通用，可指各种尺寸、材质和用途的袋子，包括精致的手提包。"
    },
    {
      "word_to_compare": "pouch",
      "analysis": "“Pouch”（小袋）通常指小巧、封闭式、用于存放小物件的袋子，如钱包、药袋或烟袋，结构更紧凑。而 “bag” 通常容量更大、开口更宽，用途更广泛。"
    },
    {
      "word_to_compare": "container",
      "analysis": "“Container”（容器）是更广义的术语，涵盖所有用于盛放物品的物体，包括硬质的箱子、罐子、盒子等。而 “bag” 特指柔软、可折叠、非刚性的容器，强调其柔韧性和便携性。"
    }
  ]
}