{
  "word": "bailout",
  "pronunciation": "beyl·owt",
  "concise_definition": "n. 救助, 援助; v. 救助, 援救",
  "forms": {
    "plural": "bailouts",
    "third_person_singular": "bailouts",
    "past_tense": "bailouted",
    "past_participle": "bailouted",
    "present_participle": "bailouting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A financial rescue provided by a government, organization, or individual to prevent the collapse of a failing business, institution, or economy, often involving the injection of money or credit.",
      "explanation_cn": "指政府、组织或个人为防止一家陷入困境的企业、机构或经济体系崩溃而提供的财政援助，通常涉及资金或信贷的注入。",
      "example_en": "The government approved a $50 billion bailout for the auto industry during the 2008 financial crisis.",
      "example_cn": "在2008年金融危机期间，政府批准了对汽车工业500亿美元的救助计划。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of paying someone's debt or legal bond to secure their release from custody, especially in a legal or criminal context.",
      "explanation_cn": "指支付某人的债务或保释金以使其从拘留中获释，尤其用于法律或刑事语境中。",
      "example_en": "He was released after his friend arranged a bail-out of $10,000.",
      "example_cn": "他的朋友为他支付了1万美元的保释金后，他被释放了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provide financial assistance to a failing entity to prevent its collapse, especially in an economic or institutional context.",
      "explanation_cn": "指向陷入困境的实体提供财政援助，以防止其崩溃，尤其用于经济或机构语境中。",
      "example_en": "The central bank bailed out several commercial banks to stabilize the financial system.",
      "example_cn": "央行救助了数家商业银行，以稳定金融体系。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pay someone's bail to secure their release from jail.",
      "explanation_cn": "指支付某人的保释金以使其从监狱获释。",
      "example_en": "She bailed out her brother after he was arrested for drunk driving.",
      "example_cn": "她哥哥因酒驾被捕后，她为他支付了保释金。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "subsidy",
      "analysis": "“Subsidy”（补贴）是政府为支持特定行业、企业或群体而提供的持续性财政支持，通常用于降低价格、鼓励生产或维持就业，具有长期性和制度性。而 “bailout” 是针对紧急危机的临时性、一次性援助，目的是防止系统性崩溃，带有强烈的紧急干预色彩。"
    },
    {
      "word_to_compare": "loan",
      "analysis": "“Loan”（贷款）是需要偿还的借款，通常附带利息和还款期限，是一种金融交易而非援助。而 “bailout” 虽然有时以贷款形式进行，但往往包含部分或全部债务豁免，其本质是救助而非商业借贷，带有政策性与慈善性。"
    },
    {
      "word_to_compare": "rescue",
      "analysis": "“Rescue”（营救）是一个更广泛的词，可用于物理、生命或抽象情境（如救援被困人员、拯救濒危物种）。而 “bailout” 专指经济或法律层面的财务援助，语义范围更窄、更专业，常用于金融和政治语境中。"
    }
  ]
}