{
  "word": "bait",
  "pronunciation": "bāt",
  "concise_definition": "n. 鱼饵, 诱饵; v. 用诱饵引诱, 挑逗, 嘲弄",
  "forms": {
    "plural": "baits",
    "third_person_singular": "bait",
    "past_tense": "baited",
    "past_participle": "baited",
    "present_participle": "baiting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A substance or object used to attract animals, especially fish or birds, for the purpose of catching them; often food or something that mimics food.",
      "explanation_cn": "用于吸引动物（尤其是鱼或鸟）以便捕捉的物质或物体，通常是食物或模仿食物的物品。",
      "example_en": "He used worms as bait to catch trout.",
      "example_cn": "他用蚯蚓作为鱼饵来钓鳟鱼。"
    },
    {
      "pos": "noun",
      "explanation_en": "Something used to lure or tempt a person into a trap, action, or situation, often with deceptive or manipulative intent.",
      "explanation_cn": "用于引诱某人陷入陷阱、采取某种行动或进入某种情境的手段，通常带有欺骗性或操纵性。",
      "example_en": "The company offered a free trial as bait to get customers to sign up for a subscription.",
      "example_cn": "该公司以免费试用为诱饵，吸引客户订阅服务。"
    },
    {
      "pos": "verb",
      "explanation_en": "To lure or entice someone by offering something desirable, often to achieve a hidden goal.",
      "explanation_cn": "通过提供有吸引力的东西来引诱某人，通常是为了实现某种隐藏的目的。",
      "example_en": "The police baited the suspect into confessing by pretending to have evidence.",
      "example_cn": "警方假装掌握了证据，引诱嫌疑人自首。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provoke or harass someone deliberately, especially to elicit a reaction or anger; often used in the context of teasing or bullying.",
      "explanation_cn": "故意挑衅或骚扰某人，尤其是为了激起其反应或愤怒；常用于指戏弄或欺凌。",
      "example_en": "The kids kept baiting him with jokes until he lost his temper.",
      "example_cn": "孩子们不断拿笑话逗他，直到他发脾气。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "lure",
      "analysis": "“Lure” (引诱) 与 “bait” 在作为动词和名词时含义高度重叠，但 “lure” 更强调吸引力和诱惑力，常用于抽象或非物理的语境（如金钱、权力的诱惑），语气较中性或文学化；而 “bait” 更具体、更直接，常与物理诱饵或恶意挑衅相关，带有更强的操纵或欺骗色彩。"
    },
    {
      "word_to_compare": "tempt",
      "analysis": "“Tempt” (诱惑) 指通过满足欲望或需求来引诱某人做某事，通常涉及道德或自我控制的冲突（如tempted by dessert），强调内在欲望的驱动。而 “bait” 更侧重于外部设置的陷阱或圈套，常带有欺骗性，不一定是基于对方的渴望，而是利用其弱点或无知。"
    },
    {
      "word_to_compare": "provocation",
      "analysis": "“Provocation” (挑衅) 是一个抽象名词，指引发愤怒或反应的行为或言论，常用于法律或社会语境。而 “bait” 作为动词时，特指通过言语或行为主动制造挑衅，是实施挑衅的动作本身，更具主动性和策略性，常用于日常口语中的欺凌或激怒行为。"
    }
  ]
}