{
  "word": "bake",
  "pronunciation": "bāk",
  "concise_definition": "v. 烘烤, 烧制; n. 烘烤食物",
  "forms": {
    "third_person_singular": "bakes",
    "past_tense": "baked",
    "past_participle": "baked",
    "present_participle": "baking"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To cook food by dry heat in an oven, typically to produce bread, cakes, cookies, or other baked goods.",
      "explanation_cn": "指在烤箱中用干热烹调食物，通常用于制作面包、蛋糕、饼干等烘焙食品。",
      "example_en": "She baked a chocolate cake for her daughter's birthday.",
      "example_cn": "她为女儿的生日烤了一个巧克力蛋糕。"
    },
    {
      "pos": "verb",
      "explanation_en": "To subject something to prolonged exposure to heat, often causing physical or chemical change, such as hardening clay or drying paint.",
      "explanation_cn": "指将某物长时间暴露在高温下，使其发生物理或化学变化，例如使黏土硬化或使油漆干燥。",
      "example_en": "The pottery was baked at a high temperature to make it durable.",
      "example_cn": "这些陶器经过高温烧制，以增强其耐用性。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be exposed to intense heat or sunlight, often causing discomfort or damage.",
      "explanation_cn": "指暴露在强烈热量或阳光下，常导致不适或损伤。",
      "example_en": "The hikers were baked by the midday sun as they crossed the desert.",
      "example_cn": "徒步者在穿越沙漠时被正午的烈日晒得炙热难耐。"
    },
    {
      "pos": "noun",
      "explanation_en": "A social gathering or event centered around the preparation and sharing of baked goods, often for fundraising or community purposes.",
      "explanation_cn": "指以制作和分享烘焙食品为中心的社交聚会或活动，常用于筹款或社区活动。",
      "example_en": "The church held a bake sale to raise money for the new playground.",
      "example_cn": "教堂举办了一场烘焙义卖，为新建游乐场筹款。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "roast",
      "analysis": "“Roast”（烘烤/烤制）通常用于指用高温干热烹调肉类或蔬菜，强调外皮焦香、内部多汁，常在烤箱或明火上进行，且多用于动物性食材。而 “bake” 更广泛用于面食、甜点或非肉类食材，强调均匀受热和结构固化。"
    },
    {
      "word_to_compare": "broil",
      "analysis": "“Broil”（炙烤）是通过来自上方的直接高温热源（如烤箱上加热管）快速烹调食物，使表面迅速焦化，常用于牛排或鱼类。它比 “bake” 更剧烈、更快速，且热源方向单一。而 “bake” 使用的是环绕式均匀热力，适合长时间慢熟。"
    },
    {
      "word_to_compare": "toast",
      "analysis": "“Toast”（烘烤面包）特指将面包片置于热源下使其表面变脆、变色，是一种快速、局部的加热过程。它只是 “bake” 的一种狭义形式，通常不涉及整体结构变化，而 “bake” 可以从零开始制作完整食品。"
    }
  ]
}