{
  "word": "balkan",
  "pronunciation": "bahl·kahn",
  "concise_definition": "adj. 巴尔干的, n. 巴尔干半岛",
  "forms": {
    "plural": "balkans"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to the Balkan Peninsula in southeastern Europe, including its history, politics, culture, or geography.",
      "explanation_cn": "指位于东南欧的巴尔干半岛的，涉及其历史、政治、文化或地理特征的。",
      "example_en": "The Balkan region has experienced decades of ethnic conflict and political instability.",
      "example_cn": "巴尔干地区经历了数十年的民族冲突和政治动荡。"
    },
    {
      "pos": "noun",
      "explanation_en": "The Balkan Peninsula, a geographic region in southeastern Europe bounded by the Adriatic, Ionian, and Black Seas, and home to countries such as Serbia, Croatia, Bosnia and Herzegovina, Albania, and Greece.",
      "explanation_cn": "指位于东南欧的巴尔干半岛，西临亚得里亚海，南临爱奥尼亚海，东临黑海，包括塞尔维亚、克罗地亚、波斯尼亚和黑塞哥维那、阿尔巴尼亚和希腊等国家。",
      "example_en": "Travelers often explore the Balkans for its rich history, mountainous landscapes, and diverse cuisines.",
      "example_cn": "旅行者常前往巴尔干地区，探索其丰富的历史、多山的景观和多样的美食。"
    },
    {
      "pos": "verb",
      "explanation_en": "To refuse to cooperate or to block progress, especially in a stubborn or obstructive way; often used in the phrase 'to balk at'.",
      "explanation_cn": "指以固执或阻碍的方式拒绝合作或阻止进展，常与 'balk at' 连用。",
      "example_en": "The committee balked at the proposed budget cuts, calling them too severe.",
      "example_cn": "委员会对所提议的预算削减表示反对，称其过于严厉。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "balkanize",
      "analysis": "“Balkanize” (巴尔干化) 是一个动词，指将一个地区或组织分裂成多个小的、敌对的、难以协调的实体，源于巴尔干半岛历史上因民族和政治分裂而引发的冲突。它强调分裂和碎片化，而 “balkan” 本身仅是地理或形容词性描述，不包含分裂的含义。"
    },
    {
      "word_to_compare": "peninsula",
      "analysis": "“Peninsula” (半岛) 是一个通用地理术语，指三面环水、一面连接陆地的地形。而 “Balkan” 是一个专有名词，特指东南欧的巴尔干半岛，具有特定的历史和政治内涵，不能与其他半岛（如意大利半岛）互换使用。"
    },
    {
      "word_to_compare": "obstruct",
      "analysis": "“Obstruct” (阻碍) 是一个通用动词，指任何形式的阻挡或妨碍，中性或负面，但无情感色彩。而 “balk” 作为动词时，带有主观的、情绪化的拒绝意味，常暗示因犹豫、固执或道德反感而退缩，语义更细腻。"
    }
  ]
}