{
  "word": "balloon",
  "pronunciation": "buh·loon",
  "concise_definition": "n. 气球, v. 膨胀, 急剧增加",
  "forms": {
    "plural": "balloons",
    "third_person_singular": "balloons",
    "past_tense": "ballooned",
    "past_participle": "ballooned",
    "present_participle": "ballooning"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A lightweight, flexible bag filled with gas (such as helium or hot air) that can rise and float in the air, often used for decoration, entertainment, or scientific research.",
      "explanation_cn": "一种轻质、柔韧的袋子，充满气体（如氦气或热空气），可升空漂浮，常用于装饰、娱乐或科学研究。",
      "example_en": "Children laughed as the colorful balloons floated up into the sky.",
      "example_cn": "孩子们看着五彩缤纷的气球飘向天空，哈哈大笑。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of garment with a fitted top and a wide, flared bottom, resembling the shape of a balloon.",
      "explanation_cn": "一种上身贴身、下摆宽大蓬松的服装，形状类似气球。",
      "example_en": "She wore a balloon skirt to the party, which swirled dramatically as she danced.",
      "example_cn": "她参加派对时穿了一条蓬裙，跳舞时裙摆优雅地旋开。"
    },
    {
      "pos": "verb",
      "explanation_en": "To expand or increase rapidly and often uncontrollably, especially in size, volume, or amount.",
      "explanation_cn": "指迅速且常常不受控制地膨胀、扩大，尤指尺寸、体积或数量的激增。",
      "example_en": "The cost of living has ballooned over the past decade.",
      "example_cn": "过去十年间，生活成本急剧上涨。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fill or cause something to swell with air or gas, as a balloon does.",
      "explanation_cn": "指用空气或气体填充某物，使其膨胀，如同气球一样。",
      "example_en": "They ballooned the tire until it was firm enough to drive on.",
      "example_cn": "他们给轮胎充气，直到它足够硬实可以行驶。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "inflate",
      "analysis": "“Inflate” (充气/膨胀) 通常指通过注入空气或气体使物体体积增大，强调物理动作，常用于轮胎、气垫等具体物体。而 “balloon” 作为动词时，更强调膨胀的“结果”和“趋势”，常用于描述非物理性的快速增长，如价格、债务等，带有夸张或失控的意味。"
    },
    {
      "word_to_compare": "expand",
      "analysis": "“Expand” (扩展/扩大) 是一个中性词，指范围、规模或空间的正常增长，可以是计划内的、渐进的，如公司扩张业务。而 “balloon” 暗示增长是突然的、过度的、甚至令人担忧的，常带有负面含义，如预算 ballooning（预算失控）。"
    },
    {
      "word_to_compare": "swell",
      "analysis": "“Swell” (肿胀/增大) 多用于描述因内部压力或液体积聚导致的体积增大，如伤口肿胀、海浪高涨。它强调形态的圆润和饱满，常用于身体或自然现象。而 “balloon” 更强调外形的蓬松、气囊状扩张，且常用于比喻性语境，如人口、开支的激增。"
    }
  ]
}