{
  "word": "ball",
  "pronunciation": "bawl",
  "concise_definition": "n. 球, 舞会; v. 把…团成球状",
  "forms": {
    "plural": "balls"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A round or spherical object, typically used in sports and games, made of rubber, leather, or other materials, designed to be thrown, kicked, or hit.",
      "explanation_cn": "一种圆形或球形的物体，通常由橡胶、皮革或其他材料制成，用于体育运动和游戏中，可被投掷、踢击或击打。",
      "example_en": "The children were playing soccer with a bright red ball.",
      "example_cn": "孩子们正在用一个鲜红色的球踢足球。"
    },
    {
      "pos": "noun",
      "explanation_en": "A formal social gathering, especially one involving dancing, often held in a grand hall or palace.",
      "explanation_cn": "一种正式的社交聚会，尤指以跳舞为主的舞会，通常在宏伟的大厅或宫殿中举行。",
      "example_en": "She wore a stunning gown to the royal ball last night.",
      "example_cn": "昨晚她穿着一件惊艳的礼服参加了皇家舞会。"
    },
    {
      "pos": "noun",
      "explanation_en": "A compact, rounded mass or lump of something, such as a ball of yarn, clay, or snow.",
      "explanation_cn": "指某种物质被揉成紧凑、圆形的团块，如毛线团、黏土球或雪球。",
      "example_en": "He rolled a ball of dough before placing it in the oven.",
      "example_cn": "他在把面团放进烤箱前揉成了一个球状。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form or shape something into a round or spherical mass, often by rolling or compressing.",
      "explanation_cn": "通过滚动或挤压将某物塑造成圆形或球状。",
      "example_en": "She balled up the paper and threw it into the bin.",
      "example_cn": "她把纸揉成一团，扔进了垃圾桶。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sphere",
      "analysis": "“Sphere”（球体）是几何学术语，强调完美的三维圆形形状，常用于数学、科学或抽象语境中，不用于指代具体的运动用具或社交活动。而 “ball” 更偏向日常使用，可指实物、运动器材或舞会，语义范围更广。"
    },
    {
      "word_to_compare": "gathering",
      "analysis": "“Gathering”（集会）泛指任何形式的人群聚集，如会议、聚会、集会等，语义宽泛且无特定形式。而 “ball” 特指以舞蹈为核心的正式社交活动，具有文化仪式感和特定场景，语义更具体。"
    },
    {
      "word_to_compare": "lump",
      "analysis": "“Lump”（块状物）指不规则、粗糙的固体团块，常带有负面或笨拙的含义，如“一块泥土”或“一块肿块”。而 “ball” 暗示一个更规则、更紧凑、有时更精致的圆形形态，如毛线球或雪球，语义更中性甚至积极。"
    }
  ]
}