{
  "word": "ballistic",
  "pronunciation": "buh·lis·tik",
  "concise_definition": "adj. 弹道的, 投射物的; n. 弹道导弹",
  "forms": {
    "comparative": "more ballistic",
    "superlative": "most ballistic"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to the science of projectiles in motion, especially their trajectory, velocity, and behavior under the influence of gravity and air resistance.",
      "explanation_cn": "指与投射物（如子弹、炮弹、火箭）运动相关的科学，特别是其轨迹、速度以及受重力和空气阻力影响时的行为。",
      "example_en": "The engineer analyzed the ballistic properties of the new missile design.",
      "example_cn": "工程师分析了新型导弹的弹道特性。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by a sudden, uncontrolled, or explosive movement or behavior, often used metaphorically to describe emotional outbursts.",
      "explanation_cn": "形容突然、失控或爆炸性的动作或行为，常用于隐喻性地描述情绪爆发。",
      "example_en": "She had a ballistic outburst when she heard the news, slamming doors and shouting.",
      "example_cn": "她听到这个消息后大发雷霆，摔门大喊。"
    },
    {
      "pos": "noun",
      "explanation_en": "A ballistic missile, a guided missile that follows a ballistic trajectory after its initial powered flight phase.",
      "explanation_cn": "指弹道导弹，一种在初始动力飞行阶段结束后沿弹道轨迹飞行的制导导弹。",
      "example_en": "The country has been developing long-range ballistic missiles as part of its defense strategy.",
      "example_cn": "该国正在开发远程弹道导弹作为其防御战略的一部分。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "projectile",
      "analysis": "“Projectile” (投射物) 是一个名词，指任何被抛射或发射出去的物体（如石头、子弹），强调物体本身；而 “ballistic” 是形容词，描述该物体的运动特性或与弹道学相关。前者是实体，后者是属性。"
    },
    {
      "word_to_compare": "trajectorial",
      "analysis": "“Trajectorial” 是一个极少使用的术语，理论上可指与轨迹相关的，但现代英语中几乎不使用。而 “ballistic” 是标准术语，广泛用于军事、物理和工程领域，专指受重力主导的抛体运动，语义更精确、更常用。"
    },
    {
      "word_to_compare": "explosive",
      "analysis": "“Explosive” (爆炸的) 强调由化学反应引发的剧烈能量释放，常用于描述物质或情绪的爆发；而 “ballistic” 描述的是运动轨迹或物理特性，即使没有爆炸（如自由落体的炮弹）也可使用。两者在隐喻用法中可能重叠（如 “ballistic outburst” vs. “explosive temper”），但 “ballistic” 更强调失控的迅猛性，而 “explosive” 更强调突然性和破坏力。"
    }
  ]
}