{
  "word": "balloons",
  "pronunciation": "buh·loons",
  "concise_definition": "n. 气球, 膨胀物, 膨胀",
  "forms": {
    "singular": "balloon"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A lightweight, flexible bag filled with gas (such as helium or hot air) or air, typically used for decoration, entertainment, or scientific purposes, and often made of rubber, foil, or plastic.",
      "explanation_cn": "一种轻质、柔韧的袋子，充满气体（如氦气或热空气）或空气，常用于装饰、娱乐或科学用途，通常由橡胶、箔纸或塑料制成。",
      "example_en": "Children laughed as colorful balloons floated up into the sky at the festival.",
      "example_cn": "孩子们在节日中看着五彩缤纷的气球飘向天空，欢笑不已。"
    },
    {
      "pos": "noun",
      "explanation_en": "A thing that expands or swells, often excessively or uncontrollably, such as an inflated price, budget, or claim.",
      "explanation_cn": "指某种过度或不受控制地膨胀的事物，如被抬高的价格、预算或夸大其词的主张。",
      "example_en": "The company's valuation was a balloon, inflated by speculative investment rather than real earnings.",
      "example_cn": "这家公司的估值就像一个气球，是靠投机性投资而非真实收益吹起来的。"
    },
    {
      "pos": "verb",
      "explanation_en": "To expand or swell suddenly and often uncontrollably, especially in size, volume, or amount.",
      "explanation_cn": "指突然且常常不受控制地膨胀，尤指在尺寸、体积或数量上的增加。",
      "example_en": "The cost of living has ballooned over the past decade.",
      "example_cn": "过去十年间，生活成本急剧上涨。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fill or cause something to expand with air or gas, as a balloon.",
      "explanation_cn": "指用空气或气体填充某物，使其膨胀，如同给气球充气。",
      "example_en": "She carefully ballooned the party balloons with helium before the celebration.",
      "example_cn": "她在庆祝活动前小心地用氦气给派对气球充气。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bubble",
      "analysis": "“Bubble”（气泡）通常指液体表面或内部形成的微小球形气体囊，多用于描述短暂、脆弱的现象，如肥皂泡或经济泡沫。而 “balloon” 更强调可操控、可充气的实体物体，且常用于比喻中表示持续性或显著的膨胀。"
    },
    {
      "word_to_compare": "inflate",
      "analysis": "“Inflate”（充气/膨胀）是动词，强调通过注入气体或液体使物体体积增大，是实现 “balloon” 作为动词含义的具体动作。而 “balloon” 作为动词更侧重膨胀的结果和状态，常带有失控或急剧增长的负面含义。"
    },
    {
      "word_to_compare": "swell",
      "analysis": "“Swell”（肿胀/增长）可指自然或生理上的体积增大，如伤口肿胀或海浪高涨，多用于描述渐进或非人为的膨胀过程。而 “balloon” 更常用于描述人为或突发性的剧烈膨胀，尤其在经济或抽象语境中，带有更强的夸张和警示意味。"
    }
  ]
}