{
  "word": "bands",
  "pronunciation": "bændz",
  "concise_definition": "n. 带子, 乐队, 频段, 团体",
  "forms": {
    "singular": "band"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long, narrow strip of material used to bind, fasten, or decorate something, often made of fabric, rubber, or metal.",
      "explanation_cn": "指用于捆绑、固定或装饰某物的长条状材料，通常由布料、橡胶或金属制成。",
      "example_en": "She tied her hair back with a silk band.",
      "example_cn": "她用一条丝带把头发扎起来。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of musicians who perform together, typically playing rock, pop, jazz, or other popular music styles.",
      "explanation_cn": "指一群共同演出的音乐家，通常演奏摇滚、流行、爵士或其他流行音乐风格。",
      "example_en": "The Beatles were one of the most influential bands in music history.",
      "example_cn": "披头士乐队是音乐史上最具影响力的乐队之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A range of frequencies or wavelengths used in telecommunications, radio, or electromagnetic spectrum divisions.",
      "explanation_cn": "指在电信、无线电或电磁频谱中划分出的一段频率或波长范围。",
      "example_en": "Wi-Fi signals operate on the 2.4 GHz and 5 GHz bands.",
      "example_cn": "Wi-Fi 信号在 2.4 GHz 和 5 GHz 频段上运行。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of people united by a common purpose, interest, or identity, often used metaphorically to describe social or political affiliations.",
      "explanation_cn": "指因共同目标、兴趣或身份而联合起来的一群人，常用于隐喻性地描述社会或政治团体。",
      "example_en": "The two political bands in the country are deeply divided on economic policy.",
      "example_cn": "该国的两大政治派别在经济政策上分歧严重。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "strip",
      "analysis": "“Strip”（条状物）泛指任何细长的形状，强调物理形态，但不隐含功能或组织性。而 “band” 通常具有特定用途，如捆绑、标识或功能分区（如频段），并常带有社会或组织含义。"
    },
    {
      "word_to_compare": "group",
      "analysis": "“Group”（群体）是最通用的词，泛指任何集合的人或物，无特定结构或共同活动。而 “band” 在指音乐团体或社会团体时，强调成员间的紧密协作、共同身份或文化认同，语义更具体、更具凝聚力。"
    },
    {
      "word_to_compare": "range",
      "analysis": "“Range”（范围）强调连续区间或跨度，常用于数量、程度或频率的区间描述，如温度范围。而 “band” 在频段语境中虽也指区间，但更强调技术或工程中的划分单位，具有明确的边界和命名惯例（如 UHF band），更具专业性和结构性。"
    }
  ]
}