{
  "word": "band",
  "pronunciation": "bænd",
  "concise_definition": "n. 乐队, 带子, 一群, 频段; v. 联合, 结成团体",
  "forms": {
    "plural": "bands",
    "third_person_singular": "bands",
    "past_tense": "banded",
    "past_participle": "banded",
    "present_participle": "banding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A group of musicians who perform together, typically playing rock, pop, or jazz music.",
      "explanation_cn": "指一群共同演出的音乐家，通常演奏摇滚、流行或爵士音乐。",
      "example_en": "The Beatles were one of the most influential bands in rock history.",
      "example_cn": "披头士乐队是摇滚历史上最具影响力的乐队之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A narrow strip of material, often used to bind, fasten, or decorate something.",
      "explanation_cn": "指一条窄长的材料，常用于捆绑、固定或装饰物品。",
      "example_en": "She tied her hair back with a red silk band.",
      "example_cn": "她用一条红色丝带把头发扎在脑后。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of people united by a common purpose, interest, or characteristic, often used in a slightly informal or figurative sense.",
      "explanation_cn": "指一群因共同目标、兴趣或特征而联合起来的人，常用于非正式或比喻性语境。",
      "example_en": "A band of rebels fought against the oppressive regime.",
      "example_cn": "一群叛军反抗着压迫性的政权。"
    },
    {
      "pos": "noun",
      "explanation_en": "A specific range of frequencies used for communication, broadcasting, or signal transmission (e.g., radio band, Wi-Fi band).",
      "explanation_cn": "指用于通信、广播或信号传输的特定频率范围（如无线电频段、Wi-Fi频段）。",
      "example_en": "The new smartphone supports multiple 5G bands for better connectivity.",
      "example_cn": "这款新智能手机支持多个5G频段，以实现更好的连接。"
    },
    {
      "pos": "verb",
      "explanation_en": "To unite or join together for a common purpose, often in a collective or organized way.",
      "explanation_cn": "指为共同目的而联合或结成团体，通常以集体或有组织的方式进行。",
      "example_en": "The neighbors banded together to protest the new highway construction.",
      "example_cn": "邻居们联合起来抗议新建高速公路的工程。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "group",
      "analysis": "“Group”（群体）是一个通用词，泛指任何聚集在一起的人或物，无特定结构或目的。而 “band” 更强调成员间的紧密联系、共同目标或身份认同，常带有情感色彩或文化内涵，如音乐乐队或反抗团体。"
    },
    {
      "word_to_compare": "strip",
      "analysis": "“Strip”（条状物）与 “band” 在指“窄长条”时部分重叠，但 “strip” 更中性，常用于物理形态描述（如一条纸条、一条土地），而 “band” 常隐含功能或象征意义，如发带、频段、联盟等。"
    },
    {
      "word_to_compare": "crew",
      "analysis": "“Crew”（团队）通常指为完成特定任务而组织起来的人员，如船员、剧组，强调分工与职业性。而 “band” 更侧重于情感纽带、共同爱好或文化身份，如音乐乐队或志同道合的群体，组织性较弱但凝聚力更强。"
    }
  ]
}