{
  "word": "bandwagon",
  "pronunciation": "band·wag·un",
  "concise_definition": "n. 游行花车, 时尚潮流; v. 跟风, 追逐潮流",
  "forms": {
    "plural": "bandwagons"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A large, decorated vehicle used in parades, especially in political campaigns, often carrying candidates or celebrities to attract public attention.",
      "explanation_cn": "指游行中用于载运候选人或名人、装饰华丽的车辆，常用于政治竞选中以吸引公众注意。",
      "example_en": "The candidate rode on a colorful bandwagon, waving to cheering crowds.",
      "example_cn": "这位候选人乘坐着一辆色彩鲜艳的游行花车，向欢呼的人群挥手致意。"
    },
    {
      "pos": "noun",
      "explanation_en": "A popular trend or movement that many people join, often without critical thought, simply because it is fashionable or widely supported.",
      "explanation_cn": "指一种广受欢迎的趋势或运动，许多人因它流行或得到广泛支持而盲目追随，往往缺乏独立思考。",
      "example_en": "Everyone started using that app—it became a real bandwagon, and soon no one talked about anything else.",
      "example_cn": "每个人都开始使用那个应用——它成了真正的潮流，不久之后没人再谈论别的事了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To join a popular movement, trend, or cause, especially for personal gain or social conformity rather than genuine belief.",
      "explanation_cn": "指为了个人利益或社会从众心理，而非出于真正信念，而加入一种流行运动、趋势或事业。",
      "example_en": "Many politicians bandwagoned on the environmental cause only after it became politically advantageous.",
      "example_cn": "许多政客直到环保议题变得有利可图后才开始追随这一潮流。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "trend",
      "analysis": "“Trend”（趋势）泛指一段时间内广泛流行的行为、风格或偏好，是中性词，可指技术、时尚或社会行为的走向。而 “bandwagon” 更强调人们盲目跟风的从众心理，带有贬义，暗示缺乏独立判断。"
    },
    {
      "word_to_compare": "fad",
      "analysis": "“Fad”（一时风尚）指短暂流行的潮流，通常很快过时，强调其短暂性。而 “bandwagon” 更侧重于人们参与该潮流的动机——为融入群体或获取利益，而非潮流本身是否短暂。一个 fad 可能引发 bandwagon effect，但 bandwagon 不一定是 fad。"
    },
    {
      "word_to_compare": "herd mentality",
      "analysis": "“Herd mentality”（群体心理）是心理学概念，指个体在群体中放弃独立思考、模仿他人行为的倾向。它是 “bandwagon” 行为背后的心理机制。而 “bandwagon” 是这种心理在社会现象中的具体表现，常用于描述政治、商业或文化中的从众行为。"
    }
  ]
}