{
  "word": "bank",
  "pronunciation": "bangk",
  "concise_definition": "n. 银行, 岸, 堤; v. 存款, 倚靠, 投资",
  "forms": {
    "plural": "banks"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A financial institution that accepts deposits, provides loans, and offers other financial services such as currency exchange and investment products.",
      "explanation_cn": "一种接受存款、提供贷款并提供其他金融服务（如货币兑换和投资产品）的金融机构。",
      "example_en": "I deposited my salary into my savings account at the local bank.",
      "example_cn": "我把工资存进了当地银行的储蓄账户。"
    },
    {
      "pos": "noun",
      "explanation_en": "The land alongside or sloping down to a river, lake, or other body of water; a ridge or mound of earth.",
      "explanation_cn": "河流、湖泊或其他水体旁边的陆地或斜坡；土堆或堤岸。",
      "example_en": "We sat on the bank of the river and watched the sunset.",
      "example_cn": "我们坐在河岸上，看着日落。"
    },
    {
      "pos": "noun",
      "explanation_en": "A long, raised seat or row of seats, often in a stadium or auditorium.",
      "explanation_cn": "一种长条形的、抬高的座位或成排的座位，常见于体育场或礼堂。",
      "example_en": "The crowd on the bank cheered loudly as the team scored the winning goal.",
      "example_cn": "当球队打进制胜一球时，看台上的观众大声欢呼。"
    },
    {
      "pos": "verb",
      "explanation_en": "To deposit money in a bank account for safekeeping or to earn interest.",
      "explanation_cn": "将钱存入银行账户以保存或获取利息。",
      "example_en": "She banks her monthly income to save for a house.",
      "example_cn": "她把每月的收入存入银行，为买房做准备。"
    },
    {
      "pos": "verb",
      "explanation_en": "To rely on or depend on something with confidence; to trust or count on.",
      "explanation_cn": "对某事物抱有信心地依赖或依靠；信任或指望。",
      "example_en": "You can bank on him to arrive on time—he’s never late.",
      "example_cn": "你可以放心指望他准时到达——他从不迟到。"
    },
    {
      "pos": "verb",
      "explanation_en": "To tilt or turn an aircraft or vehicle to one side, especially during a turn.",
      "explanation_cn": "使飞机或车辆向一侧倾斜，尤其在转弯时。",
      "example_en": "The pilot banked the plane sharply to the left to avoid the storm.",
      "example_cn": "飞行员急剧向左倾斜飞机以避开风暴。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "financial_institution",
      "analysis": "“Financial institution”（金融机构）是更正式、更广泛的术语，涵盖银行、信用社、证券公司等所有提供金融服务的机构。而 “bank” 是其中最常见、最核心的一种，特指以存款和贷款为主要业务的机构。"
    },
    {
      "word_to_compare": "shore",
      "analysis": "“Shore”（岸边）与 “bank” 在指水体边缘时部分重叠，但 “shore” 更常用于海洋或大型湖泊的边缘，强调陆地与水域的交界；而 “bank” 更常用于河流或较小水体，且可指水边的斜坡或堤岸，有时带有人工加固的含义。"
    },
    {
      "word_to_compare": "rely",
      "analysis": "“Rely”（依赖）与 “bank” 作动词时都表示信任或依靠，但 “rely” 更通用，适用于任何情境；而 “bank on” 是一个习语，语气更强，带有“确信无疑”的意味，常用于口语中，强调对某人或某事的坚定信心。"
    }
  ]
}