{
  "word": "banks",
  "pronunciation": "bæŋks",
  "concise_definition": "n. 银行, 河岸, 堤岸, 库存, 堆积",
  "forms": {
    "singular": "bank"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A financial institution that accepts deposits, provides loans, and offers other financial services such as currency exchange, investment, and safekeeping of assets.",
      "explanation_cn": "一种金融机构，接受存款、提供贷款，并提供其他金融服务，如货币兑换、投资和资产保管。",
      "example_en": "She opened a savings account at the local bank.",
      "example_cn": "她在当地银行开了一笔储蓄账户。"
    },
    {
      "pos": "noun",
      "explanation_en": "The land alongside or sloping down to a river or lake; the edge of a body of water.",
      "explanation_cn": "河流或湖泊旁边的陆地或斜坡；水体的边缘。",
      "example_en": "We had a picnic on the banks of the Hudson River.",
      "example_cn": "我们在哈德逊河岸野餐。"
    },
    {
      "pos": "noun",
      "explanation_en": "A long, raised mound of earth or other material, often used to hold back water or support a road or railway.",
      "explanation_cn": "由土或其他材料堆成的长条状隆起物，常用于挡水或支撑道路、铁路。",
      "example_en": "The floodwaters breached the river banks.",
      "example_cn": "洪水冲垮了河堤。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large supply or accumulation of something stored for future use, often in a metaphorical sense.",
      "explanation_cn": "大量储存或积累的某物，常用于比喻意义，指可供日后使用的资源。",
      "example_en": "The library has a vast bank of historical documents.",
      "example_cn": "图书馆藏有大量历史文献。"
    },
    {
      "pos": "noun",
      "explanation_en": "In aviation, the tilting of an aircraft sideways during a turn, or the angle of such a tilt.",
      "explanation_cn": "在航空领域，指飞机转弯时的侧倾动作，或这种侧倾的角度。",
      "example_en": "The pilot executed a sharp bank to the left to avoid the storm.",
      "example_cn": "飞行员向左急转弯以避开风暴。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "financial institution",
      "analysis": "“Financial institution”（金融机构）是更广泛的术语，包括银行、信用社、证券公司、保险公司等。而 “bank” 是其中最常见、最核心的一种，主要功能是存贷款和支付服务。因此，所有银行都是金融机构，但并非所有金融机构都是银行。"
    },
    {
      "word_to_compare": "shore",
      "analysis": "“Shore”（海岸）泛指任何水体（海洋、湖泊、河流）的边缘，语义更广，常用于海洋语境；而 “bank” 通常特指河流或湖泊的岸边，且更强调其土质结构和可被水侵蚀的特性。在河流语境中，两者可互换，但 “bank” 更具技术性。"
    },
    {
      "word_to_compare": "pile",
      "analysis": "“Pile”（堆）指随意或临时堆积的物体，如木头堆、垃圾堆，强调无序性；而 “bank” 作为堆积义时，通常指有结构、有目的的堆积，如雪堆、沙堆、数据存储库，具有组织性和功能性。"
    }
  ]
}