{
  "word": "banner",
  "pronunciation": "ban·ner",
  "concise_definition": "n. 横幅, 旗帜, 标语; v. 用横幅装饰",
  "forms": {
    "plural": "banners"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long strip of cloth, paper, or other material, typically bearing a slogan, logo, or message, used for advertising, decoration, or to express support or protest.",
      "explanation_cn": "一条长条状的布、纸或其他材料，通常印有标语、标志或信息，用于广告、装饰，或表达支持与抗议。",
      "example_en": "The activists hung a large banner reading 'Climate Action Now' from the bridge.",
      "example_cn": "活动人士在桥上悬挂了一条写着‘立即采取气候行动’的大幅横幅。"
    },
    {
      "pos": "noun",
      "explanation_en": "A symbol or emblem representing a cause, group, or movement, often used metaphorically to signify leadership or advocacy.",
      "explanation_cn": "象征某一事业、团体或运动的标志或徽章，常用于比喻意义上表示领导或倡导。",
      "example_en": "She became the banner of the women's rights movement in the 1970s.",
      "example_cn": "她在20世纪70年代成为妇女权利运动的旗帜人物。"
    },
    {
      "pos": "noun",
      "explanation_en": "In computing, a rectangular graphical display area, typically at the top of a webpage or application, used to show advertisements or navigation elements.",
      "explanation_cn": "在计算机领域，指网页或应用程序顶部的矩形图形显示区域，常用于展示广告或导航元素。",
      "example_en": "The website's top banner displayed a promotional offer for new users.",
      "example_cn": "该网站顶部的横幅广告展示了面向新用户的促销优惠。"
    },
    {
      "pos": "verb",
      "explanation_en": "To decorate or adorn with banners, especially for a celebration or public event.",
      "explanation_cn": "用横幅装饰，尤指为庆祝活动或公共事件进行装饰。",
      "example_en": "The town hall was bannered with flags and streamers for the Independence Day parade.",
      "example_cn": "为庆祝独立日游行，市政厅被挂上了旗帜和彩带。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "flag",
      "analysis": "“Flag”（旗帜）通常指国家、军队或组织的正式象征性旗帜，具有高度的象征意义和规范性，如国旗、队旗。而 “banner” 更广泛，可指任何带有文字或图案的长条装饰物，不一定具有正式权威性，常用于宣传或临时场合。"
    },
    {
      "word_to_compare": "sign",
      "analysis": "“Sign”（标志/标牌）通常指固定、小型、用于指示或传达信息的平面标识，如路牌、商店招牌。它强调功能性指引，而 “banner” 更强调视觉冲击力、宣传性和临时性，常悬挂在空中或高处。"
    },
    {
      "word_to_compare": "poster",
      "analysis": "“Poster”（海报）是贴在墙或柱上的印刷品，内容多为宣传、公告或艺术展示，通常是静态的、平面的。而 “banner” 多为悬挂式，可随风飘动，常用于户外或大型活动，更具动态感和空间覆盖性。"
    }
  ]
}