{
  "word": "bans",
  "pronunciation": "bans",
  "concise_definition": "n. 禁令, 禁止; v. 禁止, 明令禁止",
  "forms": {
    "singular": "ban",
    "third_person_singular": "bans",
    "past_tense": "banned",
    "past_participle": "banned",
    "present_participle": "banning"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An official or legal prohibition against something, typically imposed by an authority to prevent a specific action, behavior, or item from being used, sold, or practiced.",
      "explanation_cn": "指由权威机构正式或法律上颁布的禁令，旨在阻止某一特定行为、活动或物品的使用、销售或实施。",
      "example_en": "The government imposed a ban on single-use plastics to reduce environmental pollution.",
      "example_cn": "政府颁布了禁止使用一次性塑料的禁令，以减少环境污染。"
    },
    {
      "pos": "noun",
      "explanation_en": "A general or widespread prohibition or restriction, often based on social, cultural, or moral grounds, even if not legally enforced.",
      "explanation_cn": "指基于社会、文化或道德原因而普遍存在的禁止或限制，即使未被法律强制执行。",
      "example_en": "There is a social ban on discussing politics at family dinners in some cultures.",
      "example_cn": "在某些文化中，家庭聚餐时讨论政治被视为一种社会禁忌。"
    },
    {
      "pos": "verb",
      "explanation_en": "To officially or legally prohibit something, especially by a governing body or institution.",
      "explanation_cn": "指由政府机构或组织正式或依法禁止某事物。",
      "example_en": "The school banned cell phones during class to improve student focus.",
      "example_cn": "学校禁止学生在课堂上使用手机，以提高专注力。"
    },
    {
      "pos": "verb",
      "explanation_en": "To exclude or bar someone from participation, access, or membership, often as a disciplinary measure.",
      "explanation_cn": "指作为惩罚措施，禁止某人参与、进入或成为成员。",
      "example_en": "He was banned from the casino after being caught cheating.",
      "example_cn": "他在被发现作弊后被禁止进入赌场。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "prohibition",
      "analysis": "“Prohibition”（禁止）是更正式、法律化的术语，常用于政策或宪法层面的全面禁止（如禁酒令），语气更严肃、抽象。而 “ban” 更常用、更口语化，可指具体行为或物品的禁止，适用范围更广。"
    },
    {
      "word_to_compare": "forbid",
      "analysis": "“Forbid”（禁止）强调个人或权威对某行为的直接命令性阻止，常用于日常语境（如父母对孩子说“我禁止你玩手机”）。而 “ban” 更常用于制度性、群体性或官方层面的禁令，带有更强的公共性和强制性。"
    },
    {
      "word_to_compare": "outlaw",
      "analysis": "“Outlaw”（使成为非法）特指将某行为或物品从法律上定为非法，常用于严重犯罪或极端行为（如 outlaw guns）。它强调法律地位的彻底否定，而 “ban” 可以是行政命令或社会规范，不一定涉及法律变更。"
    }
  ]
}