{
  "word": "baptized",
  "pronunciation": "bap·tahyzd",
  "concise_definition": "v. 施洗, 使受洗, 使正式加入",
  "forms": {
    "base_form": "baptize",
    "past_tense": "baptized",
    "past_participle": "baptized",
    "present_participle": "baptizing",
    "third_person_singular": "baptizes"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To perform the Christian religious ceremony of baptism, typically by immersing, pouring, or sprinkling water on a person as a symbol of purification, initiation into the Christian faith, or acceptance of God's grace.",
      "explanation_cn": "举行基督教的洗礼仪式，通常通过浸水、泼水或洒水的方式，象征洁净、正式加入基督教信仰或接受上帝的恩典。",
      "example_en": "The baby was baptized in the church last Sunday.",
      "example_cn": "上周日，这个婴儿在教堂接受了洗礼。"
    },
    {
      "pos": "verb",
      "explanation_en": "To formally introduce or designate someone or something with a name or title, often in a symbolic or ceremonial way, especially in non-religious contexts.",
      "explanation_cn": "以某种名称或头衔正式命名或指定某人或某物，常带有象征性或仪式性，尤其用于非宗教语境。",
      "example_en": "The new stadium was baptized with a record-breaking concert.",
      "example_cn": "这座新体育场以一场破纪录的演唱会正式揭幕。"
    },
    {
      "pos": "verb",
      "explanation_en": "To initiate or mark the beginning of something significant, often metaphorically, as if by a ritual act of naming or consecration.",
      "explanation_cn": "象征性地开启或标记某件重要事物的开始，如同通过一种命名或祝圣的仪式。",
      "example_en": "The company was baptized in fire during its first major product launch.",
      "example_cn": "该公司在首次重大产品发布中经受了严峻考验，正式启程。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "christened",
      "analysis": "“Christened”（命名并施洗）与 “baptized” 在宗教语境中常可互换，但 “christened” 更常用于婴儿的命名仪式，且不一定包含完整的洗礼仪式；在非宗教语境中，两者都可表示“命名”，但 “christened” 更具传统和仪式感，如船只 christening。"
    },
    {
      "word_to_compare": "initiated",
      "analysis": "“Initiated”（使加入/启动）泛指使某人进入某个团体、过程或状态，不具宗教或仪式性含义。而 “baptized” 强调通过特定仪式（尤其是宗教洗礼）完成的正式接纳，带有更强的象征性和神圣性。"
    },
    {
      "word_to_compare": "consecrated",
      "analysis": "“Consecrated”（祝圣）指将人或物奉献给神圣用途，强调神圣性与永久性，常用于教堂、祭坛或神职人员。而 “baptized” 更侧重于个人的入门仪式，虽具神圣性，但不必然意味着永久奉献，且更广泛用于比喻性用法。"
    }
  ]
}