{
  "word": "bar",
  "pronunciation": "bahr",
  "concise_definition": "n. 条, 棒, 栏, 酒吧; v. 阻止, 封锁",
  "forms": {
    "plural": "bars",
    "third_person_singular": "bars",
    "past_tense": "barred",
    "past_participle": "barred",
    "present_participle": "barring"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long, rigid piece of material, such as metal, wood, or chocolate, used for support, restriction, or consumption.",
      "explanation_cn": "指由金属、木材或巧克力等材料制成的长条状物体，用于支撑、限制或食用。",
      "example_en": "She broke off a piece of the chocolate bar and offered it to me.",
      "example_cn": "她掰下一块巧克力棒递给了我。"
    },
    {
      "pos": "noun",
      "explanation_en": "A counter or establishment where alcoholic drinks are served, often with seating and social interaction.",
      "explanation_cn": "指提供酒精饮料的柜台或场所，通常设有座位并促进社交活动。",
      "example_en": "We met at a cozy bar downtown after work.",
      "example_cn": "我们下班后在市中心一家温馨的酒吧见面了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A barrier or obstruction, such as a gate, fence, or railing, designed to prevent passage or access.",
      "explanation_cn": "指用于阻止通行或进入的障碍物，如门、围栏或栏杆。",
      "example_en": "The bar across the doorway prevented anyone from entering the restricted area.",
      "example_cn": "门框上的横栏阻止了任何人进入限制区域。"
    },
    {
      "pos": "noun",
      "explanation_en": "The legal profession collectively, or the place where lawyers practice and cases are heard.",
      "explanation_cn": "指法律职业整体，或律师执业和审理案件的场所（如法庭）。",
      "example_en": "He was admitted to the bar after passing the state examination.",
      "example_cn": "他在通过州级考试后获得了律师执业资格。"
    },
    {
      "pos": "verb",
      "explanation_en": "To obstruct, prevent, or block someone or something from entering, passing, or occurring.",
      "explanation_cn": "指阻止某人或某物进入、通过或发生。",
      "example_en": "The storm barred our path to the mountain summit.",
      "example_cn": "暴风雨阻挡了我们通往山顶的路。"
    },
    {
      "pos": "verb",
      "explanation_en": "To exclude or disqualify someone from participation, especially by official rule or law.",
      "explanation_cn": "指根据规则或法律将某人排除在外或取消其资格。",
      "example_en": "He was barred from the competition for violating the rules.",
      "example_cn": "他因违反规则而被取消了参赛资格。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rod",
      "analysis": "“Rod”（杆）通常指细长、圆柱形的硬质物体，多用于工具或钓鱼竿等具体用途，强调物理形态和功能性；而 “bar” 更广泛，可指任何长条形物体，包括用于阻挡的横梁、巧克力条或酒吧，语义范围更广，且常含抽象含义（如法律界）。"
    },
    {
      "word_to_compare": "pub",
      "analysis": "“Pub”（酒馆）是英国英语中对提供酒水和社交场所的称呼，强调文化氛围和社区性；而 “bar” 更通用，可指任何类型的饮酒场所，包括高档鸡尾酒吧或机场酒吧，语义更中性、国际化，且可作动词使用，而 “pub” 不能。"
    },
    {
      "word_to_compare": "obstruct",
      "analysis": "“Obstruct”（阻碍）是更正式、更抽象的动词，强调干扰或妨碍进程，常用于法律、交通或系统语境；而 “bar” 作为动词更直接、具象，常指物理性阻挡（如门栏）或明确禁止（如禁止进入），语气更强、更果断。"
    }
  ]
}