{
  "word": "barbecue",
  "pronunciation": "bahr·buh·kju",
  "concise_definition": "n. 烧烤, 烧烤派对; v. 烧烤, 烧烤食物",
  "forms": {
    "plural": "barbecues",
    "third_person_singular": "barbecues",
    "past_tense": "barbecued",
    "past_participle": "barbecued",
    "present_participle": "barbecuing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A method of cooking food, especially meat, over an open fire or on a grill, often with the use of a smoky sauce or seasoning.",
      "explanation_cn": "一种通过明火或烤架烹制食物（尤其是肉类）的方法，通常使用烟熏酱料或调味料。",
      "example_en": "We had a barbecue in the backyard with ribs, burgers, and corn on the cob.",
      "example_cn": "我们在后院举办了一场烧烤，吃了肋排、汉堡和玉米棒。"
    },
    {
      "pos": "noun",
      "explanation_en": "An outdoor social gathering centered around cooking and eating food on a grill, often in a casual, festive atmosphere.",
      "explanation_cn": "一种以户外烤制和享用食物为中心的社交聚会，通常氛围轻松愉快。",
      "example_en": "The neighborhood barbecue was a huge success, with music, games, and plenty of food.",
      "example_cn": "社区烧烤活动非常成功，有音乐、游戏和丰盛的食物。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device or structure used for cooking food over an open flame, such as a grill or pit.",
      "explanation_cn": "用于在明火上烹制食物的设备或装置，如烤架或烤炉。",
      "example_en": "He bought a new gas barbecue for his patio this summer.",
      "example_cn": "他今年夏天为露台买了一台新的燃气烧烤炉。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cook food, especially meat, on a grill or over an open fire, often with seasoning or sauce.",
      "explanation_cn": "在烤架上或明火上烹制食物（尤其是肉类），通常使用调味料或酱汁。",
      "example_en": "They barbecued chicken and vegetables for the picnic.",
      "example_cn": "他们为野餐烤了鸡肉和蔬菜。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "grill",
      "analysis": "“Grill”（烤架）更侧重于烹饪方式本身，指在金属网格上直接加热食物，不一定涉及烟熏或酱料，也不一定包含社交聚会的含义。而 “barbecue” 不仅指烹饪方法，还常包含特定风味（如烟熏味）、慢火烹饪和社交聚会的文化内涵。"
    },
    {
      "word_to_compare": "roast",
      "analysis": "“Roast”（烘烤）通常指在烤箱中用干热缓慢烹制肉类或蔬菜，强调均匀受热和内部熟透，多用于室内烹饪。而 “barbecue” 强调外部炭火或明火的直接加热，常伴随烟熏风味，且多为户外活动。"
    },
    {
      "word_to_compare": "cookout",
      "analysis": "“Cookout”（户外聚餐）与 “barbecue” 在社交场景中常可互换，但 “cookout” 更泛指任何在户外进行的聚餐，可能包括煮、煎、烤等多种方式，不一定使用烧烤架。而 “barbecue” 更特指使用烤架和烟熏风味的烹饪方式，文化指向更明确。"
    }
  ]
}