{
  "word": "baroque",
  "pronunciation": "buh·rohk",
  "concise_definition": "adj. 巴洛克的, 华丽繁复的; n. 巴洛克风格",
  "forms": {
    "comparative": "more baroque",
    "superlative": "most baroque"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Characterized by elaborate, ornate, and highly detailed decoration, often with dramatic contrasts, curving lines, and rich textures, especially in art, architecture, and music from the 17th and early 18th centuries.",
      "explanation_cn": "以繁复、华丽、高度精细的装饰为特征，常带有戏剧性的明暗对比、弯曲的线条和丰富的质感，尤指17至18世纪初的艺术、建筑和音乐风格。",
      "example_en": "The palace features baroque ceilings with gold leaf and sculpted angels.",
      "example_cn": "这座宫殿拥有镀金和雕琢天使的巴洛克风格天花板。"
    },
    {
      "pos": "noun",
      "explanation_en": "A style of art, architecture, and music that flourished in Europe from the early 17th to the mid-18th century, marked by grandeur, emotional intensity, and intricate detail.",
      "explanation_cn": "指17世纪初至18世纪中叶在欧洲盛行的一种艺术、建筑和音乐风格，以宏伟、情感强烈和细节繁复为标志。",
      "example_en": "Baroque music, such as that of Bach and Vivaldi, is known for its complex counterpoint and ornamentation.",
      "example_cn": "巴洛克音乐，如巴赫和维瓦尔第的作品，以其复杂的复调和装饰性著称。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used figuratively to describe anything excessively complicated, convoluted, or overly ornamental, often in a negative or critical sense.",
      "explanation_cn": "比喻性地用于形容任何过度复杂、迂回曲折或装饰过分的事物，常带有贬义或批评意味。",
      "example_en": "The legal document was a baroque maze of clauses and footnotes.",
      "example_cn": "这份法律文件是一团由条款和脚注构成的巴洛克式迷宫。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rococo",
      "analysis": "“Rococo”（洛可可）是巴洛克风格的后续发展，更轻盈、精致、优雅，强调柔和的曲线、粉彩色调和装饰性的自然主题（如贝壳、卷草），常用于室内装饰和小型艺术作品。而“baroque”更强调宏伟、戏剧性和力量感，整体更厚重、庄严。"
    },
    {
      "word_to_compare": "ornate",
      "analysis": "“Ornate”（华丽的）泛指任何装饰繁复的事物，不特指某一历史时期或风格，可应用于文字、家具、服饰等。而“baroque”不仅指装饰繁复，更承载特定的历史、文化与美学体系，具有明确的时代和艺术语境。"
    },
    {
      "word_to_compare": "grandiose",
      "analysis": "“Grandiose”（宏伟的、夸大的）强调规模宏大或气势恢宏，有时带有浮夸、不切实际的贬义。而“baroque”虽也具宏伟性，但更侧重于艺术形式上的复杂性与技术性，其美学价值常被正面评价，不必然含贬义。"
    }
  ]
}