{
  "word": "barrel",
  "pronunciation": "bahr·l",
  "concise_definition": "n. 桶, 油桶, 枪管; v. 快速移动",
  "forms": {
    "plural": "barrels"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A cylindrical container, typically made of wood or metal, with flat ends and often banded with hoops, used for storing liquids such as wine, oil, or beer.",
      "explanation_cn": "一种圆柱形容器，通常由木材或金属制成，两端平坦，常以金属箍固定，用于储存液体如葡萄酒、石油或啤酒。",
      "example_en": "The winery aged its red wine in oak barrels for two years.",
      "example_cn": "这家酒庄将红酒在橡木桶中陈酿了两年。"
    },
    {
      "pos": "noun",
      "explanation_en": "The cylindrical tube through which a bullet is fired from a gun, also called the gun barrel.",
      "explanation_cn": "枪械中子弹发射所经过的圆筒形管道，也称为枪管。",
      "example_en": "The sniper adjusted the scope mounted on the barrel of his rifle.",
      "example_cn": "狙击手调整了安装在步枪枪管上的瞄准镜。"
    },
    {
      "pos": "noun",
      "explanation_en": "A unit of volume used especially for oil, equal to 42 US gallons (approximately 159 liters).",
      "explanation_cn": "一种体积单位，常用于石油计量，等于42美制加仑（约159升）。",
      "example_en": "The price of crude oil rose to $85 per barrel.",
      "example_cn": "原油价格涨至每桶85美元。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move quickly and forcefully, often in a rolling or twisting motion, as if tumbling like a barrel.",
      "explanation_cn": "以快速而有力的方式移动，常带有滚动或翻转的动作，如同桶一样翻滚。",
      "example_en": "The child barrelled down the hill on his sled.",
      "example_cn": "孩子坐着雪橇飞快地从山坡上冲了下去。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cask",
      "analysis": "“Cask”（酒桶）与 “barrel” 非常相似，常用于储存酒类，但 “cask” 是一个更广泛的术语，泛指任何用于储存液体的木制容器，形状和大小不一；而 “barrel” 有更标准的尺寸和圆柱形结构，尤其在工业和商业语境中（如石油）具有明确计量意义。"
    },
    {
      "word_to_compare": "tube",
      "analysis": "“Tube”（管子）泛指任何中空的圆柱形物体，材质多样（塑料、金属、橡胶等），用途广泛，不特指用于储存或武器。而 “barrel” 作为枪管时虽为圆筒形，但具有明确的功能性（发射子弹）和结构特征（耐高压），其语义更专业、更具体。"
    },
    {
      "word_to_compare": "drum",
      "analysis": "“Drum”（桶/鼓）通常指两端封闭、形状更接近圆柱或略鼓的容器，常用于工业运输（如化学品桶），多为金属材质，强调坚固和密封性；而 “barrel” 更传统、更常与液体储存（如酒、油）和自然材料（如橡木）关联，语义上更具文化与历史色彩。"
    }
  ]
}