{
  "word": "barricade",
  "pronunciation": "bar·i·kaid",
  "concise_definition": "n. 路障, 障碍物; v. 用路障封锁",
  "forms": {
    "plural": "barricades",
    "third_person_singular": "barricades",
    "past_tense": "barricaded",
    "past_participle": "barricaded",
    "present_participle": "barricading"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A barrier constructed to block or impede passage, typically made of heavy objects such as furniture, vehicles, or debris, often used in protests, warfare, or emergencies.",
      "explanation_cn": "指用家具、车辆或瓦砾等重物搭建的障碍物，用于阻挡或阻碍通行，常用于抗议、战争或紧急情况中。",
      "example_en": "Protesters erected a barricade of burning tires to block the police advance.",
      "example_cn": "抗议者用燃烧的轮胎搭建路障，以阻止警察前进。"
    },
    {
      "pos": "verb",
      "explanation_en": "To block or secure a passage or entrance by placing barriers across it, often to prevent access or escape.",
      "explanation_cn": "指通过在通道或入口处放置障碍物来封锁或加固，以阻止进入或逃离。",
      "example_en": "The soldiers barricaded the doorway with sandbags and metal beams.",
      "example_cn": "士兵们用沙袋和金属梁封锁了门口。"
    },
    {
      "pos": "verb",
      "explanation_en": "To isolate or confine oneself or others by creating physical barriers, often in a desperate or defensive situation.",
      "explanation_cn": "指在绝望或防御性情境中，通过建立物理屏障将自己或他人隔离或困住。",
      "example_en": "During the siege, the residents barricaded themselves inside the building.",
      "example_cn": "围城期间，居民们将自己封锁在建筑物内。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "barrier",
      "analysis": "“Barrier”（屏障）是一个更通用的词，泛指任何阻止通行的物体或结构，可以是自然的（如山脉）或人工的（如围栏），不强调临时性或防御性。而 “barricade” 特指人为快速搭建的、具有临时性和对抗性的障碍物，通常用于紧急或冲突情境。"
    },
    {
      "word_to_compare": "obstacle",
      "analysis": "“Obstacle”（障碍）侧重于任何阻碍进展的事物，可以是抽象的（如困难、障碍）或具体的，但不一定是物理性的阻挡结构。而 “barricade” 是具体的、可触摸的物理障碍，通常由人主动设置以阻止移动。"
    },
    {
      "word_to_compare": "blockade",
      "analysis": "“Blockade”（封锁）通常指由官方或军事力量实施的、针对区域或港口的长期、系统性封锁，目的是切断物资或人员流动，具有战略性和持续性。而 “barricade” 更多是局部的、临时的、由个人或群体设置的物理阻断，规模较小且更具即时性。"
    }
  ]
}