{
  "word": "base",
  "pronunciation": "beyss",
  "concise_definition": "n. 基础, 底座, 基地, 根本; v. 基于, 以…为依据",
  "forms": {
    "third_person_singular": "bases",
    "past_tense": "based",
    "past_participle": "based",
    "present_participle": "basing",
    "plural": "bases"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The bottom support or foundation of something, providing stability or structure; can refer to a physical object or an abstract principle.",
      "explanation_cn": "指某物的底部支撑或基础，提供稳定性或结构；可指具体的物体，也可指抽象的原则。",
      "example_en": "The statue rests on a marble base.",
      "example_cn": "这座雕像坐落在一块大理石底座上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A central location from which operations, activities, or organizations are coordinated or launched, often military or logistical.",
      "explanation_cn": "指用于协调、开展或发起活动（常为军事或后勤）的中心地点。",
      "example_en": "The army established a forward base near the border.",
      "example_cn": "军队在边境附近建立了一个前沿基地。"
    },
    {
      "pos": "noun",
      "explanation_en": "The fundamental principle, element, or starting point upon which something is built or depends, especially in science, mathematics, or philosophy.",
      "explanation_cn": "指某事物所建立或依赖的根本原则、要素或起点，尤其在科学、数学或哲学中。",
      "example_en": "The base of all democratic societies is the rule of law.",
      "example_cn": "所有民主社会的基础是法治。"
    },
    {
      "pos": "noun",
      "explanation_en": "In chemistry, a substance that can accept protons or donate electron pairs; in mathematics, the number system used (e.g., base 10).",
      "explanation_cn": "在化学中，指能接受质子或提供电子对的物质；在数学中，指所使用的数制（如十进制）。",
      "example_en": "Sodium hydroxide is a strong base.",
      "example_cn": "氢氧化钠是一种强碱。"
    },
    {
      "pos": "verb",
      "explanation_en": "To establish or form something on a particular foundation, reason, or source; to derive or originate from something.",
      "explanation_cn": "指以某种基础、理由或来源为依据来建立或形成某事物；源自或来源于某物。",
      "example_en": "The theory is based on decades of scientific research.",
      "example_cn": "这一理论基于数十年的科学研究。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "foundation",
      "analysis": "“Foundation”（基础）更强调支撑整体结构的深层、稳固的根基，常用于抽象概念如制度、理论或社会体系，语气更正式、更强调不可动摇性。而 “base” 更通用，既可用于物理支撑，也可用于抽象依据，语义范围更广。"
    },
    {
      "word_to_compare": "ground",
      "analysis": "“Ground”（依据/基础）常用于口语或比喻语境，如 “on the grounds that...”（基于…理由），强调理由或原因，多用于论证或法律语境。而 “base” 更强调结构性支撑，如数据基础、基地等，物理和抽象含义并重。"
    },
    {
      "word_to_compare": "root",
      "analysis": "“Root”（根源）强调事物的起源或最初来源，常用于追溯因果链，如 “the root cause”（根本原因）。它更偏向时间维度上的起点，而 “base” 更偏向空间或结构维度上的支撑点。"
    },
    {
      "word_to_compare": "bottom",
      "analysis": "“Bottom”（底部）是纯粹的物理位置描述，指物体最下端，不隐含支撑或功能意义。而 “base” 不仅指位置，还承载功能意义，如承载、稳定、启动等，具有更强的结构性和目的性。"
    }
  ]
}