{
  "word": "basque",
  "pronunciation": "bask",
  "concise_definition": "n. 巴斯克裙, 巴斯克式上衣; adj. 巴斯克的",
  "forms": {
    "plural": "basques"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A close-fitting, sleeveless garment worn around the waist, typically as part of a dress or as a decorative bodice, often with a fitted top and flared bottom, originating from the traditional clothing of the Basque people.",
      "explanation_cn": "一种紧身、无袖的腰部服饰，通常作为连衣裙的一部分或装饰性上衣，特点是上身贴合、下摆展开，源自巴斯克人的传统服饰。",
      "example_en": "She wore a lace-trimmed basque over her blouse, adding elegance to her Victorian-style outfit.",
      "example_cn": "她在外套上穿着一条镶蕾丝的巴斯克裙，为她的维多利亚风格服装增添了优雅。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of tight-fitting jacket or bodice, especially in military or formal uniforms, that extends below the waist and is often decorated with braid or embroidery.",
      "explanation_cn": "一种紧身夹克或上衣，尤其见于军装或正式制服中，长度延伸至腰部以下，常饰以编织带或刺绣。",
      "example_en": "The officer's uniform included a richly embroidered basque that accentuated his broad shoulders.",
      "example_cn": "这位军官的制服包括一件精美的刺绣巴斯克上衣，突显了他宽阔的肩膀。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to the Basque people, their language, or their culture, native to the region spanning parts of northern Spain and southwestern France.",
      "explanation_cn": "与巴斯克人、他们的语言或文化相关的，源自横跨西班牙北部和法国西南部的地区。",
      "example_en": "The museum features an exhibit on Basque music and traditional dance.",
      "example_cn": "博物馆展出了一项关于巴斯克音乐和传统舞蹈的专题展览。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "corset",
      "analysis": "“Corset”（紧身胸衣）主要用于塑形身体，强调收腰和支撑，常由硬质材料制成，具有功能性目的；而 “basque” 虽然也贴身，但更侧重于装饰性和服装结构的一部分，不一定有强力塑形功能，常作为外层服饰出现。"
    },
    {
      "word_to_compare": "waistcoat",
      "analysis": "“Waistcoat”（背心）是覆盖上身但不延伸至臀部的服装，通常有纽扣和口袋，多用于正式男装；而 “basque” 通常更长，延伸至臀部或以上，常为女性服饰的一部分，且装饰性更强，结构更接近连体式设计。"
    },
    {
      "word_to_compare": "regional",
      "analysis": "“Regional”（区域的）是一个泛指地理或文化区域的形容词，而 “Basque” 是专有名词形容词，特指巴斯克地区及其文化，具有明确的民族和语言内涵，不可与其他地区形容词互换。"
    }
  ]
}