{
  "word": "bathurst",
  "pronunciation": "bath·urst",
  "concise_definition": "n. 巴瑟斯特（地名/人名）",
  "forms": {
    "plural": "Bathursts"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A city in New South Wales, Australia, known for its historic architecture, gold rush heritage, and the annual Bathurst 1000 motor racing event.",
      "explanation_cn": "澳大利亚新南威尔士州的一座城市，以其历史建筑、淘金热遗产以及每年举办的巴瑟斯特1000汽车耐力赛而闻名。",
      "example_en": "Thousands of motorsport fans gather in Bathurst each year to watch the Bathurst 1000 race.",
      "example_cn": "每年都有成千上万的赛车迷前往巴瑟斯特观看巴瑟斯特1000赛事。"
    },
    {
      "pos": "noun",
      "explanation_en": "A surname of British origin, notably borne by Charles Bathurst, 1st Viscount Bledisloe, a British colonial administrator, and other notable figures in history.",
      "explanation_cn": "一个源自英国的姓氏，历史上著名人物包括第一代布莱德斯洛子爵查尔斯·巴瑟斯特，一位英国殖民地官员。",
      "example_en": "The Bathurst family has contributed significantly to British public service over several generations.",
      "example_cn": "巴瑟斯特家族在数代人中为英国公共服务做出了重要贡献。"
    },
    {
      "pos": "noun",
      "explanation_en": "A race track located in Bathurst, Australia, officially known as Mount Panorama Circuit, one of the most famous and challenging motorsport venues in the world.",
      "explanation_cn": "位于澳大利亚巴瑟斯特的一条赛道，正式名称为蒙特·帕纳马赛道，是全球最著名且最具挑战性的赛车场地之一。",
      "example_en": "Drivers consider the Mount Panorama Circuit in Bathurst the ultimate test of skill and endurance.",
      "example_cn": "车手们认为位于巴瑟斯特的蒙特·帕纳马赛道是对技术和耐力的终极考验。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "Canberra",
      "analysis": "“Canberra”（堪培拉）是澳大利亚的首都，作为政治和行政中心，具有国家象征意义；而 “Bathurst” 是一个地方性城市，以历史和赛车文化著称，不具备国家中心地位，但具有鲜明的地域特色。"
    },
    {
      "word_to_compare": "Melbourne",
      "analysis": "“Melbourne”（墨尔本）是澳大利亚第二大城市，以多元文化、艺术和大型体育赛事（如澳大利亚公开赛）闻名；而 “Bathurst” 规模较小，其国际知名度主要源于单一赛事——巴瑟斯特1000，更具专业性和主题性。"
    },
    {
      "word_to_compare": "Bristol",
      "analysis": "“Bristol”（布里斯托）是英国的一个城市，以航海历史和工业遗产著称；而 “Bathurst” 虽同为地名，但其文化标识更集中于赛车运动，且位于南半球，地理与文化背景差异显著。"
    }
  ]
}