{
  "word": "bats",
  "pronunciation": "bats",
  "concise_definition": "n. 球棒, 蝙蝠; v. 击球, 眨眼",
  "forms": {
    "singular": "bat"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A piece of equipment used in sports such as baseball or cricket, typically made of wood or metal, to hit the ball.",
      "explanation_cn": "用于棒球或板球等运动的器具，通常由木材或金属制成，用于击打球。",
      "example_en": "He swung the bat with all his strength and hit a home run.",
      "example_cn": "他用尽全力挥动球棒，打出了一记本垒打。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, nocturnal mammal with wings made of skin stretched between elongated fingers, capable of flight and often associated with caves or darkness.",
      "explanation_cn": "一种小型夜行性哺乳动物，其翅膀由伸展在延长指骨间的皮肤构成，能够飞行，常与洞穴或黑暗环境相关联。",
      "example_en": "Bats are important pollinators in many tropical ecosystems.",
      "example_cn": "蝙蝠在许多热带生态系统中是重要的传粉者。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hit a ball with a bat, especially in the context of baseball or similar sports.",
      "explanation_cn": "用球棒击球，尤指在棒球或类似运动中的动作。",
      "example_en": "The rookie batted .300 in his first season.",
      "example_cn": "这位新秀在第一个赛季的打击率达到了0.300。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move the eyelids rapidly or intermittently, often to signal or to avoid staring.",
      "explanation_cn": "快速或间歇性地眨动眼皮，常用于示意或避免直视。",
      "example_en": "She batted her eyes innocently to get his attention.",
      "example_cn": "她无辜地眨着眼睛，想引起他的注意。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "club",
      "analysis": "“Club”（球棒/棍棒）泛指任何用于击打的粗重棍状物，常用于高尔夫或古代武器语境，语义更宽泛；而 “bat” 特指用于棒球、板球等运动的扁平或圆柱形击球工具，具有明确的运动规范和形状特征。"
    },
    {
      "word_to_compare": "flyer",
      "analysis": "“Flyer”（飞行者）泛指任何能飞的生物或物体，如鸟类或无人机；而 “bat” 是唯一真正能主动飞行的哺乳动物，具有独特的翼膜结构和夜间活动习性，生物学上具有特殊分类地位。"
    },
    {
      "word_to_compare": "wink",
      "analysis": "“Wink”（眨眼）是 “bat” 作为动词时的近义词，但 “wink” 通常特指有意识地单眼闭合以传递信号（如暗示或调情），而 “bat” 的眨眼动作更偏向无意识或频繁的眨眼行为，语义更中性、更广泛。"
    }
  ]
}