{
  "word": "bay",
  "pronunciation": "bā",
  "concise_definition": "n. 海湾, 车库, 箱柜, 呻吟声; v. 吠叫, 呻吟",
  "forms": {
    "plural": "bays"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A body of water partially enclosed by land, typically smaller than a gulf and larger than a cove, formed by the indentation of a coastline.",
      "explanation_cn": "指被陆地部分环绕的水域，通常比海湾小、比小海湾大，由海岸线向内凹陷形成。",
      "example_en": "San Francisco Bay is famous for its bridge and diverse marine life.",
      "example_cn": "旧金山湾以其大桥和多样的海洋生物而闻名。"
    },
    {
      "pos": "noun",
      "explanation_en": "A recessed area in a building, such as a garage for a car, a window alcove, or a storage compartment in a cabinet or ship.",
      "explanation_cn": "指建筑物中的凹陷区域，如汽车车库、窗间凹室或柜子或船上的储物隔间。",
      "example_en": "The car was parked in the two-car bay behind the house.",
      "example_cn": "汽车停在房子后方的双车位车库中。"
    },
    {
      "pos": "noun",
      "explanation_en": "A deep, prolonged sound made by certain animals, especially dogs, often expressing excitement, warning, or distress.",
      "explanation_cn": "指某些动物（尤其是狗）发出的深沉、持续的叫声，常表达兴奋、警告或痛苦。",
      "example_en": "The hound bayed loudly at the full moon.",
      "example_cn": "那只猎犬对着满月大声吠叫。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a deep, prolonged sound, especially as a dog does when howling or calling out.",
      "explanation_cn": "发出深沉而持续的声音，尤指狗在嚎叫或呼喊时的声音。",
      "example_en": "The dogs bayed all night, disturbing the neighbors.",
      "example_cn": "那些狗整晚吠叫，吵得邻居不得安宁。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "gulf",
      "analysis": "“Gulf”（海湾）比 “bay” 更大、更深，通常指海洋深入陆地的广阔水域，如墨西哥湾。而 “bay” 规模较小，更常用于描述局部海岸地形，且更易被陆地部分包围。"
    },
    {
      "word_to_compare": "cove",
      "analysis": "“Cove”（小海湾）是比 “bay” 更小、更封闭的水域，通常呈圆形或椭圆形，被岩石或悬崖环绕。它强调隐蔽性和宁静感，而 “bay” 更开放，常用于航海或地理命名。"
    },
    {
      "word_to_compare": "howl",
      "analysis": "“Howl”（嚎叫）通常用于描述狼、狗或人发出的长而哀伤的尖锐叫声，带有强烈的情感色彩（如孤独、悲痛）；而 “bay” 更强调持续、低沉、有节奏的吠叫，常用于猎犬追踪猎物时的叫声，语气更具体、更动物行为导向。"
    }
  ]
}