{
  "word": "bayer",
  "pronunciation": "bā·ər",
  "concise_definition": "n. 拜耳（姓氏/公司名）",
  "forms": {
    "plural": "Bayers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A surname of German origin, notably associated with Friedrich Bayer, the founder of the German chemical and pharmaceutical company Bayer AG.",
      "explanation_cn": "一个德语姓氏，尤指化学与制药公司拜耳（Bayer AG）的创始人弗里德里希·拜耳。",
      "example_en": "Friedrich Bayer founded the company that would become one of the world's largest pharmaceutical firms.",
      "example_cn": "弗里德里希·拜耳创立了后来成为全球最大制药公司之一的企业。"
    },
    {
      "pos": "noun",
      "explanation_en": "Refers to Bayer AG, a multinational German pharmaceutical and life sciences company known for products such as aspirin and Crop Science technologies.",
      "explanation_cn": "指德国跨国制药与生命科学公司拜耳股份公司，以阿司匹林和作物科学产品等闻名。",
      "example_en": "Bayer acquired Monsanto in 2018 to expand its agricultural division.",
      "example_cn": "拜耳于2018年收购了孟山都，以扩展其农业部门。"
    },
    {
      "pos": "noun",
      "explanation_en": "In photography and digital imaging, refers to the Bayer filter, a color filter array placed over image sensor pixels to capture color information.",
      "explanation_cn": "在摄影与数字成像中，指拜耳滤镜——一种覆盖在图像传感器像素上的彩色滤波阵列，用于捕捉颜色信息。",
      "example_en": "Most digital cameras use a Bayer filter pattern to reconstruct full-color images from monochrome sensor data.",
      "example_cn": "大多数数码相机使用拜耳滤镜模式，从单色传感器数据中重建全彩图像。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "Bayer filter",
      "analysis": "“Bayer filter” 是一个专有名词技术术语，特指由拜耳公司发明的彩色滤波阵列，是“Bayer”作为人名在技术领域的延伸应用。它不是“Bayer”作为姓氏或公司的直接同义词，而是其技术成果的代称。"
    },
    {
      "word_to_compare": "Monsanto",
      "analysis": "“Monsanto” 是另一家农业生物技术公司，曾被拜耳收购。两者都是企业名称，但“Monsanto”是独立实体，而“Bayer”是收购方和品牌持有者。它们是商业竞争与并购关系，而非语义近义词。"
    },
    {
      "word_to_compare": "pharmaceutical",
      "analysis": "“Pharmaceutical” 是形容词或名词，泛指制药行业或药品，而 “Bayer” 是具体公司名称。前者是类别，后者是实例，二者属于上下位关系，而非近义词。"
    }
  ]
}