{
  "word": "bays",
  "pronunciation": "bāz",
  "concise_definition": "n. 海湾, 车库, 开间, （动物的）圈栏",
  "forms": {
    "singular": "bay"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A body of water partially enclosed by land, typically smaller than a gulf but larger than a cove, often forming a natural harbor.",
      "explanation_cn": "指被陆地部分环绕的水域，通常比海湾小但比小海湾大，常形成天然港口。",
      "example_en": "San Francisco Bay is famous for its scenic beauty and the Golden Gate Bridge.",
      "example_cn": "旧金山湾以其美丽的风景和金门大桥而闻名。"
    },
    {
      "pos": "noun",
      "explanation_en": "A recessed area in a building, such as a garage for a car, a windowed section of a room, or a compartment in a stable or warehouse.",
      "explanation_cn": "指建筑物中的凹入区域，如汽车车库、房间的窗间凹室，或马厩、仓库中的隔间。",
      "example_en": "The house has a two-car bay attached to the side for parking.",
      "example_cn": "这所房子侧面有一个可停两辆车的车库。"
    },
    {
      "pos": "noun",
      "explanation_en": "In architecture, a division or section of a building defined by vertical elements such as columns or piers, often used to describe the layout of a nave or aisle.",
      "explanation_cn": "在建筑学中，指由柱子或墩柱等垂直构件所划分的建筑部分，常用于描述中殿或侧廊的布局。",
      "example_en": "The cathedral has seven bays along its central nave.",
      "example_cn": "这座大教堂的中殿共有七个开间。"
    },
    {
      "pos": "noun",
      "explanation_en": "A confined area in a farm or stable where a single animal, especially a horse, is kept.",
      "explanation_cn": "指农场或马厩中用于单独饲养一头动物（尤其是马）的围栏或隔间。",
      "example_en": "The horse was resting peacefully in its bay, with fresh hay and water.",
      "example_cn": "这匹马正安静地待在它的圈栏里，旁边有新鲜的干草和水。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "gulf",
      "analysis": "“Gulf”（海湾）通常比 “bay” 更大、更深，且更深入陆地，常用于描述大型水体，如波斯湾或墨西哥湾。而 “bay” 更小、更开放，常用于描述港口或海岸线的凹入部分。"
    },
    {
      "word_to_compare": "cove",
      "analysis": "“Cove”（小海湾）比 “bay” 更小、更封闭，通常呈圆形或椭圆形，被岩石或高地环绕，多用于形容宁静的海滨小港。而 “bay” 的开口更宽，水域更开阔。"
    },
    {
      "word_to_compare": "niche",
      "analysis": "“Niche”（壁龛/凹处）指墙壁或结构中的小型凹陷，常用于摆放装饰品或雕像，尺寸远小于 “bay”。而 “bay” 可指较大的功能性空间，如车库或建筑开间，具有实际用途而非仅装饰性。"
    },
    {
      "word_to_compare": "compartment",
      "analysis": "“Compartment”（隔间）泛指任何被分隔的独立空间，可用于火车、箱子或仓库，强调功能分区；而 “bay” 在建筑或马厩语境中特指由结构元素（如柱子或墙壁）界定的纵向空间，具有空间连续性和结构性特征。"
    }
  ]
}