{
  "word": "be",
  "pronunciation": "bee",
  "concise_definition": "v. 是, 存在, 成为",
  "forms": {
    "third_person_singular": "is",
    "past_tense": "was",
    "past_participle": "been",
    "present_participle": "being"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To exist or have reality; to occupy a state of being or presence in time and space.",
      "explanation_cn": "指存在或具有现实性；在时间和空间中占据一种存在状态。",
      "example_en": "The stars are visible in the night sky because they are far away but still exist.",
      "example_cn": "星星在夜空中可见，因为它们虽然遥远，但依然存在。"
    },
    {
      "pos": "verb",
      "explanation_en": "To serve as a linking verb that connects the subject of a sentence to a subject complement, describing identity, quality, state, or condition.",
      "explanation_cn": "用作系动词，连接主语与主语补语，以描述身份、性质、状态或状况。",
      "example_en": "She is a talented musician and always remains humble.",
      "example_cn": "她是一位有才华的音乐家，并且始终谦逊。"
    },
    {
      "pos": "verb",
      "explanation_en": "To become or turn into something different, often indicating a change in state, role, or identity.",
      "explanation_cn": "指变成或转变为某种不同的事物，常表示状态、角色或身份的变化。",
      "example_en": "He was a teacher, but he became a writer after years of writing in his spare time.",
      "example_cn": "他曾是一名教师，但在多年利用业余时间写作后，他成了一名作家。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be located or situated in a particular place or context.",
      "explanation_cn": "指位于或处于某个特定地点或语境中。",
      "example_en": "The keys are be on the kitchen counter.",
      "example_cn": "钥匙在厨房的台面上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To exist in a specified condition or manner, often used in infinitive or imperative constructions to express obligation, necessity, or possibility.",
      "explanation_cn": "以某种特定状态或方式存在，常用于不定式或祈使结构中表达义务、必要性或可能性。",
      "example_en": "You be quiet during the exam.",
      "example_cn": "考试时你要安静。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "exist",
      "analysis": "“Exist” (存在) 仅强调客观实体或现象的现实性，不涉及性质、身份或状态的描述。它更偏向哲学或科学语境，如‘恐龙已不存在’。而 ‘be’ 用途更广，既可表示存在，也可用于描述属性、身份或状态，是语言中最基础的系动词。"
    },
    {
      "word_to_compare": "become",
      "analysis": "“Become” (成为) 专指从一种状态或身份转变为另一种，强调变化的过程和结果。而 ‘be’ 是静态的，仅描述当前状态，不包含转变含义。例如：She is a doctor（她是医生）vs. She became a doctor（她成为了一名医生）。"
    },
    {
      "word_to_compare": "remain",
      "analysis": "“Remain” (保持) 强调持续处于某种状态，隐含‘未改变’的意味，常用于对比变化。而 ‘be’ 是中性描述，不隐含持续性或稳定性。例如：He remains calm（他保持冷静）vs. He is calm（他冷静）。前者强调持续，后者仅陈述当前状态。"
    }
  ]
}