{
  "word": "beam",
  "pronunciation": "beem",
  "concise_definition": "n. 横梁, 光束, 微笑; v. 发光, 照射, 微笑",
  "forms": {
    "third_person_singular": "beams",
    "past_tense": "beamed",
    "past_participle": "beamed",
    "present_participle": "beaming"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long, sturdy piece of wood, metal, or concrete used as a horizontal support in construction, especially in buildings or bridges.",
      "explanation_cn": "指用于建筑或桥梁中的长而坚固的木料、金属或混凝土构件，用作水平支撑结构。",
      "example_en": "The ceiling was supported by massive steel beams.",
      "example_cn": "天花板由巨大的钢梁支撑。"
    },
    {
      "pos": "noun",
      "explanation_en": "A narrow stream of light or radiation, such as sunlight or a laser, traveling in a straight line.",
      "explanation_cn": "指沿直线传播的狭窄光束或辐射流，如阳光或激光。",
      "example_en": "A beam of sunlight pierced through the clouds.",
      "example_cn": "一束阳光穿透了云层。"
    },
    {
      "pos": "noun",
      "explanation_en": "A broad, radiant smile on someone's face, often expressing happiness or satisfaction.",
      "explanation_cn": "指某人脸上洋溢的灿烂笑容，通常表达喜悦或满足。",
      "example_en": "She walked into the room with a wide beam on her face.",
      "example_cn": "她满脸笑容地走进了房间。"
    },
    {
      "pos": "verb",
      "explanation_en": "To emit or send out a steady stream of light, radio waves, or other signals.",
      "explanation_cn": "指持续发出光、无线电波或其他信号。",
      "example_en": "The satellite beams television signals to millions of homes.",
      "example_cn": "这颗卫星向数百万家庭传输电视信号。"
    },
    {
      "pos": "verb",
      "explanation_en": "To smile broadly, often with joy or pride.",
      "explanation_cn": "指露出灿烂的笑容，通常因喜悦或自豪。",
      "example_en": "He beamed with pride when his son won the award.",
      "example_cn": "当儿子获奖时，他自豪地笑了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "girder",
      "analysis": "“Girder”（主梁）是工程术语，特指大型结构中承受主要荷载的钢梁或混凝土梁，比 “beam” 更专业、更强调承重功能。而 “beam” 是通用词，可指任何尺寸的水平支撑构件，包括小型木梁。"
    },
    {
      "word_to_compare": "ray",
      "analysis": "“Ray”（光线）通常指从光源发出的单条光线，更抽象、更物理化，常用于科学语境（如X射线）。而 “beam” 强调一束集中、有方向性的光，更常用于日常或视觉化描述，如阳光束或激光束。"
    },
    {
      "word_to_compare": "smile",
      "analysis": "“Smile” 是通用动词和名词，泛指任何程度的笑容。而 “beam” 作为动词或名词时，特指那种发自内心的、灿烂的、几乎发光般的笑容，情感强度更高，更具画面感。"
    }
  ]
}