{
  "word": "beams",
  "pronunciation": "beemz",
  "concise_definition": "n. 横梁, 光束, 微笑; v. 照耀, 微笑, 发送",
  "forms": {
    "singular": "beam",
    "third_person_singular": "beams",
    "past_tense": "beamed",
    "past_participle": "beamed",
    "present_participle": "beaming"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long, sturdy piece of wood, steel, or concrete used as a horizontal support in construction, especially in buildings and bridges.",
      "explanation_cn": "指用于建筑或桥梁中作为水平支撑的长而坚固的木料、钢材或混凝土构件。",
      "example_en": "The ceiling was supported by massive wooden beams.",
      "example_cn": "天花板由巨大的木梁支撑。"
    },
    {
      "pos": "noun",
      "explanation_en": "A narrow stream of light or radiation, such as sunlight or a laser, traveling in a straight line.",
      "explanation_cn": "指沿直线传播的狭窄光束或辐射流，如阳光或激光。",
      "example_en": "A single beam of sunlight pierced through the clouds.",
      "example_cn": "一束阳光穿透云层照射下来。"
    },
    {
      "pos": "noun",
      "explanation_en": "A broad, radiant smile, often expressing happiness, pride, or affection.",
      "explanation_cn": "指洋溢着幸福、自豪或爱意的灿烂笑容。",
      "example_en": "She greeted them with a warm beam that lit up her whole face.",
      "example_cn": "她带着温暖的笑容迎接他们，整张脸都亮了起来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To emit or send out a steady stream of light, radio waves, or other signals.",
      "explanation_cn": "指持续发出光、无线电波或其他信号。",
      "example_en": "The satellite beams television signals to millions of homes.",
      "example_cn": "这颗卫星向数百万家庭发送电视信号。"
    },
    {
      "pos": "verb",
      "explanation_en": "To smile broadly, especially with joy or satisfaction.",
      "explanation_cn": "指露出灿烂的笑容，通常表达喜悦或满足。",
      "example_en": "He beamed with pride as his daughter accepted the award.",
      "example_cn": "当女儿领奖时，他自豪地笑了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "girder",
      "analysis": "“Girder”（钢梁）是工程术语，特指大型结构中承受重载的金属梁，通常用于桥梁或高层建筑。它比 “beam” 更专业、更具体，而 “beam” 是通用词，可指任何类型的支撑横梁，包括木梁或混凝土梁。"
    },
    {
      "word_to_compare": "ray",
      "analysis": "“Ray”（光线）指单条、细小的光束，常用于科学或诗意语境，如“阳光射线”；而 “beam” 更强调光的集中、连续和可见的柱状形态，常用于描述更宽、更强的光束，如探照灯或激光束。"
    },
    {
      "word_to_compare": "smile",
      "analysis": "“Smile” 是泛指任何形式的笑容，可以是轻微的、礼貌的或隐藏情绪的；而 “beam” 特指那种发自内心的、灿烂夺目的笑容，带有强烈的情感色彩，是 “smile” 的一种强烈表现形式。"
    }
  ]
}