{
  "word": "bearer",
  "pronunciation": "behr·er",
  "concise_definition": "n. 持有人, 携带者, 支票持有人",
  "forms": {
    "plural": "bearers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person or entity that carries, holds, or supports something physically or metaphorically, such as a burden, a message, or a title.",
      "explanation_cn": "指物理上或隐喻上携带、持有或支撑某物的人或实体，如负担、信息或头衔。",
      "example_en": "The bearer of bad news often faces resentment, even if they are not responsible for the outcome.",
      "example_cn": "即使与结果无关，传递坏消息的人也常常招致怨恨。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who holds a negotiable instrument, such as a check or bond, and is entitled to payment simply by possessing it, without needing to be named.",
      "explanation_cn": "指持有可转让票据（如支票或债券）并仅凭持有即可获得付款的人，无需在票据上注明姓名。",
      "example_en": "This bond is payable to the bearer, meaning anyone who presents it can claim the funds.",
      "example_cn": "这张债券是无记名的，任何持有者出示即可领取款项。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who carries or supports something in a ceremonial or functional role, such as a coffin at a funeral or a flag at a parade.",
      "explanation_cn": "指在仪式或职能角色中携带或支撑某物的人，如葬礼中的抬棺者或游行中的举旗手。",
      "example_en": "The four military officers acted as bearers of the national flag during the memorial ceremony.",
      "example_cn": "在纪念仪式上，四位军官担任国旗的抬旗手。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "carrier",
      "analysis": "“Carrier” (运输者/携带者) 通常指运输或传递物品、信息或病原体的媒介，强调物理或生物层面的运输功能，如快递公司、蚊子（疾病载体）。而 “bearer” 更侧重于‘持有’或‘承担’的状态，尤其在法律、仪式或抽象责任语境中更常见。"
    },
    {
      "word_to_compare": "holder",
      "analysis": "“Holder” (持有者) 是一个更通用的词，泛指任何拥有或持有某物的人，如钥匙持有者、股东持有者。它不必然涉及‘携带’的动作，也不特指无记名票据。而 “bearer” 在金融语境中具有特定法律含义，专指‘凭持有即可主张权利’的票据持有人。"
    },
    {
      "word_to_compare": "porter",
      "analysis": "“Porter” (搬运工) 指职业性地搬运重物的人，如火车站的行李员，强调体力劳动和职业角色。而 “bearer” 可以是临时的、象征性的或仪式性的角色，不一定涉及体力劳动，如‘信念的承载者’。"
    }
  ]
}