{
  "word": "bearing",
  "pronunciation": "bair·ning",
  "concise_definition": "n. 轴承, 姿态, 关系, 影响",
  "forms": {
    "plural": "bearings"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A mechanical device that reduces friction between moving parts, typically allowing rotational or linear movement, such as in wheels, engines, or machinery.",
      "explanation_cn": "一种机械装置，用于减少运动部件之间的摩擦，通常允许旋转或直线运动，如车轮、发动机或机械中的部件。",
      "example_en": "The worn-out bearings in the car's axle caused a loud grinding noise.",
      "example_cn": "汽车车轴上磨损的轴承发出刺耳的摩擦声。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person's manner or demeanor, especially as it reflects their attitude, confidence, or social status; often used to describe poise or deportment.",
      "explanation_cn": "指一个人的举止或态度，尤其体现其自信、气质或社会地位；常用于描述端庄或仪态。",
      "example_en": "She carried herself with the bearing of a queen, even in casual clothes.",
      "example_cn": "即使穿着便装，她的一举一动仍透着女王般的气度。"
    },
    {
      "pos": "noun",
      "explanation_en": "The direction or angle at which something is positioned or observed, especially in navigation or surveying; often expressed in degrees from north.",
      "explanation_cn": "指某物的位置或观测方向，尤其在导航或测量中使用；通常以从正北方向起算的度数表示。",
      "example_en": "The ship's bearing was 270 degrees, heading directly west.",
      "example_cn": "船的方位角为270度，正朝西航行。"
    },
    {
      "pos": "noun",
      "explanation_en": "The influence or relevance of something on a situation, outcome, or decision; often used in the phrase 'have a bearing on'.",
      "explanation_cn": "指某事物对某种情况、结果或决策所产生的影响或相关性；常用于短语 'have a bearing on'（对……有影响）。",
      "example_en": "His past experience has a direct bearing on his ability to lead the team.",
      "example_cn": "他过去的经验直接影响着他领导团队的能力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bearing",
      "analysis": "在机械语境中，'bearing'（轴承）特指减少摩擦的精密部件，与 'bearing' 作为‘姿态’或‘影响’的抽象含义完全不同。需注意语境区分。"
    },
    {
      "word_to_compare": "posture",
      "analysis": "“Posture”（姿势）主要指身体的物理姿态，如坐姿或站姿，偏重于生理结构；而 “bearing” 更强调由内在气质或社会身份所体现的总体仪态，更具心理与文化内涵。"
    },
    {
      "word_to_compare": "direction",
      "analysis": "“Direction”（方向）泛指任何空间指向，语义较宽泛；而 “bearing” 在导航中是专业术语，特指以正北为基准的精确角度，具有量化和标准化的特性。"
    },
    {
      "word_to_compare": "relevance",
      "analysis": "“Relevance”（相关性）是抽象概念，仅指事物是否与主题有关；而 “bearing” 在表示‘影响’时，不仅指相关，更强调实际作用或后果，语义更强、更具体。"
    }
  ]
}