{
  "word": "bear",
  "pronunciation": "bair",
  "concise_definition": "v. 承受, 忍受, 携带, 生育; n. 熊, 投机者",
  "forms": {
    "third_person_singular": "bears",
    "past_tense": "bore",
    "past_participle": "borne/born",
    "present_participle": "bearing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To carry or support a weight, burden, or responsibility, often with endurance or difficulty.",
      "explanation_cn": "指承受或支撑重量、负担或责任，通常带有忍耐或艰难的意味。",
      "example_en": "She bore the financial burden of raising three children alone.",
      "example_cn": "她独自承担了抚养三个孩子的经济重担。"
    },
    {
      "pos": "verb",
      "explanation_en": "To endure or tolerate something unpleasant, painful, or difficult without complaint.",
      "explanation_cn": "指忍耐或容忍不愉快、痛苦或困难的事情而不抱怨。",
      "example_en": "I can't bear the noise from the construction site anymore.",
      "example_cn": "我再也无法忍受建筑工地的噪音了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give birth to offspring; to produce young.",
      "explanation_cn": "指生育后代；产生子嗣。",
      "example_en": "She bore two children before the age of twenty-five.",
      "example_cn": "她在二十五岁之前生了两个孩子。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hold, carry, or support something physically, such as a weapon, sign, or expression.",
      "explanation_cn": "指物理上持有、携带或支撑某物，如武器、标志或表情。",
      "example_en": "The soldier bore a rifle slung over his shoulder.",
      "example_cn": "士兵肩上扛着一支步枪。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large, heavy mammal with thick fur and a short tail, known for its strength and hibernation habits.",
      "explanation_cn": "一种体型庞大、毛发浓密、尾巴短小的哺乳动物，以力量和冬眠习性著称。",
      "example_en": "A grizzly bear was spotted near the hiking trail.",
      "example_cn": "有人在徒步小径附近发现了一只灰熊。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who sells stocks or other assets in the hope that prices will fall, thus allowing them to buy back at a lower price and profit from the difference.",
      "explanation_cn": "指预期价格下跌而卖出股票或其他资产，以便以更低价格买回并从中获利的投机者。",
      "example_en": "The market was dominated by bears who believed the economy was heading for a recession.",
      "example_cn": "市场被看跌者主导，他们认为经济即将陷入衰退。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "carry",
      "analysis": "“Carry” (携带) 强调物理上的运输或移动，通常不包含承受压力或负担的含义。例如，携带行李。而 “bear” 更强调承受的沉重性或持久性，常用于抽象负担（如责任、痛苦）或长期支撑的情境。"
    },
    {
      "word_to_compare": "endure",
      "analysis": "“Endure” (忍受) 与 “bear” 在‘忍耐痛苦’的语义上高度重叠，但 “endure” 更正式、更强调持久性和坚韧，常用于书面语或文学语境；而 “bear” 更口语化，语气更直接，有时带有情绪上的不耐烦。"
    },
    {
      "word_to_compare": "give birth",
      "analysis": "“Give birth” 是 “bear” 在生育义项上的同义短语，但 “give birth” 更中性、更常用在现代口语和医疗语境中；而 “bear” 更具文学性或正式性，常用于书面语或诗歌中，且可引申为‘孕育’抽象事物（如思想、成果）。"
    },
    {
      "word_to_compare": "bull",
      "analysis": "“Bull” (看涨者) 是金融术语中与 “bear” (看跌者) 相对的概念，两者共同构成市场情绪的两极。Bull 期望价格上涨并买入，Bear 期望价格下跌并卖出。它们虽同为金融术语，但语义完全相反，常用于对比分析。"
    }
  ]
}