{
  "word": "beard",
  "pronunciation": "beerd",
  "concise_definition": "n. 胡须, 络腮胡; v. 留胡须, 用胡须遮掩",
  "forms": {
    "plural": "beards"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The hair that grows on the chin, cheeks, and neck of a man, often grown for aesthetic, cultural, or practical reasons.",
      "explanation_cn": "男性在下巴、面颊和颈部生长的毛发，通常出于审美、文化或实用原因而留蓄。",
      "example_en": "He trimmed his beard carefully every morning before work.",
      "example_cn": "他每天上班前都会仔细修剪胡须。"
    },
    {
      "pos": "noun",
      "explanation_en": "A deceptive or misleading appearance, especially one used to conceal true intentions or identity; often used in the phrase 'a beard' to refer to a person used as a cover for a romantic relationship.",
      "explanation_cn": "一种欺骗性或误导性的外表，常用于掩饰真实意图或身份；在短语 'a beard' 中特指为掩盖真实恋情而假装的伴侣。",
      "example_en": "In the 1950s, some gay men used women as beards to avoid suspicion.",
      "example_cn": "在20世纪50年代，一些同性恋男性会找女性作为掩护，以避免引起怀疑。"
    },
    {
      "pos": "verb",
      "explanation_en": "To grow or maintain a beard on one's face.",
      "explanation_cn": "在脸上留蓄胡须。",
      "example_en": "He decided to beard for the winter to stay warmer.",
      "example_cn": "他决定留胡须过冬，以保持更暖和。"
    },
    {
      "pos": "verb",
      "explanation_en": "To confront or challenge someone boldly, especially by appearing unexpectedly or directly.",
      "explanation_cn": "大胆地面对或挑战某人，尤指突然或直接地出现以施加压力。",
      "example_en": "The journalist beard the CEO during the press conference.",
      "example_cn": "记者在新闻发布会上直接质问了首席执行官。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "facial_hair",
      "analysis": "“Facial hair”（面部毛发）是一个更宽泛的术语，泛指脸上任何类型的毛发，包括胡须、鬓角、眉毛等。而 “beard” 特指下巴、面颊和颈部的浓密毛发，范围更具体。"
    },
    {
      "word_to_compare": "moustache",
      "analysis": "“Moustache”（八字胡）仅指上唇上方的毛发，是面部毛发的一部分，而 “beard” 指的是下巴和脸颊区域的毛发。两者常同时存在，但概念上独立。"
    },
    {
      "word_to_compare": "cover",
      "analysis": "“Cover”（掩护）是一个通用词，指任何用于隐藏真实情况的事物或人。而 “beard” 作为动词或名词的特殊用法，特指在社交或情感关系中用作伪装的伴侣，具有文化语境下的隐喻含义，比 “cover” 更具特定性和历史背景。"
    }
  ]
}