{
  "word": "beast",
  "pronunciation": "bist",
  "concise_definition": "n. 野兽, 动物, 怪物; adj. 巨大的, 极其难对付的",
  "forms": {
    "plural": "beasts"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A wild or untamed animal, especially one that is large, dangerous, or ferocious; often used to emphasize primal or violent instincts.",
      "explanation_cn": "指野生或未驯化的动物，尤指体型庞大、危险或凶猛的动物；常用于强调原始或暴力的本能。",
      "example_en": "The lion, a powerful beast, ruled the savanna with quiet authority.",
      "example_cn": "狮子这种强大的野兽以沉静的威严统治着大草原。"
    },
    {
      "pos": "noun",
      "explanation_en": "A monstrous or deformed creature, often in myth, fantasy, or horror contexts; can also refer to a person perceived as cruel or inhuman.",
      "explanation_cn": "指神话、幻想或恐怖语境中的怪物或畸形生物；也可指被认为残忍或非人性的人。",
      "example_en": "The fairy tale described a beast with the body of a lion and the head of a dragon.",
      "example_cn": "这个童话描述了一种身体像狮子、头像龙的怪物。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who behaves in a brutal, selfish, or uncontrolled way, often used in informal or figurative speech.",
      "explanation_cn": "指行为粗暴、自私或失控的人，常用于非正式或比喻性表达。",
      "example_en": "He was a beast on the football field—no one could stop him.",
      "example_cn": "他在足球场上像个野兽——没人能拦得住他。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used informally to describe something extremely large, difficult, or overwhelming in scale or complexity.",
      "explanation_cn": "非正式用法，形容某事物规模巨大、极其困难或令人难以应付。",
      "example_en": "That was a beast of a project—three months of nonstop work.",
      "example_cn": "那是个巨大的工程——连续三个月不停歇地工作。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "animal",
      "analysis": "“Animal” (动物) 是一个中性、科学的术语，泛指所有生物分类中的动物界成员，不带情感色彩。而 “beast” 常带有情感或文化联想，如野蛮、恐怖或力量，多用于文学或口语中，强调非理性或原始性。"
    },
    {
      "word_to_compare": "monster",
      "analysis": "“Monster” (怪物) 通常指超自然、虚构或畸形的存在，强调恐怖、怪异或道德上的邪恶；而 “beast” 可以是真实存在的动物，也可以是比喻性的人，其恐怖感更偏向本能和力量，而非超自然或邪恶本质。"
    },
    {
      "word_to_compare": "creature",
      "analysis": "“Creature” (生物) 是一个更宽泛、更温和的词，可指任何有生命的个体，包括人类、动物甚至幻想生物，常带怜悯或诗意色彩。而 “beast” 更强调野性、力量或粗暴，较少用于正面或温柔语境。"
    }
  ]
}