{
  "word": "beat",
  "pronunciation": "beet",
  "concise_definition": "v. 击打, 战胜, 心跳; n. 节奏, 敲击声, 巡逻路线",
  "forms": {
    "third_person_singular": "beats",
    "past_tense": "beat",
    "past_participle": "beaten",
    "present_participle": "beating"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To strike repeatedly with force, typically using a hand, object, or instrument.",
      "explanation_cn": "指用拳头、物体或工具反复用力击打。",
      "example_en": "He beat the drum with steady rhythm.",
      "example_cn": "他以稳定的节奏敲打着鼓。"
    },
    {
      "pos": "verb",
      "explanation_en": "To defeat someone in a competition, contest, or conflict; to overcome or outperform.",
      "explanation_cn": "指在比赛、竞争或冲突中击败他人，胜过或超越对手。",
      "example_en": "She beat the world champion in the final match.",
      "example_cn": "她在决赛中击败了世界冠军。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pulsate or throb, especially referring to the heart or a rhythmic sound.",
      "explanation_cn": "指有节奏地跳动或搏动，尤指心脏或有节奏的声音。",
      "example_en": "His heart beat rapidly as he waited for the results.",
      "example_cn": "他在等待结果时心跳加速。"
    },
    {
      "pos": "noun",
      "explanation_en": "A regular, repeated pattern of sound or movement, especially in music.",
      "explanation_cn": "指音乐中规律重复的声音或动作模式，即节奏。",
      "example_en": "The song has a strong beat that makes you want to dance.",
      "example_cn": "这首歌节奏强烈，让人忍不住想跳舞。"
    },
    {
      "pos": "noun",
      "explanation_en": "A regular route or circuit patrolled by a police officer or other official.",
      "explanation_cn": "指警察或其他官员例行巡逻的固定路线。",
      "example_en": "The officer was on his nightly beat when he spotted the suspicious figure.",
      "example_cn": "警察在夜间巡逻时发现了那个可疑的身影。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "strike",
      "analysis": "“Strike” (打击) 通常指一次性的、突然的击打动作，强调瞬间的冲击力，如闪电击中树木。而 “beat” 更强调重复性、持续性的击打，如敲鼓或心跳，具有节奏感。"
    },
    {
      "word_to_compare": "defeat",
      "analysis": "“Defeat” (击败) 是更正式、抽象的词汇，专用于竞争或战争中取得胜利，不用于物理击打。而 “beat” 更口语化，既可用于物理击打，也可用于战胜对手，语义范围更广。"
    },
    {
      "word_to_compare": "pulse",
      "analysis": "“Pulse” (脉搏) 是名词，指心跳或节律性波动的生理现象本身，偏医学或科学语境。而 “beat” 作为名词时更通用，可指音乐节奏或任何有规律的敲击声，语义更宽泛，也更具表现力。"
    }
  ]
}