{
  "word": "beats",
  "pronunciation": "beets",
  "concise_definition": "n. 节奏, 拍子, 敲击声; v. 击打, 战胜, 跳动",
  "forms": {
    "base_form": "beat",
    "third_person_singular": "beats",
    "past_tense": "beat",
    "past_participle": "beaten",
    "present_participle": "beating"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A regular, repeated pulse or rhythm in music, often used to establish tempo and drive the feel of a piece.",
      "explanation_cn": "音乐中规律重复的脉冲或节奏，常用于确立节拍并推动乐曲的韵律感。",
      "example_en": "The song has a strong beat that makes you want to dance.",
      "example_cn": "这首歌节奏强烈，让人忍不住想跳舞。"
    },
    {
      "pos": "noun",
      "explanation_en": "A single strike or blow, especially one made with a hand, stick, or other object.",
      "explanation_cn": "一次敲击或打击，尤指用手、棍棒或其他物体所施加的一下击打。",
      "example_en": "She heard the beats of the rain against the window.",
      "example_cn": "她听到雨点敲打窗户的声音。"
    },
    {
      "pos": "noun",
      "explanation_en": "A pattern of repeated physical or emotional strain, often used in the plural to describe a person's daily routine or hardships.",
      "explanation_cn": "一种重复的身体或情感压力模式，常以复数形式指代一个人的日常劳碌或艰难处境。",
      "example_en": "He’s been on the beats of the city for ten years, patrolling the streets every night.",
      "example_cn": "他已经在城市街头巡逻了十年，每晚都奔波在执勤路上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strike repeatedly or forcefully, especially with the hand or an object.",
      "explanation_cn": "反复或用力地击打，尤指用手或某物。",
      "example_en": "He beats the drum with great energy during the performance.",
      "example_cn": "他在演出中充满活力地敲击鼓面。"
    },
    {
      "pos": "verb",
      "explanation_en": "To defeat someone in a competition, contest, or conflict.",
      "explanation_cn": "在比赛、竞赛或冲突中战胜某人。",
      "example_en": "Our team beat the champions last weekend.",
      "example_cn": "我们上周末击败了冠军队。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move with a regular rhythm, especially of the heart or a machine.",
      "explanation_cn": "以规律的节奏跳动，尤指心脏或机器的跳动。",
      "example_en": "Her heart beats faster when she’s nervous.",
      "example_cn": "她紧张时心跳会加快。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rhythm",
      "analysis": "“Rhythm”（节奏）指音乐或动作中更广泛、更复杂的模式和结构，包含强弱、长短、停顿等变化；而 “beat” 是节奏中最基本、最稳定的脉冲单位，是节奏的骨架。可以说，所有 beat 都属于 rhythm，但并非所有 rhythm 都仅由 beat 构成。"
    },
    {
      "word_to_compare": "strike",
      "analysis": "“Strike”（打击）强调一次性的、有目的的击打动作，常用于攻击或敲击物体，不强调重复性；而 “beat” 更侧重于连续、有节奏的击打，如心跳、鼓点或殴打。在表示“击打”时，beat 更具重复性和韵律感。"
    },
    {
      "word_to_compare": "defeat",
      "analysis": "“Defeat”（击败）是更正式、更广泛的词汇，用于所有类型的竞赛或对抗，强调结果；而 “beat” 更口语化，常用于体育、游戏或日常竞争中，语气更直接、生动。例如：We defeated the enemy（我们击败了敌人）vs. We beat them in the game（我们在比赛中赢了他们）。"
    }
  ]
}