{
  "word": "beater",
  "pronunciation": "bee·tuhr",
  "concise_definition": "n. 搅拌器, 打蛋器, 击打者, 残酷的虐待者",
  "forms": {
    "plural": "beaters"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A kitchen tool used for mixing, whipping, or beating ingredients such as eggs, cream, or batter, typically with rotating wires or blades.",
      "explanation_cn": "一种厨房用具，用于搅拌、搅打或混合食材，如鸡蛋、奶油或面糊，通常带有旋转的金属丝或刀片。",
      "example_en": "She used a hand beater to whip the cream until it formed stiff peaks.",
      "example_cn": "她用手动打蛋器将奶油搅打至形成硬性发泡。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who beats or strikes something or someone repeatedly, often with force or violence.",
      "explanation_cn": "指反复击打某物或某人的人，常带有暴力或猛烈的性质。",
      "example_en": "The police arrested the beater after neighbors reported hearing screams from the apartment.",
      "example_cn": "邻居们报告听到公寓里传出尖叫声后，警方逮捕了这名施暴者。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is cruel or abusive, especially in a domestic context; often used to describe an abusive partner.",
      "explanation_cn": "指尤其在家庭环境中施加虐待或残忍行为的人，常用于描述施虐的伴侣。",
      "example_en": "The shelter provides support for women escaping a beater.",
      "example_cn": "该庇护所为逃离施虐伴侣的女性提供支持。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who drives a vehicle, especially a horse-drawn carriage, or a driver in a racing context.",
      "explanation_cn": "指驾驶车辆的人，尤指驾驶马车者，或在赛马语境中指驭手。",
      "example_en": "The beater guided the team of horses through the muddy track with skill.",
      "example_cn": "驭手娴熟地驾驭着马队穿过泥泞的赛道。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mixer",
      "analysis": "“Mixer”（搅拌机）泛指任何用于混合的设备，包括电动搅拌机、食品加工机等，范围更广；而 “beater” 特指带有打蛋头或搅拌棒的工具，功能更具体，常用于搅打、发泡等动作。"
    },
    {
      "word_to_compare": "abuser",
      "analysis": "“Abuser”（施虐者）是更广泛、更正式的术语，涵盖身体、情感、性、经济等各类虐待行为；而 “beater” 更强调身体暴力，语义更具体、更口语化，常带有强烈的情感色彩。"
    },
    {
      "word_to_compare": "driver",
      "analysis": "“Driver”（驾驶员）是通用词，适用于任何交通工具的操控者；而 “beater” 在指驾车者时，仅用于特定语境，如马车或赛马，现代英语中极少用于汽车驾驶，属于较陈旧或专业用法。"
    }
  ]
}