{
  "word": "beauty",
  "pronunciation": "byoo·tuh",
  "concise_definition": "n. 美, 美丽, 美的事物",
  "forms": {
    "plural": "beauties"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The quality or combination of qualities (such as shape, color, or form) that pleases the aesthetic senses, especially the sight, and is often associated with harmony, symmetry, or elegance.",
      "explanation_cn": "指能愉悦审美感官（尤其是视觉）的品质或品质组合，如形状、颜色或形式，通常与和谐、对称或优雅相关联。",
      "example_en": "The beauty of the sunset left everyone speechless.",
      "example_cn": "日落的美景让所有人都哑口无言。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that is considered exceptionally attractive or pleasing, often used to describe a person, especially a woman, with striking physical appeal.",
      "explanation_cn": "指被认为极其吸引人或令人愉悦的人或事物，常用于形容外貌出众的人，尤其是女性。",
      "example_en": "She was considered a real beauty in her youth.",
      "example_cn": "她年轻时被认为是真正的美人。"
    },
    {
      "pos": "noun",
      "explanation_en": "An abstract concept representing the ideal of aesthetic perfection or the power to inspire admiration and emotional response through appearance or expression.",
      "explanation_cn": "指一种抽象概念，代表审美完美的理想，或通过外貌或表达激发钦佩与情感反应的力量。",
      "example_en": "Artists seek to capture beauty in all its forms — from nature to human emotion.",
      "example_cn": "艺术家们致力于捕捉各种形式的美——从自然到人类情感。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "handsome",
      "analysis": "“Handsome”（英俊的/漂亮的）通常用于形容男性或具有庄重、匀称之美的事物，强调的是端庄、得体的外表，较少用于抽象或自然之美。而 “beauty” 更广泛，可涵盖性别、抽象概念和自然现象，语义范围更广，情感色彩更强。"
    },
    {
      "word_to_compare": "attractiveness",
      "analysis": "“Attractiveness”（吸引力）侧重于引发他人兴趣或欲望的特质，可能包括非视觉因素（如气质、幽默感），具有主观性和功能性。而 “beauty” 更强调视觉或审美层面的客观品质，常带有文化或传统意义上的理想化标准。"
    },
    {
      "word_to_compare": "grace",
      "analysis": "“Grace”（优雅）强调动作、姿态或风格中的流畅、自然与高贵，常与内在修养或举止相关。它是一种动态的美，而 “beauty” 更多是静态的视觉或感官体验。一个人可以有 grace 而不一定是传统意义上的 beauty，反之亦然。"
    }
  ]
}