{
  "word": "bed",
  "pronunciation": "bed",
  "concise_definition": "n. 床, 床铺; (植物)苗床; 河床; v. 安置, 使躺下",
  "forms": {
    "plural": "beds"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A piece of furniture designed for sleeping or resting, typically consisting of a frame, a mattress, and bedding.",
      "explanation_cn": "一种专为睡眠或休息设计的家具，通常由床架、床垫和床上用品组成。",
      "example_en": "She made the bed neatly before leaving for work.",
      "example_cn": "她上班前把床铺得整整齐齐。"
    },
    {
      "pos": "noun",
      "explanation_en": "A prepared area of ground, especially in a garden, for growing plants, often bordered and filled with soil.",
      "explanation_cn": "指为种植植物而准备的地面区域，通常有边界并填满土壤，如花园中的花坛或菜畦。",
      "example_en": "The roses were planted in a sunny bed near the fence.",
      "example_cn": "玫瑰被栽种在篱笆旁阳光充足的一块花坛里。"
    },
    {
      "pos": "noun",
      "explanation_en": "The bottom of a river, lake, or sea, especially when considered as a layer of sediment or rock.",
      "explanation_cn": "指河流、湖泊或海洋的底部，尤指由沉积物或岩石构成的底层。",
      "example_en": "The ship ran aground on the rocky bed of the river.",
      "example_cn": "船在河底的岩石上搁浅了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To place or settle someone or something in a position of rest or support, often in a bed or similar surface.",
      "explanation_cn": "指将人或物安置在休息或支撑的位置上，通常是在床上或类似表面上。",
      "example_en": "The nurse bedded the patient after administering the medication.",
      "example_cn": "护士给病人服药后让他躺下休息。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fix or embed something firmly in a surrounding medium, such as planting a tree in soil or setting a stone in mortar.",
      "explanation_cn": "指将某物牢固地嵌入或埋入周围介质中，如将树栽入土壤，或将石头嵌入灰浆中。",
      "example_en": "The builders bedded the bricks in a thick layer of cement.",
      "example_cn": "建筑工人用厚厚的水泥层将砖块固定好。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cot",
      "analysis": "“Cot” (小床/行军床) 通常指小型、简易或可折叠的床，常用于婴儿、露营或临时住宿，结构简单，功能单一。而 “bed” 是更通用的词，涵盖从简易床到豪华床的各种类型，强调其作为睡眠核心家具的普遍性。"
    },
    {
      "word_to_compare": "bunk",
      "analysis": "“Bunk” (双层床的上铺或下铺) 特指双层床中的一个铺位，常用于宿舍、军营或儿童房，强调空间的垂直利用。而 “bed” 是泛指任何睡眠用具，不特指结构形式。"
    },
    {
      "word_to_compare": "plot",
      "analysis": "“Plot” (地块/小块土地) 在园艺语境中可与 “bed” 互换，但 “plot” 更强调土地的划分和所有权，常用于菜园或农田；而 “bed” 更强调为种植而精心准备的土壤区域，注重栽培条件和美观布局。"
    }
  ]
}