{
  "word": "beggar",
  "pronunciation": "be·gahr",
  "concise_definition": "n. 乞丐, 乞讨者; v. 难以形容, 超出...的范围",
  "forms": {
    "plural": "beggars",
    "third_person_singular": "beggar",
    "past_tense": "beggared",
    "past_participle": "beggared",
    "present_participle": "begging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who begs for money, food, or other necessities, typically by asking passersby for alms in public places.",
      "explanation_cn": "指在公共场所向路人乞讨金钱、食物或其他必需品的人，通常依靠施舍为生。",
      "example_en": "The old beggar sat quietly on the sidewalk, holding out a worn cap for coins.",
      "example_cn": "那位年迈的乞丐安静地坐在人行道上，举着一顶破旧的帽子讨要硬币。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that is extremely poor or lacking in a particular quality, often used metaphorically.",
      "explanation_cn": "比喻性地指极度贫穷或缺乏某种品质的人或事物，常用于强调匮乏的程度。",
      "example_en": "He’s a beggar when it comes to social skills—he can’t even make small talk.",
      "example_cn": "他在社交技巧方面简直一贫如洗——连寒暄都不会。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reduce someone to a state of extreme poverty or destitution, often through financial loss or mismanagement.",
      "explanation_cn": "指因财务损失或管理不善而使某人陷入极度贫困的状态。",
      "example_en": "The scandal beggared the once-wealthy family, leaving them with nothing but debt.",
      "example_cn": "这场丑闻使这个曾经富裕的家庭破产，只留下满身债务。"
    },
    {
      "pos": "verb",
      "explanation_en": "To surpass or defy description or expectation; to be beyond the limits of what can be imagined or expressed.",
      "explanation_cn": "指某事物超出了描述或想象的极限，难以用言语形容。",
      "example_en": "The beauty of the sunset beggared all words.",
      "example_cn": "日落的美景令人词穷。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pauper",
      "analysis": "“Pauper”（贫民）是法律或历史语境中对极度贫困者的正式称呼，常带有制度性或社会福利体系下的含义，语气较中性或学术。而 “beggar” 更强调主动乞讨的行为，带有更强的社会观察色彩，有时隐含贬义。"
    },
    {
      "word_to_compare": "vagrant",
      "analysis": "“Vagrant”（流浪者）指无固定住所、无固定职业、四处漂泊的人，可能不乞讨，但常被社会视为边缘群体。而 “beggar” 的核心是乞讨行为，即使有住所也可能被称为 beggar。两者有重叠，但焦点不同：一个是居住状态，一个是经济行为。"
    },
    {
      "word_to_compare": "impoverish",
      "analysis": "“Impoverish”（使贫困）是正式动词，指通过经济手段使某人或某群体陷入贫困，强调过程和原因，常用于宏观语境（如政策、战争）。而 “beggared” 是其口语化、文学化的同义表达，更强调结果的极端性，且常用于文学修辞中，如 ‘beggared by greed’。"
    },
    {
      "word_to_compare": "exceed",
      "analysis": "“Exceed”（超过）是中性动词，指在数量、程度上超出某个标准或界限。而 “beggared” 在比喻义中（如 ‘beggared all description’）不仅表示‘超过’，更强调‘完全无法被表达或想象’，带有强烈的修辞张力和情感色彩，语义更浓烈。"
    }
  ]
}