{
  "word": "begging",
  "pronunciation": "behg·ing",
  "concise_definition": "n. 乞讨, 乞求; v. 乞求, 哀求 (动词原形: beg)",
  "forms": {
    "base_form": "beg",
    "third_person_singular": "begs",
    "past_tense": "begged",
    "past_participle": "begged",
    "present_participle": "begging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of asking for money, food, or other assistance in a humble or desperate manner, typically from strangers or passersby.",
      "explanation_cn": "以谦卑或绝望的方式向陌生人或路人请求金钱、食物或其他帮助的行为。",
      "example_en": "Begging on the streets has increased in the city since the economic downturn.",
      "example_cn": "自经济衰退以来，城市中街头乞讨的现象增加了。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of pleading or asking earnestly for something, often in a way that seems overly submissive or desperate.",
      "explanation_cn": "以极其恳切、近乎卑微或绝望的方式恳求某物的行为，常带有过度顺从的意味。",
      "example_en": "His begging for forgiveness sounded more like manipulation than genuine remorse.",
      "example_cn": "他恳求原谅的样子听起来更像是操纵，而非真正的悔意。"
    },
    {
      "pos": "verb",
      "explanation_en": "To ask for something humbly or urgently, especially money or help, often with a sense of desperation or need.",
      "explanation_cn": "以谦卑或急切的方式请求某物，尤其是金钱或帮助，常带有绝望或迫切的需求感。",
      "example_en": "She was begging for a ride home after her car broke down.",
      "example_cn": "她的车抛锚后，她苦苦哀求搭个便车回家。"
    },
    {
      "pos": "verb",
      "explanation_en": "To plead or implore someone to do or not do something, often with emotional intensity.",
      "explanation_cn": "以强烈的情感恳求某人做或不做某事。",
      "example_en": "He was begging his parents not to move away.",
      "example_cn": "他苦苦哀求父母不要搬走。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pleading",
      "analysis": "“Pleading” (恳求) 与 “begging” 非常接近，但更侧重于法律或正式语境中的恳求，或带有情感上的强烈诉求，常用于法庭、谈判或情感危机中。而 “begging” 更常用于日常语境，带有更明显的卑微、乞怜或绝望色彩。"
    },
    {
      "word_to_compare": "requesting",
      "analysis": "“Requesting” (请求) 是中性、礼貌的表达，强调尊重和正式性，不带有情感压力或卑微姿态。而 “begging” 暗示请求者处于弱势地位，甚至可能牺牲尊严，语气远比 “requesting” 更强烈和情绪化。"
    },
    {
      "word_to_compare": "imploring",
      "analysis": "“Imploring” (恳求) 与 “begging” 意义相近，都表示强烈恳求，但 “imploring” 更具文学性和情感深度，常用于描述深切的、发自内心的哀求，语气更庄重；而 “begging” 更口语化，有时带有贬义，暗示过度依赖或缺乏尊严。"
    }
  ]
}