{
  "word": "behaviours",
  "pronunciation": "bih·heyv·yuhrs",
  "concise_definition": "n. 行为, 举止, 表现",
  "forms": {
    "singular": "behaviour"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The way in which a person, animal, or group acts or conducts itself in response to a particular situation or environment, often reflecting attitudes, values, or social norms.",
      "explanation_cn": "指个人、动物或群体在特定情境或环境中所表现出的行动方式，通常反映其态度、价值观或社会规范。",
      "example_en": "The teacher noted improved behaviours in students after implementing the new classroom rules.",
      "example_cn": "实施新的课堂规则后，老师注意到学生的言行表现有了明显改善。"
    },
    {
      "pos": "noun",
      "explanation_en": "Characteristic patterns of action or reaction, especially those that are habitual, learned, or influenced by psychological or biological factors.",
      "explanation_cn": "指具有特征性的行动或反应模式，尤其是那些习惯性、习得性或受心理与生物因素影响的行为。",
      "example_en": "Animal behaviours such as migration and hibernation are driven by seasonal changes.",
      "example_cn": "动物的迁徙和冬眠等行为是由季节变化所驱动的。"
    },
    {
      "pos": "noun",
      "explanation_en": "In psychology and sociology, observable actions that can be measured, analyzed, and sometimes modified through intervention or training.",
      "explanation_cn": "在心理学与社会学中，指可被观察、测量并可通过干预或训练加以调整的外显行为。",
      "example_en": "The therapy focused on changing maladaptive behaviours in children with autism.",
      "example_cn": "这种疗法旨在改变自闭症儿童的适应不良行为。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "action",
      "analysis": "“Action” (行动) 指单一、具体的举动或事件，通常是短暂的、可观察的物理行为，如“举手”或“跑步”。“Behaviours” 则更广泛，包含一系列重复、模式化或有目的的行动，强调系统性和持续性，常用于分析整体倾向。"
    },
    {
      "word_to_compare": "conduct",
      "analysis": "“Conduct” (行为/品行) 常用于正式语境，强调道德或社会规范层面的举止，尤其指符合或违背礼仪、法律或职业标准的行为。它更侧重评价性判断，如“professional conduct”；而 “behaviours” 更中性，可用于描述任何可观察的反应模式，无论是否符合规范。"
    },
    {
      "word_to_compare": "manner",
      "analysis": "“Manner” (方式) 指行为的风格或表现形式，如说话的语气、走路的姿态，强调的是“如何做”，而非“做什么”。例如，“a polite manner”。“Behaviours” 关注的是具体做了什么，而 “manner” 关注的是做这件事的方式或态度。"
    }
  ]
}