{
  "word": "behind",
  "pronunciation": "buh·haind",
  "concise_definition": "prep. 在...后面, adv. 在后面, 落后, 滞后",
  "forms": {
    "comparative": "more behind",
    "superlative": "most behind"
  },
  "definitions": [
    {
      "pos": "preposition",
      "explanation_en": "Indicating a position at the back of something or someone, either physically or in terms of spatial orientation.",
      "explanation_cn": "表示在某物或某人后方的位置，无论是物理空间上的后方，还是空间方位上的后面。",
      "example_en": "The cat is hiding behind the sofa.",
      "example_cn": "猫躲在沙发后面。"
    },
    {
      "pos": "adverb",
      "explanation_en": "At or to a place that is at the back of something; not in the front or leading position.",
      "explanation_cn": "处于或移动到某物的后方；不在前方或领先位置。",
      "example_en": "She walked behind her brother all the way to school.",
      "example_cn": "她一路跟在哥哥后面走到学校。"
    },
    {
      "pos": "adverb",
      "explanation_en": "Falling behind in progress, development, or performance; not keeping up with others or with a standard.",
      "explanation_cn": "在进展、发展或表现上落后，未能跟上他人或标准。",
      "example_en": "The country is behind in technological innovation compared to its neighbors.",
      "example_cn": "与邻国相比，这个国家在技术创新方面落后了。"
    },
    {
      "pos": "adverb",
      "explanation_en": "Used to indicate that something is not yet completed or has been left undone, often in the context of tasks or responsibilities.",
      "explanation_cn": "用于表示某事尚未完成或被搁置，常用于任务或责任的语境中。",
      "example_en": "I'm behind on my rent payments this month.",
      "example_cn": "这个月我的房租还没付。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that is not current or up to date, especially in terms of information, trends, or technology.",
      "explanation_cn": "形容某事物不是最新的，尤其指信息、趋势或技术方面过时。",
      "example_en": "His phone is behind the times—it doesn't even have a camera.",
      "example_cn": "他的手机太落伍了，连摄像头都没有。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "after",
      "analysis": "“After” (在...之后) 强调时间顺序或事件发生的先后关系，如 “after lunch”；而 “behind” 更侧重于空间位置或进度上的落后，不一定涉及时间。例如，你可以说 “He is behind me in line”（他在我的后面排队），但不能说 “He is after me in line” 来表达相同的空间含义。"
    },
    {
      "word_to_compare": "back",
      "analysis": "“Back” (后部) 通常指某物本身的后侧部分，如 “the back of the chair”；而 “behind” 是一个介词或副词，强调相对于另一个物体的位置在“其后”。例如，“The keys are on the back of the table”（钥匙在桌子的背面），而 “The keys are behind the table”（钥匙在桌子的后面）则意味着钥匙在桌子的另一侧。"
    },
    {
      "word_to_compare": "beyond",
      "analysis": "“Beyond” (超出) 表示超过某个界限、范围或限度，常用于抽象概念，如 “beyond repair” 或 “beyond understanding”；而 “behind” 仅表示位置或进度上的落后，不包含“超越”或“不可及”的含义。例如，你不能说 “He is beyond me in the race” 来表示落后，而必须用 “behind”。"
    }
  ]
}