{
  "word": "being",
  "pronunciation": "bee·ing",
  "concise_definition": "n. 存在, 生物, 个体; v. 存在 (古语或诗语)",
  "forms": {
    "plural": "beings"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A living entity or organism, especially one with consciousness or individuality; often used to refer to humans, animals, or spiritual entities.",
      "explanation_cn": "指具有生命、尤其是具有意识或个性的实体，常用于指人类、动物或灵体。",
      "example_en": "All sentient beings deserve compassion and respect.",
      "example_cn": "所有有感知能力的生物都应得到同情与尊重。"
    },
    {
      "pos": "noun",
      "explanation_en": "The state or fact of existing or having existence; often used in philosophical or abstract contexts to refer to existence itself.",
      "explanation_cn": "指存在或拥有存在的状态或事实，常用于哲学或抽象语境中，指‘存在’本身。",
      "example_en": "The question of being has puzzled philosophers for centuries.",
      "example_cn": "‘存在’这一问题困扰了哲学家数个世纪。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person’s essential nature or character, especially when used in phrases like 'in being' or 'true being'.",
      "explanation_cn": "指一个人的本质或性格，尤其用于短语如 'in being' 或 'true being' 中。",
      "example_en": "She revealed her true being only to her closest friends.",
      "example_cn": "她只向最亲密的朋友展现了自己的真实本性。"
    },
    {
      "pos": "verb",
      "explanation_en": "An archaic or poetic form of the verb 'to be', used in older English literature to express existence or state of being.",
      "explanation_cn": "‘to be’ 的古语或诗体形式，用于古英语文学中表达存在或状态。",
      "example_en": "He, being the first to speak, set the tone for the assembly.",
      "example_cn": "他作为第一个发言的人，为集会定下了基调。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "entity",
      "analysis": "“Entity” (实体) 是一个更中性、更广泛的术语，可指任何具有独立存在性的对象，包括非生命体（如公司、组织、抽象概念）。而 “being” 强调生命性与意识性，通常仅用于有生命的个体，尤其在哲学或伦理语境中带有情感或道德色彩。"
    },
    {
      "word_to_compare": "existence",
      "analysis": "“Existence” (存在) 是一个抽象名词，指‘存在’这一状态或事实，不涉及具体形态。而 “being” 既可以是抽象的（如哲学中的‘存在’），也可以是具体的（如‘一个生命体’），更具可感性和个体性。"
    },
    {
      "word_to_compare": "person",
      "analysis": "“Person” (人) 专指人类个体，具有法律、社会或道德身份。而 “being” 范围更广，可包括动物、外星生命、灵体等非人类生命体，语义更开放、更具包容性。"
    }
  ]
}