{
  "word": "bell",
  "pronunciation": "bel",
  "concise_definition": "n. 钟, 铃; v. 装铃, 鸣钟",
  "forms": {
    "plural": "bells"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A hollow metal instrument that produces a ringing sound when struck, typically used to signal time, call attention, or mark an event.",
      "explanation_cn": "一种中空的金属器具，敲击时发出响亮的铃声，常用于报时、引起注意或标记事件。",
      "example_en": "The church bell rang at noon, signaling the start of the service.",
      "example_cn": "教堂的钟在正午敲响，标志着仪式的开始。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small ringing device attached to clothing, animals, or objects to produce a sound, often for identification or warning.",
      "explanation_cn": "附着在衣物、动物或物品上以发出声响的小型装置，常用于识别或警示。",
      "example_en": "The cat wore a bell around its neck so the birds could hear it coming.",
      "example_cn": "猫脖子上挂着一个小铃铛，以便鸟类能听到它靠近。"
    },
    {
      "pos": "noun",
      "explanation_en": "A shape resembling a bell, especially the flared lower part of a garment, trumpet, or other object.",
      "explanation_cn": "指形状类似钟的物体，尤指服装、喇叭或其他物品的下部扩大部分。",
      "example_en": "She wore a dress with a flared bell skirt that swished as she walked.",
      "example_cn": "她穿了一条裙摆呈钟形的裙子，走路时裙摆沙沙作响。"
    },
    {
      "pos": "verb",
      "explanation_en": "To attach a bell or bells to something, especially for sound or identification.",
      "explanation_cn": "给某物安装铃铛，通常为了发声或识别。",
      "example_en": "The farmers bell their cattle to keep track of them in the pasture.",
      "example_cn": "农夫给牛群戴上铃铛，以便在牧场上追踪它们。"
    },
    {
      "pos": "verb",
      "explanation_en": "To sound a bell, especially to signal the beginning or end of an event or period.",
      "explanation_cn": "敲响铃铛，尤指标志着某事件或时段的开始或结束。",
      "example_en": "The teacher belled the end of the class with a sharp ring.",
      "example_cn": "老师用一声清脆的铃声宣告下课。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "chime",
      "analysis": "“Chime”（钟声/和声）通常指由多个音符组成的悦耳旋律性声响，如钟楼的报时旋律或门铃的和弦音，强调音乐性和复合音调；而 “bell” 指单一、清脆、响亮的敲击声，更原始、直接，常用于警示或报时。"
    },
    {
      "word_to_compare": "gong",
      "analysis": "“Gong”（锣）是一种扁平的金属打击乐器，声音低沉、持续、有共鸣，常用于东方仪式或戏剧中；而 “bell” 声音更清亮、短促、穿透力强，多用于西方日常报时或通知。两者虽均为敲击发声，但音色、形状和文化用途截然不同。"
    },
    {
      "word_to_compare": "ring",
      "analysis": "“Ring”（铃声/环状物）作为名词时可泛指任何铃声或圆形物，语义更广；而 “bell” 是产生这种声音的具体物体。作为动词时，“ring” 强调动作（发出声音），而 “bell” 作为动词时特指‘用铃声通知’，语义更狭窄、更具体。"
    }
  ]
}