{
  "word": "belt",
  "pronunciation": "belt",
  "concise_definition": "n. 带子, 腰带; v. 猛击, 紧紧系住",
  "forms": {
    "plural": "belts",
    "third_person_singular": "belts",
    "past_tense": "belted",
    "past_participle": "belted",
    "present_participle": "belting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long, narrow strip of material, typically worn around the waist to hold up trousers or as a fashion accessory, and sometimes used to fasten or secure objects.",
      "explanation_cn": "一条长而窄的带状物，通常系在腰部以固定裤子，或作为时尚配饰，有时也用于固定或系紧物品。",
      "example_en": "He tightened his leather belt before stepping into the meeting.",
      "example_cn": "他走进会议室前收紧了皮带。"
    },
    {
      "pos": "noun",
      "explanation_en": "A continuous band or zone of a particular feature or activity, often used to describe geographical or functional regions (e.g., a snow belt, rust belt).",
      "explanation_cn": "指具有某种特定特征或活动的连续带状区域，常用于描述地理或功能区域（如‘雪带’、‘锈带’）。",
      "example_en": "The Midwest is part of the Rust Belt, known for its declining manufacturing industry.",
      "example_cn": "中西部是锈带的一部分，以制造业衰退而闻名。"
    },
    {
      "pos": "noun",
      "explanation_en": "A conveyor belt or drive belt in machinery, used to transmit power or move materials.",
      "explanation_cn": "指机械中的传送带或传动带，用于传递动力或运输物料。",
      "example_en": "The factory’s assembly line relies on a durable rubber belt to move parts.",
      "example_cn": "工厂的装配线依靠一条耐用的橡胶带运输零部件。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hit someone or something forcefully, often with a belt or similar object, or metaphorically to strike hard.",
      "explanation_cn": "用力击打某人或某物，通常用皮带或类似物品，也可比喻为猛烈打击。",
      "example_en": "The coach belted the ball so hard it flew over the fence.",
      "example_cn": "教练把球打得那么用力，球直接飞过了围栏。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fasten or secure something tightly with a belt.",
      "explanation_cn": "用皮带将某物紧紧系住或固定。",
      "example_en": "She belted her coat tightly against the cold wind.",
      "example_cn": "她紧紧系上外套的腰带以抵御寒风。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "strap",
      "analysis": "“Strap”（带子）通常指更窄、更薄、更柔韧的带状物，常用于包、鞋或设备的固定，强调功能性而非装饰性。而 “belt” 更常用于腰部，具有更强的承重和固定功能，且常作为服饰的一部分。"
    },
    {
      "word_to_compare": "band",
      "analysis": "“Band”（带、环）是一个更广泛的术语，可指任何环状或带状物，如发带、音乐乐队、无线电频段等，不特指用于系紧的物品。而 “belt” 专指用于束紧或传递动力的带状物，语义更具体。"
    },
    {
      "word_to_compare": "whip",
      "analysis": "“Whip”（鞭子）与 “belt” 在动词用法中都可表示抽打，但 “whip” 通常更细长、更具攻击性，常用于动物或惩罚语境；而 “belt” 作为动词时更口语化，常用于非正式语境中表示重击，不一定使用真正的皮带。"
    }
  ]
}