{
  "word": "belts",
  "pronunciation": "bels",
  "concise_definition": "n. 带子, 腰带, 皮带; v. 猛击, 痛打",
  "forms": {
    "singular": "belt"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long, narrow strip of material, typically worn around the waist to hold up trousers or as a fashion accessory, and sometimes used to secure or fasten objects.",
      "explanation_cn": "一种长而窄的带状物，通常系在腰部以固定裤子，或作为时尚配饰，有时也用于固定或系紧物品。",
      "example_en": "He tightened his leather belt before stepping into the ring.",
      "example_cn": "他上场前收紧了皮带。"
    },
    {
      "pos": "noun",
      "explanation_en": "A flat, continuous band of material used to transmit power or motion between rotating shafts in machinery, such as in engines or conveyor systems.",
      "explanation_cn": "用于在机械中的旋转轴之间传递动力或运动的平直连续带状物，如发动机或传送带系统中的传动带。",
      "example_en": "The car's timing belt needs to be replaced after 100,000 kilometers.",
      "example_cn": "汽车的正时皮带在行驶十万公里后需要更换。"
    },
    {
      "pos": "noun",
      "explanation_en": "A region or zone characterized by a particular feature or activity, often used metaphorically (e.g., 'the rust belt', 'the sun belt').",
      "explanation_cn": "指具有某种特定特征或活动的区域或地带，常用于比喻意义（如‘锈带’、‘阳光带’）。",
      "example_en": "The Rust Belt in the northern United States has seen a decline in manufacturing.",
      "example_cn": "美国北部的‘锈带’地区制造业已出现衰退。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hit someone or something hard and forcefully, often repeatedly; to strike with a belt or similar object.",
      "explanation_cn": "猛烈地击打某人或某物，常为反复击打；用皮带或类似物抽打。",
      "example_en": "The coach belted the player for missing the play.",
      "example_cn": "教练因球员错过战术而狠狠打了他一顿。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or travel quickly and forcefully, often used in the phrase 'belt down' or 'belt along'.",
      "explanation_cn": "快速而有力地移动或行进，常用于短语 'belt down' 或 'belt along'。",
      "example_en": "They belted down the highway to make it to the concert on time.",
      "example_cn": "他们飞速驶上高速公路，以便准时赶到音乐会。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "strap",
      "analysis": "“Strap”（带子）通常指较窄、较薄、用于固定或连接的带状物，常用于鞋带、包带等，强调功能性而非装饰性。而 “belt” 更常用于腰部，兼具实用与装饰功能，且在机械语境中特指传动带，语义范围更广。"
    },
    {
      "word_to_compare": "band",
      "analysis": "“Band”（带、环）是一个更宽泛的词，可指任何环状或带状物，如发带、音乐乐队、无线电频段等，不特指材质或用途。而 “belt” 通常指有形的、可穿戴或机械传动的带状物，语义更具体。"
    },
    {
      "word_to_compare": "whip",
      "analysis": "“Whip”（鞭子）是专门用于抽打的工具，通常有弹性且末端细长，用于驱赶动物或惩罚，其动作更迅捷、尖锐。而 “belt” 作为动词时，指用皮带或类似硬物重击，动作更沉重、直接，常含惩罚或愤怒情绪。"
    }
  ]
}