{
  "word": "bending",
  "pronunciation": "bend·ing",
  "concise_definition": "n. 弯曲, 弯折; v. 弯曲 (bend 的现在分词)",
  "forms": {
    "base_form": "bend",
    "third_person_singular": "bends",
    "past_tense": "bent",
    "past_participle": "bent",
    "present_participle": "bending"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act or process of causing something to curve or change shape from straight to curved, often under physical force or pressure.",
      "explanation_cn": "指通过外力或压力使某物从直线状态变为弯曲状态的行为或过程。",
      "example_en": "The bending of the metal rod was caused by excessive heat.",
      "example_cn": "金属棒的弯曲是由过热引起的。"
    },
    {
      "pos": "noun",
      "explanation_en": "A curve or turn in a path, road, or object; a section that is not straight.",
      "explanation_cn": "指路径、道路或物体上的一个弯曲或转折部分；非直线的区段。",
      "example_en": "The car lost control at the sharp bending of the highway.",
      "example_cn": "汽车在高速公路的急转弯处失控了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A flexible or adaptable attitude, especially in rules or principles, often implying willingness to compromise.",
      "explanation_cn": "指在规则或原则上的灵活性或适应性，常暗示愿意妥协。",
      "example_en": "His bending of the company’s strict policy allowed for remote work during the pandemic.",
      "example_cn": "他对公司严格政策的变通，使得疫情期间可以远程办公。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to curve or change its shape by applying force, often temporarily or permanently.",
      "explanation_cn": "指通过施加外力使某物弯曲或改变形状，可能是暂时的，也可能是永久的。",
      "example_en": "She was bending the wire into a circle.",
      "example_cn": "她正在把铁丝弯成一个圆圈。"
    },
    {
      "pos": "verb",
      "explanation_en": "To incline or direct something toward a particular purpose or direction, often metaphorically.",
      "explanation_cn": "指将某物倾向或引导至特定目的或方向，常用于比喻意义。",
      "example_en": "He was bending all his efforts toward finishing the project on time.",
      "example_cn": "他全力以赴，力求按时完成项目。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "curving",
      "analysis": "“Curving” (弯曲) 更强调自然、流畅、连续的曲线形态，常用于描述地形、线条或运动轨迹的优美弧度。而 “bending” 更强调外力作用导致的变形过程，可能带有强制性或非自然的意味。"
    },
    {
      "word_to_compare": "twisting",
      "analysis": "“Twisting” (扭转) 指围绕一个轴线进行旋转式的变形，产生螺旋或拧转效果，强调的是三维空间中的旋转。而 “bending” 是沿一个平面的弧形变形，不涉及旋转，仅改变方向。"
    },
    {
      "word_to_compare": "flexing",
      "analysis": "“Flexing” (弯曲/伸展) 通常指有弹性的物体在受力时发生的可逆形变，强调弹性与恢复能力，如肌肉或弹簧。而 “bending” 可以是永久性的，不一定具有弹性，适用范围更广，包括刚性材料。"
    }
  ]
}