{
  "word": "bends",
  "pronunciation": "bendz",
  "concise_definition": "n. 弯曲, 弯道, 弯折; v. 弯曲 (bend 的第三人称单数和现在分词)",
  "forms": {
    "base_form": "bend",
    "third_person_singular": "bends",
    "past_tense": "bent",
    "past_participle": "bent",
    "present_participle": "bending"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A curve or turn in a road, river, or other linear structure; a physical deviation from a straight line.",
      "explanation_cn": "指道路、河流或其他线性结构中的弯曲或转弯；一种偏离直线的物理形态。",
      "example_en": "The car took the bend too fast and skidded off the road.",
      "example_cn": "汽车以太快的速度通过弯道，滑出了道路。"
    },
    {
      "pos": "noun",
      "explanation_en": "A flexible or adjustable joint or section, especially in pipes, tubes, or mechanical devices, designed to change direction.",
      "explanation_cn": "指管道、管子或机械装置中可弯曲或可调节的接头或部分，用于改变方向。",
      "example_en": "The plumber installed a copper bend to redirect the water flow.",
      "example_cn": "水管工安装了一个铜制弯头来改变水流方向。"
    },
    {
      "pos": "noun",
      "explanation_en": "A habitual or characteristic way of behaving or thinking, often used in the plural to describe eccentricities or quirks.",
      "explanation_cn": "指一种习惯性或典型的行为或思维方式，常以复数形式表示某人的怪癖或特点。",
      "example_en": "He has a few odd bends when it comes to organizing his books.",
      "example_cn": "他在整理书籍时有一些奇怪的习惯。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to change shape by applying force, especially to make it curved or angled.",
      "explanation_cn": "指通过施加外力使某物改变形状，尤其是使其弯曲或成角度。",
      "example_en": "She bends the wire into a heart shape for the necklace.",
      "example_cn": "她把金属丝弯成心形，用来做项链。"
    },
    {
      "pos": "verb",
      "explanation_en": "To incline or turn something from a straight or normal position, often to accommodate or adapt to a situation.",
      "explanation_cn": "指使某物偏离直线或正常位置，通常是为了适应或迎合某种情况。",
      "example_en": "The company bends its policies to meet the needs of remote workers.",
      "example_cn": "公司调整了政策以满足远程员工的需求。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "curve",
      "analysis": "“Curve” (曲线) 通常指平滑、连续的弯曲形态，多用于几何、数学或自然形态的描述，强调形状的流畅性。而 “bend” 更强调动作或人为造成的转折，常用于道路、管道等具体物体的转折处，语气更口语化、动作感更强。"
    },
    {
      "word_to_compare": "twist",
      "analysis": "“Twist” (扭转) 指围绕一个轴线进行旋转或缠绕，常产生螺旋状或拧转的形态，强调旋转动作。而 “bend” 是线性方向的改变，不涉及旋转，如弯曲一根铁丝是 bend，拧成麻花则是 twist。"
    },
    {
      "word_to_compare": "flex",
      "analysis": "“Flex” (弯曲/伸展) 通常指有弹性的物体在受力时发生的可逆形变，强调柔韧性和恢复原状的能力，如肌肉 flex。而 “bend” 更广泛，可指任何方向的弯曲，不一定可逆，也不一定具有弹性。"
    }
  ]
}