{
  "word": "bend",
  "pronunciation": "bend",
  "concise_definition": "v. 弯曲, 屈身, 屈从; n. 弯曲处, 弯折",
  "forms": {
    "third_person_singular": "bends",
    "past_tense": "bent",
    "past_participle": "bent",
    "present_participle": "bending"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To cause something to change shape by applying force, so that it curves or becomes no longer straight.",
      "explanation_cn": "指通过施加外力使某物发生形变，不再保持直线而变成弯曲状态。",
      "example_en": "She bent the metal rod to fit the curve of the shelf.",
      "example_cn": "她把金属棒弯曲以适应架子的弧度。"
    },
    {
      "pos": "verb",
      "explanation_en": "To incline or turn the body or a part of it, especially in a gesture of respect, submission, or physical effort.",
      "explanation_cn": "指使身体或身体的某部分倾斜或转向，常用于表示尊敬、顺从或用力时的动作。",
      "example_en": "He bent down to pick up the child's toy.",
      "example_cn": "他弯下腰去捡孩子的玩具。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make someone comply with one's wishes or rules, often by persuasion or pressure; to twist or distort something from its original form or meaning.",
      "explanation_cn": "指通过说服或施压使他人服从自己的意愿；也可指扭曲某物的原貌或原意。",
      "example_en": "The company tried to bend the regulations to suit its profits.",
      "example_cn": "这家公司试图歪曲法规以迎合自身利润。"
    },
    {
      "pos": "noun",
      "explanation_en": "A curved or angled section of something, such as a road, river, or pipe.",
      "explanation_cn": "指某物（如道路、河流或管道）上的弯曲或转折部分。",
      "example_en": "Take care at the next bend in the road—it's sharp and dangerous.",
      "example_cn": "下一个弯道很急且危险，请小心驾驶。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "curve",
      "analysis": "“Curve” (曲线) 通常指平滑、连续的弯曲形态，多用于描述自然或设计中的几何形状，强调形态本身而非动作。而 “bend” 更强调通过外力或动作使物体发生弯曲，动作性更强，且可指不规则的弯曲。"
    },
    {
      "word_to_compare": "twist",
      "analysis": "“Twist” (扭转) 指围绕一个轴线进行旋转或缠绕，常导致物体发生螺旋状形变，强调旋转动作。而 “bend” 仅指方向的改变，不涉及旋转，如弯曲一根铁丝是 bend，将其拧成麻花则是 twist。"
    },
    {
      "word_to_compare": "flex",
      "analysis": "“Flex” (弯曲/伸展) 通常指有弹性地弯曲，常用于肌肉、关节或柔韧材料，强调可逆性和弹性。而 “bend” 更通用，可适用于刚性或柔性物体，且不一定能恢复原状。"
    }
  ]
}