{
  "word": "benefit",
  "pronunciation": "ben·uh·fit",
  "concise_definition": "n. 利益, 好处, 福利; v. 有益, 受益",
  "forms": {
    "third_person_singular": "benefits",
    "past_tense": "benefited",
    "past_participle": "benefited",
    "present_participle": "benefiting",
    "plural": "benefits"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An advantage or positive outcome gained from a situation, action, or condition; something that promotes well-being, success, or improvement.",
      "explanation_cn": "指从某种情况、行为或条件中获得的优势或积极结果，能够促进幸福、成功或改善。",
      "example_en": "Regular exercise has many health benefits, including reduced risk of heart disease.",
      "example_cn": "定期锻炼有许多健康益处，包括降低患心脏病的风险。"
    },
    {
      "pos": "noun",
      "explanation_en": "A payment or service provided by an employer, government, or organization to support individuals, often as part of a compensation package or social program.",
      "explanation_cn": "指雇主、政府或组织为支持个人而提供的金钱支付或服务，通常作为薪酬福利或社会计划的一部分。",
      "example_en": "The company offers health insurance and paid vacation as employee benefits.",
      "example_cn": "该公司为员工提供医疗保险和带薪休假作为福利。"
    },
    {
      "pos": "verb",
      "explanation_en": "To gain an advantage or improvement from something; to be helped or improved by a particular circumstance or action.",
      "explanation_cn": "指从某事物中获得优势或改善，因某种情况或行为而得到好处。",
      "example_en": "The local economy will benefit greatly from the new highway construction.",
      "example_cn": "新公路的建设将极大促进当地经济的发展。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "advantage",
      "analysis": "“Advantage”（优势）强调在竞争或比较中相对于他人所处的有利地位，常带有对比性，如‘我们有价格优势’。而 ‘benefit’ 更侧重于实际获得的好处或福祉，不一定涉及比较，适用范围更广，包括健康、情感、社会层面的正面影响。"
    },
    {
      "word_to_compare": "gain",
      "analysis": "“Gain”（获得）是一个中性词，泛指任何类型的获取，可以是物质、信息、时间等，不一定是正面的（如 gain weight）。而 ‘benefit’ 明确指积极、有益的结果，具有价值判断，强调‘有益性’。"
    },
    {
      "word_to_compare": "merit",
      "analysis": "“Merit”（优点、价值）强调事物本身固有的价值或值得称赞的品质，常用于评价系统或道德判断，如‘这个方案有其 merits’。而 ‘benefit’ 更关注结果和实际效用，是‘谁从中受益’，而非‘它本身有多好’。"
    }
  ]
}