{
  "word": "bengals",
  "pronunciation": "ben·gulz",
  "concise_definition": "n. 孟加拉虎；孟加拉队（美国橄榄球队）；孟加拉国的（复数形式）",
  "forms": {
    "singular": "bengal"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A large wild cat native to South Asia, known for its distinctive orange coat with black rosettes and stripes; scientifically classified as Panthera tigris tigris.",
      "explanation_cn": "一种原产于南亚的大型野生猫科动物，以其橙色皮毛上带有黑色玫瑰状斑纹和条纹为特征；科学分类为 Panthera tigris tigris。",
      "example_en": "The Bengal tiger is one of the most endangered big cats in the world.",
      "example_cn": "孟加拉虎是世界上最具濒危性的大型猫科动物之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "The name of a professional American football team based in Cincinnati, Ohio, competing in the NFL's AFC North division.",
      "explanation_cn": "美国职业橄榄球联盟（NFL）中位于俄亥俄州辛辛那提的一支职业橄榄球队的名称，隶属于美联北区。",
      "example_en": "The Bengals won the AFC Championship last season and advanced to the Super Bowl.",
      "example_cn": "上个赛季，孟加拉队赢得了美联冠军，并晋级超级碗。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or originating from Bengal, a historical and cultural region in South Asia, now divided between Bangladesh and the Indian state of West Bengal.",
      "explanation_cn": "与南亚历史与文化区域‘孟加拉’相关的或源自该地区的，该地区现分属孟加拉国和印度西孟加拉邦。",
      "example_en": "The museum displayed a collection of Bengal textiles and traditional crafts.",
      "example_cn": "博物馆展出了一系列孟加拉地区的纺织品和传统手工艺品。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tiger",
      "analysis": "“Tiger” 是泛指所有老虎种类的总称，而 “Bengal” 特指孟加拉虎这一亚种。前者是通用词，后者是专有名词，具有地理和生物学上的精确性。"
    },
    {
      "word_to_compare": " Bengals (team)",
      "analysis": "作为球队名称时，‘Bengals’ 是一个专有名词，特指辛辛那提橄榄球队，与动物或地理含义无关。它属于体育文化中的品牌命名，与普通名词用法无语义关联，仅共享拼写形式。"
    },
    {
      "word_to_compare": "Bangladeshi",
      "analysis": "“Bangladeshi” 指孟加拉国的国籍或人民，是现代国家层面的术语；而 “Bengal” 更侧重于历史地理区域，涵盖印度西孟加拉邦和孟加拉国。因此，‘Bengal’ 是文化地理概念，‘Bangladeshi’ 是政治国籍概念。"
    }
  ]
}