{
  "word": "bengal",
  "pronunciation": "ben·gul",
  "concise_definition": "n. 孟加拉（印度和孟加拉国地区）, 孟加拉虎, 孟加拉猫",
  "forms": {
    "adjective": "Bengali"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A region in South Asia, historically and culturally significant, now divided between the country of Bangladesh and the Indian state of West Bengal.",
      "explanation_cn": "南亚的一个地区，具有重要的历史和文化意义，现分为孟加拉国和印度的西孟加拉邦。",
      "example_en": "The Ganges River flows through the Bengal region, supporting millions of people.",
      "example_cn": "恒河流经孟加拉地区，养活了数百万人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large wild cat native to the forests of South and Southeast Asia, known for its distinctive orange coat with black stripes and its powerful build.",
      "explanation_cn": "一种原产于南亚和东南亚森林的大型野生猫科动物，以其橙色皮毛配黑色条纹和强健体格而闻名。",
      "example_en": "The Bengal tiger is an endangered species, with fewer than 2,500 individuals remaining in the wild.",
      "example_cn": "孟加拉虎是濒危物种，野外现存数量不足2500只。"
    },
    {
      "pos": "noun",
      "explanation_en": "A domestic cat breed developed from crosses between the Asian leopard cat and domestic cats, known for its wild-looking spotted coat and energetic personality.",
      "explanation_cn": "一种由亚洲豹猫与家猫杂交培育出的家猫品种，以其类似野生动物的斑点被毛和活泼好动的性格著称。",
      "example_en": "She adopted a Bengal cat because of its striking coat and playful nature.",
      "example_cn": "她领养了一只孟加拉猫，因为它的斑纹美丽且性格活泼。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "Bangladesh",
      "analysis": "“Bangladesh”（孟加拉国）是现代国家名称，特指1971年独立的主权国家，而 “Bengal” 是一个更广泛的历史地理文化区域，涵盖今天的孟加拉国和印度西孟加拉邦。前者是政治实体，后者是文化地理概念。"
    },
    {
      "word_to_compare": "Bengali",
      "analysis": "“Bengali” 是形容词或语言名称，用于描述与孟加拉地区相关的语言、文化或人民（如 Bengali language, Bengali people），而 “Bengal” 是名词，指地域、动物或猫种。两者词性不同，不可互换。"
    },
    {
      "word_to_compare": "tiger",
      "analysis": "“Tiger” 是泛指所有虎类，包括西伯利亚虎、苏门答腊虎等；而 “Bengal” 作为修饰词时特指孟加拉虎（Panthera tigris tigris），是虎的一个亚种，具有特定的地理分布和外貌特征。"
    }
  ]
}