{
  "word": "berlin",
  "pronunciation": "bərˈlɪn",
  "concise_definition": "n. 柏林（德国首都）",
  "forms": {
    "plural": "Berlins"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The capital and largest city of Germany, located in northeastern Germany, known for its rich history, cultural landmarks, and role as a center of politics, art, and science in Europe.",
      "explanation_cn": "德国的首都和最大城市，位于德国东北部，以其丰富的历史、文化地标以及作为欧洲政治、艺术和科学中心的地位而闻名。",
      "example_en": "Berlin is famous for its museums, the Brandenburg Gate, and its vibrant street art scene.",
      "example_cn": "柏林以其博物馆、勃兰登堡门和充满活力的街头艺术而闻名。"
    },
    {
      "pos": "noun",
      "explanation_en": "A historical reference to the divided city during the Cold War, symbolizing the ideological conflict between East and West, particularly associated with the Berlin Wall (1961–1989).",
      "explanation_cn": "指冷战时期被分割的城市，象征东西方之间的意识形态冲突，尤其与柏林墙（1961–1989年）相关联。",
      "example_en": "The fall of the Berlin Wall in 1989 marked a turning point in modern European history.",
      "example_cn": "1989年柏林墙的倒塌标志着现代欧洲历史的转折点。"
    },
    {
      "pos": "noun",
      "explanation_en": "A surname or proper noun used in various contexts, such as the Berlin International Film Festival (Berlinale) or the Berlin School of filmmaking.",
      "explanation_cn": "用作姓氏或专有名词，如柏林国际电影节（柏林电影节）或柏林电影学派。",
      "example_en": "She won the Golden Bear at the Berlin Film Festival last year.",
      "example_cn": "她去年在柏林电影节上赢得了金熊奖。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "boston",
      "analysis": "“Boston”（波士顿）是美国马萨诸塞州的首府，以教育、历史和体育文化著称，而“Berlin”是欧洲大陆的政治与文化重镇，两者虽同为重要城市，但柏林承载了更多20世纪的分裂与统一的历史象征，波士顿则更侧重于美国独立与学术传统。"
    },
    {
      "word_to_compare": "paris",
      "analysis": "“Paris”（巴黎）常被视为艺术、时尚与浪漫的象征，而“Berlin”则更强调历史的沉重、现代性与政治变革。巴黎以优雅和文化遗产为主，柏林则以重建、多元与前卫文化为特色。"
    },
    {
      "word_to_compare": "rome",
      "analysis": "“Rome”（罗马）是古罗马帝国的中心，拥有数千年的连续历史与宗教意义，而“Berlin”作为现代国家首都，历史跨度较短但事件密度极高，尤其在20世纪经历了剧烈的政治动荡。两者分别代表古代文明与现代国家的典型。"
    }
  ]
}