{
  "word": "bermuda",
  "pronunciation": "bər·mjuh·də",
  "concise_definition": "n. 百慕大（群岛/三角区）, 百慕大短裤",
  "forms": {
    "adjective": "Bermudan"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A group of islands in the North Atlantic Ocean, officially a British Overseas Territory, known for its pink-sand beaches, warm climate, and historical significance in maritime trade.",
      "explanation_cn": "位于北大西洋的一组岛屿，是英国的海外领地，以其粉红沙滩、温暖气候和在海上贸易中的历史重要性而闻名。",
      "example_en": "Many tourists visit Bermuda for its stunning beaches and crystal-clear waters.",
      "example_cn": "许多游客前往百慕大，欣赏其迷人的海滩和清澈的海水。"
    },
    {
      "pos": "noun",
      "explanation_en": "A short pair of trousers that end above the knee, typically worn in warm weather or as part of formal business attire in some regions.",
      "explanation_cn": "一种长度在膝盖以上的短裤，通常在温暖天气穿着，或在某些地区作为正式商务着装的一部分。",
      "example_en": "He wore a tailored suit with Bermuda shorts and loafers to the summer office party.",
      "example_cn": "他在夏季公司派对上穿着剪裁得体的西装，搭配百慕大短裤和乐福鞋。"
    },
    {
      "pos": "noun",
      "explanation_en": "The Bermuda Triangle, a loosely defined region in the western part of the North Atlantic Ocean, infamous for the alleged mysterious disappearances of ships and aircraft.",
      "explanation_cn": "百慕大三角，位于北大西洋西部的一个大致界定区域，因据称发生的船只和飞机神秘失踪事件而臭名昭著。",
      "example_en": "Legends of the Bermuda Triangle have inspired countless books and movies about supernatural phenomena.",
      "example_cn": "关于百慕大三角的传说激发了无数关于超自然现象的书籍和电影。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "shorts",
      "analysis": "“Shorts”（短裤）是通用词，泛指任何长度在膝盖以上的裤子，而 “Bermuda shorts” 是特指长度在膝盖上方约5-10厘米、通常有褶皱和正式剪裁的短裤，常用于商务或半正式场合，具有特定的风格和文化语境。"
    },
    {
      "word_to_compare": "island",
      "analysis": "“Island”（岛屿）是泛指被水包围的陆地，而 “Bermuda” 是一个专有名词，特指北大西洋中的百慕大群岛，具有明确的地理、政治和文化身份，不能与其他岛屿互换使用。"
    },
    {
      "word_to_compare": "triangle",
      "analysis": "“Triangle”（三角形）是几何形状或泛指三边围成的区域，而 “Bermuda Triangle” 是一个专有地理名称，特指因神秘事件而闻名的海域，其含义包含文化传说和民间迷信，远超其几何定义。"
    }
  ]
}