{
  "word": "bernard",
  "pronunciation": "bərˈnɑːrd",
  "concise_definition": "n. 伯纳德（人名）",
  "forms": {
    "plural": "Bernards"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A masculine given name of French origin, derived from the Germanic elements 'bera' (bear) and 'hard' (brave, hardy), meaning 'brave as a bear'. It is commonly used in English-speaking and European countries.",
      "explanation_cn": "源自日耳曼语元素 'bera'（熊）和 'hard'（勇敢的、坚强的）的男性名字，意为‘如熊般勇敢’，在英语国家和欧洲国家中广泛使用。",
      "example_en": "Bernard Madoff was the financier behind one of the largest Ponzi schemes in history.",
      "example_cn": "伯纳德·麦道夫是历史上最大规模的庞氏骗局背后的金融家。"
    },
    {
      "pos": "noun",
      "explanation_en": "A surname of French or English origin, often associated with individuals in various fields such as politics, arts, or science.",
      "explanation_cn": "一种法语或英语姓氏，常与政治、艺术或科学等领域的人物相关联。",
      "example_en": "The artist Bernard Frize is known for his abstract paintings using industrial techniques.",
      "example_cn": "艺术家伯纳德·弗里兹以使用工业技术创作抽象绘画而闻名。"
    },
    {
      "pos": "noun",
      "explanation_en": "A term sometimes used to refer to a type of large, friendly dog breed, particularly the St. Bernard, named after Saint Bernard of Menthon, who founded a hospice in the Swiss Alps.",
      "explanation_cn": "有时用于指一种体型庞大、性情温顺的犬种，尤其是圣伯纳德犬，该名称源自圣伯纳德·德·门通，他曾在瑞士阿尔卑斯山建立了一座修道院庇护所。",
      "example_en": "The St. Bernard, or 'Bernard', is famous for its rescue missions in snowy mountain regions.",
      "example_cn": "圣伯纳德犬（或称‘伯纳德’）因在积雪的山区执行救援任务而闻名。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "barry",
      "analysis": "“Barry” 是一个与 “Bernard” 同源的英文名字，源自相同的日耳曼语词根，但更常作为独立名字使用，且发音和拼写更简短。它在现代英语中更流行于非正式场合，而 “Bernard” 显得更传统、正式，有时带有老派印象。"
    },
    {
      "word_to_compare": "st. bernard",
      "analysis": "“St. Bernard” 是一个专有名词，特指一种犬种，其名称来源于人名 “Bernard”，但已固化为一个独立的术语。当单独使用 “Bernard” 时，通常指人名；而 “St. Bernard” 则明确指向犬类，语义范围完全不同。"
    },
    {
      "word_to_compare": "bernie",
      "analysis": "“Bernie” 是 “Bernard” 的昵称或口语化形式，常用于非正式语境，带有亲切、随意的语气（如美国政治家 Bernie Sanders）。它在语义上与 “Bernard” 等同，但语用风格更轻松，常用于日常交流，而 “Bernard” 更正式、书面。"
    }
  ]
}