{
  "word": "berth",
  "pronunciation": "bɜːrθ",
  "concise_definition": "n. 船位, 铺位, 职位; v. 为...停泊, 使靠岸",
  "forms": {
    "plural": "berths",
    "third_person_singular": "berths",
    "past_tense": "berthed",
    "past_participle": "berthed",
    "present_participle": "berthing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A designated space or position where a ship can safely dock or moor, typically at a pier, wharf, or harbor.",
      "explanation_cn": "指船舶安全停靠或系泊的指定位置，通常位于码头、船坞或港口。",
      "example_en": "The cruise ship was assigned a new berth at the downtown terminal.",
      "example_cn": "这艘邮轮被分配了市中心码头的一个新船位。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sleeping space on a train, ship, or other vehicle, often a narrow bed that can be folded into the wall or ceiling.",
      "explanation_cn": "指火车、轮船或其他交通工具上的睡眠空间，通常为可折叠至墙壁或天花板的窄床。",
      "example_en": "We booked two lower berths for our overnight train journey.",
      "example_cn": "我们为夜间火车旅程预订了两个下铺。"
    },
    {
      "pos": "noun",
      "explanation_en": "A position or job, especially one that is secure or established, often used in the phrase 'to give someone a berth'.",
      "explanation_cn": "指一个职位或岗位，尤指稳定或已确立的职位，常用于短语 'give someone a berth'（给某人一个位置）。",
      "example_en": "After years of hard work, she finally got a berth in the company's executive team.",
      "example_cn": "经过多年的努力，她终于在公司高管团队中谋得一席之地。"
    },
    {
      "pos": "verb",
      "explanation_en": "To bring a ship into a berth or to dock it safely at a pier or harbor.",
      "explanation_cn": "指将船舶驶入并安全停靠在码头或港口的指定位置。",
      "example_en": "The captain berthed the freighter alongside the loading dock at dawn.",
      "example_cn": "船长在黎明时分将货轮停靠在装卸码头旁。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provide or arrange a sleeping space for someone on a train or ship.",
      "explanation_cn": "指为某人在火车或轮船上安排一个铺位。",
      "example_en": "The cabin attendant berthed the passengers in twin beds before the night voyage.",
      "example_cn": "乘务员在夜间航行前为乘客安排了双层铺位。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "dock",
      "analysis": "“Dock” (码头/停靠) 是一个更通用的词，泛指船舶停靠的设施或动作，可作名词或动词，但不特指具体的停泊位置。而 “berth” 更强调停泊的具体位置或空间，尤其在正式或航海语境中更精确。例如，一艘船可以停靠在码头（dock），但它的具体停泊点是 berth。"
    },
    {
      "word_to_compare": "bed",
      "analysis": "“Bed” (床) 是泛指任何用于睡眠的家具或设施，而 “berth” 特指交通工具（如火车、轮船）上的狭小、可折叠式睡眠空间，具有空间受限和功能集成的特点。在非交通工具语境中，不能用 “berth” 替代 “bed”。"
    },
    {
      "word_to_compare": "position",
      "analysis": "“Position” (位置/职位) 是一个广泛使用的抽象词，可指物理空间或职业角色。而 “berth” 在表示职位时是口语化、非正式的用法，带有‘获得一个机会’或‘占有一席之地’的隐含意味，语义更具体、更具形象性，常用于比喻语境。"
    }
  ]
}