{
  "word": "bethesda",
  "pronunciation": "beth·e·sda",
  "concise_definition": "n. 贝塞斯达（地名/医院名）",
  "forms": {
    "plural": "bethesdas"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to a town in Montgomery County, Maryland, USA, known for its research institutions, including the National Institutes of Health (NIH).",
      "explanation_cn": "专有名词，指美国马里兰州蒙哥马利县的一个城镇，以研究机构闻名，包括美国国立卫生研究院（NIH）。",
      "example_en": "The conference on medical innovation was held in Bethesda, attracting scientists from around the world.",
      "example_cn": "这场关于医学创新的会议在贝塞斯达举行，吸引了来自世界各地的科学家。"
    },
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to the Bethesda Naval Hospital, now known as the Walter Reed National Military Medical Center, a major U.S. military medical facility.",
      "explanation_cn": "专有名词，指贝塞斯达海军医院，现名为沃尔特·里德国家军事医疗中心，是美国主要的军事医疗设施。",
      "example_en": "President Kennedy was taken to Bethesda after his assassination.",
      "example_cn": "肯尼迪总统遇刺后被送往贝塞斯达医院。"
    },
    {
      "pos": "noun",
      "explanation_en": "A biblical reference to the Pool of Bethesda, a healing pool in Jerusalem mentioned in the Gospel of John, where Jesus is said to have cured a paralyzed man.",
      "explanation_cn": "《圣经》中提到的贝塞斯达池，位于耶路撒冷，据《约翰福音》记载，耶稣曾在此治愈一名瘫痪者。",
      "example_en": "The church was built near the ancient site of the Pool of Bethesda, a symbol of divine healing.",
      "example_cn": "这座教堂建在贝塞斯达池的古址附近，象征着神圣的治愈之力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hospital",
      "analysis": "“Hospital”（医院）是一个通用名词，泛指提供医疗服务的机构。而 “Bethesda” 作为专有名词，特指美国马里兰州的特定医疗机构或地点，具有地理和历史唯一性，不能互换使用。"
    },
    {
      "word_to_compare": "Jerusalem",
      "analysis": "“Jerusalem”（耶路撒冷）是另一个具有宗教和历史意义的专有名词，与 “Bethesda” 在《圣经》语境中相关，但前者是城市名，后者是城市中的具体地点（池子）。两者属于不同层级的地理指称。"
    },
    {
      "word_to_compare": "NIH",
      "analysis": "“NIH”（National Institutes of Health）是位于贝塞斯达的机构缩写，是该地的组成部分之一。而 “Bethesda” 是地理名称，包含NIH在内的多个机构和社区。NIH是实体机构，Bethesda是其所在位置。"
    }
  ]
}