{
  "word": "betray",
  "pronunciation": "bi·tray",
  "concise_definition": "v. 背叛, 出卖, 泄露, 暴露",
  "forms": {
    "third_person_singular": "betrays",
    "past_tense": "betrayed",
    "past_participle": "betrayed",
    "present_participle": "betraying"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To break the trust or loyalty of someone, especially by revealing confidential information, acting against their interests, or failing to support them when expected.",
      "explanation_cn": "指违背某人的信任或忠诚，尤其是通过泄露机密信息、损害其利益，或在应予支持时背弃他们。",
      "example_en": "He was accused of betraying his country by selling military secrets to a foreign power.",
      "example_cn": "他因向外国势力出售军事机密而被指控叛国。"
    },
    {
      "pos": "verb",
      "explanation_en": "To unintentionally reveal or expose something, such as a person's true feelings, identity, or intentions, often through behavior or expression.",
      "explanation_cn": "指无意中流露出或暴露某人的真正情感、身份或意图，通常通过行为或表情表现出来。",
      "example_en": "Her nervous smile betrayed her fear of public speaking.",
      "example_cn": "她紧张的微笑暴露了她对公开演讲的恐惧。"
    },
    {
      "pos": "verb",
      "explanation_en": "To deceive or trick someone by pretending to be loyal or friendly while secretly working against them.",
      "explanation_cn": "指假装忠诚或友好，实则暗中损害对方，从而欺骗或玩弄他人。",
      "example_en": "The spy betrayed his allies by feeding false information to the enemy.",
      "example_cn": "这名间谍通过向敌人提供虚假情报，出卖了他的盟友。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "deceive",
      "analysis": "“Deceive” (欺骗) 强调通过虚假信息或伪装使他人相信错误的事物，侧重于制造错觉。而 “betray” 更强调对信任关系的破坏，即使没有主动欺骗，只要背弃了忠诚或保密义务，即构成背叛。"
    },
    {
      "word_to_compare": "reveal",
      "analysis": "“Reveal” (揭示) 是中性词，仅指使隐藏的信息变得可见或可知，不带有道德评判。而 “betray” 在用于信息泄露时，隐含了违反信任或义务的负面含义，带有情感和伦理色彩。"
    },
    {
      "word_to_compare": "abandon",
      "analysis": "“Abandon” (抛弃) 指完全离开或放弃某人或某物，可能出于无奈或决定，不一定涉及信任的破坏。而 “betray” 特指在对方依赖或信任你的前提下，主动或消极地背弃责任，具有更强的道德谴责意味。"
    }
  ]
}