{
  "word": "between",
  "pronunciation": "bi·twēn",
  "concise_definition": "prep. 在…之间, 在…中间",
  "forms": {
    "comparative": "",
    "superlative": ""
  },
  "definitions": [
    {
      "pos": "preposition",
      "explanation_en": "Indicating the position, time, or relationship that separates two or more distinct entities, points, or intervals; used to show connection, distinction, or choice among options.",
      "explanation_cn": "表示两个或多个明确实体、点或区间之间的位置、时间或关系；用于表明事物之间的联系、区别或选择。",
      "example_en": "The book is between the lamp and the clock on the shelf.",
      "example_cn": "这本书放在架子上台灯和钟表之间。"
    },
    {
      "pos": "preposition",
      "explanation_en": "Used to describe a relationship involving mutual interaction or exchange between two parties, often implying cooperation, conflict, or comparison.",
      "explanation_cn": "用于描述两个主体之间的相互互动或交换关系，常暗示合作、冲突或比较。",
      "example_en": "There is a strong rivalry between the two companies.",
      "example_cn": "这两家公司之间存在着激烈的竞争。"
    },
    {
      "pos": "preposition",
      "explanation_en": "Used to indicate a choice or distinction among two or more options, often in the phrase 'between A and B'.",
      "explanation_cn": "用于表示在两个或多个选项之间的选择，常用于短语 'between A and B'。",
      "example_en": "You must decide between staying home or going on the trip.",
      "example_cn": "你必须在待在家里和去旅行之间做出选择。"
    },
    {
      "pos": "preposition",
      "explanation_en": "Used to describe a range or interval that includes values or times lying within two endpoints, often implying inclusiveness.",
      "explanation_cn": "用于描述介于两个端点之间的范围或区间，常暗示包含两端之间的所有值或时间。",
      "example_en": "The meeting is scheduled between 2 and 4 p.m.",
      "example_cn": "会议安排在下午两点到四点之间。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "among",
      "analysis": "“Among” 用于三个或三个以上的事物之间，强调在群体内部的分布或关系，不突出个体间的界限；而 “between” 通常用于两个事物之间，或明确区分的多个事物之间，强调个体间的具体关系。例如：'The treasure was divided among the three pirates'（三者之间平均分配），但 'The agreement was signed between France and Germany'（两国之间的协议）。"
    },
    {
      "word_to_compare": "in",
      "analysis": "“In” 表示某物位于一个封闭或包含性的空间内部，如 'in the room'；而 “between” 强调两个或多个外部实体之间的间隙或分界，不包含在任一实体内部。例如：'The cat is in the box'（猫在盒子里），但 'The cat is between the boxes'（猫在两个盒子之间）。"
    },
    {
      "word_to_compare": "amongst",
      "analysis": "“Amongst” 是 “among” 的英式英语变体，语义和用法完全相同，仅用于更正式或文学语境。而 “between” 在所有英语变体中均通用，且更常用于表达明确的二元或多重对立关系。两者不可互换，因为 “amongst” 不用于两个事物之间。"
    }
  ]
}