{
  "word": "bid",
  "pronunciation": "bɪd",
  "concise_definition": "n. 出价, 竞标; v. 出价, 竞标, 试图, 命令",
  "forms": {
    "third_person_singular": "bids",
    "past_tense": "bid",
    "past_participle": "bid",
    "present_participle": "bidding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An offer of a specific price to buy or obtain something, especially in a competitive setting such as an auction or tender process.",
      "explanation_cn": "指在拍卖或招标等竞争性场合中，为购买或获得某物而提出的特定价格。",
      "example_en": "The construction company submitted the lowest bid for the bridge project.",
      "example_cn": "这家建筑公司为桥梁项目提交了最低的标价。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make an offer of a specific price in order to win a contract, purchase an item, or gain a position, often in a competitive context.",
      "explanation_cn": "指在竞争性环境中提出特定价格，以赢得合同、购买物品或获得职位。",
      "example_en": "Several firms bid for the government contract to build the new airport.",
      "example_cn": "多家公司竞标政府建造新机场的合同。"
    },
    {
      "pos": "verb",
      "explanation_en": "To attempt or try hard to achieve something, often with determination or ambition.",
      "explanation_cn": "指努力争取或试图达成某目标，常带有决心或雄心。",
      "example_en": "She bid for the presidency of the association, but lost the vote.",
      "example_cn": "她竞选协会主席，但投票失利了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To command or order someone to do something, especially in a formal or authoritative tone (archaic or literary usage).",
      "explanation_cn": "指以正式或权威的口吻命令某人做某事（多用于古语或文学语境）。",
      "example_en": "The king bid his servants to prepare the feast.",
      "example_cn": "国王命令他的仆人们准备盛宴。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "offer",
      "analysis": "“Offer”（提议）泛指任何形式的提议，不一定是价格性的，也不一定具有竞争性。例如，提出帮助、建议或条件。而 “bid” 特指在竞争性情境中为获得某物而提出的明确价格或条件，更具经济和博弈性质。"
    },
    {
      "word_to_compare": "tender",
      "analysis": "“Tender”（投标）作为名词时与 “bid” 几乎同义，常用于正式商业或政府采购语境，但 “tender” 更强调程序性、书面性和法律约束力，而 “bid” 更通用，可用于拍卖、体育竞赛甚至比喻性语境。"
    },
    {
      "word_to_compare": "attempt",
      "analysis": "“Attempt”（尝试）泛指任何努力去达成目标，不涉及价格或竞争机制。而 “bid” 在作‘试图’解时，隐含了明确的目标和策略性行动，常用于政治、商业或竞技场景，语义更具体、更富目的性。"
    }
  ]
}