{
  "word": "bids",
  "pronunciation": "bids",
  "concise_definition": "n. 出价, 投标; v. 出价, 投标, 致意",
  "forms": {
    "singular": "bid",
    "third_person_singular": "bids",
    "past_tense": "bid",
    "past_participle": "bid",
    "present_participle": "bidding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An offer made to pay a certain amount of money for something, especially in a competitive setting such as an auction or tender process.",
      "explanation_cn": "指在拍卖或招标等竞争性场合中，为获得某物而提出的特定金额的报价。",
      "example_en": "The construction company submitted the lowest bid for the bridge project.",
      "example_cn": "这家建筑公司为桥梁项目提交了最低的投标价。"
    },
    {
      "pos": "noun",
      "explanation_en": "An attempt or effort to achieve something, often with a specific goal in mind.",
      "explanation_cn": "指为达成某一目标而做出的尝试或努力，常带有明确意图。",
      "example_en": "She made a final bid for peace before the negotiations collapsed.",
      "example_cn": "在谈判破裂前，她做出了最后一次和平努力。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make an offer to pay a specified amount for something, especially in an auction or competitive procurement.",
      "explanation_cn": "指在拍卖或竞争性采购中，提出支付特定金额以获得某物的行为。",
      "example_en": "He bid $500 for the antique vase at the auction.",
      "example_cn": "他在拍卖会上以500美元的价格竞拍了那件古董花瓶。"
    },
    {
      "pos": "verb",
      "explanation_en": "To greet someone with a gesture or expression, such as a nod or wave.",
      "explanation_cn": "指通过点头、挥手等姿态向某人打招呼。",
      "example_en": "She bid him good morning as he passed by her desk.",
      "example_cn": "当他经过她的办公桌时，她向他道了早安。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "offer",
      "analysis": "“Offer”（提议）泛指任何形式的提议，包括非金钱性的建议或条件，如工作机会、帮助等，语义更广；而 “bid” 通常特指在竞争性环境中为获取某物而提出的金钱报价，更具经济和交易语境。"
    },
    {
      "word_to_compare": "tender",
      "analysis": "“Tender”（投标）是正式的商业术语，常用于政府或大型项目采购，强调书面、规范和法律程序；“bid” 更通用，可用于拍卖、体育竞赛或日常语境，形式更灵活。两者在商业语境中可互换，但 “tender” 更正式。"
    },
    {
      "word_to_compare": "greeting",
      "analysis": "“Greeting”（问候）是泛指所有表达欢迎或致意的行为，如说‘你好’、鞠躬等；而 ‘bid’ 作为动词表示致意时，语体更书面或古典，常用于文学或正式语境，如 ‘bid farewell’，带有一定仪式感。"
    }
  ]
}