{
  "word": "big",
  "pronunciation": "big",
  "concise_definition": "adj. 大的, 重要的, 重大的, 年长的",
  "forms": {
    "comparative": "bigger",
    "superlative": "biggest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having a large size, extent, or volume in physical dimensions; referring to something that is notably large compared to others.",
      "explanation_cn": "指在物理尺寸、范围或体积上较大的事物，相对于其他事物而言显著庞大。",
      "example_en": "She lives in a big house near the lake.",
      "example_cn": "她住在湖边一栋大房子里。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Of considerable importance, influence, or significance; describing something that has a major impact or is highly notable.",
      "explanation_cn": "指具有相当重要性、影响力或意义的事物，常用于描述具有重大影响或显著地位的事物。",
      "example_en": "This is a big decision that will affect the future of the company.",
      "example_cn": "这是一个将影响公司未来的重要决定。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used informally to describe someone who is older, more experienced, or holds a higher status, especially in family or organizational contexts.",
      "explanation_cn": "非正式用法，指年龄较大、经验较丰富或地位较高的人，尤其用于家庭或组织语境中。",
      "example_en": "My big brother started college when he was 16.",
      "example_cn": "我哥哥16岁就上大学了。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used to describe something large in scale, intensity, or magnitude, often in abstract or figurative contexts (e.g., a big success, a big mistake).",
      "explanation_cn": "用于描述在规模、强度或程度上巨大的事物，常用于抽象或比喻语境（如巨大的成功、严重的错误）。",
      "example_en": "It was a big mistake to ignore the warning signs.",
      "example_cn": "忽视这些预警信号是一个严重的错误。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "large",
      "analysis": "“Large” 更侧重于客观、中性的尺寸或数量上的“大”，常用于正式语境，如“large population”或“large amount”。而 “big” 更口语化，常带有主观评价色彩，如“big win”或“big problem”，强调重要性或影响而非单纯尺寸。"
    },
    {
      "word_to_compare": "great",
      "analysis": "“Great” 强调质量、程度或重要性上的“伟大”或“卓越”，常用于抽象概念，如“great leader”或“great achievement”。它带有褒义色彩，而 “big” 更中性，可指物理大小或一般重要性，不一定有正面评价。"
    },
    {
      "word_to_compare": "huge",
      "analysis": "“Huge” 是 “big” 的加强形式，表示极端的大，语气更强，常用于强调超出常规的规模，如“a huge crowd”或“a huge mistake”。而 “big” 适用范围更广，语气更温和，可用于日常表达。"
    }
  ]
}