{
  "word": "bin",
  "pronunciation": "bīn",
  "concise_definition": "n. 垃圾箱, 储物箱, 料斗; v. 将...放入箱中",
  "forms": {
    "plural": "bins"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A container, typically made of metal, plastic, or wood, used for storing or disposing of waste, materials, or items, often found in homes, workplaces, or industrial settings.",
      "explanation_cn": "一种由金属、塑料或木材制成的容器，用于储存或丢弃废弃物、材料或物品，常见于家庭、工作场所或工业环境中。",
      "example_en": "Please take the recycling to the blue bin outside.",
      "example_cn": "请把可回收物拿到外面的蓝色垃圾桶里。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large container or hopper used in factories, farms, or warehouses to hold bulk materials such as grain, coal, or plastic pellets.",
      "explanation_cn": "一种用于工厂、农场或仓库中存放散装物料（如谷物、煤炭或塑料颗粒）的大型容器或料斗。",
      "example_en": "The grain bin on the farm holds enough wheat to last through the winter.",
      "example_cn": "农场上的粮仓储存了足够度过整个冬天的小麦。"
    },
    {
      "pos": "noun",
      "explanation_en": "In computing, a storage location or category used to group data, files, or emails for temporary holding or organization.",
      "explanation_cn": "在计算机领域，指用于临时存放或组织数据、文件或电子邮件的存储位置或分类。",
      "example_en": "I accidentally deleted the file, but it’s still in the recycle bin.",
      "example_cn": "我不小心删除了这个文件，但它还在回收站里。"
    },
    {
      "pos": "verb",
      "explanation_en": "To place something into a bin, especially for disposal, storage, or organization.",
      "explanation_cn": "将某物放入箱中，尤指用于丢弃、储存或整理。",
      "example_en": "The warehouse staff bin the defective products before sending them back to the supplier.",
      "example_cn": "仓库员工将有缺陷的产品放入箱中，准备退回供应商。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "trash can",
      "analysis": "“Trash can”（垃圾桶）通常指小型、用于家庭或办公室的废弃物容器，语义更具体且口语化；而 “bin” 是更通用的词，可涵盖从垃圾桶到工业料斗的各种容器，适用范围更广，且在英式英语中更常用。"
    },
    {
      "word_to_compare": "container",
      "analysis": "“Container”（容器）是一个更广泛的上位词，泛指任何用于盛装物品的封闭结构，如集装箱、包装盒等；而 “bin” 特指有开口、常用于分类或临时存放的容器，通常有固定位置，用途更具体。"
    },
    {
      "word_to_compare": "drawer",
      "analysis": "“Drawer”（抽屉）是家具中可拉出的水平存储空间，通常用于存放衣物、文件等整洁物品；而 “bin” 多为开放或半开放的垂直或侧向容器，常用于存放杂乱物品或废弃物，结构和使用场景不同。"
    }
  ]
}