{
  "word": "binge",
  "pronunciation": "bīnj",
  "concise_definition": "n. 暴食, 暴饮; v. 暴食, 暴饮, 沉迷",
  "forms": {
    "third_person_singular": "binges",
    "past_tense": "binged",
    "past_participle": "binged",
    "present_participle": "bingeing",
    "plural": "binges"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A period of excessive and uncontrolled consumption of food, drink, or other substances, often in a short time frame.",
      "explanation_cn": "指在短时间内对食物、饮料或其他物质进行过度且失控的消费。",
      "example_en": "After weeks of dieting, she had a binge on chocolate and ice cream.",
      "example_cn": "经过几周的节食后，她大吃了一顿巧克力和冰淇淋。"
    },
    {
      "pos": "noun",
      "explanation_en": "A prolonged and intense period of engaging in an activity, especially watching television or using digital media, often to the exclusion of other responsibilities.",
      "explanation_cn": "指长时间、高强度地从事某项活动，尤其是连续观看电视节目或使用数字媒体，常忽视其他责任。",
      "example_en": "He spent the weekend on a binge-watching marathon of the entire series.",
      "example_cn": "他整个周末都在连续追完整部剧集。"
    },
    {
      "pos": "verb",
      "explanation_en": "To consume something excessively and uncontrollably, especially food, alcohol, or media content.",
      "explanation_cn": "指过度且失控地消费某物，尤指食物、酒精或媒体内容。",
      "example_en": "They binged on pizza and soda during the movie night.",
      "example_cn": "他们在电影之夜大吃披萨和苏打水。"
    },
    {
      "pos": "verb",
      "explanation_en": "To engage in an activity intensively and continuously over a short period, often to excess.",
      "explanation_cn": "指在短时间内高强度、连续地从事某项活动，常达到过度的程度。",
      "example_en": "She binged on Netflix for three days straight during her vacation.",
      "example_cn": "她在假期里连续三天沉迷于看Netflix。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "overeat",
      "analysis": "“Overeat”（吃得过多）仅指摄入食物超过正常量，语义范围较窄，不涉及其他行为或媒体消费。而 “binge” 不仅可用于饮食，还可用于观看视频、购物、游戏等，强调一种失控的、成瘾性的行为模式。"
    },
    {
      "word_to_compare": "indulge",
      "analysis": "“Indulge”（放纵）通常带有自愿享受、适度纵容的意味，不一定失控或有害，如“indulge in a treat”（犒赏自己）。而 “binge” 隐含过度、缺乏节制甚至自我伤害的负面含义，更强调行为的极端性和非理性。"
    },
    {
      "word_to_compare": "consume",
      "analysis": "“Consume”（消费）是一个中性词，泛指使用或消耗资源（如能源、信息、商品），无程度或情感色彩。而 “binge” 是一种特定类型的消费，强调数量巨大、时间集中、失去控制，具有强烈的行为特征和心理倾向。"
    }
  ]
}