{
  "word": "bipolar",
  "pronunciation": "bī·pōl·ər",
  "concise_definition": "adj. 双极的, 双相的; n. 双相情感障碍患者",
  "forms": {
    "comparative": "more bipolar",
    "superlative": "most bipolar"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characterized by two opposite or contrasting poles, especially in the context of mood swings between mania and depression in mental health.",
      "explanation_cn": "指具有两个对立或相反极点的，尤其在心理健康领域中，指情绪在躁狂与抑郁之间剧烈波动的状态。",
      "example_en": "She was diagnosed with bipolar disorder after experiencing extreme highs and lows in her mood.",
      "example_cn": "她在经历情绪的极端高涨与低落之后，被诊断为双相情感障碍。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing a system, pattern, or structure that has two distinct and opposing components or states.",
      "explanation_cn": "描述一种具有两个截然不同且对立的组成部分或状态的系统、模式或结构。",
      "example_en": "The political landscape in the country is becoming increasingly bipolar, with voters aligning sharply between two major parties.",
      "example_cn": "该国的政治格局正变得越来越两极化，选民明显地划分为两大政党阵营。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who has bipolar disorder; commonly used in informal contexts to refer to someone with this condition.",
      "explanation_cn": "指患有双相情感障碍的人；常用于非正式语境中指代此类患者。",
      "example_en": "He’s open about being a bipolar and advocates for mental health awareness.",
      "example_cn": "他坦诚自己是双相患者，并积极倡导心理健康意识。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "depressive",
      "analysis": "“Depressive”（抑郁的）仅指情绪低落、抑郁的状态，是双相情感障碍中的一个组成部分，但不包含躁狂期。而 “bipolar” 强调的是抑郁与躁狂两种极端状态的交替循环，范围更广、更复杂。"
    },
    {
      "word_to_compare": "unstable",
      "analysis": "“Unstable”（不稳定的）是一个泛化的形容词，可描述情绪、行为或状况的波动，但不特指有规律的两极变化。而 “bipolar” 是一个医学术语，特指在躁狂与抑郁之间周期性切换的病理模式，具有明确的临床定义。"
    },
    {
      "word_to_compare": "schizophrenic",
      "analysis": "“Schizophrenic”（精神分裂的）指一种以幻觉、妄想和思维紊乱为主要特征的精神疾病，与情绪波动无关。虽然两者都属于精神健康障碍，但 “bipolar” 的核心是情绪极性转换，而 “schizophrenic” 的核心是现实感知的扭曲，二者病理机制完全不同。"
    }
  ]
}