{
  "word": "bismarck",
  "pronunciation": "biz·mahrk",
  "concise_definition": "n. 俾斯麦（人名）；俾斯麦式腌鲱鱼；俾斯麦蛋糕",
  "forms": {
    "plural": "bismarcks"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Otto von Bismarck (1815–1898), the Prussian statesman and first Chancellor of the German Empire, known for his realpolitik and role in unifying Germany in 1871.",
      "explanation_cn": "奥托·冯·俾斯麦（1815–1898），普鲁士政治家、德意志帝国首任宰相，以现实政治（Realpolitik）著称，并在1871年主导了德国的统一。",
      "example_en": "Bismarck's diplomatic maneuvers before the Franco-Prussian War were masterful.",
      "example_cn": "俾斯麦在普法战争前的外交手段极为高明。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of pickled herring, typically marinated in vinegar, spices, and onions, popular in Northern European cuisine, named after Otto von Bismarck due to its dark color resembling his beard.",
      "explanation_cn": "一种腌制鲱鱼，通常用醋、香料和洋葱腌制，流行于北欧料理，因颜色深暗似俾斯麦的胡须而得名。",
      "example_en": "We enjoyed bismarcks with rye bread and sour cream for breakfast.",
      "example_cn": "我们早餐吃了配黑麦面包和酸奶油的俾斯麦腌鲱鱼。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of filled pastry, often jelly-filled and topped with powdered sugar or glaze, common in German and American bakeries, also named after Bismarck due to its round, plump shape.",
      "explanation_cn": "一种填充馅料的糕点，通常填有果酱，表面撒糖粉或淋糖霜，常见于德式和美式面包店，因其圆润饱满的外形而以俾斯麦命名。",
      "example_en": "The bakery's bismarcks were the most popular item on the menu.",
      "example_cn": "面包店的俾斯麦蛋糕是菜单上最受欢迎的单品。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "prussian",
      "analysis": "“Prussian”（普鲁士的）是形容词，指与普鲁士王国相关的事物，如军队、制度或文化，而 “Bismarck” 是专有名词，特指历史人物或以其命名的物品。两者相关但不可互换：Bismarck 是普鲁士人，但并非所有普鲁士事物都与他直接相关。"
    },
    {
      "word_to_compare": "herring",
      "analysis": "“Herring”（鲱鱼）是普通鱼类名称，泛指所有鲱鱼种类；而 “bismarck” 是特指一种经过特定腌制方式处理的鲱鱼制品，属于“herring”的子类，带有文化与历史命名背景。"
    },
    {
      "word_to_compare": "donut",
      "analysis": "“Donut”（甜甜圈）是圆形、中空、油炸的甜点，而 “bismarck” 是实心、填充果酱的油炸糕点，外形相似但结构和风味不同。Bismarck 更接近德式“Berliner”，而 donut 通常更甜、有糖霜或巧克力涂层，且无果酱内馅。"
    }
  ]
}