{
  "word": "bitten",
  "pronunciation": "bit·n",
  "concise_definition": "v. (bite 的过去分词) 被咬, 被叮",
  "forms": {
    "base_form": "bite",
    "past_tense": "bit",
    "past_participle": "bitten",
    "present_participle": "biting"
  },
  "definitions": [
    {
      "pos": "verb (past participle)",
      "explanation_en": "The past participle of 'bite', indicating that an action of biting has been completed, typically by an animal, insect, or person, resulting in a wound, sting, or mark.",
      "explanation_cn": "“bite”的过去分词形式，表示某物（如动物、昆虫或人）已经完成了咬的动作，通常导致伤口、叮痕或印记。",
      "example_en": "She had been bitten by a venomous snake while hiking in the woods.",
      "example_cn": "她在森林里徒步时被一条毒蛇咬伤了。"
    },
    {
      "pos": "verb (past participle)",
      "explanation_en": "Used figuratively to describe being affected negatively by a situation, often unexpectedly or painfully, such as being 'bitten by the travel bug' or 'bitten by regret'.",
      "explanation_cn": "用于比喻意义，表示被某种情况负面地影响，通常是意外或痛苦地，如‘被旅行热情感染’或‘被悔恨所折磨’。",
      "example_en": "He was bitten by the entrepreneurial spirit after visiting Silicon Valley.",
      "example_cn": "他在参观硅谷后被创业精神所感染。"
    },
    {
      "pos": "adjective (rare, archaic)",
      "explanation_en": "Used in archaic or poetic contexts to describe something that has been bitten or marked by a bite, often implying damage or contamination.",
      "explanation_cn": "用于古语或诗歌语境中，形容被咬过或留下咬痕的事物，常暗示受损或被污染。",
      "example_en": "The bitten apple lay half-eaten on the stone table.",
      "example_cn": "那只被咬了一口的苹果半躺在石桌上。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bit",
      "analysis": "“Bit” 是 “bite” 的过去式，强调动作发生的瞬间或已完成的事实，常用于叙述性语句中，如 “The dog bit him yesterday.” 而 “bitten” 是过去分词，通常与助动词连用（如 has been bitten），强调动作的结果或对当前状态的影响，更常用于被动语态或完成时态。"
    },
    {
      "word_to_compare": "stung",
      "analysis": "“Stung” 是 “sting” 的过去式/过去分词，特指由昆虫（如蜜蜂、黄蜂）或水母等通过毒刺造成的刺痛伤害，通常伴随毒素注入。而 “bitten” 指的是通过牙齿或颚部的咬合造成的伤害，不必然涉及毒液，范围更广。两者都表示伤害，但机制和来源不同。"
    },
    {
      "word_to_compare": "infected",
      "analysis": "“Infected” 指因病原体（如细菌、病毒）侵入而引发的疾病状态，可能是由咬伤（如被狗咬后感染狂犬病）导致的结果，但本身不是咬的动作。而 “bitten” 仅描述物理接触和创伤行为，不必然包含感染。前者是后果，后者是原因。"
    }
  ]
}