{
  "word": "bitter",
  "pronunciation": "bit·ter",
  "concise_definition": "adj. 苦的, 痛苦的, 仇恨的, 尖刻的",
  "forms": {
    "comparative": "bitterer",
    "superlative": "bitterest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having a sharp, pungent, or unpleasant taste, typically associated with substances like coffee, chocolate, or certain medicines.",
      "explanation_cn": "具有尖锐、刺激或不愉快的味道，通常与咖啡、巧克力或某些药物等物质相关。",
      "example_en": "The medicine had a bitter taste that made me wince.",
      "example_cn": "这种药味道苦涩，让我皱起了眉头。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by intense emotional pain, resentment, or anger, often resulting from disappointment or injustice.",
      "explanation_cn": "充满强烈的情感痛苦、怨恨或愤怒，通常源于失望或不公。",
      "example_en": "She spoke with bitter resentment after being passed over for the promotion.",
      "example_cn": "她因未被提拔而满怀怨恨地说话。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Severe, harsh, or extremely cold in weather conditions.",
      "explanation_cn": "形容天气严寒、刺骨或恶劣。",
      "example_en": "They braved the bitter wind and snow to reach the summit.",
      "example_cn": "他们顶着刺骨的寒风和大雪登上了山顶。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Using harsh, sarcastic, or cutting language; marked by a sharp and hostile tone.",
      "explanation_cn": "语言尖锐、讽刺或刻薄，带有敌意和攻击性的语气。",
      "example_en": "His bitter remarks about his former colleague shocked everyone in the room.",
      "example_cn": "他对前同事的刻薄言论让在场所有人都感到震惊。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sharp",
      "analysis": "“Sharp”（尖锐的）可形容味道、声音或语言，但更侧重于物理上的锋利或听觉上的刺耳，不一定带有情感色彩。而 “bitter” 在形容味道时更强调苦味的持久性和不愉快感，在形容情绪或语言时则带有强烈的负面情感，如怨恨或敌意。"
    },
    {
      "word_to_compare": "harsh",
      "analysis": "“Harsh”（严厉的、粗暴的）常用于描述声音、光线、规则或对待方式，强调缺乏温和或仁慈，但不一定包含苦味或深层的情感创伤。而 “bitter” 更深入地关联着内心的痛苦、长期积怨或情感创伤，语义更沉重。"
    },
    {
      "word_to_compare": "acrid",
      "analysis": "“Acrid”（刺鼻的）通常用于描述气味或烟雾的辛辣刺激感，如烧焦塑料或化学物质的味道，强调的是嗅觉上的不适。而 “bitter” 主要用于味觉，也可用于情绪和语言，适用范围更广，且情感内涵更丰富。"
    }
  ]
}