{
  "word": "black",
  "pronunciation": "blak",
  "concise_definition": "adj. 黑色的, 黑人的, 阴暗的; n. 黑色, 黑人; v. 黑化, 涂黑",
  "forms": {
    "comparative": "blacker",
    "superlative": "blackest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Of the color that absorbs all light; the darkest color, opposite of white.",
      "explanation_cn": "指吸收所有光线的颜色；最暗的颜色，与白色相对。",
      "example_en": "She wore a black dress to the formal dinner.",
      "example_cn": "她穿了一条黑色连衣裙参加正式晚宴。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to people of African descent, especially in the context of racial identity in the United States and other Western countries.",
      "explanation_cn": "指具有非洲血统的人，尤其在美国及其他西方国家的种族身份语境中。",
      "example_en": "Black history month is celebrated in February in the U.S.",
      "example_cn": "在美国，二月是黑人历史月。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by darkness, gloom, or extreme negativity; often used metaphorically to describe mood, events, or outcomes.",
      "explanation_cn": "形容黑暗、阴郁或极度消极的状态；常用于隐喻，描述情绪、事件或结果。",
      "example_en": "It was a black day for the company when the CEO resigned.",
      "example_cn": "当首席执行官辞职时，对公司来说是黑暗的一天。"
    },
    {
      "pos": "noun",
      "explanation_en": "The color black; used to refer to the hue itself or to objects of that color.",
      "explanation_cn": "黑色本身；用于指代这种颜色或呈该颜色的物体。",
      "example_en": "Black is a classic color for formal wear.",
      "example_cn": "黑色是正式服装的经典颜色。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person of African descent; used as a collective or individual term, especially in sociopolitical contexts.",
      "explanation_cn": "指非洲裔人士；在社会政治语境中用作集体或个体称谓。",
      "example_en": "The civil rights movement was led by many Black activists.",
      "example_cn": "民权运动由许多黑人活动家领导。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make something black in color, often by covering or coating it with a dark substance.",
      "explanation_cn": "使某物变黑，通常通过覆盖或涂上深色物质实现。",
      "example_en": "The firefighters blackened the walls with soot.",
      "example_cn": "消防员用烟灰把墙壁熏黑了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "dark",
      "analysis": "“Dark”（暗的）是一个更宽泛的词，指缺乏光线或颜色较深，可涵盖深蓝、深灰、深棕等多种色调，不一定指纯黑色。而 “black” 是具体的颜色名称，指完全吸收光线的绝对黑色。在比喻义上，“dark” 更常用于情绪或道德层面（如 dark thoughts），而 “black” 则带有更强的负面或极端色彩（如 black market）。"
    },
    {
      "word_to_compare": "ebony",
      "analysis": "“Ebony”（乌木色）是“black”的一个文学性或装饰性同义词，特指像乌木这种深黑发亮的木材颜色，带有高贵、精致的语义色彩。它通常用于描述材质或艺术语境，而 “black” 是通用词，适用于日常、科学、社会等所有语境。"
    },
    {
      "word_to_compare": "noir",
      "analysis": "“Noir”（黑色风格）源自法语，专用于艺术、电影和文学领域，指一种阴郁、神秘、道德模糊的风格（如 film noir）。它不是颜色本身，而是一种美学概念。而 “black” 是纯粹的颜色描述，不带有风格或文化内涵，除非在特定语境中被赋予象征意义。"
    }
  ]
}