{
  "word": "blackhawks",
  "pronunciation": "blak·hɔːks",
  "concise_definition": "n. 黑鹰队（美国职业冰球队/空军部队名称）",
  "forms": {
    "singular": "blackhawk"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A professional ice hockey team based in Chicago, Illinois, competing in the National Hockey League (NHL); known for its rich history, multiple Stanley Cup championships, and iconic black-and-gold uniform.",
      "explanation_cn": "位于伊利诺伊州芝加哥的一支职业冰球队，参加国家冰球联盟（NHL）；以悠久的历史、多次赢得斯坦利杯冠军以及标志性的黑金配色球衣而闻名。",
      "example_en": "The Chicago Blackhawks won the Stanley Cup in 2015, their third title in six years.",
      "example_cn": "芝加哥黑鹰队在2015年赢得斯坦利杯，这是他们在六年内第三次夺冠。"
    },
    {
      "pos": "noun",
      "explanation_en": "A nickname for the 160th Special Operations Aviation Regiment (Airborne) of the United States Army, known for its elite helicopter operations in covert missions.",
      "explanation_cn": "美国陆军第160特种作战航空团（空降）的昵称，以执行秘密任务中的精英直升机作战而著称。",
      "example_en": "The Black Hawks conducted a nighttime raid behind enemy lines to rescue hostages.",
      "example_cn": "黑鹰部队在夜间深入敌后执行营救人质任务。"
    },
    {
      "pos": "noun",
      "explanation_en": "A general term referring to any military unit, sports team, or organization that uses the black hawk (a bird of prey) as its symbol, representing strength, agility, and vigilance.",
      "explanation_cn": "泛指任何以黑鹰（一种猛禽）为标志的军事单位、运动队或组织，象征力量、敏捷与警觉。",
      "example_en": "Many Native American tribes revere the black hawk as a spiritual symbol of courage and freedom.",
      "example_cn": "许多美洲原住民部落将黑鹰视为勇气与自由的精神象征。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hawks",
      "analysis": "“Hawks”（鹰）泛指猛禽或象征好战、进取的团体，常用于体育队名（如亚特兰大老鹰队）或政治语境（鹰派）。而 “Blackhawks” 特指以黑色为特征的特定组织，具有更明确的视觉标识和文化归属，如芝加哥黑鹰队或美军第160特种航空团，其名称包含颜色与物种的双重限定。"
    },
    {
      "word_to_compare": "eagles",
      "analysis": "“Eagles”（鹰）在英语中多象征自由、权力与国家精神（如美国国鸟），常用于球队或政府机构名称（如费城老鹰队）。而 “Blackhawks” 虽同为猛禽，但更强调速度、隐蔽与突袭的战术特性，且在军事语境中特指直升机部队，文化意象更偏向战术精准而非国家象征。"
    },
    {
      "word_to_compare": "falcons",
      "analysis": "“Falcons”（游隼）代表速度与精准打击，常用于体育队名（如亚特兰大猎鹰队）或无人机部队代号。与 “Blackhawks” 相比，游隼更强调空中俯冲的高速攻击，而黑鹰则更侧重夜间行动、多用途作战与团队协作，名称中的“black”也暗示了隐蔽性和战术神秘性。"
    }
  ]
}