{
  "word": "blast",
  "pronunciation": "blast",
  "concise_definition": "n. 爆炸, 强风, 狂喜; v. 爆炸, 猛烈抨击, 大声播放",
  "forms": {
    "third_person_singular": "blasts",
    "past_tense": "blast",
    "past_participle": "blast",
    "present_participle": "blasting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sudden, violent explosion of energy, often accompanied by noise and destruction, typically caused by explosives or pressure.",
      "explanation_cn": "指由炸药或压力引发的突然、猛烈的能量释放，常伴随噪音和破坏。",
      "example_en": "The construction crew used a blast to clear the rock formation.",
      "example_cn": "施工队用爆炸来清除岩石结构。"
    },
    {
      "pos": "noun",
      "explanation_en": "A strong, sudden gust of wind or air, often cold or forceful.",
      "explanation_cn": "指突然而强劲的气流，通常指冷风或强风。",
      "example_en": "A blast of icy wind hit us as we opened the door.",
      "example_cn": "我们一开门，一阵刺骨的寒风就扑面而来。"
    },
    {
      "pos": "noun",
      "explanation_en": "An intense period of enjoyment or excitement, often used informally to describe a highly pleasurable experience.",
      "explanation_cn": "指一段强烈而愉快的享受或兴奋时刻，常用于非正式语境中形容极佳的体验。",
      "example_en": "We had a blast at the concert last night!",
      "example_cn": "昨晚的音乐会我们玩得超开心！"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to explode or detonate, especially with explosives.",
      "explanation_cn": "指用炸药使某物爆炸或引爆。",
      "example_en": "The miners blasted through the mountain to create a tunnel.",
      "example_cn": "矿工们炸穿了山体以开凿隧道。"
    },
    {
      "pos": "verb",
      "explanation_en": "To criticize someone or something harshly and publicly, often in a forceful or angry manner.",
      "explanation_cn": "指公开而严厉地批评某人或某事，常带有强烈的情绪或愤怒。",
      "example_en": "The critic blasted the movie for its poor script and acting.",
      "example_cn": "影评人猛烈抨击这部电影的剧本和表演都很差。"
    },
    {
      "pos": "verb",
      "explanation_en": "To play music or sound at a very high volume.",
      "explanation_cn": "指以极高的音量播放音乐或声音。",
      "example_en": "He blasted his favorite rock song while driving to work.",
      "example_cn": "他开车上班时把最爱的摇滚歌曲开到最大音量。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "explosion",
      "analysis": "“Explosion” (爆炸) 是一个中性名词，专指物理性的剧烈能量释放，强调事件本身。而 “blast” 除了指爆炸，还可用于风、声音或情绪的强烈释放，语义更广，且常带主观感受色彩（如‘a blast of fun’）。"
    },
    {
      "word_to_compare": "gust",
      "analysis": "“Gust” (阵风) 专指风的短暂强劲流动，语义较窄且中性，多用于气象描述。而 “blast” 作为风的含义时，语气更强、更具冲击力，常带有情绪或环境的压迫感（如‘a blast of cold air’）。"
    },
    {
      "word_to_compare": "criticize",
      "analysis": "“Criticize” (批评) 是中性或正式的动词，指指出缺点或错误，语气可轻可重。而 “blast” 作为动词时，带有强烈的情感色彩，意味着激烈、公开甚至攻击性的指责，语气远重于 ‘criticize’。"
    }
  ]
}