{
  "word": "blasting",
  "pronunciation": "blas·ting",
  "concise_definition": "n. 爆破, 爆炸; adj. 爆破的, 猛烈的; v. 爆破 (blast 的现在分词)",
  "forms": {
    "base_form": "blast",
    "past_tense": "blasted",
    "past_participle": "blasted",
    "present_participle": "blasting",
    "third_person_singular": "blasts"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act or process of destroying or removing rock, earth, or other materials using explosives, commonly used in mining, construction, or demolition.",
      "explanation_cn": "指使用炸药破坏或移除岩石、土壤或其他材料的行为或过程，常用于采矿、建筑或拆除工程中。",
      "example_en": "The blasting operation cleared the hillside to make way for the new highway.",
      "example_cn": "爆破作业清除了山坡，为新建高速公路腾出空间。"
    },
    {
      "pos": "noun",
      "explanation_en": "A loud, harsh, or intense sound or noise, often sudden and overwhelming.",
      "explanation_cn": "指突然、响亮、刺耳或强烈的噪音，常令人难以忍受。",
      "example_en": "The blasting of the train whistle startled everyone on the platform.",
      "example_cn": "火车汽笛的轰鸣声吓到了站台上所有人。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that is extremely intense, forceful, or critical, often in a figurative sense (e.g., blasting criticism).",
      "explanation_cn": "形容某事物极其强烈、猛烈或具有批判性，常用于比喻意义（如猛烈的批评）。",
      "example_en": "She gave the politician a blasting review in the newspaper.",
      "example_cn": "她在报纸上对这位政客发表了一篇猛烈的批评文章。"
    },
    {
      "pos": "verb",
      "explanation_en": "To destroy or remove something by using explosives; to cause an explosion.",
      "explanation_cn": "指使用炸药摧毁或移除某物；引起爆炸。",
      "example_en": "Workers were blasting through the mountain to build a tunnel.",
      "example_cn": "工人们正在炸穿山体以修建隧道。"
    },
    {
      "pos": "verb",
      "explanation_en": "To speak or shout loudly and harshly, often in anger or criticism.",
      "explanation_cn": "指大声、刺耳地说话或喊叫，常带有愤怒或批评的语气。",
      "example_en": "He was blasting his coworkers for missing the deadline.",
      "example_cn": "他因同事错过截止日期而对他们大加斥责。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "explosion",
      "analysis": "“Explosion” (爆炸) 是一个名词，指爆炸事件本身或其结果，强调瞬间的能量释放和破坏力。而 “blasting” 更侧重于有计划、有目的的爆破行为，常用于工程语境，是人为控制的过程。"
    },
    {
      "word_to_compare": "demolition",
      "analysis": "“Demolition” (拆除) 是一个更广泛的术语，泛指任何拆除建筑物或结构的行为，可以使用机械、人工或爆破方式。而 “blasting” 是实现拆除的一种特定技术手段，特指使用炸药。"
    },
    {
      "word_to_compare": "shouting",
      "analysis": "“Shouting” (喊叫) 指单纯地提高音量说话，通常出于情绪或沟通需要。而 “blasting” 在比喻义中不仅指音量大，还隐含了情绪激烈、言辞尖锐、带有攻击性或批评性的含义，语义更重。"
    }
  ]
}