{
  "word": "blasts",
  "pronunciation": "blahsts",
  "concise_definition": "n. 爆炸, 猛烈的冲击; v. 爆炸, 猛烈地攻击, 狂吹",
  "forms": {
    "singular": "blast",
    "third_person_singular": "blasts",
    "past_tense": "blasted",
    "past_participle": "blasted",
    "present_participle": "blasting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sudden, violent explosion or release of energy, often producing a loud noise and destructive force.",
      "explanation_cn": "指突然而猛烈的爆炸或能量释放，通常伴随巨大的噪音和破坏力。",
      "example_en": "The construction crew used controlled blasts to break through the rock layer.",
      "example_cn": "施工队使用受控爆炸来击碎岩层。"
    },
    {
      "pos": "noun",
      "explanation_en": "A strong, forceful gust of air, wind, or sound, often sudden and intense.",
      "explanation_cn": "指突然而强烈的气流、风或声音的冲击，通常具有猛烈的特性。",
      "example_en": "A blast of cold air hit me as I opened the freezer door.",
      "example_cn": "我打开冷冻柜门时，一股冷风扑面而来。"
    },
    {
      "pos": "noun",
      "explanation_en": "A harsh, critical, or abusive verbal attack, often delivered in a forceful or public manner.",
      "explanation_cn": "指严厉、批评性或辱骂性的言语攻击，通常以强烈或公开的方式进行。",
      "example_en": "The critic's review was a blast at the director's outdated storytelling techniques.",
      "example_cn": "评论家的评论是对导演过时叙事手法的一次猛烈抨击。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause or undergo a violent explosion or detonation.",
      "explanation_cn": "指引起或经历一次猛烈的爆炸或引爆。",
      "example_en": "The old building was blasted to make way for a new shopping center.",
      "example_cn": "为了给新的购物中心腾出空间，这座旧建筑被炸毁了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To play music or produce sound at a very high volume, often in a loud and energetic way.",
      "explanation_cn": "指以极高的音量播放音乐或发出声音，通常充满活力且喧闹。",
      "example_en": "He blasted his favorite rock song while driving to work.",
      "example_cn": "他开车上班时把最爱的摇滚歌曲开到最大音量。"
    },
    {
      "pos": "verb",
      "explanation_en": "To criticize someone or something harshly and publicly.",
      "explanation_cn": "指公开而严厉地批评某人或某事。",
      "example_en": "The newspaper blasted the mayor for ignoring the city's infrastructure problems.",
      "example_cn": "这家报纸严厉批评市长忽视了城市基础设施问题。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "explosion",
      "analysis": "“Explosion” (爆炸) 是一个更中性、更具体的术语，专指物理性能量的突然释放，常用于科学或工程语境。而 “blast” 不仅可指物理爆炸，还可用于比喻性的猛烈攻击或强风，语义范围更广，更具口语化和情感色彩。"
    },
    {
      "word_to_compare": "gust",
      "analysis": "“Gust” (阵风) 专指风的短暂而强烈的流动，语义范围较窄，通常用于气象或自然描述。而 “blast” 在描述风时更强调冲击力和突然性，常带有情绪色彩，如 ‘a blast of cold air’ 比 ‘a gust of cold air’ 更具压迫感。"
    },
    {
      "word_to_compare": "attack",
      "analysis": "“Attack” (攻击) 是一个通用词，可指物理、语言或心理上的任何形式的进攻。而 “blast” 作为动词或名词时，特指一种激烈、喧闹、情绪化的口头或声音攻击，常带有愤怒或批评的语气，语义更具体、更具表现力。"
    }
  ]
}