{
  "word": "blaze",
  "pronunciation": "blayz",
  "concise_definition": "n. 火焰, 烈火; v. 燃烧, 燃烧着前进, 显著地留下痕迹",
  "forms": {
    "third_person_singular": "blazes",
    "past_tense": "blazed",
    "past_participle": "blazed",
    "present_participle": "blazing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A strong, intense fire or a large area of flame, often burning rapidly and visibly.",
      "explanation_cn": "指强烈而猛烈的火焰，或大面积燃烧的火光，通常迅速且明显地燃烧。",
      "example_en": "The forest fire created a massive blaze that could be seen for miles.",
      "example_cn": "森林大火燃起了一场巨大的烈火，数英里外都能看见。"
    },
    {
      "pos": "verb",
      "explanation_en": "To burn with a bright, intense flame, often rapidly and uncontrollably.",
      "explanation_cn": "指以明亮而强烈的火焰燃烧，通常迅速且难以控制。",
      "example_en": "The old barn blazed for hours before the firefighters arrived.",
      "example_cn": "那座旧谷仓燃烧了数小时，直到消防员赶到。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move quickly and energetically, often leaving a visible trail or mark, metaphorically or literally (e.g., blazing a trail).",
      "explanation_cn": "指快速而有力地前进，常比喻性或字面意义上留下显著的痕迹（如开辟道路）。",
      "example_en": "She blazed a new path in women's education in the 19th century.",
      "example_cn": "她在19世纪为女性教育开辟了一条新道路。"
    },
    {
      "pos": "verb",
      "explanation_en": "To mark or display something prominently or conspicuously, especially with bright colors or light.",
      "explanation_cn": "指以醒目或显眼的方式标记或展示某物，尤其使用鲜艳的颜色或光线。",
      "example_en": "The billboard blazed with neon lights advertising the new movie.",
      "example_cn": "广告牌上霓虹灯闪烁，宣传着这部新电影。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "flame",
      "analysis": "“Flame” (火焰) 是指燃烧时产生的可见的气体部分，是“blaze”的组成部分，但更具体、更微观。它强调燃烧的物理形态，而 “blaze” 更强调整体的火势、规模和视觉冲击力，常用于描述大规模或激烈的燃烧。"
    },
    {
      "word_to_compare": "burn",
      "analysis": "“Burn” (燃烧) 是一个更通用的动词，泛指任何因热或化学反应而受损或燃烧的过程，可以是缓慢的、轻微的或无光的。而 “blaze” 特指明亮、猛烈、可见的燃烧，具有更强的动态感和视觉表现力。"
    },
    {
      "word_to_compare": "spark",
      "analysis": "“Spark” (火花) 是燃烧的微小起始点，通常短暂、微弱，是引发火焰的前兆。而 “blaze” 是燃烧的高潮状态，规模大、持续久，两者在强度和规模上形成鲜明对比。"
    },
    {
      "word_to_compare": "trail",
      "analysis": "“Trail” (痕迹/小径) 通常指缓慢或自然留下的路径，如动物足迹或落叶痕迹。而 “blaze” 作为动词时，特指主动、迅速、有力地开辟路径，常带有开创性、突破性的含义，如 “blaze a trail”，强调主动性和影响力。"
    }
  ]
}