{
  "word": "blazer",
  "pronunciation": "blay·zur",
  "concise_definition": "n. 休闲西装上衣, 运动夹克, 火车/船上的制服上衣",
  "forms": {
    "plural": "blazers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A tailored jacket, typically made of wool or a similar fabric, worn as part of a suit or as a standalone garment, often featuring metal buttons and a structured fit; commonly associated with formal or semi-formal business or school attire.",
      "explanation_cn": "一种剪裁合体的夹克，通常由羊毛或类似面料制成，可作为西装的一部分或单独穿着，常带有金属纽扣和结构化剪裁，多与正式或半正式的商务或校服搭配。",
      "example_en": "He wore a navy blazer with khaki pants to the office meeting.",
      "example_cn": "他穿着一件藏蓝色休闲西装上衣，搭配卡其裤参加办公室会议。"
    },
    {
      "pos": "noun",
      "explanation_en": "A brightly colored jacket, often with a school or club emblem, worn by members of sports teams or organizations to signify affiliation or achievement.",
      "explanation_cn": "一种颜色鲜艳的夹克，通常印有学校或俱乐部徽章，由运动队或组织成员穿着，以表明其成员身份或成就。",
      "example_en": "The rowing team proudly wore their red and gold blazers at the championship.",
      "example_cn": "赛艇队在锦标赛上自豪地穿着他们红金相间的队服夹克。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of uniform jacket historically worn by crew members on trains or ships, often distinguished by its bold color and distinctive buttons.",
      "explanation_cn": "历史上火车或轮船乘务员所穿的一种制服上衣，通常以醒目的颜色和独特的纽扣为特征。",
      "example_en": "The train conductor in his classic black-and-gold blazer greeted passengers at the platform.",
      "example_cn": "列车员穿着经典的黑金相间制服上衣，在站台上迎接乘客。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "jacket",
      "analysis": "“Jacket”（夹克）是一个泛指词，涵盖所有类型的上衣，包括运动夹克、风衣、牛仔夹克等，无特定风格或场合限制。而 “blazer” 是一种特定类型的夹克，具有更正式、剪裁更精良、常带金属纽扣和鲜明颜色的特点，多用于商务、学校或团体场合。"
    },
    {
      "word_to_compare": "suit jacket",
      "analysis": "“Suit jacket”（西装上衣）是西装套装的一部分，通常与同面料、同颜色的裤子搭配穿着，强调整体协调性。而 “blazer” 虽然外观类似，但通常不与裤子配套，可与不同颜色或材质的下装混搭，风格更休闲、灵活。"
    },
    {
      "word_to_compare": "sports coat",
      "analysis": "“Sports coat”（运动夹克）通常指图案更丰富（如格子、条纹）、面料更轻便、剪裁更宽松的休闲夹克，强调舒适与个性。而 “blazer” 更注重剪裁的挺括与正式感，颜色多为单色（如深蓝、黑色），纽扣也更正式，常用于半正式场合。"
    }
  ]
}