{
  "word": "blight",
  "pronunciation": "blahyt",
  "concise_definition": "n. 萎蔫病, 灾祸, 毁灭; v. 使枯萎, 使遭受破坏",
  "forms": {
    "third_person_singular": "blights",
    "past_tense": "blighted",
    "past_participle": "blighted",
    "present_participle": "blighting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A plant disease caused by fungi, bacteria, or environmental factors that leads to the withering, discoloration, or death of plant tissues, often spreading rapidly and destroying crops.",
      "explanation_cn": "由真菌、细菌或环境因素引起的植物病害，导致植物组织枯萎、变色或死亡，常迅速蔓延并摧毁农作物。",
      "example_en": "The potato blight of the 1840s caused widespread famine in Ireland.",
      "example_cn": "19世纪40年代的马铃薯晚疫病导致爱尔兰大面积饥荒。"
    },
    {
      "pos": "noun",
      "explanation_en": "A destructive influence or factor that prevents growth, progress, or prosperity, often used metaphorically to describe social or economic decay.",
      "explanation_cn": "一种阻碍生长、进步或繁荣的破坏性因素，常用于隐喻性地描述社会或经济的衰退。",
      "example_en": "Urban decay and crime have been a blight on the city for decades.",
      "example_cn": "城市衰败和犯罪几十年来一直是这座城市的毒瘤。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a plant to wither or die, typically due to disease or adverse environmental conditions.",
      "explanation_cn": "因疾病或不利环境条件导致植物枯萎或死亡。",
      "example_en": "The unseasonable frost blighted the entire orchard.",
      "example_cn": "反常的霜冻使整个果园的果树枯萎了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To damage or spoil something severely, especially by causing stagnation, decay, or loss of vitality.",
      "explanation_cn": "严重损害或毁坏某物，尤其通过导致停滞、衰败或活力丧失。",
      "example_en": "Corruption has blighted the country's economic potential.",
      "example_cn": "腐败已严重破坏了该国的经济潜力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "disease",
      "analysis": "“Disease” (疾病) 是一个广义词，泛指任何生物体的病理状态，可应用于人、动物或植物，但不特指植物的快速毁灭性病害。而 “blight” 专指植物的毁灭性病害，或引申为社会性灾难，语义更具体、更具破坏性。"
    },
    {
      "word_to_compare": "decay",
      "analysis": "“Decay” (腐烂/衰败) 强调缓慢的、渐进的退化过程，如物质的分解或道德的堕落。而 “blight” 更强调突然的、剧烈的破坏，常带有灾难性或不可逆的后果，尤其在农业或城市语境中更具冲击力。"
    },
    {
      "word_to_compare": "plague",
      "analysis": "“Plague” (瘟疫/灾祸) 通常指大规模流行性疾病或天灾，常带有宗教或历史的沉重感（如黑死病）。而 “blight” 更侧重于对生长和繁荣的抑制，既可以是自然的（植物病害），也可以是社会的（如贫困），语义范围更广但破坏性略弱于 “plague”。"
    }
  ]
}