{
  "word": "blinking",
  "pronunciation": "bling·kɪŋ",
  "concise_definition": "adj. 闪烁的, 眨眼的; v. 眨眼, 闪烁 (blink 的现在分词)",
  "forms": {
    "base_form": "blink",
    "third_person_singular": "blinks",
    "past_tense": "blinked",
    "past_participle": "blinked",
    "present_participle": "blinking"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing a light or signal that turns on and off rapidly in a regular or irregular pattern, often to attract attention or indicate status.",
      "explanation_cn": "形容灯光或信号以快速、有规律或无规律的方式明灭，通常用于吸引注意或指示状态。",
      "example_en": "The blinking red light warned drivers that the crossing was active.",
      "example_cn": "闪烁的红灯警告司机道口正在使用中。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characterized by the rapid closing and opening of the eyelids, often involuntarily or as a reaction to light or emotion.",
      "explanation_cn": "与快速闭合和睁开眼睑有关，通常是无意识的，或对光线、情绪的反应。",
      "example_en": "She gave him a blinking smile, unsure whether to believe him.",
      "example_cn": "她眨了眨眼，露出一丝微笑，不确定是否该相信他。"
    },
    {
      "pos": "verb",
      "explanation_en": "To close and open the eyes rapidly and repeatedly, typically involuntarily or as a reflex.",
      "explanation_cn": "快速而重复地闭合和睁开眼睛，通常是无意识的或作为反射动作。",
      "example_en": "He kept blinking to clear the dust from his eyes.",
      "example_cn": "他不断眨眼，想把眼睛里的灰尘弄出去。"
    },
    {
      "pos": "verb",
      "explanation_en": "To emit light in short, intermittent flashes, as a signal or due to malfunction.",
      "explanation_cn": "以短促、间歇的闪光方式发光，作为信号或因故障所致。",
      "example_en": "The dashboard indicator was blinking to signal a low fuel level.",
      "example_cn": "仪表盘上的指示灯闪烁，提示燃油不足。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "flickering",
      "analysis": "“Flickering” (摇曳闪烁) 通常指光线不稳定、微弱、不规则地明灭，常带有衰弱、即将熄灭的意味，如烛光或老旧灯泡。而 “blinking” 更强调有节奏、有目的的明灭，如交通灯或电子设备的提示灯，更具规律性和功能性。"
    },
    {
      "word_to_compare": "flashing",
      "analysis": "“Flashing” (闪亮/闪现) 指光线或信号以明亮、突然、短暂的方式亮起，通常持续时间极短且强度高，用于紧急警示（如警报灯）。而 “blinking” 是重复性的、周期性的明灭，节奏较慢，多用于状态提示而非紧急警告。"
    },
    {
      "word_to_compare": "winking",
      "analysis": "“Winking” (眨眼示意) 是特指有意识地闭合一只眼睛，通常用于传递秘密信息、幽默或暗示，具有社交意图。而 “blinking” 是更中性的生理行为，可以是无意识的，不带有特定语义。"
    }
  ]
}