{
  "word": "blinding",
  "pronunciation": "blayn·ding",
  "concise_definition": "adj. 令人目眩的, 极度的, 眼花缭乱的",
  "forms": {
    "positive": "blind",
    "comparative": "blinder",
    "superlative": "blindest",
    "adverb": "blindingly"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "So bright or intense that it temporarily impairs or overwhelms vision, often used literally to describe light or figuratively to describe overwhelming intensity.",
      "explanation_cn": "光线或强度如此强烈，以至于暂时使人视力受损或无法承受；常用于字面意义描述强光，也可用于比喻意义形容极度强烈的感受。",
      "example_en": "The sun's reflection off the snow was blinding, forcing us to wear sunglasses.",
      "example_cn": "阳光在雪地上的反射刺得人睁不开眼，我们不得不戴上太阳镜。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used figuratively to describe something that is extremely intense, overwhelming, or astonishing in its degree — often implying an inability to see clearly due to emotion, bias, or power.",
      "explanation_cn": "用于比喻意义，形容某种事物在程度上极其强烈、令人震惊或压倒性，常暗示因情绪、偏见或权力而无法客观看待事物。",
      "example_en": "Her blinding anger made her say things she later regretted.",
      "example_cn": "她怒火中烧，说出了后来后悔的话。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that is exceptionally brilliant, skillful, or impressive — often used to praise performance or achievement.",
      "explanation_cn": "形容某事物极其出色、精湛或令人印象深刻，常用于赞美表现或成就。",
      "example_en": "He made a blindingly fast sprint to the finish line, leaving the competition behind.",
      "example_cn": "他以令人眼花缭乱的高速冲刺冲过终点线，把对手远远甩在身后。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "dazzling",
      "analysis": "“Dazzling” (耀眼的) 通常用于形容美丽、光彩夺目的视觉效果，带有积极、令人赞叹的色彩，如珠宝、晚礼服或表演。而 “blinding” 更强调强度带来的不适或干扰，甚至带有负面含义，如强光导致暂时失明。"
    },
    {
      "word_to_compare": "overwhelming",
      "analysis": "“Overwhelming” (压倒性的) 是一个更广泛的形容词，可形容情感、压力、数量等，强调难以承受的强度，但不特指视觉。而 “blinding” 通常保留视觉隐喻，即使用于比喻，也常暗示因‘太亮’而看不见真相，更具形象性。"
    },
    {
      "word_to_compare": "brilliant",
      "analysis": "“Brilliant” (卓越的) 主要用于形容智力、才华或表现的杰出，是纯粹的褒义词，不包含任何感官不适的含义。而 “blinding” 在形容出色时，隐含了‘令人目眩’的冲击感，语气更强烈、更生动，有时甚至带点夸张。"
    }
  ]
}