{
  "word": "blind",
  "pronunciation": "blaynd",
  "concise_definition": "adj. 瞎的, 盲目的; n. 窗帘, 遮光板; v. 使失明, 使盲目",
  "forms": {
    "comparative": "blinder",
    "superlative": "blindest",
    "third_person_singular": "blinds",
    "past_tense": "blinded",
    "past_participle": "blinded",
    "present_participle": "blinding"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Unable to see due to physical impairment or loss of vision; lacking the ability to perceive visual information.",
      "explanation_cn": "因生理损伤或视力丧失而无法看见；缺乏感知视觉信息的能力。",
      "example_en": "She has been blind since birth.",
      "example_cn": "她自出生起就失明了。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Not able to perceive or recognize something clearly, often due to prejudice, emotion, or lack of awareness; acting without rational judgment.",
      "explanation_cn": "因偏见、情绪或缺乏意识而无法清晰认知某事物；行为缺乏理性判断。",
      "example_en": "His loyalty to the team made him blind to their flaws.",
      "example_cn": "他对球队的忠诚使他忽视了他们的缺点。"
    },
    {
      "pos": "noun",
      "explanation_en": "A covering, typically made of fabric or slats, installed over a window to block light or provide privacy.",
      "explanation_cn": "安装在窗户上用于遮挡光线或保护隐私的覆盖物，通常由布料或百叶板制成。",
      "example_en": "She pulled the blind shut to block out the morning sun.",
      "example_cn": "她拉上窗帘以挡住早晨的阳光。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause someone to lose their sight, either physically or metaphorically, by overwhelming them with light, emotion, or misinformation.",
      "explanation_cn": "使某人失去视力，无论是通过强烈的光线、情绪冲击，还是通过误导信息使其失去判断力。",
      "example_en": "The bright headlights blinded the driver for several seconds.",
      "example_cn": "刺眼的车灯使司机几秒钟内看不见路。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sightless",
      "analysis": "“Sightless”（无视力的）是“blind”的同义词，但更正式、更中性，仅指生理上的视觉缺失，不包含“盲目”或“非理性”的隐喻含义。而 “blind” 既可用于生理描述，也可用于比喻语境，语义范围更广。"
    },
    {
      "word_to_compare": "ignorant",
      "analysis": "“Ignorant”（无知的）指缺乏知识或信息，但不必然意味着拒绝或无法认知；而 “blind” 在比喻用法中强调主动或被动的“视而不见”，常带有情感偏见或刻意回避的意味，语义更强烈。"
    },
    {
      "word_to_compare": "curtain",
      "analysis": "“Curtain”（窗帘）是“blind”的近义词，但更泛指悬挂式布帘，常用于装饰或遮挡，不一定具备遮光功能；而 “blind” 特指可调节的、用于控制光线和隐私的窗饰，结构更具体（如百叶窗、卷帘）。"
    }
  ]
}