{
  "word": "blitz",
  "pronunciation": "blits",
  "concise_definition": "n. 突袭, 猛攻; v. 突袭, 猛攻, 大规模宣传",
  "forms": {
    "third_person_singular": "blitzes",
    "past_tense": "blitzed",
    "past_participle": "blitzed",
    "present_participle": "blitzing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sudden, intense, and overwhelming attack, especially in military contexts, designed to achieve rapid victory through speed and force.",
      "explanation_cn": "指一种突然、猛烈且压倒性的攻击，尤其在军事语境中，旨在通过速度和力量迅速取得胜利。",
      "example_en": "The German army launched a blitz on Poland in 1939, using fast-moving tanks and air power.",
      "example_cn": "1939年，德军对波兰发动了闪电战，使用快速移动的坦克和空中力量。"
    },
    {
      "pos": "noun",
      "explanation_en": "A concentrated and intense campaign or effort, often in politics, advertising, or sports, aimed at achieving a specific goal in a short time.",
      "explanation_cn": "指在政治、广告或体育等领域中，为在短时间内实现特定目标而发起的集中而猛烈的行动。",
      "example_en": "The candidate ran a blitz of TV ads in the final week before the election.",
      "example_cn": "这位候选人在选举前的最后一周发起了密集的电视广告攻势。"
    },
    {
      "pos": "verb",
      "explanation_en": "To attack or overwhelm someone or something with sudden, intense force or activity.",
      "explanation_cn": "指以突然而猛烈的行动或力量攻击或压倒某人或某事物。",
      "example_en": "The defense team blitzed the quarterback, sacking him before he could throw the ball.",
      "example_cn": "防守方对四分卫发动突袭，在他传球前就将他擒杀。"
    },
    {
      "pos": "verb",
      "explanation_en": "To promote or publicize something intensively and rapidly, often through mass media.",
      "explanation_cn": "指通过大众媒体对某事物进行密集而迅速的宣传或推广。",
      "example_en": "The studio is blitzing the market with trailers and posters for the new superhero movie.",
      "example_cn": "制片公司正通过大量预告片和海报对这部新超级英雄电影进行大规模宣传。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "raid",
      "analysis": "“Raid”（突袭）通常指一次短暂、目标明确的小规模袭击，常用于军事或执法行动，强调突然性和目标性，但规模和破坏力通常小于 “blitz”。而 “blitz” 更强调全面、高强度、持续性的压倒性攻击，常涉及多个维度（如空中、地面、宣传）。"
    },
    {
      "word_to_compare": "onslaught",
      "analysis": "“Onslaught”（猛攻）与 “blitz” 非常接近，都表示猛烈的攻击，但 “onslaught” 更侧重于攻击的持续性和压倒性，常用于描述自然力量（如风暴）或抽象概念（如批评的浪潮），而 “blitz” 更具战术性和人为策划的特征，尤其在军事和营销语境中更常用。"
    },
    {
      "word_to_compare": "campaign",
      "analysis": "“Campaign”（运动/战役）是一个更广泛、更长期的计划性行动，可能包含多个阶段和策略，如选举campaign或环保campaign。而 “blitz” 是其短期、高强度的子集，强调集中爆发而非持续运作。一个campaign可能包含一个blitz，但blitz本身不构成完整campaign。"
    }
  ]
}