{
  "word": "blocking",
  "pronunciation": "bloh·king",
  "concise_definition": "n. 阻挡, 阻塞; adj. 阻挡的, 阻塞的",
  "forms": {
    "base_form": "block",
    "present_participle": "blocking",
    "past_tense": "blocked",
    "past_participle": "blocked"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An act or instance of obstructing or preventing movement, progress, or access; often used in sports, traffic, or communication contexts.",
      "explanation_cn": "指阻碍、阻止移动、进展或进入的行为或实例；常用于体育、交通或通信语境中。",
      "example_en": "The defender made a perfect blocking move to stop the opponent's shot.",
      "example_cn": "防守球员做出一次完美的阻挡动作，阻止了对手的投篮。"
    },
    {
      "pos": "noun",
      "explanation_en": "A technique in theater or film where actors position themselves to hide or reveal elements of the scene for dramatic effect.",
      "explanation_cn": "指在戏剧或电影中，演员通过站位来隐藏或揭示场景中的某些元素，以达到戏剧效果的技术。",
      "example_en": "The director used careful blocking to ensure the audience focused on the main character during the monologue.",
      "example_cn": "导演通过精心设计的站位，确保观众在独白时聚焦于主角。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that obstructs, hinders, or prevents passage, communication, or function.",
      "explanation_cn": "形容某物具有阻碍、妨碍或阻止通行、沟通或功能的特性。",
      "example_en": "The blocking signal from the tall building interfered with the Wi-Fi connection.",
      "example_cn": "高楼上发出的阻挡信号干扰了无线网络连接。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "obstruction",
      "analysis": "“Obstruction” (阻碍) 是一个更正式、更广泛的名词，泛指任何形式的阻碍行为或障碍物，常用于法律、政治或工程语境。而 “blocking” 更强调动作本身或具体实施的阻挡行为，更具动态性和场景性，如体育中的阻挡动作。"
    },
    {
      "word_to_compare": "barrier",
      "analysis": "“Barrier” (障碍物) 指物理或抽象的、静态的阻碍结构，如围墙、语言障碍等，强调其作为“存在物”的属性。而 “blocking” 是一个动作或过程，强调“正在阻挡”或“阻挡的行为”，更具动态性。"
    },
    {
      "word_to_compare": "interference",
      "analysis": "“Interference” (干扰) 多用于通信、电子或社会互动中，指外来因素对正常过程的扰乱，常为非物理性。而 “blocking” 更直接地指物理或策略性地完全阻止某物通过或发生，程度更强、更彻底。"
    }
  ]
}