{
  "word": "blockbuster",
  "pronunciation": "blok·bass·tər",
  "concise_definition": "n. 大获成功的电影/作品, 巨大的成功; adj. 极其成功的, 爆款的",
  "forms": {
    "plural": "blockbusters"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A movie, book, play, or other entertainment product that achieves extraordinary commercial success and widespread popularity, often generating high box office revenue or cultural impact.",
      "explanation_cn": "指一部电影、书籍、戏剧或其他娱乐作品，取得了非凡的商业成功和广泛的流行度，通常能带来极高的票房收入或巨大的文化影响力。",
      "example_en": "Avatar was a blockbuster that broke box office records worldwide.",
      "example_cn": "《阿凡达》是一部打破全球票房纪录的爆款电影。"
    },
    {
      "pos": "noun",
      "explanation_en": "Originally, a large bomb capable of destroying an entire city block; the term later evolved metaphorically to describe anything with massive impact.",
      "explanation_cn": "最初指一种能摧毁整个街区的大型炸弹；该词后来被隐喻性地用于形容任何具有巨大影响力的事物。",
      "example_en": "The term 'blockbuster' originated from World War II aerial bombs that could level entire city blocks.",
      "example_cn": "“爆款”一词起源于二战期间能夷平整个街区的航空炸弹。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that is extremely successful, popular, or impactful, especially in entertainment or business contexts.",
      "explanation_cn": "形容某事物在娱乐或商业领域中极其成功、广受欢迎或影响深远。",
      "example_en": "The new smartphone is a blockbuster hit, selling millions in its first week.",
      "example_cn": "这款新智能手机大获成功，首周就售出了数百万部。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hit",
      "analysis": "“Hit”（热门作品）泛指任何受欢迎的作品，可以是轻微或中等程度的成功，如一首流行歌曲或一部小成本电影。而 “blockbuster” 强调的是现象级、大规模的商业成功，通常伴随高预算、高票房和广泛的社会关注，程度远超普通 “hit”。"
    },
    {
      "word_to_compare": "success",
      "analysis": "“Success”（成功）是一个通用词，可指任何领域的成就，从个人目标达成到企业盈利，语义宽泛。而 “blockbuster” 是一个高度特化的词，专用于描述娱乐或文化产品中达到顶峰的商业成功，具有鲜明的行业语境和大众传播色彩。"
    },
    {
      "word_to_compare": "phenomenon",
      "analysis": "“Phenomenon”（现象）强调某事物引发广泛社会关注或讨论，可能因其独特性、争议性或文化意义，不必然与商业收益挂钩。而 “blockbuster” 必须包含显著的经济回报和市场表现，是商业成功与文化影响的双重体现。"
    }
  ]
}