{
  "word": "block",
  "pronunciation": "blahk",
  "concise_definition": "n. 块, 阻碍, 街区; v. 阻止, 阻塞, 封锁",
  "forms": {
    "third_person_singular": "blocks",
    "past_tense": "blocked",
    "past_participle": "blocked",
    "present_participle": "blocking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A solid piece of material, typically with a rectangular or cuboid shape, used in construction, games, or as a physical unit.",
      "explanation_cn": "指一块固体材料，通常呈长方体或立方体形状，用于建筑、游戏或作为物理单位。",
      "example_en": "The children built a tower out of wooden blocks.",
      "example_cn": "孩子们用木块搭了一座塔。"
    },
    {
      "pos": "noun",
      "explanation_en": "An obstruction or impediment that prevents movement, progress, or communication.",
      "explanation_cn": "指阻碍移动、进展或交流的障碍物或障碍。",
      "example_en": "Language barriers can be a major block to international cooperation.",
      "example_cn": "语言障碍可能是国际合作的主要障碍。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of buildings surrounded by streets, especially in urban areas; a city block.",
      "explanation_cn": "指被街道环绕的一组建筑物，尤指城市中的街区。",
      "example_en": "We live on the same block as the post office.",
      "example_cn": "我们住在邮局同一街区。"
    },
    {
      "pos": "verb",
      "explanation_en": "To prevent something from moving, passing, or progressing by placing an obstacle in its way.",
      "explanation_cn": "通过在某物路径上设置障碍物来阻止其移动、通过或进展。",
      "example_en": "The fallen tree blocked the road completely.",
      "example_cn": "倒下的树完全堵住了道路。"
    },
    {
      "pos": "verb",
      "explanation_en": "To prevent the occurrence, success, or effectiveness of something, often intentionally.",
      "explanation_cn": "指有意阻止某事的发生、成功或有效性。",
      "example_en": "The committee blocked the proposed legislation.",
      "example_cn": "委员会否决了这项拟议的立法。"
    },
    {
      "pos": "verb",
      "explanation_en": "To prevent someone from seeing or accessing information, especially on social media or digital platforms.",
      "explanation_cn": "指在社交媒体或数字平台上阻止某人查看或访问信息。",
      "example_en": "She blocked him after he sent her harassing messages.",
      "example_cn": "他在给她发送骚扰信息后，她把他拉黑了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "obstacle",
      "analysis": "“Obstacle” (障碍) 通常指阻碍前进的外部困难，多用于抽象语境（如障碍、挑战），强调需要克服的困难。而 “block” 更强调物理或直接的阻挡，既可以是实体的（如堵路），也可以是抽象的（如阻挠决策），语义范围更广。"
    },
    {
      "word_to_compare": "barrier",
      "analysis": "“Barrier” (屏障) 常指分隔两个区域或群体的界限，具有隔离或防御性质，如语言屏障、心理屏障。它更强调“分隔”功能，而 “block” 更强调“阻止通行或进展”的动作或结果。"
    },
    {
      "word_to_compare": "hindrance",
      "analysis": "“Hindrance” (妨碍) 指使事情变得困难或缓慢的干扰因素，语气较温和，常用于正式语境。它不一定是完全阻止，而 “block” 更倾向于彻底中断或完全禁止，语气更强、更直接。"
    }
  ]
}