{
  "word": "blonde",
  "pronunciation": "blahnd",
  "concise_definition": "n. 金发女郎, 金发的人; adj. 金发的",
  "forms": {
    "plural": "blondes",
    "masculine_form": "blond"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A woman with naturally light-colored hair, typically yellow or golden; sometimes used more broadly to refer to any person with light hair, though traditionally gender-specific.",
      "explanation_cn": "指头发天然呈浅色（通常为黄色或金色）的女性；有时泛指任何发色浅的人，但传统上特指女性。",
      "example_en": "The movie featured a glamorous blonde as the leading actress.",
      "example_cn": "这部电影的女主角是一位魅力四射的金发女郎。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person (often stereotypically) perceived as having light hair and associated with certain cultural traits, such as being naive or glamorous, though these associations are often outdated or reductive.",
      "explanation_cn": "指（常带有刻板印象）拥有浅色头发并被赋予某种文化特质（如天真或魅力）的人，尽管这些联想往往过时或过于简化。",
      "example_en": "He fell for the classic blonde stereotype — charming but clueless.",
      "example_cn": "他陷入了经典的金发女郎刻板印象：迷人但糊涂。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Having hair that is pale yellow or golden in color; used to describe the natural or dyed hair color of a person.",
      "explanation_cn": "指头发呈淡黄色或金色的；用于描述人的自然或染过的发色。",
      "example_en": "She wore a blonde wig to transform her appearance for the role.",
      "example_cn": "她戴上了一顶金色假发，以改变自己在角色中的形象。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fair",
      "analysis": "“Fair”（肤色浅的/金发的）通常用于描述肤色或发色都较浅的人，语义范围更广，可涵盖皮肤、头发甚至眼睛的颜色，且常带有文学或古典色彩。而 “blonde” 专指发色，更具体、更现代，且常与女性形象关联。"
    },
    {
      "word_to_compare": "platinum",
      "analysis": "“Platinum”（铂金色）是 “blonde” 的一种极端形式，指极浅、近乎白色的金发，常用于强调发色的明亮或人工染发效果。它是一种子类，比 “blonde” 更具体、更具视觉冲击力，常用于时尚语境。"
    },
    {
      "word_to_compare": "redhead",
      "analysis": "“Redhead”（红发者）与 “blonde” 形成鲜明对比，指头发呈红色或铜色的人。两者都是基于发色的分类，但 “redhead” 常与热情、易怒或独特的个性联系，而 “blonde” 则常与天真、优雅或性感相关，反映出不同的文化刻板印象。"
    }
  ]
}