{
  "word": "blood",
  "pronunciation": "bluhd",
  "concise_definition": "n. 血液, 血统, 热情; v. 使流血",
  "forms": {
    "plural": "bloods"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The red fluid that circulates in the arteries and veins of humans and other animals, carrying oxygen and nutrients to cells and removing waste products.",
      "explanation_cn": "在人类和其他动物的动脉和静脉中循环的红色液体，负责将氧气和营养物质输送到细胞，并清除废物。",
      "example_en": "After the accident, he lost a lot of blood and needed an immediate transfusion.",
      "example_cn": "事故发生后，他失血过多，需要立即输血。"
    },
    {
      "pos": "noun",
      "explanation_en": "Lineage or ancestry; family descent or heritage, often used to emphasize shared genetic or cultural origins.",
      "explanation_cn": "血统或祖先；家族传承或血缘关系，常用于强调共享的遗传或文化渊源。",
      "example_en": "She comes from royal blood and is a direct descendant of the king.",
      "example_cn": "她出身王室血统，是国王的直系后裔。"
    },
    {
      "pos": "noun",
      "explanation_en": "Intense emotion, passion, or energy, especially when associated with anger, courage, or vitality.",
      "explanation_cn": "强烈的情感、热情或活力，尤其与愤怒、勇气或生命力相关。",
      "example_en": "The team played with blood and determination, refusing to give up.",
      "example_cn": "球队充满激情与决心，拒绝放弃。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause someone or something to bleed; to make blood flow from a wound or injury.",
      "explanation_cn": "使某人或某物流血；使伤口出血。",
      "example_en": "The sharp edge of the knife blooded his finger when he sliced it accidentally.",
      "example_cn": "他不小心切到手指时，刀刃的锋利边缘使他流了血。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "serum",
      "analysis": "“Serum”（血清）是血液去除血细胞和凝血因子后的液体成分，主要用于医学检测或免疫治疗，强调其化学组成和功能性。而 “blood” 是完整的循环液体，包含红细胞、白细胞、血小板和血浆，是生理功能的整体载体。"
    },
    {
      "word_to_compare": "kin",
      "analysis": "“Kin”（亲属）泛指有血缘关系的家族成员，是一个社会关系术语，强调人际关系网络。而 “blood” 在表示血统时更侧重遗传和生物学意义上的传承，常用于强调纯粹的血缘联系，如 “blood relative”。"
    },
    {
      "word_to_compare": "lifeblood",
      "analysis": "“Lifeblood”（生命之源）是比喻用法，指维持某个系统、组织或机构生存和运转的核心要素，如 “water is the lifeblood of agriculture”。它借用了 “blood” 的生理功能来象征重要性，而 “blood” 本身是具体的生理物质，不具抽象引申义。"
    }
  ]
}