{
  "word": "bloom",
  "pronunciation": "bloom",
  "concise_definition": "v. 开花, 繁荣; n. 花, 花朵, 蓬勃期",
  "forms": {
    "third_person_singular": "blooms",
    "past_tense": "bloomed",
    "past_participle": "bloomed",
    "present_participle": "blooming"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To produce flowers; to reach the stage in a plant's life cycle when flowers appear and are fully open.",
      "explanation_cn": "指植物进入生命周期中开花的阶段，花朵完全绽放。",
      "example_en": "The cherry trees bloom every spring, painting the landscape in soft pink.",
      "example_cn": "每年春天，樱花树都会盛开，将大地染成柔和的粉红色。"
    },
    {
      "pos": "verb",
      "explanation_en": "To flourish or thrive, especially during a period of peak activity, creativity, or success.",
      "explanation_cn": "指（人或事物）在某个时期达到鼎盛、繁荣或充满活力的状态，常用于形容才华、事业或文化的高峰期。",
      "example_en": "She really bloomed after she moved to the city and found her artistic voice.",
      "example_cn": "她搬到城市并找到自己的艺术声音后，才华得到了充分展现。"
    },
    {
      "pos": "noun",
      "explanation_en": "A flower or a group of flowers, especially when they are fresh, colorful, and in full display.",
      "explanation_cn": "指一朵花或一簇花，尤指新鲜、色彩鲜艳且完全绽放的花朵。",
      "example_en": "The garden was filled with the vibrant bloom of tulips and daffodils.",
      "example_cn": "花园里盛开着郁金香和水仙花，色彩绚丽。"
    },
    {
      "pos": "noun",
      "explanation_en": "A period of peak development, growth, or prosperity; the time when something is at its best or most active.",
      "explanation_cn": "指某事物发展、成长或繁荣的鼎盛时期，即其最活跃或最出色的状态。",
      "example_en": "The 1920s were the bloom of jazz music in America.",
      "example_cn": "20世纪20年代是爵士乐在美国的黄金时期。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "flower",
      "analysis": "“Flower” (花) 是一个名词，指植物的生殖器官，强调具体的植物结构。而 “bloom” 既可以作名词也可以作动词，作为名词时更强调花朵盛开的状态或整体视觉效果，作为动词时则强调开花这一动态过程。"
    },
    {
      "word_to_compare": "thrive",
      "analysis": "“Thrive” (茁壮成长) 指在良好条件下持续发展、繁荣，常用于描述生物、经济或组织的健康状态，语义更广泛且偏重持续性。而 “bloom” 作为动词时，更强调达到一个短暂而耀眼的巅峰状态，常带有诗意或象征性。"
    },
    {
      "word_to_compare": "burst",
      "analysis": "“Burst” (爆发) 强调突然、剧烈的释放或出现，如“burst into bloom”表示突然盛开，带有强烈冲击感。而 “bloom” 本身是渐进、自然、优雅的绽放过程，不强调突然性，更注重美感和周期性。"
    }
  ]
}