{
  "word": "blowing",
  "pronunciation": "bloh·ing",
  "concise_definition": "n. 风吹, 气流; v. 吹, 吹奏, 爆炸 (现在分词/动名词形式)",
  "forms": {
    "base_form": "blow",
    "third_person_singular": "blows",
    "past_tense": "blew",
    "past_participle": "blown",
    "present_participle": "blowing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A strong gust or stream of air moving through a space, often with noticeable force or noise.",
      "explanation_cn": "指通过某一空间的强烈气流或阵风，通常带有明显的力度或声响。",
      "example_en": "The blowing wind rattled the windows all night.",
      "example_cn": "呼啸的风整晚都在摇动窗户。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden, often destructive event caused by air movement, such as a storm or explosion; sometimes used informally to mean a failure or disappointment.",
      "explanation_cn": "指由气流引起的突发性、常具破坏性的事件，如风暴或爆炸；有时非正式地用于表示失败或令人失望的事。",
      "example_en": "That last-minute mistake was a real blowing — we lost the contract.",
      "example_cn": "那个最后一刻的失误真是个大失败——我们失去了合同。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move air forcefully from the mouth or a device, such as blowing a whistle, candle, or balloon.",
      "explanation_cn": "指用嘴或设备强力送出空气，如吹口哨、吹蜡烛或吹气球。",
      "example_en": "She was blowing bubbles with her gum while waiting for the bus.",
      "example_cn": "她在等公交车时用口香糖吹着泡泡。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to move or be carried by the wind, such as leaves, smoke, or dust.",
      "explanation_cn": "指使某物（如树叶、烟雾或灰尘）被风吹动或吹走。",
      "example_en": "The autumn leaves were blowing across the empty street.",
      "example_cn": "秋天的落叶在空荡的街道上飘舞。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause an explosive rupture or destruction, often of a structure or device.",
      "explanation_cn": "指导致某物（如结构或装置）发生爆炸性破裂或破坏。",
      "example_en": "The terrorists blew up the bridge with dynamite.",
      "example_cn": "恐怖分子用炸药炸毁了那座桥。"
    },
    {
      "pos": "verb",
      "explanation_en": "To play a musical instrument by directing air through it, such as blowing a trumpet or flute.",
      "explanation_cn": "指通过向乐器吹气来演奏，如吹小号或长笛。",
      "example_en": "He spent years learning how to blow the saxophone with emotion.",
      "example_cn": "他花了多年时间学习如何富有感情地吹奏萨克斯管。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "wind",
      "analysis": "“Wind” (风) 是一个名词，指自然界的空气流动，是客观存在的气象现象。而 “blowing” 作为名词时，强调的是风的动态过程或一次具体的气流冲击，更具动作性和临时性。例如，“a strong wind” 是描述状态，而 “a violent blowing” 描述的是风的猛烈动作。"
    },
    {
      "word_to_compare": "gust",
      "analysis": "“Gust” (阵风) 是一个名词，特指短暂而强烈的风，常用于气象语境。而 “blowing” 更宽泛，可指持续或间歇的风，甚至可引申为非自然的气流（如吹气球）或比喻性的失败。在描述自然风时，“gust” 更精确，而 “blowing” 更口语化、更具表现力。"
    },
    {
      "word_to_compare": "blast",
      "analysis": "“Blast” (强风/爆炸) 可作名词或动词，常指突然、猛烈、具有破坏性的气流或爆炸，语义强度高于 “blowing”。例如，“a blast of cold air” 比 “a blowing of cold air” 更具冲击力。此外，“blast” 更常用于爆炸语境，而 “blowing” 作为动词时更常用于描述吹的动作或过程。"
    }
  ]
}