{
  "word": "blowout",
  "pronunciation": "bloh·owt",
  "concise_definition": "n. 大胜, 爆胎, 爆发; v. 爆裂, 大胜",
  "forms": {
    "plural": "blowouts"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A decisive and overwhelming victory in a competition, especially in sports, where one side wins by a very large margin.",
      "explanation_cn": "指在竞赛中一方以悬殊比分取得的决定性大胜，尤其常用于体育赛事。",
      "example_en": "The home team won a spectacular blowout, 45–3, leaving the opponents stunned.",
      "example_cn": "主队以45比3取得了一场惊人的大胜，令对手目瞪口呆。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden rupture or bursting of a tire due to loss of air pressure, often causing loss of vehicle control.",
      "explanation_cn": "指轮胎因气压骤降而突然爆裂，常导致车辆失控。",
      "example_en": "We had to pull over after a blowout on the highway.",
      "example_cn": "我们在高速公路上遭遇爆胎，不得不靠边停车。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large, extravagant, and often celebratory party or event, especially one with excessive food, drink, or entertainment.",
      "explanation_cn": "指规模盛大、奢华甚至放纵的聚会或活动，常伴有丰盛的食物、饮品或娱乐。",
      "example_en": "They threw a blowout for their 25th wedding anniversary with a live band and fireworks.",
      "example_cn": "他们为结婚25周年举办了一场盛大的派对，有现场乐队和烟花表演。"
    },
    {
      "pos": "verb",
      "explanation_en": "To burst or rupture suddenly, especially referring to a tire losing air pressure.",
      "explanation_cn": "指突然爆裂，尤指轮胎漏气破裂。",
      "example_en": "The tire blew out just as we reached the freeway.",
      "example_cn": "就在我们驶上高速公路时，轮胎爆了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To defeat an opponent decisively and overwhelmingly in a contest or competition.",
      "explanation_cn": "指在比赛中以压倒性优势彻底击败对手。",
      "example_en": "The defending champions blew out their rivals in the final match.",
      "example_cn": "卫冕冠军在决赛中以悬殊比分大胜对手。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "victory",
      "analysis": "“Victory”（胜利）是泛指任何类型的获胜，无论比分大小；而 “blowout” 特指以巨大优势赢得的胜利，强调悬殊性。例如，10–9是胜利，但不是blowout。"
    },
    {
      "word_to_compare": "burst",
      "analysis": "“Burst”（爆裂）是通用词，可指任何物体因内部压力而破裂，如气球、血管等；而 “blowout” 专用于轮胎爆裂或比赛大胜，语义范围更窄、更具体。"
    },
    {
      "word_to_compare": "party",
      "analysis": "“Party”（派对）是中性词，泛指任何形式的聚会；而 “blowout” 作为名词时特指规模盛大、奢华甚至铺张的派对，带有夸张和庆祝的语义色彩，语义强度更高。"
    }
  ]
}