{
  "word": "blows",
  "pronunciation": "blohz",
  "concise_definition": "n. 打击, 指责, 气流, 性行为 (俚语); v. 吹, 爆炸, 失败 (俚语)",
  "forms": {
    "base_form": "blow",
    "third_person_singular": "blows",
    "past_tense": "blew",
    "past_participle": "blown",
    "present_participle": "blowing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sudden, forceful strike or impact, often causing damage or pain; can also refer to a harsh criticism or setback.",
      "explanation_cn": "指突然而有力的打击或冲击，常造成伤害或疼痛；也可指严厉的批评或挫折。",
      "example_en": "The boxer landed a powerful blow to his opponent's jaw.",
      "example_cn": "拳击手一记重拳击中了对手的下巴。"
    },
    {
      "pos": "noun",
      "explanation_en": "A strong current of air moving through a space, often caused by wind or ventilation.",
      "explanation_cn": "指通过某一空间的强气流，通常由风或通风系统引起。",
      "example_en": "A cold blow came through the open window, making everyone shiver.",
      "example_cn": "一阵冷风从敞开的窗户吹进来，让所有人都打起了寒战。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slang term for sexual intercourse, typically used in informal or vulgar contexts.",
      "explanation_cn": "俚语，指性行为，多用于非正式或粗俗语境中。",
      "example_en": "He was bragging about his latest blows at the party.",
      "example_cn": "他在聚会上吹嘘自己最近的性经历。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move air forcefully through a space, such as wind blowing or a person blowing into a whistle.",
      "explanation_cn": "指用力将空气通过某空间移动，如风吹或人吹口哨。",
      "example_en": "The wind blows strongly across the plains in spring.",
      "example_cn": "春天，风在平原上猛烈地吹拂。"
    },
    {
      "pos": "verb",
      "explanation_en": "To explode or burst violently, often used to describe a failure or malfunction (especially in slang).",
      "explanation_cn": "指猛烈爆炸或破裂，常用于描述失败或故障（尤其在俚语中）。",
      "example_en": "The engine blew out on the highway, leaving us stranded.",
      "example_cn": "引擎在高速公路上爆了，让我们困在了那里。"
    },
    {
      "pos": "verb",
      "explanation_en": "Slang: To fail spectacularly or mess up badly, often in a public or embarrassing way.",
      "explanation_cn": "俚语：指以显著或令人尴尬的方式彻底失败。",
      "example_en": "He blew his audition and got kicked out of the competition.",
      "example_cn": "他面试彻底搞砸了，被赶出了比赛。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "strike",
      "analysis": "“Strike” (打击) 更强调有意识、有目的的攻击行为，常用于拳击、军事或法律语境，如“strike a deal”或“strike a pose”。“Blow” 更侧重于冲击的物理力量和突然性，常带有意外或破坏性含义。"
    },
    {
      "word_to_compare": "gust",
      "analysis": "“Gust” (阵风) 是“blow”作为气流含义时的近义词，但“gust”特指短暂、强劲的风，而“blow”可指持续或任意强度的气流，语义范围更广。例如，“a gust of wind”是具体瞬间，而“a cold blow”可指持续的冷风。"
    },
    {
      "word_to_compare": "fail",
      "analysis": "“Fail” (失败) 是中性、通用的动词，指未达成目标。“Blow” 作为俚语动词时，语气更强烈、更口语化，常带有戏剧性或耻辱感，如“blow it”比“fail”更具情绪色彩和生动性。"
    }
  ]
}