{
  "word": "blue",
  "pronunciation": "bloo",
  "concise_definition": "adj. 蓝色的, 忧郁的; n. 蓝色, 蓝色物体",
  "forms": {
    "comparative": "bluer",
    "superlative": "bluest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Of the color between green and violet in the visible spectrum, resembling the color of a clear sky or the sea.",
      "explanation_cn": "指在可见光谱中位于绿色和紫色之间的颜色，类似于晴朗天空或大海的颜色。",
      "example_en": "She wore a beautiful blue dress to the party.",
      "example_cn": "她穿了一条漂亮的蓝色连衣裙去参加派对。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Feeling sad, depressed, or melancholic; often used to describe a low emotional state.",
      "explanation_cn": "感到悲伤、沮丧或忧郁；常用于描述情绪低落的状态。",
      "example_en": "He's been feeling blue since his dog passed away.",
      "example_cn": "自从他的狗去世后，他一直情绪低落。"
    },
    {
      "pos": "noun",
      "explanation_en": "The color itself, used to refer to the hue or pigment associated with the sky or ocean.",
      "explanation_cn": "指颜色本身，用于表示与天空或海洋相关的色调或颜料。",
      "example_en": "Blue is my favorite color.",
      "example_cn": "蓝色是我最喜欢的颜色。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of music originating in African-American communities, characterized by expressive melodies and lyrics about hardship and emotion.",
      "explanation_cn": "一种起源于非裔美国人社区的音乐类型，以富有表现力的旋律和关于苦难与情感的歌词为特征。",
      "example_en": "He plays blues guitar with deep feeling and soul.",
      "example_cn": "他用充满感情和灵魂的方式演奏蓝调吉他。"
    },
    {
      "pos": "noun",
      "explanation_en": "A social or political group associated with the color blue, especially in the context of political parties (e.g., the Republican Party in the U.S. is often called 'blue' in media).",
      "explanation_cn": "与蓝色相关联的社会或政治团体，尤其在政治语境中（例如，美国共和党常被媒体称为‘蓝色阵营’）。",
      "example_en": "The state voted blue in the last election.",
      "example_cn": "该州在上次选举中投了民主党（蓝色阵营）的票。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "navy",
      "analysis": "“Navy” (深蓝) 是一种特定的深蓝色调，通常指海军制服的颜色，比一般的 “blue” 更暗、更饱和。它是一个具体的颜色子类，而 “blue” 是一个宽泛的色彩类别。"
    },
    {
      "word_to_compare": "sad",
      "analysis": "“Sad” (悲伤) 是一个通用的情绪形容词，直接描述心理状态；而 “blue” 作为情绪词时更含蓄、更具文学性，常用于口语或诗歌中，带有轻微的诗意或文化隐喻色彩。"
    },
    {
      "word_to_compare": "azure",
      "analysis": "“Azure” (天蓝色) 是一种明亮、清澈的浅蓝色，常用于描述晴朗天空或清澈海水，具有更强烈的视觉意象和文学色彩。而 “blue” 是基础颜色词，涵盖从浅蓝到深蓝的广泛范围，语义更通用。"
    }
  ]
}