{
  "word": "bluff",
  "pronunciation": "bluhf",
  "concise_definition": "n. 虚张声势, 欺骗; v. 虚张声势, 欺骗",
  "forms": {
    "third_person_singular": "bluffs",
    "past_tense": "bluffed",
    "past_participle": "bluffed",
    "present_participle": "bluffing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A deceptive strategy or statement intended to make others believe something that is not true, often to gain an advantage in a competitive situation.",
      "explanation_cn": "一种欺骗性的策略或言论，旨在让他人相信并非真实的事情，通常用于在竞争情境中获取优势。",
      "example_en": "His confident tone was just a bluff—he had no idea what the answer was.",
      "example_cn": "他自信的语气只是虚张声势——他根本不知道答案是什么。"
    },
    {
      "pos": "noun",
      "explanation_en": "A steep cliff or bank, especially one overlooking a body of water or a valley; a geographical feature often used metaphorically.",
      "explanation_cn": "陡峭的悬崖或河岸，尤其指俯瞰水域或山谷的地形；常被用作隐喻。",
      "example_en": "We stood at the edge of the bluff, watching the waves crash below.",
      "example_cn": "我们站在悬崖边缘，看着下方的海浪猛烈拍打。"
    },
    {
      "pos": "verb",
      "explanation_en": "To deceive or mislead someone by pretending to have more strength, confidence, or knowledge than one actually does.",
      "explanation_cn": "通过假装拥有比实际更强的实力、信心或知识来欺骗或误导他人。",
      "example_en": "She bluffed her way through the interview by pretending to understand the technical jargon.",
      "example_cn": "她假装懂那些专业术语，从而在面试中蒙混过关。"
    },
    {
      "pos": "verb",
      "explanation_en": "In poker or similar games, to bet heavily on a weak hand in order to make opponents fold.",
      "explanation_cn": "在扑克或类似游戏中，用弱牌下大注，以迫使对手弃牌。",
      "example_en": "He bluffed with a pair of twos and won the pot when everyone else folded.",
      "example_cn": "他用一对二虚张声势，当所有人都弃牌时赢得了底池。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "deceive",
      "analysis": "“Deceive”（欺骗）是更广泛的术语，泛指任何使他人相信虚假信息的行为，不强调手段或动机。而 “bluff” 特指通过假装强大、自信或拥有更多信息来施加心理压力，常用于博弈或谈判语境，具有策略性和表演性。"
    },
    {
      "word_to_compare": "lie",
      "analysis": "“Lie”（撒谎）指直接说出不真实的话，通常带有道德贬义，强调内容的虚假性。而 “bluff” 不一定说假话，而是通过误导性姿态、语气或行为制造错觉，有时甚至使用真实信息来增强可信度，更具战术性。"
    },
    {
      "word_to_compare": "intimidate",
      "analysis": "“Intimidate”（恐吓）是通过威胁或施压使他人畏惧屈服，核心是制造恐惧。而 “bluff” 是通过伪装实力或信心来让对方主动退让，不依赖直接威胁，更依赖心理博弈和对方的判断失误。"
    }
  ]
}