{
  "word": "blurred",
  "pronunciation": "blur·d",
  "concise_definition": "adj. 模糊的, 不清晰的, 晕开的",
  "forms": {
    "base_form": "blur",
    "comparative": "blurrer",
    "superlative": "blurrest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Not clear or sharp in outline or detail, often due to movement, poor focus, or physical obstruction; describing something that appears hazy or indistinct.",
      "explanation_cn": "轮廓或细节不清晰，通常因移动、对焦不良或物理遮挡所致；形容事物显得朦胧、模糊不清。",
      "example_en": "The photograph was blurred because the subject moved during the exposure.",
      "example_cn": "这张照片模糊了，因为拍摄时被摄物体发生了移动。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Mental or perceptual confusion, where thoughts, memories, or boundaries between things are unclear or merged.",
      "explanation_cn": "指思维或感知上的混乱，事物之间的界限、想法或记忆变得模糊不清或混杂在一起。",
      "example_en": "After the accident, she had a blurred memory of what happened that day.",
      "example_cn": "事故发生后，她对那天发生的事情记忆模糊。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used metaphorically to describe something that lacks clear distinction or definition, such as roles, emotions, or categories.",
      "explanation_cn": "比喻性地用于描述缺乏明确区分或界定的事物，如角色、情感或类别。",
      "example_en": "The line between reality and fantasy became blurred in his novel.",
      "example_cn": "在他的小说中，现实与幻想的界限变得模糊了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fuzzy",
      "analysis": "“Fuzzy”（模糊的）通常指边缘不清晰、质地松散或视觉上毛茸茸的模糊，常用于描述图像、毛发或声音的轻微失真，带有轻微的非正式或可爱色彩。而 “blurred” 更强调因运动、失焦或干扰导致的清晰度丧失，适用范围更广，包括视觉、记忆和抽象概念。"
    },
    {
      "word_to_compare": "hazy",
      "analysis": "“Hazy”（朦胧的）多用于描述大气、光线或思维中因雾气、烟尘或混乱而造成的模糊，常带有自然或环境因素的意味，如“hazy morning”（朦胧的早晨）。“Blurred” 则更侧重于由技术或生理原因（如镜头失焦、视力问题）导致的清晰度下降，更具直接性和具体性。"
    },
    {
      "word_to_compare": "indistinct",
      "analysis": "“Indistinct”（不清晰的）强调难以辨认或分辨，常用于声音、形状或细节的微弱或模糊，语气更中性、正式。“Blurred” 则隐含了原本清晰但因某种外力而变得模糊的过程，更具动态感，常用于描述变化的结果，如照片、记忆或视觉感知的退化。"
    }
  ]
}