{
  "word": "blush",
  "pronunciation": "bluhsh",
  "concise_definition": "v. 脸红, 害羞; n. 脸红, 粉红, 腮红",
  "forms": {
    "third_person_singular": "blushes",
    "past_tense": "blushed",
    "past_participle": "blushed",
    "present_participle": "blushing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To have a reddening of the face, typically due to embarrassment, shame, or modesty, often involuntarily.",
      "explanation_cn": "因尴尬、羞愧或羞涩而面部泛红，通常是无意识的生理反应。",
      "example_en": "She blushed when he complimented her in front of everyone.",
      "example_cn": "当他在众人面前夸奖她时，她脸红了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To take on a slight reddish color, often used metaphorically to describe something acquiring a soft pink hue.",
      "explanation_cn": "指某物呈现出淡淡的粉红色，常用于比喻性描述，如日出或花朵的颜色变化。",
      "example_en": "The sky blushed with the first light of dawn.",
      "example_cn": "天空在黎明的第一缕阳光下泛起淡淡的粉红。"
    },
    {
      "pos": "noun",
      "explanation_en": "A reddish color on the cheeks, especially one caused by embarrassment or emotion.",
      "explanation_cn": "脸颊上因尴尬或情绪而泛起的红色，常指自然的脸红现象。",
      "example_en": "A delicate blush spread across her cheeks as she listened to the poem.",
      "example_cn": "她听诗时，脸颊上泛起一抹淡淡的红晕。"
    },
    {
      "pos": "noun",
      "explanation_en": "A cosmetic product applied to the cheeks to add color and a healthy glow, typically in powder or cream form.",
      "explanation_cn": "一种用于脸颊的化妆品，用以增添色彩和健康光泽，通常为粉状或膏状。",
      "example_en": "She applied a soft peach blush to enhance her natural complexion.",
      "example_cn": "她涂了一层柔和的蜜桃色腮红，以提升自然肤色。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "flush",
      "analysis": "“Flush”（脸红）通常指因愤怒、发热、剧烈运动或情绪激动而引起的面部潮红，具有更强的生理性和突然性，常伴随体温升高。而 “blush” 更强调因羞涩、尴尬或情感反应引起的温和、短暂的泛红，心理因素更突出。"
    },
    {
      "word_to_compare": "rouge",
      "analysis": "“Rouge”（胭脂）是“blush”作为化妆品时的同义词，但“rouge”更偏向于传统或文学用语，常用于描述深红色或复古风格的腮红，而“blush”是现代日常用语，涵盖从自然粉红到鲜艳色调的多种产品。"
    },
    {
      "word_to_compare": "redden",
      "analysis": "“Redden”（变红）是一个中性动词，仅描述颜色从非红变为红色的过程，可适用于任何物体（如火、纸、皮肤），不带有情感或社会含义。而 “blush” 专用于人，且隐含情绪或社会心理背景，具有文化与情感内涵。"
    }
  ]
}