{
  "word": "boards",
  "pronunciation": "bɔːrdz",
  "concise_definition": "n. 板, 木板, 委员会, 董事会",
  "forms": {
    "singular": "board"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A flat, thin piece of wood, plastic, or other rigid material, typically used for construction, signage, or as a surface for writing or displaying information.",
      "explanation_cn": "一块平坦、薄的木头、塑料或其他刚性材料，通常用于建筑、标识，或作为书写和展示信息的表面。",
      "example_en": "The carpenter nailed the wooden boards together to build the fence.",
      "example_cn": "木匠把木板钉在一起建造了围栏。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of people appointed to manage or oversee the affairs of an organization, such as a company, school, or nonprofit, often making high-level decisions.",
      "explanation_cn": "指被任命来管理或监督组织（如公司、学校或非营利机构）事务的一群人，通常负责做出高层决策。",
      "example_en": "The company's board of directors approved the merger last week.",
      "example_cn": "该公司董事会上周批准了这项合并。"
    },
    {
      "pos": "noun",
      "explanation_en": "A flat surface, often made of wood or slate, used for specific purposes such as a bulletin board, chessboard, or whiteboard.",
      "explanation_cn": "指用于特定用途的平坦表面，通常由木头或石板制成，如公告板、棋盘或白板。",
      "example_en": "She pinned the notice to the community board near the entrance.",
      "example_cn": "她把通知贴在入口附近的社区公告板上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A meal provided regularly, especially in a school, institution, or workplace, often used in the phrase 'board and lodging'.",
      "explanation_cn": "指定期提供的膳食，尤其在学校、机构或工作场所中使用，常与 'board and lodging'（食宿）连用。",
      "example_en": "The dormitory offers room and board for students.",
      "example_cn": "宿舍为学生提供住宿和膳食。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "plank",
      "analysis": "“Plank”（木条）特指一种较厚、较宽的长条形木板，常用于建筑结构中，强调其物理形态和承重功能。而 “board” 更通用，可指任何薄而平的硬质材料，用途更广泛，包括非木质材料。"
    },
    {
      "word_to_compare": "committee",
      "analysis": "“Committee”（委员会）泛指为完成特定任务而组成的任何小组，成员可临时或长期，职责范围较灵活。而 “board” 通常指具有正式管理权和决策权的高层组织，结构更稳定，权力更集中，如董事会、校董会。"
    },
    {
      "word_to_compare": "panel",
      "analysis": "“Panel”（面板/小组）可指一块嵌入式板（如墙板）或一个小型专家小组（如讨论小组），其规模通常小于 “board”，且不一定具有决策权。而 “board” 强调权威性和管理职能，常为组织的最高治理机构。"
    }
  ]
}