{
  "word": "board",
  "pronunciation": "bɔrd",
  "concise_definition": "n. 板, 木板, 委员会; v. 登船, 登机, 上车",
  "forms": {
    "third_person_singular": "boards",
    "past_tense": "boarded",
    "past_participle": "boarded",
    "present_participle": "boarding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A flat, thin piece of wood or other rigid material, typically used for construction, flooring, or as a surface for writing or displaying information.",
      "explanation_cn": "一块平坦、薄的木头或其他刚性材料，通常用于建筑、地板，或作为书写和展示信息的表面。",
      "example_en": "They nailed the poster to the wooden board above the desk.",
      "example_cn": "他们把海报钉在书桌上方的木板上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of people elected or appointed to manage or oversee an organization, such as a company, school, or nonprofit.",
      "explanation_cn": "由选举或任命组成的管理或监督组织（如公司、学校或非营利机构）的一群人。",
      "example_en": "The board of directors approved the new merger plan.",
      "example_cn": "董事会批准了新的合并计划。"
    },
    {
      "pos": "noun",
      "explanation_en": "A meal plan that includes food provided regularly, especially in a school, hotel, or boarding house.",
      "explanation_cn": "一种包含定期提供餐食的计划，尤其指在学校、酒店或寄宿公寓中的膳食安排。",
      "example_en": "The apartment offers rent with board, so breakfast and dinner are included.",
      "example_cn": "这套公寓提供包餐租金，包含早餐和晚餐。"
    },
    {
      "pos": "verb",
      "explanation_en": "To get on a vehicle such as a ship, airplane, train, or bus for travel.",
      "explanation_cn": "登上轮船、飞机、火车或公共汽车等交通工具以进行旅行。",
      "example_en": "Passengers are now boarding Flight 205 to Tokyo.",
      "example_cn": "乘客们现在正在登机前往东京的205号航班。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provide food and lodging for someone, especially in exchange for payment; to house and feed.",
      "explanation_cn": "为某人提供食宿，通常以换取报酬；指寄宿并供餐。",
      "example_en": "The family boards two exchange students each year.",
      "example_cn": "这家人每年寄宿两名交换生。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "plank",
      "analysis": "“Plank” (木板条) 是指一块狭长、厚实的木板，通常用于建筑结构，强调其物理形态和尺寸。而 “board” 更通用，可指任何尺寸的平板，包括用于公告、书写或作为委员会名称的抽象用法。"
    },
    {
      "word_to_compare": "committee",
      "analysis": "“Committee” (委员会) 是一个更通用的词，泛指为完成特定任务而组成的小组，不一定具有管理职能。而 “board” 特指拥有决策权和监督权的正式管理机构，如董事会，权力层级更高，结构更正式。"
    },
    {
      "word_to_compare": "embark",
      "analysis": "“Embark” (登船/启程) 与 “board” 在登交通工具时意思相近，但 “embark” 更正式，常用于比喻意义（如 embark on a journey），强调开始一段旅程或事业。而 “board” 更侧重于物理动作，日常使用更广泛，仅限于实际登上交通工具。"
    }
  ]
}