{
  "word": "boast",
  "pronunciation": "bōst",
  "concise_definition": "v. 自夸, 吹嘘; n. 自夸的话, 令人自豪的事物",
  "forms": {
    "third_person_singular": "boasts",
    "past_tense": "boasted",
    "past_participle": "boasted",
    "present_participle": "boasting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To speak proudly and often excessively about one's achievements, possessions, or abilities, typically with the intention of impressing others.",
      "explanation_cn": "以自豪甚至过度的方式谈论自己的成就、财产或能力，通常旨在给他人留下深刻印象。",
      "example_en": "He boasted about his new sports car to everyone at the party.",
      "example_cn": "他在聚会上向每个人吹嘘自己的新车。"
    },
    {
      "pos": "verb",
      "explanation_en": "To have or be characterized by something considered admirable or worthy of pride, often used in passive or descriptive contexts.",
      "explanation_cn": "指拥有或以某种令人钦佩或值得自豪的事物为特征，常用于被动或描述性语境。",
      "example_en": "The region boasts some of the finest vineyards in the world.",
      "example_cn": "这个地区拥有世界上一些最优质的葡萄园。"
    },
    {
      "pos": "noun",
      "explanation_en": "A proud or boastful statement; something said to impress others with one's accomplishments or advantages.",
      "explanation_cn": "一种自夸或炫耀的言论；为炫耀成就或优势而说出的话。",
      "example_en": "His latest boast was that he could run a marathon without training.",
      "example_cn": "他最新的自夸是说自己不训练也能跑完马拉松。"
    },
    {
      "pos": "noun",
      "explanation_en": "Something that is a source of pride or a notable feature, often used in the phrase 'a boast of' to describe a distinguishing quality.",
      "explanation_cn": "指令人自豪的事物或显著特征，常用于短语 'a boast of' 来描述某物的突出品质。",
      "example_en": "The garden is the boast of the entire neighborhood.",
      "example_cn": "这座花园是整个社区的骄傲。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "brag",
      "analysis": "“Brag” (吹嘘) 与 “boast” 极为相似，常可互换，但 “brag” 更口语化、更带贬义，常暗示炫耀得令人反感或不真诚。而 “boast” 可用于中性或甚至正面语境，如描述一个地区拥有优质资源时，不带贬义。"
    },
    {
      "word_to_compare": "claim",
      "analysis": "“Claim” (声称) 是中性词，指提出某种主张或断言，不一定带有骄傲或炫耀的语气。例如：He claimed he was innocent.（他声称自己无罪。）而 “boast” 总是隐含一种自我夸耀的情感色彩，强调情感上的优越感。"
    },
    {
      "word_to_compare": "highlight",
      "analysis": "“Highlight” (强调/突出) 是一个中性或积极的词，指有意识地突出某事物的优点，通常用于客观描述或宣传，不包含自我吹嘘的意图。例如：The report highlights the company’s environmental achievements.（报告强调了公司环保方面的成就。）而 “boast” 则带有主观的骄傲甚至自负的意味。"
    }
  ]
}