{
  "word": "bodies",
  "pronunciation": "bod·eez",
  "concise_definition": "n. 身体, 机构, 团体, 物体",
  "forms": {
    "singular": "body"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The physical structure of a human or animal, including organs, tissues, and systems that enable life and movement.",
      "explanation_cn": "指人类或动物的生理结构，包括器官、组织和系统，使生命和运动成为可能。",
      "example_en": "The athletes trained daily to strengthen their bodies.",
      "example_cn": "运动员每天训练以增强体质。"
    },
    {
      "pos": "noun",
      "explanation_en": "An organized group or institution, especially one with official functions or authority, such as a government body or corporate board.",
      "explanation_cn": "指具有官方职能或权威的组织或机构，如政府机构、董事会等。",
      "example_en": "The United Nations is an international body dedicated to peace and security.",
      "example_cn": "联合国是一个致力于和平与安全的国际机构。"
    },
    {
      "pos": "noun",
      "explanation_en": "A distinct physical object or mass, especially one that has a definite shape or volume, such as a celestial body or a solid object.",
      "explanation_cn": "指具有明确形状或体积的独立物理物体，如天体或固体物质。",
      "example_en": "Astronomers study celestial bodies such as planets and stars.",
      "example_cn": "天文学家研究行星和恒星等天体。"
    },
    {
      "pos": "noun",
      "explanation_en": "A collection of written or printed material forming a coherent whole, such as a body of work, law, or knowledge.",
      "explanation_cn": "指构成一个连贯整体的大量文字、作品、法律或知识，常用于抽象语境。",
      "example_en": "Her body of work includes over fifty novels and essays.",
      "example_cn": "她的作品集包括五十多部小说和散文。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "corps",
      "analysis": "“Corps”（军团/团队）特指一个有组织的、通常军事或专业性质的团体，如医疗团、外交团，强调成员的集体身份和专业职能。而 “bodies” 更广泛，可指任何正式机构，包括非军事组织，且更常用于抽象或法律语境。"
    },
    {
      "word_to_compare": "organisms",
      "analysis": "“Organisms”（生物体）是生物学专用术语，指所有具有生命特征的个体，强调新陈代谢、繁殖等生命活动。而 “bodies” 仅指物理结构，不必然包含生命属性，如“celestial bodies”（天体）就不是生物体。"
    },
    {
      "word_to_compare": "groups",
      "analysis": "“Groups”（群体）是最通用的词，泛指任何聚集在一起的人或物，无正式结构或权威性。而 “bodies” 暗示组织性、制度性或官方性，如“a governing body”（管理机构）比“a group of people”更具正式含义。"
    }
  ]
}