{
  "word": "boils",
  "pronunciation": "boylz",
  "concise_definition": "n. 疖, 痈; v. 沸腾, 煮沸",
  "forms": {
    "singular": "boil",
    "third_person_singular": "boils",
    "past_tense": "boiled",
    "past_participle": "boiled",
    "present_participle": "boiling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A painful, inflamed bump on the skin caused by a bacterial infection of a hair follicle or oil gland, typically filled with pus.",
      "explanation_cn": "由毛囊或皮脂腺细菌感染引起的皮肤上疼痛、发炎的肿块，通常含有脓液。",
      "example_en": "He developed several boils on his neck after shaving too closely.",
      "example_cn": "他剃须太贴近皮肤后，脖子上长了好几个疖子。"
    },
    {
      "pos": "noun",
      "explanation_en": "A state of intense anger or agitation, often used figuratively to describe someone who is extremely furious.",
      "explanation_cn": "比喻性地形容极度愤怒或激动的状态，常用于描述某人怒火中烧。",
      "example_en": "She was boiling with rage after hearing the unfair verdict.",
      "example_cn": "听到不公的判决后，她怒火中烧。"
    },
    {
      "pos": "verb",
      "explanation_en": "To heat a liquid to the point where it forms bubbles and turns into vapor, typically at 100°C (212°F) at sea level.",
      "explanation_cn": "将液体加热至沸腾点（通常在海平面为100°C/212°F），使其产生气泡并转化为蒸汽。",
      "example_en": "The water began to boil as the stove reached full heat.",
      "example_cn": "当炉子达到全热时，水开始沸腾了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be in a state of intense agitation or emotion, often used metaphorically to describe feelings such as anger, excitement, or energy.",
      "explanation_cn": "比喻性地形容情绪极度激动或充满能量的状态，常用于描述愤怒、兴奋或活力。",
      "example_en": "The crowd was boiling with anticipation before the concert began.",
      "example_cn": "音乐会开始前，人群激动得沸腾起来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pimple",
      "analysis": "“Pimple”（粉刺）是皮肤上微小的、通常无痛的毛囊堵塞，常由油脂和死皮细胞引起，一般不含脓液或严重炎症。而 “boil” 是更深、更大、更疼痛的感染性脓肿，通常由细菌（如金黄色葡萄球菌）引起，需要医疗处理。"
    },
    {
      "word_to_compare": "simmer",
      "analysis": "“Simmer”（微沸）指液体被加热至略低于沸点的状态，气泡缓慢、轻微地冒出，常用于慢炖烹饪。而 “boil” 是剧烈的、持续的气泡翻滚状态，温度达到或接近100°C，用于快速加热或消毒。"
    },
    {
      "word_to_compare": "fume",
      "analysis": "“Fume”（怒气冲冲）作为动词时，指因愤怒而沉默地发怒，常带有压抑感；作为名词时指烟雾或气味。而 “boil” 作为比喻用法时，强调情绪的外显、激烈和即将爆发的状态，更具动态性和爆发力。"
    }
  ]
}