{
  "word": "boilers",
  "pronunciation": "bɔɪl·ərz",
  "concise_definition": "n. 锅炉, 蒸汽发生器",
  "forms": {
    "singular": "boiler"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A closed vessel in which water or other fluid is heated under pressure to produce steam or hot water for heating, power generation, or industrial processes.",
      "explanation_cn": "一种密闭容器，用于在压力下加热水或其他流体，以产生蒸汽或热水，用于供暖、发电或工业过程。",
      "example_en": "The factory relies on large boilers to generate steam for its manufacturing processes.",
      "example_cn": "该工厂依靠大型锅炉为其制造过程提供蒸汽。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of heating system that uses heated water or steam circulated through pipes to warm buildings, commonly found in older homes and institutional buildings.",
      "explanation_cn": "一种利用加热水或蒸汽通过管道循环来供暖的系统，常见于老旧住宅和公共建筑中。",
      "example_en": "The old apartment building still uses a coal-fired boiler to heat all the apartments in winter.",
      "example_cn": "这栋老旧公寓楼在冬季仍使用燃煤锅炉为所有公寓供暖。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slang or informal term for a person who is overly aggressive, hot-tempered, or prone to outbursts, often used in British English.",
      "explanation_cn": "（英式英语非正式用法）指脾气暴躁、易怒或经常发脾气的人。",
      "example_en": "He’s such a boiler—always yelling at the staff over minor mistakes.",
      "example_cn": "他真是个火暴脾气——总因为一点小错就对员工大喊大叫。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "furnace",
      "analysis": "“Furnace”（炉子）通常指用于直接加热空气或空间的设备，常见于家庭供暖系统，主要通过燃烧燃料加热空气，再通过风管输送。而 “boiler” 是加热水或产生蒸汽，通过管道输送热量，两者热媒不同（空气 vs. 水/蒸汽），用途和结构有本质区别。"
    },
    {
      "word_to_compare": "heater",
      "analysis": "“Heater”（加热器）是一个泛指所有加热装置的词，可以是电暖器、油汀、热水袋等小型设备，通常用于局部或个人取暖。而 “boiler” 是大型、固定安装的工业或建筑级设备，用于集中供热，规模和功能远超一般 “heater”。"
    },
    {
      "word_to_compare": "steam generator",
      "analysis": "“Steam generator”（蒸汽发生器）是 “boiler” 的技术性同义词，常用于工程或电力行业，强调其产生蒸汽的功能。在大多数语境中两者可互换，但 “boiler” 更通用，涵盖供暖和工业用途；而 “steam generator” 更强调高压蒸汽的生产，常用于核电站或大型电厂。"
    }
  ]
}