{
  "word": "bolster",
  "pronunciation": "bohl·stər",
  "concise_definition": "v. 支持, 增强, 修补; n. 长枕, 垫子",
  "forms": {
    "third_person_singular": "bolsters",
    "past_tense": "bolstered",
    "past_participle": "bolstered",
    "present_participle": "bolstering"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To support, strengthen, or improve something, especially when it is weak or under pressure, often by adding resources, encouragement, or evidence.",
      "explanation_cn": "指在某事物薄弱或面临压力时，通过增加资源、鼓励或证据来支持、增强或改善它。",
      "example_en": "The government is bolstering its defense budget in response to rising tensions.",
      "example_cn": "由于紧张局势加剧，政府正在加强其国防预算。"
    },
    {
      "pos": "verb",
      "explanation_en": "To repair or reinforce something, especially by adding padding or material to restore its shape or function.",
      "explanation_cn": "指通过添加填充物或材料来修补或加固某物，以恢复其形状或功能。",
      "example_en": "They bolstered the old sofa with extra foam to make it more comfortable.",
      "example_cn": "他们用额外的泡沫填充了旧沙发，使其更舒适。"
    },
    {
      "pos": "noun",
      "explanation_en": "A long, narrow cushion or pillow, often used for support while sitting or lying down, especially in bed or on a sofa.",
      "explanation_cn": "一种长而窄的靠垫或枕头，常用于坐或躺时提供支撑，尤其多用于床或沙发。",
      "example_en": "She leaned back against the velvet bolster, reading a novel in the afternoon light.",
      "example_cn": "她倚靠着丝绒靠垫，在午后阳光下读着小说。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "support",
      "analysis": "“Support” (支持) 是一个更通用的词，泛指任何形式的援助或支撑，可以是情感、经济或物理上的。而 “bolster” 更强调通过添加具体资源或材料来增强薄弱环节，带有主动强化的意味，语义更具体、更有力。"
    },
    {
      "word_to_compare": "strengthen",
      "analysis": "“Strengthen” (加强) 侧重于使某物本身变得更坚固或更有能力，常用于抽象概念如信心、关系或结构。而 “bolster” 常指通过外部介入（如补充资源、证据或物理填充）来实现增强，更强调外部助力的作用。"
    },
    {
      "word_to_compare": "cushion",
      "analysis": "“Cushion” (垫子) 作为名词时与 “bolster” 有部分语义重叠，但 “cushion” 更泛指任何柔软的垫子，常用于缓冲冲击或增加舒适度，而 “bolster” 特指长条形、用于支撑的靠垫，功能上更强调结构性支撑而非单纯缓冲。"
    }
  ]
}