{
  "word": "bomb",
  "pronunciation": "bom",
  "concise_definition": "n. 炸弹；v. 爆炸；失败，惨败",
  "forms": {
    "plural": "bombs",
    "third_person_singular": "bombs",
    "past_tense": "bombed",
    "past_participle": "bombed",
    "present_participle": "bombing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An explosive device designed to detonate and cause destruction, typically used in warfare or terrorism.",
      "explanation_cn": "一种设计用于爆炸并造成破坏的装置，通常用于战争或恐怖主义活动。",
      "example_en": "The police evacuated the building after discovering a suspicious package that turned out to be a bomb.",
      "example_cn": "警方在发现一个可疑包裹并确认其为炸弹后，疏散了大楼内的人员。"
    },
    {
      "pos": "verb",
      "explanation_en": "To explode or cause an explosion, especially with an explosive device.",
      "explanation_cn": "指用爆炸物引发爆炸，尤指使用炸弹进行破坏。",
      "example_en": "The old warehouse was bombed during the conflict, reducing it to rubble.",
      "example_cn": "在冲突期间，这座旧仓库遭到轰炸，化为废墟。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fail spectacularly or be received very poorly, especially in the context of performances, films, or products.",
      "explanation_cn": "指（表演、电影、产品等）以惨败告终或遭到极差的评价。",
      "example_en": "The new superhero movie bombed at the box office, earning less than $1 million in its first week.",
      "example_cn": "这部新的超级英雄电影票房惨败，首周收入不足一百万美元。"
    },
    {
      "pos": "noun",
      "explanation_en": "A colloquial term for a performance, film, or product that has failed badly.",
      "explanation_cn": "口语中指表现极差、彻底失败的表演、电影或产品。",
      "example_en": "Critics called the play a total bomb — no one stayed until the final curtain.",
      "example_cn": "评论家称这部剧是一场彻底的失败——没人坚持看到谢幕。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "explosion",
      "analysis": "“Explosion” (爆炸) 是一个中性名词，泛指任何突然释放能量的现象，可以是化学、物理或情绪性的，不一定是人为制造的武器。而 “bomb” 特指人为制造的爆炸装置，具有攻击性和破坏意图。"
    },
    {
      "word_to_compare": "failure",
      "analysis": "“Failure” (失败) 是一个通用词，泛指任何未达成目标的情况，语气中性或正式。而 “bomb” 作为动词或名词用于口语时，强调的是“惨败”或“彻底失败”，带有强烈的情感色彩和戏剧性，常用于娱乐行业。"
    },
    {
      "word_to_compare": "attack",
      "analysis": "“Attack” (攻击) 是一个更广泛的军事或暴力行为术语，包括枪击、刺杀、轰炸等多种形式。而 “bomb” 是一种具体的攻击手段，特指使用爆炸物。因此，bomb 是 attack 的一种子类型。"
    }
  ]
}