{
  "word": "bombarded",
  "pronunciation": "buhm·bahr·dɪd",
  "concise_definition": "v. 猛烈轰炸, 不断骚扰, 猛烈攻击（bombard 的过去式和过去分词）",
  "forms": {
    "base_form": "bombard",
    "third_person_singular": "bombards",
    "present_participle": "bombarding",
    "past_tense": "bombarded",
    "past_participle": "bombarded"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To attack a place or person with continuous or intense gunfire, explosives, or other weapons, typically in a military context.",
      "explanation_cn": "指在军事背景下，以持续或猛烈的枪炮、爆炸物或其他武器攻击某个地点或人员。",
      "example_en": "The city was bombarded by enemy artillery for three days.",
      "example_cn": "这座城市连续三天遭到敌方炮火的猛烈轰炸。"
    },
    {
      "pos": "verb",
      "explanation_en": "To overwhelm someone with a large amount of information, questions, requests, or stimuli, often in a way that is exhausting or difficult to process.",
      "explanation_cn": "指用大量信息、问题、请求或刺激物使人应接不暇，常造成疲惫或难以处理的感觉。",
      "example_en": "She was bombarded with emails as soon as she returned from vacation.",
      "example_cn": "她一从假期回来，就收到了大量邮件的轰炸。"
    },
    {
      "pos": "verb",
      "explanation_en": "To subject someone to persistent and often intrusive advertising, publicity, or media attention.",
      "explanation_cn": "指对某人持续施加侵扰性的广告、宣传或媒体关注。",
      "example_en": "Celebrities are often bombarded with paparazzi and media requests.",
      "example_cn": "名人常常被狗仔队和媒体请求围攻。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "attacked",
      "analysis": "“Attacked”（攻击）是一个更广泛、更中性的词，泛指任何形式的进攻，可以是物理的、言语的或逻辑的，但不一定强调强度或持续性。而 “bombarded” 特指以密集、持续、猛烈的方式攻击，带有强烈的压迫感和数量优势。"
    },
    {
      "word_to_compare": "overwhelmed",
      "analysis": "“Overwhelmed”（压垮）强调心理或情感上的不堪重负，常用于非物理情境，如情绪、任务或信息过多。而 “bombarded” 更强调外部施加的主动、密集的冲击行为，既可以是物理的（如炮火），也可以是抽象的（如信息），但更突出“施动者”的主动性和攻击性。"
    },
    {
      "word_to_compare": "pelted",
      "analysis": "“Pelted”（投掷）通常指用物体（如石头、雪球、雨点）快速连续地投掷，多用于较轻或非致命的场景，常带有一种具象的、物理性的画面感。而 “bombarded” 更具破坏性和严重性，常用于战争、媒体或信息战等更严重的语境，范围更广，语义更重。"
    }
  ]
}