{
  "word": "bond",
  "pronunciation": "bahn(d)",
  "concise_definition": "n. 纽带, 约束, 债券; v. 连接, 融合, 使牢固",
  "forms": {
    "plural": "bonds",
    "third_person_singular": "bonds",
    "past_tense": "bonded",
    "past_participle": "bonded",
    "present_participle": "bonding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A strong connection or relationship between people, groups, or things, often based on shared emotions, experiences, or interests.",
      "explanation_cn": "指人与人、群体或事物之间基于共同情感、经历或兴趣形成的牢固联系或纽带。",
      "example_en": "The bond between the two sisters was unbreakable, forged through years of shared struggles.",
      "example_cn": "这对姐妹之间的纽带坚不可摧，是通过多年共同的挣扎建立起来的。"
    },
    {
      "pos": "noun",
      "explanation_en": "A legal or financial instrument representing a loan made by an investor to a borrower (typically a corporation or government), which pays interest over time and returns the principal at maturity.",
      "explanation_cn": "指投资者向借款人（通常是公司或政府）提供贷款的法律或金融工具，期间支付利息，到期偿还本金。",
      "example_en": "She invested in government bonds to ensure a steady stream of passive income.",
      "example_cn": "她投资了政府债券，以确保获得稳定的被动收入。"
    },
    {
      "pos": "noun",
      "explanation_en": "A binding agreement or obligation, often formal or legal, that compels someone to act in a certain way.",
      "explanation_cn": "指一种具有约束力的协议或义务，通常为正式或法律性质，迫使某人以某种方式行事。",
      "example_en": "The treaty served as a bond of peace between the two warring nations.",
      "example_cn": "这项条约成为两个交战国之间的和平纽带。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form a close emotional or social connection between people or groups.",
      "explanation_cn": "指在人与人或群体之间建立紧密的情感或社会联系。",
      "example_en": "Team-building exercises help bond employees and improve workplace morale.",
      "example_cn": "团队建设活动有助于增强员工之间的联系，提升工作场所的士气。"
    },
    {
      "pos": "verb",
      "explanation_en": "To join or fasten two or more things together, often using a chemical, adhesive, or physical process.",
      "explanation_cn": "指通过化学、粘合剂或物理方式将两个或多个物体连接或固定在一起。",
      "example_en": "The glue will bond the wood pieces securely within minutes.",
      "example_cn": "这种胶水能在几分钟内牢固地粘合木块。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tie",
      "analysis": "“Tie” (系、连接) 通常指物理上的捆绑或较弱的关联，如系鞋带、关系纽带，语义较轻，常用于比喻性表达（如 tie the knot）。而 “bond” 更强调深层、持久、情感或法律上的牢固联系，强度和深度更高。"
    },
    {
      "word_to_compare": "link",
      "analysis": "“Link” (连接) 强调两个事物之间的通道或中介关系，常用于技术、逻辑或系统语境（如超链接、因果链），是中性、功能性的连接。而 “bond” 更侧重于情感、信任或义务的内在联结，具有更强的人文色彩。"
    },
    {
      "word_to_compare": "obligation",
      "analysis": "“Obligation” (义务) 指法律或道德上必须履行的责任，常带有强制性和负担感，如纳税义务。而 “bond” 作为名词时，虽可指约束，但更强调双方自愿建立的联结，甚至带有积极情感色彩，如亲情、忠诚之 bond。"
    },
    {
      "word_to_compare": "security",
      "analysis": "“Security” (证券) 是金融术语中债券的上位概念，泛指所有可交易的金融资产，包括股票、债券等。而 “bond” 是一种特定类型的证券，具有固定利息和到期日，是 “security” 的子类。两者是种属关系，不可互换。"
    }
  ]
}