{
  "word": "bonding",
  "pronunciation": "bahn·ding",
  "concise_definition": "n. 建立联系, 情感纽带, 键合",
  "forms": {
    "base_form": "bond",
    "present_participle": "bonding",
    "past_tense": "bonded",
    "past_participle": "bonded"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of forming a strong emotional connection or relationship between people, often through shared experiences, trust, or mutual support.",
      "explanation_cn": "指人与人之间通过共同经历、信任或相互支持而建立的强烈情感联系或关系的过程。",
      "example_en": "The camping trip helped with bonding among the team members.",
      "example_cn": "这次露营活动促进了团队成员之间的感情联系。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process by which atoms or molecules are held together by chemical forces, such as covalent, ionic, or metallic bonds.",
      "explanation_cn": "指原子或分子通过化学力（如共价键、离子键或金属键）结合在一起的过程。",
      "example_en": "The bonding between oxygen and hydrogen atoms forms water molecules.",
      "example_cn": "氧原子和氢原子之间的键合形成了水分子。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of creating a close attachment between a parent and child, especially in the early stages of life, which is crucial for emotional development.",
      "explanation_cn": "指父母与子女之间，尤其是在生命早期阶段建立的紧密情感依附，这对情感发展至关重要。",
      "example_en": "Skin-to-skin contact immediately after birth is known to enhance bonding between mother and baby.",
      "example_cn": "出生后立即进行的皮肤接触已被证明能增强母婴之间的亲子纽带。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "connection",
      "analysis": "“Connection”（联系）是一个更广泛、更中性的词，可指任何形式的关联，包括社交、技术或抽象层面的连接，不一定涉及情感深度。而 “bonding” 特指通过互动和情感投入形成的牢固、持久的纽带，强调关系的深度和质量。"
    },
    {
      "word_to_compare": "attachment",
      "analysis": "“Attachment”（依恋）常用于心理学语境，指个体对他人形成的稳定情感依赖，尤其在婴儿与照顾者之间。它更侧重于心理状态，而 “bonding” 更强调建立这一依恋的动态过程和互动行为。两者常重叠，但 “bonding” 更具主动性。"
    },
    {
      "word_to_compare": "chemical bond",
      "analysis": "“Chemical bond”（化学键）是化学术语，专指原子间通过电子共享或转移形成的稳定结构，是 “bonding” 在科学语境中的具体表现形式。而 “bonding” 作为名词，既可用于化学，也可用于社会情感领域，具有跨学科的广义性。"
    }
  ]
}