{
  "word": "bone",
  "pronunciation": "bohn",
  "concise_definition": "n. 骨头, 骨骼; v. 去骨, 骨化",
  "forms": {
    "plural": "bones"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A rigid organ that forms part of the skeleton in vertebrates, providing structural support, protection for internal organs, and attachment points for muscles.",
      "explanation_cn": "脊椎动物骨骼的组成部分，是一种坚硬的器官，提供身体支撑、保护内脏器官，并作为肌肉附着的支点。",
      "example_en": "The dog buried the bone in the backyard.",
      "example_cn": "这只狗把骨头埋在了后院里。"
    },
    {
      "pos": "noun",
      "explanation_en": "A part of the body that is hard and bony, often used metaphorically to describe something firm, unyielding, or essential.",
      "explanation_cn": "指身体中坚硬如骨的部分，也常用于比喻形容某物坚固、不可动摇或至关重要。",
      "example_en": "He has the bone structure of a professional athlete.",
      "example_cn": "他拥有职业运动员般的骨骼结构。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small piece of food that contains bone, especially meat with the bone still attached.",
      "explanation_cn": "指带有骨头的小块食物，尤指未去骨的肉类。",
      "example_en": "She picked the meat off the bone with her fingers.",
      "example_cn": "她用手把肉从骨头剔下来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove the bones from meat, fish, or other food before cooking or serving.",
      "explanation_cn": "指在烹饪或上菜前将肉类、鱼类或其他食物中的骨头剔除。",
      "example_en": "The chef boned the chicken before roasting it.",
      "example_cn": "厨师在烤鸡之前把鸡骨剔除了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To become hardened or calcified, as in the process of bone formation in living tissue.",
      "explanation_cn": "指组织在生物体内逐渐硬化或钙化，如骨骼形成的过程。",
      "example_en": "Over time, the cartilage will bone into solid structure.",
      "example_cn": "随着时间推移，软骨将骨化为坚硬的结构。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "skeleton",
      "analysis": "“Skeleton” (骨架) 指的是由所有骨头组成的完整结构系统，强调整体性；而 “bone” 是构成骨架的单个组成部分，是基本单位。例如，我们说 ‘the human skeleton’ 指整个骨骼系统，但 ‘a rib bone’ 仅指一根肋骨。"
    },
    {
      "word_to_compare": "marrow",
      "analysis": "“Marrow” (骨髓) 是位于骨头内部的软组织，负责生成血细胞；而 “bone” 是外部坚硬的钙化结构。两者是包含关系：骨髓存在于骨内，但骨髓本身不是骨头。"
    },
    {
      "word_to_compare": "cartilage",
      "analysis": "“Cartilage” (软骨) 是一种柔韧、有弹性的结缔组织，存在于关节、耳朵和鼻部，是骨骼发育的前体；而 “bone” 是完全钙化、坚硬的组织。软骨可骨化为骨，但骨不能变回软骨。"
    }
  ]
}