{
  "word": "bones",
  "pronunciation": "bohns",
  "concise_definition": "n. 骨头, 骨骼, 骨架",
  "forms": {
    "singular": "bone"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The rigid, calcified tissue that forms the structural framework of the body in vertebrates, providing support, protection for internal organs, and attachment points for muscles.",
      "explanation_cn": "脊椎动物体内由钙化组织构成的坚硬结构，为身体提供支撑、保护内脏器官，并作为肌肉附着的支点。",
      "example_en": "The skeleton is made up of 206 bones in the adult human body.",
      "example_cn": "成年人类的骨骼由206块骨头组成。"
    },
    {
      "pos": "noun",
      "explanation_en": "The remains of an animal's skeleton after death, often used metaphorically to suggest something lifeless, abandoned, or minimal.",
      "explanation_cn": "动物死亡后遗留的骨骼残骸，常被隐喻为无生命、被遗弃或仅存最基础部分的事物。",
      "example_en": "The old factory was reduced to nothing but bones after the fire.",
      "example_cn": "大火过后，那座旧工厂只剩下一片废墟。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small piece of something that remains after the main part has been consumed or removed, especially in food.",
      "explanation_cn": "指在主要部分被消耗或移除后残留下来的小块物，尤指食物中的骨头。",
      "example_en": "Be careful not to choke on the bones in the fish.",
      "example_cn": "小心别被鱼刺卡住。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slang term for money or financial resources, especially when referring to something valuable or hard-earned.",
      "explanation_cn": "俚语，指金钱或财务资源，尤其指辛苦赚来的钱财。",
      "example_en": "He saved up his bones to buy his first car.",
      "example_cn": "他攒了好久的钱才买了第一辆车。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "skeleton",
      "analysis": "“Skeleton”（骨架）指整个骨骼系统的结构，强调其作为整体框架的功能，常用于解剖学或比喻中（如“一个项目的骨架”）。而 “bones” 更侧重于单个骨骼或骨骼的物质实体，使用更口语化、具体。"
    },
    {
      "word_to_compare": "remains",
      "analysis": "“Remains”（遗骸）是一个更广泛的术语，可指任何生物死亡后的残留物，包括软组织、毛发、器官等。而 “bones” 仅指骨骼部分，范围更窄，且常带有更强烈的物质性或考古学含义。"
    },
    {
      "word_to_compare": "frame",
      "analysis": "“Frame”（框架）是抽象或物理结构的支撑系统，可用于建筑、图像、身体等语境，强调支撑功能而非物质构成。而 “bones” 是具体的生物组织，是身体框架的物质基础，不可互换于非生物语境。"
    }
  ]
}