{
  "word": "boogie",
  "pronunciation": "boo·jee",
  "concise_definition": "v. 跳迪斯科舞, 狂欢; n. 迪斯科舞, 布吉音乐",
  "forms": {
    "third_person_singular": "boogies",
    "past_tense": "boogied",
    "past_participle": "boogied",
    "present_participle": "boogying"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To dance energetically, especially to rock, funk, or disco music, often in a lively, free-form style.",
      "explanation_cn": "指随着摇滚、放克或迪斯科音乐充满活力地跳舞，通常以自由奔放、富有节奏感的方式进行。",
      "example_en": "They were boogying all night at the nightclub until the music stopped.",
      "example_cn": "他们在夜总会跳了一整晚的迪斯科舞，直到音乐停止。"
    },
    {
      "pos": "verb",
      "explanation_en": "To leave or depart quickly, often used in the phrase 'boogie down' or 'boogie out' (slang).",
      "explanation_cn": "（俚语）指迅速离开或撤退，常用于短语 'boogie down' 或 'boogie out'。",
      "example_en": "It's getting late — time to boogie before the cops show up.",
      "example_cn": "天快晚了，警察要来了，咱们赶紧走吧。"
    },
    {
      "pos": "noun",
      "explanation_en": "A style of rhythm and blues music with a strong beat, popular in the 1940s and 1950s, often associated with early rock and roll.",
      "explanation_cn": "一种20世纪40至50年代流行的节奏布鲁斯音乐风格，节奏强烈，常与早期摇滚乐相关联。",
      "example_en": "The band played a classic boogie with a driving piano and electric guitar.",
      "example_cn": "乐队演奏了一首节奏强劲的布吉音乐，配有动感的钢琴和电吉他。"
    },
    {
      "pos": "noun",
      "explanation_en": "A dance performed to boogie music, characterized by rhythmic hip movements and energetic footwork.",
      "explanation_cn": "一种伴随布吉音乐跳的舞蹈，以有节奏的臀部摆动和活泼的舞步为特征。",
      "example_en": "At the party, everyone joined in the boogie, moving to the beat of the old-school tunes.",
      "example_cn": "派对上，每个人都加入跳布吉舞，随着老式歌曲的节奏舞动。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "dance",
      "analysis": "“Dance” 是一个通用词，泛指任何有节奏的身体运动，而 “boogie” 特指一种充满活力、自由即兴的迪斯科或节奏布鲁斯风格舞蹈，带有强烈的文化和音乐背景，更具时代和风格限定性。"
    },
    {
      "word_to_compare": "disco",
      "analysis": "“Disco” 通常指1970年代流行的音乐类型或舞厅文化，强调电子节拍和华丽风格；而 “boogie” 更早源于1940–50年代的节奏布鲁斯，节奏更原始、更强调钢琴和吉他驱动，风格更接地气，常被视为迪斯科的前身。"
    },
    {
      "word_to_compare": "party",
      "analysis": "“Party” 指社交聚会，可能包含多种活动（如聊天、吃喝、跳舞），而 “boogie” 专指其中的跳舞行为，是“party”的一个子集。在俚语中，人们说 “Let’s boogie!” 是直接号召跳舞，而非泛指聚会。"
    }
  ]
}