{
  "word": "booth",
  "pronunciation": "booth",
  "concise_definition": "n. 小屋, 售货亭, 隔间, 投票箱",
  "forms": {
    "plural": "booths"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small enclosed structure or compartment, often used for a specific purpose such as selling goods, making phone calls, or voting.",
      "explanation_cn": "一种小型封闭式结构或隔间，通常用于特定用途，如售卖商品、打电话或投票。",
      "example_en": "She bought a hot dog from a food booth at the fair.",
      "example_cn": "她在集市上一个食品摊位买了一个热狗。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small enclosed space in a public place, especially one for making telephone calls or using a computer.",
      "explanation_cn": "公共场所中的小型封闭空间，尤指用于打电话或使用电脑的电话亭或电脑终端间。",
      "example_en": "He stepped into a phone booth to make a private call.",
      "example_cn": "他走进一个电话亭打了个私人电话。"
    },
    {
      "pos": "noun",
      "explanation_en": "A voting enclosure, typically a small room or cubicle where voters cast their ballots in private.",
      "explanation_cn": "一种投票隔间，通常是供选民秘密投票的小房间或隔间。",
      "example_en": "Voters lined up outside the polling booth to cast their ballots.",
      "example_cn": "选民们在投票站外排队等候投票。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small stand or stall at a trade show, fair, or exhibition where a company displays or sells its products.",
      "explanation_cn": "在贸易展、集市或展览会上，公司用来展示或销售产品的小型展台或摊位。",
      "example_en": "The tech startup had a colorful booth showcasing its new AI app.",
      "example_cn": "这家科技初创公司设有一个色彩鲜艳的展台，展示其新的AI应用。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "kiosk",
      "analysis": "“Kiosk”（信息亭/自助服务站）通常指开放或半开放的自助服务设施，常用于信息查询、购票或自助结账，多为固定安装且无封闭结构。而 “booth” 更强调封闭性，常有门或帘子，提供隐私，如电话亭或投票间。"
    },
    {
      "word_to_compare": "cubicle",
      "analysis": "“Cubicle”（隔间）多用于办公环境，指由低矮隔板围成的独立工作空间，通常无门，强调空间分隔而非功能独立。而 “booth” 通常有完整围挡甚至门，用于特定功能（如投票、通话），更注重私密性和专用性。"
    },
    {
      "word_to_compare": "stand",
      "analysis": "“Stand”（摊位）泛指任何用于展示或销售物品的平台或架子，通常是开放式的，如水果摊、花摊。而 “booth” 是一种有围挡的、更完整的结构，常带顶棚和墙壁，提供更完整的空间保护和功能隔离。"
    }
  ]
}