{
  "word": "border",
  "pronunciation": "bawr·duhr",
  "concise_definition": "n. 边界, 边境, 边缘; v. 与...接壤, 紧邻, 装饰边框",
  "forms": {
    "third_person_singular": "borders",
    "past_tense": "bordered",
    "past_participle": "bordered",
    "present_participle": "bordering"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A line or boundary that separates two countries, regions, or areas, often marked by natural features or man-made structures.",
      "explanation_cn": "指分隔两个国家、地区或区域的界线，通常由自然特征（如河流、山脉）或人工结构（如围墙、界碑）标示。",
      "example_en": "The border between Canada and the United States is the longest international border in the world.",
      "example_cn": "加拿大与美国之间的边界是世界上最长的国际边界。"
    },
    {
      "pos": "noun",
      "explanation_en": "The outer edge or margin of an object, surface, or area, often used to describe a decorative or defining frame.",
      "explanation_cn": "指物体、表面或区域的外缘或边缘，常用于描述装饰性或界定性的边框。",
      "example_en": "She framed the painting with a golden border to enhance its elegance.",
      "example_cn": "她用金色边框装裱这幅画，以增强其优雅感。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be adjacent to or share a boundary with another place or object.",
      "explanation_cn": "指与另一地点或物体相邻或共享边界。",
      "example_en": "Mexico borders the United States to the south.",
      "example_cn": "墨西哥位于美国以南，与之接壤。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form a border around something, often for decorative or structural purposes.",
      "explanation_cn": "指在某物周围形成边框，通常用于装饰或结构目的。",
      "example_en": "The garden was bordered by a low stone wall.",
      "example_cn": "花园四周由一道低矮的石墙围起。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "boundary",
      "analysis": "“Boundary” (界限) 更强调抽象或概念上的分界，如权限、责任或心理界限，常用于法律、社会或心理语境；而 “border” 更具体，多用于地理或物理空间的分界，如国界、田界。"
    },
    {
      "word_to_compare": "edge",
      "analysis": "“Edge” (边缘) 指物体最外侧的尖锐或清晰的界限，强调物理接触的末端，如刀刃的边缘、桌子的边缘；而 “border” 更宽泛，可指一个区域的外围地带，不一定尖锐，且常带有装饰或功能性的含义。"
    },
    {
      "word_to_compare": "frontier",
      "analysis": "“Frontier” (边疆) 常用于历史或开拓语境，指文明或国家尚未完全开发或控制的偏远边界地区，带有探索、未知或扩张的意味；而 “border” 是已明确划定、常受管理的界线，更注重法律和行政意义。"
    }
  ]
}