{
  "word": "borderline",
  "pronunciation": "bawr·duh·līn",
  "concise_definition": "adj. 边缘的, 临界的, 不明确的; n. 边缘性人格障碍患者",
  "forms": {
    "comparative": "borderliner",
    "superlative": "borderlinest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Situated at or near a boundary or limit, especially when the distinction between two categories is unclear or ambiguous.",
      "explanation_cn": "位于或接近某个边界或极限，尤其当两个类别之间的界限模糊不清时。",
      "example_en": "Her behavior was borderline inappropriate for a professional setting.",
      "example_cn": "她的行为在职业场合中处于不恰当的边缘。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Of a quality or condition that is barely sufficient, acceptable, or measurable; barely falling within a defined range.",
      "explanation_cn": "指某种品质或状况刚刚达到可接受、可测量或合格的最低标准，勉强符合某一范围。",
      "example_en": "The test score was borderline passing, just one point above the minimum.",
      "example_cn": "这次考试分数刚刚及格，只比最低线高了一分。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person diagnosed with borderline personality disorder (BPD), a mental health condition characterized by instability in mood, self-image, and interpersonal relationships.",
      "explanation_cn": "指被诊断为边缘性人格障碍（BPD）的人，这是一种以情绪、自我形象和人际关系不稳定为特征的心理健康障碍。",
      "example_en": "She is in therapy to manage her symptoms as a borderline.",
      "example_cn": "她正在接受治疗以管理作为边缘性人格障碍患者的相关症状。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "marginal",
      "analysis": "“Marginal”（边缘的）强调处于边缘、次要或不重要的位置，常带有负面含义，暗示被忽视或价值较低。而 “borderline” 更强调处于两个明确类别之间的临界状态，可能具有中性或模糊的含义，有时甚至暗示“勉强达标”。"
    },
    {
      "word_to_compare": "ambiguous",
      "analysis": "“Ambiguous”（模棱两可的）侧重于意义或解释的不确定性，常用于语言、符号或意图。而 “borderline” 更侧重于物理、数值或分类上的界限模糊，如分数、行为或诊断标准的临界点。"
    },
    {
      "word_to_compare": "critical",
      "analysis": "“Critical”（关键的）通常指处于决定成败的紧要关头，具有重大影响，常用于医疗或决策语境。而 “borderline” 更强调“刚好达到阈值”，不一定有紧急或严重后果，只是处于分界线上。例如：borderline diabetic（糖尿病前期） vs. critical condition（危重状态）。"
    }
  ]
}