{
  "word": "bore",
  "pronunciation": "bawr",
  "concise_definition": "v. 使厌烦, 钻孔; n. 令人厌烦的人或事, 钻孔",
  "forms": {
    "third_person_singular": "bores",
    "past_tense": "bored",
    "past_participle": "bored",
    "present_participle": "boring"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To cause someone to feel weary, uninterested, or dull due to lack of stimulation or variety.",
      "explanation_cn": "指因缺乏刺激或变化而使人感到厌倦、无趣或昏昏欲睡。",
      "example_en": "The long, monotonous lecture bored everyone in the room.",
      "example_cn": "这场漫长而单调的讲座让房间里所有人都感到厌烦。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a hole by drilling or digging, especially with a tool or machine.",
      "explanation_cn": "指用工具或机器钻孔或挖掘出一个孔洞。",
      "example_en": "The workers bored a tunnel through the mountain to connect the two cities.",
      "example_cn": "工人们在山中钻出一条隧道，以连接这两座城市。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that is extremely dull or tedious, causing boredom.",
      "explanation_cn": "指极其枯燥乏味的人或事物，使人感到厌烦。",
      "example_en": "He’s such a bore—he talks about nothing but his golf scores.",
      "example_cn": "他真是个无聊透顶的人，只会谈论他的高尔夫成绩。"
    },
    {
      "pos": "noun",
      "explanation_en": "A hole made by drilling or digging, especially in a solid material like wood, rock, or metal.",
      "explanation_cn": "指通过钻孔或挖掘在固体材料（如木材、岩石或金属）中形成的孔洞。",
      "example_en": "The bore of the engine cylinder must be precisely measured for optimal performance.",
      "example_cn": "发动机气缸的孔径必须精确测量以确保最佳性能。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "annoy",
      "analysis": "“Annoy”（使恼怒）强调因轻微干扰或冒犯而引起的烦躁或不快，情绪强度较轻，常与噪音、拖延等具体行为相关。而 “bore” 强调因单调、缺乏吸引力而导致的深层精神倦怠，是一种更持久、更内在的无聊感。"
    },
    {
      "word_to_compare": "drill",
      "analysis": "“Drill”（钻孔）作为动词时，常指有目的、重复性地进行钻孔动作，强调过程和方法，常用于教育或军事语境（如反复练习）。而 “bore” 更侧重于钻孔的结果——形成的孔洞本身，或钻孔行为的物理效果，语义更偏向工程或自然形成。"
    },
    {
      "word_to_compare": "tedious",
      "analysis": "“Tedious”（枯燥的）是形容词，描述事物本身具有令人厌倦的特性，与 “bore”（名词）作为被描述的对象高度相关。但 “bore” 可以指人，而 “tedious” 通常只修饰事物或活动。此外，作为动词的 “bore” 是主动造成厌烦的行为，而 “tedious” 是静态的属性描述。"
    }
  ]
}