{
  "word": "bosnian",
  "pronunciation": "bɔs·nee·ən",
  "concise_definition": "adj. 波斯尼亚的, n. 波斯尼亚人, 波斯尼亚语",
  "forms": {
    "plural": "bosnians"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to Bosnia, a country in southeastern Europe, or its people, culture, or language.",
      "explanation_cn": "与欧洲东南部国家波斯尼亚及其人民、文化或语言相关的。",
      "example_en": "The Bosnian War lasted from 1992 to 1995 and had a profound impact on the region.",
      "example_cn": "波斯尼亚战争从1992年持续到1995年，对该地区产生了深远影响。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person from Bosnia, especially one who identifies with the cultural or national identity of Bosnia and Herzegovina.",
      "explanation_cn": "来自波斯尼亚的人，尤指认同波斯尼亚和黑塞哥维那文化或民族身份的人。",
      "example_en": "Many Bosnians fled their homeland during the conflict and sought refuge in neighboring countries.",
      "example_cn": "许多波斯尼亚人在冲突期间逃离家园，前往邻国寻求庇护。"
    },
    {
      "pos": "noun",
      "explanation_en": "The South Slavic language spoken primarily in Bosnia and Herzegovina, closely related to Croatian and Serbian, and written in both Latin and Cyrillic scripts.",
      "explanation_cn": "主要在波斯尼亚和黑塞哥维那使用的南斯拉夫语，与克罗地亚语和塞尔维亚语密切相关，使用拉丁字母和西里尔字母两种书写系统。",
      "example_en": "Although Bosnian, Croatian, and Serbian are mutually intelligible, they are officially recognized as separate languages.",
      "example_cn": "尽管波斯尼亚语、克罗地亚语和塞尔维亚语可以相互理解，但它们被正式认定为三种独立的语言。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "serbian",
      "analysis": "“Serbian”（塞尔维亚语/塞尔维亚人）与“Bosnian”同属南斯拉夫语支，语言高度相似，但“Serbian”更强调与塞尔维亚国家、东正教文化和西里尔字母的关联，而“Bosnian”则与波斯尼亚的穆斯林文化传统和拉丁字母使用更紧密相关。两者在政治和民族认同上存在区分。"
    },
    {
      "word_to_compare": "croatian",
      "analysis": "“Croatian”（克罗地亚语/克罗地亚人）与“Bosnian”在语言结构上几乎相同，但“Croatian”强调克罗地亚民族身份、天主教传统和纯拉丁字母书写规范，而“Bosnian”在词汇中更多吸收土耳其语和阿拉伯语借词，反映其奥斯曼历史影响。"
    },
    {
      "word_to_compare": "yugoslav",
      "analysis": "“Yugoslav”（南斯拉夫的/南斯拉夫人）指前南斯拉夫社会主义联邦共和国时期的国家认同，涵盖多个民族，包括波斯尼亚人、塞尔维亚人、克罗地亚人等。而“Bosnian”是后南斯拉夫时代基于民族和地域的独立身份标识，强调地方性与文化独特性，不再包含泛南斯拉夫的政治含义。"
    }
  ]
}