{
  "word": "botanical",
  "pronunciation": "buh·tahn·ik·uhl",
  "concise_definition": "adj. 植物的, 植物学的, 植物相关的",
  "forms": {
    "comparative": "more botanical",
    "superlative": "most botanical"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to the science of botany, which is the study of plants, including their structure, classification, physiology, and ecology.",
      "explanation_cn": "与植物学相关的，即研究植物的结构、分类、生理和生态的科学。",
      "example_en": "The museum features a stunning collection of botanical illustrations from the 18th century.",
      "example_cn": "这座博物馆收藏了大量18世纪精美的植物学插图。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Consisting of or derived from plants; used to describe substances, materials, or products originating from plant sources.",
      "explanation_cn": "由植物组成或来源于植物的；用于描述源自植物的物质、材料或产品。",
      "example_en": "This skincare line uses only botanical extracts, such as aloe vera and chamomile.",
      "example_cn": "这个护肤品系列仅使用植物提取物，如芦荟和洋甘菊。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by an abundance of plant life or a strong emphasis on plant elements, often in design or decoration.",
      "explanation_cn": "以植物繁茂或强烈突出植物元素为特征，常用于设计或装饰中。",
      "example_en": "The greenhouse had a botanical atmosphere, with vines climbing the walls and ferns lining the pathways.",
      "example_cn": "这座温室充满植物气息，藤蔓攀爬墙壁，蕨类植物沿小径生长。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "plant",
      "analysis": "“Plant” (植物) 是一个名词，指具体的植物个体或种类，也可作动词表示“种植”。“Botanical” 是形容词，强调与植物学或植物来源相关的属性，具有学术性或分类性含义，范围更广，不直接指代实体植物本身。"
    },
    {
      "word_to_compare": "herbal",
      "analysis": "“Herbal” (草本的) 专指由药用草本植物制成或与草药相关的，常用于医药、茶饮或疗法语境。“Botanical” 范围更广，涵盖所有植物，包括树木、花卉、藻类等，不限于药用或草本类别。"
    },
    {
      "word_to_compare": "vegetal",
      "analysis": "“Vegetal” (植物性的) 多用于化学或生物学语境，强调物质来源于植物而非动物或矿物，常与“animal”或“mineral”相对。“Botanical” 更常用于描述与植物学研究、艺术或文化相关的特征，语义更丰富，更具描述性和专业性。"
    }
  ]
}