{
  "word": "bouncing",
  "pronunciation": "bow·sing",
  "concise_definition": "adj. 弹跳的, 充满活力的; v. 弹跳 (bounce 的现在分词)",
  "forms": {
    "base_form": "bounce",
    "third_person_singular": "bounces",
    "past_tense": "bounced",
    "past_participle": "bounced",
    "present_participle": "bouncing"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing something that moves by rebounding or springing off a surface, often with energy and liveliness.",
      "explanation_cn": "形容某物通过从表面反弹而运动，通常充满活力和动感。",
      "example_en": "The bouncing ball bounced higher with each hit.",
      "example_cn": "这个弹跳的球每次撞击后都弹得更高。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by high energy, enthusiasm, or a lively, upbeat mood; often used to describe a person’s demeanor or a vibrant atmosphere.",
      "explanation_cn": "形容充满活力、热情或活泼愉快的情绪；常用于描述人的精神状态或活跃的氛围。",
      "example_en": "She had a bouncing personality that made everyone around her smile.",
      "example_cn": "她性格活泼开朗，让周围的人都忍不住微笑。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move up and down or rebound repeatedly after hitting a surface, typically due to elasticity or force.",
      "explanation_cn": "指在撞击表面后因弹性或外力而反复上下弹跳。",
      "example_en": "The child was bouncing on the trampoline with pure joy.",
      "example_cn": "孩子在蹦床上快乐地弹跳着。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove or dismiss someone abruptly, especially from a job or a place; informal usage.",
      "explanation_cn": "（非正式用法）指突然解雇或驱逐某人，尤指从工作或某个地方赶走。",
      "example_en": "They were bouncing employees left and right during the restructuring.",
      "example_cn": "在重组期间，他们不断解雇员工。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "jumping",
      "analysis": "“Jumping” (跳跃) 指通过腿部力量主动离开地面，通常是一次性的、有目的的动作，如跳过障碍物。而 “bouncing” 更强调因接触表面后产生的连续反弹，常由外力或弹性引起，动作更连续、更被动。"
    },
    {
      "word_to_compare": "rebounding",
      "analysis": "“Rebounding” (反弹) 与 “bouncing” 非常接近，常可互换，但 “rebounding” 更强调“反弹回来”的物理过程，常用于体育（如篮球篮板球）或比喻性语境（如经济反弹），语气更正式。而 “bouncing” 更口语化，适用范围更广，包括情绪和动作。"
    },
    {
      "word_to_compare": "energetic",
      "analysis": "“Energetic” (精力充沛的) 是一个更广泛的形容词，泛指充满能量或活力的状态，可用于人、活动或系统。而 “bouncing” 作为形容词时，特指那种带有弹跳感、轻快、活泼的活力，更具象、更生动，常用于描述人的表情或举止。"
    }
  ]
}