{
  "word": "bounce",
  "pronunciation": "bowns",
  "concise_definition": "v. 弹跳, 反弹; n. 弹跳, 活力",
  "forms": {
    "third_person_singular": "bounces",
    "past_tense": "bounced",
    "past_participle": "bounced",
    "present_participle": "bouncing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To rebound or spring back after hitting a surface, typically due to elasticity or force.",
      "explanation_cn": "指在撞击表面后因弹性或外力而弹回、反弹。",
      "example_en": "The basketball bounced high off the hardwood floor.",
      "example_cn": "篮球重重地弹跳在硬木地板上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move with a series of quick, springy motions, often in an energetic or lively way.",
      "explanation_cn": "指以一系列轻快、有弹性的动作移动，常带有活力或兴奋的意味。",
      "example_en": "She bounced into the room, full of excitement.",
      "example_cn": "她充满兴奋地蹦蹦跳跳地走进房间。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove someone from a place or position abruptly or forcefully, often by official action.",
      "explanation_cn": "指突然或强制性地将某人从某个地方或职位上驱逐或开除，常用于官方语境。",
      "example_en": "The company bounced him from the team after the scandal.",
      "example_cn": "丑闻发生后，公司把他从团队中开除了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To send or transfer something (e.g., a check, call, or idea) from one person or place to another, often quickly or informally.",
      "explanation_cn": "指快速或非正式地将某物（如支票、电话、想法）从一个人或地方转给另一个人或地方。",
      "example_en": "Can you bounce me that report when you're done?",
      "example_cn": "你做完后能把那份报告发给我吗？"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of rebounding or the quality of elasticity in a surface or object.",
      "explanation_cn": "指弹跳的动作，或物体或表面的弹性品质。",
      "example_en": "The tennis ball has excellent bounce, making it ideal for fast courts.",
      "example_cn": "这个网球弹性极佳，非常适合快速球场。"
    },
    {
      "pos": "noun",
      "explanation_en": "Energetic spirit or liveliness, often used in phrases like 'have a bounce in one's step'.",
      "explanation_cn": "指充满活力的精神或朝气，常用于短语如 'have a bounce in one's step'（脚步轻快）。",
      "example_en": "After the vacation, he returned to work with a real bounce in his step.",
      "example_cn": "度假回来后，他回到工作岗位上脚步轻快，充满活力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rebound",
      "analysis": "“Rebound” (反弹) 更强调物理上的反向运动，常用于体育或科学语境，如球体撞击后的回弹，或经济衰退后的复苏。它比 “bounce” 更正式，且较少用于描述人的行为或情绪。而 “bounce” 更口语化，可同时用于物理动作、情绪状态和人际互动。"
    },
    {
      "word_to_compare": "hop",
      "analysis": "“Hop” (跳跃) 指短距离、小幅度的跳跃，通常是一次性的，且常用于小型生物（如兔子）或儿童动作。它缺乏 “bounce” 所包含的弹性、连续性和能量感。例如，兔子 hop，而篮球 bounce。"
    },
    {
      "word_to_compare": "revive",
      "analysis": "“Revive” (复兴/恢复) 指使某物或某人从衰弱、沉寂或死亡状态中恢复活力，是抽象意义上的“重新激活”。而 “bounce” 在比喻义中虽也指恢复活力，但更强调一种外在的、动态的、甚至轻快的恢复，如 ‘bounce back from illness’，带有更强的即时性和生命力。"
    }
  ]
}