{
  "word": "bounces",
  "pronunciation": "bowns",
  "concise_definition": "n. 弹跳, 弹回; v. 弹跳, 弹回, 快速移动",
  "forms": {
    "base_form": "bounce",
    "third_person_singular": "bounces",
    "past_tense": "bounced",
    "past_participle": "bounced",
    "present_participle": "bouncing",
    "plural": "bounces"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of rebounding or springing back after hitting a surface, especially in sports or physics contexts.",
      "explanation_cn": "指物体撞击表面后反弹或弹回的动作，常用于体育或物理语境中。",
      "example_en": "The basketball made three bounces before the player caught it.",
      "example_cn": "篮球弹跳了三次后，球员才接住它。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden increase or improvement, often used in economic or emotional contexts to describe a recovery or upswing.",
      "explanation_cn": "指突然的增加或改善，常用于经济或情绪语境中，形容复苏或上升趋势。",
      "example_en": "There was a bounce in the stock market after the positive earnings report.",
      "example_cn": "在发布盈利向好的报告后，股市出现了一波反弹。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move up and down or rebound repeatedly after hitting a surface, typically due to elasticity or force.",
      "explanation_cn": "指因弹性或外力作用而反复撞击表面后上下弹跳。",
      "example_en": "The ball bounces higher on concrete than on grass.",
      "example_cn": "球在混凝土上比在草地上弹得更高。"
    },
    {
      "pos": "verb",
      "explanation_en": "To send or transfer something quickly, often in a casual or informal manner (e.g., an email, a call, or a person).",
      "explanation_cn": "指快速发送或转移某物，常用于非正式语境中（如邮件、电话或人员）。",
      "example_en": "I'll bounce you an email with the details as soon as I finish.",
      "example_cn": "我一完成就给你发封邮件把细节发过去。"
    },
    {
      "pos": "verb",
      "explanation_en": "To leave a place quickly or abruptly, often used in slang to mean 'to go' or 'to depart'.",
      "explanation_cn": "指迅速或突然离开某个地方，常用于俚语中表示‘走’或‘离开’。",
      "example_en": "It's getting late — let's bounce before the club closes.",
      "example_cn": "天快晚了，咱们在俱乐部关门前赶紧走吧。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rebound",
      "analysis": "“Rebound”（反弹）更强调从撞击或低谷中回弹，常用于物理、金融或情绪恢复的语境，带有“恢复原状”或“逆转趋势”的含义。而 “bounce” 更通用，可指任何弹跳动作，也常用于非正式语境中表示‘离开’或‘发送’，语义范围更广。"
    },
    {
      "word_to_compare": "hop",
      "analysis": "“Hop”（跳跃）通常指短促、轻快的一次性跳跃，常用于人或小动物，动作幅度小且不强调弹性。而 “bounce” 强调因撞击而产生的连续或有弹性的回弹，常用于球类、物体或抽象趋势的上下波动。"
    },
    {
      "word_to_compare": "skip",
      "analysis": "“Skip”（跳跃/跳过）指轻快地跳跃前进，或故意跳过某事（如跳过课程），强调动作的节奏感或选择性忽略。而 “bounce” 不含‘跳过’的含义，其核心是物理上的弹跳或抽象意义上的快速转移/复苏。"
    }
  ]
}