{
  "word": "bouquet",
  "pronunciation": "boo·kay",
  "concise_definition": "n. 花束, 香气, 香味",
  "forms": {
    "plural": "bouquets"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A carefully arranged bunch of flowers, typically given as a gift or used for decorative purposes in ceremonies such as weddings.",
      "explanation_cn": "指精心搭配成束的鲜花，通常作为礼物赠送，或用于婚礼等仪式中的装饰。",
      "example_en": "She carried a beautiful bouquet of white roses and lilies down the aisle.",
      "example_cn": "她手捧一束洁白的玫瑰和百合，缓缓走过走道。"
    },
    {
      "pos": "noun",
      "explanation_en": "The complex and distinctive aroma of a wine or other fermented beverage, resulting from the combination of grape variety, fermentation, and aging processes.",
      "explanation_cn": "指葡萄酒或其他发酵饮料所具有的复杂而独特的香气，由葡萄品种、发酵过程和陈酿工艺共同形成。",
      "example_en": "The bouquet of this Bordeaux includes notes of blackcurrant, leather, and cedar.",
      "example_cn": "这款波尔多葡萄酒的香气带有黑醋栗、皮革和雪松的风味。"
    },
    {
      "pos": "noun",
      "explanation_en": "A pleasing combination of scents or qualities, often used metaphorically to describe a rich mixture of elements in art, music, or experience.",
      "explanation_cn": "指令人愉悦的多种气味或特质的组合，常用于比喻艺术、音乐或体验中丰富多元的元素融合。",
      "example_en": "The film’s soundtrack offers a bouquet of classical motifs and modern electronic sounds.",
      "example_cn": "这部电影的配乐融合了古典旋律与现代电子音效，形成了一种美妙的听觉组合。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "floral_arrangement",
      "analysis": "“Floral arrangement”（花艺布置）是一个更广义的术语，泛指任何有设计感的花卉组合，可能包括花瓶、容器、非植物材料等，常用于室内装饰。而 “bouquet” 特指手持的、通常为圆形或锥形的花束，强调可携带性和仪式性。"
    },
    {
      "word_to_compare": "aroma",
      "analysis": "“Aroma”（气味）泛指任何可闻到的气味，中性或日常使用，如食物、香水的气味。而 “bouquet” 在葡萄酒语境中专指复杂、多层次、经过陈酿形成的香气，具有专业性和审美评价的含义，比 “aroma” 更精致、更具体。"
    },
    {
      "word_to_compare": "fragrance",
      "analysis": "“Fragrance”（芳香）通常指人工或天然的香味，常用于香水、化妆品或植物散发的气味，强调愉悦感但不强调组合的复杂性。而 “bouquet” 在比喻用法中强调多种元素的和谐交融，不仅限于嗅觉，也可用于听觉、视觉等感官体验的综合美感。"
    }
  ]
}