{
  "word": "bourgeois",
  "pronunciation": "boor·zhwah",
  "concise_definition": "adj. 资产阶级的, 势利的, 平庸的; n. 资产阶级者",
  "forms": {
    "plural": "bourgeoisie",
    "comparative": "more bourgeois",
    "superlative": "most bourgeois"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characteristic of the bourgeoisie, especially in terms of materialistic values, conventional attitudes, and a preference for social stability over radical change.",
      "explanation_cn": "与资产阶级相关或具有其特征的，尤其指崇尚物质利益、保守价值观，以及偏好社会稳定而非激进变革的态度。",
      "example_en": "His bourgeois lifestyle included a suburban home, two cars, and a strict adherence to social norms.",
      "example_cn": "他的资产阶级生活方式包括一栋郊区住宅、两辆汽车和对社会规范的严格遵守。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by narrow-mindedness, conventionalism, and a lack of artistic or intellectual daring; often used pejoratively to describe taste or behavior seen as pretentious or unoriginal.",
      "explanation_cn": "以狭隘、守旧和缺乏艺术或智力上的冒险精神为特征；常用于贬义，形容被视为矫揉造作或缺乏原创性的品味或行为。",
      "example_en": "The museum’s exhibition was criticized as overly bourgeois, favoring safe, decorative art over challenging modernism.",
      "example_cn": "该博物馆的展览被批评为过于势利，偏爱安全、装饰性的艺术，而非具有挑战性的现代主义。"
    },
    {
      "pos": "noun",
      "explanation_en": "A member of the bourgeoisie; a person who holds middle-class values, especially those associated with materialism, respectability, and social conformity.",
      "explanation_cn": "资产阶级的一员；持有中产阶级价值观的人，尤其指那些与物质主义、体面和社会顺从相关的价值观。",
      "example_en": "The revolution sought to dismantle the power of the bourgeois and redistribute wealth to the working class.",
      "example_cn": "这场革命旨在推翻资产阶级的权力，将财富重新分配给工人阶级。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "middle-class",
      "analysis": "“Middle-class”（中产阶级）是一个社会经济分类术语，侧重于收入、职业和教育水平，是中性的描述。而 “bourgeois” 不仅指经济地位，更强调其文化态度和价值观，常带有批判色彩，暗示保守、势利或缺乏审美深度。"
    },
    {
      "word_to_compare": "conventional",
      "analysis": "“Conventional”（传统的、守旧的）泛指遵循常规或习俗，适用于任何领域（如艺术、行为）。而 “bourgeois” 是特定于资产阶级文化语境的贬义词，它隐含了对物质主义和虚伪体面的批判，语义更复杂、更具意识形态色彩。"
    },
    {
      "word_to_compare": "elite",
      "analysis": "“Elite”（精英）指社会、文化或智力上的顶尖阶层，常带有褒义或中性色彩，强调卓越与特权。而 “bourgeois” 指的是中产阶级的主流价值观，常被精英阶层视为庸俗、缺乏精神追求。两者在社会层级和价值判断上形成对立。"
    }
  ]
}