{
  "word": "bourbon",
  "pronunciation": "burr·buhn",
  "concise_definition": "n. 波本威士忌, 美国波本威士忌酒, 波本县产的威士忌",
  "forms": {
    "plural": "bourbons"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A type of American whiskey made primarily from corn (at least 51%) and aged in new charred oak barrels, known for its sweet, vanilla, and caramel notes.",
      "explanation_cn": "一种主要由玉米（至少51%）酿制、并在新烧焦的橡木桶中陈酿的美国威士忌，以其甜味、香草和焦糖风味著称。",
      "example_en": "He sipped a glass of aged bourbon by the fireplace.",
      "example_cn": "他坐在壁炉旁，小口啜饮着一杯陈年波本威士忌。"
    },
    {
      "pos": "noun",
      "explanation_en": "A member of the House of Bourbon, a European royal family that ruled France, Spain, and other territories from the 16th to the 19th centuries.",
      "explanation_cn": "指波旁王朝的成员，一个从16世纪到19世纪统治法国、西班牙及其他地区的欧洲王室家族。",
      "example_en": "Louis XIV was a famous Bourbon monarch who centralized power in France.",
      "example_cn": "路易十四是一位著名的波旁王朝君主，他将法国的权力高度集中。"
    },
    {
      "pos": "noun",
      "explanation_en": "A town in Kentucky, USA, after which the whiskey is named; also used to describe anything associated with this region or its cultural heritage.",
      "explanation_cn": "美国肯塔基州的一个城镇，波本威士忌即以其命名；也可泛指与该地区及其文化传统相关的事物。",
      "example_en": "The bourbon trail in Kentucky attracts thousands of tourists each year.",
      "example_cn": "肯塔基州的波本威士忌之路每年吸引成千上万的游客。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "whiskey",
      "analysis": "“Whiskey”（威士忌）是泛指所有由谷物发酵蒸馏而成的烈酒，包括苏格兰威士忌、爱尔兰威士忌、加拿大威士忌等。而 “bourbon” 是一种特定类型的美国威士忌，有严格的原料和陈酿规定（如玉米含量、新橡木桶等），因此是“whiskey”的一个子类。"
    },
    {
      "word_to_compare": "whisky",
      "analysis": "“Whisky” 是苏格兰、加拿大和日本等地对威士忌的拼写方式，与美国的 “whiskey” 拼写不同，但含义基本相同。而 “bourbon” 是美国特有的威士忌类型，其生产标准（如必须在美国生产、使用新橡木桶）使其区别于其他任何 “whisky”。"
    },
    {
      "word_to_compare": "brandy",
      "analysis": "“Brandy”（白兰地）是由水果（通常是葡萄）发酵后蒸馏而成的烈酒，而 “bourbon” 是由谷物（主要是玉米）制成的。两者原料、风味和酿造工艺完全不同：白兰地果香浓郁，波本则以香草、焦糖和木质味为主。"
    }
  ]
}