{
  "word": "boutique",
  "pronunciation": "boo·teek",
  "concise_definition": "n. 小型精品店, 专业小店; adj. 精品的, 小众的",
  "forms": {
    "plural": "boutiques"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small retail shop that offers specialized, often high-quality or fashionable goods, typically in clothing, accessories, or cosmetics, with a focus on unique or curated selections.",
      "explanation_cn": "指一家小型零售店，专门销售专业化、通常高品质或时尚的商品，如服装、配饰或化妆品，强调独特或精心挑选的商品组合。",
      "example_en": "She opened a boutique in the heart of the city selling handmade jewelry from local artisans.",
      "example_cn": "她在市中心开了一家精品店，出售本地工匠手工制作的珠宝。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, specialized firm or service provider that offers highly focused expertise in a narrow field, often implying exclusivity or premium quality.",
      "explanation_cn": "指在某一狭窄领域提供高度专业化服务的小型公司或机构，常暗示其服务具有排他性或高品质。",
      "example_en": "The startup hired a boutique consulting firm to design its branding strategy.",
      "example_cn": "这家初创公司聘请了一家专业咨询公司来设计其品牌策略。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that is small-scale, exclusive, specialized, and often high-quality or tailored to a niche market.",
      "explanation_cn": "形容某事物规模小、排他性强、专业化，通常品质优良或针对特定小众市场定制。",
      "example_en": "They offer a boutique travel experience with personalized itineraries and private guides.",
      "example_cn": "他们提供定制化的精品旅行体验，配有个性化行程和私人导游。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "store",
      "analysis": "“Store”（商店）是一个通用词，泛指任何销售商品的场所，规模和定位多样，从大型超市到街角小店都可称为 store。而 “boutique” 特指规模小、风格独特、商品精选的店铺，强调个性与品质，而非普通零售。"
    },
    {
      "word_to_compare": "shop",
      "analysis": "“Shop”（小店）在英式英语中常指小型零售点，但通常不隐含高端或专业化含义。而 “boutique” 不仅指规模小，更强调审美、独特性和目标客户群的精致性，常用于时尚、艺术或高端服务领域。"
    },
    {
      "word_to_compare": "specialty",
      "analysis": "“Specialty”（专业领域/特色商品）是名词或形容词，指某物的专长或特色，如 “a specialty of the house”。它描述的是内容或属性，而非实体机构。而 “boutique” 是一个具体的场所或组织，其核心特征是通过小规模和精选性体现专业性。"
    }
  ]
}