{
  "word": "bow",
  "pronunciation": "bou",
  "concise_definition": "n. 鞠躬, 绊索, 蝴蝶结; v. 鞠躬, 弯腰, 弹奏弦乐器",
  "forms": {
    "third_person_singular": "bows",
    "past_tense": "bowed",
    "past_participle": "bowed",
    "present_participle": "bowing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A gesture of bending the head or body forward as a sign of respect, greeting, or submission, often performed in formal or ceremonial contexts.",
      "explanation_cn": "一种为表示尊敬、问候或顺从而低头或弯腰的姿态，常用于正式或仪式性场合。",
      "example_en": "The actor took a deep bow after the standing ovation.",
      "example_cn": "在观众起立鼓掌后，演员深深鞠了一躬。"
    },
    {
      "pos": "noun",
      "explanation_en": "A knot made by tying a ribbon or string into two loops and two free ends, commonly used for decoration or fastening, such as on gifts or shoes.",
      "explanation_cn": "用丝带或绳子打成的两个环和两个自由端组成的结，常用于装饰或系紧，如礼品包装或鞋带。",
      "example_en": "She tied a red bow on top of the gift box.",
      "example_cn": "她在礼品盒顶部系了一个红色蝴蝶结。"
    },
    {
      "pos": "noun",
      "explanation_en": "A curved wooden instrument used to play stringed instruments such as the violin, cello, or double bass, typically made of horsehair stretched tightly across a stick.",
      "explanation_cn": "一种用于演奏小提琴、大提琴或低音提琴等弦乐器的弯曲木制工具，通常由紧绷在木杆上的马尾毛制成。",
      "example_en": "The violinist drew the bow across the strings with great expression.",
      "example_cn": "小提琴手用琴弓在琴弦上拉出富有表现力的旋律。"
    },
    {
      "pos": "verb",
      "explanation_en": "To bend the head or body forward as a gesture of respect, greeting, or submission.",
      "explanation_cn": "以低头或弯腰的动作表示尊敬、问候或顺从。",
      "example_en": "He bowed to the audience before beginning his speech.",
      "example_cn": "他在开始演讲前向观众鞠躬。"
    },
    {
      "pos": "verb",
      "explanation_en": "To play a stringed instrument using a bow, especially in classical music.",
      "explanation_cn": "使用琴弓演奏弦乐器，尤指在古典音乐中。",
      "example_en": "She has been bowing the cello since she was five years old.",
      "example_cn": "她五岁起就开始用琴弓拉大提琴。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "curtsey",
      "analysis": "“Curtsey”（屈膝礼）特指女性在正式场合行的屈膝下蹲礼节，与“bow”（鞠躬）在性别和动作形态上有所区别。虽然两者都表示尊敬，但“curtsey”是女性专属，而“bow”可为男女通用，且动作更偏向于前倾而非下蹲。"
    },
    {
      "word_to_compare": "knot",
      "analysis": "“Knot”（结）泛指任何将绳子、线等打结的形态，而“bow”特指一种对称的、带有两个环和两个自由端的装饰性结，如蝴蝶结。因此，“bow”是“knot”的一种子类型，具有特定的结构和用途。"
    },
    {
      "word_to_compare": "arco",
      "analysis": "“Arco”（用弓演奏）是音乐术语，专指用琴弓拉奏弦乐器，与“bow”作为名词或动词时的含义高度重合。但“arco”仅用于乐谱指示，是专业术语；而“bow”是日常语言中通用的词，既可作名词也可作动词，适用范围更广。"
    }
  ]
}