{
  "word": "bowing",
  "pronunciation": "boh·ing",
  "concise_definition": "n. 鞠躬, 行礼; v. 鞠躬, 屈服, 弯曲",
  "forms": {
    "base_form": "bow",
    "third_person_singular": "bows",
    "past_tense": "bowed",
    "past_participle": "bowed",
    "present_participle": "bowing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of bending the head or body forward as a gesture of respect, greeting, or submission, commonly practiced in formal or cultural contexts.",
      "explanation_cn": "作为尊重、问候或顺从的表示，头部或身体向前弯曲的动作，常见于正式或文化场合。",
      "example_en": "She gave a deep bowing to the audience after her performance.",
      "example_cn": "她在演出结束后向观众深深鞠了一躬。"
    },
    {
      "pos": "verb",
      "explanation_en": "To bend the head or body forward, especially as a sign of respect, deference, or worship.",
      "explanation_cn": "将头部或身体向前弯曲，尤指表示尊重、顺从或崇拜。",
      "example_en": "The courtiers bowed low before the emperor.",
      "example_cn": "朝臣们在皇帝面前深深鞠躬。"
    },
    {
      "pos": "verb",
      "explanation_en": "To yield or submit under pressure, often metaphorically, as in yielding to demands or authority.",
      "explanation_cn": "在压力下屈服或让步，常为比喻用法，指对要求或权威低头。",
      "example_en": "The government refused to be bowing to the protesters' demands.",
      "example_cn": "政府拒绝向抗议者的要求屈服。"
    },
    {
      "pos": "verb",
      "explanation_en": "To bend or curve under weight or pressure, often describing physical deformation of objects.",
      "explanation_cn": "在重量或压力下弯曲或变形，常用于描述物体的物理形变。",
      "example_en": "The old wooden beam was bowing under the weight of the roof.",
      "example_cn": "那根旧木梁在屋顶的重压下弯曲了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "curtseying",
      "analysis": "“Curtseying”（屈膝礼）特指女性在西方传统礼仪中行的屈膝礼，通常伴随膝盖弯曲和身体下蹲，是“bowing”在特定性别和文化语境中的变体。而 “bowing” 更通用，适用于男女及多种文化背景，动作以躯干前倾为主。"
    },
    {
      "word_to_compare": "kneeling",
      "analysis": "“Kneeling”（跪下）是双膝着地的完全俯身姿态，通常表达极高的敬意、祈祷或臣服，比 “bowing” 更具身体强度和宗教/仪式感。而 “bowing” 通常保持站立或半蹲，动作幅度较小，更常用于日常礼节。"
    },
    {
      "word_to_compare": "yielding",
      "analysis": "“Yielding”（让步）是抽象意义上的屈服，强调在意见、权力或要求上的退让，不涉及身体动作。而 “bowing” 在比喻用法中虽可表示屈服，但其本义始终与身体动作相关，更具形象性和视觉性。"
    }
  ]
}