{
  "word": "bowls",
  "pronunciation": "bohls",
  "concise_definition": "n. 碗, 碗状物, 保龄球; v. 打保龄球, 用碗盛装",
  "forms": {
    "singular": "bowl"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A rounded, open container, typically used for holding food or liquids, with a wide mouth and curved sides.",
      "explanation_cn": "一种圆形、开口的容器，通常用于盛放食物或液体，具有宽口和弧形侧壁。",
      "example_en": "She served soup in a large ceramic bowl.",
      "example_cn": "她把汤盛在一个大的陶瓷碗里。"
    },
    {
      "pos": "noun",
      "explanation_en": "A game played on a flat surface, in which players roll heavy balls toward a small target ball, commonly known as bowling.",
      "explanation_cn": "一种在平坦表面上进行的游戏，玩家将重球滚向一个小目标球，通常称为保龄球。",
      "example_en": "They spent the evening at the bowling alley, competing in five frames of bowls.",
      "example_cn": "他们晚上在保龄球馆玩了五局保龄球。"
    },
    {
      "pos": "noun",
      "explanation_en": "A bowl-shaped geographical feature, such as a valley or depression surrounded by higher land.",
      "explanation_cn": "一种碗状的地理特征，如被高地环绕的山谷或洼地。",
      "example_en": "The village lies in a natural bowl formed by the surrounding hills.",
      "example_cn": "村庄坐落在由周围山丘形成的天然碗状洼地中。"
    },
    {
      "pos": "verb",
      "explanation_en": "To play the game of bowling, especially by rolling a ball down a lane toward pins.",
      "explanation_cn": "玩保龄球，尤指将球沿球道滚向球瓶。",
      "example_en": "He bowls every Saturday with his friends at the local club.",
      "example_cn": "他每周六都和朋友在当地俱乐部打保龄球。"
    },
    {
      "pos": "verb",
      "explanation_en": "To serve or place something in a bowl.",
      "explanation_cn": "将某物盛入碗中。",
      "example_en": "She bowls the salad into individual portions for each guest.",
      "example_cn": "她把沙拉分装到每位客人的碗里。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bowl",
      "analysis": "“Bowl” 是单数形式，泛指碗状物或保龄球运动本身；而 “bowls” 是其复数形式，可指多个碗、多场保龄球比赛，或多个碗状地形。在动词用法中，”bowls“ 是第三人称单数形式（如 He bowls），而 “bowling” 是动名词或现在分词。"
    },
    {
      "word_to_compare": "cup",
      "analysis": "“Cup”（杯子）通常指较小、较浅、常有把手的容器，多用于盛饮；而 “bowl” 更深、更宽，适合盛放固体食物如汤、沙拉或谷物。在语义上，bowl 更强调容量和深度，cup 更强调便携和饮用功能。"
    },
    {
      "word_to_compare": "golf",
      "analysis": "“Golf”（高尔夫）和 “bowls”（保龄球）都是户外球类运动，但高尔夫使用球杆击球入洞，强调精准与策略；保龄球则是滚动球体撞击球瓶，强调力量控制与直线轨迹。两者在器材、场地和规则上完全不同，但都属于休闲竞技类运动。"
    }
  ]
}