{
  "word": "bows",
  "pronunciation": "bouz",
  "concise_definition": "n. 鞠躬, 弓, 蝴蝶结; v. 鞠躬, 弯腰",
  "forms": {
    "singular": "bow"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A gesture of bending the head or body forward as a sign of respect, greeting, or submission, often performed in formal or ceremonial contexts.",
      "explanation_cn": "一种为表示尊敬、问候或顺从而低头或弯腰的姿态，常用于正式或仪式性场合。",
      "example_en": "The actor took a deep bow after the standing ovation.",
      "example_cn": "在观众起立鼓掌后，演员深深鞠了一躬。"
    },
    {
      "pos": "noun",
      "explanation_en": "A curved piece of flexible material, typically wood or composite, used to propel arrows by tension, especially in archery.",
      "explanation_cn": "一种由木材或复合材料制成的弯曲弹性器具，通过张力发射箭矢，常用于射箭运动。",
      "example_en": "He carefully strung the bow before the competition.",
      "example_cn": "他在比赛前仔细地给弓上弦。"
    },
    {
      "pos": "noun",
      "explanation_en": "A decorative knot made by tying a ribbon or string into two loops and two tails, commonly used on gifts, clothing, or hair.",
      "explanation_cn": "由丝带或绳子打成两个环和两个垂尾的装饰性结，常用于礼品、服装或发型上。",
      "example_en": "She tied a red bow on the gift box before handing it to her friend.",
      "example_cn": "她在礼物盒上系了一个红色蝴蝶结，然后递给了朋友。"
    },
    {
      "pos": "verb",
      "explanation_en": "To bend the head or body forward as a gesture of respect, greeting, or acknowledgment.",
      "explanation_cn": "以低头或弯腰的动作表示尊敬、问候或致意。",
      "example_en": "The king bowed to the crowd as he appeared on the balcony.",
      "example_cn": "国王出现在阳台上时向人群鞠躬致意。"
    },
    {
      "pos": "verb",
      "explanation_en": "To curve or bend under pressure or weight, often describing the action of a flexible object like a branch or a bow.",
      "explanation_cn": "在压力或重量下弯曲，常用于描述树枝、弓等弹性物体的弯曲状态。",
      "example_en": "The branches bowed under the weight of the snow.",
      "example_cn": "树枝在积雪的重压下弯了下来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "curtsey",
      "analysis": "“Curtsey”（屈膝礼）特指女性在正式场合行的屈膝下蹲式问候礼，与“bow”（鞠躬）在性别和动作形态上不同。男性通常行“bow”，女性则行“curtsey”，两者虽都表示尊敬，但文化语境和身体动作有明确区分。"
    },
    {
      "word_to_compare": "arch",
      "analysis": "“Arch”（拱形）指一种结构上呈弧形的形状，如拱门或弓背，强调几何形态和承重结构，是静态名词。而“bow”作为名词时，特指用于射箭的弹性武器，或作为动词时强调弯曲的动作，具有功能性和动态性。"
    },
    {
      "word_to_compare": "knot",
      "analysis": "“Knot”（结）泛指任何用绳子打成的结，用途广泛，如系船、捆扎等，不具装饰性或特定形式。而“bow”作为蝴蝶结时，特指对称、美观、常用于装饰的双环结，具有明确的审美和礼仪功能。"
    }
  ]
}