{
  "word": "boxed",
  "pronunciation": "bokst",
  "concise_definition": "adj. 装在箱中的, 被限制的; v. 装箱, 打包, 击打 (box 的过去式和过去分词)",
  "forms": {
    "base_form": "box",
    "third_person_singular": "boxes",
    "past_tense": "boxed",
    "past_participle": "boxed",
    "present_participle": "boxing"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Contained or enclosed in a box or container, often implying physical restriction or protection.",
      "explanation_cn": "指被装入箱子或容器中，常暗示物理上的限制或保护。",
      "example_en": "The fragile glassware arrived safely, still boxed in its original packaging.",
      "example_cn": "易碎的玻璃器皿完好无损地送达，仍装在原始包装箱中。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Restricted or confined within limits, often metaphorically, such as in thinking, behavior, or options.",
      "explanation_cn": "比喻性地指被限制在某种框架、界限或范围内，常用于思想、行为或选择。",
      "example_en": "He felt boxed in by societal expectations and couldn't pursue his true passion.",
      "example_cn": "他感到被社会期望所束缚，无法追求自己真正的热情。"
    },
    {
      "pos": "verb",
      "explanation_en": "To place something into a box or container for storage, transport, or protection.",
      "explanation_cn": "指将某物放入箱子或容器中以便储存、运输或保护。",
      "example_en": "They boxed up all the old books before moving to the new apartment.",
      "example_cn": "搬家前，他们把所有旧书都装进了箱子。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strike or hit with the fists, especially in the context of the sport of boxing.",
      "explanation_cn": "指用手拳击打，尤指在拳击运动中。",
      "example_en": "The champion boxed his opponent for twelve rounds before winning by decision.",
      "example_cn": "这位冠军与对手打了十二个回合，最终以点数获胜。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "packed",
      "analysis": "“Packed” (装满的) 强调容器被填满或塞满，常暗示密度高或空间被充分利用，如“packed suitcase”（塞满的行李箱）。“Boxed” 则更强调容器的类型（箱子）和封装动作本身，不一定满。"
    },
    {
      "word_to_compare": "enclosed",
      "analysis": "“Enclosed” (被围住的) 是一个更广义的词，指被任何边界（墙、栅栏、围栏）包围，不限于箱子。“Boxed” 是“enclosed”的一种具体形式，特指用箱子或类似刚性容器封闭。"
    },
    {
      "word_to_compare": "caged",
      "analysis": "“Caged” (被关在笼中的) 常带有负面、压抑的隐喻，多用于动物或人被剥夺自由的情境。“Boxed” 虽也可比喻限制，但中性色彩更强，可指物理封装或结构约束，不一定有压迫感。"
    }
  ]
}