{
  "word": "boxes",
  "pronunciation": "bok·siz",
  "concise_definition": "n. 盒子, 箱子, 包厢, (拳击等的) 比赛",
  "forms": {
    "singular": "box"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A rigid container with flat sides and a lid, typically used for storing or transporting items.",
      "explanation_cn": "一种具有平直边壁和盖子的刚性容器，通常用于存放或运输物品。",
      "example_en": "She packed the books into cardboard boxes before moving to her new apartment.",
      "example_cn": "搬家前，她把书装进了纸板箱里。"
    },
    {
      "pos": "noun",
      "explanation_en": "A designated enclosed area in a theater, stadium, or other venue, usually elevated and reserved for a small group of spectators.",
      "explanation_cn": "剧院、体育场或其他场所中一个指定的封闭区域，通常位于高处，专供一小群观众使用。",
      "example_en": "They booked two seats in the royal box for the opera performance.",
      "example_cn": "他们为歌剧演出预订了皇家包厢的两个座位。"
    },
    {
      "pos": "noun",
      "explanation_en": "A match or contest in the sport of boxing, or the sport itself.",
      "explanation_cn": "指拳击运动中的一场比赛，或拳击运动本身。",
      "example_en": "The championship fight was an intense box between two undefeated fighters.",
      "example_cn": "这场冠军赛是两位不败拳手之间的一场激烈对决。"
    },
    {
      "pos": "noun",
      "explanation_en": "A compartment or cubicle, especially one used for a specific function such as a toilet, parking space, or checkout station.",
      "explanation_cn": "一个隔间或小室，尤指用于特定功能的，如厕所、停车位或收银台。",
      "example_en": "Please park in an available box near the entrance.",
      "example_cn": "请将车停在入口附近可用的停车位上。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "container",
      "analysis": "“Container”（容器）是一个更广泛的术语，泛指任何用于盛装物品的物体，包括袋子、桶、罐等，不限于有盖的刚性结构。而 “box” 特指具有硬质边壁和通常可开合盖子的矩形容器，结构更具体。"
    },
    {
      "word_to_compare": "crate",
      "analysis": "“Crate”（木箱）通常指由木材制成、用于重型运输的坚固容器，结构更粗糙，常用于工业或物流场景。而 “box” 可由纸板、塑料或金属制成，用途更广泛，包括日常收纳和零售包装。"
    },
    {
      "word_to_compare": "compartment",
      "analysis": "“Compartment”（隔间）强调一个被分隔出的内部空间，通常是更大结构的一部分（如火车车厢、抽屉），不一定有独立的外壁或盖子。而 “box” 是一个独立、完整的实体容器，可单独存在和移动。"
    }
  ]
}