{
  "word": "brace",
  "pronunciation": "brays",
  "concise_definition": "n. 支架, 支撑物; v. 支撑, 准备, 抵抗",
  "forms": {
    "third_person_singular": "braces",
    "past_tense": "braced",
    "past_participle": "braced",
    "present_participle": "bracing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A structural support or reinforcement, typically made of metal or wood, used to strengthen or stabilize something, such as a building, shelf, or joint.",
      "explanation_cn": "一种由金属或木材制成的结构支撑物或加固件，用于增强或稳定某物，如建筑、架子或关节。",
      "example_en": "The old bookshelf needed a metal brace to prevent it from collapsing.",
      "example_cn": "那架旧书架需要一个金属支架来防止它倒塌。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device worn to support or correct a part of the body, especially the leg or spine, often used in medical contexts.",
      "explanation_cn": "一种用于支撑或矫正身体某部位（尤其是腿部或脊柱）的装置，常用于医疗场景。",
      "example_en": "After the injury, she wore a leg brace for several months.",
      "example_cn": "受伤后，她佩戴了数月的腿部支具。"
    },
    {
      "pos": "verb",
      "explanation_en": "To prepare oneself mentally or physically for something difficult, challenging, or unpleasant.",
      "explanation_cn": "为应对困难、具有挑战性或不愉快的事情而从心理或身体上做好准备。",
      "example_en": "She braced herself for the bad news and took a deep breath.",
      "example_cn": "她做好了面对坏消息的准备，深吸了一口气。"
    },
    {
      "pos": "verb",
      "explanation_en": "To support or hold something firmly in place, often to prevent movement or damage.",
      "explanation_cn": "牢固地支撑或固定某物，通常是为了防止其移动或受损。",
      "example_en": "Workers braced the wall with wooden beams to avoid collapse during the earthquake.",
      "example_cn": "工人们用木梁支撑墙壁，以防止地震时倒塌。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "support",
      "analysis": "“Support” (支持) 是一个更广泛、更通用的词，可指任何形式的帮助、支撑或援助，包括情感、经济或物理层面。而 “brace” 更强调通过物理结构或主动准备来提供刚性支撑或抵御压力，常带有临时性或应急性。"
    },
    {
      "word_to_compare": "reinforce",
      "analysis": "“Reinforce” (加强) 指通过添加材料或结构来增强某物的强度或耐久性，通常是长期性的改进。而 “brace” 更侧重于临时性或结构性的固定，不一定增加材料，而是通过外力稳定现有结构。"
    },
    {
      "word_to_compare": "prepare",
      "analysis": "“Prepare” (准备) 是一个抽象动词，泛指为未来事件做心理或物质上的安排。而 “brace” 作为动词时，特指为即将来临的负面或冲击性事件做心理或身体上的紧张性准备，带有更强的紧迫感和对抗性。"
    }
  ]
}