{
  "word": "braid",
  "pronunciation": "brayd",
  "concise_definition": "n. 辫子, 编织物; v. 编, 编织",
  "forms": {
    "third_person_singular": "braids",
    "past_tense": "braided",
    "past_participle": "braided",
    "present_participle": "braiding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long, plaited strand of hair, fabric, or other material, typically formed by interlacing three or more strands in a diagonal pattern.",
      "explanation_cn": "由三股或更多股头发、织物或其他材料以斜向交织方式编成的长条状物，常见于发型或装饰品。",
      "example_en": "She wore her hair in a single braid down her back.",
      "example_cn": "她把头发编成一条辫子垂在背后。"
    },
    {
      "pos": "noun",
      "explanation_en": "A narrow strip of woven material, often used for decoration, fastening, or reinforcement (e.g., a shoelace or trim on clothing).",
      "explanation_cn": "一种窄长的编织物，常用于装饰、系紧或加固（如鞋带或服装镶边）。",
      "example_en": "The jacket had a leather braid along the cuffs for added style.",
      "example_cn": "这件夹克的袖口有一条皮革编织带，增添了时尚感。"
    },
    {
      "pos": "verb",
      "explanation_en": "To interlace three or more strands of hair, thread, or other flexible material in a diagonal pattern to form a braid.",
      "explanation_cn": "将三股或更多股头发、线或其他柔韧材料以斜向交织的方式编成辫子。",
      "example_en": "The girls spent the afternoon braiding each other's hair.",
      "example_cn": "女孩们整个下午都在互相编头发。"
    },
    {
      "pos": "verb",
      "explanation_en": "To weave or combine different elements together in a complex, interwoven way, often metaphorically.",
      "explanation_cn": "比喻性地将不同元素复杂地交织融合在一起。",
      "example_en": "The novel braids together themes of love, loss, and redemption.",
      "example_cn": "这部小说将爱情、失去与救赎的主题交织在一起。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "plait",
      "analysis": "“Plait” 是 “braid” 的英式英语同义词，两者在指编发或编织时几乎可以互换。但 “plait” 更常用于描述头发的编织，而 “braid” 的使用范围更广，可指织物、绳索等材料的编织，且在美式英语中更常用。"
    },
    {
      "word_to_compare": "weave",
      "analysis": "“Weave” (编织) 通常指用经纬线在织机上交叉编织成布料，强调结构的平面性和系统性；而 “braid” 强调的是三股或以上材料沿纵向斜向交织，形成条状结构，更具立体感和装饰性。"
    },
    {
      "word_to_compare": "twist",
      "analysis": "“Twist” (拧、绞) 指将两股材料旋转缠绕在一起，结构简单，通常不涉及多股交替交叉；而 “braid” 至少需要三股，并遵循特定的交替编织模式，结构更复杂、更牢固。"
    }
  ]
}