{
  "word": "brand",
  "pronunciation": "brænd",
  "concise_definition": "n. 品牌, 商标; v. 打上烙印, 标记, 使留下深刻印象",
  "forms": {
    "plural": "brands",
    "third_person_singular": "brands",
    "past_tense": "branded",
    "past_participle": "branded",
    "present_participle": "branding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A name, term, design, symbol, or combination thereof that identifies a product, service, or company and distinguishes it from competitors, often carrying emotional value and consumer trust.",
      "explanation_cn": "指用于识别某一产品、服务或公司的名称、术语、设计、符号或其组合，用以区别于竞争对手，通常承载着情感价值和消费者信任。",
      "example_en": "Coca-Cola is one of the most recognized brands in the world.",
      "example_cn": "可口可乐是全球最知名的品牌之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person’s or organization’s public image or reputation, especially in terms of how they are perceived by others.",
      "explanation_cn": "指个人或组织的公众形象或声誉，尤其指他人对其的感知方式。",
      "example_en": "She has built a personal brand as a thought leader in sustainable fashion.",
      "example_cn": "她已建立起作为可持续时尚领域思想领袖的个人品牌。"
    },
    {
      "pos": "verb",
      "explanation_en": "To mark or stamp something with a brand, especially to identify ownership or origin, often literally with a hot iron.",
      "explanation_cn": "指用烙铁等工具在物体上打上标记，通常用于标识所有权或来源，字面意义上常使用热铁。",
      "example_en": "Cowboys branded their cattle to prevent theft.",
      "example_cn": "牛仔们给牛群打上烙印以防被盗。"
    },
    {
      "pos": "verb",
      "explanation_en": "To associate something strongly with a particular identity or characteristic, often to influence perception or behavior.",
      "explanation_cn": "指将某事物与特定身份或特征紧密关联，以影响他人的认知或行为。",
      "example_en": "The scandal branded him as untrustworthy in the public eye.",
      "example_cn": "这场丑闻使他在公众眼中被贴上了不可信的标签。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "trademark",
      "analysis": "“Trademark”（商标）是法律术语，指经过官方注册、受法律保护的标志、名称或符号，用于识别商品或服务的来源。而 “brand” 是更广泛的概念，包含商标、形象、情感和消费者体验，是商标的上位概念。"
    },
    {
      "word_to_compare": "label",
      "analysis": "“Label”（标签）通常指物理上的标识或分类标签，如服装上的成分标签，或用于归类的简短描述（如“环保标签”）。它强调分类或说明，不必然承载品牌价值或情感联系。而 “brand” 强调长期建立的认同感和市场影响力。"
    },
    {
      "word_to_compare": "logo",
      "analysis": "“Logo”（标志）是品牌视觉识别系统的一部分，通常是图形或符号，用于代表品牌。它是品牌的一个组成部分，但不等于品牌本身。品牌包含 logo、口号、用户体验、声誉等综合元素。"
    }
  ]
}