{
  "word": "branch",
  "pronunciation": "branch",
  "concise_definition": "n. 分支, 分公司, 枝条; v. 分支, 分出, 拓展",
  "forms": {
    "plural": "branches",
    "third_person_singular": "branches",
    "past_tense": "branched",
    "past_participle": "branched",
    "present_participle": "branching"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A part or section that divides off from a main body, such as a tree limb, a division of a company, or a subdivision of an organization.",
      "explanation_cn": "指从主体分出的部分，如树木的枝条、公司的分公司或组织的下属部门。",
      "example_en": "The bank opened a new branch in the downtown area last month.",
      "example_cn": "上个月，这家银行在市中心开设了一家新分行。"
    },
    {
      "pos": "noun",
      "explanation_en": "A distinct line of development, study, or activity that stems from a larger field or discipline.",
      "explanation_cn": "指从一个更大领域或学科中衍生出的独立发展方向、研究领域或活动分支。",
      "example_en": "Cognitive psychology is a branch of psychology that studies mental processes.",
      "example_cn": "认知心理学是心理学的一个分支，研究心理过程。"
    },
    {
      "pos": "verb",
      "explanation_en": "To divide or split off into two or more parts, often forming a fork-like structure.",
      "explanation_cn": "指分裂成两个或多个部分，通常形成分叉状结构。",
      "example_en": "The river branches into several smaller streams as it flows through the valley.",
      "example_cn": "这条河在流经山谷时分成了几条小溪。"
    },
    {
      "pos": "verb",
      "explanation_en": "To extend or expand into a new area, field, or activity, especially in business or organizational contexts.",
      "explanation_cn": "指在商业或组织背景下扩展至新领域、行业或活动。",
      "example_en": "The tech company branched out into artificial intelligence and robotics.",
      "example_cn": "这家科技公司拓展到了人工智能和机器人领域。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "division",
      "analysis": "“Division” (部门/划分) 更强调组织或整体被人为划分成的独立部分，常用于公司、军队或行政结构中，具有明确的管理边界。而 “branch” 更侧重于从主干自然延伸或生长出的部分，常带有层级或形态上的延续性，如树枝或银行分行。"
    },
    {
      "word_to_compare": "offshoot",
      "analysis": "“Offshoot” (分支/衍生品) 与 “branch” 意义接近，但更常用于比喻性语境，指从原主体派生出的新事物，常带有非正式或次要的意味，如一个思想的 offshoot。而 “branch” 更中性，可用于正式结构（如公司分支）和自然结构（如树杈）。"
    },
    {
      "word_to_compare": "stem",
      "analysis": "“Stem” (主干/茎) 是与 “branch” 相对的概念，指事物的主干或起源部分。在植物学中，stem 是枝条生长的基础；在组织结构中，stem 可指总部或核心。因此，branch 总是相对于 stem 而存在的，二者构成母体与子体的关系。"
    }
  ]
}