{
  "word": "brazilian",
  "pronunciation": "bruh·zee·lee·uhn",
  "concise_definition": "adj. 巴西的, 巴西人的; n. 巴西人, 巴西语",
  "forms": {
    "plural": "brazilians"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or originating from Brazil, the largest country in South America, including its culture, language, geography, or people.",
      "explanation_cn": "与巴西有关或源自巴西的，包括其文化、语言、地理或人民。",
      "example_en": "Brazilian samba is a vibrant dance form with deep African roots.",
      "example_cn": "巴西桑巴是一种充满活力的舞蹈形式，具有深厚的非洲根源。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Referring to the Portuguese language as spoken in Brazil, which has distinct pronunciation, vocabulary, and grammar compared to European Portuguese.",
      "explanation_cn": "指在巴西使用的葡萄牙语，其发音、词汇和语法与欧洲葡萄牙语有显著差异。",
      "example_en": "She studied Brazilian Portuguese to better communicate with her Brazilian colleagues.",
      "example_cn": "她学习了巴西葡萄牙语，以便更好地与她的巴西同事交流。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is a native or inhabitant of Brazil.",
      "explanation_cn": "指巴西的原住民或居民。",
      "example_en": "Many Brazilians are passionate about football and follow their national team closely.",
      "example_cn": "许多巴西人对足球充满热情，并密切关注国家队的表现。"
    },
    {
      "pos": "noun",
      "explanation_en": "The variety of Portuguese spoken in Brazil, often used to distinguish it from other forms of Portuguese.",
      "explanation_cn": "指在巴西使用的葡萄牙语变体，常用于区别于其他形式的葡萄牙语。",
      "example_en": "Brazilian is widely understood across Latin America due to Brazil’s cultural influence.",
      "example_cn": "由于巴西的文化影响力，巴西葡萄牙语在拉丁美洲广为理解。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "south_american",
      "analysis": "“South American”（南美洲的）是一个地理范围更广的术语，涵盖所有南美洲国家（如阿根廷、哥伦比亚、智利等），而 “Brazilian” 仅特指巴西。巴西是南美洲最大的国家，但并非所有南美洲人都是巴西人。"
    },
    {
      "word_to_compare": "latino",
      "analysis": "“Latino”（拉丁裔）通常指来自拉丁美洲或讲罗曼语族语言（如西班牙语、葡萄牙语）的人群，但更常用于指讲西班牙语的人。巴西人是拉丁裔，但因其语言为葡萄牙语，有时在英语语境中被单独区分，不被默认归入 “Latino” 范畴。"
    },
    {
      "word_to_compare": "portuguese",
      "analysis": "“Portuguese”（葡萄牙的/葡萄牙语）指来自葡萄牙或使用欧洲葡萄牙语的人和语言。虽然巴西语源于葡萄牙语，但两者在发音、词汇和语法上已有显著差异。因此，说 “Brazilian” 更准确地指代巴西的语言和文化身份，而非葡萄牙本土。"
    }
  ]
}