{
  "word": "breaker",
  "pronunciation": "bray·kuhr",
  "concise_definition": "n. 打破者, 破浪者, 断路器, 解围者",
  "forms": {
    "plural": "breakers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person or thing that breaks or causes something to end, especially a rule, tradition, or barrier; often implies challenging the status quo.",
      "explanation_cn": "指打破规则、传统或障碍的人或事物，常暗示挑战现状或打破常规。",
      "example_en": "She was a breaker of gender norms in the 19th-century scientific community.",
      "example_cn": "她在19世纪的科学界是打破性别规范的先驱。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large wave that crashes onto the shore, typically formed when ocean waves encounter shallow water and lose energy.",
      "explanation_cn": "指当海浪遇到浅水区时因能量耗散而破碎形成的巨浪，常冲击海岸。",
      "example_en": "Surfers wait for the perfect breaker to ride the wave.",
      "example_cn": "冲浪者等待完美的破浪来乘浪而行。"
    },
    {
      "pos": "noun",
      "explanation_en": "An electrical device designed to automatically interrupt the flow of current in a circuit when overload or short circuit occurs, protecting equipment and preventing fires.",
      "explanation_cn": "指一种在电路过载或短路时自动切断电流的电气装置，用于保护设备并防止火灾。",
      "example_en": "The breaker tripped when too many appliances were plugged in at once.",
      "example_cn": "当同时插入太多电器时，断路器跳闸了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who resolves a deadlock or difficult situation, especially in sports or negotiations; a decisive player or factor.",
      "explanation_cn": "指在体育比赛或谈判中打破僵局、解决困难局面的人或关键因素，常指关键时刻发挥决定性作用者。",
      "example_en": "In the final minutes, the rookie became the game's breaker with a last-second goal.",
      "example_cn": "在比赛最后几分钟，这位新秀以一记压哨进球成为制胜关键。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "destroyer",
      "analysis": "“Destroyer” (毁灭者) 强调彻底的、不可逆的破坏，常用于物理或军事语境，如战舰或灾难性事件。而 “breaker” 更侧重于打破限制、规则或僵局，不一定造成毁灭，有时甚至带来积极变革。"
    },
    {
      "word_to_compare": "solver",
      "analysis": "“Solver” (解决者) 指通过分析或逻辑找到问题答案的人，强调理性与方法。而 “breaker” 更强调在僵局中以果断行动或突破性方式打破障碍，可能不依赖系统性分析，而是依靠勇气、时机或创新。"
    },
    {
      "word_to_compare": "wave",
      "analysis": "“Wave” (波浪) 是泛指任何波动的水体运动，而 “breaker” 是波浪的一种特定形态——即在浅水区破碎的浪。因此，“breaker” 是 “wave” 的子类，具有特定的物理条件和视觉特征。"
    }
  ]
}