{
  "word": "breakers",
  "pronunciation": "bray·kuhrz",
  "concise_definition": "n. 破浪者, 破碎波浪, 断路器, (棒球)曲线球",
  "forms": {
    "singular": "breaker"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Waves that collapse and crash onto the shore, typically due to the shallowing of the ocean floor; often used to describe powerful, foaming surf.",
      "explanation_cn": "指因海底变浅而崩溃并拍打在海岸上的波浪，通常形容强劲、泛白的海浪。",
      "example_en": "The surfers waited for the next set of breakers to ride.",
      "example_cn": "冲浪者们等待下一波破浪前来滑行。"
    },
    {
      "pos": "noun",
      "explanation_en": "An electrical device designed to automatically interrupt the flow of current in a circuit when it becomes overloaded or short-circuited, protecting equipment and preventing fires.",
      "explanation_cn": "一种电气装置，用于在电路过载或短路时自动切断电流，以保护设备并防止火灾。",
      "example_en": "The circuit breaker tripped when too many appliances were plugged in.",
      "example_cn": "当插头接入太多电器时，断路器跳闸了。"
    },
    {
      "pos": "noun",
      "explanation_en": "In baseball, a type of pitch that curves sharply downward or sideways as it approaches the batter, often used to deceive the hitter.",
      "explanation_cn": "在棒球中，指一种在接近击球手时急剧下坠或侧向弯曲的投球，常用于迷惑击球手。",
      "example_en": "The pitcher threw a devastating breaker that the batter swung at and missed.",
      "example_cn": "投手投出一记极具破坏力的曲线球，击球手挥棒落空。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that breaks or causes disruption, especially in a social, political, or emotional context (e.g., a relationship breaker).",
      "explanation_cn": "指打破或造成中断的人或事物，尤其用于社会、政治或情感语境中（如破坏关系的因素）。",
      "example_en": "Lack of communication was the real breaker in their marriage.",
      "example_cn": "缺乏沟通才是他们婚姻破裂的真正原因。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "waves",
      "analysis": "“Waves” (波浪) 是泛指水面上的波动，可以是平静的、起伏的或远处的，不必然破碎。而 “breakers” 特指那些因撞击海岸或浅水区而破碎、翻卷的波浪，强调其动态终结和冲击力。"
    },
    {
      "word_to_compare": "circuit breaker",
      "analysis": "“Circuit breaker” 是 “breaker” 在电气领域的具体化术语，二者可互换，但 “breaker” 作为独立词时含义更广，可指任何‘打破者’，如情感、规则或关系的破坏者。而 ‘circuit breaker’ 仅限于电气装置。"
    },
    {
      "word_to_compare": "curveball",
      "analysis": "“Curveball” (曲线球) 是棒球中一种特定类型的投球，与 ‘breaker’ 在棒球语境中高度重叠，但 ‘breaker’ 是更口语化、更宽泛的术语，可包括滑球、曲球、指叉球等具有突然转向的球种，而 ‘curveball’ 通常特指以旋转产生下坠轨迹的球。"
    }
  ]
}