{
  "word": "breastfeeding",
  "pronunciation": "brest·fēd·iŋ",
  "concise_definition": "n. 母乳喂养",
  "forms": {
    "verb_form": "breastfeed",
    "third_person_singular": "breastfeeds",
    "past_tense": "breastfed",
    "past_participle": "breastfed",
    "present_participle": "breastfeeding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The practice of feeding an infant or young child with milk directly from the mother's breast, providing essential nutrients and antibodies for healthy growth and immune development.",
      "explanation_cn": "指母亲直接用自己的乳房为婴儿或幼儿喂食母乳，以提供健康成长和免疫系统发育所必需的营养物质和抗体。",
      "example_en": "The World Health Organization recommends exclusive breastfeeding for the first six months of a baby's life.",
      "example_cn": "世界卫生组织建议婴儿出生后的前六个月进行纯母乳喂养。"
    },
    {
      "pos": "noun",
      "explanation_en": "A cultural and physiological practice that fosters emotional bonding between mother and child, often associated with long-term health benefits for both.",
      "explanation_cn": "一种促进母亲与婴儿之间情感联结的文化与生理实践，通常被认为对母婴双方都有长期的健康益处。",
      "example_en": "Many mothers choose breastfeeding not only for its health benefits but also for the intimate connection it creates.",
      "example_cn": "许多母亲选择母乳喂养，不仅因为其健康益处，更因为它能建立亲密的情感联结。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bottle-feeding",
      "analysis": "“Bottle-feeding”（奶瓶喂养）指使用奶瓶喂食配方奶粉或挤出的母乳，是一种人工喂养方式。它在便利性和可共享性上优于母乳喂养，但缺乏母乳中的活性抗体和免疫因子，且无法建立与母乳喂养同等程度的肌肤接触与情感联结。",
      "example_en": "While bottle-feeding allows other caregivers to participate, breastfeeding offers unique biological advantages.",
      "example_cn": "虽然奶瓶喂养允许其他照顾者参与，但母乳喂养具有独特的生理优势。"
    },
    {
      "word_to_compare": "weaning",
      "analysis": "“Weaning”（断奶）指逐渐停止母乳喂养并引入其他食物或液体的过程，是母乳喂养的后续阶段。母乳喂养强调持续供给母乳，而断奶则是有计划地过渡到其他营养来源，两者在时间上是连续但性质相反的阶段。",
      "example_en": "Weaning typically begins around six months, but breastfeeding can continue alongside solid foods for two years or more.",
      "example_cn": "断奶通常从六个月左右开始，但母乳喂养可以与辅食并行持续两年或更久。"
    },
    {
      "word_to_compare": "formula feeding",
      "analysis": "“Formula feeding”（配方奶喂养）是使用人工配制的婴儿奶粉替代母乳的喂养方式。它在营养成分上尽量模拟母乳，但无法复制母乳中复杂的生物活性物质、酶和免疫球蛋白。母乳喂养是自然生理过程，而配方奶喂养是技术性替代方案。",
      "example_en": "Formula feeding may be necessary when breastfeeding is not possible, but it does not provide the same immune protection.",
      "example_cn": "当母乳喂养不可行时，配方奶喂养可能是必要的，但它无法提供相同的免疫保护。"
    }
  ]
}