{
  "word": "breakdowns",
  "pronunciation": "brayk·dounz",
  "concise_definition": "n. 故障, 崩溃, 分解, 分析",
  "forms": {
    "singular": "breakdown"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A failure or cessation of function in a machine, system, or process, often due to mechanical, electrical, or operational issues.",
      "explanation_cn": "指机器、系统或过程因机械、电气或操作问题而发生的故障或停止运作。",
      "example_en": "The car suffered a sudden breakdown on the highway.",
      "example_cn": "汽车在高速公路上突然发生故障。"
    },
    {
      "pos": "noun",
      "explanation_en": "A mental or emotional collapse, often resulting from prolonged stress, anxiety, or exhaustion.",
      "explanation_cn": "指由于长期压力、焦虑或疲惫而导致的心理或情绪崩溃。",
      "example_en": "After months of overwork, she experienced a nervous breakdown.",
      "example_cn": "连续数月超负荷工作后，她出现了神经衰弱。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process of dividing something complex into smaller, more manageable parts for analysis or understanding.",
      "explanation_cn": "指将复杂的事物分解为更小、更易管理的部分，以便进行分析或理解。",
      "example_en": "The report included a detailed breakdown of the company’s quarterly expenses.",
      "example_cn": "报告中包含了公司季度支出的详细分解。"
    },
    {
      "pos": "noun",
      "explanation_en": "A deterioration or disintegration of a relationship, agreement, or social order.",
      "explanation_cn": "指关系、协议或社会秩序的恶化或瓦解。",
      "example_en": "The breakdown of communication led to the end of their partnership.",
      "example_cn": "沟通的破裂导致了他们合作关系的终结。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "failure",
      "analysis": "“Failure” (失败) 是一个更广泛的术语，泛指任何未达成目标或预期结果的情况，可以是行为、计划或努力的失败。而 “breakdown” 更强调系统性或结构性的崩溃，通常涉及功能的突然丧失或分解，尤其适用于机械、心理或组织层面。"
    },
    {
      "word_to_compare": "crash",
      "analysis": "“Crash” (崩溃/坠毁) 常用于描述突然、剧烈且通常具有破坏性的失败，尤其在交通（如飞机坠毁）或金融（如股市崩盘）语境中。它比 “breakdown” 更具冲击性和瞬时性，而 “breakdown” 可以是渐进的，也常用于非物理系统（如沟通、情绪）。"
    },
    {
      "word_to_compare": "analysis",
      "analysis": "“Analysis” (分析) 是一个中性术语，指系统性地研究或分解事物以理解其构成。而 “breakdown” 在作为名词使用时，特指分析的结果或分解后的组成部分，常带有实用性和结构性的含义，如财务分解、数据分解等，是分析的一种具体输出形式。"
    }
  ]
}