{
  "word": "breaking",
  "pronunciation": "bray·kɪŋ",
  "concise_definition": "n. 新闻快讯, 突破; adj. 破裂的, 突发的",
  "forms": {
    "base_form": "break",
    "past_tense": "broke",
    "past_participle": "broken",
    "present_participle": "breaking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sudden, urgent news report, especially one that interrupts regular programming or is released as it happens; often used in the phrase 'breaking news'.",
      "explanation_cn": "指突然发布的紧急新闻，尤其是打断常规节目或实时发布的新闻，常用于短语 'breaking news'（突发新闻）。",
      "example_en": "Breaking news: A major earthquake has struck the coastal region.",
      "example_cn": "突发新闻：一场大地震袭击了沿海地区。"
    },
    {
      "pos": "noun",
      "explanation_en": "A significant advancement or discovery that overcomes a long-standing obstacle or limitation.",
      "explanation_cn": "指在克服长期障碍或限制方面取得的重大进展或突破。",
      "example_en": "The scientific community hailed the new vaccine as a breaking development in pandemic control.",
      "example_cn": "科学界将这种新疫苗誉为疫情防控的重大突破。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that is cracked, fractured, or no longer intact; often used for physical objects or systems.",
      "explanation_cn": "形容某物出现裂纹、断裂或不再完整，常用于描述物理对象或系统。",
      "example_en": "She stepped carefully over the breaking glass on the floor.",
      "example_cn": "她小心翼翼地绕过地上碎裂的玻璃。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used to describe a situation or trend that is just beginning to emerge or become noticeable, especially in media or culture.",
      "explanation_cn": "用于描述刚刚开始出现或变得显著的情况或趋势，尤其在媒体或文化语境中。",
      "example_en": "That new artist is a breaking talent in the indie music scene.",
      "example_cn": "那位新艺人是独立音乐界正在崛起的天才。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "news",
      "analysis": "“News”（新闻）是泛指所有报道的信息，而 “breaking” 作为名词特指那些紧急、实时、具有高度时效性的新闻事件。所有 breaking news 都是 news，但并非所有 news 都是 breaking。"
    },
    {
      "word_to_compare": "breakthrough",
      "analysis": "“Breakthrough”（突破）是名词，强调的是成功克服障碍后的结果，通常用于科技、医学或科学领域，具有正面和决定性含义。而 “breaking” 作为名词时，既可以指新闻事件，也可以指正在发生的突破过程，语义范围更广，且不一定是最终成果。"
    },
    {
      "word_to_compare": "cracking",
      "analysis": "“Cracking”（开裂）是动词 “crack” 的现在分词，侧重于物理表面出现细小裂缝的过程，语气较轻，常用于非正式语境。而 “breaking” 更强调完全断裂或彻底破裂，语义强度更高，适用范围更广，包括抽象概念（如打破规则、打破纪录）。"
    }
  ]
}