{
  "word": "break",
  "pronunciation": "brayk",
  "concise_definition": "v. 打破, 中断, 休息, 破坏; n. 打破, 休息, 间隙",
  "forms": {
    "third_person_singular": "breaks",
    "past_tense": "broke",
    "past_participle": "broken",
    "present_participle": "breaking"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To separate something into pieces by force or impact, often resulting in damage or loss of integrity.",
      "explanation_cn": "指通过外力或冲击使某物分裂成碎片，通常导致损坏或完整性丧失。",
      "example_en": "She accidentally broke the vase when she knocked it off the shelf.",
      "example_cn": "她不小心把花瓶从架子上碰了下来，打碎了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To interrupt or stop an activity, process, or continuity, often temporarily.",
      "explanation_cn": "指暂时中断或停止某项活动、过程或连续性。",
      "example_en": "Let's take a break after this chapter; I need some coffee.",
      "example_cn": "这一章结束后我们休息一下吧；我需要喝杯咖啡。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fail to comply with a rule, law, promise, or expectation, often intentionally.",
      "explanation_cn": "指故意或过失地违反规则、法律、承诺或期望。",
      "example_en": "He broke his promise to call every Sunday.",
      "example_cn": "他违背了每周日打电话的承诺。"
    },
    {
      "pos": "verb",
      "explanation_en": "To escape from confinement or restraint, such as a prison or a routine.",
      "explanation_cn": "指从监禁、约束或常规中逃脱。",
      "example_en": "The prisoner broke out of jail last night.",
      "example_cn": "这名囚犯昨晚越狱了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A short period of rest or pause from work or activity.",
      "explanation_cn": "指工作或活动中的短暂休息或暂停。",
      "example_en": "We had a fifteen-minute break between meetings.",
      "example_cn": "两次会议之间我们休息了十五分钟。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden change or opportunity, especially one that leads to progress or success.",
      "explanation_cn": "指突然的转变或机会，尤其是能带来进展或成功的机会。",
      "example_en": "After years of struggle, she finally got her big break in Hollywood.",
      "example_cn": "经过多年的奋斗，她终于在好莱坞迎来了重大转机。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "crack",
      "analysis": "“Crack”（裂开）指物体表面出现细小的裂缝，但未完全断裂，强调的是初步的损伤或缝隙，程度较轻。而 “break” 表示完全断裂或中断，破坏性更强。例如：玻璃裂了（crack） vs. 玻璃碎了（break）。"
    },
    {
      "word_to_compare": "interrupt",
      "analysis": "“Interrupt”（打断）通常用于描述对话、流程或活动的暂时性中断，语气中性或礼貌，不涉及物理破坏或违反规则。而 “break” 可以是物理性的（打破）或规则性的（违约），语义范围更广，且常带有更强的突然性或破坏性。"
    },
    {
      "word_to_compare": "violate",
      "analysis": "“Violate”（违反）专指对法律、道德、协议等抽象规范的严重违背，语气正式且负面，多用于法律或伦理语境。而 “break” 在表示违反时更口语化，适用范围更广，包括承诺、习惯、规则等，语义相对轻一些。"
    }
  ]
}