{
  "word": "bred",
  "pronunciation": "bred",
  "concise_definition": "adj. 培育的, 驯养的; v. 培育, 繁殖 (breed 的过去式和过去分词)",
  "forms": {
    "base_form": "breed",
    "third_person_singular": "breeds",
    "present_participle": "breeding",
    "past_tense": "bred",
    "past_participle": "bred"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing an animal or plant that has been selectively bred over generations for specific traits, such as temperament, appearance, or productivity.",
      "explanation_cn": "指经过多代人工选择性繁殖，具有特定特征（如性情、外貌或生产力）的动物或植物。",
      "example_en": "She owns a well-bred Arabian horse known for its grace and speed.",
      "example_cn": "她养了一匹培育优良的阿拉伯马，以优雅和速度著称。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used to describe a person who has been raised in a particular social or cultural environment, often implying refinement or a specific upbringing.",
      "explanation_cn": "用于描述在特定社会或文化环境中成长起来的人，常暗示其教养良好或出身不凡。",
      "example_en": "He's a bred gentleman—polite, well-mannered, and always dressed impeccably.",
      "example_cn": "他是个教养良好的绅士，礼貌得体，总是穿着无可挑剔。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause animals or plants to reproduce, especially through controlled or selective mating to produce offspring with desired characteristics.",
      "explanation_cn": "指使动物或植物繁殖，尤指通过有控制或选择性的交配来培育具有理想特征的后代。",
      "example_en": "Farmers breed cattle for higher milk yield and disease resistance.",
      "example_cn": "农民培育牛群以提高产奶量和抗病能力。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a particular attitude, behavior, or quality to develop in someone over time through upbringing or environment.",
      "explanation_cn": "指通过教养或环境长期影响，使某人形成某种态度、行为或品质。",
      "example_en": "She was bred to believe that hard work is the key to success.",
      "example_cn": "她从小被教育相信努力工作是成功的关键。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "raised",
      "analysis": "“Raised” (抚养) 强调在成长过程中受到的照顾、教育和环境影响，适用于人和动物，但更常用于人类儿童的成长过程。而 “bred” 更侧重于遗传和有目的的培育，尤其在动物或强调社会教养时使用，语义更正式、更具选择性。"
    },
    {
      "word_to_compare": "reared",
      "analysis": "“Reared” 是 “raise” 的正式同义词，常用于描述儿童或动物的养育过程，语气中性，不强调遗传或选择性。而 “bred” 隐含了人为干预和遗传目标，常用于育种语境，带有更强的专业性和目的性。"
    },
    {
      "word_to_compare": "generated",
      "analysis": "“Generated” (产生) 是一个更通用的词，指通过某种过程产生结果，常用于数据、能量或抽象概念，不涉及生命体的繁殖或教养。而 “bred” 专用于生物体的繁殖或性格的长期塑造，具有生物学和文化语境的特定性。"
    }
  ]
}