{
  "word": "bridge",
  "pronunciation": "brij",
  "concise_definition": "n. 桥梁, 桥; v. 桥接, 连接, 弥合",
  "forms": {
    "plural": "bridges",
    "third_person_singular": "bridges",
    "past_tense": "bridged",
    "past_participle": "bridged",
    "present_participle": "bridging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A structure built to span a physical obstacle, such as a river, road, or valley, to provide passage over it.",
      "explanation_cn": "指为跨越河流、道路或山谷等物理障碍而建造的结构，以提供通行路径。",
      "example_en": "The Golden Gate Bridge is one of the most iconic landmarks in San Francisco.",
      "example_cn": "金门大桥是旧金山最著名的地标之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A means of connecting or uniting two separate things, especially to overcome a difference or gap (e.g., cultural, social, or emotional).",
      "explanation_cn": "指连接或统一两个分离事物的手段，尤其用于弥合文化、社会或情感上的差异或鸿沟。",
      "example_en": "Learning a second language can serve as a bridge between different cultures.",
      "example_cn": "学习第二语言可以成为不同文化之间的桥梁。"
    },
    {
      "pos": "verb",
      "explanation_en": "To connect or join two things that are separate or distant, often to reduce a gap or difference.",
      "explanation_cn": "指连接两个分离或相距较远的事物，通常是为了缩小差距或差异。",
      "example_en": "The new policy aims to bridge the gap between urban and rural healthcare access.",
      "example_cn": "这项新政策旨在弥合城乡医疗资源获取的差距。"
    },
    {
      "pos": "verb",
      "explanation_en": "In card games, to play a card that connects two suits or sequences to complete a combination.",
      "explanation_cn": "在纸牌游戏中，指出一张牌以连接两种花色或序列，从而完成组合。",
      "example_en": "She bridged the gap between the king and the nine by playing the ten.",
      "example_cn": "她打出一张十，连接了国王和九，完成了序列。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "link",
      "analysis": "“Link” (连接) 通常指两个事物之间建立直接、简单的关联，常用于抽象概念（如数据链接、人际关系），强调连接的通道或纽带，但不一定跨越显著的障碍。而 “bridge” 更强调跨越一个明显的间隔、鸿沟或障碍，具有更强的“克服距离”的含义。"
    },
    {
      "word_to_compare": "connect",
      "analysis": "“Connect” (连接) 是一个更通用的词，指使两个事物在物理或抽象层面产生联系，可以是临时的、轻微的或技术性的（如连接Wi-Fi）。而 “bridge” 暗示了更主动、更结构性的介入，常用于解决断裂或对立的问题，语义上更具目的性和建设性。"
    },
    {
      "word_to_compare": "span",
      "analysis": "“Span” (横跨) 主要强调物理上的长度覆盖，如一座桥横跨一条河，或时间跨度。它侧重于“覆盖范围”，而不一定包含“连接”或“沟通”的功能。而 “bridge” 不仅指跨越，更强调通过跨越实现连接、沟通或过渡的功能性目的。"
    }
  ]
}