{
  "word": "brigade",
  "pronunciation": "bri·gad",
  "concise_definition": "n. 旅, 特遣队, 队伍",
  "forms": {
    "plural": "brigades"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A large military unit, typically consisting of several battalions and commanded by a brigadier general, organized for combat or specific operational purposes.",
      "explanation_cn": "一种大型军事单位，通常由数个营组成，由准将指挥，用于作战或执行特定军事任务。",
      "example_en": "The infantry brigade was deployed to the border to reinforce the defense line.",
      "example_cn": "步兵旅被部署到边境，以加强防御线。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of people organized to perform a specific task, especially in emergency or civilian contexts, such as fire brigades or volunteer brigades.",
      "explanation_cn": "为执行特定任务而组织起来的一群人，尤其用于紧急情况或民用领域，如消防队或志愿队伍。",
      "example_en": "A team of volunteer brigades rushed to the site to help with the rescue efforts.",
      "example_cn": "一支志愿者队伍迅速赶往现场协助救援工作。"
    },
    {
      "pos": "noun",
      "explanation_en": "A collective term for a group of people sharing a common purpose or identity, often used metaphorically to emphasize unity and coordinated action.",
      "explanation_cn": "用于比喻性地指一群具有共同目标或身份的人，强调其团结与协同行动。",
      "example_en": "A brigade of artists came together to create a mural celebrating local culture.",
      "example_cn": "一群艺术家齐聚一堂，共同创作了一幅颂扬本地文化的壁画。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "division",
      "analysis": "“Division”（师）是比 “brigade”（旅）更大的军事单位，通常由多个旅组成，指挥层级更高。在军队编制中，division 是战略级单位，而 brigade 是战术级单位，规模更小、更灵活。"
    },
    {
      "word_to_compare": "regiment",
      "analysis": "“Regiment”（团）是传统陆军单位，通常由数个营组成，与 brigade 规模相近，但 regiment 更强调历史传统和部队认同感，而 brigade 更侧重于现代作战的多功能性和任务导向性。在某些军队中，brigade 已取代 regiment 作为主要作战单位。"
    },
    {
      "word_to_compare": "unit",
      "analysis": "“Unit”（单位）是一个泛指军事或组织中任何组成部分的通用词，可小至一个班，大至一个军团。而 “brigade” 是一个具体、标准化的编制单位，规模和结构更明确，属于 unit 的一种特定类型。"
    }
  ]
}