{
  "word": "broadway",
  "pronunciation": "brɔd·weɪ",
  "concise_definition": "n. 百老汇, 大道, 美国戏剧中心",
  "forms": {
    "plural": "broadways"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A major thoroughfare in New York City, especially the stretch in Manhattan known for its concentration of professional theaters and musical productions.",
      "explanation_cn": "纽约市的一条主要大道，尤其指曼哈顿地区集中了众多专业剧院和音乐剧演出的路段，是美国戏剧与音乐剧的中心。",
      "example_en": "She dreamed of starring in a musical on Broadway.",
      "example_cn": "她梦想着能在百老汇主演一部音乐剧。"
    },
    {
      "pos": "noun",
      "explanation_en": "The American theater industry collectively, especially commercial theater in New York City, known for high production values and popular appeal.",
      "explanation_cn": "泛指美国戏剧产业，尤指纽约市以高制作水准和广泛大众吸引力为特征的商业戏剧演出体系。",
      "example_en": "Broadway has launched the careers of many famous actors and composers.",
      "example_cn": "百老汇孕育了许多著名演员和作曲家的职业生涯。"
    },
    {
      "pos": "noun",
      "explanation_en": "A generic term used in other cities to refer to a main street or central commercial avenue, often named 'Broadway' by analogy to New York's famous street.",
      "explanation_cn": "在其他城市中，泛指主要街道或商业中心大道，常因仿效纽约的百老汇而命名为 'Broadway'。",
      "example_en": "The downtown district of San Francisco has a bustling Broadway lined with shops and restaurants.",
      "example_cn": "旧金山市中心有一条热闹的百老汇大道，两旁遍布商店和餐馆。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "theater",
      "analysis": "“Theater” (剧院/戏剧) 是一个通用术语，泛指表演艺术的场所或整体形式，可指任何国家、任何规模的演出场所。而 “Broadway” 特指纽约市商业戏剧的特定体系，具有地理、文化和产业的专有含义，是 “theater” 的一个子集和高端代表。"
    },
    {
      "word_to_compare": "west end",
      "analysis": "“West End” (伦敦西区) 是英国伦敦类似百老汇的戏剧中心，两者在功能和地位上完全对应，都是各自国家商业戏剧的最高殿堂。区别在于地理和文化背景：Broadway 代表美国流行文化，West End 更具英伦传统与古典戏剧底蕴。"
    },
    {
      "word_to_compare": "avenue",
      "analysis": "“Avenue” (大道) 是一个通用道路名称，指城市中宽阔的街道，不带有文化或艺术内涵。而 “Broadway” 虽然原意是 ‘宽阔的道路’，但在现代语境中已高度语义化，特指戏剧文化中心，其文化象征意义远超普通道路名称。"
    }
  ]
}