{
  "word": "broadcasting",
  "pronunciation": "broad·kast·iŋ",
  "concise_definition": "n. 广播, 电视播送, 传播",
  "forms": {
    "base_form": "broadcast",
    "past_tense": "broadcast",
    "past_participle": "broadcast",
    "present_participle": "broadcasting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of transmitting audio or video content via radio, television, or digital platforms to a wide audience simultaneously.",
      "explanation_cn": "指通过无线电、电视或数字平台向广大受众同时传输音频或视频内容的行为。",
      "example_en": "The broadcasting of the Olympic Games attracts millions of viewers worldwide.",
      "example_cn": "奥运会的电视转播吸引了全球数百万观众。"
    },
    {
      "pos": "noun",
      "explanation_en": "The industry or system involved in producing and transmitting media content to the public, including radio, television, and online streaming services.",
      "explanation_cn": "指生产并向公众传输媒体内容的行业或系统，包括广播、电视和在线流媒体服务。",
      "example_en": "She studied journalism with a focus on broadcasting and digital media.",
      "example_cn": "她学习新闻学，专攻广播与数字媒体。"
    },
    {
      "pos": "noun",
      "explanation_en": "The dissemination of information or messages to a broad audience, often metaphorically extending beyond traditional media.",
      "explanation_cn": "指向广大受众传播信息或消息，常用于比喻性地扩展至传统媒体之外的传播方式。",
      "example_en": "The company's social media campaign is a form of modern broadcasting, reaching customers instantly.",
      "example_cn": "该公司的社交媒体活动是一种现代传播形式，能即时触达客户。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "transmission",
      "analysis": "“Transmission”（传输）是一个更广泛的技术术语，泛指任何信号、数据或能量从一点到另一点的传递，可应用于电力、网络、通信等领域，不特指面向公众的内容传播。而 “broadcasting” 专指面向大众的媒体内容分发，具有明确的受众导向和传播目的。"
    },
    {
      "word_to_compare": "publishing",
      "analysis": "“Publishing”（出版）主要指将文字、图像等内容以印刷或数字形式正式发布，供公众阅读或获取，强调内容的固定性和可存取性，如书籍、期刊。而 “broadcasting” 强调实时性、一次性传播，内容通常不以实体形式留存，且以视听为主要媒介。"
    },
    {
      "word_to_compare": "streaming",
      "analysis": "“Streaming”（流媒体）是 “broadcasting” 在数字时代的具体实现方式之一，指通过互联网实时传输音视频内容。它与传统广播（如无线电、电视）在技术平台上有别，但核心目的相同——即时向广泛受众传播内容。因此，streaming 是 broadcasting 的子集或现代形式。"
    }
  ]
}