{
  "word": "broker",
  "pronunciation": "broh·kuhr",
  "concise_definition": "n. 经纪人, 中间人; v. 促成, 代理",
  "forms": {
    "plural": "brokers",
    "third_person_singular": "brokers",
    "past_tense": "brokered",
    "past_participle": "brokered",
    "present_participle": "brokering"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person or organization that acts as an intermediary between two parties to facilitate a transaction, especially in finance, real estate, or insurance.",
      "explanation_cn": "指在双方之间充当中间人以促成交易的人或机构，尤指在金融、房地产或保险领域。",
      "example_en": "The real estate broker helped us find a house that matched our budget and preferences.",
      "example_cn": "房地产经纪人帮我们找到了一套符合预算和偏好的房子。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who negotiates agreements or settlements between conflicting parties, often in labor disputes or political negotiations.",
      "explanation_cn": "指在冲突双方之间进行谈判、促成协议或和解的人，常用于劳资纠纷或政治谈判中。",
      "example_en": "The union hired a skilled broker to negotiate better working conditions with management.",
      "example_cn": "工会聘请了一位经验丰富的中间人，与管理层谈判改善工作条件。"
    },
    {
      "pos": "verb",
      "explanation_en": "To arrange or negotiate a deal or agreement between two or more parties, often involving complex terms or high stakes.",
      "explanation_cn": "指在两个或多个方之间安排或谈判达成协议，通常涉及复杂条款或重大利益。",
      "example_en": "The diplomat brokered a ceasefire between the two warring nations.",
      "example_cn": "这位外交官促成了两个交战国之间的停火协议。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "agent",
      "analysis": "“Agent” (代理人) 是一个更广泛的术语，泛指代表他人行事的人，可以是法律、商业或艺术领域的代表，不一定涉及交易撮合。而 “broker” 更强调在交易中作为中间人促成双方达成协议，尤其在金融或房地产领域具有特定含义。"
    },
    {
      "word_to_compare": "mediator",
      "analysis": "“Mediator” (调解人) 侧重于在冲突或争端中帮助双方达成共识，强调中立性和非强制性，通常不参与交易本身，而是促进沟通。而 “broker” 不仅调解，还积极促成具体交易或协议，常带有商业目的。"
    },
    {
      "word_to_compare": "intermediary",
      "analysis": "“Intermediary” (中间人) 是一个中性、通用的术语，泛指任何在双方之间传递信息或促成联系的人或机构，不特指交易或谈判。而 “broker” 是一种特定类型的中间人，通常具有专业资质，且其角色直接关联经济利益和交易完成。"
    }
  ]
}