{
  "word": "bronze",
  "pronunciation": "bronz",
  "concise_definition": "n. 青铜, 铜色, 铜奖; adj. 青铜的, 铜色的",
  "forms": {
    "plural": "bronzes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An alloy primarily composed of copper and tin, often used in sculpture, coins, and industrial applications due to its durability and resistance to corrosion.",
      "explanation_cn": "一种主要由铜和锡组成的合金，因其耐用性和抗腐蚀性，常用于雕塑、硬币和工业应用。",
      "example_en": "The statue was cast in bronze and stood proudly in the town square.",
      "example_cn": "这座雕像用青铜铸造，庄严地矗立在广场上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A reddish-brown color resembling the appearance of bronze metal, often used to describe skin tone or decorative finishes.",
      "explanation_cn": "一种类似青铜金属外观的红棕色，常用于描述肤色或装饰性表面。",
      "example_en": "After weeks at the beach, she had a beautiful bronze tan.",
      "example_cn": "在海滩待了几周后，她的皮肤呈现出美丽的古铜色。"
    },
    {
      "pos": "noun",
      "explanation_en": "The third-place medal awarded in competitions, ranking below gold and silver.",
      "explanation_cn": "在比赛中授予的第三名奖牌，排名低于金牌和银牌。",
      "example_en": "He won a bronze medal in the 100-meter sprint at the Olympics.",
      "example_cn": "他在奥运会上赢得了百米赛跑的铜牌。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Made of or resembling bronze; having a reddish-brown color or metallic luster.",
      "explanation_cn": "由青铜制成的或类似青铜的；具有红棕色或金属光泽的。",
      "example_en": "The bronze door handles added a touch of elegance to the old mansion.",
      "example_cn": "青铜门把手为这座老宅增添了一丝优雅。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "copper",
      "analysis": "“Copper” (铜) 是一种纯金属元素，呈红橙色，导电性极佳，常用于电线和管道。而 “bronze” 是铜的合金，通常含有锡或其他金属，硬度更高、更耐腐蚀，主要用于雕塑和机械部件。两者颜色相近，但成分和用途不同。"
    },
    {
      "word_to_compare": "gold",
      "analysis": "“Gold” (金) 是一种贵重金属，象征最高荣誉（如金牌），颜色为明亮的黄色，价值远高于青铜。在奖牌体系中，gold 代表第一名，bronze 代表第三名，二者在象征意义和物质价值上形成鲜明对比。"
    },
    {
      "word_to_compare": "patina",
      "analysis": "“Patina” (铜绿/包浆) 指金属（尤其是铜或青铜）表面因氧化或老化形成的绿色或褐色薄膜，是时间的痕迹。而 “bronze” 本身是材料名称，虽然 patina 常出现在青铜制品上，但它是表面现象，不是材料本身。"
    }
  ]
}