{
  "word": "brooding",
  "pronunciation": "broo·ding",
  "concise_definition": "adj. 阴郁的, 沉思的; v. 沉思, 郁郁寡欢",
  "forms": {
    "base_form": "brood",
    "present_participle": "brooding",
    "past_tense": "brooded",
    "past_participle": "brooded"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Characterized by deep, gloomy, or sullen thought; having a dark, moody, or menacing atmosphere.",
      "explanation_cn": "指充满深沉、阴郁或闷闷不乐的思考；具有黑暗、忧郁或威胁性的氛围。",
      "example_en": "The brooding sky before the storm made everyone feel uneasy.",
      "example_cn": "暴风雨前阴沉的天空让每个人都感到不安。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing a person who is lost in thoughtful, often melancholic or resentful reflection.",
      "explanation_cn": "形容一个人陷入深思，常带有忧郁或怨恨的情绪。",
      "example_en": "He sat in a brooding silence, staring at the fire.",
      "example_cn": "他沉默地坐着，郁郁寡欢地凝视着火焰。"
    },
    {
      "pos": "verb",
      "explanation_en": "To spend time thinking deeply and often unhappily about something, especially something troubling or painful.",
      "explanation_cn": "指长时间深思，尤其是对令人烦恼或痛苦的事情反复琢磨，常带有负面情绪。",
      "example_en": "She spent the whole evening brooding over her failed relationship.",
      "example_cn": "她整个晚上都在为失败的感情而郁郁沉思。"
    },
    {
      "pos": "verb",
      "explanation_en": "To sit on eggs to hatch them by keeping them warm; also used metaphorically to describe nurturing or incubating something over time.",
      "explanation_cn": "指母鸟伏在蛋上通过体温使其孵化；也可比喻性地指长期培育或酝酿某事物。",
      "example_en": "The hen was brooding her clutch of eggs in the nest.",
      "example_cn": "母鸡正伏在巢中的蛋上孵化。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "musing",
      "analysis": "“Musing”（沉思）指平静、温和的思考，常带有哲理性或诗意，情绪中性甚至愉悦。而 “brooding” 强调情绪阴暗、压抑，常伴随焦虑、愤怒或忧郁，带有负面心理负担。"
    },
    {
      "word_to_compare": "ruminating",
      "analysis": "“Ruminating”（反复思虑）与 “brooding” 都指反复思考，但 “ruminating” 更中性，常用于描述对问题的逻辑性反复推敲（如学术或决策），而 “brooding” 更强调情绪上的纠缠，常是无益的、自我消耗的沉溺。"
    },
    {
      "word_to_compare": "sulking",
      "analysis": "“Sulking”（生闷气）指因不满而沉默、回避，是一种外在行为表现，通常不涉及深层思考。而 “brooding” 是内在的心理活动，即使外表沉默，内心却在激烈地翻腾。"
    }
  ]
}