{
  "word": "brood",
  "pronunciation": "brood",
  "concise_definition": "v. 沉思, 忧虑; n. 一窝幼崽, 一群子女",
  "forms": {
    "third_person_singular": "broods",
    "past_tense": "brooded",
    "past_participle": "brooded",
    "present_participle": "brooding"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To think deeply or anxiously about something, often in a prolonged, gloomy, or obsessive way.",
      "explanation_cn": "指长时间、忧郁地或执拗地反复思考某事，常带有焦虑、沮丧或沉思的意味。",
      "example_en": "She sat by the window, brooding over the letter she had received.",
      "example_cn": "她坐在窗边，反复琢磨着那封收到的信。"
    },
    {
      "pos": "verb",
      "explanation_en": "To sit on eggs to hatch them, as a bird does; to nurture or care for young in a protective manner.",
      "explanation_cn": "指鸟类伏在蛋上使其孵化；也引申为以保护性的方式照料幼崽。",
      "example_en": "The hen brooded her chicks until they were strong enough to leave the nest.",
      "example_cn": "母鸡一直孵着小鸡，直到它们足够强壮可以离开巢穴。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of young animals, especially birds, hatched at the same time by one parent.",
      "explanation_cn": "指由同一亲鸟在同一时期孵化出的一窝幼鸟或其他幼崽。",
      "example_en": "The eagle returned to the nest with food for her brood.",
      "example_cn": "鹰妈妈叼着食物回到巢中，喂养她的雏鸟。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of people, especially children, considered collectively, often with a connotation of being numerous or closely related.",
      "explanation_cn": "指一群人，尤指子女，被作为一个整体看待，常带有数量众多或关系密切的意味。",
      "example_en": "He was the patriarch of a large brood of nine children.",
      "example_cn": "他是九个孩子的大家庭的家长。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ruminate",
      "analysis": "“Ruminate” (沉思) 与 “brood” 在‘反复思考’的含义上相近，但 “ruminate” 更中性，强调理性、深思熟虑的思考过程，而 “brood” 常带有负面情绪色彩，如忧郁、焦虑或怨恨，更强调情绪的纠缠。"
    },
    {
      "word_to_compare": "nest",
      "analysis": "“Nest” (巢穴) 指鸟类或其他动物筑造的用于栖息或育雏的物理结构，是一个地点名词。而 “brood” 作为名词时，指的是一窝幼崽本身，是生物群体，不是地点。两者常在语境中搭配，但语义焦点不同。"
    },
    {
      "word_to_compare": "offspring",
      "analysis": "“Offspring” (后代) 是一个中性、通用的生物学术语，泛指任何生物的子女或后裔，不强调数量或时间上的聚集性。而 “brood” 作为名词时，特指同一时期由同一亲代孵化或生育的一群幼崽，常用于鸟类或带有情感色彩的语境，更具文学性和群体感。"
    }
  ]
}