{
  "word": "brownies",
  "pronunciation": "brow·neez",
  "concise_definition": "n. 巧克力布朗尼（甜点）, （童子军）徽章, （俚语）小精灵",
  "forms": {
    "singular": "brownie"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A dense, fudgy square of baked chocolate dessert, typically made with cocoa or melted chocolate, sugar, eggs, and flour, often served with ice cream or whipped cream.",
      "explanation_cn": "一种质地浓稠、湿润的巧克力烘焙甜点，呈方形，通常由可可粉或融化的巧克力、糖、鸡蛋和面粉制成，常搭配冰淇淋或鲜奶油食用。",
      "example_en": "She baked a batch of homemade brownies for the school bake sale.",
      "example_cn": "她为学校的义卖活动烤了一盘自制的布朗尼蛋糕。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small badge or award given to members of the Girl Scouts or Brownie Guides, earned by completing specific tasks or demonstrating good behavior.",
      "explanation_cn": "女童军或小女童军成员通过完成特定任务或表现良好行为而获得的小徽章或奖励。",
      "example_en": "The little girl earned three brownies for helping her classmates clean up after lunch.",
      "example_cn": "这个小女孩因为帮助同学午餐后打扫卫生，获得了三枚徽章。"
    },
    {
      "pos": "noun",
      "explanation_en": "In folklore, a small, mischievous but helpful household spirit, often depicted as a brown, elf-like creature that performs chores at night.",
      "explanation_cn": "在民间传说中，一种体型小巧、淘气但乐于助人的家宅精灵，常被描绘为棕色、类似小精灵的生物，夜间会帮忙做家务。",
      "example_en": "According to the legend, the brownies would tidy the kitchen while the family slept.",
      "example_cn": "根据传说，这些小精灵会在家人睡觉时把厨房收拾干净。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cookie",
      "analysis": "“Cookie”（饼干）通常指扁平、酥脆的甜点，质地较干，成分简单，烘烤时间较长；而 “brownie” 更厚重、湿润、类似蛋糕或布丁，口感更浓郁，含更多脂肪和巧克力，属于介于蛋糕与饼干之间的甜点。"
    },
    {
      "word_to_compare": "badge",
      "analysis": "“Badge”（徽章）是泛指任何用于标识身份、成就或隶属关系的标志，可以是金属、塑料或布质；而 “brownie” 在童子军语境中特指一种用于奖励儿童完成任务的特定徽章，具有文化专属性和组织规范性。"
    },
    {
      "word_to_compare": "elf",
      "analysis": "“Elf”（精灵）是北欧神话中广泛存在的超自然生物，通常被描绘为高大、优雅、神秘的生物；而 “brownie” 是英国民间传说中体型矮小、衣着朴素、专为人类家庭服务的精灵，更贴近日常生活，且不具魔法威胁性，行为更偏向勤劳的家仆。"
    }
  ]
}