{
  "word": "brown",
  "pronunciation": "broun",
  "concise_definition": "adj. 棕色的, 褐色的; n. 棕色, 褐色; n. (Browns) 姓氏",
  "forms": {
    "comparative": "browner",
    "superlative": "brownest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Of a color between red and yellow, typically resembling the color of soil, wood, or roasted coffee beans; often used to describe skin tone, hair color, or natural materials.",
      "explanation_cn": "介于红色和黄色之间的颜色，通常类似于土壤、木材或烤咖啡豆的颜色；常用于描述肤色、发色或天然材料。",
      "example_en": "She has long brown hair and warm brown eyes.",
      "example_cn": "她有一头长长的棕色头发和温暖的棕色眼睛。"
    },
    {
      "pos": "noun",
      "explanation_en": "The color itself, used to refer to any shade ranging from light tan to dark chocolate.",
      "explanation_cn": "指这种颜色本身，用于描述从浅米色到深巧克力色之间的任何色调。",
      "example_en": "Brown is a classic color for leather furniture.",
      "example_cn": "棕色是皮革家具的经典颜色。"
    },
    {
      "pos": "noun",
      "explanation_en": "A surname, commonly found in English-speaking countries, derived from a descriptor of skin or hair color in medieval times.",
      "explanation_cn": "一个常见于英语国家的姓氏，源于中世纪对肤色或发色的描述。",
      "example_en": "John Brown is a well-known historian in our department.",
      "example_cn": "约翰·布朗是我们系一位著名的史学家。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of coffee bean or beverage made from roasted beans, often used in compound terms like 'brown coffee' or 'brown brew'.",
      "explanation_cn": "指一种由烘焙咖啡豆制成的咖啡或饮品，常用于复合词如 'brown coffee' 或 'brown brew'。",
      "example_en": "He prefers his morning brown over tea.",
      "example_cn": "他更喜欢早上喝咖啡而不是茶。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "brunette",
      "analysis": "“Brunette” (深色头发的女性) 专指拥有深棕色或黑色头发的女性，是特定于人发色的术语，带有性别和文化语境。而 “brown” 是通用颜色词，可描述任何物体，不特指人种或发色。"
    },
    {
      "word_to_compare": "tan",
      "analysis": "“Tan” (浅棕色) 指较浅、偏黄的棕色，常用于描述晒黑的皮肤或浅色皮革，强调明亮和轻盈感；而 “brown” 范围更广，包含从浅到深的所有色调，语义更宽泛。"
    },
    {
      "word_to_compare": "chestnut",
      "analysis": "“Chestnut” (栗色) 是一种特定的红棕色，常用于描述头发或马匹毛色，带有更鲜明的红色调；而 “brown” 是中性、基础色，不包含特定色相倾向，适用性更广。"
    }
  ]
}