{
  "word": "bruising",
  "pronunciation": "broo·zhihng",
  "concise_definition": "adj. 造成瘀伤的, 严重的, 残酷的; n. 瘀伤, 挫伤",
  "forms": {
    "base_form": "bruise",
    "plural": "bruises",
    "comparative": "more bruising",
    "superlative": "most bruising"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Causing or characterized by severe physical impact, often resulting in visible bruising or significant damage; used to describe contests, battles, or experiences that are harsh and physically or emotionally taxing.",
      "explanation_cn": "指造成严重撞击、通常导致明显瘀伤或重大损伤的；用于形容激烈、严酷的竞赛、战斗或经历，强调其身体或情感上的沉重负担。",
      "example_en": "The bruising debate left both candidates exhausted and emotionally drained.",
      "example_cn": "这场激烈的辩论让两位候选人都精疲力尽、情绪低落。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or causing a discolored mark on the skin due to broken blood vessels under the surface, typically from a blow or impact.",
      "explanation_cn": "指因皮下血管破裂而导致皮肤出现变色痕迹的，通常由撞击或外力造成。",
      "example_en": "She had a large bruising on her thigh after the fall.",
      "example_cn": "她摔倒后大腿上出现了一大块瘀伤。"
    },
    {
      "pos": "noun",
      "explanation_en": "A discolored area on the skin caused by trauma or impact that damages blood vessels beneath the surface without breaking the skin.",
      "explanation_cn": "因外伤或撞击导致皮下血管受损、皮肤未破裂而形成的皮肤变色区域。",
      "example_en": "The athlete had several bruises from the tackle, but no broken bones.",
      "example_cn": "这名运动员因冲撞出现了几处瘀伤，但没有骨折。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "blunt",
      "analysis": "“Blunt”（钝的、直率的）强调缺乏锋利或直接表达，常用于描述工具或言语；而 “bruising” 强调的是由冲击造成的物理或情感伤害，具有更强的破坏性和后果性。两者在语义上无直接重叠，但 “bruising” 可用于比喻中形容如 “blunt force” 一般的沉重打击。"
    },
    {
      "word_to_compare": "injury",
      "analysis": "“Injury”（伤害）是一个更广泛的术语，涵盖所有类型的生理损伤，包括骨折、割伤、扭伤等；而 “bruising” 是一种特定类型的软组织损伤，仅指皮下出血和瘀伤，是 “injury” 的子集。"
    },
    {
      "word_to_compare": "battering",
      "analysis": "“Battering”（猛烈击打）强调持续、反复的物理攻击，常用于描述暴力行为；“bruising” 则更侧重于攻击后留下的结果——瘀伤。两者常共现，但 “battering” 是过程，而 “bruising” 是结果。"
    }
  ]
}