{
  "word": "brunswick",
  "pronunciation": "bruhn·swik",
  "concise_definition": "n. 不伦瑞克（德国城市名；也用于地名、品牌名等）",
  "forms": {
    "plural": "Brunswicks"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A city in Lower Saxony, Germany, historically significant as the capital of the Duchy of Brunswick and the ancestral home of the House of Welf; also used in compound names of places, products, or institutions derived from this city.",
      "explanation_cn": "德国下萨克森州的一座城市，历史上曾是不伦瑞克公国的首府，也是韦尔夫家族的发源地；也用于以该城命名的其他地名、产品或机构名称中。",
      "example_en": "The Brunswick Monument commemorates the Duke of Brunswick who led troops in the Napoleonic Wars.",
      "example_cn": "不伦瑞克纪念碑是为了纪念在拿破仑战争中率领军队的不伦瑞克公爵。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of sausage, especially in North America, known as 'Brunswick sausage' — a smoked, spiced pork sausage traditionally associated with the region of Brunswick, Germany.",
      "explanation_cn": "一种香肠，尤其在北美被称为‘不伦瑞克香肠’——一种烟熏、调味的猪肉香肠，传统上与德国不伦瑞克地区相关。",
      "example_en": "We grilled some Brunswick sausages for the barbecue and they were delicious.",
      "example_cn": "我们在烧烤时烤了一些不伦瑞克香肠，味道非常棒。"
    },
    {
      "pos": "noun",
      "explanation_en": "A brand or model name used in various contexts, such as 'Brunswick Corporation' (a major American manufacturer of bowling equipment and boats) or 'Brunswick Billiards' (a famous line of pool tables).",
      "explanation_cn": "用于多种语境中的品牌或型号名称，例如‘不伦瑞克公司’（美国一家主要的保龄球设备和船只制造商）或‘不伦瑞克台球’（著名的台球桌系列）。",
      "example_en": "The bowling alley featured three Brunswick lanes with automatic scoring systems.",
      "example_cn": "保龄球馆配备了三条不伦瑞克球道，并配有自动计分系统。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "Braunschweig",
      "analysis": "“Braunschweig” 是德语中‘不伦瑞克’的原名，与 ‘Brunswick’ 为同一城市，前者为德语拼写，后者为英语化拼写。在英语语境中通常使用 ‘Brunswick’，而在德语或历史文献中使用 ‘Braunschweig’。"
    },
    {
      "word_to_compare": "sausage",
      "analysis": "“Sausage” 是泛指所有类型的香肠，而 ‘Brunswick’ 作为名词时特指一种源自德国不伦瑞克地区的特定香肠品种，具有地域性和风味特征，属于 ‘sausage’ 的一个子类。"
    },
    {
      "word_to_compare": "brand",
      "analysis": "“Brand” 是泛指商业品牌或商标，而 ‘Brunswick’ 本身是一个具体品牌名称，具有历史传承和产业代表性（如保龄球、船舶制造），因此它是一个具体的品牌实例，而非抽象概念。"
    }
  ]
}