{
  "word": "brushes",
  "pronunciation": "bruhsh·iz",
  "concise_definition": "n. 刷子, 刷拭动作, 一笔, 短暂接触",
  "forms": {
    "singular": "brush"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A tool with bristles, hairs, or fibers attached to a handle, used for cleaning, painting, grooming, or applying substances.",
      "explanation_cn": "一种带有鬃毛、毛发或纤维并装有手柄的工具，用于清洁、绘画、梳理毛发或涂抹物质。",
      "example_en": "She picked up a paintbrush and began to sketch the landscape.",
      "example_cn": "她拿起一支画笔，开始勾勒风景。"
    },
    {
      "pos": "noun",
      "explanation_en": "A light or brief contact or encounter, often accidental or fleeting.",
      "explanation_cn": "指轻微或短暂的接触或相遇，通常是偶然或转瞬即逝的。",
      "example_en": "He had only a brush with fame when his song briefly topped the charts.",
      "example_cn": "当他的歌曲短暂登顶排行榜时，他曾短暂地与名气擦肩而过。"
    },
    {
      "pos": "noun",
      "explanation_en": "A single stroke or mark made with a brush, especially in painting or writing.",
      "explanation_cn": "指用刷子画出的一笔或一道痕迹，尤指绘画或书写中的笔触。",
      "example_en": "The artist’s bold brushes conveyed emotion more than detail.",
      "example_cn": "这位艺术家大胆的笔触比细节更能传达情感。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of closely packed hairs or fibers, especially those forming the head of a brush.",
      "explanation_cn": "指紧密排列的毛发或纤维，尤指刷子的刷头部分。",
      "example_en": "The toothbrush’s bristles were worn down after months of use.",
      "example_cn": "这把牙刷的刷毛在使用数月后已经磨损。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "broom",
      "analysis": "“Broom”（扫帚）是一种大型清洁工具，通常用于清扫地面，其结构更粗大，不适合精细操作。而 “brushes” 更广泛，可指各种尺寸和用途的刷子，包括精细的化妆刷、画笔或牙刷，强调工具的多样性与适用性。"
    },
    {
      "word_to_compare": "stroke",
      "analysis": "“Stroke”（笔画）是绘画或书写中的一笔动作，强调动作本身；而 “brush” 作为名词时，可指完成该动作的工具（如画笔）或该动作留下的痕迹（如一笔色彩）。两者语义相关，但 “brush” 更具实体性，而 “stroke” 更抽象。"
    },
    {
      "word_to_compare": "contact",
      "analysis": "“Contact”（接触）是泛指任何物理或非物理的交互，语义范围更广；而 “brush” 作为名词表示接触时，特指轻微、短暂、擦过的接触，带有动作的轻盈感和偶然性，常用于比喻语境，如 ‘a brush with danger’。"
    }
  ]
}