{
  "word": "brush",
  "pronunciation": "bruhsh",
  "concise_definition": "n. 刷子, 画笔; v. 刷, 擦, 轻触",
  "forms": {
    "third_person_singular": "brushes",
    "past_tense": "brushed",
    "past_participle": "brushed",
    "present_participle": "brushing",
    "plural": "brushes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A tool with bristles, hairs, or wires set into a handle, used for cleaning, painting, or grooming.",
      "explanation_cn": "一种带有鬃毛、毛发或金属丝并装在手柄上的工具，用于清洁、绘画或梳理。",
      "example_en": "She picked up a paintbrush and began to sketch the landscape.",
      "example_cn": "她拿起一支画笔，开始勾勒风景。"
    },
    {
      "pos": "noun",
      "explanation_en": "A brief or light contact or encounter, often accidental or fleeting.",
      "explanation_cn": "指短暂或轻微的接触或相遇，通常是偶然或转瞬即逝的。",
      "example_en": "He had a brush with the law when he was young.",
      "example_cn": "他年轻时曾与法律有过一次轻微的冲突。"
    },
    {
      "pos": "verb",
      "explanation_en": "To clean, smooth, or remove something by moving a brush across a surface.",
      "explanation_cn": "通过用刷子在表面移动来清洁、抚平或去除某物。",
      "example_en": "He brushed the crumbs off the table before setting the napkins.",
      "example_cn": "他在摆放餐巾前把桌上的碎屑刷掉了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or pass lightly over a surface, often without full contact or with minimal force.",
      "explanation_cn": "轻擦或掠过某表面，通常不完全接触或仅施加最小力量。",
      "example_en": "The bird's wing brushed against the window as it flew by.",
      "example_cn": "鸟儿飞过时，翅膀轻轻擦过窗户。"
    },
    {
      "pos": "verb",
      "explanation_en": "To apply paint, ink, or other medium using a brush.",
      "explanation_cn": "使用画笔涂抹颜料、墨水或其他介质。",
      "example_en": "The artist brushed layers of color onto the canvas.",
      "example_cn": "艺术家在画布上层层涂抹色彩。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "broom",
      "analysis": "“Broom”（扫帚）是一种大型清洁工具，通常用于清扫地面，强调大面积、强力的清扫动作。而 “brush” 更小巧，适用于精细清洁或特定表面（如头发、画布、牙齿），动作更轻柔、精准。"
    },
    {
      "word_to_compare": "sweep",
      "analysis": "“Sweep”（扫）是一个更广泛的动词，指用工具（如扫帚或手）将物体从表面清除，强调动作的连续性和覆盖范围。而 “brush” 更强调轻柔、短促的接触，不一定清除全部，有时仅是掠过或轻微清理。"
    },
    {
      "word_to_compare": "touch",
      "analysis": "“Touch”（触碰）泛指任何身体或物体的接触，中性且无方向性。而 “brush” 作为动词时，特指一种轻快、滑动式的接触，常带有轻微摩擦或擦过的意味，比 “touch” 更具动态感和物理轨迹。"
    }
  ]
}