{
  "word": "bubble",
  "pronunciation": "buhb·l",
  "concise_definition": "n. 气泡, 泡沫; v. 冒泡, 沸腾, 兴奋",
  "forms": {
    "plural": "bubbles",
    "third_person_singular": "bubbles",
    "past_tense": "bubbled",
    "past_participle": "bubbled",
    "present_participle": "bubbling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small sphere of air or gas enclosed in a thin film of liquid, often seen in water, soap solutions, or carbonated drinks.",
      "explanation_cn": "指由液体薄膜包裹的微小空气或气体球体，常见于水、肥皂水或碳酸饮料中。",
      "example_en": "The children laughed as they blew soap bubbles in the garden.",
      "example_cn": "孩子们在花园里吹肥皂泡，笑声不断。"
    },
    {
      "pos": "noun",
      "explanation_en": "A period of rapid, often unsustainable growth in the price of an asset or market, followed by a sudden collapse, typically driven by speculation.",
      "explanation_cn": "指某种资产或市场因投机行为而出现的快速、往往不可持续的价格上涨阶段，随后会突然崩溃。",
      "example_en": "The dot-com bubble of the late 1990s led to massive losses when tech stocks crashed.",
      "example_cn": "20世纪90年代末的互联网泡沫在科技股崩盘后导致了巨额亏损。"
    },
    {
      "pos": "verb",
      "explanation_en": "To produce or emit small bubbles, especially as a result of boiling or effervescence.",
      "explanation_cn": "指因沸腾或冒泡而产生或释放出小气泡。",
      "example_en": "The tea was bubbling gently on the stove.",
      "example_cn": "茶在炉子上轻轻冒着泡。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be filled with excitement, enthusiasm, or emotion, often expressed in a lively or effervescent manner.",
      "explanation_cn": "指充满兴奋、热情或情感，常以活泼、洋溢的方式表现出来。",
      "example_en": "She was bubbling with joy after hearing the good news.",
      "example_cn": "听到这个好消息后，她兴奋得不得了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "foam",
      "analysis": "“Foam” (泡沫) 指由大量气泡聚集形成的绵密、持久的物质，通常覆盖在液体表面，如啤酒泡沫或洗发水泡沫。它强调的是气泡的集合体和物理形态，而 “bubble” 更侧重于单个的、短暂的气泡结构。"
    },
    {
      "word_to_compare": "blister",
      "analysis": "“Blister” (水泡) 是皮肤因摩擦或烫伤而形成的充满液体的隆起，是生物体的病理现象。虽然外形类似气泡，但 “blister” 具有医学含义，且不涉及气体或液体表面张力，与 “bubble” 的物理或隐喻用法完全不同。"
    },
    {
      "word_to_compare": "froth",
      "analysis": "“Froth” (泡沫/浮沫) 通常指液体表面因搅动或发酵产生的细小泡沫，常用于描述啤酒、浪花或情绪的表面亢奋。它比 “bubble” 更抽象，常用于比喻短暂、无实质的兴奋，如 “froth of politics”（政治的泡沫），而 “bubble” 在经济语境中更强调系统性膨胀与破裂。"
    }
  ]
}