{
  "word": "bucky",
  "pronunciation": "buhk-ee",
  "concise_definition": "adj. （非正式）巴克敏斯特·富勒风格的；n. 巴克敏斯特·富勒的昵称；n. （俚语）巴克球（富勒烯）",
  "forms": {
    "comparative": "buckier",
    "superlative": "buckiest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or resembling the architectural designs or geodesic structures created by Buckminster Fuller, characterized by efficiency, lightweight geometry, and spherical or polyhedral forms.",
      "explanation_cn": "与巴克敏斯特·富勒的建筑设计或正二十面体结构相关或相似的，以高效、轻质几何形态和球形或多面体结构为特征。",
      "example_en": "The greenhouse has a bucky dome that maximizes sunlight while minimizing material use.",
      "example_cn": "这座温室有一个巴克球形穹顶，在最小化材料使用的同时最大化采光。"
    },
    {
      "pos": "noun",
      "explanation_en": "A nickname for Richard Buckminster Fuller (1895–1983), the American architect, systems theorist, and inventor known for popularizing the geodesic dome.",
      "explanation_cn": "对美国建筑师、系统理论家和发明家理查德·巴克敏斯特·富勒（1895–1983）的昵称，他因推广正二十面体穹顶而闻名。",
      "example_en": "Bucky was obsessed with designing structures that used the least material for maximum strength.",
      "example_cn": "巴克对设计用最少材料实现最大强度的结构着迷。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slang term for a buckyball, a molecule composed of 60 carbon atoms arranged in a hollow sphere resembling a soccer ball (C60 fullerene).",
      "explanation_cn": "俚语中指‘巴克球’，即由60个碳原子组成的空心球形分子（C60富勒烯），外形类似足球。",
      "example_en": "Scientists discovered that buckyballs can trap other atoms inside their cage-like structure.",
      "example_cn": "科学家发现，巴克球可以在其笼状结构中包裹其他原子。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "geodesic",
      "analysis": "“Geodesic”（正二十面体的）是一个技术术语，专指由三角形构成的、接近球形的结构，强调其数学和工程特性。而 “bucky” 是一个非正式、带有文化色彩的昵称，常用于口语或科普语境中，特指富勒设计的这类结构，带有个人和历史的联想。"
    },
    {
      "word_to_compare": "fullerene",
      "analysis": "“Fullerene”（富勒烯）是化学术语，泛指所有由碳原子组成的封闭笼状分子，包括C60、C70等。而 “bucky” 是 C60 的通俗叫法，源于巴克敏斯特·富勒的名字，是科学界对这种分子的非正式称呼，更具亲和力和历史渊源。"
    },
    {
      "word_to_compare": "dome",
      "analysis": "“Dome”（穹顶）是一个通用词，泛指任何半球形或拱形建筑结构。而 “bucky dome” 特指由富勒设计的、基于几何三角形网络的轻质高效穹顶，具有明确的技术和设计内涵，不能与普通穹顶混用。"
    }
  ]
}