{
  "word": "buckle",
  "pronunciation": "buhk·l",
  "concise_definition": "v. 扣紧, 弯曲, 崩溃; n. 扣环, 扣子",
  "forms": {
    "third_person_singular": "buckles",
    "past_tense": "buckled",
    "past_participle": "buckled",
    "present_participle": "buckling"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To fasten or secure something, especially with a buckle or clasp, such as a belt, strap, or harness.",
      "explanation_cn": "指用扣环、搭扣等装置将某物（如腰带、肩带或安全带）扣紧或固定。",
      "example_en": "She buckled her seatbelt before driving off.",
      "example_cn": "她上车前系好了安全带。"
    },
    {
      "pos": "verb",
      "explanation_en": "To bend or warp under pressure or stress, often temporarily or permanently, especially when subjected to weight or force.",
      "explanation_cn": "指在压力或重负下发生弯曲或变形，可能是暂时的，也可能是永久的。",
      "example_en": "The metal beam buckled under the weight of the collapsed roof.",
      "example_cn": "金属梁在坍塌屋顶的重压下弯曲了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To collapse or give way under pressure, often used metaphorically to describe a person or system failing under stress.",
      "explanation_cn": "指在压力下崩溃或屈服，常用于比喻人或系统在重压下失去控制或功能。",
      "example_en": "After months of overwork, he finally buckled under the strain.",
      "example_cn": "经过数月的超负荷工作，他终于承受不住压力垮了下来。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device, typically made of metal or plastic, used to fasten two ends of a strap or belt together.",
      "explanation_cn": "一种通常由金属或塑料制成的装置，用于将带子或腰带的两端连接固定。",
      "example_en": "He adjusted the buckle on his hiking belt to make it tighter.",
      "example_cn": "他调整了登山腰带上的扣环，使其更紧一些。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fasten",
      "analysis": "“Fasten”（系紧）是一个更通用的动词，泛指任何将物体连接或固定的行为，如扣纽扣、拉拉链、系鞋带等。而 “buckle” 特指使用“扣环”这一具体机制进行固定，具有更明确的工具指向性。"
    },
    {
      "word_to_compare": "bend",
      "analysis": "“Bend”（弯曲）仅描述物理形态的改变，不涉及受力后果或功能失效。而 “buckle” 不仅指弯曲，还隐含了因外力过大而导致结构变形甚至失效的含义，语义更强烈、更具破坏性。"
    },
    {
      "word_to_compare": "crumble",
      "analysis": "“Crumble”（碎裂、瓦解）强调物体因老化或压力而变成碎片或粉末，是结构性的彻底破碎。而 “buckle” 是弯曲或屈服，物体仍保持整体性，只是形态改变，常可恢复或修复。两者在破坏程度和方式上有本质区别。"
    }
  ]
}