{
  "word": "buckingham",
  "pronunciation": "buhk·ing·uhm",
  "concise_definition": "n. 白金汉（英国地名、宫殿名、王室姓氏）",
  "forms": {
    "proper_noun": true
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A royal palace in London, serving as the official residence of the British monarch since 1837. It is also the administrative headquarters of the monarchy and a major tourist attraction.",
      "explanation_cn": "位于伦敦的一座皇家宫殿，自1837年起成为英国君主的官方居所，同时也是王室的行政总部和主要旅游景点。",
      "example_en": "The Changing of the Guard ceremony takes place outside Buckingham Palace every day during summer.",
      "example_cn": "每年夏季，换岗仪式都在白金汉宫外每日举行。"
    },
    {
      "pos": "noun",
      "explanation_en": "A historic English town in Buckinghamshire, after which the palace and the royal family name are derived. The name originates from the Old English 'Bucca's home'.",
      "explanation_cn": "英国白金汉郡的一个历史小镇，白金汉宫及王室姓氏均源于此地。该名称源自古英语 'Bucca's home'（布卡的家）。",
      "example_en": "The Dukes of Buckingham once held significant power in this region during the medieval period.",
      "example_cn": "中世纪时期，白金汉公爵曾在此地区拥有重要权力。"
    },
    {
      "pos": "noun",
      "explanation_en": "A surname associated with the British royal family, particularly the House of Windsor, which adopted 'Buckingham' as a territorial designation before formally changing to Windsor in 1917.",
      "explanation_cn": "与英国王室相关的姓氏，尤其指温莎王朝在1917年正式改名为‘温莎’之前所使用的地域性称号。",
      "example_en": "Queen Elizabeth II was born into the House of Saxe-Coburg and Gotha, but her family later became known as the House of Windsor, with Buckingham as its symbolic center.",
      "example_cn": "伊丽莎白二世女王出生时属于萨克森-科堡-哥达家族，但其家族后来被称为温莎王朝，白金汉宫是其象征性中心。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "palace",
      "analysis": "“Palace”（宫殿）是一个通用名词，泛指任何君主或贵族居住的宏伟建筑，如凡尔赛宫、故宫等。而 “Buckingham” 是专有名词，特指英国王室在伦敦的官方宫殿，具有唯一性和历史政治意义。"
    },
    {
      "word_to_compare": "Westminster",
      "analysis": "“Westminster”（威斯敏斯特）是伦敦的一个地区，也是英国议会所在地，象征政治权力；而 “Buckingham” 象征王室权威与居住功能。两者虽同为伦敦地标，但功能不同：前者是立法中心，后者是王室中心。"
    },
    {
      "word_to_compare": "Windsor",
      "analysis": "“Windsor” 是英国王室的正式姓氏和另一座王室城堡的名称，位于伯克郡，是王室的私人住所和周末休憩地。而 “Buckingham” 是官方居所和国家象征，更具公共性和仪式性。两者代表王室生活的不同面向：私密 vs. 公开。"
    }
  ]
}