{
  "word": "buck",
  "pronunciation": "buhk",
  "concise_definition": "n. 雄鹿, 美元, 男青年; v. 抗拒, 跳跃",
  "forms": {
    "plural": "bucks",
    "third_person_singular": "bucks",
    "past_tense": "bucked",
    "past_participle": "bucked",
    "present_participle": "bucking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A male deer, especially one with antlers, known for its strength and agility in the wild.",
      "explanation_cn": "指雄性鹿，尤其是长有角的雄鹿，以其在野外的力量和敏捷著称。",
      "example_en": "The hunter spotted a large buck standing near the edge of the forest.",
      "example_cn": "猎人看到一只大雄鹿站在森林边缘。"
    },
    {
      "pos": "noun",
      "explanation_en": "Slang for a U.S. dollar; commonly used in informal contexts to refer to money.",
      "explanation_cn": "俚语，指一美元，常用于非正式场合表示金钱。",
      "example_en": "I paid twenty bucks for this coffee.",
      "example_cn": "我花了二十美元买这杯咖啡。"
    },
    {
      "pos": "noun",
      "explanation_en": "A young man, especially one who is energetic, stylish, or rebellious; often used in phrases like 'young buck'.",
      "explanation_cn": "指年轻男子，尤指精力充沛、时尚或叛逆的青年，常用于短语如 'young buck'。",
      "example_en": "The new intern was just a young buck eager to prove himself.",
      "example_cn": "这位新实习生只是一个急于证明自己的年轻小伙子。"
    },
    {
      "pos": "verb",
      "explanation_en": "To suddenly and forcefully resist or kick out, especially as a horse does when trying to throw off a rider.",
      "explanation_cn": "指突然猛烈地反抗或踢蹬，尤指马试图将骑手甩下的动作。",
      "example_en": "The horse bucked violently when the rider tightened the reins.",
      "example_cn": "当骑手收紧缰绳时，那匹马猛烈地跳跃反抗。"
    },
    {
      "pos": "verb",
      "explanation_en": "To refuse to accept or comply with something, often in a defiant or stubborn manner.",
      "explanation_cn": "指以对抗或固执的方式拒绝接受或服从某事。",
      "example_en": "He bucked the system by refusing to follow the outdated rules.",
      "example_cn": "他拒绝遵守过时的规则，从而反抗了这套体制。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "deer",
      "analysis": "“Deer” 是泛指鹿科动物的总称，包括雄性和雌性，而 “buck” 特指雄性鹿，语义更精确。在非专业语境中，人们可能用 “deer” 指代所有鹿，但若强调性别或动物的强壮特征，则必须使用 “buck”。"
    },
    {
      "word_to_compare": "dollar",
      "analysis": "“Dollar” 是美元的标准正式名称，用于金融、法律和官方文件；而 “buck” 是其非正式俚语形式，多用于口语、日常对话或文学中增强生动性。两者语义相同，但语体和语境截然不同。"
    },
    {
      "word_to_compare": "resist",
      "analysis": "“Resist” 是一个通用动词，表示任何形式的对抗或反对，语义广泛；而 “buck” 作为动词时，带有强烈的肢体动作或情绪化反抗的意象，常与动物的踢跳行为或年轻人的叛逆行为相关，更具形象性和口语色彩。"
    }
  ]
}