{
  "word": "bucket",
  "pronunciation": "buhk·it",
  "concise_definition": "n. 水桶, 一桶的量, v. 用桶装, 大量倾倒",
  "forms": {
    "plural": "buckets"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A container, typically cylindrical with a handle, used for holding and carrying liquids or other materials, especially water or sand.",
      "explanation_cn": "一种通常呈圆柱形并带把手的容器，用于盛装和搬运液体或其他材料，尤指水或沙子。",
      "example_en": "She filled the bucket with water from the well and carried it back to the house.",
      "example_cn": "她从井里打了一桶水，提回了家。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large, informal quantity of something, often used in phrases like 'a bucket load' or 'a bucketful'.",
      "explanation_cn": "指大量某物的非正式说法，常用于短语如 'a bucket load'（一大堆）或 'a bucketful'（一桶的量）。",
      "example_en": "He got a bucket of compliments after his performance.",
      "example_cn": "他演出后收到了一大堆赞美。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of seat or compartment on a crane or amusement ride that swings or moves in a circular arc, often used in amusement parks.",
      "explanation_cn": "指起重机或游乐设施上的一种吊篮式座椅或舱室，通常在游乐园中作摆动或环形运动使用。",
      "example_en": "The children screamed with delight as the bucket ride swung high into the air.",
      "example_cn": "当吊桶式游乐设施高高摆向空中时，孩子们兴奋地尖叫起来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To put or pour something into a bucket, or to move or transfer something in a bucket.",
      "explanation_cn": "将某物放入桶中，或用桶来移动、转移某物。",
      "example_en": "They bucketed the rainwater from the roof into storage tanks.",
      "example_cn": "他们把屋顶的雨水用桶舀进储水罐中。"
    },
    {
      "pos": "verb",
      "explanation_en": "To throw or dump something in a large quantity, often carelessly or forcefully.",
      "explanation_cn": "大量、粗暴或随意地倾倒某物。",
      "example_en": "The fans bucketed popcorn at the player after he missed the final shot.",
      "example_cn": "球迷们在球员错失最后一投后，朝他扔了一大堆爆米花。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pail",
      "analysis": "“Pail”（小桶）与 “bucket” 非常相似，常可互换，但 “pail” 通常指更小、更轻便、更常用于家庭或园艺场景的容器，且多为塑料或金属制成；而 “bucket” 语义更广，可指更大、更坚固的容器，甚至用于比喻义（如大量）或机械装置（如挖掘机的铲斗）。"
    },
    {
      "word_to_compare": "container",
      "analysis": "“Container”（容器）是更广泛的上位词，泛指任何用于盛装物品的封闭或半封闭结构，包括箱子、罐子、袋子等；而 “bucket” 是一种特定类型的容器，具有圆柱形、带手柄、常用于搬运液体的典型特征，语义更具体。"
    },
    {
      "word_to_compare": "load",
      "analysis": "“Load”（负载/装载量）强调的是重量或数量的总和，常用于运输或工程语境；而 “bucket” 作为量词时（如 a bucket of）强调的是容器的容量单位，更具象、更口语化，常用于非正式表达中，如 'a bucket of tears'。"
    }
  ]
}