{
  "word": "buddha",
  "pronunciation": "buh·dah",
  "concise_definition": "n. 佛陀, 觉者, 佛",
  "forms": {
    "plural": "buddhas"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The title given to Siddhartha Gautama, the historical founder of Buddhism, who achieved enlightenment (nirvana) and taught the path to liberation from suffering.",
      "explanation_cn": "指释迦牟尼（Siddhartha Gautama），佛教的创始人，他通过觉悟（涅槃）而脱离苦海，并传授了通往解脱之道。",
      "example_en": "Buddha taught that desire is the root of suffering and that mindfulness can lead to inner peace.",
      "example_cn": "佛陀教导说，欲望是痛苦的根源，而正念可以带来内心的平静。"
    },
    {
      "pos": "noun",
      "explanation_en": "In Mahayana Buddhism, any being who has attained full enlightenment and chooses to remain in the world to help others achieve liberation.",
      "explanation_cn": "在大乘佛教中，指任何已达到完全觉悟、并选择留在世间帮助他人获得解脱的众生。",
      "example_en": "Avalokiteshvara is revered as a bodhisattva who embodies compassion, and is sometimes called a buddha in popular devotion.",
      "example_cn": "观世音菩萨被尊为体现慈悲的菩萨，在民间信仰中有时也被称为佛。"
    },
    {
      "pos": "noun",
      "explanation_en": "A statue or image representing the Buddha, often used in meditation and worship in Buddhist traditions.",
      "explanation_cn": "指在佛教传统中用于冥想和礼拜的佛陀塑像或画像。",
      "example_en": "The temple houses a golden statue of the Buddha, serene and smiling, surrounded by incense and offerings.",
      "example_cn": "寺庙中供奉着一尊金色的佛陀雕像，安详微笑，周围缭绕着香火与供品。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "saint",
      "analysis": "“Saint”（圣人）是基督教及其他宗教中因德行、神迹或殉道而被尊崇的个体，通常强调与神的亲密关系和超自然恩典。而 “buddha” 强调通过自我修行达到的内在觉悟，不依赖神明，更注重智慧与解脱，而非神圣性或崇拜。"
    },
    {
      "word_to_compare": "prophet",
      "analysis": "“Prophet”（先知）是宗教中传达神的启示或预言未来的人，如穆罕默德或摩西，其权威来自神的直接启示。而 “buddha” 并非神的使者，而是通过自身觉悟发现真理的导师，其教导基于经验与理性，而非神启。"
    },
    {
      "word_to_compare": "enlightened one",
      "analysis": "“Enlightened one”（觉悟者）是 “buddha” 的直译解释，二者在语义上几乎等同。但 “buddha” 是一个专有名词性头衔，特指释迦牟尼或其象征体系，而 “enlightened one” 是一个泛称，可用于任何达到觉悟状态的人，不限于佛教传统。"
    }
  ]
}