{
  "word": "buffet",
  "pronunciation": "buh·fay",
  "concise_definition": "n. 自助餐, 冲击, 拳打; v. 冲击, 拍打",
  "forms": {
    "plural": "buffets",
    "third_person_singular": "buffets",
    "past_tense": "buffeted",
    "past_participle": "buffeted",
    "present_participle": "buffeting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A meal where guests serve themselves from a variety of dishes laid out on a table, often including hot and cold foods, desserts, and beverages.",
      "explanation_cn": "一种用餐形式，客人可自行从摆放在桌上的多种热菜、冷菜、甜点和饮料中取用。",
      "example_en": "The hotel offers a lavish Sunday brunch buffet with seafood, pasta, and fresh fruit.",
      "example_cn": "这家酒店提供丰盛的周日早午餐自助餐，包括海鲜、意大利面和新鲜水果。"
    },
    {
      "pos": "noun",
      "explanation_en": "A forceful blow or series of blows, often from wind, waves, or physical impact.",
      "explanation_cn": "指由风、浪或物理冲击造成的猛烈撞击或连续打击。",
      "example_en": "The ship was battered by a series of buffets from the stormy sea.",
      "example_cn": "船只在暴风雨的海浪连续冲击下剧烈摇晃。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strike or hit repeatedly with force, often by natural elements like wind or waves.",
      "explanation_cn": "指被风、浪或其他力量反复猛烈击打。",
      "example_en": "The old lighthouse was buffeted by gales for decades.",
      "example_cn": "这座古老的灯塔数十年来一直遭受狂风的侵袭。"
    },
    {
      "pos": "verb",
      "explanation_en": "To push or jostle someone roughly, often in a crowd or during a struggle.",
      "explanation_cn": "指在人群中或争斗中粗暴地推搡或碰撞某人。",
      "example_en": "The protesters were buffeted by police officers trying to clear the street.",
      "example_cn": "抗议者在警察试图清空街道时被推来搡去。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "banquet",
      "analysis": "“Banquet”（宴会）通常指正式、有组织的大型餐会，有固定座位、服务人员上菜，强调礼仪和隆重性；而 “buffet” 是自助式，强调自由取用和非正式氛围，两者在形式和场合上有明显区别。"
    },
    {
      "word_to_compare": "impact",
      "analysis": "“Impact”（撞击）泛指任何强烈的碰撞或影响，常用于抽象语境（如经济影响）；而 “buffet” 作为动词时更强调连续、反复、来自多个方向的物理冲击，常用于自然力量（如风浪）或拥挤环境中的推搡，更具动态和持续性。"
    },
    {
      "word_to_compare": "spread",
      "analysis": "“Spread”（摆开、铺开）常用于描述食物在桌上摆放的方式，但不包含“自助取用”的行为含义；而 “buffet” 不仅指食物的摆放，更包含整个用餐方式和互动模式，是功能性的概念，而 “spread” 仅是物理状态的描述。"
    }
  ]
}