{
  "word": "buffalo",
  "pronunciation": "buh·fay·lo",
  "concise_definition": "n. 水牛, 美洲野牛; v. 恐吓, 欺骗, 难住",
  "forms": {
    "plural": "buffaloes",
    "third_person_singular": "buffaloes",
    "past_tense": "buffaloed",
    "past_participle": "buffaloed",
    "present_participle": "buffaloing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A large, heavy mammal with thick fur and curved horns, native to North America and parts of Asia; in North America, it refers to the American bison, while in Asia, it refers to the water buffalo.",
      "explanation_cn": "一种体型庞大、毛发浓密、有弯曲角的哺乳动物，原产于北美和亚洲部分地区；在北美指美洲野牛，在亚洲则指水牛。",
      "example_en": "The buffalo roamed the Great Plains in vast herds before European settlement.",
      "example_cn": "在欧洲人定居之前，野牛曾成群结队地在大平原上游荡。"
    },
    {
      "pos": "noun",
      "explanation_en": "A city in western New York State, United States, known for its architecture and as the home of the Buffalo Bills NFL team.",
      "explanation_cn": "美国纽约州西部的一座城市，以其建筑和作为NFL水牛城比尔队的主场而闻名。",
      "example_en": "We visited Buffalo last winter and saw the famous Fallingwater-inspired buildings.",
      "example_cn": "我们去年冬天去了布法罗，参观了那些受流水别墅启发的建筑。"
    },
    {
      "pos": "verb",
      "explanation_en": "To intimidate, confuse, or deceive someone, often through verbal pressure or misleading information.",
      "explanation_cn": "通过言语压力或误导性信息来恐吓、迷惑或欺骗某人。",
      "example_en": "The lawyer tried to buffalo the witness into changing his story.",
      "example_cn": "律师试图用压力让证人改变证词。"
    },
    {
      "pos": "verb",
      "explanation_en": "To perplex or baffle someone, especially with a difficult question or problem.",
      "explanation_cn": "使某人感到困惑或难住，尤指用一道难题或问题。",
      "example_en": "The math problem buffaloed even the top students in the class.",
      "example_cn": "这道数学题难倒了班上最优秀的学生。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bison",
      "analysis": "“Bison”（美洲野牛）是科学上更准确的术语，特指北美原产的大型有蹄类动物，而 “buffalo” 在北美常被误用为 bison 的同义词。实际上，真正的水牛（water buffalo）是亚洲物种，两者在生物学分类和外形上均有显著差异。但在日常英语中，人们普遍用 “buffalo” 指代美洲野牛。"
    },
    {
      "word_to_compare": "intimidate",
      "analysis": "“Intimidate”（恐吓）强调通过威胁或权威使他人感到恐惧而屈服，语气更直接、更具压迫性。而 “buffalo” 作为动词时，语气更口语化，常包含欺骗或用言语混淆的成分，不一定伴随直接威胁。"
    },
    {
      "word_to_compare": "baffle",
      "analysis": "“Baffle”（使困惑）与 “buffalo” 在‘难住’的含义上高度重合，但 “baffle” 更中性，仅表示因复杂或难以理解而困惑，不包含欺骗或施压的意味。而 “buffalo” 在此用法中隐含了某种人为制造的混乱或误导。"
    }
  ]
}