{
  "word": "building",
  "pronunciation": "bɪl·dɪŋ",
  "concise_definition": "n. 建筑物, 建造; v. 建造, 建立, 发展",
  "forms": {
    "plural": "buildings",
    "third_person_singular": "builds",
    "past_tense": "built",
    "past_participle": "built",
    "present_participle": "building"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A structure with walls and a roof, typically built for permanent use, such as a house, office, or factory.",
      "explanation_cn": "指具有墙壁和屋顶、通常用于长期使用的结构，如房屋、办公楼或工厂。",
      "example_en": "The new library building opened last month with a modern design.",
      "example_cn": "这座新图书馆大楼上个月以现代设计正式开放。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process or act of constructing something, especially a structure or organization.",
      "explanation_cn": "指建造某物的过程或行为，尤指建筑物或组织的建立。",
      "example_en": "The building of the bridge took over five years and required international collaboration.",
      "example_cn": "这座桥梁的建造历时五年以上，需要国际合作。"
    },
    {
      "pos": "verb",
      "explanation_en": "To construct or assemble something, especially a physical structure, using materials and labor.",
      "explanation_cn": "指使用材料和人力建造或组装某物，尤指实体结构。",
      "example_en": "They are building a new hospital to serve the growing population.",
      "example_cn": "他们正在建造一家新医院，以服务不断增长的人口。"
    },
    {
      "pos": "verb",
      "explanation_en": "To develop or establish something gradually over time, such as relationships, skills, or a business.",
      "explanation_cn": "指逐渐建立或发展某物，如关系、技能或企业。",
      "example_en": "She has been building her reputation as a reliable consultant for over a decade.",
      "example_cn": "她十多年以来一直在建立自己作为可靠顾问的声誉。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "structure",
      "analysis": "“Structure”（结构）是一个更抽象的术语，泛指任何有组织的系统或排列方式，可以是物理的（如桥梁结构）或抽象的（如组织结构）。而 “building” 通常特指有实体形态的建筑物，强调其作为物理空间的功能性。"
    },
    {
      "word_to_compare": "construction",
      "analysis": "“Construction”（建设）是 “building” 作为动词时的名词形式，但更侧重于工程过程本身，常用于专业语境（如建筑行业）。而 “building” 作为名词时更常指最终产物（建筑物），作为动词时语气更口语化、通用。"
    },
    {
      "word_to_compare": "establish",
      "analysis": "“Establish”（建立）多用于抽象事物，如制度、机构、信誉等，强调使其稳固存在。而 “building” 在表示抽象发展时（如 building trust）更强调渐进积累的过程，带有动手、逐步构建的意象，更具动态感。"
    }
  ]
}