{
  "word": "bulk",
  "pronunciation": "buhlk",
  "concise_definition": "n. 体积, 大量, 主体; adj. 大量的, 体积大的; v. 显得庞大",
  "forms": {
    "plural": "bulks"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The great size, mass, or volume of something, especially when it is large and unwieldy or not finely detailed.",
      "explanation_cn": "指某物的庞大尺寸、质量或体积，尤其当其庞大而笨重、缺乏精细细节时。",
      "example_en": "The bulk of the shipment arrived yesterday, but the small packages are still delayed.",
      "example_cn": "大部分货物昨天已到达，但小件包裹仍在延误中。"
    },
    {
      "pos": "noun",
      "explanation_en": "The main part or majority of something, often used in the phrase 'the bulk of'.",
      "explanation_cn": "指某事物的主体或大部分，常用于短语 'the bulk of' 中。",
      "example_en": "The bulk of the population supports the new policy.",
      "example_cn": "绝大多数民众支持这项新政策。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that is large in size, quantity, or volume, often in an unrefined or non-retail form.",
      "explanation_cn": "形容某物在尺寸、数量或体积上很大，通常指未经细分或非零售包装的形式。",
      "example_en": "We bought the rice in bulk to save money.",
      "example_cn": "我们批量购买大米以节省开支。"
    },
    {
      "pos": "verb",
      "explanation_en": "To increase in size or prominence, especially in a way that makes something appear larger or more dominant than it actually is.",
      "explanation_cn": "指在规模或显著性上增大，尤其使某物显得比实际更大或更突出。",
      "example_en": "The mountain bulked up on the horizon as we drove closer.",
      "example_cn": "当我们驾车靠近时，山体在地平线上显得愈发庞大。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "volume",
      "analysis": "“Volume”（体积）是一个精确的物理量度术语，用于描述三维空间的大小，常用于科学或工程语境。而 “bulk” 更强调主观感知上的庞大、笨重或不成形的体量，常带有非正式或描述性色彩。"
    },
    {
      "word_to_compare": "quantity",
      "analysis": "“Quantity”（数量）指可计数或可测量的多少，强调的是“有多少”，如 100 件商品。而 “bulk” 强调的是“体积庞大”或“整体规模”，常用于描述未细分的大量物品，如一整托盘的货物，不强调具体数字。"
    },
    {
      "word_to_compare": "mass",
      "analysis": "“Mass”（质量/质量体）是物理学中的术语，指物体所含物质的量，具有精确的科学定义。而 “bulk” 更偏向日常语言，描述的是外观上的庞大感，不一定与实际质量相关，例如一堆泡沫塑料可能体积庞大（bulk），但质量很轻（mass small）。"
    }
  ]
}