{
  "word": "bullshit",
  "pronunciation": "bull·shit",
  "concise_definition": "n. 胡说, 骗局, 废话; v. 欺骗, 胡扯",
  "forms": {
    "plural": "bullshits",
    "third_person_singular": "bullshits",
    "past_tense": "bullshitted",
    "past_participle": "bullshitted",
    "present_participle": "bullshitting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Nonsense or false statements intended to deceive, mislead, or impress others; often used to describe empty rhetoric, dishonest explanations, or insincere flattery.",
      "explanation_cn": "指为了欺骗、误导或给人留下印象而说出的胡言乱语或虚假陈述；常用于形容空洞的修辞、不诚实的解释或虚伪的奉承。",
      "example_en": "Stop talking bullshit and tell me the real reason you were late.",
      "example_cn": "别再说废话了，告诉我你迟到的真正原因。"
    },
    {
      "pos": "noun",
      "explanation_en": "Something of poor quality, worthless, or meaningless, especially when presented as important or valuable.",
      "explanation_cn": "指质量低劣、毫无价值或毫无意义的事物，尤其是当它被包装成重要或有价值的东西时。",
      "example_en": "This new phone is just a bunch of bullshit with no real innovation.",
      "example_cn": "这部新手机根本就是一堆毫无真正创新的垃圾。"
    },
    {
      "pos": "verb",
      "explanation_en": "To deceive or mislead someone by saying things that are not true, often to avoid responsibility or to manipulate a situation.",
      "explanation_cn": "通过说不真实的话来欺骗或误导他人，通常是为了逃避责任或操纵局势。",
      "example_en": "He's just bullshitting to get out of doing the work.",
      "example_cn": "他只是在胡扯，好逃避工作。"
    },
    {
      "pos": "verb",
      "explanation_en": "To talk in a foolish, exaggerated, or insincere way, often to entertain or to fill silence.",
      "explanation_cn": "以愚蠢、夸张或不真诚的方式说话，常用于娱乐或填补沉默。",
      "example_en": "We sat around bullshitting about old times until midnight.",
      "example_cn": "我们围坐在一起胡扯着过去的往事，直到午夜。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "nonsense",
      "analysis": "“Nonsense”（胡言乱语）指明显不合逻辑或毫无意义的话，语气较中性，不一定带有欺骗意图。而 “bullshit” 通常隐含故意欺骗、虚伪或操纵的恶意，语气更强烈、更粗俗。"
    },
    {
      "word_to_compare": "fabrication",
      "analysis": "“Fabrication”（捏造）是正式用语，指有意识地编造虚假信息，常用于法律、学术或新闻语境，强调事实的伪造。而 “bullshit” 更口语化，涵盖范围更广，包括空话、敷衍和情绪化吹嘘，不一定是精心设计的谎言。"
    },
    {
      "word_to_compare": "bluff",
      "analysis": "“Bluff”（虚张声势）是一种策略性欺骗，通常用于谈判或竞争中，目的是让对方相信你有更强的实力或立场，但不一定是完全虚假的陈述。而 “bullshit” 更倾向于彻底的虚假或无意义的废话，不以策略性为目的，更多是敷衍或情绪发泄。"
    }
  ]
}