{
  "word": "bully",
  "pronunciation": "bul·ee",
  "concise_definition": "n. 欺凌者, 恃强凌弱者; v. 欺凌, 恐吓, 威胁",
  "forms": {
    "third_person_singular": "bullies",
    "past_tense": "bullied",
    "past_participle": "bullied",
    "present_participle": "bullying"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who uses strength, power, or influence to intimidate, harm, or dominate others, especially those who are weaker or more vulnerable.",
      "explanation_cn": "指利用体力、权力或影响力恐吓、伤害或支配他人，尤其是那些较弱或更易受伤害的人。",
      "example_en": "The school has implemented a zero-tolerance policy against bullies.",
      "example_cn": "学校已实施对欺凌者的零容忍政策。"
    },
    {
      "pos": "verb",
      "explanation_en": "To use intimidation, threats, or aggressive behavior to force someone to do something or to make them feel afraid or powerless.",
      "explanation_cn": "通过恐吓、威胁或攻击性行为强迫他人做某事，或使其感到恐惧和无助。",
      "example_en": "He was bullied into signing the contract by his boss’s constant threats.",
      "example_cn": "他因老板不断威胁而被迫签署了合同。"
    },
    {
      "pos": "verb",
      "explanation_en": "To behave in a domineering or overbearing way, often to assert control or superiority over others.",
      "explanation_cn": "以专横或霸道的方式行事，通常是为了对他人施加控制或显示优越感。",
      "example_en": "She bullies her colleagues by taking credit for their work and speaking down to them.",
      "example_cn": "她通过窃取同事的功劳并居高临下地对他们说话来欺压他们。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "intimidate",
      "analysis": "“Intimidate” (恐吓) 侧重于通过威胁或威吓使他人产生恐惧，从而屈服或退缩，但不一定伴随持续的压迫行为。而 “bully” 不仅包含恐吓，还强调长期、反复的权力滥用和主动攻击，范围更广、更具系统性。"
    },
    {
      "word_to_compare": "harass",
      "analysis": "“Harass” (骚扰) 指反复进行令人困扰或不适的行为，可能包括言语、身体或性方面的侵扰，但不一定涉及明显的权力不对等。而 “bully” 通常隐含施暴者与受害者之间的力量悬殊，且行为动机常为支配与羞辱。"
    },
    {
      "word_to_compare": "coerce",
      "analysis": "“Coerce” (强迫) 指通过压力、威胁或暴力手段迫使他人做某事，强调结果的被迫性，但不必然包含情感虐待或持续的欺凌行为。而 “bully” 更强调过程中的心理压迫、羞辱和权力展示，常发生在日常互动中，而非一次性事件。"
    }
  ]
}