{
  "word": "bullying",
  "pronunciation": "bool·ee-ing",
  "concise_definition": "n. 欺凌, 恃强凌弱, 恐吓",
  "forms": {
    "noun": "bullying",
    "verb": "bully",
    "third_person_singular": "bullies",
    "past_tense": "bullied",
    "past_participle": "bullied",
    "present_participle": "bullying"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The repeated, intentional use of power or aggression to intimidate, harm, or control another person, often someone perceived as weaker or vulnerable, in contexts such as schools, workplaces, or online.",
      "explanation_cn": "指有意识地、反复地利用权力或攻击性行为来恐吓、伤害或控制他人，通常针对被认为较弱或易受伤害的人，常见于学校、职场或网络环境中。",
      "example_en": "The school implemented a zero-tolerance policy against bullying after several students reported severe harassment.",
      "example_cn": "在多名学生报告遭受严重欺凌后，学校实施了对欺凌行为零容忍的政策。"
    },
    {
      "pos": "noun",
      "explanation_en": "A pattern of behavior characterized by verbal abuse, physical aggression, social exclusion, or cyber harassment aimed at undermining someone's confidence or status.",
      "explanation_cn": "一种以言语辱骂、身体攻击、社交排斥或网络骚扰为特征的行为模式，旨在削弱他人的自信或社会地位。",
      "example_en": "Cyberbullying has become a major concern among teenagers, with many experiencing anonymous threats on social media.",
      "example_cn": "网络欺凌已成为青少年中的重大问题，许多人曾在社交媒体上遭受匿名威胁。"
    },
    {
      "pos": "verb",
      "explanation_en": "To use strength, authority, or intimidation to force someone to do something against their will or to make them feel afraid or inferior.",
      "explanation_cn": "利用力量、权威或恐吓迫使他人违背意愿行事，或使其感到恐惧或自卑。",
      "example_en": "He was bullied into signing the contract by threats of losing his job.",
      "example_cn": "他因被威胁要丢掉工作而被迫签署了合同。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "harassment",
      "analysis": "“Harassment”（骚扰）范围更广，泛指任何持续的、令人不适的侵扰行为，可能不包含明显的权力不对等，例如性骚扰或电话骚扰。而 “bullying” 强调权力差异和重复性，通常发生在有上下级、年龄或体能差异的关系中，更具系统性和长期性。"
    },
    {
      "word_to_compare": "intimidation",
      "analysis": "“Intimidation”（恐吓）是 bullying 的一种手段，指通过威胁或威吓使他人屈服，但本身可以是一次性行为。而 “bullying” 是包含恐吓在内的持续性、模式化的行为，通常包含多种形式（如嘲笑、孤立、暴力）的组合。"
    },
    {
      "word_to_compare": "teasing",
      "analysis": "“Teasing”（取笑）通常是轻松、非恶意的玩笑，双方可能互有来往，不构成权力压迫。而 “bullying” 是单向的、带有伤害意图的，受害者无法轻易摆脱，且常造成心理创伤。两者的界限在于意图、频率和后果。"
    }
  ]
}