{
  "word": "bull",
  "pronunciation": "bohl",
  "concise_definition": "n. 公牛, 雄性动物, 看涨行情; v. 恐吓, 用蛮力逼迫",
  "forms": {
    "plural": "bulls"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A mature male bovine animal, typically used for breeding or as a symbol of strength and aggression.",
      "explanation_cn": "指成年公牛，通常用于繁殖，也常作为力量与攻击性的象征。",
      "example_en": "The rancher carefully managed his herd of bulls to maintain genetic diversity.",
      "example_cn": "牧场主精心管理他的公牛群，以保持基因多样性。"
    },
    {
      "pos": "noun",
      "explanation_en": "In financial markets, a person who believes that the price of an asset or the market as a whole will rise, and who buys with the expectation of profit.",
      "explanation_cn": "在金融市场中，指相信某种资产或整体市场将上涨，并据此买入以期望获利的人，即‘多头’。",
      "example_en": "Bulls are optimistic about the tech sector’s future growth.",
      "example_cn": "多头对科技板块的未来增长持乐观态度。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large, often exaggerated or false statement, especially one intended to deceive or impress; a tall tale.",
      "explanation_cn": "指一种庞大、常被夸大甚至虚假的言论，尤其用于欺骗或给人留下深刻印象；即‘吹牛’或‘胡扯’。",
      "example_en": "He told us a bull about how he climbed Mount Everest alone, but no one believed him.",
      "example_cn": "他跟我们吹牛说他独自登上了珠穆朗玛峰，但没人相信他。"
    },
    {
      "pos": "verb",
      "explanation_en": "To intimidate, pressure, or force someone into doing something through aggressive or threatening behavior.",
      "explanation_cn": "指通过攻击性或威胁性的行为恐吓、施压或强迫某人做某事。",
      "example_en": "They tried to bull their way into the negotiation, but the other side stood firm.",
      "example_cn": "他们试图用蛮力逼迫对方进入谈判，但对方立场坚定。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ox",
      "analysis": "“Ox”（阉牛）通常指被阉割后用于拉车或耕作的成年公牛，性格温顺、体力耐久，强调其劳动用途；而 “bull” 保留原始雄性特征，更具攻击性和繁殖功能，常象征力量而非服从。"
    },
    {
      "word_to_compare": "bear",
      "analysis": "在金融语境中，‘bear’（空头）与 ‘bull’（多头）形成对立：bear 预期价格下跌并卖出，bull 预期价格上涨并买入。两者是市场情绪的典型代表，但方向完全相反。"
    },
    {
      "word_to_compare": "bluff",
      "analysis": "“Bluff”（虚张声势）指通过假装强大或掌握信息来欺骗他人，常用于谈判或扑克等情境，强调心理战术；而 “bull” 作为动词时更偏向于用直接的压迫或暴力手段逼迫，语气更粗暴、更具物理性。"
    }
  ]
}