{
  "word": "bum",
  "pronunciation": "buhm",
  "concise_definition": "n. 乞丐, 无业游民; v. 乞讨, 搭便车; adj. 低劣的, 有缺陷的",
  "forms": {
    "plural": "bums",
    "third_person_singular": "bums",
    "past_tense": "bumped",
    "past_participle": "bumped",
    "present_participle": "bumping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who is homeless and without a regular job, often living by begging or petty crime; a derogatory term for a lazy or shiftless individual.",
      "explanation_cn": "指无家可归、没有固定工作、靠乞讨或小偷小摸为生的人；也用作贬义词形容懒惰、游手好闲之徒。",
      "example_en": "The old man sat on the corner, a familiar bum who asked for change every day.",
      "example_cn": "那位老人坐在街角，是个每天都要钱的熟面孔乞丐。"
    },
    {
      "pos": "verb",
      "explanation_en": "To ask for something, especially money or a ride, without paying or offering anything in return; to live by begging or relying on others.",
      "explanation_cn": "指不付钱或不提供回报地向他人索要东西，尤指钱或搭便车；也指靠乞讨或依赖他人生活。",
      "example_en": "He bums rides from friends and never offers to pay for gas.",
      "example_cn": "他总向朋友搭便车，却从不主动出油钱。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Of poor quality; defective, broken, or unreliable; often used informally to describe something that doesn't work properly.",
      "explanation_cn": "指质量低劣的、有缺陷的、不可靠的；常用于非正式语境，形容东西无法正常运作。",
      "example_en": "This old laptop is a bum; it crashes every time I open a browser.",
      "example_cn": "这台旧笔记本电脑坏了，每次打开浏览器都会崩溃。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tramp",
      "analysis": "“Tramp”（流浪汉）与 “bum” 意义相近，都指无固定居所的流浪者，但 “tramp” 更强调长途步行流浪的特征，常带有浪漫化或文学色彩；而 “bum” 更口语化、贬义更强，常暗示懒惰和不事生产。"
    },
    {
      "word_to_compare": "hobo",
      "analysis": "“Hobo”（流浪工人）特指美国大萧条时期为找工作而四处流浪的工人，通常有劳动意愿但无稳定工作；与 “bum” 不同，后者常被视作完全不愿工作。“Hobo” 一词在历史上有特定社会背景，语义中性甚至略带同情，而 “bum” 则是明显的贬义。"
    },
    {
      "word_to_compare": "defective",
      "analysis": "“Defective”（有缺陷的）是正式用语，用于描述产品、系统或机制的故障，强调技术性或功能性缺失；而 “bum” 作为形容词是口语化表达，语气更随意、情绪化，常用于日常抱怨，如 ‘a bum battery’，不适用于正式报告或技术文档。"
    }
  ]
}