{
  "word": "bump",
  "pronunciation": "buhmp",
  "concise_definition": "n. 凸起, 碰撞, 小障碍; v. 碰撞, 使凸起, 临时提升",
  "forms": {
    "third_person_singular": "bumps",
    "past_tense": "bumped",
    "past_participle": "bumped",
    "present_participle": "bumping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small raised area or protuberance on a surface, often caused by impact, pressure, or natural formation.",
      "explanation_cn": "指表面上因撞击、压力或自然形成而出现的小凸起或隆起部分。",
      "example_en": "She felt a bump on her forehead after hitting the door.",
      "example_cn": "她撞上门后，额头上出现了一个肿块。"
    },
    {
      "pos": "noun",
      "explanation_en": "A minor collision or impact, often accidental, between two objects or people.",
      "explanation_cn": "指两个物体或人之间发生的轻微、通常是意外的碰撞。",
      "example_en": "The car got a bump in the parking lot when another vehicle backed into it.",
      "example_cn": "汽车在停车场被另一辆车倒车时撞了一下。"
    },
    {
      "pos": "noun",
      "explanation_en": "A temporary obstacle or difficulty, especially in a process or plan.",
      "explanation_cn": "指过程中或计划中出现的暂时性障碍或小问题。",
      "example_en": "There was a small bump in the project timeline due to supply delays.",
      "example_cn": "由于供货延迟，项目时间表出现了一点小延误。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strike or collide with something, often lightly or accidentally.",
      "explanation_cn": "指轻撞或意外地碰到某物。",
      "example_en": "He bumped into his old friend at the grocery store.",
      "example_cn": "他在杂货店碰到了一位老朋友。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a surface to become uneven by creating a raised area through pressure or impact.",
      "explanation_cn": "指通过压力或撞击使表面出现凸起。",
      "example_en": "The heavy box bumped the floorboards as it was dragged across the room.",
      "example_cn": "沉重的箱子被拖过房间时，把地板压出了凸痕。"
    },
    {
      "pos": "verb",
      "explanation_en": "To promote or advance someone or something to a higher position, often temporarily or informally.",
      "explanation_cn": "指临时或非正式地将某人或某物提升到更高的位置。",
      "example_en": "The manager bumped her up to senior associate after she delivered the successful campaign.",
      "example_cn": "她在成功完成项目后，被经理临时提升为高级合伙人。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hit",
      "analysis": "“Hit” (撞击) 通常指更强烈、更直接的冲击，可能造成明显损伤；而 “bump” 强调轻微、偶然的碰撞，通常不严重。例如，‘hit the wall’ 暗示用力撞击，而 ‘bump the wall’ 只是轻轻碰了一下。"
    },
    {
      "word_to_compare": "lump",
      "analysis": "“Lump” (肿块/团块) 是一个名词，指固态的、不规则的凸起物，常用于描述身体上的硬块或物质团块；而 “bump” 更强调表面的隆起，可能是暂时的、软的，如撞伤后的肿胀。两者可互换时，“bump” 更口语化，且常含意外性。"
    },
    {
      "word_to_compare": "obstacle",
      "analysis": "“Obstacle” (障碍) 是一个正式术语，指阻碍进展的实质性困难，通常需要主动克服；而 “bump” 作为比喻用法时，指微小、暂时的障碍，语气轻松，常用于非正式语境，如 ‘a bump in the road’，暗示问题不大，可顺利度过。"
    }
  ]
}