{
  "word": "bumps",
  "pronunciation": "bumpz",
  "concise_definition": "n. 凸起, 碰撞, 小肿块; v. 碰撞, 撞到",
  "forms": {
    "singular": "bump",
    "present_third_person_singular": "bumps",
    "past_tense": "bumped",
    "past_participle": "bumped",
    "present_participle": "bumping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small raised area or protuberance on a surface, often caused by pressure, injury, or natural formation.",
      "explanation_cn": "指表面上因压力、损伤或自然形成而出现的小突起或隆起部分。",
      "example_en": "She felt a bump on her forehead after hitting the door.",
      "example_cn": "她撞到门后，额头上出现了一个小肿块。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden jolt or shock experienced while moving, especially over an uneven surface such as a rough road.",
      "explanation_cn": "指在移动过程中，尤其是在不平的路面上行驶时所经历的突然颠簸或震动。",
      "example_en": "The car hit a series of bumps on the dirt road, making the ride uncomfortable.",
      "example_cn": "汽车在土路上接连颠簸，让旅程非常不舒服。"
    },
    {
      "pos": "noun",
      "explanation_en": "A temporary increase in activity, demand, or occurrence, often used in economic or social contexts.",
      "explanation_cn": "指在经济或社会语境中，活动、需求或事件的暂时性增加。",
      "example_en": "There was a bump in sales during the holiday season.",
      "example_cn": "节日期间销售额出现了一次短暂增长。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strike or collide with something, often accidentally or with moderate force.",
      "explanation_cn": "指无意中或以中等力度撞击某物。",
      "example_en": "He bumped into his friend at the grocery store.",
      "example_cn": "他在杂货店碰到了他的朋友。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or cause something to move with a series of jolts or vibrations, typically over an uneven surface.",
      "explanation_cn": "指在不平的表面上以一系列颠簸的方式移动或使某物移动。",
      "example_en": "The old truck bumped along the rocky trail.",
      "example_cn": "那辆旧卡车在崎岖的小路上颠簸前行。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "lump",
      "analysis": "“Lump”（肿块/团块）通常指质地较硬、形状不规则的固体团块，多用于描述体内异常组织或未加工的物质（如面团），强调物质性；而 “bump” 更侧重于表面的凸起，常为暂时性、非结构性的隆起，如撞伤后的肿块。"
    },
    {
      "word_to_compare": "jolt",
      "analysis": "“Jolt”（剧烈震动）强调一种突然、强烈、可能令人惊吓的冲击，常用于抽象语境（如思想上的震撼）；而 “bump” 的震动程度较轻，多用于物理层面的轻微碰撞或颠簸，语气更日常、中性。"
    },
    {
      "word_to_compare": "collision",
      "analysis": "“Collision”（碰撞）是正式术语，指两个或多个物体之间强烈、通常具有破坏性的接触，多用于法律或科学语境；而 “bump” 是非正式用语，指轻微、偶然的接触，不必然造成损害，语气更轻松。"
    }
  ]
}