{
  "word": "bumping",
  "pronunciation": "buhm·ping",
  "concise_definition": "n. 碰撞, 撞击; v. 碰撞, 撞击; (非正式) 推搡, 挤压",
  "forms": {
    "base_form": "bump",
    "third_person_singular": "bumps",
    "past_tense": "bumped",
    "past_participle": "bumped",
    "present_participle": "bumping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sudden, often accidental, collision or impact between two objects or people, typically producing a dull sound or minor damage.",
      "explanation_cn": "两个物体或人之间突然的、通常是意外的碰撞或撞击，常伴随沉闷的声响或轻微损坏。",
      "example_en": "The car suffered a bump when it hit the curb.",
      "example_cn": "汽车撞上路缘时受到了一次撞击。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strike or collide with something, often unintentionally or with mild force, especially in a crowded or confined space.",
      "explanation_cn": "无意中或以轻微力量撞击某物，尤其在拥挤或狭小的空间中。",
      "example_en": "I kept bumping into people in the crowded subway.",
      "example_cn": "在拥挤的地铁里，我不断撞到人。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or progress in a slow, irregular, or jolting manner, often due to uneven terrain or poor conditions.",
      "explanation_cn": "因地形不平或条件恶劣而缓慢、不规则或颠簸地移动。",
      "example_en": "The old truck bumped along the dirt road.",
      "example_cn": "那辆旧卡车颠簸着行驶在土路上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slight rise or protuberance on a surface, often caused by pressure or impact.",
      "explanation_cn": "表面上因压力或撞击而形成的轻微隆起或凸起。",
      "example_en": "There was a bump on the table where the heavy vase had sat for years.",
      "example_cn": "桌子上有块凸起，是那沉重的花瓶放了多年留下的痕迹。"
    },
    {
      "pos": "verb",
      "explanation_en": "(Informal) To push or shove someone, especially to make way or in a rough manner.",
      "explanation_cn": "(非正式) 推搡某人，尤指为了开路或粗暴地移动。",
      "example_en": "He was bumping people aside to get to the front of the line.",
      "example_cn": "他推搡着人群，想挤到队伍前面。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "collision",
      "analysis": "“Collision” (碰撞) 更正式，强调两个物体以显著力量相撞，常用于交通事故或物理学术语，后果通常更严重。而 “bumping” 更轻、更随意，常指轻微、偶然的接触，不具破坏性。"
    },
    {
      "word_to_compare": "jostling",
      "analysis": "“Jostling” (推挤) 通常指在人群中因拥挤而互相推搡，带有持续性和人际互动的意味，常用于描述排队或集会场景。而 “bumping” 可以是单次、无意识的接触，不一定涉及人际冲突。"
    },
    {
      "word_to_compare": "knock",
      "analysis": "“Knock” (敲击) 通常指有目的、有节奏或较清晰的撞击动作，如敲门、敲击物体。而 “bumping” 更强调无意识、笨拙或连续的碰撞，声音更沉闷，动作更不精确。"
    }
  ]
}