{
  "word": "bundled",
  "pronunciation": "bun·dld",
  "concise_definition": "adj. 捆绑的, 成套的; v. 捆绑, 包装 (bundled 是 bundle 的过去式和过去分词)",
  "forms": {
    "base_form": "bundle",
    "past_tense": "bundled",
    "past_participle": "bundled",
    "present_participle": "bundling",
    "plural": "bundles"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing items that are grouped together and sold or provided as a single unit, often for convenience or promotional purposes.",
      "explanation_cn": "指被组合在一起并作为单一单元出售或提供的物品，通常出于便利性或促销目的。",
      "example_en": "The software is available as a bundled package including word processor, spreadsheet, and presentation tools.",
      "example_cn": "该软件以捆绑包形式提供，包含文字处理、电子表格和演示工具。"
    },
    {
      "pos": "verb",
      "explanation_en": "To group or tie together multiple items, services, or components into a single unit for sale, transport, or organization.",
      "explanation_cn": "将多个物品、服务或组件组合或捆扎成一个整体，用于销售、运输或整理。",
      "example_en": "The telecom company bundled internet, TV, and phone services into one monthly plan.",
      "example_cn": "这家电信公司将互联网、电视和电话服务打包成一个月度套餐。"
    },
    {
      "pos": "verb",
      "explanation_en": "To carry or transport something in a bundle or wrapped package, often for ease of handling.",
      "explanation_cn": "以捆扎或包裹的形式携带或运输某物，通常为了便于搬运。",
      "example_en": "She bundled the old newspapers and took them to the recycling center.",
      "example_cn": "她把旧报纸捆好，拿到回收中心。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "package",
      "analysis": "“Package” (包装/套餐) 更强调将物品放入一个容器或结构中，常用于商业语境，如“产品套餐”。“Bundled” 更侧重于“物理或功能上的组合”，不一定有外包装，但强调多个项目被绑定在一起。例如，软件捆绑（bundled software）可能没有实体包装，但功能上是组合的。"
    },
    {
      "word_to_compare": "combined",
      "analysis": "“Combined” (组合的) 是一个更通用的词，指两个或多个事物合并在一起，但不隐含“捆绑”或“打包”的物理或商业行为。例如，两种化学物质“combined”形成新化合物，但不能说“bundled”。而 “bundled” 常用于商业、服务或物流场景，带有策略性整合的意味。"
    },
    {
      "word_to_compare": "grouped",
      "analysis": "“Grouped” (分组的) 仅表示按某种标准归类或聚集，不必然意味着销售、运输或物理捆绑。例如，学生被“grouped”按年龄分班，但没有“bundled”。而 “bundled” 暗示了更紧密的整合，常伴随经济或功能上的绑定，如“bundled services”是不可拆分的销售单元。"
    }
  ]
}