{
  "word": "bundle",
  "pronunciation": "bun·dl",
  "concise_definition": "n. 捆, 包, 一束; v. 捆绑, 包装, 一起出售",
  "forms": {
    "plural": "bundles",
    "third_person_singular": "bundles",
    "past_tense": "bundled",
    "past_participle": "bundled",
    "present_participle": "bundling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A group of items tied or wrapped together, often for convenience, transport, or sale.",
      "explanation_cn": "指为便于携带、运输或销售而捆绑或包裹在一起的一组物品。",
      "example_en": "She carried a bundle of firewood on her back.",
      "example_cn": "她背着一捆木柴。"
    },
    {
      "pos": "noun",
      "explanation_en": "A package of related products, services, or features sold together as a single unit, often at a discounted price.",
      "explanation_cn": "指将相关的产品、服务或功能组合成一个整体进行销售，通常以优惠价格提供。",
      "example_en": "The cable company offers a bundle of internet, TV, and phone services.",
      "example_cn": "这家有线电视公司提供互联网、电视和电话服务的组合套餐。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large amount or collection of something, often used informally to emphasize quantity.",
      "explanation_cn": "指大量或集合的某物，常用于非正式语境中强调数量。",
      "example_en": "He made a bundle of money from the startup.",
      "example_cn": "他从这家初创公司赚了一大笔钱。"
    },
    {
      "pos": "verb",
      "explanation_en": "To tie or wrap several items together tightly.",
      "explanation_cn": "指将多个物品紧密地捆绑或包裹在一起。",
      "example_en": "The farmer bundled the hay into bales before storing it.",
      "example_cn": "农夫把干草捆成草垛后储存起来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To group and offer multiple products or services together as a single package.",
      "explanation_cn": "指将多个产品或服务组合成一个整体进行提供。",
      "example_en": "The software company bundles its design tools with a cloud storage plan.",
      "example_cn": "这家软件公司将其设计工具与云存储计划打包销售。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "package",
      "analysis": "“Package” (包装/套餐) 更强调外部的容器或形式，常用于商业语境中指代有明确边界和定价的销售单元，如礼品包装或软件包。而 “bundle” 更侧重于内容的组合性，常暗示自然或功能上的关联性，且语气更口语化。"
    },
    {
      "word_to_compare": "cluster",
      "analysis": "“Cluster” (群集) 指事物在空间或概念上自然聚集在一起，通常没有人为捆绑或组织的意图，如星体集群或数据聚类。而 “bundle” 强调人为的、有目的的集合与捆绑行为。"
    },
    {
      "word_to_compare": "stack",
      "analysis": "“Stack” (堆叠) 指物品垂直叠放，强调物理上的层叠结构，如一叠书或一摞盘子。而 “bundle” 强调横向的捆绑或包裹，不一定有叠放关系，更注重整体性与完整性。"
    }
  ]
}