{
  "word": "buried",
  "pronunciation": "bair·id",
  "concise_definition": "adj. 被埋葬的, 被掩埋的; v. 埋葬（bury 的过去式和过去分词）",
  "forms": {
    "base_form": "bury",
    "third_person_singular": "buries",
    "present_participle": "burying",
    "past_tense": "buried",
    "past_participle": "buried"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To place something, especially a dead body, under the ground and cover it with earth, sand, or other material.",
      "explanation_cn": "指将某物（尤指尸体）放置于地下并用泥土、沙子或其他材料覆盖。",
      "example_en": "The family buried their loved one in the cemetery with full honors.",
      "example_cn": "家人以隆重的仪式将逝者安葬在墓园中。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover or conceal something completely, often metaphorically, as if under layers of earth or debris.",
      "explanation_cn": "指完全覆盖或隐藏某物，常用于比喻意义，如同被层层泥土或废墟掩埋。",
      "example_en": "She buried her feelings of sadness beneath a smile.",
      "example_cn": "她把悲伤的情绪藏在了微笑之下。"
    },
    {
      "pos": "verb",
      "explanation_en": "To overwhelm or immerse someone in a large amount of something, such as work, information, or responsibilities.",
      "explanation_cn": "指用大量事物（如工作、信息或责任）压垮或淹没某人。",
      "example_en": "I’ve been buried in paperwork since Monday.",
      "example_cn": "自从周一以来，我就被文件淹没了。"
    },
    {
      "pos": "adjective",
      "explanation_en": "In a state of being covered or hidden beneath the surface, often implying inaccessibility or obscurity.",
      "explanation_cn": "处于被表面覆盖或隐藏的状态，常暗示难以触及或不为人知。",
      "example_en": "The ancient city lies buried beneath layers of volcanic ash.",
      "example_cn": "这座古城深埋于层层火山灰之下。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "interred",
      "analysis": "“Interred”（安葬）是“buried”的正式同义词，专用于指人类遗体的正式埋葬，带有仪式性和法律语境色彩，多用于殡葬文书或新闻报道中。而 “buried” 更通用，可用于尸体、物品甚至抽象概念的掩埋。"
    },
    {
      "word_to_compare": "covered",
      "analysis": "“Covered”（覆盖）强调表面的遮蔽，但不一定涉及深入地下或完全隐藏。例如，雪覆盖了屋顶。而 “buried” 暗示更深的掩埋和更强的隔离感，常带有“无法轻易触及”的含义。"
    },
    {
      "word_to_compare": "hidden",
      "analysis": "“Hidden”（隐藏）是更广泛的抽象词，指任何使某物不被看见或发现的行为，可以是藏在抽屉里、加密文件或伪装身份。而 “buried” 通常保留物理掩埋的意象，即使用于比喻（如情绪被埋葬），也仍带有“深埋”和“压抑”的强烈意象。"
    }
  ]
}