{
  "word": "burlesque",
  "pronunciation": "burr·lesk",
  "concise_definition": "n. 滑稽模仿, 讽刺剧; v. 滑稽模仿, 讽刺",
  "forms": {
    "third_person_singular": "burlesques",
    "past_tense": "burlesqued",
    "past_participle": "burlesqued",
    "present_participle": "burlesquing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A comedic or satirical imitation of a serious work, person, or style, often exaggerated for humorous or ironic effect, especially in theater, literature, or performance.",
      "explanation_cn": "对严肃作品、人物或风格进行的滑稽或讽刺性模仿，常通过夸张手法制造幽默或反讽效果，尤指在戏剧、文学或表演中的表现形式。",
      "example_en": "The play was a burlesque of Shakespearean tragedy, turning Hamlet into a clumsy detective.",
      "example_cn": "这部剧是对莎士比亚悲剧的滑稽模仿，把哈姆雷特变成了一个笨拙的侦探。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of variety show popular in the 19th and early 20th centuries, featuring comic sketches, striptease, and bawdy songs, often with a risqué or provocative tone.",
      "explanation_cn": "19世纪至20世纪初流行的一种综艺表演形式，包含喜剧小品、脱衣舞和粗俗歌曲，常带有挑逗或大胆的风格。",
      "example_en": "She began her career performing in burlesque shows in New York City.",
      "example_cn": "她最初在纽约市的滑稽歌舞秀中登台表演。"
    },
    {
      "pos": "verb",
      "explanation_en": "To imitate or parody something in a humorous or exaggerated way, often to mock or ridicule its seriousness.",
      "explanation_cn": "以幽默或夸张的方式模仿或讽刺某事物，常旨在嘲笑或贬低其严肃性。",
      "example_en": "The cartoon burlesqued political leaders by giving them giant heads and absurd mannerisms.",
      "example_cn": "这幅漫画通过给政治领袖画上巨大的脑袋和荒谬的举止来讽刺他们。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "parody",
      "analysis": "“Parody”（戏仿）与 “burlesque” 非常接近，都指通过夸张模仿来制造幽默或讽刺。但 “parody” 更侧重于精准模仿原作的风格和结构，以凸显其荒谬；而 “burlesque” 更强调粗俗、夸张和肢体化的表演，常带有低俗或挑逗色彩，尤其在表演艺术中。"
    },
    {
      "word_to_compare": "satire",
      "analysis": "“Satire”（讽刺）是一种更广泛、更深刻的社会批评形式，通过机智、反讽或夸张揭示人性或制度的缺陷。它不一定依赖模仿，而 “burlesque” 则必须以模仿为基础，且通常更注重娱乐性而非思想深度。"
    },
    {
      "word_to_compare": "farce",
      "analysis": "“Farce”（闹剧）是一种以荒诞情节、误会和肢体喜剧为特征的戏剧类型，强调滑稽和混乱，但不一定包含对特定对象的模仿。而 “burlesque” 的核心是模仿（尤其是对严肃题材的戏仿），其幽默来源于对原作的扭曲和降格。"
    }
  ]
}