{
  "word": "burlington",
  "pronunciation": "burr·ling·ton",
  "concise_definition": "n. 伯灵顿（地名，美国佛蒙特州城市；英国英格兰城镇）",
  "forms": {
    "plural": "Burlingtons"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to a city in the state of Vermont, United States, known for its lakeside location on Lake Champlain, vibrant arts scene, and progressive community.",
      "explanation_cn": "专有名词，指美国佛蒙特州的一座城市，坐落于尚普兰湖畔，以其活跃的艺术氛围和进步的社区文化而闻名。",
      "example_en": "She moved to Burlington after graduating from college to work in environmental policy.",
      "example_cn": "她大学毕业后搬到伯灵顿，从事环境政策方面的工作。"
    },
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to a town in Warwickshire, England, historically known for its market and proximity to the River Avon.",
      "explanation_cn": "专有名词，指英国沃里克郡的一个小镇，历史上以集市和靠近埃文河而著称。",
      "example_en": "The historic market square in Burlington, England, dates back to the 13th century.",
      "example_cn": "英国伯灵顿的历史性集市广场可追溯至13世纪。"
    },
    {
      "pos": "noun",
      "explanation_en": "A surname or family name, occasionally used as a brand name for retail chains (e.g., Burlington Stores, Inc.), a clothing retailer in the U.S.",
      "explanation_cn": "用作姓氏，偶尔也用作品牌名称（如美国零售连锁店Burlington Stores, Inc.），是一家美国服装零售商。",
      "example_en": "I bought a winter coat at Burlington last weekend.",
      "example_cn": "上周末我在伯灵顿商店买了一件冬衣。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "Boston",
      "analysis": "“Boston”（波士顿）是美国马萨诸塞州的主要城市，以高等教育、历史遗迹和体育文化著称，规模和国际影响力远大于伯灵顿。伯灵顿则更小、更社区化，常被视为宜居的中小型城市。两者均为地名，但层级和功能不同。"
    },
    {
      "word_to_compare": "Burlington Coat Factory",
      "analysis": "“Burlington Coat Factory” 是一个曾用品牌名，现已简化为 “Burlington”，专指美国的折扣服装零售连锁店。虽然名称相同，但作为品牌名时它是一个商业实体，而非地理名称。使用时需根据语境区分是城市还是商店。"
    },
    {
      "word_to_compare": "Berkeley",
      "analysis": "“Berkeley”（伯克利）是美国加利福尼亚州的一座大学城，以学术自由和政治激进主义闻名，与伯灵顿在文化气质上相似，但伯克利更侧重高等教育（加州大学伯克利分校），而伯灵顿更强调自然环境与社区生活。两者均为地名，但城市定位不同。"
    }
  ]
}