{
  "word": "burning",
  "pronunciation": "burr·ning",
  "concise_definition": "adj. 燃烧的, 灼热的, 急切的; n. 燃烧, 灼烧",
  "forms": {
    "base_form": "burn",
    "past_tense": "burned/burnt",
    "past_participle": "burned/burnt",
    "present_participle": "burning"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Characterized by or involving intense heat or fire; literally on fire or extremely hot to the touch.",
      "explanation_cn": "指具有强烈热量或火焰的特征；字面意义上正在燃烧或触感极热。",
      "example_en": "The burning logs crackled in the fireplace.",
      "example_cn": "壁炉里的燃烧木柴发出噼啪声。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Intensely passionate, urgent, or emotionally charged; describing a strong desire, feeling, or conviction.",
      "explanation_cn": "形容情感强烈、迫切或充满激情；指一种强烈的渴望、情感或信念。",
      "example_en": "She has a burning desire to become a doctor.",
      "example_cn": "她有着成为一名医生的强烈愿望。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Causing severe pain or discomfort, often used to describe a physical sensation like a sunburn or chemical irritation.",
      "explanation_cn": "形容引起剧烈疼痛或不适的感觉，常用于描述晒伤或化学刺激等身体感受。",
      "example_en": "His skin felt a burning sensation after being exposed to the sun for hours.",
      "example_cn": "他在阳光下暴晒数小时后，皮肤感到灼痛。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or process of burning; the state of being on fire or undergoing combustion.",
      "explanation_cn": "燃烧的行为或过程；处于燃烧或发生氧化反应的状态。",
      "example_en": "The burning of the forest destroyed hundreds of acres of wildlife habitat.",
      "example_cn": "森林大火摧毁了数百英亩的野生动物栖息地。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fiery",
      "analysis": "“Fiery”（火焰般的）强调与火相关的视觉或色彩特征，如红色、明亮、猛烈，常用于比喻性表达（如 fiery speech）。而 “burning” 更侧重于实际的高温、疼痛或情感的紧迫性，语义范围更广，可指物理灼热或心理渴望。"
    },
    {
      "word_to_compare": "scorching",
      "analysis": "“Scorching”（灼热的）通常指极端高温，足以使表面焦黑或损伤，多用于天气或物体表面（如 scorching heat）。它更强调物理破坏性，而 “burning” 可用于抽象情感（如 burning anger），语义更灵活。"
    },
    {
      "word_to_compare": "ardent",
      "analysis": "“Ardent”（热情的）专用于形容强烈的情感或信念，如 ardent supporter，语气更文雅、正式，常用于抽象领域。而 “burning” 在表达热情时更具画面感和原始力量，常用于口语或文学性表达，情感冲击更强。"
    }
  ]
}