{
  "word": "burn",
  "pronunciation": "bûrn",
  "concise_definition": "v. 燃烧, 烧毁, 灼伤; n. 灼伤, 火焰, 灼热感",
  "forms": {
    "third_person_singular": "burns",
    "past_tense": "burned/burnt",
    "past_participle": "burned/burnt",
    "present_participle": "burning"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To undergo or cause to undergo combustion, producing heat, light, and often smoke; to be consumed by fire.",
      "explanation_cn": "指发生或使某物发生燃烧，产生热量、光和通常的烟雾；被火焰消耗。",
      "example_en": "The candles burned steadily throughout the ceremony.",
      "example_cn": "蜡烛在整个仪式中稳定地燃烧着。"
    },
    {
      "pos": "verb",
      "explanation_en": "To injure or damage the skin or tissue by heat, electricity, chemicals, or radiation.",
      "explanation_cn": "指因高温、电流、化学品或辐射而造成皮肤或组织的损伤。",
      "example_en": "She burned her hand on the hot stove.",
      "example_cn": "她把手烫在了热炉子上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To consume or use up energy, resources, or time rapidly and intensely, often to the point of exhaustion.",
      "explanation_cn": "指迅速而剧烈地消耗能量、资源或时间，常达到精疲力竭的程度。",
      "example_en": "The athlete burned through his energy in the first five minutes of the race.",
      "example_cn": "这位运动员在比赛的前五分钟就耗尽了体力。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a strong, persistent feeling of anger, shame, or embarrassment; to be filled with such emotion.",
      "explanation_cn": "指引起强烈而持久的愤怒、羞耻或尴尬感；内心充满这种情绪。",
      "example_en": "He still burns with resentment over the unfair dismissal.",
      "example_cn": "他仍因被不公正解雇而心怀怨恨。"
    },
    {
      "pos": "noun",
      "explanation_en": "An injury caused by heat, fire, chemicals, or radiation; a mark or area of damaged skin.",
      "explanation_cn": "因高温、火焰、化学品或辐射造成的伤害；皮肤受损的区域或痕迹。",
      "example_en": "The doctor treated his second-degree burn with special ointment.",
      "example_cn": "医生用特殊药膏治疗了他的二度烫伤。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sensation of intense heat or pain, often metaphorical, such as a burning desire or a burning sensation in the eyes.",
      "explanation_cn": "一种强烈的热感或痛感，常为比喻用法，如炽热的欲望或眼睛的灼烧感。",
      "example_en": "She felt a burning desire to succeed in her career.",
      "example_cn": "她心中燃起一股强烈的事业成功欲望。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ignite",
      "analysis": "“Ignite” (点燃) 专指使某物开始燃烧的初始动作，强调“引发”燃烧的过程，通常用于物理或技术语境，如点燃火花或燃料。而 “burn” 是燃烧的持续状态或结果，涵盖从开始到结束的全过程。"
    },
    {
      "word_to_compare": "scorch",
      "analysis": "“Scorch” (灼烧/烤焦) 指因高温导致表面轻微烧焦或变色，但未完全燃烧或破坏，常用于描述轻微损伤，如晒焦的草地或烤糊的面包。而 “burn” 更严重，通常意味着更深层的破坏或组织损伤。"
    },
    {
      "word_to_compare": "char",
      "analysis": "“Char” (炭化) 指因高温使有机物部分碳化，留下黑色残留物，常用于描述木材或食物被烧焦后的状态。它强调的是物质结构的化学变化，而 “burn” 是更广泛、更通用的术语，可包含炭化但不仅限于此。"
    },
    {
      "word_to_compare": "flare",
      "analysis": "“Flare” (突然燃烧/闪现) 指火焰或光突然猛烈地爆发，通常是短暂而强烈的，如火炬突然闪亮或情绪突然爆发。它强调的是瞬间性与强度，而 “burn” 更倾向于持续、稳定的状态。"
    }
  ]
}