{
  "word": "bursting",
  "pronunciation": "burr·sting",
  "concise_definition": "adj. 充满的, 拥挤的, 激动的; v. 爆裂, 突然发生",
  "forms": {
    "base_form": "burst",
    "past_tense": "burst",
    "past_participle": "burst",
    "present_participle": "bursting"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Filled to capacity or beyond, often implying an intense or overwhelming amount of something, such as emotion, people, or energy.",
      "explanation_cn": "充满到极限甚至超载，通常暗示某种情感、人群或能量极度强烈或压倒性地聚集。",
      "example_en": "The stadium was bursting with fans cheering for their team.",
      "example_cn": "体育场里挤满了为球队加油的球迷。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Expressing strong emotion or excitement, often used to describe someone who is eager or overwhelmed with feeling.",
      "explanation_cn": "表达强烈的情感或兴奋，常用于形容某人因激动、渴望或情绪高涨而难以抑制。",
      "example_en": "She was bursting with pride after winning the award.",
      "example_cn": "她赢得奖项后激动得难以自持。"
    },
    {
      "pos": "verb",
      "explanation_en": "To break open or apart suddenly and violently, often due to internal pressure or force.",
      "explanation_cn": "因内部压力或外力突然猛烈地破裂或炸开。",
      "example_en": "The balloon burst when it was overinflated.",
      "example_cn": "气球充气过多时突然爆裂了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To occur suddenly and intensely, especially in reference to emotions, sounds, or events.",
      "explanation_cn": "突然而强烈地发生，尤指情感、声音或事件的爆发。",
      "example_en": "Laughter burst out as soon as the comedian stepped on stage.",
      "example_cn": "喜剧演员一上台，笑声便突然爆发。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "exploding",
      "analysis": "“Exploding”（爆炸）强调由内部能量引发的剧烈物理性破坏，常带有破坏性后果，多用于物理对象或事件；而 “bursting” 更广泛，可指物理破裂，也可用于情绪、笑声等抽象事物的突然释放，语气更口语化、更灵活。"
    },
    {
      "word_to_compare": "overflowing",
      "analysis": "“Overflowing”（溢出）指液体或抽象事物（如情感）因过多而自然溢出边界，强调“满到溢出”的状态，但不一定是突然或剧烈的；而 “bursting” 暗示突破极限、瞬间破裂，更具爆发性和戏剧性。"
    },
    {
      "word_to_compare": "teeming",
      "analysis": "“Teeming”（熙熙攘攘）描述的是大量事物持续不断地充满某个空间，如“teeming with life”（充满生机），强调密集和持续的状态；而 “bursting” 更强调瞬间的饱和或爆发，常带有一种即将失控或即将破裂的张力。"
    }
  ]
}