{
  "word": "burst",
  "pronunciation": "burrst",
  "concise_definition": "v. 爆裂, 突然发生; n. 爆发, 短暂的剧烈活动",
  "forms": {
    "third_person_singular": "bursts",
    "past_tense": "burst",
    "past_participle": "burst",
    "present_participle": "bursting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To break open or apart suddenly and violently, often due to internal pressure or excessive strain.",
      "explanation_cn": "指由于内部压力或过度拉伸而突然猛烈地破裂或炸开。",
      "example_en": "The balloon burst with a loud pop when it was overinflated.",
      "example_cn": "气球充气过多时突然爆裂，发出响亮的砰声。"
    },
    {
      "pos": "verb",
      "explanation_en": "To occur suddenly and intensely, especially in a short, powerful outburst of emotion, activity, or sound.",
      "explanation_cn": "指（情绪、活动或声音）突然而强烈地爆发，通常持续时间短暂但极具冲击力。",
      "example_en": "She burst into tears when she heard the news.",
      "example_cn": "她听到这个消息时突然哭了起来。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden, intense, and often brief outburst of energy, activity, or emotion.",
      "explanation_cn": "指能量、活动或情绪的突然而强烈的短暂爆发。",
      "example_en": "There was a burst of laughter when the comedian told the joke.",
      "example_cn": "喜剧演员讲完笑话后，爆发出一阵笑声。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden increase or surge in something, such as traffic, sales, or demand.",
      "explanation_cn": "指某事物（如交通、销售或需求）的突然激增或飙升。",
      "example_en": "The store experienced a burst of sales during the holiday season.",
      "example_cn": "这家商店在节日期间经历了销售激增。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "explode",
      "analysis": "“Explode” (爆炸) 通常指因化学反应或物理冲击导致的剧烈、破坏性更强的爆炸，常伴随火光、碎片和巨大声响，多用于物理性事件。而 “burst” 更强调内部压力导致的破裂，不一定伴随火焰或大规模破坏，适用范围更广，包括情绪、声音等抽象爆发。"
    },
    {
      "word_to_compare": "erupt",
      "analysis": "“Erupt” (喷发/爆发) 常用于火山、情绪或冲突的突然爆发，带有强烈自然或社会性含义，多用于长期积累后的释放，如火山喷发、愤怒爆发。它比 “burst” 更具累积性和戏剧性，常用于正式语境。而 “burst” 更强调瞬间性和突发性，不强调积累过程。"
    },
    {
      "word_to_compare": "blow up",
      "analysis": "“Blow up” (炸毁/膨胀) 是一个短语动词，常指人为引爆或使物体膨胀至破裂，强调外部作用力或故意行为。而 “burst” 多为自发性破裂，源于内部压力，不涉及外部引爆。此外，“blow up” 也可用于比喻义（如争吵升级），但语义更偏向“激化”，而 “burst” 更强调“瞬间释放”。"
    }
  ]
}