{
  "word": "business",
  "pronunciation": "biz·nihs",
  "concise_definition": "n. 商业, 企业, 业务, 事务",
  "forms": {
    "plural": "businesses"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An organization or enterprising entity engaged in commercial, industrial, or professional activities aimed at generating profit through the sale of goods or services.",
      "explanation_cn": "指从事商业、工业或专业活动的组织或企业实体，旨在通过销售商品或服务获取利润。",
      "example_en": "She started her own business selling handmade jewelry online.",
      "example_cn": "她创办了一家在线销售手工珠宝的企业。"
    },
    {
      "pos": "noun",
      "explanation_en": "The activity of buying, selling, or trading goods and services; the sphere of commercial operations.",
      "explanation_cn": "指买卖或交易商品和服务的活动；商业运作的领域。",
      "example_en": "The global business environment has become increasingly complex due to technological advances.",
      "example_cn": "由于技术进步，全球商业环境变得日益复杂。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person's regular occupation, profession, or main concern; something that one is involved in or responsible for.",
      "explanation_cn": "指一个人的常规职业、专业或主要事务；某人所关注或负责的事情。",
      "example_en": "It's none of your business what I do in my free time.",
      "example_cn": "我空闲时间做什么不关你的事。"
    },
    {
      "pos": "noun",
      "explanation_en": "A matter or affair that requires attention or action, often used in the phrase 'it's none of your business' to indicate privacy or lack of involvement.",
      "explanation_cn": "指需要关注或处理的事务，常用于短语 'it's none of your business' 表示隐私或与己无关。",
      "example_en": "The company is dealing with some serious business regarding its financial audit.",
      "example_cn": "公司正在处理有关财务审计的一些重大事务。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "enterprise",
      "analysis": "“Enterprise” (企业/事业) 更强调创新性、冒险性和规模性，常用于描述具有雄心壮志或开创性的商业项目，语气较正式。而 “business” 更通用，涵盖从个体户到跨国公司的所有商业实体，侧重于日常运营和盈利目的。"
    },
    {
      "word_to_compare": "trade",
      "analysis": "“Trade” (贸易/交易) 专指商品或服务的买卖行为，强调交换过程本身，范围较窄。而 “business” 包含贸易，但还涵盖生产、管理、营销、财务等更广泛的商业活动。"
    },
    {
      "word_to_compare": "profession",
      "analysis": "“Profession” (职业/专业) 指需要专门知识、技能和资格认证的工作，如医生、律师，强调专业性而非盈利性。而 “business” 可以是任何以盈利为目的的活动，不一定需要专业资质，如开便利店或网店。"
    }
  ]
}