{
  "word": "busts",
  "pronunciation": "busts",
  "concise_definition": "n. 半身像；胸围；失败；（复数）逮捕；（动词第三人称单数）打破，撞坏",
  "forms": {
    "singular": "bust",
    "third_person_singular": "busts",
    "past_tense": "busted",
    "past_participle": "busted",
    "present_participle": "busting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sculpted or molded representation of a person's head and upper chest, often used as a portrait or monument.",
      "explanation_cn": "指人物头部和上胸部的雕塑或模制形象，常用于肖像或纪念碑。",
      "example_en": "The museum displays a marble bust of the ancient Roman emperor.",
      "example_cn": "博物馆展出了一尊古罗马皇帝的大理石半身像。"
    },
    {
      "pos": "noun",
      "explanation_en": "The measurement of the circumference of a person's chest, especially in women's clothing sizes.",
      "explanation_cn": "指人体胸部的围度，尤指女性服装的尺码标准。",
      "example_en": "She has a 34-inch bust and wears a size small in most brands.",
      "example_cn": "她的胸围是34英寸，大多数品牌都穿小号。"
    },
    {
      "pos": "noun",
      "explanation_en": "A complete failure or collapse, especially of a plan, business, or venture.",
      "explanation_cn": "指计划、生意或项目彻底失败或崩溃。",
      "example_en": "The new restaurant was a bust — it closed after only three months.",
      "example_cn": "这家新餐厅彻底失败了——仅三个月就关门了。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of arresting someone, especially in slang usage; plural form often refers to multiple arrests.",
      "explanation_cn": "（俚语）指逮捕某人；复数形式常指多次逮捕。",
      "example_en": "The police had three busts last week targeting drug dealers.",
      "example_cn": "上周警方针对毒贩进行了三次逮捕。"
    },
    {
      "pos": "verb",
      "explanation_en": "To break or damage something suddenly or violently, especially by collision or pressure.",
      "explanation_cn": "指因碰撞或压力突然或猛烈地打破或损坏某物。",
      "example_en": "He busted the vase when he knocked it off the shelf.",
      "example_cn": "他把花瓶从架子上撞下来，摔碎了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "statue",
      "analysis": "“Statue”（雕像）通常指整个人体的完整雕塑，而 “bust” 仅包括头部和上胸部，是雕像的一种局部形式。因此，bust 是 statue 的子类，更侧重于上半身的肖像表现。"
    },
    {
      "word_to_compare": "failure",
      "analysis": "“Failure”（失败）是通用词，泛指任何未达成目标的情况；而 “bust” 作为名词时更口语化，常用于描述商业、项目或计划的彻底崩溃，带有更强的负面情绪和俚语色彩。"
    },
    {
      "word_to_compare": "arrest",
      "analysis": "“Arrest”（逮捕）是正式法律术语，指依法拘捕嫌疑人；而 “bust” 是其非正式、口语化的同义词，多用于新闻标题或日常对话中，语气更轻快或粗俗。"
    }
  ]
}