{
  "word": "butcher",
  "pronunciation": "buhch·uhr",
  "concise_definition": "n. 屠夫, 肉贩; v. 屠杀, 糟蹋, 破坏",
  "forms": {
    "third_person_singular": "butchers",
    "past_tense": "butchered",
    "past_participle": "butchered",
    "present_participle": "butchering"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person whose job is to kill animals and cut up their meat for sale, often specializing in specific types of meat such as beef, pork, or lamb.",
      "explanation_cn": "指以宰杀动物并切割其肉类出售为职业的人，通常专精于牛肉、猪肉或羊肉等特定肉类。",
      "example_en": "The local butcher prepares fresh sausages every morning using traditional recipes.",
      "example_cn": "当地屠夫每天早晨都用传统食谱制作新鲜香肠。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who commits brutal or cruel acts, especially mass killings, often used metaphorically to describe violent behavior.",
      "explanation_cn": "指实施残忍或暴行的人，尤其用于比喻性地描述实施大规模杀戮的暴徒或施暴者。",
      "example_en": "The dictator was called a butcher by international human rights organizations.",
      "example_cn": "这位独裁者被国际人权组织称为屠夫。"
    },
    {
      "pos": "verb",
      "explanation_en": "To kill animals in a violent or unskilled manner, or to slaughter them for meat in a crude or wasteful way.",
      "explanation_cn": "以暴力或不熟练的方式宰杀动物，或以粗劣、浪费的方式屠宰动物以获取肉类。",
      "example_en": "The animals were butchered in inhumane conditions on the factory farm.",
      "example_cn": "这些动物在工厂化农场的非人道条件下被宰杀。"
    },
    {
      "pos": "verb",
      "explanation_en": "To handle or perform something in a clumsy, careless, or incompetent way, resulting in damage or failure.",
      "explanation_cn": "以笨拙、粗心或无能的方式处理某事，导致损坏或失败。",
      "example_en": "He butchered the presentation by reading directly from the slides without any preparation.",
      "example_cn": "他毫无准备地直接照读幻灯片，把演讲彻底搞砸了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "kill",
      "analysis": "“Kill” (杀死) 是一个通用词，泛指导致死亡的行为，不涉及方式或意图。而 “butcher” 强调暴力、残忍或低效的杀戮方式，常带有贬义，尤其用于描述过度或不人道的杀戮行为。"
    },
    {
      "word_to_compare": "slaughter",
      "analysis": "“Slaughter” (屠杀) 与 “butcher” 在动物宰杀语境中非常接近，但 “slaughter” 更常用于大规模、系统性的杀戮（如战争或工业化屠宰），语气更正式、更沉重；而 “butcher” 更口语化，且常暗示技术拙劣或情感上的残忍。"
    },
    {
      "word_to_compare": "mangle",
      "analysis": "“Mangle” (毁坏/糟蹋) 指因粗暴处理而导致物体严重损坏，常用于物体或文本，如“把文章改得面目全非”。而 “butcher” 在比喻用法中更强调人为的无能或不负责任，尤其在表演、演讲或操作中造成灾难性后果。"
    }
  ]
}