{
  "word": "buttons",
  "pronunciation": "boo·tanz",
  "concise_definition": "n. 按钮, 纽扣, 按键",
  "forms": {
    "singular": "button"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small, typically round object attached to clothing to fasten it, often made of metal, plastic, or fabric, and passed through a buttonhole.",
      "explanation_cn": "一种通常为圆形的小物件，缝在衣物上用于扣合，常由金属、塑料或布料制成，并穿过扣眼使用。",
      "example_en": "She sewed a new button onto her coat after one fell off.",
      "example_cn": "她的一颗纽扣掉了，于是她给外套缝上了一颗新的。"
    },
    {
      "pos": "noun",
      "explanation_en": "A control on a device, such as a computer, remote, or machine, that is pressed to activate a function or command.",
      "explanation_cn": "设备（如电脑、遥控器或机器）上的一个控制键，按下后可触发某项功能或命令。",
      "example_en": "Press the power button to turn on the laptop.",
      "example_cn": "按下电源键以打开笔记本电脑。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, decorative item worn on clothing or a hat, often used to show support for a cause, political candidate, or organization.",
      "explanation_cn": "一种佩戴在衣物或帽子上的小型装饰品，常用于表达对某项事业、政治候选人或组织的支持。",
      "example_en": "He wore a campaign button with the candidate's face during the election.",
      "example_cn": "选举期间，他佩戴了一枚印有候选人头像的竞选徽章。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, rounded protrusion on a surface, especially one that resembles a button in shape or function, such as on a keyboard or a piece of furniture.",
      "explanation_cn": "表面上的一个小圆形凸起，尤其指形状或功能类似按钮的部件，如键盘或家具上的凸起。",
      "example_en": "The armchair had decorative buttons along the backrest.",
      "example_cn": "扶手椅的靠背上装饰着一排圆形纽扣状凸起。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "switch",
      "analysis": "“Switch”（开关）通常指一种用于接通或断开电路的机械或电子装置，具有明确的开/关状态，常用于控制电源或信号流。而 “button” 通常是瞬时触发的，按下后执行动作，松开即恢复，不保持状态（除非是锁定式按钮）。"
    },
    {
      "word_to_compare": "knob",
      "analysis": "“Knob”（旋钮）是圆形的旋转控制部件，用于调节强度、音量或位置，依赖转动而非按压。而 “button” 是通过按压触发动作，不涉及旋转或连续调节，功能更偏向于离散命令。"
    },
    {
      "word_to_compare": "fastener",
      "analysis": "“Fastener”（紧固件）是泛指所有用于连接或固定物体的装置，如拉链、搭扣、钩子等。而 “button” 是一种特定类型的紧固件，专用于衣物扣合，具有明确的形态和使用方式，属于 “fastener” 的子类。"
    }
  ]
}