{
  "word": "butter",
  "pronunciation": "buh·tuh",
  "concise_definition": "n. 黄油, 奶油; v. 涂黄油, 使润滑",
  "forms": {
    "plural": "butters"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A solid, yellowish fat made by churning cream or milk, commonly used as a spread on bread or in cooking and baking.",
      "explanation_cn": "通过搅动奶油或牛奶制成的固体黄色脂肪，常用于涂抹面包或烹饪和烘焙。",
      "example_en": "She spread warm butter on her toast this morning.",
      "example_cn": "今天早上她把热黄油涂在了吐司上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A substance used in cosmetics or lubricants that has a smooth, creamy texture similar to butter.",
      "explanation_cn": "指质地光滑如奶油、常用于化妆品或润滑剂中的物质。",
      "example_en": "She applied shea butter to her dry skin for extra moisture.",
      "example_cn": "她将乳木果油涂抹在干燥的皮肤上以增加保湿效果。"
    },
    {
      "pos": "verb",
      "explanation_en": "To spread butter on something, especially bread or toast.",
      "explanation_cn": "在某物（尤指面包或吐司）上涂抹黄油。",
      "example_en": "He buttered the rolls before serving them at dinner.",
      "example_cn": "他在晚餐上菜前把面包卷涂上了黄油。"
    },
    {
      "pos": "verb",
      "explanation_en": "To lubricate or make something smoother by applying a greasy substance, often metaphorically to gain favor.",
      "explanation_cn": "通过涂抹油脂使某物更顺滑；也可比喻为通过奉承来博取好感。",
      "example_en": "The politician tried to butter up the voters with promises of tax cuts.",
      "example_cn": "这位政客试图通过承诺减税来讨好选民。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "margarine",
      "analysis": "“Margarine”（人造黄油）是一种由植物油制成的黄油替代品，通常更廉价且饱和脂肪含量较低，但口感和风味不如天然黄油浓郁。黄油由乳脂制成，具有独特的奶香，而人造黄油则常添加香精模拟其味道。"
    },
    {
      "word_to_compare": "cream",
      "analysis": "“Cream”（奶油）是牛奶中分离出的脂肪层，呈液态或半固态，用于制作黄油、甜点或咖啡调味。黄油是奶油经过搅动后凝固的产物，脂肪含量更高（约80%），而奶油脂肪含量通常在30%-40%之间，质地更稀。"
    },
    {
      "word_to_compare": "grease",
      "analysis": "“Grease”（油脂/润滑脂）泛指任何黏稠的油性物质，常用于机械润滑或烹饪中，但带有负面或工业化的语义色彩。而 “butter” 作为动词时，虽可表示润滑，但更常用于比喻性的奉承行为，语义更温和、更具社交性。"
    }
  ]
}