{
  "word": "butterfly",
  "pronunciation": "buh·tuh·flie",
  "concise_definition": "n. 蝴蝶, v. 翻折, 像蝴蝶一样飞舞",
  "forms": {
    "plural": "butterflies"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A flying insect with large, often brightly colored wings covered in tiny scales, undergoing complete metamorphosis from caterpillar to adult.",
      "explanation_cn": "一种具有大型、常色彩鲜艳的翅膀且覆盖微小鳞片的飞行昆虫，经历从毛毛虫到成虫的完全变态过程。",
      "example_en": "The garden was filled with colorful butterflies fluttering among the flowers.",
      "example_cn": "花园里充满了在花朵间翩翩飞舞的五彩蝴蝶。"
    },
    {
      "pos": "noun",
      "explanation_en": "A swimming stroke in which the arms move symmetrically above the water in a circular motion, while the legs perform a dolphin kick.",
      "explanation_cn": "一种游泳姿势，双臂在水面上方呈对称的环形划动，双腿做海豚式打水。",
      "example_en": "She won the gold medal in the 100-meter butterfly at the Olympics.",
      "example_cn": "她在奥运会上赢得了100米蝶泳金牌。"
    },
    {
      "pos": "verb",
      "explanation_en": "To turn or fold something, especially paper, so that two parts meet in the middle, resembling the wings of a butterfly.",
      "explanation_cn": "将某物（尤指纸张）对折，使两侧部分在中间相遇，形似蝴蝶的翅膀。",
      "example_en": "He butterfly-folded the letter before placing it in the envelope.",
      "example_cn": "他把信纸对折成蝴蝶状，然后放进信封里。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or act in a light, fluttering, or erratic manner, like a butterfly in flight.",
      "explanation_cn": "以轻盈、飘忽或不规律的方式移动或行动，如同蝴蝶飞舞。",
      "example_en": "The children were butterfly-ing around the playground, never staying in one place for long.",
      "example_cn": "孩子们在操场上四处乱跑，像蝴蝶一样不停歇。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "moth",
      "analysis": "“Moth”（飞蛾）与“butterfly”同属鳞翅目昆虫，但飞蛾通常在夜间活动，翅膀颜色较暗淡，触角呈羽毛状；而蝴蝶多在白天活动，翅膀色彩鲜艳，触角呈棒状。两者在行为和外观上有明显区别，但常被非专业人士混淆。"
    },
    {
      "word_to_compare": "dragonfly",
      "analysis": "“Dragonfly”（蜻蜓）虽然也是飞行昆虫，但身体细长、翅膀透明且不覆盖鳞片，飞行方式更迅捷稳定，属于不同的目（蜻蜓目），与蝴蝶在形态、生命周期和生态角色上差异显著。"
    },
    {
      "word_to_compare": "flit",
      "analysis": "“Flit”（轻快地飞）是描述快速、轻盈移动的动词，常用于形容蝴蝶或小鸟的飞行方式，但它本身不是名词，也不指代生物实体。而 “butterfly” 作为名词，是具体生物，作为动词时强调的是像蝴蝶那样飞舞的动作，比 “flit” 更具形象性和比喻性。"
    }
  ]
}