{
  "word": "buzz",
  "pronunciation": "buhz",
  "concise_definition": "n. 嗡嗡声, 流言, 热议; v. 嗡嗡作响, 热议, 忙碌",
  "forms": {
    "third_person_singular": "buzzes",
    "past_tense": "buzzed",
    "past_participle": "buzzed",
    "present_participle": "buzzing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A continuous low humming or vibrating sound, typically made by insects like bees or by electrical devices.",
      "explanation_cn": "一种持续的低沉嗡嗡声或振动声，通常由蜜蜂等昆虫或电子设备发出。",
      "example_en": "The buzz of the bees filled the garden as the flowers bloomed.",
      "example_cn": "花朵盛开时，蜜蜂的嗡嗡声充满了整个花园。"
    },
    {
      "pos": "noun",
      "explanation_en": "A widespread feeling of excitement, interest, or rumor about something, often in the media or public sphere.",
      "explanation_cn": "指某事物在媒体或公众中引发的广泛兴奋、关注或流言，常用于描述热门话题或事件的舆论热度。",
      "example_en": "There's been a lot of buzz around the new smartphone launch.",
      "example_cn": "这款新智能手机的发布引发了大量热议。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a continuous low humming or vibrating sound, especially as produced by insects or machinery.",
      "explanation_cn": "发出持续的低沉嗡嗡声，尤指昆虫或机械发出的声音。",
      "example_en": "The flies were buzzing around the garbage bin.",
      "example_cn": "苍蝇在垃圾桶周围嗡嗡飞舞。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or act with energetic activity, often in a hurried or excited manner, especially in a social or professional context.",
      "explanation_cn": "以充满活力、匆忙或兴奋的方式行动，尤指在社交或职场环境中忙碌穿梭。",
      "example_en": "The office was buzzing with activity as the deadline approached.",
      "example_cn": "随着截止日期临近，办公室里一片忙碌景象。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hum",
      "analysis": "“Hum”（低鸣）指一种平稳、持续、通常较柔和的低音，常用于描述机器或环境的背景声音，如冰箱的嗡鸣。而 “buzz” 更尖锐、更急促，常带有不规则或干扰性的特征，如蜜蜂或电蚊拍的声音。"
    },
    {
      "word_to_compare": "rumor",
      "analysis": "“Rumor”（谣言）指未经证实的传闻或消息，强调信息的不确定性和传播性。而 “buzz” 不仅包含流言，更强调公众情绪的热度和广泛讨论的氛围，常带有积极或兴奋的色彩，如‘产品发布引发热议’。"
    },
    {
      "word_to_compare": "hustle",
      "analysis": "“Hustle”（忙碌奔波）强调为达成目标而积极、有时甚至急切地行动，常含功利性或商业动机，如‘为赚钱拼命工作’。而 ‘buzz’ 描述的是环境或人群中的活跃状态，不必然包含目的性，更侧重氛围而非个体行为。"
    }
  ]
}