{
  "word": "buzzing",
  "pronunciation": "buhz·ing",
  "concise_definition": "adj. 嘟嘟作响的, 嗡嗡作响的; n. 嗡嗡声, 热闹的气氛",
  "forms": {
    "base_form": "buzz",
    "comparative": "buzzing",
    "superlative": "buzzing"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Making a continuous low humming or vibrating sound, typically produced by insects, machinery, or electrical devices.",
      "explanation_cn": "发出持续的低沉嗡鸣声或振动声，通常由昆虫、机器或电子设备产生。",
      "example_en": "The room was filled with the buzzing of fluorescent lights and the hum of air conditioners.",
      "example_cn": "房间里充满了日光灯的嗡嗡声和空调的低鸣。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Full of energetic activity, excitement, or noise, often describing a lively or bustling atmosphere.",
      "explanation_cn": "充满活力、兴奋或喧闹，常用来形容热闹、繁忙的氛围。",
      "example_en": "The café was buzzing with conversation and laughter as students gathered after class.",
      "example_cn": "学生们课后聚集在咖啡馆里，谈笑风生，气氛热烈。"
    },
    {
      "pos": "noun",
      "explanation_en": "A continuous low humming or vibrating sound, especially that made by bees or electronic equipment.",
      "explanation_cn": "持续的低沉嗡鸣声，尤指蜜蜂或电子设备发出的声音。",
      "example_en": "The buzzing of the bees outside the window was soothing.",
      "example_cn": "窗外蜜蜂的嗡嗡声令人感到宁静。"
    },
    {
      "pos": "noun",
      "explanation_en": "A state of energetic activity or excitement, often used metaphorically to describe a vibrant social or cultural environment.",
      "explanation_cn": "一种充满活力的活动或兴奋状态，常用于比喻描述活跃的社会或文化环境。",
      "example_en": "There's been a lot of buzzing about the new tech startup since its launch.",
      "example_cn": "这家新科技初创公司自推出以来，一直备受热议。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "humming",
      "analysis": "“Humming”（低吟）通常指一种更平稳、柔和、持续的低音，常用于描述人唱歌、电机运转或风声，情感上更温和；而 “buzzing” 更尖锐、有节奏感，常与昆虫、电流或密集人群的喧闹相关，更具干扰性或活力感。"
    },
    {
      "word_to_compare": "rumbling",
      "analysis": "“Rumbling”（轰隆声）指低沉、震动强烈、来自远处或大型物体的声响，如雷声或卡车引擎；而 “buzzing” 是高频、短促、贴近耳畔的振动声，两者在频率和来源上截然不同。"
    },
    {
      "word_to_compare": "hubbub",
      "analysis": "“Hubbub”（喧闹声）专指由多人交谈、喊叫、笑声等混合而成的嘈杂人声，强调社会性混乱；而 “buzzing” 既可以是物理声音，也可以是比喻性的热闹氛围，范围更广，且不一定涉及人类语言。"
    }
  ]
}