{
  "word": "cage",
  "pronunciation": "kāj",
  "concise_definition": "n. 笼子, 笼状物; v. 关在笼中, 束缚",
  "forms": {
    "plural": "cages",
    "third_person_singular": "cages",
    "past_tense": "caged",
    "past_participle": "caged",
    "present_participle": "caging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A structure, typically made of bars or wires, designed to confine or contain animals or birds, often for protection, display, or control.",
      "explanation_cn": "一种通常由金属条或金属丝制成的结构，用于关押或容纳动物或鸟类，常出于保护、展示或控制的目的。",
      "example_en": "The zookeeper opened the cage to let the tiger out for its daily exercise.",
      "example_cn": "饲养员打开笼子，让老虎出来进行每日锻炼。"
    },
    {
      "pos": "noun",
      "explanation_en": "A confined or restricted space that limits freedom of movement or expression, often used metaphorically to describe psychological or social constraints.",
      "explanation_cn": "指限制行动或表达自由的封闭空间，常用于隐喻，形容心理或社会层面的束缚。",
      "example_en": "She felt trapped in a cage of societal expectations and traditional gender roles.",
      "example_cn": "她感到自己被困在社会期望和传统性别角色的牢笼之中。"
    },
    {
      "pos": "verb",
      "explanation_en": "To put or keep someone or something in a cage, especially an animal, or to restrict someone’s freedom or potential.",
      "explanation_cn": "将某人或某物关进笼子，尤指动物；也可引申为限制某人的自由或潜能。",
      "example_en": "The protesters were caged in by police barricades and could not escape.",
      "example_cn": "抗议者被警察的路障围困，无法逃脱。"
    },
    {
      "pos": "verb",
      "explanation_en": "In sports, to physically restrain or block an opponent by surrounding or holding them, especially in basketball or wrestling.",
      "explanation_cn": "在体育运动中，通过包围或压制来物理性地限制对手，尤指篮球或摔跤中的防守动作。",
      "example_en": "The defender caged the shooter before he could take the three-point shot.",
      "example_cn": "防守球员在射手出手三分前将他牢牢限制住。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "enclosure",
      "analysis": "“Enclosure”（围场/封闭区）泛指任何被围起来的空间，可以是自然或人工的，用途广泛（如动物围栏、花园围栏），不一定有栏杆结构，也不一定具有压迫感。而 “cage” 通常指由金属条构成、具有明显限制和监禁意味的结构，情感色彩更强烈。"
    },
    {
      "word_to_compare": "prison",
      "analysis": "“Prison”（监狱）专指用于关押罪犯的司法设施，具有法律和惩罚性质，规模更大、制度更复杂。而 “cage” 更偏向物理性、临时性或非正式的拘禁，可用于动物或比喻性语境，不必然涉及法律制裁。"
    },
    {
      "word_to_compare": "constraint",
      "analysis": "“Constraint”（限制/约束）是抽象名词，指规则、条件或力量对行为、选择或发展的限制，常用于理论、经济或心理语境。而 “cage” 作为动词或名词时，更强调具象的、物理的或强烈的情感束缚，更具画面感和压迫感。"
    }
  ]
}