{
  "word": "cake",
  "pronunciation": "kayk",
  "concise_definition": "n. 蛋糕, 块状物, v. 结成块, 堆积",
  "forms": {
    "plural": "cakes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sweet baked dessert made from flour, sugar, eggs, and other ingredients, often layered, frosted, and served at celebrations.",
      "explanation_cn": "一种由面粉、糖、鸡蛋和其他原料制成的甜点，通常分层、裱花，用于庆祝场合。",
      "example_en": "She baked a chocolate cake for her daughter's birthday party.",
      "example_cn": "她为女儿的生日派对烤了一个巧克力蛋糕。"
    },
    {
      "pos": "noun",
      "explanation_en": "A solid mass or layer of a substance that has formed or accumulated, often in an unwanted or thickened way.",
      "explanation_cn": "指某种物质堆积或凝结形成的固体块状物，常带有负面含义，如污垢、沉积物等。",
      "example_en": "There was a thick cake of grease on the stove top.",
      "example_cn": "炉灶上积了一层厚厚的油垢。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slang term for something valuable or desirable, especially in the context of money or rewards.",
      "explanation_cn": "俚语，指有价值或令人向往的事物，尤指金钱或报酬。",
      "example_en": "Winning the lottery was pure cake for him.",
      "example_cn": "中彩票对他来说简直是天上掉馅饼。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form a thick, hardened layer or deposit, especially over time or due to neglect.",
      "explanation_cn": "指随着时间推移或因疏于清理而形成厚实、硬化的沉积层。",
      "example_en": "Dirt had caked on the boots after the hike.",
      "example_cn": "徒步旅行后，泥土在靴子上结成了一层硬块。"
    },
    {
      "pos": "verb",
      "explanation_en": "To accumulate or build up in layers, often in a way that is undesirable or excessive.",
      "explanation_cn": "指以层状方式堆积，常带有负面或过度的含义。",
      "example_en": "Dust had caked on the shelves in the abandoned room.",
      "example_cn": "废弃房间的架子上积了一层厚厚的灰尘。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pie",
      "analysis": "“Pie”（派）通常指用酥皮包裹馅料（如水果、肉类）烘烤而成的食品，形状多为圆形，边缘有酥皮，口感偏酥脆；而 “cake”（蛋糕）以面粉、糖、蛋为基础，质地更松软、蓬松，常用于庆祝场合，两者在原料、结构和文化用途上均有明显区别。"
    },
    {
      "word_to_compare": "torte",
      "analysis": "“Torte”（德式蛋糕）是源自中欧的一种精致蛋糕，通常使用杏仁粉或面包屑代替部分面粉，质地更密实、浓郁，常多层且装饰复杂；而普通 “cake” 更通用，质地较轻盈，原料更简单，适用范围更广。"
    },
    {
      "word_to_compare": "crust",
      "analysis": "“Crust”（外壳/表层）指物体最外层坚硬的部分，如面包皮、地壳，强调的是表面结构；而 “cake” 作为名词时，指整个实体或堆积物，不仅限于表面，且常具有可食用性或体积感。作为动词时，“cake” 强调堆积成块的过程，而 “crust” 仅描述已形成的硬壳状态。"
    }
  ]
}