{
  "word": "camouflage",
  "pronunciation": "kam·uh·flawj",
  "concise_definition": "n. 伪装, 隐蔽; v. 伪装, 隐蔽",
  "forms": {
    "third_person_singular": "camouflages",
    "past_tense": "camouflaged",
    "past_participle": "camouflaged",
    "present_participle": "camouflaging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A method or material used to conceal something by making it blend in with its surroundings, often used in military contexts or animal adaptation.",
      "explanation_cn": "指通过使物体与周围环境融为一体来隐藏其存在的一种方法或材料，常用于军事领域或动物的自我保护适应。",
      "example_en": "The soldiers wore camouflage uniforms to avoid detection by enemy forces.",
      "example_cn": "士兵们穿着迷彩服以避免被敌方发现。"
    },
    {
      "pos": "noun",
      "explanation_en": "The appearance or pattern designed to obscure identity or location, such as the coloration of animals like chameleons or leopards.",
      "explanation_cn": "指用于掩盖身份或位置的外观或图案，例如变色龙或豹子的体色。",
      "example_en": "The leopard's spotted coat is a natural camouflage that helps it stalk prey undetected.",
      "example_cn": "豹子斑点状的皮毛是一种天然伪装，有助于它悄无声息地接近猎物。"
    },
    {
      "pos": "verb",
      "explanation_en": "To conceal or disguise something by using colors, patterns, or materials that match the environment.",
      "explanation_cn": "通过使用与环境相匹配的颜色、图案或材料来隐藏或伪装某物。",
      "example_en": "The tank was camouflaged with green and brown paint to blend into the forest.",
      "example_cn": "坦克被涂上了绿色和棕色的油漆，以融入森林环境。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hide the true nature or purpose of something, often by presenting a misleading appearance.",
      "explanation_cn": "通过呈现误导性的外表来隐藏某物的真实性质或目的。",
      "example_en": "The company camouflaged its financial losses by inflating sales figures.",
      "example_cn": "该公司通过虚报销售额来掩盖其财务亏损。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "disguise",
      "analysis": "“Disguise” (伪装) 通常指通过改变外貌或身份来欺骗他人，常用于人或角色的伪装，如戴假发、化妆等，强调主动的欺骗意图。而 “camouflage” 更侧重于与环境融合，以达到隐蔽目的，不一定涉及身份改变，常用于物体或动物的自然或战术性隐藏。"
    },
    {
      "word_to_compare": "conceal",
      "analysis": "“Conceal” (隐藏) 是一个更通用的词，泛指使某物不被看见或发现，可以是物理遮盖、藏匿或保密。它不强调环境融合或视觉欺骗的手段。而 “camouflage” 是一种特定类型的 concealment，依赖于视觉匹配和环境模仿。"
    },
    {
      "word_to_compare": "hide",
      "analysis": "“Hide” (隐藏) 是最口语化和通用的词，指简单地把某物放在看不见的地方，如藏在柜子里。它不涉及复杂的视觉策略或环境适应。而 “camouflage” 是一种有策略、有设计的隐藏方式，依赖于颜色、纹理和形状的协调，常用于专业或自然场景。"
    }
  ]
}