{
  "word": "campaigned",
  "pronunciation": "kam·peynd",
  "concise_definition": "v. 竞选, 开展运动, 进行宣传",
  "forms": {
    "base_form": "campaign",
    "third_person_singular": "campaigns",
    "present_participle": "campaigning",
    "past_tense": "campaigned",
    "past_participle": "campaigned"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To organize and carry out a series of activities with a specific goal, especially to gain public support for a political candidate, cause, or policy.",
      "explanation_cn": "指为实现特定目标（尤其是争取公众对政治候选人、事业或政策的支持）而有组织地开展一系列活动。",
      "example_en": "She campaigned tirelessly for environmental reform during the election.",
      "example_cn": "她在选举期间为推动环境改革不懈地开展竞选活动。"
    },
    {
      "pos": "verb",
      "explanation_en": "To actively promote or advocate for something through sustained effort, such as a social, commercial, or public health initiative.",
      "explanation_cn": "指通过持续努力积极倡导或推广某事物，如社会运动、商业推广或公共卫生项目。",
      "example_en": "The health organization campaigned to reduce sugar consumption among children.",
      "example_cn": "该健康组织发起了减少儿童糖分摄入的宣传活动。"
    },
    {
      "pos": "verb",
      "explanation_en": "To engage in military operations or strategic maneuvers over a period of time in pursuit of a particular objective.",
      "explanation_cn": "指在一段时间内为实现特定目标而进行军事行动或战略部署。",
      "example_en": "The army campaigned through the region for three months before securing victory.",
      "example_cn": "军队在该地区进行了为期三个月的军事行动，最终取得胜利。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "advocate",
      "analysis": "“Advocate”（倡导）强调表达支持或为某事辩护，通常是通过言论、写作或公开声明，不一定包含系统性组织或长期行动。而 “campaigned” 暗示了有计划、有步骤、持续性的活动，常涉及资源调配和公众动员。"
    },
    {
      "word_to_compare": "promote",
      "analysis": "“Promote”（推广）范围更广，可用于商业、文化、个人形象等，通常指提升知名度或吸引力，但不一定包含对抗性或目标导向的系统性斗争。而 “campaigned” 更具目的性和策略性，常用于政治、社会变革或竞争性情境中。"
    },
    {
      "word_to_compare": "lobby",
      "analysis": "“Lobby”（游说）特指通过私下接触决策者（如议员、官员）来影响政策或立法，是一种间接施压方式。而 “campaigned” 更侧重于面向公众的广泛动员和宣传，强调公开性和群众参与。"
    }
  ]
}