{
  "word": "camp",
  "pronunciation": "kamp",
  "concise_definition": "n. 营地, 阵营; v. 宿营, 安营扎寨",
  "forms": {
    "plural": "camps",
    "third_person_singular": "camps",
    "past_tense": "camped",
    "past_participle": "camped",
    "present_participle": "camping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A temporary settlement or area with basic facilities, typically used for outdoor living, recreation, or military purposes.",
      "explanation_cn": "指为户外生活、休闲或军事目的而设立的临时性居住区域，通常配备基本设施。",
      "example_en": "The hikers set up camp near the lake before sunset.",
      "example_cn": "徒步者们在日落前于湖边搭起了营地。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of people who share the same opinions, beliefs, or interests, especially in politics or social issues, often in opposition to another group.",
      "explanation_cn": "指在政治或社会议题上持有相同观点、信仰或利益的一群人，通常与另一群体相对立。",
      "example_en": "The debate split the party into two opposing camps.",
      "example_cn": "这场辩论使该政党分裂为两个对立的阵营。"
    },
    {
      "pos": "verb",
      "explanation_en": "To set up and occupy a temporary shelter or living area, especially in the outdoors.",
      "explanation_cn": "指在户外搭建并占据临时住所或居住区。",
      "example_en": "We camped under the stars for three nights during our road trip.",
      "example_cn": "我们在公路旅行中露营了三个晚上，仰望星空。"
    },
    {
      "pos": "noun",
      "explanation_en": "A distinctive style or aesthetic characterized by exaggerated, theatrical, or ironic expression, often associated with LGBTQ+ culture and high fashion.",
      "explanation_cn": "指一种以夸张、戏剧化或讽刺性表达为特征的独特风格或审美，常与LGBTQ+文化和高级时尚相关联。",
      "example_en": "The film is a camp classic, full of over-the-top costumes and melodramatic dialogue.",
      "example_cn": "这部电影是一部经典的‘酷儿风’作品，充满夸张的服装和戏剧化的对白。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "base",
      "analysis": "“Base”（基地）通常指更永久性、组织化、功能齐全的军事或行政中心，强调战略性和持续性；而 “camp” 更强调临时性、简陋性和流动性，常用于短期驻扎或休闲场景。"
    },
    {
      "word_to_compare": "faction",
      "analysis": "“Faction”（派系）指一个组织内部因意见分歧而形成的较小团体，通常带有内部斗争的意味；而 “camp” 更广泛，可指任何持相同立场的群体，不一定隶属于同一组织，且常用于公开对立的语境中。"
    },
    {
      "word_to_compare": "encamp",
      "analysis": "“Encamp” 是 “camp” 的正式或书面形式动词，语义完全相同，但使用频率更低，多见于历史文献或军事文本中；日常口语中普遍使用 “camp” 作为动词。"
    }
  ]
}