{
  "word": "campaign",
  "pronunciation": "kam·peyn",
  "concise_definition": "n. 活动, 运动, 战役; v. 开展活动, 参加竞选",
  "forms": {
    "plural": "campaigns",
    "third_person_singular": "campaigns",
    "past_tense": "campaigned",
    "past_participle": "campaigned",
    "present_participle": "campaigning"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A coordinated series of actions designed to achieve a specific goal, often in politics, marketing, or military contexts.",
      "explanation_cn": "为实现特定目标而精心策划的一系列协调行动，常用于政治、市场营销或军事领域。",
      "example_en": "The environmental group launched a campaign to reduce plastic waste.",
      "example_cn": "这个环保组织发起了一场减少塑料浪费的活动。"
    },
    {
      "pos": "noun",
      "explanation_en": "A prolonged military operation or series of battles aimed at achieving a strategic objective.",
      "explanation_cn": "为实现战略目标而进行的长期军事行动或一系列战役。",
      "example_en": "The general led a successful campaign to capture the enemy's stronghold.",
      "example_cn": "这位将军领导了一场成功夺取敌方要塞的战役。"
    },
    {
      "pos": "noun",
      "explanation_en": "A political effort to win public support and election to office, involving speeches, advertisements, and public appearances.",
      "explanation_cn": "为赢得公众支持并当选公职而进行的政治活动，包括演讲、广告和公开露面。",
      "example_en": "She is running a grassroots campaign for mayor, relying on volunteers and community meetings.",
      "example_cn": "她正在开展一场基层市长竞选，依靠志愿者和社区会议争取支持。"
    },
    {
      "pos": "verb",
      "explanation_en": "To actively work toward achieving a political, social, or commercial goal by organizing and participating in promotional or persuasive activities.",
      "explanation_cn": "通过组织和参与宣传或说服性活动，积极为实现政治、社会或商业目标而努力。",
      "example_en": "He campaigned tirelessly for climate reform throughout the election season.",
      "example_cn": "他在整个选举季中不遗余力地为气候变革奔走呼吁。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "movement",
      "analysis": "“Movement” (运动) 指由广泛人群参与的、长期的社会或政治变革趋势，通常缺乏明确的组织结构和短期目标，如民权运动或环保运动。而 “campaign” 更具组织性、目标明确、时间有限，是实现更大运动中的具体行动阶段。"
    },
    {
      "word_to_compare": "operation",
      "analysis": "“Operation” (行动) 多用于军事或专业领域，强调执行一项具体、有计划的任务，通常为一次性或短期行为，如‘诺曼底登陆行动’。而 ‘campaign’ 是由多个 ‘operation’ 组成的、持续较长时间的综合性战略进程。"
    },
    {
      "word_to_compare": "initiative",
      "analysis": "“Initiative” (倡议) 指提出新想法或计划的开端，强调原创性和主动性，但不一定包含持续的执行过程。而 ‘campaign’ 是在倡议基础上展开的、有组织、有资源投入的系统性推进过程。"
    }
  ]
}