{
  "word": "candy",
  "pronunciation": "kan·dee",
  "concise_definition": "n. 糖果, 糖果类零食; v. 用糖衣包裹, 使甜美",
  "forms": {
    "plural": "candies"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sweet food made primarily from sugar or chocolate, often flavored and colored, and consumed as a snack or treat.",
      "explanation_cn": "一种主要由糖或巧克力制成的甜食，常添加风味和色素，作为零食或甜点食用。",
      "example_en": "She bought a bag of assorted candies for the children's party.",
      "example_cn": "她为孩子们的派对买了一袋混合糖果。"
    },
    {
      "pos": "noun",
      "explanation_en": "Something that is overly sweet, sentimental, or artificially pleasant, often used metaphorically to describe insincere or excessive flattery.",
      "explanation_cn": "比喻意义上指过于甜腻、感伤或人为做作的事物，常用于形容虚伪或过度的奉承。",
      "example_en": "The movie was full of candy dialogue—too saccharine to be believable.",
      "example_cn": "这部电影充满了甜腻的对白，过于做作，难以令人信服。"
    },
    {
      "pos": "verb",
      "explanation_en": "To coat or cover something with sugar or a sweet substance, often to improve its appearance or taste.",
      "explanation_cn": "用糖或甜味物质包裹或覆盖某物，通常为了改善其外观或口感。",
      "example_en": "The baker candied the orange peels for the dessert.",
      "example_cn": "烘焙师用糖渍了橙皮，用于甜点。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make something more appealing by adding superficial or insincere embellishments, especially in speech or presentation.",
      "explanation_cn": "通过添加表面化或不真诚的修饰来使某事物更具吸引力，尤指在言语或表达中。",
      "example_en": "The politician tried to candy the harsh truth with soothing words.",
      "example_cn": "这位政客试图用悦耳的言辞来粉饰残酷的真相。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sweets",
      "analysis": "“Sweets”（甜食）是英式英语中对糖果类零食的统称，涵盖范围更广，包括巧克力、布丁、果冻等；而 “candy” 是美式英语中的常用词，更侧重于硬糖、软糖、棒糖等具体形态的糖制零食。两者在语义上高度重叠，但地域用法不同。"
    },
    {
      "word_to_compare": "dessert",
      "analysis": "“Dessert”（甜点）指正餐后食用的甜食，通常包含多种成分（如奶油、水果、蛋糕），结构更复杂；而 “candy” 是独立的、便携的、以糖为主导的零食，不作为正餐的一部分。前者是餐后项目，后者是随时可吃的零食。"
    },
    {
      "word_to_compare": "sweeten",
      "analysis": "“Sweeten”（使变甜）是物理或化学上增加甜味的动作，如在咖啡中加糖；而 “candy” 作为动词时，不仅指加糖，更强调用糖衣包裹或进行装饰性美化，常带有比喻义，如粉饰真相，语义更丰富且具修辞色彩。"
    }
  ]
}