{
  "word": "cannabis",
  "pronunciation": "kan·uh·biss",
  "concise_definition": "n. 大麻, 火麻, 大麻植物",
  "forms": {
    "plural": "cannabises"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A genus of flowering plants in the family Cannabaceae, commonly known as marijuana or hemp, whose leaves and flowers contain psychoactive compounds such as THC, used recreationally, medicinally, or industrially.",
      "explanation_cn": "一种属于大麻科的开花植物属，通常被称为大麻或工业大麻，其叶片和花含有如THC等精神活性化合物，可用于娱乐、医疗或工业用途。",
      "example_en": "Cannabis has been used for thousands of years in traditional medicine to relieve pain and inflammation.",
      "example_cn": "大麻已使用数千年，在传统医学中用于缓解疼痛和炎症。"
    },
    {
      "pos": "noun",
      "explanation_en": "The dried flowers, leaves, and stems of the cannabis plant, prepared for smoking or ingestion as a psychoactive drug.",
      "explanation_cn": "大麻植物的干燥花、叶和茎，经加工后用于吸食或摄入，作为精神活性药物。",
      "example_en": "In some countries, possession of small amounts of cannabis is legal for personal use.",
      "example_cn": "在一些国家，少量大麻用于个人用途是合法的。"
    },
    {
      "pos": "noun",
      "explanation_en": "Fiber derived from the stalks of non-psychoactive hemp varieties of cannabis, used in textiles, paper, and construction materials.",
      "explanation_cn": "来自非精神活性工业大麻品种的茎部纤维，用于纺织品、纸张和建筑材料。",
      "example_en": "Hemp fiber from cannabis is an eco-friendly alternative to cotton in clothing production.",
      "example_cn": "大麻纤维是服装生产中一种环保的棉替代品。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "marijuana",
      "analysis": "“Marijuana” 是 “cannabis” 的通俗说法，特指用于娱乐或医疗目的的、含有较高THC含量的大麻植物部分，带有较强的口语和法律语境色彩。而 “cannabis” 是科学和正式术语，涵盖所有品种（包括低THC的工业大麻），语义范围更广、更中性。"
    },
    {
      "word_to_compare": "hemp",
      "analysis": "“Hemp” 指的是大麻植物中THC含量极低（通常低于0.3%）的品种，主要用于工业用途，如纤维、油和建材。它强调的是非精神活性和经济价值，而 “cannabis” 是总称，包含 hemp 和 marijuana 两种主要类型。"
    },
    {
      "word_to_compare": "weed",
      "analysis": "“Weed” 是一个非正式、俚语化的词，常用于口语中指代大麻，带有贬义或随意色彩，有时也泛指任何杂草。它缺乏科学准确性，而 “cannabis” 是精确的植物学和医学术语，适用于学术、法律和医疗语境。"
    }
  ]
}