{
  "word": "cant",
  "pronunciation": "kant",
  "concise_definition": "n. 虚伪的说辞, 陈词滥调; v. 不能, 不会 (古语或方言)",
  "forms": {
    "third_person_singular": "cants",
    "past_tense": "canted",
    "past_participle": "canted",
    "present_participle": "canting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Insincere or pretentious talk, especially about moral or religious principles; language that is stereotyped, formulaic, and lacking in genuine feeling or originality.",
      "explanation_cn": "指关于道德或宗教原则的虚伪、做作的言论，尤其是那些陈腐、刻板、缺乏真实情感或原创性的表达。",
      "example_en": "He dismissed the politician's speech as mere cant about compassion and reform.",
      "example_cn": "他将这位政客的演讲斥为关于同情与改革的空洞陈词滥调。"
    },
    {
      "pos": "noun",
      "explanation_en": "The sloping or slanting position of something, especially in architecture or engineering (archaic or technical usage).",
      "explanation_cn": "（古语或技术用法）指某物的倾斜或斜向位置，尤用于建筑或工程领域。",
      "example_en": "The roof had a slight cant to allow rainwater to drain off.",
      "example_cn": "屋顶略带倾斜，以便雨水排出。"
    },
    {
      "pos": "verb",
      "explanation_en": "To speak in a hypocritical or sanctimonious manner; to use clichéd moralizing language.",
      "explanation_cn": "以虚伪或道貌岸然的方式说话；使用陈腐的道德说教语言。",
      "example_en": "She canted about the importance of honesty while lying to her clients.",
      "example_cn": "她一边对客户撒谎，一边却大谈诚实的重要性。"
    },
    {
      "pos": "verb",
      "explanation_en": "To tilt or slant something, especially at an angle (archaic or technical usage).",
      "explanation_cn": "（古语或技术用法）使某物倾斜或成斜角。",
      "example_en": "The builders canted the window frame to catch more sunlight.",
      "example_cn": "工匠们将窗框倾斜，以获取更多阳光。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be unable or unwilling to do something (archaic or dialectal usage, especially in British English).",
      "explanation_cn": "（古语或方言用法，尤见于英式英语）表示不能或不愿做某事。",
      "example_en": "I cant abide that kind of behavior.",
      "example_cn": "我无法忍受那种行为。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hypocrisy",
      "analysis": "“Hypocrisy” (虚伪) 是一个名词，指言行不一、表里不一的道德状态或行为本质，是“cant”的核心内容，但“cant”更强调语言表达本身——即那些伪装成道德的空话，而“hypocrisy”可涵盖行动、态度等更广范围。"
    },
    {
      "word_to_compare": "platitude",
      "analysis": "“Platitude” (陈词滥调) 指那些因过度使用而失去意义的平庸言论，强调缺乏新意；而“cant”除了陈腐，更强调其道德伪装性——它披着高尚外衣，实则空洞甚至虚伪。"
    },
    {
      "word_to_compare": "tilt",
      "analysis": "“Tilt” (倾斜) 是一个通用动词，指物理上的倾斜，中性无褒贬；而“cant”作为动词时，虽可表倾斜，但多用于技术或古语语境，且常隐含非垂直、非标准的意味，语义更狭窄、更专业。"
    }
  ]
}