{
  "word": "canterbury",
  "pronunciation": "kan·tuh·buhree",
  "concise_definition": "n. 坎特伯雷（英国地名）；坎特伯雷大主教；坎特伯雷故事集",
  "forms": {
    "plural": "canterburys"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A historic city in southeastern England, known as the seat of the Archbishop of Canterbury and the spiritual center of the Anglican Communion.",
      "explanation_cn": "英国东南部一座历史悠久的城市，是坎特伯雷大主教的驻地，也是圣公会的精神中心。",
      "example_en": "Pilgrims have traveled to Canterbury for centuries to visit the shrine of Saint Thomas Becket.",
      "example_cn": "几个世纪以来，朝圣者一直前往坎特伯雷，参访圣托马斯·贝克特的圣龛。"
    },
    {
      "pos": "noun",
      "explanation_en": "The Archbishop of Canterbury, who is the senior bishop and principal leader of the Church of England and the symbolic head of the worldwide Anglican Communion.",
      "explanation_cn": "坎特伯雷大主教，英格兰教会的首席主教和主要领袖，也是全球圣公会的精神领袖。",
      "example_en": "The current Archbishop of Canterbury has called for greater unity among Christian denominations.",
      "example_cn": "现任坎特伯雷大主教呼吁基督教各教派之间加强团结。"
    },
    {
      "pos": "noun",
      "explanation_en": "A collection of 24 stories written by Geoffrey Chaucer in the late 14th century, framed as a pilgrimage from London to Canterbury, and considered one of the greatest works in English literature.",
      "explanation_cn": "由杰弗里·乔叟于14世纪末创作的24个故事集，以一群朝圣者从伦敦前往坎特伯雷的旅程为框架，被认为是英语文学中最伟大的作品之一。",
      "example_en": "Chaucer’s Canterbury Tales offers a vivid portrait of medieval English society.",
      "example_cn": "乔叟的《坎特伯雷故事集》生动地描绘了中世纪英国社会的面貌。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "canterbury",
      "analysis": "“Canterbury” 是一个专有名词，特指英国的这座城、其大主教或乔叟的作品，不具备普通名词的通用含义。它不同于如 ‘London’ 或 ‘Rome’ 等其他地名，因其在宗教、文学和历史上的特殊地位而具有多重文化指涉。"
    },
    {
      "word_to_compare": "archbishop",
      "analysis": "“Archbishop”（大主教）是一个通用头衔，指高级主教，而 “Canterbury” 作为专有名词，特指担任这一职位的特定人物（即坎特伯雷大主教）。前者是职位名称，后者是身份与地点的结合体。"
    },
    {
      "word_to_compare": "pilgrimage",
      "analysis": "“Pilgrimage”（朝圣）是前往圣地的宗教旅程，而 “Canterbury” 是其中最著名的朝圣目的地之一。前者是行为或概念，后者是具体地点，二者是关联但不同类的词。"
    }
  ]
}