{
  "word": "cap",
  "pronunciation": "kap",
  "concise_definition": "n. 帽子, 顶盖, 最高限额; v. 加盖, 限制, 达到极限",
  "forms": {
    "plural": "caps",
    "third_person_singular": "caps",
    "past_tense": "capped",
    "past_participle": "capped",
    "present_participle": "capping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A covering for the head, typically made of fabric or other material, worn for protection, fashion, or ceremonial purposes.",
      "explanation_cn": "一种戴在头上的覆盖物，通常由布料或其他材料制成，用于防护、时尚或仪式目的。",
      "example_en": "He wore a baseball cap to shield his eyes from the sun.",
      "example_cn": "他戴了一顶棒球帽来遮挡阳光。"
    },
    {
      "pos": "noun",
      "explanation_en": "A removable cover or lid for a container, especially one that seals or protects its contents.",
      "explanation_cn": "容器的可拆卸盖子，尤其指用于密封或保护内容物的盖子。",
      "example_en": "Make sure to replace the cap on the bottle after use.",
      "example_cn": "使用后请确保盖好瓶盖。"
    },
    {
      "pos": "noun",
      "explanation_en": "An upper limit or maximum amount that is officially or artificially imposed on something, such as spending, population, or speed.",
      "explanation_cn": "对某事物（如支出、人口或速度）所设定的官方或人为的最高限额。",
      "example_en": "The government imposed a cap on carbon emissions to combat climate change.",
      "example_cn": "政府对碳排放设定了上限以应对气候变化。"
    },
    {
      "pos": "verb",
      "explanation_en": "To place a cap or cover on something, especially to seal or finish it off.",
      "explanation_cn": "在某物上加盖或覆盖，尤其指密封或完成某物。",
      "example_en": "The workers capped the well to prevent further leakage.",
      "example_cn": "工人们封住了井口以防止进一步泄漏。"
    },
    {
      "pos": "verb",
      "explanation_en": "To limit or restrict something to a maximum level or amount.",
      "explanation_cn": "将某事物限制在最大水平或数量内。",
      "example_en": "The university capped class sizes at 30 students to ensure quality education.",
      "example_cn": "这所大学将班级人数限制在30人以内，以确保教学质量。"
    },
    {
      "pos": "verb",
      "explanation_en": "To surpass or reach a peak or highest point, often used in the phrase 'cap off' to mean to conclude something impressively.",
      "explanation_cn": "达到或超越顶点，常用于短语 'cap off'，意为以令人印象深刻的方式结束某事。",
      "example_en": "The concert was capped off with a dazzling fireworks display.",
      "example_cn": "音乐会以一场绚丽的烟花表演圆满结束。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hat",
      "analysis": "“Hat”（帽子）是更通用的词，泛指所有类型的头饰，包括礼帽、草帽等，而 “cap” 通常指无檐或短檐的轻便帽子，如棒球帽、针织帽，更强调功能性或休闲性。"
    },
    {
      "word_to_compare": "lid",
      "analysis": "“Lid”（盖子）与 “cap” 在容器上常可互换，但 “lid” 通常指较大、较重、铰接或平放的盖子（如锅盖），而 “cap” 更常用于小口容器的旋拧式或压入式盖子（如药瓶、饮料瓶）。"
    },
    {
      "word_to_compare": "limit",
      "analysis": "“Limit”（限制）是更抽象和通用的词，泛指任何边界或约束，而 “cap” 作为名词时特指一种‘上限’，常用于政策、经济或技术语境，带有官方设定的含义，更具强制性和量化特征。"
    }
  ]
}