{
  "word": "capabilities",
  "pronunciation": "kay·puh·bil·uh·teez",
  "concise_definition": "n. 能力, 才能, 功能, 实力",
  "forms": {
    "singular": "capability"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The power or ability to do something, especially in terms of skill, knowledge, or resources required to accomplish a task or function.",
      "explanation_cn": "指完成某项任务或功能所需的技能、知识或资源等能力，强调实际可执行的潜力或资质。",
      "example_en": "The new software has enhanced capabilities for data analysis and visualization.",
      "example_cn": "这款新软件增强了数据分析和可视化的功能。"
    },
    {
      "pos": "noun",
      "explanation_en": "The inherent or designed functions or features of a system, machine, or organization, often used in technical or organizational contexts.",
      "explanation_cn": "指系统、机器或组织所具备的固有或设计的功能特性，常用于技术或组织管理语境中。",
      "example_en": "The drone's capabilities include real-time video streaming and autonomous navigation.",
      "example_cn": "该无人机的功能包括实时视频传输和自主导航。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person's or group's overall capacity to perform effectively in a particular domain, often referring to potential rather than current performance.",
      "explanation_cn": "指个人或群体在特定领域内有效运作的整体潜力，常强调潜在能力而非当前表现。",
      "example_en": "Investing in education builds the long-term capabilities of a nation's workforce.",
      "example_cn": "投资教育能够提升国家劳动力的长期能力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ability",
      "analysis": "“Ability”（能力）更侧重于个体天生或后天习得的做某事的天赋或技能，通常用于描述人，语义更个人化、基础化。而 “capabilities” 更常用于系统、组织或技术层面，强调综合、可量化的功能集合，范围更广、更正式。"
    },
    {
      "word_to_compare": "competence",
      "analysis": "“Competence”（胜任力）强调达到某一标准所需的熟练程度或专业水平，常用于评估是否符合岗位或规范要求，带有评价性。而 “capabilities” 更中性，侧重于存在或具备的潜力与功能，不必然涉及是否达标。"
    },
    {
      "word_to_compare": "capacity",
      "analysis": "“Capacity”（容量/潜能）常指物理空间、承载量或心理/生理上的最大承受限度（如：会议厅容量、记忆容量），也可用于抽象潜能，但更偏向“上限”概念。而 “capabilities” 更强调实际可执行的功能或技能组合，是主动的、多维度的实现力，而非被动的承载力。"
    }
  ]
}