{
  "word": "capacities",
  "pronunciation": "kə·pas·ə·tēz",
  "concise_definition": "n. 能力, 容量, 职能, 潜能",
  "forms": {
    "singular": "capacity"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The ability or power to do, experience, or understand something; a natural or acquired skill or talent.",
      "explanation_cn": "指做某事、体验某事或理解某事的能力；一种天生或后天获得的技能或天赋。",
      "example_en": "She has a remarkable capacity for learning new languages.",
      "example_cn": "她具有非凡的语言学习能力。"
    },
    {
      "pos": "noun",
      "explanation_en": "The maximum amount that something can contain, hold, or produce; volume or load limit.",
      "explanation_cn": "指某物所能容纳、持有或产生的最大量；容积或负载极限。",
      "example_en": "The stadium has a seating capacity of 80,000 people.",
      "example_cn": "这个体育场的座位容量为八万人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A role or function that someone or something performs, especially in an official or organizational context.",
      "explanation_cn": "指某人或某物所承担的角色或职能，尤其在官方或组织环境中。",
      "example_en": "In his capacity as chief financial officer, he approved the budget.",
      "example_cn": "他以首席财务官的身份批准了预算。"
    },
    {
      "pos": "noun",
      "explanation_en": "Potential or inherent ability to develop or achieve something in the future, often unfulfilled but possible.",
      "explanation_cn": "指未来可能发展或实现的潜在能力，虽尚未实现但具有可能性。",
      "example_en": "The child shows great capacities for leadership and creativity.",
      "example_cn": "这个孩子展现出巨大的领导力和创造力潜能。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ability",
      "analysis": "“Ability” (能力) 更侧重于个体完成某项具体任务的技能或天赋，通常指已具备的、可衡量的技能。而 “capacity” 范围更广，既可指潜在的、未开发的能力，也可指物理或系统的容纳极限，语义更丰富。"
    },
    {
      "word_to_compare": "capability",
      "analysis": "“Capability” (能力/功能) 常用于技术或组织语境，强调系统、设备或机构完成复杂任务的综合功能，偏正式和结构性。而 “capacity” 更常用于描述人或空间的容纳力，语义更贴近日常使用。两者在某些语境中可互换，但 “capability” 更强调‘可实现的性能’，而 “capacity” 更强调‘潜在或极限状态’。"
    },
    {
      "word_to_compare": "volume",
      "analysis": "“Volume” (体积/数量) 仅指物理空间或数量的大小，如液体、气体或物体的容积，是 “capacity” 的一个子集。而 “capacity” 不仅包含物理容量，还可用于抽象能力、职能角色等，语义范围远大于 “volume”。"
    },
    {
      "word_to_compare": "potential",
      "analysis": "“Potential” (潜力) 与 “capacity” 的第四层含义接近，都指未来可能发展的能力。但 “potential” 更强调尚未显现的可能性，常带主观期待；而 “capacity” 更中性，可指客观存在的容纳或执行范围，不一定隐含‘未来性’。"
    }
  ]
}