{
  "word": "capability",
  "pronunciation": "kay·puh·bil·uh·tee",
  "concise_definition": "n. 能力, 才能, 功能, 性能",
  "forms": {
    "plural": "capabilities"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The ability or power to do something, especially in terms of skill, knowledge, or physical capacity; often refers to inherent or acquired potential.",
      "explanation_cn": "指做某事的能力或力量，尤其指技能、知识或体力方面的素质；常指内在或后天获得的潜力。",
      "example_en": "Her leadership capability was evident in how she managed the crisis.",
      "example_cn": "她在应对危机时展现出的领导能力显而易见。"
    },
    {
      "pos": "noun",
      "explanation_en": "The functional capacity or performance of a system, machine, or technology to perform specific tasks or operations.",
      "explanation_cn": "指系统、机器或技术执行特定任务或操作的功能性能力或性能。",
      "example_en": "The new smartphone has advanced camera capabilities, including night mode and 8K video recording.",
      "example_cn": "这款新智能手机具备先进的摄像头功能，包括夜景模式和8K视频录制。"
    },
    {
      "pos": "noun",
      "explanation_en": "A specific area of competence or expertise, often used in organizational or strategic contexts to describe what an entity can achieve.",
      "explanation_cn": "指某一特定领域的专长或胜任力，常用于组织或战略语境中，描述一个实体能够实现的目标。",
      "example_en": "One of the company’s core capabilities is its ability to innovate rapidly in response to market demands.",
      "example_cn": "该公司的一项核心能力是能够迅速响应市场需求进行创新。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ability",
      "analysis": "“Ability” (能力) 更侧重于个人的天赋或掌握某项技能的主观能力，常用于描述人，语义范围较窄。而 “capability” 不仅可用于人，更常用于系统、组织或技术，强调客观的、可衡量的功能性或潜在能力，语义更广、更正式。"
    },
    {
      "word_to_compare": "capacity",
      "analysis": "“Capacity” (容量/潜能) 常指物理空间、数量或心理/生理上的最大承载量（如座位容量、记忆容量），也可指潜在能力，但更偏向于“上限”或“极限”。而 “capability” 更强调实际可执行的功能或任务完成度，而非最大极限。"
    },
    {
      "word_to_compare": "competence",
      "analysis": "“Competence” (胜任力) 强调符合标准或达到专业要求的水平，常用于评估是否“足够好”或“达标”。而 “capability” 更强调“能够做什么”，包含发展潜力和广度，不一定以标准为参照，更具前瞻性和战略性。"
    }
  ]
}