{
  "word": "capitalist",
  "pronunciation": "kap·uh·tuh·list",
  "concise_definition": "n. 资本家, 资本主义者; adj. 资本主义的",
  "forms": {
    "plural": "capitalists"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who owns or controls capital (money, property, or assets) and uses it to generate profit, typically by investing in businesses or production systems under a capitalist economic system.",
      "explanation_cn": "指拥有或控制资本（金钱、财产或资产）并利用其在资本主义经济体系中通过投资企业或生产系统来获取利润的人。",
      "example_en": "The wealthy capitalist invested millions in renewable energy startups.",
      "example_cn": "这位富有的资本家向可再生能源初创企业投资了数百万美元。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who strongly supports or advocates for capitalism as an economic and political system.",
      "explanation_cn": "指强烈支持或倡导资本主义作为经济和政治制度的人。",
      "example_en": "He identifies as a capitalist and believes free markets are the most efficient way to allocate resources.",
      "example_cn": "他自认为是资本主义者，相信自由市场是配置资源最有效的方式。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characterized by capitalism, especially the private ownership of the means of production and the pursuit of profit.",
      "explanation_cn": "与资本主义相关或由其特征所定义的，尤其指生产资料的私有制和对利润的追求。",
      "example_en": "The capitalist economy thrives on competition and innovation.",
      "example_cn": "资本主义经济依靠竞争与创新而繁荣。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bourgeois",
      "analysis": "“Bourgeois”（资产阶级的）原指中产阶级，后常带有社会批判色彩，强调其保守、物质主义和对传统秩序的维护。而 “capitalist” 更中性或经济导向，专指资本所有者或资本主义制度的支持者，不必然包含道德评判。"
    },
    {
      "word_to_compare": "entrepreneur",
      "analysis": "“Entrepreneur”（企业家）指主动创办和经营企业、承担风险以创造价值的人，强调创新与行动力。而 “capitalist” 更侧重于资本的所有权和收益，不一定亲自参与经营，可能仅通过投资获利。一个企业家可以是资本家，但资本家未必是企业家。"
    },
    {
      "word_to_compare": "millionaire",
      "analysis": "“Millionaire”（百万富翁）仅指财富达到百万级别的人，不涉及其财富来源或经济立场。一个人可以是百万富翁但反对资本主义（如靠继承或赌博致富），而 “capitalist” 则明确指向支持或参与资本主义经济体系的人。财富数量 ≠ 经济意识形态。"
    }
  ]
}