{
  "word": "capital",
  "pronunciation": "kap·i·tuhl",
  "concise_definition": "n. 首都, 资本, 大写字母; adj. 首都的, 资本的, 大写的",
  "forms": {
    "plural": "capitals"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The city that serves as the official seat of government for a country or region, where political institutions and leadership are centered.",
      "explanation_cn": "指一个国家或地区政府的正式所在地，政治机构和领导中心所在的城市。",
      "example_en": "Paris is the capital of France.",
      "example_cn": "巴黎是法国的首都。"
    },
    {
      "pos": "noun",
      "explanation_en": "Wealth or assets used to generate income or produce goods and services, especially in economic or business contexts.",
      "explanation_cn": "指用于产生收入或生产商品和服务的财富或资产，尤其在经济或商业语境中。",
      "example_en": "The startup raised millions in capital to expand its operations.",
      "example_cn": "这家初创公司筹集了数百万美元的资本以扩大业务。"
    },
    {
      "pos": "noun",
      "explanation_en": "An uppercase letter, as opposed to a lowercase letter, used at the beginning of sentences or proper nouns.",
      "explanation_cn": "指大写字母，与小写字母相对，通常用于句首或专有名词的开头。",
      "example_en": "The first letter of a sentence should always be a capital.",
      "example_cn": "句子的首字母必须是大写的。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to a capital city or its functions, often used to describe institutions or characteristics associated with the seat of government.",
      "explanation_cn": "与首都或其职能相关的，常用于描述与政府中心相关的机构或特征。",
      "example_en": "The capital city has the highest concentration of diplomatic missions.",
      "example_cn": "首都集中了最多的外交使团。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to capital in the economic sense, such as financial resources or investment.",
      "explanation_cn": "与经济意义上的资本相关的，如金融资源或投资。",
      "example_en": "The company's capital structure includes both equity and debt.",
      "example_cn": "该公司的资本结构包括股权和债务。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Written or printed in uppercase letters; used to describe text formatting.",
      "explanation_cn": "以大写字母书写的或印刷的，用于描述文本格式。",
      "example_en": "Please write your name in capital letters.",
      "example_cn": "请用大写字母写下你的名字。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "city",
      "analysis": "“City”（城市）是一个泛指的地理和行政单位，不特指政治中心。而 “capital” 是城市的一种特殊类型，专指国家或地区的政府所在地，具有政治和行政核心功能。"
    },
    {
      "word_to_compare": "fund",
      "analysis": "“Fund”（资金）通常指为特定目的而设立的金钱集合，如慈善基金或教育基金，强调用途和来源。而 “capital” 更广泛，指可用于生产或投资的全部资产（包括货币、设备、房产等），是经济体系中的生产要素。"
    },
    {
      "word_to_compare": "uppercase",
      "analysis": "“Uppercase”（大写）是纯粹的排版术语，仅描述字母的形态，不涉及语义。而 “capital” 作为形容词时，虽然也指大写字母，但其词义更丰富，可延伸至政治、经济等多重语境，是兼具形式与功能的多义词。"
    }
  ]
}