{
  "word": "capture",
  "pronunciation": "kap·chur",
  "concise_definition": "v. 捕获, 捉住, 夺取, 捕捉; n. 捕获, 捕获物",
  "forms": {
    "third_person_singular": "captures",
    "past_tense": "captured",
    "past_participle": "captured",
    "present_participle": "capturing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To take someone or something into custody or control, often by force or through strategic means.",
      "explanation_cn": "指通过武力或策略手段将某人或某物控制或拘捕，使其处于自己的掌握之中。",
      "example_en": "The police captured the suspect after a high-speed chase.",
      "example_cn": "警方在高速追捕后抓获了嫌疑人。"
    },
    {
      "pos": "verb",
      "explanation_en": "To record or preserve something, especially an image, sound, or moment, using technology or art.",
      "explanation_cn": "指利用技术或艺术手段记录或保存某种图像、声音或瞬间。",
      "example_en": "The photographer captured the perfect sunset with her camera.",
      "example_cn": "摄影师用相机捕捉到了完美的日落景象。"
    },
    {
      "pos": "verb",
      "explanation_en": "To attract and hold someone's attention, interest, or imagination, often through compelling qualities.",
      "explanation_cn": "指通过引人入胜的特质吸引并牢牢抓住某人的注意力、兴趣或想象力。",
      "example_en": "The movie's emotional storyline captured the hearts of audiences worldwide.",
      "example_cn": "这部电影感人的情节俘获了全球观众的心。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of capturing someone or something, or the thing that has been captured.",
      "explanation_cn": "指捕获某人或某物的行为，或被捕获的对象。",
      "example_en": "The capture of the enemy leader was a major victory for the army.",
      "example_cn": "俘获敌方首领是军队的一次重大胜利。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "catch",
      "analysis": "“Catch” (抓住) 更常用于日常语境，强调快速、突然的动作，如 catching a ball 或 catching a cold。它通常不涉及长期控制或战略行为，而 “capture” 更正式，常用于军事、法律或技术语境，强调彻底的控制或占有。"
    },
    {
      "word_to_compare": "seize",
      "analysis": "“Seize” (夺取) 强调突然、有力且通常带有侵略性的行动，常用于政治或暴力场景，如 seize power 或 seize property。它比 “capture” 更具强制性和紧迫感，而 “capture” 可以是计划性的，不一定伴随暴力。"
    },
    {
      "word_to_compare": "record",
      "analysis": "“Record” (记录) 仅指保存信息（如声音、影像、数据），是中性技术行为，不包含控制或占有含义。而 “capture” 在用于影像时，不仅指记录，还隐含了‘成功获取某个珍贵或难以获得的瞬间’的意味，带有主观选择和情感价值。"
    }
  ]
}