{
  "word": "capturing",
  "pronunciation": "kap·cher·ing",
  "concise_definition": "v. 捕获, 捕捉, 吸引, 记录",
  "forms": {
    "base_form": "capture",
    "third_person_singular": "captures",
    "past_tense": "captured",
    "past_participle": "captured",
    "present_participle": "capturing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To take possession of or seize someone or something, often by force or strategy, especially in a military, legal, or competitive context.",
      "explanation_cn": "指通过武力、策略或手段夺取或控制某人或某物，常用于军事、法律或竞争情境中。",
      "example_en": "The army succeeded in capturing the enemy stronghold after a three-day battle.",
      "example_cn": "经过三天的战斗，军队成功俘获了敌方的要塞。"
    },
    {
      "pos": "verb",
      "explanation_en": "To attract and hold someone's attention, interest, or imagination, often through beauty, emotion, or novelty.",
      "explanation_cn": "指通过美感、情感或新奇感吸引并牢牢抓住某人的注意力、兴趣或想象力。",
      "example_en": "The photograph's vibrant colors and emotional depth were truly capturing.",
      "example_cn": "这张照片鲜艳的色彩和深刻的情感真正地抓住了人心。"
    },
    {
      "pos": "verb",
      "explanation_en": "To record or preserve a moment, sound, image, or feeling accurately, especially through technology such as photography, video, or audio.",
      "explanation_cn": "指通过摄影、录像或录音等技术准确地记录或保存一个瞬间、声音、图像或情感。",
      "example_en": "The documentary is capturing the daily lives of people in remote villages.",
      "example_cn": "这部纪录片正在记录偏远村庄人们的日常生活。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "catching",
      "analysis": "“Catching” (捕捉) 更常用于物理上的快速抓取或意外获得（如 catching a ball 或 catching a cold），语气更口语化、动作更短暂。而 “capturing” 更强调有意识、有策略地控制或记录，适用范围更广，尤其在抽象意义（如吸引注意力、记录影像）上更正式和深刻。"
    },
    {
      "word_to_compare": "recording",
      "analysis": "“Recording” (记录) 专指通过设备保存信息（声音、影像、数据），强调技术过程和客观存档。而 “capturing” 不仅包含记录，还隐含了对情感、氛围或本质的生动呈现，具有更强的主观性和艺术性。例如，一张照片可以是 recording（单纯存档），也可以是 capturing（传达情绪）。"
    },
    {
      "word_to_compare": "seizing",
      "analysis": "“Seizing” (夺取) 强调突然、猛烈、有时是非法的占有行为，常带有紧迫感或暴力色彩（如 seizing power）。而 “capturing” 虽然也含夺取之意，但更常用于合法、战略或长期的过程，且可延伸至非物理领域（如 capturing market share 或 capturing a moment）。"
    }
  ]
}