{
  "word": "captures",
  "pronunciation": "kap·cherz",
  "concise_definition": "v. 捕获, 捕捉, 吸引, 拍摄",
  "forms": {
    "base_form": "capture",
    "third_person_singular": "captures",
    "past_tense": "captured",
    "past_participle": "captured",
    "present_participle": "capturing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To take hold of or seize someone or something, often by force or skill, especially in a physical or military context.",
      "explanation_cn": "指通过武力或技巧抓住或俘获某人或某物，常用于物理或军事语境。",
      "example_en": "The soldiers captured the enemy outpost after a fierce battle.",
      "example_cn": "士兵们在一场激烈战斗后俘获了敌方前哨站。"
    },
    {
      "pos": "verb",
      "explanation_en": "To record or preserve a moment, feeling, or image, especially through photography, film, or writing.",
      "explanation_cn": "指通过摄影、电影或文字记录或保存某一时刻、情感或画面。",
      "example_en": "The photograph captures the joy on her face as she opened the gift.",
      "example_cn": "这张照片捕捉到了她打开礼物时脸上的喜悦。"
    },
    {
      "pos": "verb",
      "explanation_en": "To attract and hold someone's attention, interest, or imagination, often through beauty, drama, or novelty.",
      "explanation_cn": "指通过美感、戏剧性或新奇感吸引并牢牢抓住某人的注意力、兴趣或想象力。",
      "example_en": "The film's stunning visuals capture the audience from the very first scene.",
      "example_cn": "这部电影令人惊叹的视觉效果从第一个场景就抓住了观众。"
    },
    {
      "pos": "verb",
      "explanation_en": "To obtain or secure something abstract, such as data, a market share, or a percentage, often through effort or strategy.",
      "explanation_cn": "指通过努力或策略获得某种抽象事物，如数据、市场份额或百分比。",
      "example_en": "The company captured 30% of the smartphone market last year.",
      "example_cn": "该公司去年占据了智能手机市场30%的份额。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "catch",
      "analysis": "“Catch” (抓住) 更常用于日常语境，强调动作的突然性或即时性，如 catching a ball 或 catching a cold。而 “capture” 更正式，常带有策略性、长期性或控制性的含义，如 capture an enemy 或 capture attention。"
    },
    {
      "word_to_compare": "photograph",
      "analysis": "“Photograph” (拍照) 是一个具体的动作，指使用相机记录图像。而 “capture” 在此语境中更抽象，不仅指技术上的拍摄，更强调成功地保留了情感、氛围或本质，如 capture the spirit of the event。"
    },
    {
      "word_to_compare": "seize",
      "analysis": "“Seize” (夺取) 强调突然、猛烈的物理夺取，常带有暴力或紧急色彩，如 seize a weapon。而 “capture” 虽也可用于武力，但更常用于成功控制或占有后的结果状态，且可延伸至抽象领域，如 capture data 或 capture interest，这是 “seize” 所不具备的。"
    }
  ]
}