{
  "word": "captain",
  "pronunciation": "kap·tuhn",
  "concise_definition": "n. 船长, 队长, 上尉; v. 担任队长, 指挥",
  "forms": {
    "plural": "captains",
    "third_person_singular": "captains",
    "past_tense": "captained",
    "past_participle": "captained",
    "present_participle": "captaining"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The person in command of a ship, aircraft, or other vehicle, responsible for its safe operation and the welfare of its crew and passengers.",
      "explanation_cn": "指负责船舶、飞机或其他载具的安全运行及其船员和乘客福祉的指挥者。",
      "example_en": "The captain ordered the crew to abandon ship as the hull began to sink.",
      "example_cn": "当船体开始下沉时，船长命令船员弃船。"
    },
    {
      "pos": "noun",
      "explanation_en": "The leader of a sports team, who often serves as the primary representative and motivator for the team on and off the field.",
      "explanation_cn": "指体育团队的领导者，通常在场上和场下代表并激励整个团队。",
      "example_en": "As captain of the soccer team, she led by example and never missed a practice.",
      "example_cn": "作为足球队队长，她以身作则，从未缺席一次训练。"
    },
    {
      "pos": "noun",
      "explanation_en": "A military officer ranking above a major and below a major general, typically commanding a company in the army or a similar unit in other branches.",
      "explanation_cn": "指军衔高于少校、低于少将的军官，通常在陆军中指挥一个连队，或在其他军种中指挥类似单位。",
      "example_en": "The captain received a medal for bravery during the mission.",
      "example_cn": "这位上尉因在任务中表现出英勇而获得勋章。"
    },
    {
      "pos": "verb",
      "explanation_en": "To serve as the leader or commander of a group, especially in a sports or organizational context.",
      "explanation_cn": "指担任某个团体的领导者或指挥者，尤指在体育或组织环境中。",
      "example_en": "He captained the national team to victory in the championship.",
      "example_cn": "他率领国家队赢得了锦标赛冠军。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "leader",
      "analysis": "“Leader” (领导者) 是一个更广泛、更通用的词，适用于任何领域中的引导者，不特指有正式职位的人。而 “captain” 通常指在特定组织（如军队、球队、船只）中拥有正式指挥权的领导者，具有更强的制度性和角色限定。"
    },
    {
      "word_to_compare": "commander",
      "analysis": "“Commander” (指挥官) 与 “captain” 在军事语境中常有重叠，但 “commander” 可指更高层级的指挥者（如战区指挥官），而 “captain” 通常是中层指挥官。在非军事语境中，“commander” 较少用于体育或民用场景，而 “captain” 更常见。"
    },
    {
      "word_to_compare": "chief",
      "analysis": "“Chief” (首领/主管) 强调在组织或部落中的最高权威，常用于行政、部落或技术语境（如首席执行官、首席工程师）。它不必然包含直接的现场指挥功能，而 “captain” 更强调在行动中实时领导和决策，尤其在动态环境中（如航行、比赛）。"
    }
  ]
}