{
  "word": "caravan",
  "pronunciation": "kə·rav·ən",
  "concise_definition": "n. 大篷车, 商队, 旅行团; v. 乘大篷车旅行",
  "forms": {
    "plural": "caravans"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A vehicle with wheels and a covered body, designed for living or traveling in, often used for recreational purposes or as temporary housing.",
      "explanation_cn": "一种带轮子、有遮盖车厢的车辆，专为居住或旅行设计，常用于休闲用途或作为临时住所。",
      "example_en": "They spent the summer traveling across Europe in a vintage caravan.",
      "example_cn": "他们整个夏天都乘坐一辆复古的大篷车穿越欧洲。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of travelers, especially merchants or pilgrims, journeying together across deserts or remote areas, often with pack animals.",
      "explanation_cn": "一群结伴同行的旅行者，尤指穿越沙漠或偏远地区的商人或朝圣者，通常伴有驮畜。",
      "example_en": "The ancient Silk Road was once lined with caravans carrying silk, spices, and gold.",
      "example_cn": "古代丝绸之路曾遍布运送丝绸、香料和黄金的商队。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of people traveling together for a common purpose, such as a touring group or a migration of people.",
      "explanation_cn": "一群为共同目的而结伴旅行的人，例如巡回演出团体或迁徙人群。",
      "example_en": "A caravan of refugees crossed the border seeking safety and shelter.",
      "example_cn": "一群难民结队穿越边境，寻求安全与庇护。"
    },
    {
      "pos": "verb",
      "explanation_en": "To travel in a caravan, especially in a group using mobile homes or vehicles for accommodation.",
      "explanation_cn": "以大篷车或移动住所组成队伍进行旅行。",
      "example_en": "Every summer, they caravan to the mountains to escape the city heat.",
      "example_cn": "每年夏天，他们都乘大篷车前往山区避暑。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "motorhome",
      "analysis": "“Motorhome”（房车）特指自带发动机、可自行驾驶的居住型车辆，强调机动性和现代设施；而 “caravan” 通常指需由其他车辆牵引的拖车式住所，更传统、更侧重于旅行或迁移的集体性。"
    },
    {
      "word_to_compare": "convoy",
      "analysis": "“Convoy”（车队）指一组受保护或有组织的车辆（通常是军用或运输车辆）为安全或效率而集体行进，强调护送与军事/物流目的；而 “caravan” 更强调旅行者之间的协作与生活方式，常具文化或历史色彩。"
    },
    {
      "word_to_compare": "procession",
      "analysis": "“Procession”（游行队伍）指有仪式性、顺序性行进的群体，如婚礼、葬礼或宗教游行，强调形式与象征意义；而 “caravan” 更注重实际移动与生存功能，不具仪式性，更偏向实用主义的集体迁徙。"
    }
  ]
}