{
  "word": "carbonate",
  "pronunciation": "kahr·bon·ayt",
  "concise_definition": "n. 碳酸盐; v. 使碳酸化, 使含碳酸盐",
  "forms": {
    "third_person_singular": "carbonates",
    "past_tense": "carbonated",
    "past_participle": "carbonated",
    "present_participle": "carbonating",
    "noun_plural": "carbonates"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A chemical compound containing the carbonate ion (CO₃²⁻), typically formed when carbon dioxide reacts with a base or metal oxide; commonly found in minerals like limestone and in biological systems such as shells and bones.",
      "explanation_cn": "指含有碳酸根离子（CO₃²⁻）的化合物，通常由二氧化碳与碱或金属氧化物反应生成；常见于石灰石等矿物以及贝壳、骨骼等生物系统中。",
      "example_en": "Calcium carbonate is the main component of chalk and seashells.",
      "example_cn": "碳酸钙是粉笔和贝壳的主要成分。"
    },
    {
      "pos": "noun",
      "explanation_en": "A carbonated beverage, especially in informal usage, referring to a drink infused with carbon dioxide to produce fizz.",
      "explanation_cn": "（非正式用法）指碳酸饮料，即通过注入二氧化碳产生气泡的饮品。",
      "example_en": "He ordered a soda, but the waiter asked if he wanted a carbonate instead.",
      "example_cn": "他点了一杯苏打水，但服务员问他是否想要一杯碳酸饮料。"
    },
    {
      "pos": "verb",
      "explanation_en": "To treat a substance with carbon dioxide to form carbonates or to dissolve CO₂ into a liquid, especially to make it fizzy.",
      "explanation_cn": "指用二氧化碳处理某物质以形成碳酸盐，或将二氧化碳溶解于液体中，尤指使其产生气泡。",
      "example_en": "The water is carbonated before being bottled to give it a refreshing sparkle.",
      "example_cn": "水在装瓶前经过碳酸化处理，以赋予其清爽的气泡感。"
    },
    {
      "pos": "verb",
      "explanation_en": "To convert a substance into a carbonate or to incorporate carbonate ions into a material, often in geological or industrial processes.",
      "explanation_cn": "指在地质或工业过程中将某种物质转化为碳酸盐，或将碳酸根离子引入材料中。",
      "example_en": "Over millions of years, atmospheric CO₂ can carbonate rock formations through slow chemical reactions.",
      "example_cn": "数百万年来，大气中的二氧化碳可通过缓慢的化学反应使岩石碳酸化。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bicarbonate",
      "analysis": "“Bicarbonate”（碳酸氢盐）是碳酸盐的酸式盐，化学式为 HCO₃⁻，而 “carbonate” 指的是正盐 CO₃²⁻。两者都参与酸碱缓冲系统，但 bicarbonate 更常见于人体血液中，而 carbonate 多见于矿物和工业应用中。"
    },
    {
      "word_to_compare": "carbonation",
      "analysis": "“Carbonation” 是名词，指碳酸化的过程或状态，而 “carbonate” 作为动词时强调动作本身（使碳酸化），作为名词时则指具体的化合物或饮料。例如：carbonation 是气泡的产生，carbonate 是产生气泡所用的化学物质或最终产物。"
    },
    {
      "word_to_compare": "mineral",
      "analysis": "“Mineral”（矿物）是一个更广泛的类别，包括所有天然无机固体物质，而 “carbonate” 是矿物的一种化学分类（碳酸盐矿物），如方解石、白云石。并非所有矿物都是碳酸盐，但所有碳酸盐矿物都属于矿物范畴。"
    }
  ]
}