{
  "word": "carbon",
  "pronunciation": "kahr·buhn",
  "concise_definition": "n. 碳, 碳元素, 碳化合物",
  "forms": {
    "plural": "carbons"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A chemical element with the symbol C and atomic number 6, essential to all known life forms and a key component of organic compounds, fossil fuels, and the Earth's carbon cycle.",
      "explanation_cn": "一种化学元素，符号为 C，原子序数为 6，是所有已知生命形式的基础，也是有机化合物、化石燃料和地球碳循环的关键组成部分。",
      "example_en": "Carbon is the backbone of all organic molecules, including DNA and proteins.",
      "example_cn": "碳是所有有机分子（包括 DNA 和蛋白质）的骨架。"
    },
    {
      "pos": "noun",
      "explanation_en": "A form of pure carbon, such as charcoal, graphite, or diamond, often used in industrial or artistic applications.",
      "explanation_cn": "指纯碳的某种形态，如木炭、石墨或钻石，常用于工业或艺术领域。",
      "example_en": "The artist used carbon pencils to create deep, rich shading in the sketch.",
      "example_cn": "艺术家使用碳素铅笔在素描中营造出深邃丰富的阴影效果。"
    },
    {
      "pos": "noun",
      "explanation_en": "A unit of measurement for greenhouse gas emissions, often used in environmental contexts to quantify the amount of carbon dioxide or equivalent gases released.",
      "explanation_cn": "在环境语境中，用于量化二氧化碳或其他等效温室气体排放量的计量单位，常指‘碳排放’。",
      "example_en": "The company pledged to reduce its carbon footprint by 50% over the next decade.",
      "example_cn": "该公司承诺在未来十年内将其碳足迹减少 50%。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "coal",
      "analysis": "“Coal” (煤) 是一种具体的化石燃料，主要由碳组成，但还含有杂质如硫和矿物质。它是碳的一种来源，但不是碳元素本身。而 “carbon” 是化学元素，可以以多种形式存在（如石墨、二氧化碳），不限于煤。"
    },
    {
      "word_to_compare": "carbon dioxide",
      "analysis": "“Carbon dioxide” (二氧化碳) 是一种由碳和氧组成的化合物，是碳循环中的重要气体。它包含碳元素，但本身不是碳。而 “carbon” 可以指元素、单质或排放量，范围更广。在环保语境中，人们常说 “carbon emissions”，实际指的是 “carbon dioxide emissions”，但术语上常简化为 carbon。"
    },
    {
      "word_to_compare": "charcoal",
      "analysis": "“Charcoal” (木炭) 是碳的一种具体物理形态，由木材不完全燃烧制成，常用于烧烤或绘画。它是碳的载体，但仅限于特定用途和形态。而 “carbon” 是更抽象、更基础的化学概念，涵盖所有含碳物质和形式。"
    }
  ]
}