{
  "word": "caretaker",
  "pronunciation": "kair·tay·kər",
  "concise_definition": "n. 看护人, 管理人, 临时负责人",
  "forms": {
    "plural": "caretakers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who is responsible for looking after a person, place, or thing, especially in the absence of the usual owner or manager; often implies a temporary or custodial role.",
      "explanation_cn": "指在通常的拥有者或管理者缺席时，负责照看某人、某地或某物的人；通常暗示一种临时性或监护性的职责。",
      "example_en": "The caretaker of the old mansion checks the heating system and ensures no trespassers enter.",
      "example_cn": "这座老宅的看护人负责检查供暖系统，并确保没有闲杂人员进入。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who provides physical or emotional care for someone who is ill, elderly, or disabled, often in a non-professional or informal capacity.",
      "explanation_cn": "指为病人、老年人或残障人士提供身体或情感照护的人，通常是非专业或非正式的照护者。",
      "example_en": "After her mother’s stroke, she became her primary caretaker, helping with meals, bathing, and medication.",
      "example_cn": "母亲中风后，她成为主要的看护人，负责协助饮食、洗浴和服药。"
    },
    {
      "pos": "noun",
      "explanation_en": "In politics, a person or group temporarily holding power or managing affairs during a transition period, such as between elected leaders.",
      "explanation_cn": "在政治语境中，指在权力交接期间（如两位民选领导人之间）临时掌权或管理事务的人或团体。",
      "example_en": "The prime minister resigned, and a caretaker government was appointed until the next election.",
      "example_cn": "总理辞职后，任命了一个临时政府，直至下一次选举。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "guardian",
      "analysis": "“Guardian”（监护人）通常具有法律或道德上的正式责任，尤其用于保护未成年人或无行为能力者，强调法律权威和长期义务。而 “caretaker” 更侧重于日常照料或临时管理，不一定涉及法律身份。"
    },
    {
      "word_to_compare": "custodian",
      "analysis": "“Custodian”（保管人）多用于管理财产、建筑或物品，强调对物的保管和维护，常用于机构或公共设施场景（如博物馆保管员）。而 “caretaker” 可以涵盖人、物或场所，语义更广，且常带有情感或生活照料的意味。"
    },
    {
      "word_to_compare": "nurse",
      "analysis": "“Nurse”（护士）是经过专业训练、持有执照的医疗人员，其职责聚焦于医学护理和临床操作。而 “caretaker” 可以是亲属或非专业人员，提供的是生活辅助性照护，不涉及医疗诊断或治疗。"
    }
  ]
}