{
  "word": "carlton",
  "pronunciation": "kahrl·tuhn",
  "concise_definition": "n. 卡尔顿（专有名词，常用于地名、品牌名或人名）",
  "forms": {
    "plural": "carltons"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A proper noun commonly used as a place name, such as Carlton, a suburb of Melbourne, Australia, or Carlton, a district in London, England. It may also refer to historic hotels, buildings, or institutions bearing the name.",
      "explanation_cn": "一个专有名词，常用于地名，如澳大利亚墨尔本的卡尔顿郊区，或英国伦敦的卡尔顿区；也可指以该名称命名的历史酒店、建筑或机构。",
      "example_en": "We stayed at the Carlton Hotel, a luxury establishment near Hyde Park.",
      "example_cn": "我们住在卡尔顿酒店，这是一家位于海德公园附近的豪华酒店。"
    },
    {
      "pos": "noun",
      "explanation_en": "A surname or given name, often of English origin, derived from a place name meaning 'settlement by a fortified hill' (from Old English 'ceorl' + 'tūn').",
      "explanation_cn": "一个姓氏或名字，通常源于英语，由地名演变而来，意为‘位于堡垒山丘旁的聚居地’（源自古英语 'ceorl' + 'tūn'）。",
      "example_en": "Carlton Fisk, the famous baseball player, was known for his powerful home runs.",
      "example_cn": "著名棒球运动员卡尔顿·菲斯克以强劲的本垒打闻名。"
    },
    {
      "pos": "noun",
      "explanation_en": "A brand name used for various products, such as Carlton cigarettes, a former British cigarette brand, or Carlton & United Breweries, an Australian beer company.",
      "explanation_cn": "用作多种产品的品牌名称，例如卡尔顿香烟（一种已停售的英国香烟品牌），或卡尔顿与联合酿酒公司（一家澳大利亚啤酒公司）。",
      "example_en": "In the 1980s, Carlton cigarettes were widely advertised in the UK.",
      "example_cn": "20世纪80年代，卡尔顿香烟在英国广泛做广告。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "charleston",
      "analysis": "“Charleston”（查尔斯顿）是另一个地名或舞蹈名称，源自美国南卡罗来纳州的城市，与“Carlton”在语源和文化背景上无关联。两者均为专有名词，但“Carlton”多与英国及英联邦地区相关，而“Charleston”则与美国南部及20世纪初的舞蹈文化紧密相连。"
    },
    {
      "word_to_compare": "carnegie",
      "analysis": "“Carnegie”（卡内基）是著名的姓氏，常与慈善家安德鲁·卡内基及其基金会相关，多用于机构命名（如卡内基音乐厅）。与“Carlton”不同，“Carnegie”具有明确的个人历史和慈善遗产，而“Carlton”主要作为地理或商业标识，缺乏个人传记关联。"
    },
    {
      "word_to_compare": "clifton",
      "analysis": "“Clifton”（克利夫顿）与“Carlton”同为英语地名姓氏，均以“-ton”结尾，意为“聚居地”，但“Clifton”源自“cliff”（悬崖），意为“悬崖边的聚居地”，而“Carlton”源自“ceorl”（自由农）+“tūn”，意为“农民的聚居地”。两者地理语义不同，但结构相似。"
    }
  ]
}