{
  "word": "carnegie",
  "pronunciation": "kahr·nuh·gee",
  "concise_definition": "n. 卡内基（姓氏），常指安德鲁·卡内基；adj. 卡内基的",
  "forms": {
    "proper_noun": true
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to Andrew Carnegie (1835–1919), a Scottish-American industrialist and philanthropist who became one of the richest men in history through the steel industry and later donated vast sums to education, libraries, and peace initiatives.",
      "explanation_cn": "专有名词，指安德鲁·卡内基（1835–1919），苏格兰裔美国实业家与慈善家，通过钢铁工业成为历史上最富有的人之一，后将巨额财富捐赠给教育、图书馆和和平事业。",
      "example_en": "The Carnegie Library in Pittsburgh was funded by Andrew Carnegie to provide free access to books for the public.",
      "example_cn": "匹兹堡的卡内基图书馆由安德鲁·卡内基资助建立，向公众免费提供图书。"
    },
    {
      "pos": "noun",
      "explanation_en": "A proper noun used in the names of institutions, foundations, or awards established by or named in honor of Andrew Carnegie, such as Carnegie Mellon University or the Carnegie Endowment for International Peace.",
      "explanation_cn": "用于以安德鲁·卡内基命名或由其创立的机构、基金会或奖项的名称中，如卡内基梅隆大学或卡内基国际和平基金会。",
      "example_en": "She received the Carnegie Medal for her outstanding contribution to children's literature.",
      "example_cn": "她因在儿童文学领域的杰出贡献而获得卡内基奖章。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or associated with Andrew Carnegie or the institutions he founded.",
      "explanation_cn": "与安德鲁·卡内基或其创立的机构相关的。",
      "example_en": "The Carnegie Hall concert featured world-renowned orchestras.",
      "example_cn": "卡内基音乐厅的音乐会汇聚了世界知名的乐团。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rockefeller",
      "analysis": "“Rockefeller”（洛克菲勒）是另一位美国工业巨头与慈善家（标准石油公司创始人）的姓氏，常与“Carnegie”并列作为19世纪末美国‘强盗大亨’的代表。两者都通过垄断行业积累巨额财富并投身慈善，但卡内基更强调‘财富的道德责任’，其慈善重点在教育与公共图书馆，而洛克菲勒则侧重医学研究与高等教育。"
    },
    {
      "word_to_compare": "ford",
      "analysis": "“Ford”（福特）指亨利·福特，汽车工业的革新者，其影响力主要在大规模生产与消费经济，而非慈善体系的制度化建设。卡内基的遗产体现在机构与奖项的持续运作，而福特的遗产更多体现在技术与生产模式上。"
    },
    {
      "word_to_compare": "vanderbilt",
      "analysis": "“Vanderbilt”（范德比尔特）是另一位铁路与航运大亨的姓氏，其家族财富主要用于建造豪宅与大学捐赠（如范德比尔特大学），但其慈善行为缺乏卡内基那样系统性的哲学支撑（如《财富的福音》），也未形成广泛传播的命名体系。"
    }
  ]
}