{
  "word": "carousel",
  "pronunciation": "kar·uh·sel",
  "concise_definition": "n. 旋转木马, 旋转展示台, 循环播放列表",
  "forms": {
    "plural": "carousels"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A rotating platform with seats or animals, typically found in amusement parks, on which riders sit and are carried in a circular motion for entertainment.",
      "explanation_cn": "一种旋转平台，通常安装在游乐园中，上面设有座椅或动物造型，乘客乘坐其上做圆周运动以供娱乐。",
      "example_en": "The children laughed as they rode the colorful carousel at the fair.",
      "example_cn": "孩子们在游园会上乘坐五彩缤纷的旋转木马，笑声不断。"
    },
    {
      "pos": "noun",
      "explanation_en": "A mechanical or digital device that rotates to display a series of items, such as images, products, or slides, often used in advertising or web design.",
      "explanation_cn": "一种机械或数字装置，通过旋转方式依次展示一系列物品，如图片、产品或幻灯片，常用于广告或网页设计中。",
      "example_en": "The homepage features a carousel of promotional banners that change every few seconds.",
      "example_cn": "主页上有一个轮播图，每隔几秒就会自动切换促销横幅。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sequence of events, people, or items that appear in a recurring, often rapid, cycle, metaphorically suggesting continuous rotation or turnover.",
      "explanation_cn": "指一系列事件、人物或物品以循环、频繁的方式反复出现，隐喻性地暗示持续的轮换或更替。",
      "example_en": "The political carousel continues as new ministers are appointed every few months.",
      "example_cn": "政治轮替持续不断，每隔几个月就有新部长上任。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "merry-go-round",
      "analysis": "“Merry-go-round” 是 “carousel” 的口语化同义词，专指游乐园中的旋转木马，带有浓厚的童年和娱乐色彩。而 “carousel” 语义更广，可延伸至数字界面或抽象的循环现象，适用范围更正式和多样。"
    },
    {
      "word_to_compare": "slideshow",
      "analysis": "“Slideshow” (幻灯片播放) 是一种线性、顺序播放图像或内容的方式，通常由用户手动或定时切换，强调内容的逐项呈现。而 “carousel” 强调旋转、循环的动态特性，常自动轮播且可能包含交互式导航，视觉上更具动感和连续性。"
    },
    {
      "word_to_compare": "revolving door",
      "analysis": "“Revolving door” (旋转门) 通常指物理上的建筑入口装置，或隐喻性地形容职位、人员的频繁更替，带有负面或批评意味（如官僚机构的高流动率）。而 “carousel” 在比喻用法中更中性甚至积极，强调节奏感和循环性，不必然暗示问题或混乱。"
    }
  ]
}