{
  "word": "carpet",
  "pronunciation": "kahr·piht",
  "concise_definition": "n. 地毯, 地板覆盖物; v. 铺地毯, 覆盖",
  "forms": {
    "plural": "carpets"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A thick, woven or tufted fabric used to cover floors, typically made of wool, nylon, or other synthetic fibers, and often decorative or insulating.",
      "explanation_cn": "一种厚实的编织或簇绒织物，用于覆盖地板，通常由羊毛、尼龙或其他合成纤维制成，常具有装饰性或保温功能。",
      "example_en": "The living room was adorned with a richly patterned Persian carpet.",
      "example_cn": "客厅铺着一块图案精美的波斯地毯。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large quantity or continuous layer of something covering a surface, often used metaphorically to describe dense coverage.",
      "explanation_cn": "指大量或连续覆盖在表面上的物体，常用于比喻形容密集的覆盖状态。",
      "example_en": "A carpet of wildflowers blanketed the meadow in spring.",
      "example_cn": "春天，野花如地毯般铺满了草地。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover a floor with carpeting; to lay down a surface layer of material over an area.",
      "explanation_cn": "指在地板上铺设地毯；也泛指在某个区域铺设一层材料。",
      "example_en": "They decided to carpet the entire upstairs to reduce noise.",
      "example_cn": "他们决定把整个楼上都铺上地毯以减少噪音。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover something densely or thoroughly, often in a figurative sense, such as overwhelming with a large number of items or actions.",
      "explanation_cn": "比喻性地指以大量事物或行动彻底覆盖或淹没某物，常含‘密集轰炸’之意。",
      "example_en": "The protesters were carpeted with tear gas as they marched toward the building.",
      "example_cn": "抗议者向大楼前进时，被催泪瓦斯密集覆盖。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rug",
      "analysis": "“Rug”（小地毯）通常指较小、不固定于地面的地毯，常用于局部装饰，可移动；而 “carpet” 一般指覆盖整个地面、固定铺设的大型地板材料，更强调功能性与整体性。"
    },
    {
      "word_to_compare": "mat",
      "analysis": "“Mat”（垫子）通常更薄、更小，用于特定功能如吸水、防滑或入口处清洁鞋底，不具备地毯的保暖或装饰性；而 “carpet” 更厚实、覆盖面积更大，兼具美观与实用。"
    },
    {
      "word_to_compare": "cover",
      "analysis": "“Cover”（覆盖）是通用动词，泛指任何遮盖行为，不特指材料类型；而 “carpet” 作为动词时，特指用地毯或类似密集材料进行覆盖，具有明确的物质形态和语义范围，常用于比喻性密集覆盖的语境。"
    }
  ]
}