{
  "word": "carrier",
  "pronunciation": "kar·ee·er",
  "concise_definition": "n. 运输者, 承运人, 携带者, 航空母舰",
  "forms": {
    "plural": "carriers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person, company, or organization that transports goods or passengers from one place to another, especially as a business.",
      "explanation_cn": "指以运输货物或乘客为业的个人、公司或组织，尤指从事物流或交通服务的实体。",
      "example_en": "The package was delivered by a reliable courier carrier.",
      "example_cn": "这个包裹由一家可靠的快递承运公司送达。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or organism that carries and transmits a disease, pathogen, or genetic trait without necessarily showing symptoms themselves.",
      "explanation_cn": "指携带并传播疾病、病原体或遗传特征的人或生物，自身可能并不表现出症状。",
      "example_en": "She is a carrier of the sickle cell gene but has never developed the disease.",
      "example_cn": "她是镰状细胞基因的携带者，但从未发病。"
    },
    {
      "pos": "noun",
      "explanation_en": "A ship designed to carry and deploy aircraft, especially a large warship equipped with an aircraft flight deck and hangar facilities.",
      "explanation_cn": "指专门用于搭载和部署飞机的舰船，尤指配备飞行甲板和机库的大型军舰，即航空母舰。",
      "example_en": "The aircraft carrier sailed into the Pacific to join the naval exercise.",
      "example_cn": "这艘航空母舰驶入太平洋，参加海军演习。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device or structure that supports, holds, or conveys something else, such as a phone carrier, a circuit carrier, or a carrier pigeon.",
      "explanation_cn": "指用于支撑、承载或传递其他事物的装置或结构，如电话运营商、电路载体或信鸽。",
      "example_en": "The company is one of the largest mobile phone carriers in the country.",
      "example_cn": "这家公司是该国最大的移动电话运营商之一。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "transporter",
      "analysis": "“Transporter”（运输者）更侧重于物理运输的动作或工具，常用于指具体的运输设备（如卡车、火车）或人员，语义范围较窄。而 “carrier” 语义更广，可涵盖运输服务、生物携带、通信服务和军事舰船等多种含义，更具抽象性和多义性。"
    },
    {
      "word_to_compare": "bearer",
      "analysis": "“Bearer”（持有者）强调某物被某人持有或携带，常用于票据（如持票人）、抽象概念（如痛苦的承载者）或象征性语境。它不强调运输过程，而 “carrier” 更强调主动传递或输送的功能，尤其在物流和通信领域。"
    },
    {
      "word_to_compare": "vessel",
      "analysis": "“Vessel”（船只/容器）泛指任何用于装载或运输的容器或船舶，语义偏重物理形态。而 “carrier” 在指舰船时特指航空母舰，具有军事功能和专用设计，语义更专业、更具体。在非军事语境中，“vessel” 通常不用于指代运输公司或通信运营商。"
    }
  ]
}