{
  "word": "carriers",
  "pronunciation": "kair·ee·erz",
  "concise_definition": "n. 运输者, 承运人, 携带者, 信使",
  "forms": {
    "singular": "carrier"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person, company, or vehicle that transports goods, passengers, or mail from one place to another.",
      "explanation_cn": "指运输货物、乘客或邮件的个人、公司或交通工具。",
      "example_en": "The airline is one of the largest air carriers in Asia.",
      "example_cn": "这家航空公司是亚洲最大的航空承运人之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or organism that transmits a disease, pathogen, or genetic trait without necessarily showing symptoms themselves.",
      "explanation_cn": "指本身可能不表现出症状，但能传播疾病、病原体或遗传特征的个体或生物体。",
      "example_en": "She is a carrier of the sickle cell gene but has never developed the disease.",
      "example_cn": "她是镰状细胞基因的携带者，但从未发病。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device or system that supports or conveys another object or signal, such as a radio wave or data stream.",
      "explanation_cn": "指支持或传输另一物体或信号的装置或系统，如无线电波或数据流的载体。",
      "example_en": "Fiber-optic cables are the primary carriers of internet data across continents.",
      "example_cn": "光纤电缆是跨洲际互联网数据传输的主要载体。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who carries or delivers messages, items, or responsibilities on behalf of others.",
      "explanation_cn": "指代表他人传递信息、物品或责任的人。",
      "example_en": "The courier acted as a carrier of confidential documents between the two governments.",
      "example_cn": "这位快递员充当了两国之间机密文件的传递者。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "transporter",
      "analysis": "“Transporter”（运输者）更侧重于物理运输的工具或角色，常用于指具体的运输设备（如卡车、火车）或科幻语境中的传送装置。而 “carrier” 的含义更广泛，可涵盖运输公司、生物载体或信号载体，语义范围更广，且常用于专业或技术语境。"
    },
    {
      "word_to_compare": "bearer",
      "analysis": "“Bearer”（持有者）强调对某物的物理持有或拥有，如支票、债券或密码的持有者，常用于金融或法律语境。而 “carrier” 更强调“传递”或“传输”的功能，不一定是最终持有者，而是中间的传递媒介。"
    },
    {
      "word_to_compare": "vector",
      "analysis": "“Vector”（媒介/载体）是科学术语，特指传播疾病或基因的生物媒介（如蚊子），或数学/物理中的方向性量。它比 “carrier” 更专业、更精确，常用于医学和工程领域；而 “carrier” 是更通用的日常用语，适用范围更广。"
    }
  ]
}