{
  "word": "cartoons",
  "pronunciation": "kahr·toons",
  "concise_definition": "n. 卡通, 漫画, 动画片",
  "forms": {
    "singular": "cartoon"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A simplified, often humorous drawing or series of drawings, typically published in newspapers or magazines, that comments on current events, politics, or social issues.",
      "explanation_cn": "一种简化的、常具幽默感的图画或系列图画，通常刊登在报纸或杂志上，用于评论时事、政治或社会问题。",
      "example_en": "The editorial cartoon depicted the president as a shipwrecked sailor lost at sea.",
      "example_cn": "这篇社论漫画将总统描绘成一名在海上遇难的水手。"
    },
    {
      "pos": "noun",
      "explanation_en": "An animated film or television program, usually intended for children, featuring exaggerated characters and slapstick humor.",
      "explanation_cn": "一种动画电影或电视节目，通常面向儿童，角色形象夸张，充满滑稽搞笑的情节。",
      "example_en": "My brother and I used to watch Looney Tunes every Saturday morning.",
      "example_cn": "我哥哥和我过去每个周六早上都会看《乐一通》。"
    },
    {
      "pos": "noun",
      "explanation_en": "A preliminary sketch or design, especially in art or tapestry, used as a guide for the final work.",
      "explanation_cn": "一种初步的草图或设计，尤其在绘画或挂毯艺术中，用作完成作品的指导蓝图。",
      "example_en": "The artist completed the cartoon for the stained-glass window before beginning the actual painting.",
      "example_cn": "艺术家在开始实际绘画之前，先完成了彩色玻璃窗的草图。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "comics",
      "analysis": "“Comics”（漫画）通常指以连续画面和对话气泡讲述故事的图文形式，多为连载形式，内容更复杂，常包含完整的情节发展。而 “cartoon” 更侧重于单幅或短篇的幽默讽刺画，或动画形式，不一定有连续叙事。"
    },
    {
      "word_to_compare": "animation",
      "analysis": "“Animation”（动画）是一个技术性术语，泛指所有通过逐帧制作实现运动的影像作品，包括成人向、艺术片或纪录片。而 “cartoon” 是动画的一种风格，通常指风格化、夸张、面向儿童或喜剧导向的作品。所有 cartoons 都是 animation，但并非所有 animation 都是 cartoons。"
    },
    {
      "word_to_compare": "illustrations",
      "analysis": "“Illustrations”（插图）是为文字内容服务的视觉辅助图像，强调清晰传达信息或增强理解，风格多样，未必幽默或夸张。而 “cartoon” 通常具有强烈的主观表达、讽刺意味或娱乐目的，其核心是情绪或观点的传达，而非单纯的信息传递。"
    }
  ]
}