{
  "word": "cart",
  "pronunciation": "kärt",
  "concise_definition": "n. 手推车, 车辆; v. 推, 运送",
  "forms": {
    "plural": "carts"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A two- or four-wheeled vehicle, typically pulled by animals or pushed by hand, used for transporting goods or people.",
      "explanation_cn": "一种两轮或四轮的车辆，通常由动物牵引或人力推动，用于运输货物或人员。",
      "example_en": "The farmer loaded the hay onto a wooden cart.",
      "example_cn": "农夫把干草装上了木制手推车。"
    },
    {
      "pos": "noun",
      "explanation_en": "A shopping cart, a wheeled basket used in supermarkets or stores for customers to collect items while shopping.",
      "explanation_cn": "购物车，一种在超市或商店中供顾客收集商品的带轮篮子。",
      "example_en": "She filled her cart with groceries before heading to the checkout.",
      "example_cn": "她在结账前把购物车装满了杂货。"
    },
    {
      "pos": "noun",
      "explanation_en": "A wheeled platform or frame used in specific contexts, such as a wheelbarrow, a cannon cart, or a hospital gurney.",
      "explanation_cn": "在特定情境下使用的带轮平台或框架，如独轮车、火炮运输车或医院担架车。",
      "example_en": "The wounded soldier was placed on a medical cart and rushed to the infirmary.",
      "example_cn": "伤员被放在医疗推车上，紧急送往医务室。"
    },
    {
      "pos": "verb",
      "explanation_en": "To carry or transport something, especially in a cart or by pushing it.",
      "explanation_cn": "用推车或通过推动的方式运送某物。",
      "example_en": "They carted the old furniture to the dump.",
      "example_cn": "他们把旧家具运到了垃圾场。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "wagon",
      "analysis": "“Wagon”（马车）通常指更大、更坚固、常由马匹牵引的运输车辆，多用于农业或历史语境，承载能力更强；而 “cart” 更轻便，多为人力推动或小型动物牵引，用途更广泛，包括日常购物和短途运输。"
    },
    {
      "word_to_compare": "truck",
      "analysis": "“Truck”（卡车）是机动车辆，依靠发动机驱动，用于大规模或长距离货运；而 “cart” 是非机动的，依赖人力或畜力，结构简单，适用于小规模、短距离运输。两者在动力和规模上有本质区别。"
    },
    {
      "word_to_compare": "trolley",
      "analysis": "“Trolley”（手推车/电车）在英式英语中常与 “cart” 互换，尤其指超市购物车或机场行李车；但 “trolley” 也可指有轨道的电车或带轮的升降设备（如手术推车），语义范围更广，而 “cart” 更强调基本的运输功能，不涉及电力或轨道系统。"
    }
  ]
}