{
  "word": "case",
  "pronunciation": "kayss",
  "concise_definition": "n. 情况, 案例, 箱子, 诉讼",
  "forms": {
    "plural": "cases"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A particular instance or occurrence of something, especially one that is examined or used as an example in analysis, discussion, or legal proceedings.",
      "explanation_cn": "指某种事物的具体实例或发生情况，常用于分析、讨论或法律程序中作为研究或例证的对象。",
      "example_en": "This is a rare case of a patient recovering without medication.",
      "example_cn": "这是一个患者在不使用药物的情况下康复的罕见案例。"
    },
    {
      "pos": "noun",
      "explanation_en": "A legal proceeding or lawsuit involving a dispute between parties, typically heard in court.",
      "explanation_cn": "指在法庭上审理的法律诉讼或纠纷案件，涉及双方当事人的权利或责任争议。",
      "example_en": "The lawyer is preparing for her next case, which involves intellectual property theft.",
      "example_cn": "这位律师正在为她的下一个涉及知识产权盗窃的案件做准备。"
    },
    {
      "pos": "noun",
      "explanation_en": "A container or enclosure designed to hold, protect, or transport something, often made of rigid material.",
      "explanation_cn": "指用于容纳、保护或运输某物的容器或外壳，通常由硬质材料制成。",
      "example_en": "She packed the electronics in a sturdy plastic case.",
      "example_cn": "她把电子产品装在一个坚固的塑料箱子里。"
    },
    {
      "pos": "noun",
      "explanation_en": "A set of circumstances or conditions surrounding a particular situation, often used in phrases like 'in case' or 'in any case'.",
      "explanation_cn": "指围绕某一特定情境的一系列状况或条件，常用于短语如 'in case'（以防）或 'in any case'（无论如何）。",
      "example_en": "In case of emergency, please follow the exit signs.",
      "example_cn": "如遇紧急情况，请遵循出口指示标志。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "example",
      "analysis": "“Example” 强调作为说明或示范的典型事例，目的是帮助理解抽象概念；而 “case” 更侧重于一个真实或具体的实例，尤其在法律、医学或社会分析中，强调其独特性与实际背景。一个 “example” 可以是虚构的，但一个 “case” 通常是真实的、可被调查的。"
    },
    {
      "word_to_compare": "instance",
      "analysis": "“Instance” 与 “case” 都指具体发生的事例，但 “instance” 更中性、更通用，常用于逻辑或技术语境中，强调事件的“一次发生”；而 “case” 常带有更复杂的背景，可能涉及责任、后果或法律意义，语义更厚重。"
    },
    {
      "word_to_compare": "situation",
      "analysis": "“Situation” (情境) 指的是一个整体的环境或状态，强调的是当前的条件或氛围，不一定是可被单独分析的事件；而 “case” 是一个更明确、边界清晰的实例，通常可以被命名、记录和处理，如 ‘a case of fraud’。"
    }
  ]
}