{
  "word": "cases",
  "pronunciation": "kay·siz",
  "concise_definition": "n. 情况, 案例, 箱子, (法律) 案件",
  "forms": {
    "singular": "case"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A particular instance or occurrence of something, especially one that is used to illustrate a general rule, principle, or pattern.",
      "explanation_cn": "指某事物的特定实例或发生情况，常用于说明一个普遍规则、原则或模式。",
      "example_en": "This case demonstrates how early intervention can prevent long-term problems.",
      "example_cn": "这个案例说明了早期干预如何能防止长期问题。"
    },
    {
      "pos": "noun",
      "explanation_en": "A legal proceeding or lawsuit involving a dispute between parties, typically heard in a court of law.",
      "explanation_cn": "指在法庭上审理的、涉及双方争议的法律程序或诉讼案件。",
      "example_en": "The lawyer is preparing for a high-profile criminal case next month.",
      "example_cn": "这位律师正在为下个月一起备受关注的刑事案件做准备。"
    },
    {
      "pos": "noun",
      "explanation_en": "A container or enclosure designed to hold, protect, or transport something, often made of wood, metal, or plastic.",
      "explanation_cn": "指用于容纳、保护或运输某物的容器或外壳，通常由木材、金属或塑料制成。",
      "example_en": "She packed the fragile glassware in a sturdy wooden case.",
      "example_cn": "她把易碎的玻璃器皿装在一个坚固的木箱里。"
    },
    {
      "pos": "noun",
      "explanation_en": "A set of circumstances or conditions surrounding a particular situation, often analyzed for decision-making or diagnosis.",
      "explanation_cn": "指围绕某一特定情况的一系列环境或条件，常用于分析、决策或诊断。",
      "example_en": "In this case, the best solution is to wait and monitor the symptoms.",
      "example_cn": "在这种情况下，最好的办法是等待并观察症状。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "example",
      "analysis": "“Example” 强调作为说明或示范的典型事例，侧重于解释性；而 “case” 更常用于实际发生的具体情境，尤其在法律、医学或分析语境中，强调真实性和具体性。一个 “example” 可以是虚构的，但一个 “case” 通常是真实的事件。"
    },
    {
      "word_to_compare": "instance",
      "analysis": "“Instance” 与 “case” 非常接近，都指具体发生的事件，但 “instance” 更中性、更抽象，常用于逻辑或统计语境；而 “case” 带有更强的情境性和复杂性，常涉及人、责任或后果，如医疗案例、法律案件。"
    },
    {
      "word_to_compare": "situation",
      "analysis": "“Situation” (状况) 指的是一个更广泛、更模糊的环境或状态，不一定是可分析的独立事件；而 “case” 是一个明确界定的、可被单独研究或处理的具体情形。例如，‘the situation in the city’ 是宏观描述，而 ‘a case of theft’ 是一个可记录、可处理的独立事件。"
    }
  ]
}