{
  "word": "casing",
  "pronunciation": "kay·sing",
  "concise_definition": "n. 外壳, 套管, 包覆层",
  "forms": {
    "plural": "casings"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A protective outer layer or covering that encloses or shields something, often for structural support, insulation, or safety.",
      "explanation_cn": "指用于包裹、保护某物的外层结构，通常提供结构支撑、绝缘或安全保障。",
      "example_en": "The electrical wire is insulated with a plastic casing to prevent electric shocks.",
      "example_cn": "电线外包裹着塑料外壳，以防止触电。"
    },
    {
      "pos": "noun",
      "explanation_en": "A tube or pipe, especially one used in drilling to line the walls of a well and prevent collapse or contamination.",
      "explanation_cn": "指用于钻井时衬在井壁内、防止坍塌或污染的管状结构，尤指油井或水井的套管。",
      "example_en": "Engineers installed steel casings to stabilize the deep oil well.",
      "example_cn": "工程师安装了钢制套管以稳定深井。"
    },
    {
      "pos": "noun",
      "explanation_en": "The outer cover of a firearm's cartridge or a bullet, typically made of metal, which contains the propellant and primer.",
      "explanation_cn": "指枪弹的外壳，通常由金属制成，用于容纳推进剂和底火。",
      "example_en": "The spent casing was found near the scene of the shooting.",
      "example_cn": "射击现场附近发现了空弹壳。"
    },
    {
      "pos": "noun",
      "explanation_en": "A decorative or functional outer frame or housing for a window, door, or other architectural element.",
      "explanation_cn": "指窗户、门或其他建筑构件的外框或外壳，兼具装饰与功能作用。",
      "example_en": "The wooden casing around the window was painted white to match the trim.",
      "example_cn": "窗户周围的木制窗框被涂成白色，以与装饰线条相匹配。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "shell",
      "analysis": "“Shell”（外壳）泛指任何物体的坚硬外层，常用于生物（如蛋壳、贝壳）或抽象结构（如核壳），强调薄而坚硬的保护层。而 “casing” 更强调功能性包裹结构，常用于工程、机械或建筑领域，通常更厚实、更结构化。"
    },
    {
      "word_to_compare": "housing",
      "analysis": "“Housing”（外壳/机壳）通常指容纳设备或机械部件的完整外壳，强调内部空间的封闭性与保护性，如电子设备的机壳。而 “casing” 更侧重于包裹或衬里的功能，可能不完全封闭，如井套管或弹壳。"
    },
    {
      "word_to_compare": "sheath",
      "analysis": "“Sheath”（套子/鞘）通常指柔软或柔韧的包裹物，用于保护尖锐物体（如刀鞘、电缆护套），强调柔性和贴合性。而 “casing” 多为刚性材料制成，用于承重或抗压，如金属套管或建筑窗框。"
    }
  ]
}