{
  "word": "casts",
  "pronunciation": "kastz",
  "concise_definition": "n. 演员阵容, 铸造物, 投掷; v. 投掷, 播放, 选举投票, 铸造",
  "forms": {
    "base_form": "cast",
    "third_person_singular": "casts",
    "past_tense": "cast",
    "past_participle": "cast",
    "present_participle": "casting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The group of actors who perform in a film, play, or other production, often listed by their roles.",
      "explanation_cn": "指在电影、戏剧或其他演出中出演的全体演员，通常按角色列出。",
      "example_en": "The film's cast includes several Oscar-winning actors.",
      "example_cn": "这部电影的演员阵容包括几位奥斯卡获奖演员。"
    },
    {
      "pos": "noun",
      "explanation_en": "A thing that is made by pouring liquid material (such as metal or plaster) into a mold and allowing it to harden.",
      "explanation_cn": "指将液态材料（如金属或石膏）倒入模具中凝固后形成的制品。",
      "example_en": "The sculptor created a bronze cast of the statue for the museum.",
      "example_cn": "雕塑家为博物馆制作了一尊青铜铸像。"
    },
    {
      "pos": "verb",
      "explanation_en": "To throw or propel something forcefully through the air.",
      "explanation_cn": "指用力将某物投掷或抛向空中。",
      "example_en": "He cast the fishing line far out into the lake.",
      "example_cn": "他把鱼线远远地抛到了湖心。"
    },
    {
      "pos": "verb",
      "explanation_en": "To transmit a television or radio program to viewers or listeners.",
      "explanation_cn": "指通过电视或广播向观众或听众播放节目。",
      "example_en": "The network will cast the live concert at 8 p.m. tonight.",
      "example_cn": "该电视台将在今晚8点播放这场现场音乐会。"
    },
    {
      "pos": "verb",
      "explanation_en": "To vote for someone in an election, especially by placing a ballot in a box or selecting a candidate electronically.",
      "explanation_cn": "指在选举中投票支持某人，通常通过投选票或电子选择实现。",
      "example_en": "Voters cast their ballots before the polls closed at 7 p.m.",
      "example_cn": "选民们在投票站晚上7点关闭前投出了自己的选票。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form or shape something by pouring molten material into a mold.",
      "explanation_cn": "指通过将熔融材料倒入模具中来成型或塑造某物。",
      "example_en": "The foundry casts iron parts for automotive engines.",
      "example_cn": "铸造厂为汽车发动机铸造铁制零件。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ensemble",
      "analysis": "“Ensemble”（整体/合奏团）强调多个元素作为一个协调的整体，常用于音乐、舞蹈或时尚领域，指所有部分共同构成的艺术表现。而 “cast” 专指戏剧或影视作品中的演员群体，具有明确的表演角色分工。"
    },
    {
      "word_to_compare": "mold",
      "analysis": "“Mold”（模具）是铸造过程中使用的容器或模型，是形成铸件的工具；而 “cast” 是使用模具后得到的最终产物。两者是工艺中的前后关系，不能互换。"
    },
    {
      "word_to_compare": "broadcast",
      "analysis": "“Broadcast”（广播/播送）是更正式、更广泛的术语，指通过无线电、电视或网络向大众传播内容，常用于新闻、直播等语境；而 “cast” 在此语义下更口语化，常用于影视、流媒体平台，强调单次或特定节目的播放行为。"
    }
  ]
}