{
  "word": "cast",
  "pronunciation": "kast",
  "concise_definition": "v. 投掷, 播放, 选角, 投票; n. 演员阵容, 铸造物, 投掷",
  "forms": {
    "third_person_singular": "casts",
    "past_tense": "cast",
    "past_participle": "cast",
    "present_participle": "casting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To throw or propel something forcefully through the air, often with a specific motion such as fishing or hurling.",
      "explanation_cn": "指用力将某物抛向空中，通常带有特定动作，如钓鱼抛线或投掷物体。",
      "example_en": "He cast the fishing line far into the lake.",
      "example_cn": "他把鱼线远远地抛进了湖里。"
    },
    {
      "pos": "verb",
      "explanation_en": "To assign roles to actors in a film, play, or other performance.",
      "explanation_cn": "指为电影、戏剧或其他表演选定演员并分配角色。",
      "example_en": "The director cast her as the lead in the new Broadway musical.",
      "example_cn": "导演选她出演这部新百老汇音乐剧的女主角。"
    },
    {
      "pos": "verb",
      "explanation_en": "To send out or broadcast something, such as a television or radio program.",
      "explanation_cn": "指播出电视或广播节目。",
      "example_en": "The network will cast the live concert at 8 p.m. tonight.",
      "example_cn": "该电视台将在今晚八点播出这场现场音乐会。"
    },
    {
      "pos": "verb",
      "explanation_en": "To vote by placing a ballot or expressing a choice, especially in an election or formal decision.",
      "explanation_cn": "指在选举或正式表决中投下选票或表达选择。",
      "example_en": "All eligible voters must cast their ballots before noon.",
      "example_cn": "所有合格选民必须在中午前投出选票。"
    },
    {
      "pos": "verb",
      "explanation_en": "To shape or form a material, typically metal, by pouring it into a mold and allowing it to harden.",
      "explanation_cn": "指将金属等材料熔化后倒入模具中，使其凝固成型。",
      "example_en": "The bronze statue was cast using an ancient lost-wax technique.",
      "example_cn": "这座青铜雕像采用古老的失蜡法铸造而成。"
    },
    {
      "pos": "noun",
      "explanation_en": "The group of actors performing in a film, play, or television show.",
      "explanation_cn": "指一部电影、戏剧或电视节目中所有演员的组合。",
      "example_en": "The film’s cast includes several Oscar-winning actors.",
      "example_cn": "这部电影的演员阵容包括几位奥斯卡获奖演员。"
    },
    {
      "pos": "noun",
      "explanation_en": "A thing that has been cast, especially a metal object formed by pouring molten material into a mold.",
      "explanation_cn": "指通过浇铸形成的物体，尤指金属制品。",
      "example_en": "The artist displayed a delicate cast of a leaf in the gallery.",
      "example_cn": "艺术家在画廊中展出了一件精致的树叶铸件。"
    },
    {
      "pos": "noun",
      "explanation_en": "A medical device, typically made of plaster or fiberglass, used to immobilize a broken bone while it heals.",
      "explanation_cn": "指用于固定骨折部位以促进愈合的医疗装置，通常由石膏或纤维材料制成。",
      "example_en": "After the fracture, she had to wear a cast on her arm for six weeks.",
      "example_cn": "骨折后，她不得不在手臂上佩戴石膏六周。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "throw",
      "analysis": "“Throw” (投掷) 是一个更通用的动词，泛指任何将物体抛出的动作，不强调技巧或目的。而 “cast” 常带有特定方式或意图，如钓鱼、投掷选票或播送节目，语义更丰富、语境更专业。"
    },
    {
      "word_to_compare": "appoint",
      "analysis": "“Appoint” (任命) 强调正式地指派某人担任职位或职责，常用于行政或组织语境。而 “cast” 在选角语境中更侧重于艺术性选择，强调角色与演员的契合度，而非权威任命。"
    },
    {
      "word_to_compare": "ensemble",
      "analysis": "“Ensemble” (整体/合奏团体) 是一个名词，常用于音乐或戏剧中，强调所有成员作为一个协调整体的表现。而 “cast” 仅指参与演出的演员名单，不强调表演的协调性，更偏向人员构成。"
    },
    {
      "word_to_compare": "mold",
      "analysis": "“Mold” (模具) 是铸造过程中使用的容器或模型，是工具；而 “cast” 是使用模具后形成的成品。两者是过程与结果的关系，不能互换。"
    }
  ]
}