{
  "word": "casting",
  "pronunciation": "kæs·tɪŋ",
  "concise_definition": "n. 铸造, 演员选角, 铸件; v. 投掷, 铸造, 选角",
  "forms": {
    "base_form": "cast",
    "past_tense": "cast",
    "past_participle": "cast",
    "present_participle": "casting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of pouring molten metal or other material into a mold to create a specific shape, often used in manufacturing and sculpture.",
      "explanation_cn": "指将熔化的金属或其他材料倒入模具中以形成特定形状的过程，常用于制造业和雕塑。",
      "example_en": "The artist created a bronze casting of a dancing figure.",
      "example_cn": "这位艺术家制作了一个跳舞人物的青铜铸件。"
    },
    {
      "pos": "noun",
      "explanation_en": "The selection and assignment of actors for roles in a film, play, or television production.",
      "explanation_cn": "指在电影、戏剧或电视制作中挑选和分配演员出演特定角色的过程。",
      "example_en": "The casting for the new superhero movie took six months.",
      "example_cn": "这部新超级英雄电影的选角花了六个月时间。"
    },
    {
      "pos": "noun",
      "explanation_en": "A piece of metal or material that has been cast in a mold; a finished product of the casting process.",
      "explanation_cn": "指通过铸造过程制成的金属或材料制品；铸造工艺的成品。",
      "example_en": "The factory produces hundreds of castings for automotive parts each day.",
      "example_cn": "这家工厂每天生产数百个汽车零部件铸件。"
    },
    {
      "pos": "verb",
      "explanation_en": "To throw or propel something forcefully through the air, often with a specific motion (e.g., fishing, sports).",
      "explanation_cn": "指用力将某物投掷或抛出，通常带有特定动作（如钓鱼、体育运动）。",
      "example_en": "He cast the fishing line far out into the lake.",
      "example_cn": "他把鱼线远远地抛到了湖心。"
    },
    {
      "pos": "verb",
      "explanation_en": "To select actors for roles in a theatrical or cinematic production.",
      "explanation_cn": "指为戏剧或电影制作挑选演员出演角色。",
      "example_en": "The director is casting for the lead role next week.",
      "example_cn": "导演下周将为男主角进行选角。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "molding",
      "analysis": "“Molding”（成型）强调通过模具塑造材料的外形，常用于塑料、石膏等软性材料，过程可能不涉及熔化；而 “casting” 通常特指使用熔融材料（如金属）注入模具，强调高温液态到固态的转变。"
    },
    {
      "word_to_compare": "selection",
      "analysis": "“Selection”（选择）是泛指从多个选项中挑选，适用于任何情境；而 “casting” 在表演艺术语境中是专业术语，特指为影视或戏剧挑选演员，包含试镜、评估和角色匹配等特定流程。"
    },
    {
      "word_to_compare": "throw",
      "analysis": "“Throw”（投掷）是日常用语，泛指任何用手臂力量将物体抛出的动作；而 “cast” 在此语境下更强调技巧性、精准性和特定目的（如钓鱼、魔法施法），常带有仪式感或专业性。"
    }
  ]
}