{
  "word": "caucasian",
  "pronunciation": "kaw·kay·zhun",
  "concise_definition": "adj. 高加索的, 白种人的; n. 白种人",
  "forms": {
    "comparative": "more Caucasian",
    "superlative": "most Caucasian"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to the Caucasus region, a geographical area between the Black Sea and the Caspian Sea, or used historically to describe people originating from Europe, Western Asia, and parts of North Africa.",
      "explanation_cn": "指与高加索地区（位于黑海与里海之间的地理区域）有关的；或历史上用于描述源自欧洲、西亚及部分北非地区的人群。",
      "example_en": "The term 'Caucasian' was once commonly used in anthropology to classify people with light skin from Europe and the Middle East.",
      "example_cn": "‘高加索人’一词曾常用于人类学中，以分类来自欧洲和中东的浅肤色人群。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used in some countries, especially the United States, as a racial classification for people of European descent, often synonymous with 'white'.",
      "explanation_cn": "在某些国家（尤其是美国）用作种族分类术语，指具有欧洲血统的人，常与‘白人’同义。",
      "example_en": "In U.S. census forms, 'Caucasian' is listed as one of the racial categories for individuals of European, Middle Eastern, or North African ancestry.",
      "example_cn": "在美国人口普查表中，‘高加索人’被列为具有欧洲、中东或北非血统人士的种族类别之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person belonging to the racial group historically classified as Caucasian, typically referring to someone of European descent.",
      "explanation_cn": "指历史上被归类为高加索人种的个体，通常指具有欧洲血统的人。",
      "example_en": "The museum's exhibit included portraits of Caucasians from various historical periods across Europe.",
      "example_cn": "该博物馆的展览包含了来自欧洲不同时期的高加索人肖像。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "white",
      "analysis": "“White”（白人）是日常语言中更常用、更直接的种族描述词，强调肤色和外貌特征，常用于社会、政治和文化语境中。而 “Caucasian” 是一个更学术化、更正式的术语，源于18世纪的人类学分类，如今在官方文件（如美国人口普查）中仍被使用，但因其历史背景和科学争议，正逐渐被更精确的术语取代。"
    },
    {
      "word_to_compare": "European",
      "analysis": "“European”（欧洲的/欧洲人）是一个纯粹的地理和文化术语，仅指来自欧洲大陆的人或与其相关的事物，不涉及种族分类。而 “Caucasian” 虽常被等同于白人，但其定义在历史上也包括部分西亚和北非人群，范围更广但更模糊。"
    },
    {
      "word_to_compare": "non-Hispanic white",
      "analysis": "“Non-Hispanic white”（非西班牙裔白人）是美国人口统计中更精确的分类，用于区分具有欧洲血统但非西班牙或拉丁裔背景的人群。相比之下，”Caucasian“ 不包含族裔或语言维度，仅基于传统种族分类，因此在现代语境中显得不够细致，甚至可能产生误导。"
    }
  ]
}