{
  "word": "caucus",
  "pronunciation": "kaw·kus",
  "concise_definition": "n. 小组会议, 派系会议; v. 举行小组会议",
  "forms": {
    "plural": "caucuses",
    "third_person_singular": "caucuses",
    "past_tense": "caucused",
    "past_participle": "caucused",
    "present_participle": "caucusing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A meeting of members of a political party or subgroup to coordinate strategy, select candidates, or make decisions, especially in the context of U.S. presidential primaries.",
      "explanation_cn": "指政党或其下属团体为协调策略、选拔候选人或作出决策而召开的会议，尤指美国总统初选中的党内集会。",
      "example_en": "The Democratic Party held a caucus in Iowa to choose its presidential nominee.",
      "example_cn": "民主党在爱荷华州举行党内初选会议，以选出总统候选人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A closed or informal group of people with a shared interest or goal, often exerting influence within a larger organization.",
      "explanation_cn": "指具有共同利益或目标的封闭或非正式团体，通常在更大的组织内部施加影响。",
      "example_en": "A bipartisan caucus of senators is pushing for climate reform legislation.",
      "example_cn": "一群两党参议员组成的非正式团体正在推动气候变革立法。"
    },
    {
      "pos": "verb",
      "explanation_en": "To meet or gather in a caucus, especially to discuss political strategy or select candidates.",
      "explanation_cn": "指召开或参加党内会议，尤指讨论政治策略或选拔候选人。",
      "example_en": "Local party members caucused overnight to finalize their endorsement.",
      "example_cn": "当地党员通宵开会，以最终确定他们的支持人选。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "meeting",
      "analysis": "“Meeting”（会议）是一个通用词，泛指任何形式的聚集讨论，不带有政治或组织内部的特定含义。而 “caucus” 特指政党或派系内部的策略性会议，具有更强的政治性和组织纪律性。"
    },
    {
      "word_to_compare": "convention",
      "analysis": "“Convention”（代表大会）通常是更大规模、更正式的全国性或地区性集会，有固定议程和公开程序，如政党全国代表大会。“Caucus” 则更小、更非正式，常在地方层面进行，参与者通过讨论和协商达成一致，而非投票表决。"
    },
    {
      "word_to_compare": "clique",
      "analysis": "“Clique”（小圈子）通常带有贬义，指排外、封闭且可能不正当的私人团体，强调人际关系而非正式职能。“Caucus” 虽然也是小团体，但它是政治体系中被承认的、有功能性的组织单元，具有明确目标和公开作用。"
    }
  ]
}