{
  "word": "causing",
  "pronunciation": "kaw·zing",
  "concise_definition": "v. 引起, 导致, 造成 (cause 的现在分词形式)",
  "forms": {
    "base_form": "cause",
    "third_person_singular": "causes",
    "past_tense": "caused",
    "past_participle": "caused",
    "present_participle": "causing"
  },
  "definitions": [
    {
      "pos": "verb (present participle)",
      "explanation_en": "The act of bringing about an effect, event, or condition; being the reason or agent responsible for something happening, often with a focus on the ongoing or continuous nature of the action.",
      "explanation_cn": "指引发某种结果、事件或状况的行为；作为某事发生的原因或推动者，常强调该行为正在进行或持续发生。",
      "example_en": "The heavy rainfall is causing widespread flooding in the region.",
      "example_cn": "持续的强降雨正在导致该地区发生大面积洪涝。"
    },
    {
      "pos": "verb (present participle)",
      "explanation_en": "Used in compound constructions to describe an action that leads directly to a consequence, often in causal chains or explanatory contexts.",
      "explanation_cn": "用于复合结构中，描述直接导致某种后果的行为，常用于解释因果链条或说明性语境中。",
      "example_en": "His reckless driving, causing multiple accidents, has drawn public criticism.",
      "example_cn": "他鲁莽的驾驶行为导致了多起事故，已引发公众批评。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "causing",
      "analysis": "“Causing” 是动词 “cause” 的现在分词形式，强调动作的进行性或持续性，通常用于描述正在发生的因果关系。而 “cause” 作为动词原形，用于一般陈述，不强调时间状态。例如：'Smoking causes cancer'（吸烟导致癌症）是普遍真理；'The storm is causing power outages'（风暴正在导致停电）强调当前正在发生。"
    },
    {
      "word_to_compare": "leading to",
      "analysis": "“Leading to” 是一个介词短语，语气更间接、缓和，常用于描述间接或渐进的因果关系，不强调直接的推动作用。而 “causing” 更直接、更强硬，表示明确的因果责任。例如：'Poor diet is leading to health problems'（不良饮食正导致健康问题）暗示趋势；'The chemical spill is causing immediate ecological damage'（化学泄漏正造成即时生态破坏）强调直接后果。"
    },
    {
      "word_to_compare": "resulting in",
      "analysis": "“Resulting in” 强调结果的自然发生，常用于描述被动或非主动引发的后果，主语通常是事件或状态，而非主动施动者。而 “causing” 常暗示一个主动或直接的推动因素。例如：'The economic downturn, resulting in higher unemployment'（经济衰退导致失业率上升）是结果导向；'The policy is causing public unrest'（该政策正在引发公众不安）则明确指出政策是主动原因。"
    }
  ]
}