{
  "word": "cave",
  "pronunciation": "kāv",
  "concise_definition": "n. 洞穴, 地下室; v. 塌陷, 屈服",
  "forms": {
    "plural": "caves",
    "third_person_singular": "caves",
    "past_tense": "caved",
    "past_participle": "caved",
    "present_participle": "caving"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A natural underground space large enough for a person to enter, typically formed by the weathering of rock and often extending deep into a hillside or mountain.",
      "explanation_cn": "指由岩石风化形成的、足够容纳人进入的天然地下空间，通常延伸至山坡或山体内部。",
      "example_en": "The explorers discovered a hidden cave filled with ancient rock paintings.",
      "example_cn": "探险家们发现了一个藏有古代岩画的隐秘洞穴。"
    },
    {
      "pos": "noun",
      "explanation_en": "A room or space dug into the ground or beneath a building, often used for storage, especially of wine or food.",
      "explanation_cn": "指挖掘于地面或建筑物下方的房间或空间，常用于储存物品，尤其是葡萄酒或食物。",
      "example_en": "The cellar was converted into a wine cave with temperature-controlled shelves.",
      "example_cn": "地窖被改造成一个带有温控架的酒窖。"
    },
    {
      "pos": "verb",
      "explanation_en": "To collapse or sink inward suddenly, especially under pressure or due to structural weakness.",
      "explanation_cn": "指突然塌陷或向内下沉，通常因压力或结构脆弱所致。",
      "example_en": "The old mine shaft caved in after decades of neglect.",
      "example_cn": "这座废弃数十年的矿井通道最终塌陷了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To yield or surrender under pressure, especially in the face of demands, criticism, or adversity; to give in.",
      "explanation_cn": "指在压力、要求、批评或逆境面前屈服或让步。",
      "example_en": "The politician caved to public pressure and resigned from office.",
      "example_cn": "这位政客在公众压力下屈服并辞去了职务。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "grotto",
      "analysis": "“Grotto”（岩洞）通常指较小、较美观、常有人工装饰的洞穴，多用于园林或宗教场所，带有审美或象征意义。而 “cave” 更中性，泛指任何天然形成的地下空间，不强调装饰性。"
    },
    {
      "word_to_compare": "cellar",
      "analysis": "“Cellar”（地窖）是人为建造的地下空间，主要用于储藏，结构稳定且通常有明确用途；而 “cave” 作为名词时强调天然形成，即使被用作储藏，其本质仍是自然构造。"
    },
    {
      "word_to_compare": "collapse",
      "analysis": "“Collapse” (倒塌/崩溃) 是更广泛的动词，可指建筑、系统、组织或身体的突然崩溃，适用范围远大于 “cave”。而 “cave” 作为动词时，特指地面或结构向内塌陷，常用于地质或物理语境，语气更具体、形象。"
    },
    {
      "word_to_compare": "yield",
      "analysis": "“Yield” (让步/屈服) 是更正式、更通用的词，可用于法律、交通、谈判等多种语境，强调主动或被动的退让；而 “cave” 在表示屈服时带有更强的负面色彩，暗示软弱、无原则地妥协，语气更口语化且具贬义。"
    }
  ]
}