{
  "word": "cavendish",
  "pronunciation": "kav·en·dish",
  "concise_definition": "n. 卡文迪许（姓氏/香蕉品种/实验室）",
  "forms": {
    "plural": "Cavendishes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A widely cultivated variety of banana known for its sweet flavor, yellow skin, and resistance to shipping damage; it is the most common banana found in global markets.",
      "explanation_cn": "一种广泛栽培的香蕉品种，以其香甜的口感、黄色果皮和耐运输性著称，是全球市场上最常见的香蕉类型。",
      "example_en": "The supermarket shelves were filled with ripe Cavendish bananas.",
      "example_cn": "超市货架上摆满了成熟的卡文迪许香蕉。"
    },
    {
      "pos": "noun",
      "explanation_en": "A prominent English scientific family, notably including Henry Cavendish (1731–1810), a pioneering chemist and physicist who discovered hydrogen and made early measurements of the Earth's density.",
      "explanation_cn": "一个著名的英国科学家族，尤其以亨利·卡文迪许（1731–1810）为代表，他是开创性的化学家和物理学家，发现了氢气并首次较精确地测量了地球密度。",
      "example_en": "The Cavendish Laboratory at Cambridge University is named after the Cavendish family.",
      "example_cn": "剑桥大学的卡文迪许实验室以卡文迪许家族命名。"
    },
    {
      "pos": "noun",
      "explanation_en": "The Cavendish Laboratory, a world-renowned physics research facility at the University of Cambridge, where numerous groundbreaking discoveries in physics and chemistry have been made since the 19th century.",
      "explanation_cn": "剑桥大学著名的物理学研究机构，自19世纪以来在此诞生了众多物理学与化学领域的突破性发现。",
      "example_en": "James Chadwick discovered the neutron in the Cavendish Laboratory in 1932.",
      "example_cn": "詹姆斯·查德威克于1932年在卡文迪许实验室发现了中子。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "banana",
      "analysis": "“Banana” 是香蕉的通用名称，泛指所有香蕉品种；而 “Cavendish” 是其中一种特定品种，占全球香蕉产量的绝大多数。因此，Cavendish 是 banana 的一个子类，具有更具体的生物学和商业含义。"
    },
    {
      "word_to_compare": "laboratory",
      "analysis": "“Laboratory” 是泛指进行科学实验的场所；而 “Cavendish Laboratory” 是专有名词，特指剑桥大学中以卡文迪许家族命名的著名物理实验室，承载着特定的历史与科学成就，具有不可替代的文化与学术意义。"
    },
    {
      "word_to_compare": "scientist",
      "analysis": "“Scientist” 是对从事科学研究者的泛称；而 “Cavendish” 作为姓氏，特指亨利·卡文迪许及其家族成员，他们不仅是科学家，更是科学史上的标志性人物，其贡献被永久铭刻在科学机构与术语中（如卡文迪许实验、卡文迪许常数）。"
    }
  ]
}