{
  "word": "cbi",
  "pronunciation": "sē·bī",
  "concise_definition": "n. 基于竞争的干预（常用于经济/贸易语境）；儿童保育机构（Childcare Institution）；中央银行（Central Bank of Ireland）等缩写，需依语境确定",
  "forms": {
    "plural": "cbis"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Competitive Balance Index or Competitive Base Instrument: A term used in economic policy or trade regulation to describe interventions designed to ensure fair competition among market participants, often by adjusting subsidies, tariffs, or regulatory frameworks.",
      "explanation_cn": "竞争平衡指数或竞争基础工具：在经济政策或贸易监管中使用的术语，指为确保市场参与者之间的公平竞争而进行的干预，通常通过调整补贴、关税或监管框架实现。",
      "example_en": "The WTO reviewed the country's CBI policies to ensure they did not distort international trade.",
      "example_cn": "世界贸易组织审查了该国的竞争性干预政策，以确保其未扭曲国际贸易。"
    },
    {
      "pos": "noun",
      "explanation_en": "Childcare Institution: An organization or facility that provides care, education, and supervision for young children while their parents are at work.",
      "explanation_cn": "儿童保育机构：为父母工作期间提供儿童看护、教育和监管的组织或设施。",
      "example_en": "The city has invested heavily in improving the quality of local CBI services.",
      "example_cn": "该市已大力投资改善本地儿童保育机构的服务质量。"
    },
    {
      "pos": "noun",
      "explanation_en": "Central Bank of Ireland: The national central bank responsible for monetary policy, financial stability, and currency issuance in Ireland.",
      "explanation_cn": "爱尔兰中央银行：负责爱尔兰货币政策、金融稳定和货币发行的国家中央银行。",
      "example_en": "The CBI raised interest rates to combat rising inflation.",
      "example_cn": "爱尔兰中央银行提高了利率以应对不断上升的通货膨胀。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "intervention",
      "analysis": "“Intervention”（干预）是一个更广泛的通用词，泛指任何外部力量对系统、市场或过程的介入。而 “CBI” 作为缩写，特指在经济语境中具有特定目标（如维持竞争公平）的干预形式，其含义更专业、更受限。"
    },
    {
      "word_to_compare": "central bank",
      "analysis": "“Central bank”（中央银行）是完整术语，泛指任何国家的中央银行机构，如美联储、欧洲央行等。而 “CBI” 是特指爱尔兰中央银行的专有缩写，具有地理和机构唯一性，不能用于其他国家的央行。"
    },
    {
      "word_to_compare": "childcare",
      "analysis": "“Childcare”（儿童保育）是描述服务类型的通用名词，指对儿童的照料行为或系统。而 “CBI” 作为缩写，特指提供该服务的机构实体，强调组织属性而非服务内容本身。"
    }
  ]
}