{
  "word": "cells",
  "pronunciation": "selz",
  "concise_definition": "n. 细胞, 小房间, 电池, 监狱单间",
  "forms": {
    "singular": "cell"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The basic structural and functional unit of all known living organisms, containing genetic material and capable of self-replication.",
      "explanation_cn": "所有已知生物体的基本结构和功能单位，含有遗传物质并能自我复制。",
      "example_en": "Human bodies are made up of trillions of cells, each performing specialized tasks.",
      "example_cn": "人体由数万亿个细胞组成，每个细胞都执行着特定的功能。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, enclosed room, especially one in which a prisoner is kept or a monk lives.",
      "explanation_cn": "一个封闭的小房间，尤指囚犯被关押的地方或修士居住的单间。",
      "example_en": "The prisoner spent 23 hours a day in his cell.",
      "example_cn": "这名囚犯每天有23小时被关在单人牢房里。"
    },
    {
      "pos": "noun",
      "explanation_en": "A single unit of a battery that generates electrical energy through chemical reactions.",
      "explanation_cn": "电池中的一个基本单元，通过化学反应产生电能。",
      "example_en": "This smartphone uses a lithium-ion cell to power its operations.",
      "example_cn": "这部智能手机使用锂离子电池单元来供电。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small group or unit within a larger organization, especially one engaged in secret or political activities.",
      "explanation_cn": "大型组织中的一个小团体或单位，尤指从事秘密或政治活动的小组。",
      "example_en": "The terrorist organization operated through several covert cells across Europe.",
      "example_cn": "该恐怖组织在欧洲各地通过多个隐蔽小组开展活动。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "unit",
      "analysis": "“Unit” (单元) 是一个更广泛的术语，泛指任何可独立运作或计量的组成部分，可用于数学、军事、组织或物理系统。而 “cell” 更强调其作为生物体基本单位或封闭独立结构的特性，具有更强的生物学或空间隔离含义。"
    },
    {
      "word_to_compare": "battery",
      "analysis": "“Battery” (电池) 是由多个 “cell”（电池单元）组合而成的整体装置，用于提供电力。一个电池可能包含一个或多个细胞，因此 “cell” 是 “battery” 的组成部分，二者是整体与部分的关系。"
    },
    {
      "word_to_compare": "chamber",
      "analysis": "“Chamber” (室、腔) 通常指一个中空的空间，如心脏的腔室或议会的议事厅，强调空间的内部结构，但不必然具有封闭、隔离或功能独立的含义。而 “cell” 更强调封闭性、隔离性和功能性，尤其在监狱或生物学语境中。"
    }
  ]
}