{
  "word": "celtic",
  "pronunciation": "kel·tik",
  "concise_definition": "adj. 凯尔特的, n. 凯尔特语, 凯尔特人",
  "forms": {
    "comparative": "more celtic",
    "superlative": "most celtic"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to the ancient or modern peoples of Europe who spoke Celtic languages and shared cultural traits, including the Irish, Scottish, Welsh, Cornish, Manx, and Breton peoples.",
      "explanation_cn": "指与讲凯尔特语并拥有共同文化特征的古代或现代欧洲民族相关的，包括爱尔兰人、苏格兰人、威尔士人、康沃尔人、马恩岛人和布列塔尼人。",
      "example_en": "The Celtic knot is a traditional decorative motif found in Irish and Scottish art.",
      "example_cn": "凯尔特结是一种在爱尔兰和苏格兰艺术中常见的传统装饰图案。"
    },
    {
      "pos": "noun",
      "explanation_en": "A member of a group of peoples in Europe who speak or spoke Celtic languages and share a common cultural heritage.",
      "explanation_cn": "指欧洲讲或曾讲凯尔特语、并拥有共同文化遗产的民族成员。",
      "example_en": "Many modern Celts in Wales still celebrate their ancestral traditions through music and language.",
      "example_cn": "威尔士的许多现代凯尔特人仍通过音乐和语言庆祝他们的祖先传统。"
    },
    {
      "pos": "noun",
      "explanation_en": "A Celtic language, such as Irish, Scottish Gaelic, Welsh, or Breton, spoken by the Celtic peoples.",
      "explanation_cn": "指凯尔特民族所使用的凯尔特语，如爱尔兰语、苏格兰盖尔语、威尔士语或布列塔尼语。",
      "example_en": "The revival of the Celtic language in Cornwall has gained momentum in recent years.",
      "example_cn": "近年来，康沃尔凯尔特语的复兴势头不断增强。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "gaelic",
      "analysis": "“Gaelic”（盖尔语）特指凯尔特语族中的盖尔亚支语言，如爱尔兰语和苏格兰盖尔语，是“Celtic”的一个子集。而 “Celtic” 范围更广，涵盖所有凯尔特语言（包括布立吞亚支的威尔士语、布列塔尼语等）及整个文化体系。"
    },
    {
      "word_to_compare": "brythonic",
      "analysis": "“Brythonic”（布立吞语）是凯尔特语族的一个分支，包括威尔士语、康沃尔语和布列塔尼语，与盖尔语并列。它是一个语言学分类术语，而 “Celtic” 是涵盖所有凯尔特语言和民族的总称，更具文化与历史广度。"
    },
    {
      "word_to_compare": "viking",
      "analysis": "“Viking”（维京人）指中世纪来自斯堪的纳维亚的北欧航海者和战士，其文化、语言和历史与凯尔特人截然不同。虽然两者在历史上曾有接触（如爱尔兰和苏格兰的维京殖民），但 “Celtic” 强调的是凯尔特文化传统，而 “Viking” 则代表北欧日耳曼传统，二者在语言、宗教和艺术上无直接关联。"
    }
  ]
}