{
  "word": "celtics",
  "pronunciation": "sel·tiks",
  "concise_definition": "n. 凯尔特人, 凯尔特语, 波士顿凯尔特人队",
  "forms": {
    "singular": "celtic"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A member of a group of peoples in ancient Europe who spoke Celtic languages and shared cultural traits, including the Irish, Scottish, Welsh, and Bretons.",
      "explanation_cn": "指古代欧洲讲凯尔特语并拥有共同文化特征的民族群体成员，包括爱尔兰人、苏格兰人、威尔士人和布列塔尼人。",
      "example_en": "The Celtic tribes resisted Roman expansion for centuries.",
      "example_cn": "凯尔特部落数个世纪以来抵抗罗马的扩张。"
    },
    {
      "pos": "noun",
      "explanation_en": "The group of Indo-European languages spoken by the ancient and modern Celtic peoples, including Irish, Scottish Gaelic, Welsh, and Breton.",
      "explanation_cn": "指古代和现代凯尔特民族所使用的印欧语系语言，包括爱尔兰语、苏格兰盖尔语、威尔士语和布列塔尼语。",
      "example_en": "Efforts are being made to revive the Celtic language of Cornish in southwest England.",
      "example_cn": "人们正在努力复兴英格兰西南部的康沃尔凯尔特语。"
    },
    {
      "pos": "noun",
      "explanation_en": "A professional basketball team based in Boston, Massachusetts, known for its 17 NBA championships and rich history in the league.",
      "explanation_cn": "指位于马萨诸塞州波士顿的一支职业篮球队，以17次NBA总冠军和在联盟中的悠久历史而闻名。",
      "example_en": "The Celtics won their first championship in 1957 and became a dynasty under coach Red Auerbach.",
      "example_cn": "凯尔特人队于1957年赢得首个总冠军，并在教练雷·阿彻巴尔德的带领下成为王朝球队。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "gaelic",
      "analysis": "“Gaelic”（盖尔语）特指凯尔特语族中的爱尔兰语和苏格兰盖尔语，是凯尔特语的一个子集。而 “Celtics” 是一个更广泛的术语，涵盖所有凯尔特民族及其语言、文化，不仅限于盖尔语分支。"
    },
    {
      "word_to_compare": "britons",
      "analysis": "“Britons”（不列颠人）通常指古代或现代居住在不列颠群岛的人，尤其在罗马时期指凯尔特人后裔。但现代语境中，“Britons” 更常指英国国民，而 “Celtics” 强调的是文化与语言上的凯尔特身份，如威尔士人或苏格兰人，不等同于国籍。"
    },
    {
      "word_to_compare": "tribes",
      "analysis": "“Tribes”（部落）泛指任何具有共同血缘、语言或文化的原始社会群体，而 “Celtics” 是特指具有凯尔特语言和文化特征的民族群体。虽然凯尔特人常被称作部落，但 “Celtics” 一词更强调其语言文化传承，而非社会组织形式。"
    }
  ]
}