{
  "word": "cement",
  "pronunciation": "suh·mehnt",
  "concise_definition": "n. 水泥, 胶结物; v. 使牢固, 凝固, 加强",
  "forms": {
    "plural": "cements",
    "third_person_singular": "cements",
    "past_tense": "cemented",
    "past_participle": "cemented",
    "present_participle": "cementing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A fine powder made from limestone and clay, which hardens when mixed with water and is used as a binding material in construction.",
      "explanation_cn": "一种由石灰石和黏土制成的细粉，与水混合后会硬化，用作建筑中的粘合材料。",
      "example_en": "The workers mixed cement, sand, and gravel to pour the foundation.",
      "example_cn": "工人们将水泥、沙子和砾石混合，浇筑地基。"
    },
    {
      "pos": "noun",
      "explanation_en": "Something that binds or unites people, groups, or ideas, often referring to a strong emotional or social connection.",
      "explanation_cn": "指将人、群体或思想联系在一起的事物，常指强烈的情感或社会纽带。",
      "example_en": "Shared values serve as the cement that holds the community together.",
      "example_cn": "共同的价值观是维系这个社区的纽带。"
    },
    {
      "pos": "verb",
      "explanation_en": "To join or bind things firmly together, often using cement as a material.",
      "explanation_cn": "用水泥或其他粘合材料将物体牢固地连接在一起。",
      "example_en": "The bricks were cemented together to form a sturdy wall.",
      "example_cn": "砖块用水泥粘合在一起，形成一堵坚固的墙。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strengthen or solidify a relationship, agreement, or situation, making it more permanent or irreversible.",
      "explanation_cn": "使某种关系、协议或状况变得更牢固、更持久，甚至不可逆转。",
      "example_en": "The signing of the treaty cemented the alliance between the two nations.",
      "example_cn": "条约的签署巩固了两国之间的联盟。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "concrete",
      "analysis": "“Concrete” (混凝土) 是由水泥、沙子、砾石和水混合而成的最终建筑材料，强调的是复合物的整体；而 “cement” 是混凝土的组成部分，仅指粘合剂本身。在比喻义上，两者都可表示“巩固”，但 “concrete” 更常用于形容具体、可触摸的成果（如 concrete evidence），而 “cement” 更强调动态的连接过程。"
    },
    {
      "word_to_compare": "bind",
      "analysis": "“Bind” (绑定/束缚) 是一个更广泛的动词，泛指任何形式的连接或约束，可以是物理的、法律的或情感的，但不特指通过粘合材料实现。而 “cement” 作为动词时，隐含了使用某种‘粘合剂’来实现牢固结合，常带有‘使不可分离’的强化意味。"
    },
    {
      "word_to_compare": "solidify",
      "analysis": "“Solidify” (固化/巩固) 强调从液态或不稳定状态转变为固态或稳定状态，适用于物质或抽象概念（如意见、制度）。它更侧重于状态的转变，而 “cement” 更强调通过外部媒介（如水泥或共同利益）主动加强连接，具有更强的主动性和人际/社会语境。"
    }
  ]
}