{
  "word": "censor",
  "pronunciation": "sen·sor",
  "concise_definition": "v. 审查, 删节; n. 审查员, 审查机构",
  "forms": {
    "third_person_singular": "censors",
    "past_tense": "censored",
    "past_participle": "censored",
    "present_participle": "censoring"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To examine and suppress or delete parts of a book, film, letter, or other communication that are considered obscene, politically sensitive, or otherwise objectionable by an authority.",
      "explanation_cn": "指由权威机构审查书籍、电影、信件或其他传播内容，并删减或删除其中被认为淫秽、政治敏感或有其他不当之处的部分。",
      "example_en": "The government censored the news report to avoid public panic.",
      "example_cn": "政府审查了新闻报道，以避免引发公众恐慌。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove or alter content in order to conform to moral, political, or social standards, often without official authority but under social pressure.",
      "explanation_cn": "指为符合道德、政治或社会规范而删除或修改内容，有时并非出于官方授权，而是受社会压力所迫。",
      "example_en": "The publisher censored the author's controversial remarks before printing the book.",
      "example_cn": "出版商在印刷该书前删去了作者有争议的言论。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or official body responsible for examining and suppressing material deemed inappropriate or dangerous.",
      "explanation_cn": "指负责审查并压制被认为不适当或危险内容的个人或官方机构。",
      "example_en": "The film was banned by the censor because of its violent scenes.",
      "example_cn": "由于影片中含有暴力场景，它被审查员禁映了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "review",
      "analysis": "“Review” (审查/复审) 通常指中立或建设性的评估过程，目的是判断质量、准确性或价值，不一定涉及删减。例如，学术论文的同行评审。而 “censor” 强调压制、删除或禁止，带有强制性和控制意图。"
    },
    {
      "word_to_compare": "edit",
      "analysis": "“Edit” (编辑) 是对文本或媒体进行修改以提高清晰度、流畅性或结构，通常是出于专业或艺术目的，不带有道德或政治压制的意味。而 “censor” 的修改是出于禁止或隐藏某些信息，具有意识形态或权力控制的性质。"
    },
    {
      "word_to_compare": "suppress",
      "analysis": "“Suppress” (压制) 是一个更广泛的词，指通过任何手段阻止信息、情绪或行为的表达，可以是暴力、法律或心理方式。而 “censor” 特指通过审查制度对传播内容进行系统性删减，是压制的一种具体形式，常与官方机构相关。"
    }
  ]
}