{
  "word": "centre",
  "pronunciation": "sen·tr",
  "concise_definition": "n. 中心, 中央, 核心; v. 集中, 使居中",
  "forms": {
    "plural": "centres",
    "third_person_singular": "centres",
    "past_tense": "centred",
    "past_participle": "centred",
    "present_participle": "centring"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The middle point of a space, object, or area, often considered the most important or active part.",
      "explanation_cn": "指一个空间、物体或区域的中间点，通常被视为最重要或最活跃的部分。",
      "example_en": "The city's main library is located at the cultural centre.",
      "example_cn": "这座城市的主要图书馆位于文化中心。"
    },
    {
      "pos": "noun",
      "explanation_en": "A place or institution dedicated to a particular activity, function, or group of people, often serving as a hub for that activity.",
      "explanation_cn": "指专为某种活动、功能或人群设立的场所或机构，常作为该活动的枢纽。",
      "example_en": "She volunteers at a community centre that offers free English classes.",
      "example_cn": "她在一家提供免费英语课程的社区中心做志愿者。"
    },
    {
      "pos": "noun",
      "explanation_en": "The focal point of attention, interest, or activity; the core around which something revolves.",
      "explanation_cn": "指关注、兴趣或活动的焦点，是围绕其展开的核心。",
      "example_en": "The debate centred on the issue of climate change.",
      "example_cn": "这场辩论的核心是气候变化问题。"
    },
    {
      "pos": "verb",
      "explanation_en": "To place or bring something to the centre or to make it the focus of attention.",
      "explanation_cn": "指将某物置于中心位置，或使其成为关注的焦点。",
      "example_en": "The director centred the film around the protagonist's inner conflict.",
      "example_cn": "导演将影片的重心放在主角的内心冲突上。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "center",
      "analysis": "“Center” 是美式拼写，而 “centre” 是英式拼写，两者在含义和用法上完全相同，仅拼写差异。在正式写作中需根据目标受众选择相应拼写形式。"
    },
    {
      "word_to_compare": "core",
      "analysis": "“Core” (核心) 强调事物最内在、最基本、不可分割的部分，常用于抽象概念（如核心价值、核心能力）。而 “centre” 更侧重于空间或物理上的中心位置，也可用于比喻，但不如 “core” 那样强调本质性。"
    },
    {
      "word_to_compare": "hub",
      "analysis": "“Hub” (枢纽) 指一个连接多个方向或系统的中心节点，强调交通、信息或网络的交汇功能（如交通枢纽、信息枢纽）。而 “centre” 更广泛，可指任何中心点，不一定具有连接或传输功能。"
    }
  ]
}