{
  "word": "ceramics",
  "pronunciation": "suh·ram·iks",
  "concise_definition": "n. 陶瓷, 陶瓷制品",
  "forms": {
    "singular": "ceramic"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Hard, brittle, heat-resistant, and corrosion-resistant materials made by shaping and firing non-metallic minerals, such as clay, at high temperatures; commonly used for pottery, tiles, and industrial components.",
      "explanation_cn": "指通过将非金属矿物（如黏土）成型并在高温下烧制而成的坚硬、脆性、耐热和耐腐蚀的材料，常用于制作陶器、瓷砖和工业部件。",
      "example_en": "The museum has an extensive collection of ancient ceramics from China and Japan.",
      "example_cn": "博物馆收藏了大量来自中国和日本的古代陶瓷。"
    },
    {
      "pos": "noun",
      "explanation_en": "The art or craft of making objects from ceramic materials, often involving shaping, glazing, and firing techniques.",
      "explanation_cn": "指使用陶瓷材料制作物品的艺术或工艺，通常包括成型、施釉和烧制等技术。",
      "example_en": "She studied ceramics at university and now runs her own pottery studio.",
      "example_cn": "她在大学学习陶瓷艺术，如今经营着自己的陶艺工作室。"
    },
    {
      "pos": "noun",
      "explanation_en": "A class of advanced materials used in engineering and technology, such as silicon carbide or alumina, valued for their strength, thermal stability, and electrical insulation properties.",
      "explanation_cn": "指在工程与科技中使用的一类先进材料，如碳化硅或氧化铝，因其强度、热稳定性及电绝缘性能而备受重视。",
      "example_en": "Modern jet engines rely on high-performance ceramics to withstand extreme temperatures.",
      "example_cn": "现代喷气发动机依赖高性能陶瓷来承受极端温度。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pottery",
      "analysis": "“Pottery”（陶器）特指用黏土手工制作的实用或装饰性器皿，如碗、罐、花瓶等，通常强调手工性和传统工艺，属于陶瓷的一种，但范围更窄。而 “ceramics” 是更广泛的术语，涵盖所有由无机非金属材料经高温烧制而成的制品，包括工业陶瓷和先进陶瓷。"
    },
    {
      "word_to_compare": "porcelain",
      "analysis": "“Porcelain”（瓷器）是陶瓷的一种特定类型，由高岭土制成，烧制温度更高，质地更致密、半透明且声音清脆。它属于陶瓷的子类，具有更精细的工艺和美学标准。而 “ceramics” 是上位概念，包括陶器、瓷器、炻器等多种类型。"
    },
    {
      "word_to_compare": "glass",
      "analysis": "“Glass”（玻璃）虽然也是非金属无机材料，但其制造过程是熔融后冷却成型，不经过烧结，结构为非晶态。而陶瓷是通过粉末烧结形成晶体或部分晶体结构，具有更高的硬度和耐热性。两者在材料科学中常被并列讨论，但本质工艺和性能不同。"
    }
  ]
}