{
  "word": "certified",
  "pronunciation": "sər·tuh·fahyd",
  "concise_definition": "adj. 经认证的, 经正式确认的, 有证书的",
  "forms": {
    "comparative": "more certified",
    "superlative": "most certified"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Officially recognized or verified by an authoritative body as meeting specific standards, qualifications, or requirements, often through examination or inspection.",
      "explanation_cn": "经权威机构正式认可或验证，符合特定标准、资格或要求，通常通过考试或检查获得。",
      "example_en": "She is a certified public accountant (CPA) with over ten years of experience.",
      "example_cn": "她是一位拥有十年以上经验的注册公共会计师。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Guaranteed or confirmed to be true, genuine, or of a specified quality, often used in product labeling or legal contexts.",
      "explanation_cn": "保证为真实、正宗或具有特定质量的，常用于产品标签或法律语境中。",
      "example_en": "This organic produce is certified by the USDA as free from synthetic pesticides.",
      "example_cn": "这些有机农产品经美国农业部认证，不含合成杀虫剂。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Having received formal documentation attesting to competence, status, or compliance, especially in professional or technical fields.",
      "explanation_cn": "已获得正式文件证明其能力、身份或合规性，尤指在专业或技术领域中。",
      "example_en": "Only certified technicians are allowed to repair this equipment.",
      "example_cn": "只有经过认证的技术人员才被允许维修此设备。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "approved",
      "analysis": "“Approved” (批准的) 指某事物已被授权或同意，但不一定涉及正式的评估或标准。它更侧重于权限的授予，如“approved vendor”（批准的供应商）。而 “certified” 强调通过专业标准或测试的正式验证，具有更强的技术性和权威性。"
    },
    {
      "word_to_compare": "licensed",
      "analysis": "“Licensed” (持证的) 通常指由政府或监管机构授予的法律许可，允许从事某项职业或活动（如医生执照、驾驶执照）。它强调合法性，而 “certified” 更强调能力或质量的证明，有时可独立于法律许可存在。例如，一个人可持证（licensed）执业，同时拥有专业认证（certified）以证明其更高水平。"
    },
    {
      "word_to_compare": "verified",
      "analysis": "“Verified” (已核实的) 指信息或身份已被确认为真实，但不一定涉及专业标准或官方认证流程。例如，社交媒体账号被“verified”仅表示身份真实，而非能力认证。而 “certified” 隐含了通过一套既定标准的系统性评估，具有更严格的程序性。"
    }
  ]
}