{
  "word": "chain",
  "pronunciation": "cheyn",
  "concise_definition": "n. 链条, 链接, 系列; v. 用链子拴住, 连锁",
  "forms": {
    "plural": "chains",
    "third_person_singular": "chains",
    "past_tense": "chained",
    "past_participle": "chained",
    "present_participle": "chaining"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A series of connected metal links, typically used for binding, holding, or transmitting force, often made of metal and used in machinery, locks, or as a symbol of bondage.",
      "explanation_cn": "由一系列相互连接的金属环组成的物体，通常用于捆绑、固定或传递力量，常用于机械、锁具中，也可象征束缚。",
      "example_en": "The prisoner was dragged across the yard by a heavy iron chain.",
      "example_cn": "囚犯被一条沉重的铁链拖过院子。"
    },
    {
      "pos": "noun",
      "explanation_en": "A connected series of people, organizations, or events linked together in a sequence, often implying dependency or continuity.",
      "explanation_cn": "指一系列相互关联的人、组织或事件，按顺序连接，常暗示依赖性或连续性。",
      "example_en": "The company operates a global chain of retail stores.",
      "example_cn": "这家公司运营着一个全球连锁零售店网络。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sequence of related things or events occurring in succession, often with a cause-and-effect relationship.",
      "explanation_cn": "指一系列相继发生、彼此相关的事件或事物，常具有因果关系。",
      "example_en": "A chain of misunderstandings led to the breakdown of their friendship.",
      "example_cn": "一连串的误解导致了他们友谊的破裂。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fasten or secure something with a chain or chains, often restricting movement or connection.",
      "explanation_cn": "用链条将某物拴住或固定，通常是为了限制其移动或连接。",
      "example_en": "The dog was chained to the post to prevent it from running away.",
      "example_cn": "狗被拴在柱子上，以防它跑掉。"
    },
    {
      "pos": "verb",
      "explanation_en": "To link or connect things together in a sequence, often metaphorically, to form a continuous system or process.",
      "explanation_cn": "将事物按顺序连接起来，常用于比喻意义，形成一个连续的系统或过程。",
      "example_en": "The report chains together data from multiple sources to reveal a pattern.",
      "example_cn": "这份报告将来自多个来源的数据串联起来，以揭示某种模式。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "link",
      "analysis": "“Link” (连接) 是一个更通用的词，指任何类型的连接，可以是物理的、抽象的或数字的，不一定具有实体形态或强度。而 “chain” 强调由多个环节组成的、通常是刚性或物理性的序列，且常带有束缚或连续性的隐含意义。"
    },
    {
      "word_to_compare": "series",
      "analysis": "“Series” (系列) 指按顺序排列的一组事物，但不强调它们之间的物理或强制性连接，可以是抽象的、无关联的。而 “chain” 不仅表示顺序，还暗示各部分之间存在紧密、不可分割的联系，甚至可能有因果或强制约束关系。"
    },
    {
      "word_to_compare": "bond",
      "analysis": "“Bond” (纽带/联系) 通常指情感、法律或抽象意义上的联系，如亲情、合同或化学键，强调关系的牢固性而非物理结构。而 “chain” 更偏向于物理或机械的连接，有时带有负面含义，如束缚或压迫。"
    }
  ]
}