{
  "word": "challenge",
  "pronunciation": "chal·lenj",
  "concise_definition": "n. 挑战, 质疑; v. 挑战, 质疑, 邀请对抗",
  "forms": {
    "third_person_singular": "challenges",
    "past_tense": "challenged",
    "past_participle": "challenged",
    "present_participle": "challenging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A difficult task or situation that tests someone's abilities, courage, or determination, often requiring effort to overcome.",
      "explanation_cn": "指一项考验某人能力、勇气或决心的困难任务或情境，通常需要付出努力才能克服。",
      "example_en": "Climbing Mount Everest was the greatest challenge of his life.",
      "example_cn": "攀登珠穆朗玛峰是他一生中最大的挑战。"
    },
    {
      "pos": "noun",
      "explanation_en": "An official objection or dispute, especially in a legal, political, or competitive context, to question the validity or fairness of something.",
      "explanation_cn": "指在法律、政治或竞赛背景下，对某事的有效性或公正性提出的正式异议或争议。",
      "example_en": "The losing candidate filed a legal challenge to the election results.",
      "example_cn": "落选候选人对选举结果提出了法律上的质疑。"
    },
    {
      "pos": "verb",
      "explanation_en": "To invite someone to compete or engage in a contest, often to test skill, strength, or courage.",
      "explanation_cn": "指邀请某人参与竞争或对抗，通常是为了测试技能、力量或勇气。",
      "example_en": "She challenged her friend to a game of chess.",
      "example_cn": "她邀请朋友下棋一较高下。"
    },
    {
      "pos": "verb",
      "explanation_en": "To question or dispute the truth, validity, or legality of something, often publicly or forcefully.",
      "explanation_cn": "指公开或有力地质疑某事的真实性、有效性或合法性。",
      "example_en": "The lawyer challenged the witness's testimony under cross-examination.",
      "example_cn": "律师在交叉质询中质疑了证人的证词。"
    },
    {
      "pos": "verb",
      "explanation_en": "To confront or oppose something directly, especially an authority, norm, or established belief.",
      "explanation_cn": "指直接对抗或反对某种权威、规范或既定观念。",
      "example_en": "The activists challenged the government's environmental policies.",
      "example_cn": "活动人士对政府的环境政策提出了挑战。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "problem",
      "analysis": "“Problem” (问题) 指一个需要解决的困难或障碍，通常带有负面含义，强调困扰或阻碍。而 “challenge” 更强调积极面对和克服困难的过程，常带有激励或机遇的意味。"
    },
    {
      "word_to_compare": "obstacle",
      "analysis": "“Obstacle” (障碍) 指阻碍前进的物理或抽象事物，通常是被动存在的，需要绕过或清除。而 “challenge” 更强调主动迎战，是需要被应对、被战胜的考验，更具主观能动性。"
    },
    {
      "word_to_compare": "contest",
      "analysis": "“Contest” (竞赛) 通常指有明确规则和胜负的正式比赛，如体育或才艺竞赛。而 “challenge” 可以是正式或非正式的对抗，不一定有规则，甚至可以是观念或权威上的对抗，范围更广。"
    }
  ]
}