{
  "word": "chalk",
  "pronunciation": "chawk",
  "concise_definition": "n. 粉笔, 白垩; v. 用粉笔写, 擦除, 记录",
  "forms": {
    "plural": "chalks"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A soft, white, porous sedimentary rock composed primarily of calcium carbonate, used especially for writing on blackboards or as a material in construction and agriculture.",
      "explanation_cn": "一种由碳酸钙为主的柔软、多孔的白色沉积岩，常用于在黑板上书写，或用于建筑和农业中。",
      "example_en": "The teacher picked up a piece of chalk and wrote the equation on the board.",
      "example_cn": "老师拿起一支粉笔，在黑板上写下了这个方程式。"
    },
    {
      "pos": "noun",
      "explanation_en": "A stick made from this material, used for writing or drawing, especially in classrooms or on sidewalks.",
      "explanation_cn": "由这种材料制成的条状物，用于书写或绘画，尤指在教室或人行道上使用。",
      "example_en": "The children drew hopscotch grids on the pavement with colorful chalk.",
      "example_cn": "孩子们用彩色粉笔在人行道上画了跳房子的格子。"
    },
    {
      "pos": "verb",
      "explanation_en": "To write or mark something using chalk, typically on a blackboard or other hard surface.",
      "explanation_cn": "使用粉笔在黑板或其他硬质表面上书写或标记。",
      "example_en": "She chalked up the schedule on the classroom board.",
      "example_cn": "她在教室的黑板上写下了课程表。"
    },
    {
      "pos": "verb",
      "explanation_en": "To erase or remove something written with chalk, often by wiping or brushing.",
      "explanation_cn": "通过擦拭或刷除来擦掉粉笔写的字迹。",
      "example_en": "He chalked off the old notes before writing the new lesson.",
      "example_cn": "他在写新课之前把旧笔记擦掉了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To record or account for something, often in a figurative sense (e.g., 'chalk it up to experience').",
      "explanation_cn": "以比喻方式记录或归因于某事（如 '把它归因于经验'）。",
      "example_en": "I’ll chalk this loss up to inexperience — we’ll do better next time.",
      "example_cn": "我把这次失败归因于经验不足——下次我们会做得更好。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "marker",
      "analysis": "“Marker”（马克笔）是一种现代书写工具，使用墨水而非粉笔，通常用于白板，颜色更鲜艳、不易脱落，但缺乏粉笔的颗粒感和传统教学氛围。粉笔书写时有粉尘，声音独特，常与传统教育场景关联，而马克笔更干净、持久，适用于现代办公环境。"
    },
    {
      "word_to_compare": "limestone",
      "analysis": "“Limestone”（石灰岩）是粉笔的天然矿物来源，两者化学成分相似（主要为碳酸钙），但石灰岩是未经加工的岩石，质地坚硬，不适用于书写。粉笔是经过加工、压缩成条状的石灰岩粉末，专为书写设计，易碎且留痕。"
    },
    {
      "word_to_compare": "dust",
      "analysis": "“Dust”（灰尘）是粉笔使用过程中产生的副产品，但本身不是书写工具。粉笔的物理特性使其在摩擦时产生粉尘，而“dust”泛指任何细小颗粒物，不具备功能性书写或标记能力。在比喻用法中，“chalk”可引申为记录或归因，而“dust”无此用法。"
    }
  ]
}