{
  "word": "chamber",
  "pronunciation": "cham·ber",
  "concise_definition": "n. 房间, 厅, 会堂; v. 将...置于室内",
  "forms": {
    "plural": "chambers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An enclosed room or space, especially one used for a specific purpose such as a meeting, legal proceeding, or medical examination.",
      "explanation_cn": "指一个封闭的房间或空间，尤其用于特定目的，如会议、法律程序或医疗检查。",
      "example_en": "The judge retired to her chamber to review the evidence.",
      "example_cn": "法官退入她的办公室审阅证据。"
    },
    {
      "pos": "noun",
      "explanation_en": "A legislative or deliberative body, especially one of two houses in a bicameral parliament or congress.",
      "explanation_cn": "指立法或审议机构，尤指两院制议会或国会中的其中一个议院。",
      "example_en": "The House of Commons is one of the two chambers of the UK Parliament.",
      "example_cn": "下议院是英国议会两个议院之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A hollow space or cavity within a structure, such as the chamber of a gun barrel or a heart.",
      "explanation_cn": "指某种结构内部的中空部分，如枪管的膛室或心脏的腔室。",
      "example_en": "The left ventricle is the main pumping chamber of the heart.",
      "example_cn": "左心室是心脏的主要泵血腔室。"
    },
    {
      "pos": "verb",
      "explanation_en": "To place or confine someone or something in a chamber, often for protection, isolation, or official purposes.",
      "explanation_cn": "指将某人或某物安置或关押在房间内，通常出于保护、隔离或官方目的。",
      "example_en": "The suspect was chambered overnight in the police station.",
      "example_cn": "嫌疑人当晚被关押在警局。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "room",
      "analysis": "“Room” (房间) 是最通用的词，泛指任何有四壁的空间，用途广泛且无特定正式含义。而 “chamber” 更具正式性、历史性或专业性，常用于法律、政治、医学或建筑语境中，暗示特定功能或庄严氛围。"
    },
    {
      "word_to_compare": "hall",
      "analysis": "“Hall” (大厅) 通常指较大的公共空间，用于集会、仪式或通行，强调开放性和容纳多人的功能。而 “chamber” 更小、更私密，常用于封闭、专属或正式的活动，如法官的办公室或议会的议事厅。"
    },
    {
      "word_to_compare": "cavity",
      "analysis": "“Cavity” (空腔) 是一个纯解剖学或物理学术语，仅指任何中空部分，不带社会或制度含义。而 “chamber” 在用于解剖或机械结构时，虽可与 “cavity” 互换，但更常用于强调其功能性或结构性角色，如心脏腔室或枪膛。"
    }
  ]
}