{
  "word": "chancellor",
  "pronunciation": "chan·sel·ler",
  "concise_definition": "n. 大臣, 校长, 大法官",
  "forms": {
    "plural": "chancellors"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A senior government official in some countries, especially one who holds a high-ranking position such as the head of the treasury or finance minister (e.g., in the UK or Germany).",
      "explanation_cn": "在某些国家（如英国或德国）担任高级政府官员，通常指财政大臣或财政部长等重要职位。",
      "example_en": "The German chancellor announced new economic reforms to combat inflation.",
      "example_cn": "德国总理宣布了新的经济改革措施以应对通货膨胀。"
    },
    {
      "pos": "noun",
      "explanation_en": "The chief administrative officer of a university, especially in the UK and some Commonwealth countries; sometimes a ceremonial role, while the vice-chancellor handles day-to-day operations.",
      "explanation_cn": "在英国及部分英联邦国家中，大学的最高行政长官，有时为荣誉性职务，日常事务由副校长负责。",
      "example_en": "The chancellor of Oxford University presided over the graduation ceremony.",
      "example_cn": "牛津大学的校长主持了毕业典礼。"
    },
    {
      "pos": "noun",
      "explanation_en": "A high-ranking judge in some legal systems, particularly in England, who presides over the Chancery Division of the High Court, dealing with equity, trusts, and property matters.",
      "explanation_cn": "在某些法律体系中（尤其是英格兰）担任高级法官，主持高等法院衡平法庭，处理衡平法、信托和财产事务。",
      "example_en": "The Lord Chancellor oversees the administration of justice in England and Wales.",
      "example_cn": "大法官负责英格兰和威尔士司法体系的管理。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "prime minister",
      "analysis": "“Prime minister”（总理）是政府的最高行政首脑，掌握实权，领导内阁并负责国家整体政策。而 “chancellor” 在某些国家（如德国）虽也称总理，但在英国则专指财政大臣，权力范围更窄；在其他语境下（如大学或司法系统）则完全不涉及行政领导。"
    },
    {
      "word_to_compare": "president",
      "analysis": "“President”（总统）通常是国家元首或机构负责人，强调选举产生的最高领导地位，如美国总统或大学校长（在美式体系中）。而 “chancellor” 在大学体系中常为荣誉性职位，实际权力由副校长行使；在政府体系中，其职能更偏向财政或司法，而非全面执政。"
    },
    {
      "word_to_compare": "minister",
      "analysis": "“Minister”（部长）是政府中负责某一具体部门（如教育、外交）的官员，属于内阁成员。而 “chancellor” 在英国特指财政大臣（Chancellor of the Exchequer），是部长中地位最高者之一；在德国，它等同于总理，是唯一最高行政长官，因此其地位远超一般部长。"
    }
  ]
}