{
  "word": "change",
  "pronunciation": "cheynj",
  "concise_definition": "v. 改变, 变化; n. 改变, 零钱, 交换",
  "forms": {
    "third_person_singular": "changes",
    "past_tense": "changed",
    "past_participle": "changed",
    "present_participle": "changing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To make or become different in form, nature, or quality; to transform or alter something from one state to another.",
      "explanation_cn": "使某事物在形式、性质或质量上发生改变；将某物从一种状态转变为另一种状态。",
      "example_en": "The climate has changed dramatically over the past century.",
      "example_cn": "过去一个世纪里，气候发生了显著变化。"
    },
    {
      "pos": "verb",
      "explanation_en": "To replace or substitute one thing with another, especially in a routine or habitual context.",
      "explanation_cn": "用另一事物替换或取代某物，尤其在常规或习惯性情境中。",
      "example_en": "She changed her hairstyle to match the new season's trends.",
      "example_cn": "她换了新发型以跟上本季的潮流。"
    },
    {
      "pos": "noun",
      "explanation_en": "A difference or alteration in condition, appearance, or behavior; the result of a transformation.",
      "explanation_cn": "状态、外观或行为上的差异或改变；转变的结果。",
      "example_en": "There has been a positive change in his attitude toward work.",
      "example_cn": "他对工作的态度有了积极的转变。"
    },
    {
      "pos": "noun",
      "explanation_en": "Coins or small denominations of money given back as the difference between the amount paid and the cost of goods or services.",
      "explanation_cn": "支付金额与商品或服务价格之间的差额所找回的硬币或小额纸币，即零钱。",
      "example_en": "Can you give me change for a twenty-dollar bill?",
      "example_cn": "你能给我换二十美元的零钱吗？"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "alter",
      "analysis": "“Alter” (修改) 通常指对某物进行局部或较小的调整，不改变其本质或整体结构，常用于衣物、文件等具体对象。而 “change” 更广泛，可指根本性、全面性的转变，包括抽象概念。"
    },
    {
      "word_to_compare": "transform",
      "analysis": "“Transform” (转变) 强调彻底的、深刻的、往往具有革命性的变化，常带有质的飞跃，如毛毛虫变成蝴蝶。而 “change” 可以是轻微或渐进的，不一定涉及本质的颠覆。"
    },
    {
      "word_to_compare": "shift",
      "analysis": "“Shift” (转移/偏移) 常用于方向、焦点、重心或位置的轻微变动，多用于抽象概念如态度、重点或时间安排，隐含一种动态的、非剧烈的过渡。而 “change” 更中性，适用范围更广，可涵盖从微小到巨大的所有变化类型。"
    }
  ]
}