{
  "word": "chant",
  "pronunciation": "chant",
  "concise_definition": "v. 吟诵, 喊叫; n. 吟诵, 喊话, 赞歌",
  "forms": {
    "third_person_singular": "chants",
    "past_tense": "chanted",
    "past_participle": "chanted",
    "present_participle": "chanting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To repeatedly say or sing words or sounds, often in a rhythmic or monotone manner, especially as part of a religious, ceremonial, or protest context.",
      "explanation_cn": "以有节奏或单调的方式反复吟诵或歌唱词语或声音，常用于宗教仪式、典礼或抗议活动中。",
      "example_en": "The crowd chanted slogans in unison as the march progressed.",
      "example_cn": "游行进行时，人群齐声高呼口号。"
    },
    {
      "pos": "verb",
      "explanation_en": "To recite or sing sacred texts or prayers in a traditional, melodic style, especially in religious worship.",
      "explanation_cn": "以传统、旋律化的方式吟诵神圣经文或祷文，尤指在宗教崇拜中。",
      "example_en": "Monks chant ancient sutras every morning at dawn.",
      "example_cn": "僧侣们每天黎明时分吟诵古老的佛经。"
    },
    {
      "pos": "noun",
      "explanation_en": "A rhythmic, repetitive phrase or song, often used in group settings such as sports events, protests, or religious rituals.",
      "explanation_cn": "一种有节奏、重复性的短语或歌曲，常用于群体场合，如体育赛事、抗议活动或宗教仪式中。",
      "example_en": "The fans sang a loud chant to support their team.",
      "example_cn": "球迷们高唱着响亮的助威口号来支持他们的球队。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sacred or liturgical song used in religious traditions, especially in Christian, Buddhist, or Hindu worship.",
      "explanation_cn": "宗教传统中使用的圣歌或礼仪歌曲，尤指基督教、佛教或印度教的崇拜仪式中。",
      "example_en": "Gregorian chant is a form of plainchant used in Roman Catholic liturgy.",
      "example_cn": "格里高利圣咏是一种用于罗马天主教礼仪的素歌形式。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sing",
      "analysis": "“Sing”（唱歌）泛指以旋律和音调演唱歌曲，强调音乐性和艺术性，可以是独唱或合唱，形式自由。而 “chant” 更强调重复性、节奏性和仪式感，通常没有复杂旋律，甚至接近说话的语调。"
    },
    {
      "word_to_compare": "shout",
      "analysis": "“Shout”（喊叫）指大声叫喊，通常出于情绪激动、命令或引起注意，不具节奏性或重复性，也不一定有语言内容。而 “chant” 是有规律、有结构的重复性发声，常用于集体表达信念或情感。"
    },
    {
      "word_to_compare": "recite",
      "analysis": "“Recite”（背诵）指清晰、有条理地朗读或背诵文字，如诗歌、经文或演讲，强调准确性与记忆，但不一定有节奏或音乐性。而 “chant” 则必须带有节奏或韵律，常伴随身体动作或集体参与，更具仪式感。"
    }
  ]
}