{
  "word": "chants",
  "pronunciation": "chants",
  "concise_definition": "n. 咒语, 吟诵, 齐声呼喊; v. 吟诵, 齐声呼喊",
  "forms": {
    "singular": "chant"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A rhythmic, repetitive vocalization, often used in religious, ceremonial, or protest contexts to express devotion, unity, or demand.",
      "explanation_cn": "一种有节奏、重复的吟唱或呼喊，常用于宗教仪式、庆典或抗议活动中，以表达虔诚、团结或诉求。",
      "example_en": "The crowd began to chant, 'No justice, no peace!' as the march continued.",
      "example_cn": "游行继续时，人群开始齐声高呼：'没有正义，就没有和平！'"
    },
    {
      "pos": "noun",
      "explanation_en": "A formulaic or incantatory phrase, especially in magical or spiritual traditions, believed to have power when spoken or sung.",
      "explanation_cn": "一种公式化或咒语式的短语，尤其在魔法或灵性传统中，被认为在诵读或吟唱时具有某种力量。",
      "example_en": "The priest recited ancient chants to invoke the spirits of the ancestors.",
      "example_cn": "祭司吟诵着古老的咒语，召唤祖先的灵魂。"
    },
    {
      "pos": "verb",
      "explanation_en": "To repeat words or phrases rhythmically and loudly, often in unison with others, especially in a public or ceremonial setting.",
      "explanation_cn": "以有节奏、响亮的方式重复词语或短语，常与他人齐声进行，尤其在公共或仪式场合中。",
      "example_en": "Fans chanted the team's name throughout the entire match.",
      "example_cn": "球迷们在整个比赛过程中齐声高喊球队的名字。"
    },
    {
      "pos": "verb",
      "explanation_en": "To recite or sing religious or magical formulas in a melodic, repetitive manner.",
      "explanation_cn": "以旋律性、重复性的方式诵读或吟唱宗教或魔法咒语。",
      "example_en": "Monks chant sacred texts every morning at dawn.",
      "example_cn": "僧侣们每天黎明时分吟诵圣典。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sings",
      "analysis": "“Sings”（唱歌）泛指以旋律和音调表达音乐性内容，强调艺术性和情感表达，不一定有重复性或集体性。而 “chants” 更强调节奏重复、语言性、仪式性，常用于集体呼喊或宗教诵念，音乐性较弱。"
    },
    {
      "word_to_compare": "shouts",
      "analysis": "“Shouts”（喊叫）指大声叫喊，通常出于情绪激动、警告或命令，缺乏节奏和重复结构。而 “chants” 是有规律、有韵律的重复性发声，常用于凝聚群体意志，具有更强的仪式感和组织性。"
    },
    {
      "word_to_compare": "incantations",
      "analysis": "“Incantations”（咒语）特指用于魔法或超自然目的的言语，强调神秘力量和仪式效果，通常属于 “chants” 的一个子类。所有 incantations 都是 chants，但并非所有 chants 都是 incantations —— 例如球迷的口号是 chant，但不是 incantation。"
    }
  ]
}