{
  "word": "chapel",
  "pronunciation": "chap·uhl",
  "concise_definition": "n. 小教堂, 礼拜堂, 小型祈祷室",
  "forms": {
    "plural": "chapels"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small place of worship, typically without a resident clergy or parish, often located within a larger building such as a hospital, school, castle, or airport.",
      "explanation_cn": "一种小型的礼拜场所，通常没有常驻神职人员或教区，常位于医院、学校、城堡或机场等大型建筑内。",
      "example_en": "The university has a quiet chapel where students can pray or meditate between classes.",
      "example_cn": "这所大学有一座安静的礼拜堂，学生可以在课间祈祷或冥想。"
    },
    {
      "pos": "noun",
      "explanation_en": "A Christian place of worship that is part of a larger institution or organization, such as a royal chapel or a college chapel, often serving a specific community rather than the general public.",
      "explanation_cn": "属于某个大型机构或组织的基督教礼拜场所，如皇家礼拜堂或学院礼拜堂，通常服务于特定群体而非公众。",
      "example_en": "The royal family attends services at the Chapel Royal in Windsor Castle.",
      "example_cn": "王室成员在温莎城堡的皇家礼拜堂参加礼拜。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, often non-denominational room set aside for prayer or religious reflection, especially in secular institutions like universities or prisons.",
      "explanation_cn": "在大学、监狱等世俗机构中专设的小型祈祷或宗教静思空间，通常不隶属于特定教派。",
      "example_en": "The prison includes a multi-faith chapel for inmates of all religious backgrounds.",
      "example_cn": "该监狱设有供不同宗教背景囚犯使用的多元信仰礼拜堂。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "church",
      "analysis": "“Church”（教堂）通常指拥有常驻神职人员、正式教区和完整宗教功能的大型基督教礼拜场所，是社区宗教生活的中心。而 “chapel” 规模更小，常依附于其他机构，不具独立教区，功能也更有限。"
    },
    {
      "word_to_compare": "cathedral",
      "analysis": "“Cathedral”（大教堂）是主教座堂，是教区主教的正式驻地，通常规模宏大、建筑庄严，具有重要的宗教和行政地位。相比之下，”chapel“ 无论在规模、权威性还是组织结构上都远为简朴和附属。"
    },
    {
      "word_to_compare": "temple",
      "analysis": "“Temple”（庙宇）一般用于非基督教宗教，如佛教、印度教或犹太教的宗教场所。而 “chapel” 专指基督教传统中的小型礼拜空间，两者在宗教背景和文化语境上有本质区别。"
    }
  ]
}