{
  "word": "chapter",
  "pronunciation": "chap·tuhr",
  "concise_definition": "n. 章节, 一章, 时期, 分会",
  "forms": {
    "plural": "chapters"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A main division of a book or written work, typically numbered or titled, that organizes content into coherent sections for easier reading and reference.",
      "explanation_cn": "指书籍或书面作品中的主要部分，通常按编号或标题划分，用于将内容组织成连贯的段落，便于阅读和查阅。",
      "example_en": "The first chapter introduces the main characters and the setting of the novel.",
      "example_cn": "第一章介绍了小说的主要人物和故事背景。"
    },
    {
      "pos": "noun",
      "explanation_en": "A distinct period or phase in a person's life, an organization's history, or a broader sequence of events, often marking a significant change or turning point.",
      "explanation_cn": "指一个人的生活、一个组织的历史或更广泛事件序列中的一个显著阶段或时期，常标志着重要的转变或转折点。",
      "example_en": "After the accident, she closed a difficult chapter in her life and started anew.",
      "example_cn": "事故发生后，她翻过了人生中艰难的一页，重新开始。"
    },
    {
      "pos": "noun",
      "explanation_en": "A local branch or division of a larger organization, especially one with a national or international structure, such as a club, association, or political party.",
      "explanation_cn": "指一个更大组织（如俱乐部、协会或政党）的地方分支机构，尤其适用于具有全国或国际结构的组织。",
      "example_en": "The local chapter of the Red Cross organized a blood donation drive last weekend.",
      "example_cn": "当地红十字会分会上周末组织了一次献血活动。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "section",
      "analysis": "“Section”（部分）是一个更通用的词，可指任何被划分出的片段，不限于书籍，如报纸的版面、法律条文的条款等。而 “chapter” 专用于书籍或叙事性文本中的主要结构单位，具有更强的叙事性和完整性。"
    },
    {
      "word_to_compare": "episode",
      "analysis": "“Episode”（一集/事件）常用于描述连续剧、广播节目或一系列事件中的一个独立单元，强调时间上的断续性和情节的独立性。而 “chapter” 更强调在整体结构中的逻辑位置，常用于书面作品或人生阶段，具有更强的连贯性和结构性。"
    },
    {
      "word_to_compare": "phase",
      "analysis": "“Phase”（阶段）侧重于事物发展过程中的一个时期，常用于科学、心理或生命周期语境，如“青春期阶段”。它更抽象，不具物理结构；而 “chapter” 虽也可用于比喻人生阶段，但保留了其作为“文本单元”的隐喻色彩，更具叙事性和可感知性。"
    }
  ]
}