{
  "word": "chargers",
  "pronunciation": "chahr·juhrz",
  "concise_definition": "n. 充电器, 收费者, 攻击者, 装载者",
  "forms": {
    "singular": "charger"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A device that supplies electrical energy to recharge batteries, typically used for electronic devices such as phones, laptops, or electric vehicles.",
      "explanation_cn": "一种为电池补充电能的设备，常用于手机、笔记本电脑或电动汽车等电子设备的充电。",
      "example_en": "I left my phone charger at home, so I had to borrow one from a friend.",
      "example_cn": "我把手机充电器忘在家里了，只好向朋友借了一个。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or entity that imposes a fee or payment for a service, product, or access, often used in contexts like tolls, taxes, or admission.",
      "explanation_cn": "指对服务、产品或准入权收取费用的人或机构，常用于过路费、税款或入场费等语境。",
      "example_en": "The airport has new baggage chargers that apply to all checked luggage.",
      "example_cn": "机场对所有托运行李实施了新的行李收费。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or animal that charges forward aggressively, especially in a military, sports, or competitive context.",
      "explanation_cn": "指在军事、体育或竞争情境中向前猛烈冲撞的人或动物。",
      "example_en": "The cavalry chargers swept across the field during the historical reenactment.",
      "example_cn": "在历史重现活动中，骑兵冲锋队横扫整个战场。"
    },
    {
      "pos": "noun",
      "explanation_en": "A mechanical device used to load or feed material into a machine, such as a magazine for ammunition or a hopper for grain.",
      "explanation_cn": "一种用于将材料装入机器的机械装置，如弹药的弹匣或谷物的料斗。",
      "example_en": "The grain harvester’s automatic charger kept the transport truck filled without manual intervention.",
      "example_cn": "谷物收割机的自动装载装置无需人工干预即可持续为运输卡车装满谷物。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "adapter",
      "analysis": "“Adapter”（适配器）主要用于连接不同接口或标准的设备，使它们能够兼容工作，但不提供电力。而 “charger” 专门用于提供电能以充电，虽然某些充电器可能集成适配功能，但核心功能不同。"
    },
    {
      "word_to_compare": "battery",
      "analysis": "“Battery”（电池）是储存电能的装置，而 “charger” 是为电池补充能量的外部设备。两者功能互补：电池是能量的容器，充电器是能量的输送者。"
    },
    {
      "word_to_compare": "toll collector",
      "analysis": "“Toll collector”（收费员）特指在道路、桥梁等场所人工或自动收取通行费的人员或系统，是 “charger” 在收费语境下的一个具体子类。而 “charger” 一词更广泛，可涵盖任何收费行为，包括服务费、入场费等非交通场景。"
    },
    {
      "word_to_compare": "rider",
      "analysis": "“Rider”（骑手）泛指骑乘动物或车辆的人，而 “charger” 在军事或文学语境中特指冲锋的骑兵，强调动作的攻击性和速度，语义更具体、更具动态意象。"
    }
  ]
}