{
  "word": "charger",
  "pronunciation": "chär·jər",
  "concise_definition": "n. 充电器, 充电装置, 攻击者, 薪水",
  "forms": {
    "plural": "chargers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A device that supplies electrical energy to recharge a battery, typically used for electronic devices such as phones, laptops, or electric vehicles.",
      "explanation_cn": "一种为电池补充电能的装置，常用于手机、笔记本电脑或电动汽车等电子设备的充电。",
      "example_en": "I left my phone charger at home, so I couldn't use my phone during the trip.",
      "example_cn": "我把手机充电器忘在家里了，所以旅行期间没法用手机。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or animal that charges forward aggressively, especially in a military or sports context.",
      "explanation_cn": "指在军事或体育语境中向前猛烈冲锋的人或动物。",
      "example_en": "The cavalry charger rode into battle with sword raised.",
      "example_cn": "骑兵冲锋者高举长剑冲入战场。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is responsible for charging or collecting payments, especially in a restaurant or hotel setting.",
      "explanation_cn": "指负责收款或记账的人，尤其在餐厅或酒店环境中。",
      "example_en": "The hotel charger handled all guest billing and account settlements.",
      "example_cn": "酒店的收款员负责处理所有客人的账单和结算。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who receives a salary or payment, especially in historical or literary usage (archaic).",
      "explanation_cn": "（古语）指领取薪金或报酬的人，多用于历史或文学语境。",
      "example_en": "In medieval times, a knight was a charger of the king’s stipend.",
      "example_cn": "在中世纪，骑士是领取国王津贴的领取者。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "adapter",
      "analysis": "“Adapter”（适配器）主要用于连接不同接口或标准的设备，使它们能够物理或电气兼容，但不一定提供电力。而 “charger” 专门用于提供电能以充电，其核心功能是能量传输，而非接口转换。"
    },
    {
      "word_to_compare": "battery",
      "analysis": "“Battery”（电池）是储存电能的装置，而 “charger” 是为电池补充能量的外部设备。两者功能互补：电池是能量容器，充电器是能量注入工具。"
    },
    {
      "word_to_compare": "attacker",
      "analysis": "“Attacker”（攻击者）是泛指任何实施攻击的人或实体，语义范围更广，可涵盖网络攻击、言语攻击等。而 “charger” 在军事语境中特指‘冲锋者’，强调动作的迅猛和正面冲击，语义更具体、更具画面感。"
    }
  ]
}