{
  "word": "chartered",
  "pronunciation": "chahr·turd",
  "concise_definition": "adj. 经特许的, 有执照的, 由特许状设立的",
  "forms": {
    "comparative": "chartered",
    "superlative": "chartered"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Authorized by a royal charter or official grant, especially granting exclusive rights or privileges to an organization or individual to perform a specific function.",
      "explanation_cn": "指经由皇家特许状或官方授权，赋予某个组织或个人执行特定职能的专属权利或特权。",
      "example_en": "The chartered bank has been operating since 1820 under a royal charter.",
      "example_cn": "这家特许银行自1820年起依据皇家特许状运营。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Held by a professional who has been officially certified or licensed by a recognized body, often implying high standards of competence and ethics.",
      "explanation_cn": "指由公认机构正式认证或授予执照的专业人士，通常意味着具备高水平的专业能力和职业道德。",
      "example_en": "She is a chartered accountant with over 20 years of experience in corporate finance.",
      "example_cn": "她是一位拥有20多年企业财务经验的特许会计师。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Rented or hired for private use, especially for transportation services such as a chartered plane or bus.",
      "explanation_cn": "指为私人用途而租用的，尤指包租的飞机、巴士等交通工具。",
      "example_en": "We took a chartered flight to avoid the crowded commercial airlines.",
      "example_cn": "我们包了一架飞机，以避开拥挤的商业航班。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "licensed",
      "analysis": "“Licensed”（有执照的）泛指任何由政府或权威机构颁发的合法许可，适用范围广泛，如驾驶执照、营业许可。而 “chartered” 更强调由皇家或国家级权威机构授予的、具有历史传统和更高权威性的特许，通常用于专业头衔（如特许会计师）或机构（如特许银行）。"
    },
    {
      "word_to_compare": "certified",
      "analysis": "“Certified”（经认证的）指通过某种标准测试或评估后获得的资格证明，常用于教育、技术或安全领域（如认证工程师）。它侧重于能力验证，而 “chartered” 不仅包含认证，还隐含官方授权、行业垄断地位和终身荣誉性质，通常由专业学会授予并受法律保护。"
    },
    {
      "word_to_compare": "leased",
      "analysis": "“Leased”（租赁的）仅指通过合同租用物品或服务，如租赁汽车或房屋，不涉及任何官方授权或专业资格。而 “chartered” 在表示包租时，虽也指租赁，但常用于正式或高端语境（如包机），并隐含服务提供者具备专业资质或特殊许可，语义层次更高。"
    }
  ]
}