{
  "word": "character",
  "pronunciation": "kar·ik·tuhr",
  "concise_definition": "n. 性格, 人物, 字符, 品质",
  "forms": {
    "plural": "characters"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The combination of mental and moral qualities distinctive to an individual, including traits such as honesty, courage, or integrity that define how a person behaves and responds to situations.",
      "explanation_cn": "指一个人所特有的心理与道德品质的总和，包括诚实、勇气、正直等特质，决定了一个人的行为方式和对情境的反应。",
      "example_en": "Her strong character helped her overcome many challenges in life.",
      "example_cn": "她坚强的性格帮助她克服了人生中的许多挑战。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person portrayed in a story, play, film, or other narrative work, often with distinct personality traits, motivations, and development.",
      "explanation_cn": "指在故事、戏剧、电影或其他叙事作品中被塑造出来的人物，通常具有独特的性格特征、动机和发展轨迹。",
      "example_en": "The main character in the novel is a reluctant hero who grows into a leader.",
      "example_cn": "这部小说的主人公是一个起初不愿担当、最终成长为领袖的 reluctant hero。"
    },
    {
      "pos": "noun",
      "explanation_en": "A written or printed symbol, such as a letter, number, or punctuation mark, used in a language or computing system.",
      "explanation_cn": "指语言或计算机系统中使用的书写或印刷符号，如字母、数字或标点符号。",
      "example_en": "The password must be at least eight characters long and include special symbols.",
      "example_cn": "密码必须至少包含八个字符，并包含特殊符号。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person's moral or ethical standing; reputation for honesty and integrity.",
      "explanation_cn": "指一个人的道德或伦理地位，即其诚实与正直的声誉。",
      "example_en": "He lost the respect of his colleagues due to a lack of character.",
      "example_cn": "由于缺乏品格，他失去了同事们的尊重。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "personality",
      "analysis": "“Personality”（个性）侧重于一个人外显的行为模式、情绪反应和社交风格，如外向、内向、幽默等，通常是可观察的表层特征。而 “character” 更强调内在的道德品质和价值观，如正直、责任感，是判断一个人‘是否值得信赖’的核心。"
    },
    {
      "word_to_compare": "figure",
      "analysis": "“Figure”（人物）常用于指代公众人物或抽象意义上的代表，如历史人物、象征性人物，不一定有详细的心理描写。而 “character” 在文学语境中特指经过塑造、有动机和发展的叙事角色，内涵更丰富、更具体。"
    },
    {
      "word_to_compare": "symbol",
      "analysis": "“Symbol”（符号）是代表某种抽象概念或意义的标记，如红十字代表援助，心形代表爱。而 “character” 作为字符时，仅是语言或编码系统中的基本单位，本身不承载象征意义，除非被组合成词或语义单元。"
    }
  ]
}