{
  "word": "charters",
  "pronunciation": "chahr·turs",
  "concise_definition": "n. 特许状, 租约, 定期航班; v. 租用, 包租",
  "forms": {
    "singular": "charter"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A formal document issued by an authority (such as a government or monarch) granting specific rights, privileges, or powers to an individual, organization, or city.",
      "explanation_cn": "指由权威机构（如政府或君主）签发的正式文件，授予个人、组织或城市特定的权利、特权或权力。",
      "example_en": "The Magna Carta was a charter that limited the powers of the English king in 1215.",
      "example_cn": "《大宪章》是一份于1215年限制英格兰国王权力的特许状。"
    },
    {
      "pos": "noun",
      "explanation_en": "A contract for the temporary hire of a vehicle, vessel, or aircraft for a specific journey or period, often for a group or special purpose.",
      "explanation_cn": "指为特定旅程或时间段临时租用交通工具（如车辆、船只或飞机）的合同，通常用于团体出行或特殊用途。",
      "example_en": "We booked a charter flight to take our sports team to the championship.",
      "example_cn": "我们包了一架包机，把我们的运动队送到锦标赛现场。"
    },
    {
      "pos": "noun",
      "explanation_en": "A scheduled airline service operated on a fixed route and timetable, especially one that is not part of the regular commercial schedule.",
      "explanation_cn": "指在固定航线和时刻表上运营的定期航班，尤其指不属于常规商业航班的服务。",
      "example_en": "The island resort offers weekly charters from major cities.",
      "example_cn": "这个海岛度假村提供从各大城市出发的每周定期包机服务。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hire or rent a vehicle, vessel, or aircraft for exclusive use, typically for a specific trip or purpose.",
      "explanation_cn": "指为特定行程或用途而租用交通工具（如车辆、船只或飞机）供独家使用。",
      "example_en": "The company chartered a bus to transport employees to the conference.",
      "example_cn": "公司包了一辆大巴，运送员工去参加大会。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "contract",
      "analysis": "“Contract”（合同）泛指任何具有法律约束力的协议，涵盖广泛的服务、商品或劳动关系。而 “charter” 特指授予特权或租用交通工具的正式文件或协议，具有更强的专属性和特定用途。"
    },
    {
      "word_to_compare": "lease",
      "analysis": "“Lease”（租赁）通常指长期、有规律的财产使用权转让（如房屋或设备租赁），强调时间跨度和定期付款。而 “charter” 多用于短期、一次性或特殊目的的租用，尤其常见于运输工具，且常包含服务内容。"
    },
    {
      "word_to_compare": "license",
      "analysis": "“License”（许可证）是政府或机构授予的合法使用某项权利的许可（如驾驶、营业），侧重于合法性授权，不涉及财产或服务的租用。而 “charter” 不仅授权权利，还常包含实际资源的使用或运输安排。"
    }
  ]
}