{
  "word": "characters",
  "pronunciation": "kar·ik·tuhrz",
  "concise_definition": "n. 性格, 人物, 汉字, 字符",
  "forms": {
    "singular": "character"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The combination of mental and moral qualities distinctive to an individual, including personality traits, attitudes, and behaviors that define how a person acts or responds in various situations.",
      "explanation_cn": "指一个人所特有的心理与道德品质的总和，包括个性特征、态度和行为方式，决定了其在不同情境下的反应与表现。",
      "example_en": "Her strong character helped her overcome many challenges in life.",
      "example_cn": "她坚强的性格帮助她克服了人生中的许多挑战。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person portrayed in a story, play, film, or other narrative work, often with distinct traits, motivations, and development over time.",
      "explanation_cn": "指在故事、戏剧、电影或其他叙事作品中被塑造出来的人物，通常具有鲜明的特征、动机，并在情节发展中有所成长。",
      "example_en": "The main characters in the novel are deeply flawed but relatable.",
      "example_cn": "这部小说中的主要人物虽然有严重缺陷，但却令人产生共鸣。"
    },
    {
      "pos": "noun",
      "explanation_en": "A written symbol, especially one used in a writing system such as letters, numerals, or punctuation marks; in East Asian contexts, it often refers to Chinese characters.",
      "explanation_cn": "指书写系统中的一个符号，如字母、数字或标点符号；在东亚语境中，常指汉字。",
      "example_en": "Each Chinese character carries meaning and sound, unlike alphabetic letters.",
      "example_cn": "每个汉字都承载着意义和发音，这与字母文字不同。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "personality",
      "analysis": "“Personality”（个性）特指一个人外显的心理特征，如外向、内向、乐观等，侧重于情绪与行为倾向的总和。而 “character” 更强调道德品质、价值观和行为准则，具有更强的伦理判断色彩。一个人可以有迷人的个性但缺乏高尚的品格。"
    },
    {
      "word_to_compare": "figure",
      "analysis": "“Figure”（人物）在文学或公共语境中可指代某人，但通常更模糊，可能仅指身份或社会角色（如‘a public figure’），不一定包含内在性格或故事性。而 “character” 在叙事语境中必然包含心理深度和情节功能，是故事的有机组成部分。"
    },
    {
      "word_to_compare": "symbol",
      "analysis": "“Symbol”（符号）泛指代表某种抽象概念的标记，如红灯代表停止，心形代表爱。而 “character” 作为文字单位，是语言系统的基本构成元素，具有固定读音和语义，是符号的一种具体形式，但并非所有符号都是字符。"
    }
  ]
}