{
  "word": "chases",
  "pronunciation": "chayss",
  "concise_definition": "n. 追逐, 追求; v. 追逐, 追求 (第三人称单数)",
  "forms": {
    "base_form": "chase",
    "plural": "chases",
    "third_person_singular": "chases",
    "past_tense": "chased",
    "past_participle": "chased",
    "present_participle": "chasing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An act of pursuing someone or something, often with the intent to catch, capture, or reach them; can refer to physical pursuit or metaphorical striving.",
      "explanation_cn": "指追逐某人或某物的行为，通常旨在捕捉、捕获或达到目标；可指身体上的追赶，也可用于比喻意义上的追求。",
      "example_en": "The police were involved in a high-speed chase after the suspect fled the scene.",
      "example_cn": "嫌疑人逃离现场后，警方展开了一场高速追逐。"
    },
    {
      "pos": "noun",
      "explanation_en": "A repeated effort to attain or win something desirable, such as fame, love, or success, often implying persistence or obsession.",
      "explanation_cn": "指为获得某种理想事物（如名望、爱情或成功）而持续不断的努力，常带有执着甚至痴迷的意味。",
      "example_en": "His lifelong chases for artistic recognition led him to abandon a stable career.",
      "example_cn": "他对艺术认可的终生追求，使他放弃了稳定的职业。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pursue someone or something rapidly, especially on foot or in a vehicle, with the intention of catching up.",
      "explanation_cn": "指快速追赶某人或某物，尤其是步行或驾车，意图赶上或捕获。",
      "example_en": "The dog chases squirrels in the park every afternoon.",
      "example_cn": "每天下午，这只狗都会在公园里追逐松鼠。"
    },
    {
      "pos": "verb",
      "explanation_en": "To seek or strive for something persistently, often with enthusiasm or determination, such as a goal, dream, or person.",
      "explanation_cn": "指坚持不懈地追求某物，常带有热情或决心，如目标、梦想或某人。",
      "example_en": "She chases her dreams of becoming a professional dancer despite the odds.",
      "example_cn": "尽管困难重重，她仍执着追求成为专业舞者的梦想。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pursue",
      "analysis": "“Pursue” (追求/追踪) 更正式、更广泛，可用于抽象目标（如事业、理想）或具体对象（如逃犯），强调持续性和目的性。“Chases” 更具动态感和紧迫感，常用于物理追赶或带有强烈情感色彩的追求，语气更口语化、生动。"
    },
    {
      "word_to_compare": "hunt",
      "analysis": "“Hunt” (狩猎/搜寻) 通常暗示有预谋、系统性地寻找并捕获猎物，常用于动物或隐喻性的目标（如猎取信息）。“Chases” 更强调动作的即时性和速度，不一定包含计划性，且不必然以捕获为目的。"
    },
    {
      "word_to_compare": "follow",
      "analysis": "“Follow” (跟随) 指在后方保持距离地跟随，不必然有捕捉或超越的意图，语气中性甚至温和。而 “chases” 隐含主动逼近、试图赶上甚至超越的强烈意图，动作更激烈、更具对抗性。"
    }
  ]
}