{
  "word": "chase",
  "pronunciation": "chās",
  "concise_definition": "v. 追逐, 追赶; n. 追逐, 追捕",
  "forms": {
    "third_person_singular": "chases",
    "past_tense": "chased",
    "past_participle": "chased",
    "present_participle": "chasing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To pursue someone or something rapidly, often with the intent to catch, capture, or overtake.",
      "explanation_cn": "指迅速追赶某人或某物，通常意图抓住、捕获或超越。",
      "example_en": "The police chased the suspect down the street.",
      "example_cn": "警察沿着街道追赶嫌疑人。"
    },
    {
      "pos": "verb",
      "explanation_en": "To seek or strive for something persistently, often with determination or ambition, such as a goal, dream, or person.",
      "explanation_cn": "指坚持不懈地追求某物，如目标、梦想或某人，常带有决心或野心。",
      "example_en": "She chased her dream of becoming a professional dancer for over a decade.",
      "example_cn": "她为实现成为专业舞者的梦想奋斗了十多年。"
    },
    {
      "pos": "verb",
      "explanation_en": "To engage in the activity of hunting animals, typically by pursuing them on foot or with dogs.",
      "explanation_cn": "指通过步行或用猎犬追捕动物的狩猎行为。",
      "example_en": "The hounds chased the fox through the woods.",
      "example_cn": "猎犬在树林中追逐狐狸。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of pursuing someone or something, often implying speed, urgency, or intensity.",
      "explanation_cn": "指追赶某人或某物的行为，通常暗示速度、紧迫感或激烈程度。",
      "example_en": "The chase through the city lasted nearly twenty minutes.",
      "example_cn": "在城市中的追逐持续了将近二十分钟。"
    },
    {
      "pos": "noun",
      "explanation_en": "A period of persistent effort to achieve or obtain something, especially something difficult or elusive.",
      "explanation_cn": "指为实现或获得某物而持续努力的一段时间，尤指那些难以达成的目标。",
      "example_en": "His entire career has been a chase for recognition and artistic integrity.",
      "example_cn": "他整个职业生涯都是一场对认可与艺术完整性的追求。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pursue",
      "analysis": "“Pursue” (追求/追踪) 更广泛，可用于抽象目标（如事业、理想）或具体对象（如罪犯），语气较正式，不一定包含物理上的快速移动。而 “chase” 更强调动作的动态性、紧迫感和身体上的追赶，常用于具象场景，如追车、追狗。"
    },
    {
      "word_to_compare": "hunt",
      "analysis": "“Hunt” (狩猎) 通常指有计划、有目的的寻找并捕杀动物，强调策略和耐心，常与自然环境和传统狩猎相关。而 “chase” 更侧重于追逐过程本身，不必然包含捕杀意图，也可用于非动物对象（如追梦、追人）。"
    },
    {
      "word_to_compare": "follow",
      "analysis": "“Follow” (跟随) 是中性词，指在后方保持距离地移动，不带有紧迫、捕获或对抗的意图。例如跟随朋友、跟随指南。而 “chase” 隐含主动、急切甚至敌对的意图，目标是赶上或抓住，强度远高于 “follow”。"
    }
  ]
}