{
  "word": "cheats",
  "pronunciation": "cheets",
  "concise_definition": "n. 欺诈行为, 舞弊手段; v. 欺骗, 作弊",
  "forms": {
    "singular": "cheat",
    "third_person_singular": "cheats",
    "past_tense": "cheated",
    "past_participle": "cheated",
    "present_participle": "cheating"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An act or method of gaining an unfair advantage by breaking rules or deceiving others, especially in games, exams, or competitions.",
      "explanation_cn": "指通过违反规则或欺骗他人来获得不公平优势的行为或手段，尤其用于游戏、考试或竞赛中。",
      "example_en": "The student was caught using cheats to pass the online exam.",
      "example_cn": "这名学生因使用作弊手段通过在线考试而被发现。"
    },
    {
      "pos": "noun",
      "explanation_en": "A program or code used in video games to give players unfair advantages, such as unlimited health or weapons.",
      "explanation_cn": "指在电子游戏中使用的程序或代码，为玩家提供不公平的优势，如无限生命或武器。",
      "example_en": "Many online gamers avoid servers that are known to have widespread cheats.",
      "example_cn": "许多在线玩家会避开那些以广泛使用作弊程序而闻名的服务器。"
    },
    {
      "pos": "verb",
      "explanation_en": "To act dishonestly in order to gain an advantage, especially by violating rules or deceiving others.",
      "explanation_cn": "指通过不诚实的手段获取优势，尤其是通过违反规则或欺骗他人。",
      "example_en": "He cheated on the test by copying answers from his neighbor.",
      "example_cn": "他通过抄袭邻座的答案在考试中作弊。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fail to give someone what is due or promised, especially in matters of money or affection.",
      "explanation_cn": "指未能给予某人应得或承诺的东西，尤其在金钱或感情方面。",
      "example_en": "She felt he cheated her out of her inheritance by hiding assets.",
      "example_cn": "她觉得他通过隐瞒资产，骗走了她的遗产。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fraud",
      "analysis": "“Fraud”（欺诈）是法律术语，指有预谋的、系统性的欺骗行为，通常涉及金钱或法律权利，具有严重的法律后果。而 “cheat” 更常用于日常语境，范围更广，包括考试作弊、游戏作弊等非法律层面的欺骗行为。"
    },
    {
      "word_to_compare": "lie",
      "analysis": "“Lie”（说谎）指故意说假话，是一种言语欺骗，不一定涉及行为上的违规或利益获取。而 “cheat” 强调通过欺骗获得实际利益，通常伴随行为上的违规，如作弊、偷窃或背信。"
    },
    {
      "word_to_compare": "manipulate",
      "analysis": "“Manipulate”（操纵）指通过巧妙或不正当的手段影响他人行为或判断，常带有心理操控的意味，不一定违反明文规则。而 “cheat” 更直接地违反既定规则，强调结果上的不公平获取，行为更具可识别性。"
    }
  ]
}