{
  "word": "cheating",
  "pronunciation": "chee·ting",
  "concise_definition": "n. 欺诈, 舞弊, 骗局; v. 欺骗, 舞弊",
  "forms": {
    "base_form": "cheat",
    "third_person_singular": "cheats",
    "past_tense": "cheated",
    "past_participle": "cheated",
    "present_participle": "cheating"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of gaining an unfair advantage by breaking rules or using dishonest methods, especially in academic, competitive, or contractual contexts.",
      "explanation_cn": "指通过违反规则或使用不诚实手段获取不公平优势的行为，尤其常见于学术、竞赛或合同情境中。",
      "example_en": "The student was expelled for cheating on the final exam.",
      "example_cn": "这名学生因在期末考试中作弊而被开除。"
    },
    {
      "pos": "noun",
      "explanation_en": "A deceptive practice or trick used to mislead others for personal gain, often involving betrayal of trust.",
      "explanation_cn": "指为谋取私利而采用的欺骗性手段或伎俩，通常涉及对信任的背叛。",
      "example_en": "The company was accused of accounting cheating to inflate its profits.",
      "example_cn": "该公司被指控通过财务舞弊虚增利润。"
    },
    {
      "pos": "verb",
      "explanation_en": "To act dishonestly in order to gain an advantage, especially in a game, exam, or relationship.",
      "explanation_cn": "指为了获得优势而采取不诚实的行为，尤其在游戏、考试或人际关系中。",
      "example_en": "He cheated on his wife by having an affair with his colleague.",
      "example_cn": "他与同事有染，背叛了妻子。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fail to give someone what is due or promised, especially in matters of fairness or emotional commitment.",
      "explanation_cn": "指未能给予他人应得或承诺的东西，尤其在公平性或情感承诺方面。",
      "example_en": "She felt cheated when he didn't show up for their anniversary dinner.",
      "example_cn": "当他没有出席他们的周年纪念晚餐时，她感到被欺骗了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fraud",
      "analysis": "“Fraud” (欺诈) 是一个更正式、法律术语化的词，通常指有预谋的、系统性的欺骗行为，常涉及金钱或法律后果，如金融诈骗。而 “cheating” 更常用于日常语境，范围更广，包括考试作弊、感情不忠等非法律层面的欺骗行为。"
    },
    {
      "word_to_compare": "lying",
      "analysis": "“Lying” (说谎) 仅指通过言语制造虚假信息，是一种具体的欺骗手段。而 “cheating” 是更广泛的行为，可能包含说谎，但也包括使用工具、规避规则、偷看答案等非语言方式。说谎是 cheating 的一种可能形式，但 cheating 不一定是说谎。"
    },
    {
      "word_to_compare": "deception",
      "analysis": "“Deception” (欺骗) 是一个中性、抽象的名词，泛指任何使他人产生错误信念的行为，可以是善意的（如惊喜派对）或恶意的。而 “cheating” 带有强烈的道德谴责色彩，特指违反规则或信任以获取私利的欺骗行为，语义更负面、更具体。"
    }
  ]
}