{
  "word": "checking",
  "pronunciation": "chek·ing",
  "concise_definition": "n. 检查, 核对; v. 检查, 阻止, 控制 (check 的现在分词)",
  "forms": {
    "base_form": "check",
    "third_person_singular": "checks",
    "past_tense": "checked",
    "past_participle": "checked",
    "present_participle": "checking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of examining or verifying something to ensure accuracy, safety, or compliance with standards.",
      "explanation_cn": "指为确保准确性、安全性或符合标准而对某事物进行检查或核实的行为。",
      "example_en": "The airline requires a security checking before boarding.",
      "example_cn": "航空公司要求在登机前进行安全检查。"
    },
    {
      "pos": "noun",
      "explanation_en": "A printed or digital document used to authorize payment from a bank account, typically bearing the payer’s signature and the amount to be paid.",
      "explanation_cn": "指用于授权从银行账户付款的纸质或电子票据，通常包含付款人的签名和付款金额。",
      "example_en": "She deposited the checking into her savings account.",
      "example_cn": "她把这张支票存入了她的储蓄账户。"
    },
    {
      "pos": "verb",
      "explanation_en": "To stop, slow down, or restrain something or someone, often to prevent unwanted behavior or consequences.",
      "explanation_cn": "指阻止、减缓或控制某人或某物，通常是为了防止不良行为或后果。",
      "example_en": "The coach is checking the team’s aggressive play before it leads to penalties.",
      "example_cn": "教练正在遏制球队的激烈打法，以免导致犯规。"
    },
    {
      "pos": "verb",
      "explanation_en": "To verify or confirm the accuracy, truth, or condition of something by careful examination.",
      "explanation_cn": "指通过仔细检查来核实某事物的准确性、真实性或状况。",
      "example_en": "I’m checking the spelling of this document before submitting it.",
      "example_cn": "我在提交这份文件前正在核对拼写。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "inspection",
      "analysis": "“Inspection” (检查/检验) 更正式，常用于官方或专业语境，强调系统性、全面性的审查，如建筑检查、产品质检。而 “checking” 更通用，可指日常、临时或简单的核对行为，不一定具有正式程序。"
    },
    {
      "word_to_compare": "verifying",
      "analysis": "“Verifying” (核实) 侧重于确认某事是否真实或正确，常用于数据、身份、信息的确认，强调结果的准确性。而 “checking” 可包含更广泛的动作，如观察、测试、监控，不一定最终得出真假判断。"
    },
    {
      "word_to_compare": "monitoring",
      "analysis": "“Monitoring” (监控) 指持续、长期地观察某事物的状态变化，常用于系统、健康或环境领域。而 “checking” 通常是短暂、一次性的行为，目的是获取某一时刻的状态信息。"
    }
  ]
}