{
  "word": "checked",
  "pronunciation": "chek·t",
  "concise_definition": "adj. 检查过的, 格子的; v. 检查, 核对, 阻止 (check 的过去式和过去分词)",
  "forms": {
    "base_form": "check",
    "third_person_singular": "checks",
    "present_participle": "checking",
    "past_tense": "checked",
    "past_participle": "checked"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having a pattern of squares or rectangles, typically in two contrasting colors, often used to describe fabric or clothing.",
      "explanation_cn": "指具有由两种对比颜色组成的方格或矩形图案的，常用于描述布料或服装。",
      "example_en": "He wore a checked shirt with blue and white squares.",
      "example_cn": "他穿了一件蓝白相间的格子衬衫。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Having been examined, verified, or confirmed to be correct, safe, or acceptable.",
      "explanation_cn": "指经过检查、核实或确认为正确、安全或可接受的。",
      "example_en": "The luggage was checked for dangerous items before boarding.",
      "example_cn": "登机前，行李已检查是否有危险物品。"
    },
    {
      "pos": "verb",
      "explanation_en": "To examine or inspect something carefully to ensure it is correct, safe, or in good condition.",
      "explanation_cn": "指仔细检查某物以确保其正确性、安全性或良好状态。",
      "example_en": "The teacher checked the students' homework for accuracy.",
      "example_cn": "老师检查了学生的作业是否准确。"
    },
    {
      "pos": "verb",
      "explanation_en": "To stop or slow the progress or movement of something, often to prevent it from going too far.",
      "explanation_cn": "指阻止或减缓某事物的进展或移动，通常是为了防止其过度发展。",
      "example_en": "The government tried to check inflation by raising interest rates.",
      "example_cn": "政府通过提高利率来抑制通货膨胀。"
    },
    {
      "pos": "verb",
      "explanation_en": "To register or store something temporarily, especially luggage or coats, at a designated place.",
      "explanation_cn": "指将某物（如行李或外套）临时寄存于指定地点。",
      "example_en": "Please check your coat at the cloakroom.",
      "example_cn": "请把外套寄存在衣帽间。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "inspected",
      "analysis": "“Inspected” (检查) 更强调正式或专业的审查过程，常用于法律、工程或安全领域，带有权威性和程序性。而 “checked” 更通用，可用于日常情境，不一定需要正式流程。"
    },
    {
      "word_to_compare": "verified",
      "analysis": "“Verified” (核实) 强调通过证据或权威来源确认某事的真实性或准确性，结果通常是确定的。而 “checked” 可能仅是初步查看，不一定得出最终结论。"
    },
    {
      "word_to_compare": "patterned",
      "analysis": "“Patterned” (有图案的) 是一个更宽泛的形容词，泛指任何有重复图案的表面，包括条纹、波点、花卉等。而 “checked” 特指方格或棋盘状图案，语义更具体。"
    },
    {
      "word_to_compare": "restrained",
      "analysis": "“Restrained” (克制的) 强调抑制情绪或行为，常用于抽象语境。而 “checked” 在表示“阻止”时，更侧重于物理或进程上的控制，如阻止扩散、阻止增长，语义更具体且常用于客观情境。"
    }
  ]
}