{
  "word": "checks",
  "pronunciation": "chekz",
  "concise_definition": "n. 检查, 核对, 支票, 阻止; v. 检查, 核对, 阻止, 控制",
  "forms": {
    "singular": "check",
    "third_person_singular": "checks",
    "past_tense": "checked",
    "past_participle": "checked",
    "present_participle": "checking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An act of examining or verifying something to ensure accuracy, safety, or compliance with rules.",
      "explanation_cn": "指为确保准确性、安全性或符合规则而对某事物进行的检查或核对行为。",
      "example_en": "The airline requires a security check before boarding.",
      "example_cn": "航空公司要求在登机前进行安全检查。"
    },
    {
      "pos": "noun",
      "explanation_en": "A written order directing a bank to pay a specified amount of money from the writer’s account to the person named.",
      "explanation_cn": "指一种书面指令，要求银行从签发人的账户中支付指定金额给收款人，即支票。",
      "example_en": "She deposited the paycheck she received yesterday.",
      "example_cn": "她存入了昨天收到的工资支票。"
    },
    {
      "pos": "noun",
      "explanation_en": "A pattern of alternating squares, often in two colors, used in fabric, flooring, or design.",
      "explanation_cn": "指由两种颜色交替组成的方格图案，常用于布料、地板或设计中。",
      "example_en": "He wore a shirt with a classic black-and-white check pattern.",
      "example_cn": "他穿了一件经典的黑白方格衬衫。"
    },
    {
      "pos": "noun",
      "explanation_en": "A move in chess where the king is under threat of capture, requiring an immediate response.",
      "explanation_cn": "指国际象棋中王受到攻击的状态，必须立即采取应对措施。",
      "example_en": "The player put his opponent’s king in check with a well-timed knight move.",
      "example_cn": "这位选手通过一次精准的马步将对方的王将了一军。"
    },
    {
      "pos": "verb",
      "explanation_en": "To examine or verify something to ensure correctness, safety, or conformity.",
      "explanation_cn": "指检查或核实某事物以确保其正确性、安全性或符合规范。",
      "example_en": "Please check your answers before submitting the test.",
      "example_cn": "提交试卷前请核对你的答案。"
    },
    {
      "pos": "verb",
      "explanation_en": "To stop or slow the progress or growth of something, often to prevent excess or harm.",
      "explanation_cn": "指阻止或减缓某事物的发展或增长，通常是为了防止过度或造成伤害。",
      "example_en": "The government is trying to check inflation by raising interest rates.",
      "example_cn": "政府正通过提高利率来抑制通货膨胀。"
    },
    {
      "pos": "verb",
      "explanation_en": "To control or restrain one’s emotions, behavior, or impulses.",
      "explanation_cn": "指控制或抑制自己的情绪、行为或冲动。",
      "example_en": "She checked her anger and spoke calmly to the customer.",
      "example_cn": "她克制住怒气，平静地对顾客说话。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "inspection",
      "analysis": "“Inspection”（检查）更正式，通常指由权威机构或专业人员进行的系统性、全面的审查，如建筑检查或设备检测。而 “check” 更通用，可用于日常、非正式或快速的核对，范围更广但深度较浅。"
    },
    {
      "word_to_compare": "verify",
      "analysis": "“Verify”（核实）强调通过证据或权威来源确认某事的真实性，侧重于“确认正确性”。而 “check” 可以包含观察、测试、核对等多种行为，不一定涉及权威验证，语义更宽泛。"
    },
    {
      "word_to_compare": "brake",
      "analysis": "“Brake”（刹车）是物理意义上的减速或停止，常用于交通工具。而 “check” 作为动词表示“阻止”时，可指抽象事物（如情绪、趋势）的抑制，语义更广，且不局限于物理动作。"
    },
    {
      "word_to_compare": "bill",
      "analysis": "“Bill”（账单）是要求付款的清单，而 “check”（支票）是用于支付账单的金融工具。两者常在财务语境中关联，但功能相反：bill 是债务凭证，check 是清偿凭证。"
    }
  ]
}