{
  "word": "cheer",
  "pronunciation": "cheer",
  "concise_definition": "v. 欢呼, 鼓劲; n. 欢呼, 欢呼声, 精神振奋",
  "forms": {
    "third_person_singular": "cheers",
    "past_tense": "cheered",
    "past_participle": "cheered",
    "present_participle": "cheering"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To shout expressions of approval, encouragement, or celebration, typically in a group setting such as at a sports event or public gathering.",
      "explanation_cn": "指在群体场合（如体育赛事或公共集会）中大声喊出表示赞许、鼓励或庆祝的话语。",
      "example_en": "The crowd cheered loudly as the team scored the winning goal.",
      "example_cn": "当球队打进制胜一球时，观众们大声欢呼。"
    },
    {
      "pos": "verb",
      "explanation_en": "To encourage or uplift someone emotionally, often by offering words of support or optimism.",
      "explanation_cn": "指通过提供支持性或乐观的话语来鼓舞或提升某人的情绪。",
      "example_en": "Her kind words helped cheer up her grieving friend.",
      "example_cn": "她善意的话语帮助安慰了悲痛的朋友。"
    },
    {
      "pos": "noun",
      "explanation_en": "A loud expression of approval, encouragement, or celebration, often consisting of shouts, clapping, or chants.",
      "explanation_cn": "指一种响亮的赞许、鼓励或庆祝的表达方式，通常包括喊叫、鼓掌或口号。",
      "example_en": "The players received a rousing cheer from the fans after the victory.",
      "example_cn": "胜利后，球员们收到了球迷们热烈的欢呼。"
    },
    {
      "pos": "noun",
      "explanation_en": "A state of heightened spirits or optimism; a feeling of joy or encouragement.",
      "explanation_cn": "指情绪高涨、乐观的状态；一种喜悦或鼓舞的感觉。",
      "example_en": "Despite the setbacks, the team maintained their cheer and continued to fight.",
      "example_cn": "尽管遭遇挫折，球队仍保持高昂的士气，继续拼搏。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "applaud",
      "analysis": "“Applaud” (鼓掌) 通常指通过拍手表达赞赏，是一种更安静、更正式的反应，常见于剧院、演讲或音乐会等场合。而 “cheer” 更具喧闹性和情感强度，常伴随喊叫、跳跃等肢体动作，多用于体育或大众庆典场景。"
    },
    {
      "word_to_compare": "encourage",
      "analysis": "“Encourage” (鼓励) 是一个更广泛、更中性的动词，泛指通过言语或行动给予支持，不一定伴随声音或情绪外露。而 “cheer” 作为动词时，特指以积极、外向、有声的方式给予鼓励，带有更强的情感表现力和集体性。"
    },
    {
      "word_to_compare": "chant",
      "analysis": "“Chant” (齐声吟唱) 指有节奏地重复短语或口号，常用于抗议、宗教或体育场合，结构更固定、重复性强。而 “cheer” 更自由、更即兴，可以是喊叫、欢呼或简单地喊出名字，不一定有固定节奏。"
    }
  ]
}