{
  "word": "chelsea",
  "pronunciation": "chel·suh",
  "concise_definition": "n. 切尔西（专有名词，指地名、球队名或品牌名）",
  "forms": {
    "plural": "Chelseas"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A district in west London, England, known for its affluent residential areas, historic architecture, and cultural landmarks such as the Chelsea Physic Garden and the Royal Hospital Chelsea.",
      "explanation_cn": "英格兰伦敦西部的一个地区，以其富裕的住宅区、历史建筑和文化地标而闻名，如切尔西药用植物园和皇家切尔西医院。",
      "example_en": "She lives in Chelsea and loves the vibrant art scene there.",
      "example_cn": "她住在切尔西，喜欢那里充满活力的艺术氛围。"
    },
    {
      "pos": "noun",
      "explanation_en": "A professional football (soccer) club based in London, officially known as Chelsea Football Club, founded in 1905 and one of the most successful teams in English football history.",
      "explanation_cn": "一家位于伦敦的职业足球俱乐部，正式名称为切尔西足球俱乐部，成立于1905年，是英格兰足球历史上最成功的球队之一。",
      "example_en": "Chelsea won the UEFA Champions League in 2021 after a dramatic final against Manchester City.",
      "example_cn": "切尔西在2021年一场对阵曼城的激烈决赛后赢得了欧洲冠军联赛。"
    },
    {
      "pos": "noun",
      "explanation_en": "A style of boot or shoe, typically ankle-high with an elastic side panel, originally designed for Queen Victoria and later popularized as a fashion item.",
      "explanation_cn": "一种踝靴或鞋子，通常为踝高，侧面有弹性面板，最初为维多利亚女王设计，后成为时尚单品。",
      "example_en": "He wore his classic black Chelsea boots to the formal dinner.",
      "example_cn": "他穿着经典的黑色切尔西靴参加了正式晚宴。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "london",
      "analysis": "“London”（伦敦）是英国的首都和一个大型都市区，包含多个行政区，如切尔西、威斯敏斯特、南华克等。而 “Chelsea” 是伦敦的一个具体区域，是其组成部分，不具备伦敦的行政或地理广度。"
    },
    {
      "word_to_compare": "manchester",
      "analysis": "“Manchester”（曼彻斯特）是英格兰西北部的一座独立城市，以工业革命和足球文化著称，与切尔西在地理、历史和文化背景上完全不同。切尔西是伦敦的一部分，而曼彻斯特是独立的城市实体。"
    },
    {
      "word_to_compare": "boots",
      "analysis": "“Boots”（靴子）是泛指所有覆盖脚踝以上的鞋类，而 “Chelsea boots” 是一种特定款式的靴子，具有弹性侧边和无鞋带设计。因此，Chelsea 是 boots 的一个子类，具有明确的风格和历史渊源。"
    }
  ]
}