{
  "word": "chemicals",
  "pronunciation": "kem·uh·lihls",
  "concise_definition": "n. 化学物质, 化学品",
  "forms": {
    "singular": "chemical"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Substances that have a definite composition and are produced or used in chemical reactions, often in industrial, laboratory, or household contexts.",
      "explanation_cn": "指具有确定组成、在化学反应中产生或使用的物质，常用于工业、实验室或家庭环境中。",
      "example_en": "The factory must handle hazardous chemicals with strict safety protocols.",
      "example_cn": "工厂必须用严格的安全规程处理危险化学品。"
    },
    {
      "pos": "noun",
      "explanation_en": "Synthetic or naturally occurring substances used to alter or improve the properties of other materials, such as in cleaning, agriculture, or medicine.",
      "explanation_cn": "指用于改变或改善其他材料性能的合成或天然物质，例如在清洁、农业或医药领域中使用。",
      "example_en": "Organic farmers avoid synthetic chemicals and rely on natural fertilizers instead.",
      "example_cn": "有机农民避免使用合成化学品，转而依赖天然肥料。"
    },
    {
      "pos": "noun",
      "explanation_en": "Colloquially, refers to substances that affect emotions or behavior, especially in the context of romantic or interpersonal attraction.",
      "explanation_cn": "口语中指影响情绪或行为的物质，尤其在浪漫或人际吸引的语境中，常指‘荷尔蒙’或‘化学反应’。",
      "example_en": "There was an instant chemistry between them — it was pure chemicals.",
      "example_cn": "他们之间一见钟情——那纯粹是化学反应。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "substances",
      "analysis": "“Substances”（物质）是一个更广泛的术语，泛指任何具有质量和体积的物质，包括元素、化合物、混合物等，不限于化学反应。而 “chemicals” 特指参与或用于化学过程的物质，通常具有特定的分子结构和反应性，范围更窄、更专业。"
    },
    {
      "word_to_compare": "compounds",
      "analysis": "“Compounds”（化合物）特指由两种或更多种元素通过化学键结合形成的纯净物，如水（H₂O）、食盐（NaCl）。而 “chemicals” 可以包括化合物，也可以包括元素、混合物或溶液，因此 “compounds” 是 “chemicals” 的一个子集。"
    },
    {
      "word_to_compare": "toxins",
      "analysis": "“Toxins”（毒素）是特指由生物体产生的、对生命体有害的化学物质，如蛇毒、霉菌毒素。虽然所有毒素都是化学品，但并非所有化学品都是毒素。 “Chemicals” 是中性术语，可指有益、中性或有害的物质，而 “toxins” 专指有害性。"
    }
  ]
}