{
  "word": "chemistry",
  "pronunciation": "kem·is·tree",
  "concise_definition": "n. 化学, 化学物质, 人与人之间的吸引力",
  "forms": {
    "plural": "chemistries"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The scientific study of the composition, structure, properties, and reactions of matter, especially of atomic and molecular systems.",
      "explanation_cn": "研究物质的组成、结构、性质及其反应的科学，尤其关注原子和分子系统。",
      "example_en": "She is pursuing a degree in chemistry with a focus on organic synthesis.",
      "example_cn": "她正在攻读化学学位，专攻有机合成。"
    },
    {
      "pos": "noun",
      "explanation_en": "The chemical substances or processes involved in a particular reaction or material, often used in plural form to refer to specific compounds or interactions.",
      "explanation_cn": "指特定反应或物质中涉及的化学物质或过程，常以复数形式表示具体的化合物或相互作用。",
      "example_en": "The chemistry of the battery determines its efficiency and lifespan.",
      "example_cn": "电池的化学成分决定了它的效率和使用寿命。"
    },
    {
      "pos": "noun",
      "explanation_en": "A strong mutual attraction or rapport between people, often implying an unexplainable emotional or interpersonal connection.",
      "explanation_cn": "指人与人之间强烈的相互吸引力或默契，通常暗示一种难以言喻的情感或人际联系。",
      "example_en": "There was an instant chemistry between the two actors on stage.",
      "example_cn": "两位演员在舞台上一见面就产生了奇妙的化学反应。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "chemical",
      "analysis": "“Chemical” (化学的/化学物质) 是形容词或名词，指具体的化学物质或与化学相关的特性，如“a chemical reaction”（化学反应）。“Chemistry” 是一个更广泛的学科名称或抽象概念，涵盖化学的原理、过程和相互作用，而不仅仅是单个物质。"
    },
    {
      "word_to_compare": "reaction",
      "analysis": "“Reaction” (反应) 指化学或物理变化中发生的特定过程或结果，是“chemistry”研究的一个组成部分。例如，酸碱中和是一个“reaction”，而“chemistry”则包括理解为什么这个反应会发生、涉及哪些分子机制等。前者是现象，后者是学科体系。"
    },
    {
      "word_to_compare": "attraction",
      "analysis": "“Attraction” (吸引力) 是一个通用词，可指物理、情感或社会层面的吸引，而“chemistry”在人际语境中特指一种自然、微妙且往往不可言传的情感共鸣，比“attraction”更强调互动性和潜意识的契合，常用于描述人际关系中的‘火花’。"
    }
  ]
}