{
  "word": "cherry",
  "pronunciation": "cher·ee",
  "concise_definition": "n. 樱桃, 樱桃树, 顶点, 点缀物",
  "forms": {
    "plural": "cherries"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small, round, red or dark purple fruit with a single seed, known for its sweet or tart flavor and commonly eaten fresh or used in desserts and jams.",
      "explanation_cn": "一种小型圆形水果，呈红色或深紫色，内含一颗种子，味道甜美或微酸，常被新鲜食用或用于甜点和果酱中。",
      "example_en": "She picked a basket of ripe cherries from the tree in her backyard.",
      "example_cn": "她从后院的树上摘了一篮子熟透的樱桃。"
    },
    {
      "pos": "noun",
      "explanation_en": "The cherry tree, a deciduous tree that produces cherries and is often cultivated for its ornamental blossoms as well as its fruit.",
      "explanation_cn": "指樱桃树，一种落叶乔木，既结果实，也因其观赏性的花朵而被广泛栽培。",
      "example_en": "In spring, the cherry blossoms in Kyoto attract thousands of tourists every year.",
      "example_cn": "每年春天，京都的樱花都会吸引成千上万的游客。"
    },
    {
      "pos": "noun",
      "explanation_en": "Something that is the best or most desirable part of a whole, often used metaphorically to denote a prized or perfect element.",
      "explanation_cn": "比喻指某事物中最优秀、最理想的部分，常用于形容珍贵或完美的元素。",
      "example_en": "Winning the championship was the cherry on top of an already perfect season.",
      "example_cn": "赢得冠军为这个已经完美的赛季画上了完美的句号。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small decorative red ball or ornament placed on top of a Christmas tree or other festive display, symbolizing a festive touch.",
      "explanation_cn": "指装饰在圣诞树或其他节日布置顶部的小型红色球状装饰物，象征节日气氛。",
      "example_en": "The top of the tree was crowned with a shiny red cherry.",
      "example_cn": "树顶上装饰着一颗闪亮的红色樱桃状装饰物。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fruit",
      "analysis": "“Fruit”（水果）是泛指植物的果实，涵盖苹果、香蕉、橙子等所有可食用果实，而 “cherry” 是特指一种具体的小型核果，具有独特的风味和形态。因此，cherry 是 fruit 的一个具体子类。"
    },
    {
      "word_to_compare": "blossom",
      "analysis": "“Blossom”（花）指植物开花的状态或花朵本身，尤其常用于描述樱花等观赏性花朵。虽然 cherry tree 会开 blossom，但 blossom 本身不是果实，而 cherry 是其果实。两者是同一植物的不同生长阶段产物。"
    },
    {
      "word_to_compare": "topping",
      "analysis": "“Topping”（顶部装饰）泛指任何加在食物或物品顶部的装饰物，如冰淇淋上的巧克力酱、蛋糕上的奶油。而 “cherry” 作为 topping 是一种特定的、传统上用于甜点顶部的红色水果装饰，具有文化象征意义，比一般 topping 更具标志性。"
    }
  ]
}