{
  "word": "chesapeake",
  "pronunciation": "chē·ə·pēk",
  "concise_definition": "n. 切萨皮克（美国地名，常指切萨皮克湾）",
  "forms": {
    "plural": "chesapeakes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A large estuary and bay on the east coast of the United States, formed by the confluence of several major rivers including the Susquehanna, Potomac, and James, and bordered by Maryland and Virginia.",
      "explanation_cn": "位于美国东海岸的一个大型河口湾，由萨斯奎哈纳河、波托马克河和詹姆斯河等多条主要河流汇流而成，毗邻马里兰州和弗吉尼亚州。",
      "example_en": "The Chesapeake Bay is home to one of the largest oyster populations in the world.",
      "example_cn": "切萨皮克湾是世界上最大牡蛎种群之一的栖息地。"
    },
    {
      "pos": "noun",
      "explanation_en": "A breed of dog originally developed in the United States, particularly in the Chesapeake Bay region, known for its strong swimming ability and water-resistant coat.",
      "explanation_cn": "一种原产于美国切萨皮克湾地区的犬种，以出色的游泳能力和防水被毛著称。",
      "example_en": "The Chesapeake Bay Retriever is prized by waterfowl hunters for its endurance and loyalty.",
      "example_cn": "切萨皮克湾寻回犬因其耐力和忠诚而深受水禽猎人的青睐。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of blue crab native to the Chesapeake Bay, highly valued in regional cuisine, especially for its sweet, tender meat.",
      "explanation_cn": "一种原产于切萨皮克湾的蓝蟹，因其甜美嫩滑的肉质而在当地菜肴中备受推崇。",
      "example_en": "Fresh Chesapeake blue crabs are a summer delicacy in Maryland.",
      "example_cn": "新鲜的切萨皮克蓝蟹是马里兰州夏季的美味佳肴。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bay",
      "analysis": "“Bay”（海湾）是一个通用地理术语，泛指海洋或湖泊向陆地凹入的部分。而 “Chesapeake” 是一个专有名词，特指美国东海岸那个具体的、具有生态和文化意义的河口湾，不能与其他海湾互换使用。"
    },
    {
      "word_to_compare": "estuary",
      "analysis": "“Estuary”（河口）是水文地理学术语，指淡水河流与海水交汇的区域。虽然切萨皮克湾是一个典型的河口，但 “Chesapeake” 不仅指其水文特征，还承载了历史、经济和文化内涵，如渔业、航运和生态保护运动。"
    },
    {
      "word_to_compare": "retriever",
      "analysis": "“Retriever”（寻回犬）是一类犬的总称，包括拉布拉多、金毛等。而 “Chesapeake” 是一个特定品种的名称，特指切萨皮克湾寻回犬，具有独特的毛色、体型和工作特性，不能泛指其他寻回犬。"
    }
  ]
}