{
  "word": "chipping",
  "pronunciation": "chip·ing",
  "concise_definition": "n. 碎片, 剥落; v. 凿碎, 削片, 剥落",
  "forms": {
    "base_form": "chip",
    "third_person_singular": "chips",
    "past_tense": "chipped",
    "past_participle": "chipped",
    "present_participle": "chipping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small piece that has been broken off from a harder material, such as stone, wood, ceramic, or ice, often due to impact or wear.",
      "explanation_cn": "指从较硬的材料（如石头、木头、陶瓷或冰）上因撞击或磨损而脱落下来的小碎片。",
      "example_en": "The edge of the porcelain plate had a small chipping from being dropped.",
      "example_cn": "瓷盘的边缘因掉落而出现了一小块剥落。"
    },
    {
      "pos": "noun",
      "explanation_en": "In golf, a short, low shot played with a wedge or iron to get the ball onto the green with minimal roll.",
      "explanation_cn": "在高尔夫中，指用挖起杆或铁杆打出的一种短而低平的击球，目的是让球落在果岭上并尽量减少滚动。",
      "example_en": "He executed a perfect chipping from just off the green to sink the putt.",
      "example_cn": "他在果岭边缘打出一记完美的切球，最终将球推入洞中。"
    },
    {
      "pos": "verb",
      "explanation_en": "To break off small pieces from a hard surface or object, typically by striking it with a tool or through accidental impact.",
      "explanation_cn": "指通过敲击或意外撞击，使坚硬表面或物体脱落小碎片。",
      "example_en": "The hammer accidentally chipped the marble countertop.",
      "example_cn": "锤子不小心把大理石台面敲出了一道缺口。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove small amounts of material from a surface, especially in woodworking, stone carving, or digital modeling, to shape or refine it.",
      "explanation_cn": "指从表面去除少量材料，常用于木工、石雕或数字建模中，以塑形或精修物体。",
      "example_en": "The sculptor spent hours chipping away at the block of granite to reveal the statue within.",
      "example_cn": "雕塑家花了数小时凿去花岗岩块的多余部分，以显现出内部的雕像。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cracking",
      "analysis": "“Cracking”（开裂）指物体表面出现裂缝，但未完全分离出碎片，通常是一种线性损伤；而 “chipping” 强调的是小块材料被物理性地剥离或脱落，属于局部断裂。例如，玻璃裂了是 cracking，但掉了一角就是 chipping。"
    },
    {
      "word_to_compare": "flaking",
      "analysis": "“Flaking”（剥落）通常指薄层材料因老化、腐蚀或干燥而片状脱落，如油漆剥落或皮肤脱皮，过程较缓慢且呈片状；而 “chipping” 更多由外力冲击引起，碎片形状不规则、体积较小，动作更突然。"
    },
    {
      "word_to_compare": "shaving",
      "analysis": "“Shaving”（削薄）指有目的地、均匀地去除一层薄薄的材料，如剃须或用刨刀削木头，强调控制与平整；而 “chipping” 是非均匀、不规则的碎片脱落，常为意外或粗放操作的结果，缺乏精细控制。"
    }
  ]
}