{
  "word": "chipped",
  "pronunciation": "chip·t",
  "concise_definition": "adj. 缺角的, 有裂痕的, 碎片的",
  "forms": {
    "base_form": "chip",
    "present_participle": "chipping",
    "past_tense": "chipped",
    "past_participle": "chipped"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having a small piece broken off or a notch made in the surface, typically due to impact or wear; describing damage to hard materials like ceramic, glass, or stone.",
      "explanation_cn": "指因撞击或磨损导致表面出现小块脱落或缺口，常用于描述陶瓷、玻璃或石头等硬质材料的破损状态。",
      "example_en": "She carefully cleaned the chipped edge of the porcelain cup.",
      "example_cn": "她仔细清理了瓷杯缺角的边缘。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Having a distinctive pattern of small cracks or fractures, often seen in paint, glaze, or ancient pottery, sometimes intentionally created for aesthetic effect.",
      "explanation_cn": "指表面带有细小裂纹或断裂纹路，常见于油漆、釉面或古陶瓷，有时为追求美学效果而刻意制造。",
      "example_en": "The antique vase had a beautiful chipped glaze that added to its vintage charm.",
      "example_cn": "这尊古董花瓶的釉面布满细密裂纹，反而增添了其复古魅力。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Made of or consisting of small fragments or pieces, often used in culinary contexts to describe food that has been broken into bits.",
      "explanation_cn": "指由小碎片或碎块组成，常用于烹饪语境，描述被碾碎或掰成小块的食物。",
      "example_en": "He sprinkled chipped ice over the cocktail for a refreshing chill.",
      "example_cn": "他在鸡尾酒上撒了些碎冰，增添清凉口感。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cracked",
      "analysis": "“Cracked”（有裂纹的）强调物体表面出现裂缝，但未失去碎片，通常指连续性被破坏但结构仍基本完整；而 “chipped” 指有物质被剥离或缺失，形成缺口或碎屑，破坏更具体、更局部。"
    },
    {
      "word_to_compare": "broken",
      "analysis": "“Broken”（破碎的）是更宽泛的词，可指完全断裂、碎裂或损坏，程度更严重；而 “chipped” 仅指轻微、局部的缺损，通常不影响整体功能，语义更轻、更具体。"
    },
    {
      "word_to_compare": "flaked",
      "analysis": "“Flaked”（剥落的）强调薄片状物质从表面层层脱落，如油漆或皮肤脱皮，常呈片状、层状；而 “chipped” 多为块状、不规则的碎片脱落，多由外力撞击造成，形态更粗犷。"
    }
  ]
}