{
  "word": "chips",
  "pronunciation": "chipz",
  "concise_definition": "n. 薯片, 芯片, 碎片, 木片",
  "forms": {
    "singular": "chip"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Thin, crispy slices of potato, typically fried or baked and salted, served as a snack or side dish.",
      "explanation_cn": "薄而脆的土豆片，通常经过油炸或烘烤并加盐，作为零食或配菜食用。",
      "example_en": "She ate a bag of salted chips while watching the movie.",
      "example_cn": "她看电影时吃了一袋咸味薯片。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small piece of semiconductor material, usually silicon, that contains integrated circuits and is used in electronic devices such as computers and smartphones.",
      "explanation_cn": "一种由半导体材料（通常是硅）制成的小型芯片，内含集成电路，用于计算机、智能手机等电子设备中。",
      "example_en": "The new smartphone uses a more powerful chip to improve performance.",
      "example_cn": "这款新智能手机使用了更强大的芯片以提升性能。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small fragment or piece broken off from a larger object, such as wood, glass, or ceramic.",
      "explanation_cn": "从较大物体上脱落下来的小碎片，如木片、玻璃片或陶瓷片。",
      "example_en": "A chip of paint fell off the old door when I touched it.",
      "example_cn": "我一碰那扇旧门，就有一小片油漆掉了下来。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, flat, colored token used in gambling, especially in casinos, to represent a monetary value.",
      "explanation_cn": "一种用于赌博（尤其在赌场中）的小型彩色代币，代表特定的货币价值。",
      "example_en": "He exchanged $100 for red chips at the poker table.",
      "example_cn": "他在扑克桌旁用100美元换了一堆红色筹码。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "crisps",
      "analysis": "“Crisps” 是英式英语中对 “chips”（薯片）的称呼，两者在指代油炸土豆片时含义完全相同，但使用地域不同。美式英语中 “chips” 指薯片，而 “crisps” 在美国通常指其他类型的脆性零食（如饼干）。"
    },
    {
      "word_to_compare": "fragments",
      "analysis": "“Fragments”（碎片）是更广泛的术语，泛指任何被打破或分离的不完整部分，可用于抽象或具体语境（如记忆碎片、语言碎片）。而 “chip” 更强调小块、边缘破损或局部脱落的物理形态，常带有坚硬、脆性材料的语义特征。"
    },
    {
      "word_to_compare": "microchips",
      "analysis": "“Microchips” 是 “chips” 在电子领域的具体子类，特指尺寸极小、集成度极高的集成电路芯片。虽然日常语境中 “chip” 可指代电子芯片，但 “microchip” 更精确，强调其微型化和高科技属性，常用于科技文献中。"
    }
  ]
}