{
  "word": "choked",
  "pronunciation": "choht",
  "concise_definition": "v. 窒息, 堵塞, 哽咽, 使无法发声",
  "forms": {
    "base_form": "choke",
    "third_person_singular": "chokes",
    "present_participle": "choking",
    "past_tense": "choked",
    "past_participle": "choked"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To be unable to breathe because the airway is blocked, either by an object, fluid, or swelling; can also refer to the act of causing such a blockage.",
      "explanation_cn": "因气道被物体、液体或肿胀物阻塞而无法呼吸；也可指导致这种阻塞的行为。",
      "example_en": "He was choked by a piece of meat and had to be rushed to the hospital.",
      "example_cn": "他被一块肉噎住，不得不被紧急送往医院。"
    },
    {
      "pos": "verb",
      "explanation_en": "To obstruct or clog a passage, pipe, or opening so that flow is prevented or restricted.",
      "explanation_cn": "堵塞通道、管道或开口，使流体或物质无法通过或流通受限。",
      "example_en": "The drain was choked with leaves and dirt after the storm.",
      "example_cn": "暴风雨后，排水管被树叶和泥土堵住了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To speak with difficulty, often due to emotion, such as sadness, fear, or excitement, resulting in a tight or broken voice.",
      "explanation_cn": "因情绪（如悲伤、恐惧或激动）而说话困难，声音变得哽咽或断断续续。",
      "example_en": "She choked out the words, 'I love you,' through tears.",
      "example_cn": "她泪流满面，哽咽着说出：‘我爱你。’"
    },
    {
      "pos": "verb",
      "explanation_en": "To fail to perform under pressure, especially in a critical moment, often used in sports or competitive contexts.",
      "explanation_cn": "在关键时刻因压力而表现失常，常用于体育或竞争性情境中。",
      "example_en": "The star player choked during the final penalty kick and missed the goal.",
      "example_cn": "这位明星球员在最后的点球中发挥失常，错失了进球。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "suffocate",
      "analysis": "“Suffocate” (窒息) 侧重于因缺氧而导致的呼吸困难或死亡，通常指环境或外部条件（如烟雾、密闭空间）造成的生理性窒息，不强调物理性阻塞。而 “choked” 更常指气道被具体物体（如食物、异物）堵塞，动作性更强。"
    },
    {
      "word_to_compare": "clog",
      "analysis": "“Clog” (堵塞) 通常用于描述固体物质缓慢堆积导致通道不畅，如淤泥堵塞河道、胶水堵塞笔尖，强调堆积过程和缓慢性。而 “choked” 更强调突然性、严重性，甚至可能引发危险，常用于紧急或剧烈情境。"
    },
    {
      "word_to_compare": "stifle",
      "analysis": "“Stifle” (压抑/抑制) 可指压抑情感（如笑声、哭声）或抑制发展（如创新），多用于抽象语境。而 “choked” 在表达情感哽咽时更偏向生理反应，且在“表现失常”义项中更具行为后果的负面评价色彩。"
    },
    {
      "word_to_compare": "strangle",
      "analysis": "“Strangle” (勒死) 指用外力（如绳索、手）压迫颈部导致窒息，通常是故意的暴力行为。而 “choked” 可以是意外（如被食物噎住）或非暴力的（如管道堵塞），语义范围更广，不必然涉及人身攻击。"
    }
  ]
}