{
  "word": "choke",
  "pronunciation": "chohk",
  "concise_definition": "v. 窒息, 呛住, 堵塞; n. 窒息, 堵塞",
  "forms": {
    "third_person_singular": "chokes",
    "past_tense": "choked",
    "past_participle": "choked",
    "present_participle": "choking"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To have difficulty breathing because the airway is blocked, often by food, liquid, or an object; can also refer to the act of causing such blockage.",
      "explanation_cn": "因气道被食物、液体或异物堵塞而呼吸困难；也可指导致这种堵塞的行为。",
      "example_en": "He choked on a piece of meat and had to be helped immediately.",
      "example_cn": "他被一块肉噎住，必须立即施救。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fail to perform under pressure, especially in a critical moment, often due to anxiety or stress.",
      "explanation_cn": "在关键时刻因焦虑或压力而表现失常、无法发挥正常水平。",
      "example_en": "She choked during the final round of the competition and missed the winning shot.",
      "example_cn": "她在比赛的最后一轮中紧张失常，错失了制胜一球。"
    },
    {
      "pos": "verb",
      "explanation_en": "To block or obstruct the flow of something, such as a pipe, road, or passage.",
      "explanation_cn": "堵塞或阻碍某物的流动，如管道、道路或通道。",
      "example_en": "The drain was choked with leaves and dirt.",
      "example_cn": "排水管被树叶和泥土堵住了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A state of being unable to breathe due to obstruction; also refers to the act of choking or the obstruction itself.",
      "explanation_cn": "因气道阻塞而无法呼吸的状态；也可指窒息行为或阻塞物本身。",
      "example_en": "The child had a near-fatal choke after swallowing a marble.",
      "example_cn": "孩子吞下一颗弹珠后几乎窒息身亡。"
    },
    {
      "pos": "noun",
      "explanation_en": "A narrow or constricted part of a passage, pipe, or structure that restricts flow.",
      "explanation_cn": "通道、管道或结构中狭窄或收窄的部分，用于限制流动。",
      "example_en": "The choke on the carburetor controls the air-fuel mixture during engine startup.",
      "example_cn": "化油器上的阻风门控制发动机启动时的空燃混合比。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "suffocate",
      "analysis": "“Suffocate” (窒息) 更强调因缺氧而导致的生理性窒息，通常指环境缺氧（如密闭空间）或外部压迫（如被压住胸部），不一定是气道被异物堵塞。而 “choke” 更常指气道被物理性阻塞，如食物卡喉。"
    },
    {
      "word_to_compare": "strangle",
      "analysis": "“Strangle” (勒死) 指用外力（如绳索、手）压迫颈部导致窒息，通常是故意的暴力行为。而 “choke” 可以是意外（如吃东西噎住）或非暴力的（如紧张导致表现失常），范围更广。"
    },
    {
      "word_to_compare": "clog",
      "analysis": "“Clog” (堵塞) 通常用于描述固体物质缓慢堆积导致管道、通道不畅，如泥浆堵塞下水道。它强调缓慢、累积性的阻塞，语气较轻。而 “choke” 更强调突然、严重的阻塞，常带有危险或紧急的语义色彩。"
    },
    {
      "word_to_compare": "freeze up",
      "analysis": "“Freeze up” (僵住) 常用于心理层面，形容人在压力下因恐惧或紧张而完全无法行动或思考，多用于口语。而 “choke” 在此语境中更强调因压力导致的技能性失败，如运动员失误，带有更强的“表现崩盘”意味。"
    }
  ]
}