{
  "word": "chopper",
  "pronunciation": "chop·er",
  "concise_definition": "n. 直升机, 切碎机, 刀具, 电锯",
  "forms": {
    "plural": "choppers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A rotary-wing aircraft that uses rotating blades to generate lift and propulsion, commonly used for transportation, rescue, or military operations.",
      "explanation_cn": "一种依靠旋转叶片产生升力和推进力的旋翼飞机，常用于运输、救援或军事行动。",
      "example_en": "The rescue team arrived by chopper just before the storm hit.",
      "example_cn": "救援队在风暴来临前乘直升机抵达。"
    },
    {
      "pos": "noun",
      "explanation_en": "A kitchen appliance or tool used to chop, mince, or puree food, typically with a rotating blade at the bottom of a container.",
      "explanation_cn": "一种厨房用具，通过底部旋转刀片将食物切碎、剁碎或搅成泥状。",
      "example_en": "She used a chopper to finely dice the onions for the salsa.",
      "example_cn": "她用切碎机将洋葱切成细丁，用来制作莎莎酱。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of heavy-duty knife or blade, especially one used for cutting through tough materials like meat or bone, or a slang term for a chainsaw.",
      "explanation_cn": "一种重型刀具，常用于切割肉类或骨头，也可作为电锯的俚语说法。",
      "example_en": "The butcher swung his chopper with precision to separate the ribs.",
      "example_cn": "屠夫精准地挥动他的砍骨刀，将肋骨分开。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slang term for a customized motorcycle, especially one with a long front end and low seat, popular in American biker culture.",
      "explanation_cn": "美国机车文化中对经过改装的摩托车的俚语称呼，通常具有长前叉和低坐垫。",
      "example_en": "He spent years building his dream chopper, with chrome pipes and a custom paint job.",
      "example_cn": "他花了数年时间打造自己梦想中的改装摩托车，配有镀铬排气管和定制喷漆。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "helicopter",
      "analysis": "“Helicopter” 是 “chopper” 在指代旋翼飞机时的正式术语，语体更中性或书面化；而 “chopper” 是口语化、非正式的表达，常用于日常对话或媒体中，带有更强烈的形象感和随意性。"
    },
    {
      "word_to_compare": "food processor",
      "analysis": "“Food processor”（食物处理器）功能更全面，可切片、搅拌、揉面等，是多功能厨房电器；而 “chopper” 通常仅指用于切碎的简单工具，结构更基础，操作更直接。"
    },
    {
      "word_to_compare": "chainsaw",
      "analysis": "“Chainsaw”（电锯）是专业伐木工具，使用链条切割木材，结构和用途明确；而 “chopper” 作为电锯的俚语用法，语义模糊，可能泛指任何强力切割工具，不具技术准确性。"
    }
  ]
}