{
  "word": "chopping",
  "pronunciation": "chop·ing",
  "concise_definition": "n. 砍伐, 切碎; v. 砍, 切碎 (chop 的现在分词)",
  "forms": {
    "base_form": "chop",
    "third_person_singular": "chops",
    "past_tense": "chopped",
    "past_participle": "chopped",
    "present_participle": "chopping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The action of cutting something into small pieces, especially food, using a sharp tool such as a knife or axe; often refers to the style or method of cutting.",
      "explanation_cn": "指用刀或斧头等锋利工具将某物（尤指食物）切成小块的动作；常指切碎的方式或风格。",
      "example_en": "The chef's chopping technique was fast and precise, reducing the vegetables to uniform dice.",
      "example_cn": "厨师的切碎技巧迅速而精准，将蔬菜切成大小均匀的方块。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of woodcutting or tree-felling activity, especially in forestry or rural settings; can also refer to the cleared land resulting from such activity.",
      "explanation_cn": "指在林业或乡村环境中进行的砍伐树木或伐木活动；也可指由此产生的被清理的土地。",
      "example_en": "The forest was quiet after months of chopping, but the stumps remained as reminders of the work done.",
      "example_cn": "经过数月的砍伐后，森林一片寂静，但树桩仍提醒着人们曾经的劳作。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cut or strike something repeatedly with a sharp instrument, especially to reduce it into smaller pieces.",
      "explanation_cn": "指用锋利的工具反复砍或击打某物，尤指将其切成小块。",
      "example_en": "She was chopping onions for the stew while humming a tune.",
      "example_cn": "她一边哼着歌，一边切洋葱准备炖菜。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cutting",
      "analysis": "“Cutting” (切割) 是更广泛的术语，泛指任何用工具将物体分开的行为，可以是精细的（如裁纸）或粗犷的（如锯木）。而 “chopping” 特指用重力或猛力向下砍击的切割方式，通常带有节奏性和力量感，多用于食材或木材的粗加工。"
    },
    {
      "word_to_compare": "mincing",
      "analysis": "“Mincing” (剁碎) 是一种更精细的切碎方式，通常指将食物切成极小的颗粒，常用于香料或肉末。它强调均匀性和细碎度，而 “chopping” 通常指较大、较随意的块状切割，不追求极致细小。"
    },
    {
      "word_to_compare": "felling",
      "analysis": "“Felling” (伐倒) 专指将整棵树砍倒，是林业术语，强调的是使树木倒下的单一动作。而 “chopping” 在此语境下可能包含砍伐、修枝、劈柴等多个步骤，范围更广，动作也更持续。"
    }
  ]
}