{
  "word": "chorus",
  "pronunciation": "kawr·uhs",
  "concise_definition": "n. 合唱, 齐声, 副歌; v. 齐声说",
  "forms": {
    "plural": "choruses"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A group of singers who perform together, typically in a coordinated and harmonized manner, often as part of a larger musical performance such as an opera, musical, or choir.",
      "explanation_cn": "指一组共同演唱、通常以协调和和谐方式表演的歌手，常作为歌剧、音乐剧或合唱团的一部分。",
      "example_en": "The opera featured a powerful chorus that echoed through the grand hall.",
      "example_cn": "这部歌剧中的合唱团声音雄浑，回荡在整个大厅中。"
    },
    {
      "pos": "noun",
      "explanation_en": "The repeated section of a song, usually with the same melody and lyrics, that follows verses and serves as the emotional or thematic climax.",
      "explanation_cn": "指歌曲中重复出现的部分，通常具有相同的旋律和歌词，位于主歌之后，作为情感或主题的高潮。",
      "example_en": "Everyone sang along to the catchy chorus of the pop hit.",
      "example_cn": "大家都跟着这首流行歌曲朗朗上口的副歌一起唱。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of people saying something at the same time, often in unison or as a collective response.",
      "explanation_cn": "指一群人同时说出相同的话，通常以齐声或集体回应的方式表达。",
      "example_en": "The audience raised a chorus of applause after the performance.",
      "example_cn": "演出结束后，观众齐声鼓掌。"
    },
    {
      "pos": "verb",
      "explanation_en": "To say something simultaneously with others, especially in a unified or repetitive manner.",
      "explanation_cn": "指与他人同时说出某句话，尤其以统一或重复的方式表达。",
      "example_en": "The crowd chorused, 'We want justice!'",
      "example_cn": "人群齐声喊道：‘我们要正义！’"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "choir",
      "analysis": "“Choir” (唱诗班) 通常指有组织、有训练的宗教或专业歌唱团体，强调成员的正式性和音乐性；而 “chorus” 更广泛，可指任何类型的合唱团体，包括非专业、戏剧或流行音乐中的合唱队，甚至可指歌曲的副歌部分。"
    },
    {
      "word_to_compare": "refrain",
      "analysis": "“Refrain” (叠句) 是音乐术语，与 “chorus” 几乎同义，常用于古典或诗歌语境中，指重复出现的诗句或乐句。但在现代英语中，”chorus“ 更常用作流行音乐中的标准术语，而 “refrain” 更具文学色彩。"
    },
    {
      "word_to_compare": "echo",
      "analysis": "“Echo” (回声) 指声音的反射或重复，通常是自然或被动的；而 “chorus” 是主动的、有意识的集体发声行为，强调参与者的协同性，而非物理现象。"
    }
  ]
}