{
  "word": "chronicle",
  "pronunciation": "kron·uh·kl",
  "concise_definition": "n. 编年史, 编年记录; v. 记录, 编年记载",
  "forms": {
    "plural": "chronicles",
    "third_person_singular": "chronicles",
    "past_tense": "chronicled",
    "past_participle": "chronicled",
    "present_participle": "chronicling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A detailed, continuous, and often chronological written record of historical events, typically arranged in the order in which they occurred.",
      "explanation_cn": "指按时间顺序详细、连贯地记录历史事件的书面记载，通常以事件发生的先后为线索。",
      "example_en": "The medieval chronicle provides invaluable insights into daily life during the reign of King Henry VIII.",
      "example_cn": "这部中世纪编年史为了解亨利八世统治时期人们的日常生活提供了宝贵见解。"
    },
    {
      "pos": "noun",
      "explanation_en": "A book or publication that presents a factual account of events, often with a narrative style, such as a sports or cultural chronicle.",
      "explanation_cn": "指以叙述性风格呈现事件事实的书籍或出版物，如体育编年史或文化纪事。",
      "example_en": "The football club published a chronicle of its 100-year history, complete with photos and player interviews.",
      "example_cn": "这家足球俱乐部出版了一部百年历史编年史，配有照片和球员访谈。"
    },
    {
      "pos": "verb",
      "explanation_en": "To record or document events, especially in a detailed and systematic way over time, often for historical purposes.",
      "explanation_cn": "指以系统、细致的方式长期记录事件，通常具有历史保存的目的。",
      "example_en": "The journalist chronicled the civil rights movement through hundreds of firsthand interviews.",
      "example_cn": "这位记者通过数百次第一手访谈，记录了民权运动的全过程。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "history",
      "analysis": "“History” (历史) 是对过去事件的总体研究或叙述，通常包含分析、解释和评价，强调因果关系和宏观视角。而 “chronicle” 更侧重于按时间顺序客观罗列事件，较少进行分析或评论，更像原始记录。"
    },
    {
      "word_to_compare": "record",
      "analysis": "“Record” (记录) 是一个更通用的词，泛指任何形式的记载，可以是简短的笔记、数据或音频。而 “chronicle” 特指系统性、连续性、时间导向的书面记录，通常具有文学性或历史价值，范围更广、结构更完整。"
    },
    {
      "word_to_compare": "annals",
      "analysis": "“Annals” (年鉴) 与 “chronicle” 非常相似，都指按年份编排的历史记录，但 “annals” 更常用于古代或正式文献，语气更庄重，且常以极简形式呈现（如仅列出事件和年份）。而 “chronicle” 更倾向于包含更多细节和叙述性内容。"
    }
  ]
}