{
  "word": "church",
  "pronunciation": "church",
  "concise_definition": "n. 教会, 教堂, 基督教信仰",
  "forms": {
    "plural": "churches"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A building used for public Christian worship, typically featuring a nave, altar, and stained-glass windows, and serving as a center for religious services and community activities.",
      "explanation_cn": "用于举行公共基督教礼拜的建筑物，通常包括中殿、祭坛和彩绘玻璃窗，是宗教仪式和社区活动的中心。",
      "example_en": "The village church dates back to the 12th century and still holds Sunday services.",
      "example_cn": "这座村庄教堂可追溯至12世纪，至今仍举行周日礼拜。"
    },
    {
      "pos": "noun",
      "explanation_en": "The Christian religious institution or community as a whole, including its doctrines, clergy, and congregations, often referring to a specific denomination or branch.",
      "explanation_cn": "指整个基督教宗教机构或社群，包括其教义、神职人员和会众，常特指某一教派或分支。",
      "example_en": "The Catholic Church has played a major role in European history for over a thousand years.",
      "example_cn": "天主教会在过去一千多年中在欧洲历史上发挥了重要作用。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of Christians who gather regularly for worship, fellowship, and spiritual guidance, regardless of the physical building they meet in.",
      "explanation_cn": "指定期聚集进行礼拜、团契和属灵指导的基督徒群体，无论他们是否在实体建筑中聚会。",
      "example_en": "She found a small church that welcomed her with open arms after she moved to the city.",
      "example_cn": "她搬到城市后，找到了一个热情接纳她的小型教会。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cathedral",
      "analysis": "“Cathedral”（大教堂）是主教座堂，是教区主教的正式驻地，通常规模更大、建筑更宏伟，具有行政和象征意义。而 “church” 是泛指任何基督教礼拜场所，无论规模大小或地位高低。所有大教堂都是教堂，但并非所有教堂都是大教堂。"
    },
    {
      "word_to_compare": "temple",
      "analysis": "“Temple”（庙宇）通常用于非基督教宗教，如佛教、印度教或犹太教的宗教场所。虽然在某些语境中（如《圣经》）“temple” 指犹太教的圣殿，但现代英语中它不用于指代基督教礼拜场所。使用 “church” 更准确地表达基督教信仰的物理或组织中心。"
    },
    {
      "word_to_compare": "synagogue",
      "analysis": "“Synagogue”（犹太会堂）是犹太教徒进行礼拜、学习和社区集会的场所，其宗教传统、仪式和建筑风格与基督教教堂截然不同。尽管两者都是宗教聚会场所，但 “church” 专指基督教，而 “synagogue” 专指犹太教，不可互换。"
    }
  ]
}