{
  "word": "churning",
  "pronunciation": "chur·ning",
  "concise_definition": "v. 搅拌, 翻腾, 使动荡; n. 搅拌, 翻腾, 混乱状态",
  "forms": {
    "base_form": "churn",
    "third_person_singular": "churns",
    "past_tense": "churned",
    "past_participle": "churned",
    "present_participle": "churning"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move or stir something vigorously, especially a liquid, often in a circular or agitated motion, typically to produce a physical change such as turning cream into butter.",
      "explanation_cn": "指剧烈地搅动或翻动某物，尤其是液体，通常以圆形或混乱的运动方式，常用于使奶油变成黄油等物理变化。",
      "example_en": "She spent hours churning butter by hand in the old wooden barrel.",
      "example_cn": "她花了数小时用手在旧木桶里搅动奶油来制作黄油。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause continuous and turbulent movement or change, often in a chaotic or disruptive way, especially in economic, social, or emotional contexts.",
      "explanation_cn": "指造成持续而剧烈的运动或变化，通常带有混乱或破坏性，尤其用于经济、社会或情感语境中。",
      "example_en": "The company has been churning through employees at an alarming rate this year.",
      "example_cn": "今年这家公司员工流失率高得惊人。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or process of churning, especially the vigorous agitation of a liquid or the state of being in constant, turbulent motion.",
      "explanation_cn": "指搅拌或翻腾的行为或过程，尤指液体的剧烈搅动，或处于持续动荡状态的情形。",
      "example_en": "The churning of the ocean during the storm made the boat rock violently.",
      "example_cn": "风暴中海洋的翻腾使小船剧烈摇晃。"
    },
    {
      "pos": "noun",
      "explanation_en": "A state of constant, often disruptive change or turnover, especially in employment, customer relationships, or political systems.",
      "explanation_cn": "指持续不断的、常具破坏性的更替或变动状态，尤指在就业、客户关系或政治体系中。",
      "example_en": "High churning in the subscription service led to declining revenue despite heavy marketing.",
      "example_cn": "尽管投入了大量营销，订阅服务的高流失率仍导致收入下降。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "stir",
      "analysis": "“Stir”（搅拌）指一般性的搅动，动作较轻柔、温和，不一定伴随剧烈运动或结构变化，如搅拌咖啡。而 “churning” 强调剧烈、持续、甚至混乱的搅动，常导致物质形态或状态的根本改变，如奶油变黄油。"
    },
    {
      "word_to_compare": "roil",
      "analysis": "“Roil”（使混浊/激荡）与 “churning” 在描述液体或情绪动荡时相近，但 “roil” 更侧重于使原本清澈或平静的状态变得浑浊或不安，常用于比喻（如政治局势），而 “churning” 更强调动作本身的机械性与持续性，适用范围更广，包括物理过程和抽象系统。"
    },
    {
      "word_to_compare": "turmoil",
      "analysis": "“Turmoil”（混乱）是名词，指一种状态，强调心理或社会层面的无序与动荡，如战争或骚乱。而 “churning” 作为名词时，更强调动荡的动态过程本身，常带有机械性或重复性，如客户流失、员工更替等商业语境中的持续性变动。"
    }
  ]
}