{
  "word": "chute",
  "pronunciation": "shüt",
  "concise_definition": "n. 滑道, 溜槽, 降落伞; v. 使滑下, 用降落伞跳下",
  "forms": {
    "plural": "chutes",
    "third_person_singular": "chutes",
    "past_tense": "chuted",
    "past_participle": "chuted",
    "present_participle": "chuting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sloping channel or tube through which objects or people are transported by gravity, often used in industrial, agricultural, or emergency contexts.",
      "explanation_cn": "一种倾斜的通道或管道，用于借助重力运输物体或人员，常用于工业、农业或紧急情况中。",
      "example_en": "The grain was funneled down the chute into the waiting truck.",
      "example_cn": "谷物通过滑槽流入等待的卡车中。"
    },
    {
      "pos": "noun",
      "explanation_en": "A parachute used for descending from an aircraft or high altitude, especially in military or emergency situations.",
      "explanation_cn": "用于从飞机或高空降落的降落伞，尤其在军事或紧急情况下使用。",
      "example_en": "The skydiver checked his chute before jumping from the plane.",
      "example_cn": "跳伞者在从飞机跳下前检查了降落伞。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or cause something to move quickly down a chute, especially by gravity or force.",
      "explanation_cn": "使某物或自己快速沿滑道下滑，通常借助重力或外力。",
      "example_en": "The workers chuted the debris directly into the dumpster.",
      "example_cn": "工人们将废弃物直接滑入垃圾箱中。"
    },
    {
      "pos": "verb",
      "explanation_en": "To jump from an aircraft using a parachute.",
      "explanation_cn": "使用降落伞从飞机上跳下。",
      "example_en": "The paratroopers chuted into enemy territory at dawn.",
      "example_cn": "伞兵在黎明时分跳伞进入敌方领土。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ramp",
      "analysis": "“Ramp”（斜坡）通常指较平缓、用于通行车辆或轮椅的倾斜平面，强调可通行性和安全性；而 “chute” 更陡峭、更注重利用重力快速输送，常用于物品或人员的快速下落，不强调安全或缓慢移动。"
    },
    {
      "word_to_compare": "slide",
      "analysis": "“Slide”（滑梯）多用于娱乐或儿童设施，强调趣味性和人体主动滑动；“chute” 则更偏向功能性、工业或紧急用途，常为封闭式管道，且不一定由人主动控制下滑过程。"
    },
    {
      "word_to_compare": "parachute",
      "analysis": "“Parachute” 是 “chute” 作为降落伞含义时的完整名词形式，两者可互换，但 “chute” 更口语化、简洁，常用于军事或航空术语中（如 ‘jump chute’）；而 “parachute” 更正式，涵盖整个降落装置系统，包括伞衣、绳索和背带。"
    }
  ]
}