{
  "word": "circulating",
  "pronunciation": "sir·kyoo·lay·ting",
  "concise_definition": "adj. 循环的, 流通的, 传播的",
  "forms": {
    "base_form": "circulate",
    "third_person_singular": "circulates",
    "past_tense": "circulated",
    "past_participle": "circulated",
    "present_participle": "circulating"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Moving or being passed from one person, place, or group to another, often in a continuous or repeated cycle; commonly used to describe money, information, or goods in active use or distribution.",
      "explanation_cn": "指在人、地点或群体之间持续或反复传递、流动的状态，常用于描述货币、信息或商品正在被广泛使用或分发。",
      "example_en": "The circulating currency in the region includes both coins and paper bills.",
      "example_cn": "该地区流通的货币包括硬币和纸币。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Spreading widely through a community or system, especially through media or social networks; often implies active dissemination rather than passive existence.",
      "explanation_cn": "指在社区或系统中广泛传播，尤其通过媒体或社交网络；强调主动传播而非被动存在。",
      "example_en": "There is a circulating rumor that the company will be acquired next month.",
      "example_cn": "有一个流传甚广的谣言称，该公司下个月将被收购。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Referring to a system or process in which something is continuously reused or recycled, such as air, water, or heat in an enclosed environment.",
      "explanation_cn": "指某种事物（如空气、水或热量）在封闭环境中持续循环再利用的系统或过程。",
      "example_en": "The building uses a circulating heating system to maintain a constant temperature.",
      "example_cn": "这座建筑采用循环供暖系统以保持恒定温度。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "flowing",
      "analysis": "“Flowing” (流动的) 强调物质或液体的连续移动，通常具有方向性，如河流流动。它更偏向物理状态的描述，而 “circulating” 强调循环往复的路径，常涉及多个节点之间的来回传递，如货币在经济系统中的循环。"
    },
    {
      "word_to_compare": "spreading",
      "analysis": "“Spreading” (传播的) 指从一个点向四周扩散，通常是单向或非循环的，如疾病传播或谣言扩散。而 “circulating” 暗示信息或物品在多个主体间反复传递，具有回路性，更强调系统性流通而非单向扩散。"
    },
    {
      "word_to_compare": "distributed",
      "analysis": "“Distributed” (分发的) 指将某物从一个中心点分配到多个接收者，强调一次性或计划性的分配行为，如分发传单。而 “circulating” 强调持续的、非中心化的、可能多次转手的流通过程，如二手书在读者间的循环使用。"
    }
  ]
}