{
  "word": "circulate",
  "pronunciation": "sur·kyuh·leyt",
  "concise_definition": "v. 循环, 流通, 传播, 传阅",
  "forms": {
    "third_person_singular": "circulates",
    "past_tense": "circulated",
    "past_participle": "circulated",
    "present_participle": "circulating"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move continuously around a system, cycle, or group, often returning to the starting point; commonly used for fluids, air, or information within a closed or bounded environment.",
      "explanation_cn": "指在系统、循环或群体中持续不断地流动或运转，通常会回到起点；常用于描述液体、空气或信息在封闭或有限环境中的循环。",
      "example_en": "The air conditioning system circulates cool air throughout the building.",
      "example_cn": "空调系统在整栋大楼内循环输送冷气。"
    },
    {
      "pos": "verb",
      "explanation_en": "To distribute or pass something widely among a group of people, especially documents, news, or ideas.",
      "explanation_cn": "指在一群人中广泛分发或传递某物，尤指文件、新闻或观点。",
      "example_en": "Rumors began to circulate about the CEO's sudden resignation.",
      "example_cn": "关于首席执行官突然辞职的谣言开始流传开来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause money or resources to flow within an economy or community to maintain activity and stability.",
      "explanation_cn": "指促使资金或资源在经济或社区中流动，以维持活跃与稳定。",
      "example_en": "Tax incentives are designed to circulate money back into the local economy.",
      "example_cn": "税收优惠旨在将资金重新注入地方经济。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "spread",
      "analysis": "“Spread” (传播/扩散) 强调从一个点向四周扩展，通常是单向或非循环的，可能伴随范围扩大和稀释。例如疾病传播、谣言扩散。而 “circulate” 更强调在封闭系统内的循环往复，具有回路性，如血液在体内循环、文件在办公室内传阅。"
    },
    {
      "word_to_compare": "distribute",
      "analysis": "“Distribute” (分发) 指将物品或信息从一个中心点分配给多个接收者，通常是一次性、有组织的分配行为，不强调返回或循环。例如分发传单、分发奖金。而 “circulate” 暗示接收者可能继续传递，形成流动网络。"
    },
    {
      "word_to_compare": "rotate",
      "analysis": "“Rotate” (轮换) 指按固定顺序或周期在不同位置或人员之间交替，强调顺序性和规律性，如轮班、轮岗。而 “circulate” 更侧重于流动本身，不一定有固定顺序，可以是任意路径的循环，如信息在社交网络中自由传播。"
    }
  ]
}