{
  "word": "citation",
  "pronunciation": "suy·tay·shun",
  "concise_definition": "n. 引文, 引用, 表彰, 传唤",
  "forms": {
    "plural": "citations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A reference to a published or unpublished source, used in academic, legal, or professional writing to acknowledge the origin of ideas, data, or quotations.",
      "explanation_cn": "指在学术、法律或专业写作中，为标明思想、数据或引文的来源而引用的出版物或非出版物信息。",
      "example_en": "The paper includes over 50 citations from peer-reviewed journals.",
      "example_cn": "这篇论文引用了50多篇同行评审期刊的文献。"
    },
    {
      "pos": "noun",
      "explanation_en": "An official commendation or recognition, often awarded for bravery, service, or achievement, especially in military or public service contexts.",
      "explanation_cn": "指官方颁发的表彰或嘉奖，通常用于表彰勇敢行为、服务贡献或杰出成就，尤见于军事或公共服务领域。",
      "example_en": "He received a citation for valor after rescuing three people from the burning building.",
      "example_cn": "他在从着火的大楼中救出三人后，被授予英勇嘉奖。"
    },
    {
      "pos": "noun",
      "explanation_en": "An official notice issued by a law enforcement officer or authority, typically for a violation of traffic or municipal regulations.",
      "explanation_cn": "指执法官员或权威机构签发的正式通知，通常用于记录违反交通或市政法规的行为（如罚单）。",
      "example_en": "She got a citation for parking in a no-parking zone.",
      "example_cn": "她因在禁停区停车而收到一张罚单。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "reference",
      "analysis": "“Reference”（参考）是一个更宽泛的术语，泛指任何被提及或 consulted 的信息来源，可以是书籍、网站、人或数据，不一定具有正式引用格式。而 “citation” 特指在学术或法律文本中遵循特定格式（如APA、MLA）的正式引用，具有规范性和可追溯性。"
    },
    {
      "word_to_compare": "quotation",
      "analysis": "“Quotation”（引语）特指直接复制的原文内容，强调字面引用；而 “citation” 是指对来源的标注，无论是否直接引用原文（包括概括、改写或数据使用）。一个引用（quotation）必须附带引用（citation），但一个引用（citation）不一定包含引语。"
    },
    {
      "word_to_compare": "award",
      "analysis": "“Award”（奖项）泛指任何形式的荣誉、奖金或表彰，通常通过正式仪式授予，强调结果和奖励性质；而 “citation” 作为表彰义项时，更侧重于书面形式的官方认可，常伴随具体事由描述，不一定伴随物质奖励，且多用于军事或公共服务语境。"
    }
  ]
}