{
  "word": "civil",
  "pronunciation": "siv·uhl",
  "concise_definition": "adj. 公民的, 文明的, 非军事的, 有礼貌的",
  "forms": {
    "comparative": "civiler",
    "superlative": "civilest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to ordinary citizens and their affairs, as opposed to the military or religious institutions; pertaining to the state or society as organized under law.",
      "explanation_cn": "指与普通公民及其事务相关的，区别于军事或宗教机构；指在法律框架下组织起来的国家或社会。",
      "example_en": "Civil liberties, such as freedom of speech, are protected by the constitution.",
      "example_cn": "言论自由等公民自由受到宪法保护。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by politeness, courtesy, and good manners, especially in social or professional interactions.",
      "explanation_cn": "指在社交或职业互动中表现出礼貌、客气和良好教养的行为。",
      "example_en": "Despite their disagreement, they kept a civil tone during the meeting.",
      "example_cn": "尽管存在分歧，他们在会议中仍保持了礼貌的语气。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Not military or ecclesiastical; belonging to the ordinary administration of a country, especially in contrast to war or religious authority.",
      "explanation_cn": "非军事或非宗教的；属于国家日常管理范畴，与战争或宗教权威相对。",
      "example_en": "The country has a strong civil service system to manage public administration.",
      "example_cn": "该国拥有强大的文官体系来管理公共事务。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to the legal system that deals with disputes between individuals or organizations, as opposed to criminal law.",
      "explanation_cn": "指处理个人或组织之间纠纷的法律体系，区别于刑法。",
      "example_en": "She filed a civil lawsuit against the company for breach of contract.",
      "example_cn": "她因对方违约而提起了民事诉讼。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "polite",
      "analysis": "“Polite” (有礼貌的) 侧重于个体在行为或言语上表现出的尊重与客气，常用于日常人际交往。而 “civil” 不仅包含礼貌，还隐含一种最低限度的、勉强维持的体面，尤其在紧张或对立情境中，如 ‘civil conversation’ 指的是虽不热情但仍保持基本尊重的对话。"
    },
    {
      "word_to_compare": "civic",
      "analysis": "“Civic” (公民的) 专指与公民身份、公共事务或社区责任相关的行为，如 civic duty（公民义务）、civic engagement（公民参与）。而 “civil” 更广泛，涵盖法律、社会制度、非军事性质等，范围更广，不局限于公民参与行为。"
    },
    {
      "word_to_compare": "cultured",
      "analysis": "“Cultured” (有教养的) 强调一个人受过良好教育、具有高雅品味和深厚文化素养，常带有精英色彩。而 “civil” 不涉及文化深度，仅指行为得体、符合社会基本规范，是一种更基础、更普遍的社交要求。"
    }
  ]
}