{
  "word": "clad",
  "pronunciation": "klad",
  "concise_definition": "adj. 穿着的, 覆盖着的",
  "forms": {
    "base_form": "clad",
    "past_tense": "clad",
    "past_participle": "clad",
    "present_participle": "cladding"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Covered or dressed in a particular type of clothing or material, often used in literary or poetic contexts to evoke imagery of protection, adornment, or transformation.",
      "explanation_cn": "指被某种特定衣物或材料覆盖或穿着，常用于文学或诗意语境中，以唤起保护、装饰或转变的意象。",
      "example_en": "The knights were clad in shining armor as they rode into battle.",
      "example_cn": "骑士们身披闪亮的盔甲，骑马奔赴战场。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Covered externally by a layer of material, often for protection, insulation, or aesthetic purposes, especially in architectural or technical contexts.",
      "explanation_cn": "指外部被一层材料覆盖，通常用于保护、隔热或美观目的，尤其用于建筑或技术语境中。",
      "example_en": "The building is clad in glass and steel to reflect the city skyline.",
      "example_cn": "这座建筑外覆玻璃与钢材，以映照城市天际线。"
    },
    {
      "pos": "verb",
      "explanation_en": "The past tense and past participle of 'clothe'; to put clothing or a covering on someone or something.",
      "explanation_cn": "是动词 'clothe' 的过去式和过去分词形式，意为给某人或某物穿上衣服或覆盖物。",
      "example_en": "She was clad in a long, flowing robe as she entered the hall.",
      "example_cn": "她身着一袭长袍，缓缓步入大厅。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "dressed",
      "analysis": "“Dressed” 是更通用、日常的表达，指穿上衣服，强调动作或状态，适用于所有语境。而 “clad” 更具文学性或正式感，常用于描述特定材质（如盔甲、皮毛）的覆盖，带有更强的画面感和修辞色彩。"
    },
    {
      "word_to_compare": "covered",
      "analysis": "“Covered” 是最宽泛的词，泛指任何物体被覆盖，无论是否为衣物（如被子、灰尘、涂料）。而 “clad” 通常特指以衣物、装甲或装饰性材料进行的“包裹式”覆盖，隐含精致或功能性目的，语义范围更窄、更具体。"
    },
    {
      "word_to_compare": "attired",
      "analysis": "“Attired” 与 “clad” 非常接近，都用于正式或文学语境中描述穿着，但 “attired” 更强调穿着的完整性和仪式性（如正式礼服），常用于描述特定场合的装扮；而 “clad” 更侧重于覆盖物的材质或物理状态，可涵盖非服装类覆盖（如建筑外层）。"
    }
  ]
}