{
  "word": "classical",
  "pronunciation": "klas·i·kuhl",
  "concise_definition": "adj. 古典的, 传统的, 正统的",
  "forms": {
    "comparative": "more classical",
    "superlative": "most classical"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to the ancient Greek and Roman cultures, especially in art, architecture, literature, or philosophy, characterized by harmony, proportion, and restraint.",
      "explanation_cn": "与古希腊和古罗马文化相关的，尤其在艺术、建筑、文学或哲学方面，以和谐、比例和节制为特征。",
      "example_en": "The museum houses a collection of classical sculptures from ancient Greece.",
      "example_cn": "这座博物馆收藏了来自古希腊的古典雕塑作品。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Belonging to the tradition of Western art music composed between approximately 1750 and 1820, exemplified by composers such as Mozart and Haydn.",
      "explanation_cn": "指西方艺术音乐传统中约1750年至1820年间创作的音乐，以莫扎特和海顿等作曲家为代表。",
      "example_en": "She studied classical piano for over ten years before switching to jazz.",
      "example_cn": "她在转攻爵士乐之前，已经学习了十多年古典钢琴。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Conforming to established standards or traditions, especially in style, form, or method; considered authoritative or exemplary.",
      "explanation_cn": "符合既定标准或传统，尤其在风格、形式或方法上；被视为权威或典范的。",
      "example_en": "This novel is a classical example of realist literature.",
      "example_cn": "这部小说是现实主义文学的典范之作。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "traditional",
      "analysis": "“Traditional”（传统的）泛指长期延续下来的习俗、做法或风格，不一定具有历史或艺术上的权威性，可以是民间的、地方的或现代的延续。而 “classical” 更强调源自古代文明或特定历史时期的典范性，具有更高的文化地位和美学标准。"
    },
    {
      "word_to_compare": "canonical",
      "analysis": "“Canonical”（正典的）指被权威机构或学术界正式认定为具有核心地位或标准价值的作品或文本，常用于宗教、文学或学术语境。它更侧重于“被认可的正统性”，而 “classical” 更强调历史渊源和美学典范性，不一定经过正式认证。"
    },
    {
      "word_to_compare": "old-fashioned",
      "analysis": "“Old-fashioned”（过时的）带有贬义，指不符合当代潮流、显得陈旧或落伍的事物。而 “classical” 是褒义词，表示经得起时间考验的优雅、庄重和永恒价值，不等于过时，反而常被视为永恒的典范。"
    }
  ]
}