{
  "word": "classic",
  "pronunciation": "klas·ik",
  "concise_definition": "adj. 典型的, 经典的, 一流的; n. 经典作品, 杰作",
  "forms": {
    "comparative": "classier",
    "superlative": "classiest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Of the highest quality or standard; representing the best of its kind, often because of enduring value, simplicity, or elegance.",
      "explanation_cn": "指具有最高品质或标准的，因其持久的价值、简洁性或优雅而被视为同类中的典范。",
      "example_en": "This is a classic example of minimalist design.",
      "example_cn": "这是极简主义设计的典型范例。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Belonging to the ancient Greek or Roman world, or having characteristics associated with ancient classical art and literature.",
      "explanation_cn": "指属于古希腊或古罗马世界的，或具有与古代古典艺术和文学相关的特征。",
      "example_en": "The temple features classic columns with Ionic capitals.",
      "example_cn": "这座神庙采用了带有爱奥尼柱头的经典柱式。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Widely recognized and accepted as a standard or model over a long period of time, especially in culture or art.",
      "explanation_cn": "指在长时间内被广泛认可为某种文化或艺术领域的标准或典范。",
      "example_en": "The film is considered a classic of 20th-century cinema.",
      "example_cn": "这部电影被认为是20世纪电影的经典之作。"
    },
    {
      "pos": "noun",
      "explanation_en": "A work of art, literature, music, or film that is widely admired for its enduring excellence and influence.",
      "explanation_cn": "指因持久的卓越性和影响力而广受推崇的艺术、文学、音乐或电影作品。",
      "example_en": "Pride and Prejudice is a classic of English literature.",
      "example_cn": "《傲慢与偏见》是英国文学的经典之作。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "traditional",
      "analysis": "“Traditional”（传统的）强调遵循长期存在的习俗、风格或方法，侧重于延续性与文化传承，不一定具有卓越性。而 “classic” 更强调作品或事物本身的卓越品质和持久影响力，可能源于传统，但不一定等同于传统。"
    },
    {
      "word_to_compare": "timeless",
      "analysis": "“Timeless”（永恒的）指不受时间影响、永远适用或受欢迎，强调跨越时代的吸引力。而 “classic” 虽然也常具有时间性，但更强调其作为典范或标准的历史地位和公认价值，有时甚至包含特定时代的风格烙印。"
    },
    {
      "word_to_compare": "exemplary",
      "analysis": "“Exemplary”（典范的）侧重于作为值得模仿的榜样，常用于行为、表现或标准，带有道德或规范性含义。而 “classic” 更广泛地用于艺术、设计、文化等领域，强调的是审美、风格或历史地位上的代表性，不必然包含道德评判。"
    }
  ]
}