{
  "word": "clash",
  "pronunciation": "klash",
  "concise_definition": "v. 冲突, 撞击, 碰撞; n. 冲突, 碰撞",
  "forms": {
    "third_person_singular": "clashes",
    "past_tense": "clashed",
    "past_participle": "clashed",
    "present_participle": "clashing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To collide or strike forcefully, often producing a loud sound, typically referring to physical objects or weapons.",
      "explanation_cn": "指两个物体或武器猛烈撞击，通常伴随响亮的声音。",
      "example_en": "The swords clashed loudly as the two knights fought.",
      "example_cn": "两位骑士交战时，剑刃发出刺耳的碰撞声。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be in serious disagreement or conflict, especially over ideas, values, or interests, often leading to tension or opposition.",
      "explanation_cn": "指在观点、价值观或利益上发生严重分歧或冲突，常导致紧张或对立。",
      "example_en": "Their political views clashed during the debate.",
      "example_cn": "他们在辩论中因政治观点不同而发生激烈冲突。"
    },
    {
      "pos": "noun",
      "explanation_en": "A violent or forceful collision between two or more things, often resulting in damage or noise.",
      "explanation_cn": "指两个或多个事物之间发生的猛烈碰撞，常导致损坏或发出声响。",
      "example_en": "The clash of cymbals signaled the start of the symphony.",
      "example_cn": "铙钹的撞击声标志着交响乐的开始。"
    },
    {
      "pos": "noun",
      "explanation_en": "A strong conflict or opposition between people, groups, or ideas, often characterized by intense disagreement or hostility.",
      "explanation_cn": "指人、群体或观念之间强烈的冲突或对立，常表现为激烈的分歧或敌意。",
      "example_en": "The clash between tradition and modernity has shaped the city's culture.",
      "example_cn": "传统与现代之间的冲突塑造了这座城市的文化。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "conflict",
      "analysis": "“Conflict” (冲突) 是更广泛、更正式的术语，涵盖所有类型的对立，包括心理、社会、政治或军事层面。它强调对立状态本身，而 “clash” 更强调冲突发生的瞬间性、激烈性和可感知性（如声音、撞击），常用于描述具体事件。"
    },
    {
      "word_to_compare": "collide",
      "analysis": "“Collide” (碰撞) 专指物理上的撞击，强调物体在运动中相遇并发生接触，通常用于科学或交通语境。而 “clash” 除了物理碰撞外，还可用于抽象冲突（如观点、文化），且常带有情感或对抗色彩。"
    },
    {
      "word_to_compare": "dispute",
      "analysis": "“Dispute” (争论) 指通过语言或辩论表达的分歧，通常较理性、有规则，如法律或学术争议。而 “clash” 更强调情绪激烈、对抗性强，甚至可能演变为暴力或不可调和的对立，语气更强烈。"
    }
  ]
}