{
  "word": "classics",
  "pronunciation": "klas·iks",
  "concise_definition": "n. 经典作品, 古典文学, 传统杰作",
  "forms": {
    "singular": "classic"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A work of literature, art, music, or film that is widely regarded as having enduring value, excellence, and influence over time, often due to its timeless themes or masterful execution.",
      "explanation_cn": "指在文学、艺术、音乐或电影领域中，因其永恒的主题或精湛的技艺而被广泛认为具有持久价值、卓越品质和深远影响的作品。",
      "example_en": "Homer’s Iliad and Odyssey are considered classics of Western literature.",
      "example_cn": "荷马的《伊利亚特》和《奥德赛》被视为西方文学的经典之作。"
    },
    {
      "pos": "noun",
      "explanation_en": "A style, design, or object that is representative of a traditional or original form, often admired for its enduring appeal and authenticity.",
      "explanation_cn": "指一种具有代表性、源自传统或原始形态的风格、设计或物品，因其持久的吸引力和真实性而备受推崇。",
      "example_en": "The 1967 Ford Mustang is a classic car that still draws admiration today.",
      "example_cn": "1967年的福特野马是一款至今仍备受推崇的经典汽车。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that exemplifies the highest standard or ideal of a particular category, often serving as a model for others.",
      "explanation_cn": "指某一类别中体现最高标准或理想的典范人物或事物，常作为他人的楷模。",
      "example_en": "She is a classic of elegance and poise in the world of ballet.",
      "example_cn": "她在芭蕾舞界是优雅与从容的典范。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "masterpiece",
      "analysis": "“Masterpiece”（杰作）强调某件作品在技艺或创意上的巅峰成就，通常指单个作品的极致表现；而 “classics” 更侧重于作品在历史长河中被广泛接受、持续流传的普遍地位，不一定仅限于‘最顶尖’，但必须经得起时间考验。"
    },
    {
      "word_to_compare": "tradition",
      "analysis": "“Tradition”（传统）指代的是代代相传的习俗、信仰或做法，是一个抽象的文化体系；而 “classics” 是传统中具体可感知的产物，如书籍、音乐、建筑等，是传统的物质或艺术载体。"
    },
    {
      "word_to_compare": "antique",
      "analysis": "“Antique”（古董）强调物品的年代久远和历史价值，常用于实物（如家具、器物），其价值主要来自年龄和稀缺性；而 “classics” 更注重文化影响力和审美持久性，即使作品是现代创作，只要具有典范意义，也可被称为 classic。"
    }
  ]
}