{
  "word": "class",
  "pronunciation": "klas",
  "concise_definition": "n. 班级, 阶级, 种类, 课程; v. 分类",
  "forms": {
    "plural": "classes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A group of students taught together in a school or educational institution, typically organized by age or level of study.",
      "explanation_cn": "指在学校或教育机构中，按年龄或学习水平组织起来、一起接受教学的一群学生。",
      "example_en": "The class started at 9 a.m. and ended at 11 a.m.",
      "example_cn": "这节课从上午九点开始，到十一点结束。"
    },
    {
      "pos": "noun",
      "explanation_en": "A social or economic group in society, often defined by income, education, occupation, or status.",
      "explanation_cn": "指社会中根据收入、教育、职业或地位划分的群体，如上层阶级、中产阶级等。",
      "example_en": "The working class played a vital role in the country's industrial development.",
      "example_cn": "工人阶级在国家的工业发展中发挥了重要作用。"
    },
    {
      "pos": "noun",
      "explanation_en": "A category or group of things that share common characteristics or qualities; a type or kind.",
      "explanation_cn": "指具有共同特征或品质的一类事物，即种类或类型。",
      "example_en": "This car belongs to the luxury class of vehicles.",
      "example_cn": "这辆车属于豪华车型。"
    },
    {
      "pos": "noun",
      "explanation_en": "A scheduled session of instruction, especially in a school or training program.",
      "explanation_cn": "指在学校或培训项目中安排的一节教学课程。",
      "example_en": "I have a chemistry class every Tuesday and Thursday.",
      "example_cn": "我每周二和周四都有化学课。"
    },
    {
      "pos": "verb",
      "explanation_en": "To assign something to a particular category or group based on shared characteristics.",
      "explanation_cn": "指根据共同特征将某事物归入某一类别或群体。",
      "example_en": "The museum classes these artifacts as medieval relics.",
      "example_cn": "博物馆将这些文物归类为中世纪遗物。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "category",
      "analysis": "“Category” (类别) 是一个更广泛、更中性的术语，用于任何类型的分类，常用于数据、统计或逻辑系统中，不带有社会或教育含义。而 “class” 除了表示分类外，还常带有社会层级、教育群体或课程的特定语境，语义更丰富。"
    },
    {
      "word_to_compare": "type",
      "analysis": "“Type” (类型) 强调事物在本质或形式上的相似性，常用于科学、技术或日常描述中，语义较抽象。而 “class” 更强调群体性、组织性，如班级、阶级，常隐含等级或结构关系。"
    },
    {
      "word_to_compare": "group",
      "analysis": "“Group” (群体) 是一个泛指集合的词，不强调成员间的共同特征或等级，仅表示“在一起的人或物”。而 “class” 暗示成员之间有明确的共同属性、组织结构或社会地位，如“upper class”或“science class”。"
    }
  ]
}