{
  "word": "classes",
  "pronunciation": "klas·iz",
  "concise_definition": "n. 班级, 课程, 阶级, 类别",
  "forms": {
    "singular": "class"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A group of students taught together in a school or educational institution, typically organized by age, grade, or subject.",
      "explanation_cn": "指在学校或教育机构中，根据年龄、年级或科目组织起来，由一位教师统一授课的一组学生。",
      "example_en": "The children in my daughter's class are learning basic arithmetic.",
      "example_cn": "我女儿班级里的孩子们正在学习基础算术。"
    },
    {
      "pos": "noun",
      "explanation_en": "A course or series of lessons on a particular subject, often offered by a school, college, or training center.",
      "explanation_cn": "指在学校、大学或培训机构开设的、围绕某一特定主题的一系列课程或教学单元。",
      "example_en": "She is taking a painting class at the community center this semester.",
      "example_cn": "这学期她正在社区中心上绘画课。"
    },
    {
      "pos": "noun",
      "explanation_en": "A social or economic group within a society, often defined by income, education, occupation, or lifestyle.",
      "explanation_cn": "指社会中根据收入、教育、职业或生活方式等因素划分出的社会或经济群体。",
      "example_en": "The working class makes up the majority of the population in many countries.",
      "example_cn": "在许多国家，工人阶级占人口的大多数。"
    },
    {
      "pos": "noun",
      "explanation_en": "A category or group of things that share common characteristics, especially in programming, biology, or taxonomy.",
      "explanation_cn": "指具有共同特征的一类事物，尤其在编程、生物学或分类学中，用于对对象或生物进行归类。",
      "example_en": "In object-oriented programming, a class defines the structure and behavior of objects.",
      "example_cn": "在面向对象编程中，类定义了对象的结构和行为。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "category",
      "analysis": "“Category” (类别) 是一个更广泛、更抽象的术语，用于对事物进行分组，不涉及社会结构或教学组织。它常用于逻辑、统计或商业分类，如“电子产品类别”。而 “class” 在社会或教育语境中具有更强的结构性和层级性。"
    },
    {
      "word_to_compare": "group",
      "analysis": "“Group” (群体) 是一个中性、通用的词，泛指任何聚集在一起的人或物，没有特定的组织形式或层级含义。而 “class” 暗示了更正式的结构，如班级、社会阶层或分类体系，具有明确的边界和规则。"
    },
    {
      "word_to_compare": "type",
      "analysis": "“Type” (类型) 强调本质属性的相似性，常用于科学或技术语境中区分事物的基本种类，如“动物类型”。它不涉及人群组织或社会分层，而 “class” 在社会或教育语境中常包含权力、地位或制度性安排的含义。"
    }
  ]
}