{
  "word": "claw",
  "pronunciation": "klaw",
  "concise_definition": "n. 爪, 爪子; v. 抓, 抠, 用爪子抓",
  "forms": {
    "third_person_singular": "claws",
    "past_tense": "clawed",
    "past_participle": "clawed",
    "present_participle": "clawing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sharp, curved nail or digit on the foot of an animal, especially a bird or mammal, used for grasping, climbing, or attacking prey.",
      "explanation_cn": "动物（尤其是鸟类或哺乳动物）脚上锋利、弯曲的指甲或趾，用于抓握、攀爬或攻击猎物。",
      "example_en": "The eagle swooped down and seized the rabbit with its powerful claws.",
      "example_cn": "鹰俯冲而下，用强有力的爪子抓住了兔子。"
    },
    {
      "pos": "noun",
      "explanation_en": "A tool or device shaped like a claw, used for pulling, gripping, or prying objects apart.",
      "explanation_cn": "一种形状像爪子的工具或装置，用于拉拽、抓握或撬开物体。",
      "example_en": "He used a claw hammer to pull out the nails from the wooden board.",
      "example_cn": "他用爪锤把钉子从木板上拔出来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To scratch or tear with or as if with claws, often in a violent or desperate manner.",
      "explanation_cn": "用爪子或类似爪子的方式抓挠或撕裂，常带有暴力或绝望的意味。",
      "example_en": "The cat clawed at the curtains in an attempt to climb up.",
      "example_cn": "猫拼命抓挠窗帘，试图爬上去。"
    },
    {
      "pos": "verb",
      "explanation_en": "To dig or scrape with the fingers or nails, especially in an effort to remove something or gain purchase.",
      "explanation_cn": "用手指或指甲抓挠、刮擦，尤指试图移除某物或获得支撑。",
      "example_en": "She clawed at the dirt with her bare hands trying to find the buried key.",
      "example_cn": "她赤手在泥土中抓挠，试图找到埋着的钥匙。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "talon",
      "analysis": "“Talon”（猛禽的爪）特指猛禽（如鹰、隼）的锋利弯曲爪子，常用于捕猎，具有更强的生物学和文学色彩。而 “claw” 是更通用的词，适用于所有有爪动物，包括猫、狗、熊等，也用于比喻性工具。"
    },
    {
      "word_to_compare": "scratch",
      "analysis": "“Scratch”（抓挠）指用指甲或尖锐物轻划表面，通常力度较轻，可能不具攻击性，如猫抓沙发、人抓痒。而 “claw” 强调更猛烈、更深、更具破坏性的抓挠动作，常伴随力量和意图。"
    },
    {
      "word_to_compare": "grapple",
      "analysis": "“Grapple”（搏斗、紧握）指用双手或身体进行激烈缠斗或紧抓，强调对抗性互动，常用于抽象语境（如 grapple with a problem）。而 “claw” 更具体地指向用爪状结构进行物理性抓取或撕裂，动作更原始、更依赖身体部位。"
    }
  ]
}