{
  "word": "cleanup",
  "pronunciation": "kloo·nup",
  "concise_definition": "n. 清理, 整理; v. 清理, 整理",
  "forms": {
    "plural": "cleanups",
    "third_person_singular": "cleans up",
    "past_tense": "cleaned up",
    "past_participle": "cleaned up",
    "present_participle": "cleaning up"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of making a place or situation neater, cleaner, or more orderly by removing unwanted items, debris, or problems.",
      "explanation_cn": "通过移除不需要的物品、垃圾或问题，使某个地方或状况变得更整洁、更有序的行为。",
      "example_en": "The neighborhood organized a weekend cleanup to remove litter from the park.",
      "example_cn": "社区组织了一次周末大扫除，清理公园里的垃圾。"
    },
    {
      "pos": "noun",
      "explanation_en": "A systematic effort to eliminate corruption, inefficiency, or unwanted elements from an organization or system.",
      "explanation_cn": "为消除组织或系统中的腐败、低效或不良因素而进行的系统性整顿。",
      "example_en": "The government launched a major cleanup of public procurement practices.",
      "example_cn": "政府发起了对公共采购流程的重大整顿。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a place or thing clean and orderly by removing dirt, clutter, or unnecessary items.",
      "explanation_cn": "通过清除污垢、杂乱或不必要的物品，使某个地方或物品变得干净整洁。",
      "example_en": "She spent the afternoon cleaning up her cluttered desk.",
      "example_cn": "她花了一个下午整理凌乱的办公桌。"
    },
    {
      "pos": "verb",
      "explanation_en": "To resolve or fix a problematic situation, especially one that has been neglected or left unresolved.",
      "explanation_cn": "解决或处理一个长期被忽视或未解决的问题状况。",
      "example_en": "The IT team worked overnight to clean up the system errors before the launch.",
      "example_cn": "IT团队通宵工作，赶在发布前修复了系统错误。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tidy",
      "analysis": "“Tidy” (整理) 通常指轻微的、日常的整理行为，强调使东西看起来整齐有序，但不一定涉及彻底清除。而 “cleanup” 更强调全面、彻底的清理，可能包括丢弃、移除或修复，范围更广、力度更强。"
    },
    {
      "word_to_compare": "clean",
      "analysis": "“Clean” (清洁) 主要侧重于去除污垢、灰尘或污染物，强调物理上的洁净。而 “cleanup” 不仅包括清洁，还涵盖整理、归位、清除杂物甚至系统性整顿，语义范围更广。"
    },
    {
      "word_to_compare": "reform",
      "analysis": "“Reform” (改革) 通常用于制度、政策或结构的系统性改进，带有政治或社会变革的含义，强调机制性变化。而 “cleanup” 在用于抽象语境时，更侧重于清除腐败或不良行为，而非重建新体系，语气更偏向于‘清理’而非‘重构’。"
    }
  ]
}