{
  "word": "cleared",
  "pronunciation": "klird",
  "concise_definition": "adj. 清除的, 晴朗的, 通过的; v. 清除, 通过, 澄清 (clear 的过去式和过去分词)",
  "forms": {
    "base_form": "clear",
    "present_participle": "clearing",
    "third_person_singular": "clears"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Free from obstruction, confusion, or cloudiness; describing something that has been removed, resolved, or made transparent.",
      "explanation_cn": "指没有障碍、混乱或模糊的状态；描述某物已被移除、解决或变得清晰透明。",
      "example_en": "The sky was cleared after the storm, revealing a brilliant blue horizon.",
      "example_cn": "风暴过后，天空放晴，展现出一片湛蓝的地平线。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Officially approved or authorized, especially after review or inspection; used in contexts such as security, health, or legal clearance.",
      "explanation_cn": "指经过审查或检查后获得正式批准或授权，常用于安全、健康或法律许可的语境。",
      "example_en": "She received cleared status for the classified project after the background check.",
      "example_cn": "她在背景调查后获得了参与该机密项目的许可。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove obstacles, debris, or unwanted elements from a space or situation, making it usable or safe.",
      "explanation_cn": "指从空间或情境中移除障碍物、杂物或不需要的元素，使其可用或安全。",
      "example_en": "Workers cleared the fallen trees from the road after the hurricane.",
      "example_cn": "飓风过后，工人们清除了道路上倒下的树木。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pass successfully through a test, requirement, or obstacle; to be approved or accepted after evaluation.",
      "explanation_cn": "指成功通过测试、要求或障碍；在评估后获得批准或接受。",
      "example_en": "He cleared the bar at 2 meters and won the gold medal.",
      "example_cn": "他跳过了两米的横杆，赢得了金牌。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove blame, suspicion, or accusation from someone; to exonerate or vindicate.",
      "explanation_cn": "指为某人消除责备、怀疑或指控；为其洗清罪名或证明清白。",
      "example_en": "New evidence cleared the suspect of all charges.",
      "example_cn": "新证据使嫌疑人摆脱了所有指控。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cleaned",
      "analysis": "“Cleaned” (清洁) 强调去除污垢、灰尘或不洁物质，侧重于物理上的洁净。而 “cleared” 更广泛，可指移除障碍、解除疑虑或获得许可，不仅限于物理清洁。"
    },
    {
      "word_to_compare": "resolved",
      "analysis": "“Resolved” (解决) 通常指问题、争议或矛盾被妥善处理并得出结论，强调过程的终结和问题的消除。而 “cleared” 更侧重于状态的转变——从有障碍/怀疑到无障碍/无怀疑，不一定涉及复杂协商。"
    },
    {
      "word_to_compare": "approved",
      "analysis": "“Approved” (批准) 是正式认可某事符合标准，常用于申请、提案或许可场景。而 “cleared” 在此语境下虽可近似，但更强调‘通过审查’的过程，隐含安全、合规或筛选的意味，语气更中性或技术性。"
    }
  ]
}