{
  "word": "cleavage",
  "pronunciation": "kleev·ij",
  "concise_definition": "n. 分裂, 分离, (女性) 胸部隆起",
  "forms": {
    "plural": "cleavages"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of splitting or dividing something into parts, especially along a natural line or seam; often used in geology or chemistry to describe the tendency of a mineral or compound to break along flat planes.",
      "explanation_cn": "指沿自然线或接缝将某物分裂或分离的行为；常用于地质学或化学中，描述矿物或化合物倾向于沿平面破裂的特性。",
      "example_en": "The mica shows perfect cleavage, breaking easily into thin, flat sheets.",
      "example_cn": "云母具有完美的解理，容易裂成薄而平的片状。"
    },
    {
      "pos": "noun",
      "explanation_en": "The deep space between a woman's breasts, especially when emphasized by clothing or posture; often used in fashion, media, or cultural contexts.",
      "explanation_cn": "指女性胸部之间的深陷区域，尤其在服装或姿态的衬托下被突出；常用于时尚、媒体或文化语境中。",
      "example_en": "The actress wore a low-cut dress that accentuated her cleavage.",
      "example_cn": "这位女演员穿着一件低胸礼服，突显了她的胸部曲线。"
    },
    {
      "pos": "noun",
      "explanation_en": "A deep division or separation, especially in politics, society, or opinion, that creates strong contrasts or conflicts between groups.",
      "explanation_cn": "指政治、社会或意见上的深刻分歧或对立，导致群体之间形成强烈对比或冲突。",
      "example_en": "The election revealed a deep cleavage between urban and rural voters.",
      "example_cn": "这次选举揭示了城市选民与农村选民之间的深刻分歧。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "split",
      "analysis": "“Split” (分裂) 是一个更通用、口语化的词，泛指任何类型的分开或断裂，不强调自然的结构或方向性。而 “cleavage” 更具体，常指沿特定纹理、平面或生理结构发生的自然分裂，尤其在地质或身体语境中具有专业含义。"
    },
    {
      "word_to_compare": "division",
      "analysis": "“Division” (划分) 是一个更抽象、中性的词，常用于组织、群体或概念的划分，如“社会阶层的划分”。它不包含物理断裂的意象，而 “cleavage” 在用于社会语境时，带有更强烈、更尖锐的对立感，暗示不可调和的鸿沟。"
    },
    {
      "word_to_compare": "decollation",
      "analysis": "“Decollation” (脱层) 是一个极少使用的术语，仅用于矿物学中描述层状结构的剥离，与 “cleavage” 在地质学中的含义部分重叠，但范围极窄。而 “cleavage” 是通用术语，涵盖矿物、社会、身体等多个领域，语义更广泛。"
    }
  ]
}