{
  "word": "climbing",
  "pronunciation": "klym·bing",
  "concise_definition": "n. 攀登, 攀爬; adj. 攀登的, 攀爬的",
  "forms": {
    "base_form": "climb",
    "third_person_singular": "climbs",
    "past_tense": "climbed",
    "past_participle": "climbed",
    "present_participle": "climbing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The activity or sport of ascending steep surfaces such as rocks, mountains, or walls, often using specialized equipment and techniques for safety and progress.",
      "explanation_cn": "指攀登陡峭表面（如岩石、山体或墙壁）的活动或运动，通常使用专业设备和技术以确保安全和推进。",
      "example_en": "Climbing Mount Everest requires months of physical training and acclimatization.",
      "example_cn": "攀登珠穆朗玛峰需要数月的体能训练和适应高海拔环境。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of moving upward along a vertical or inclined surface, whether for sport, work, or necessity.",
      "explanation_cn": "指沿着垂直或倾斜表面向上移动的行为，无论是出于运动、工作还是必要原因。",
      "example_en": "The children were excited by the climbing wall at the park.",
      "example_cn": "孩子们对公园里的攀岩墙感到兴奋。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or used in the activity of climbing; describing equipment, routes, or styles associated with ascending vertical surfaces.",
      "explanation_cn": "与攀登活动相关或用于攀登的；描述与垂直表面攀登相关的装备、路线或方式。",
      "example_en": "She bought new climbing shoes for her upcoming trip to the Alps.",
      "example_cn": "她为即将到来的阿尔卑斯山之行买了新的攀岩鞋。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "scaling",
      "analysis": "“Scaling” (攀爬/攀登) 与 “climbing” 意义高度重叠，但更常用于正式或技术语境，尤其指大规模或有计划地攀登高大结构（如建筑、悬崖）。它隐含更强的“克服障碍”和“技术性”意味，而 “climbing” 更通用，涵盖从儿童攀爬架到专业登山的所有形式。"
    },
    {
      "word_to_compare": "ascending",
      "analysis": "“Ascending” (上升) 是一个更广泛、更中性的动词，泛指任何向上的移动，包括乘坐电梯、爬楼梯或登山。它不特指体力或技术性攀爬，而 “climbing” 强调使用肢体主动抓握、蹬踏垂直或近垂直表面，具有明确的身体参与和风险性。"
    },
    {
      "word_to_compare": "mountaineering",
      "analysis": "“Mountaineering” (登山) 是 “climbing” 的一个子集，特指攀登高山，通常涉及长时间远征、冰雪技术、高海拔适应和团队协作。而 “climbing” 可以指任何高度的攀爬，包括室内岩馆、单日岩壁攀登等，范围更广、形式更多样。"
    }
  ]
}