{
  "word": "climb",
  "pronunciation": "klahym",
  "concise_definition": "v. 攀登, 爬升, 上升; n. 攀登, 爬升",
  "forms": {
    "third_person_singular": "climbs",
    "past_tense": "climbed",
    "past_participle": "climbed",
    "present_participle": "climbing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move upward by using one's hands and feet, especially on a steep or vertical surface such as a mountain, rock, or ladder.",
      "explanation_cn": "指用手和脚在陡峭或垂直的表面上（如山、岩石或梯子）向上移动。",
      "example_en": "The climbers spent three days climbing the north face of the mountain.",
      "example_cn": "登山者花了三天时间攀登这座山的北壁。"
    },
    {
      "pos": "verb",
      "explanation_en": "To rise or increase gradually, often in level, rank, or status, sometimes with effort or difficulty.",
      "explanation_cn": "指逐渐上升、增长，常用于描述水平、职位或地位的提升，有时带有努力或困难的意味。",
      "example_en": "She climbed the corporate ladder to become CEO of the company.",
      "example_cn": "她通过努力一步步晋升，最终成为这家公司的首席执行官。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move upward in a vehicle or structure, such as getting into a bus, tree, or staircase.",
      "explanation_cn": "指进入或登上某种交通工具或结构物，如公交车、树或楼梯。",
      "example_en": "The children climbed into the back of the pickup truck.",
      "example_cn": "孩子们爬进了皮卡的后车厢。"
    },
    {
      "pos": "noun",
      "explanation_en": "An act or instance of climbing, especially a long or difficult ascent.",
      "explanation_cn": "指一次攀登行为，尤指漫长或艰难的上升过程。",
      "example_en": "The final climb to the summit took all our remaining energy.",
      "example_cn": "最后登顶的攀登耗尽了我们所有的力气。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ascend",
      "analysis": "“Ascend” (上升) 更正式，常用于描述垂直或方向性的上升，强调动作的优雅或客观性，多用于书面语或技术语境（如飞机上升、海拔升高）。而 “climb” 更口语化，常包含身体用力、手脚并用的意象，适用于具体物体或地形的攀登。"
    },
    {
      "word_to_compare": "scale",
      "analysis": "“Scale” (攀爬) 通常指有计划地、技术性地攀登陡峭或危险的表面，如悬崖或城墙，常用于登山或军事语境。它比 “climb” 更具专业性和目的性，且常隐含使用工具（如绳索）。而 “climb” 更通用，可指任何类型的向上移动。"
    },
    {
      "word_to_compare": "rise",
      "analysis": "“Rise” (上升) 是一个更抽象或被动的词，常用于描述自然或非主动的上升，如太阳升起、价格上升、烟雾升腾。它不涉及身体动作或努力，而 “climb” 总是暗示主动的、有意识的向上移动。"
    }
  ]
}