{
  "word": "clockwork",
  "pronunciation": "klok·wurk",
  "concise_definition": "n. 发条装置, 机械装置; adj. 精确如钟表的, 机械的",
  "forms": {
    "plural": "clockworks"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The internal mechanical system of a clock or other device that uses gears, springs, and levers to keep time or perform repetitive motion, typically wound by a key or spring.",
      "explanation_cn": "指钟表或其他设备中用于计时或执行重复运动的内部机械系统，通常由齿轮、发条和杠杆组成，通过上发条驱动。",
      "example_en": "The antique pocket watch had a delicate clockwork mechanism that still worked after 200 years.",
      "example_cn": "这枚古董怀表拥有精巧的发条装置，历经两百年仍能正常运转。"
    },
    {
      "pos": "noun",
      "explanation_en": "A system or process that operates with mechanical regularity and predictability, often implying a lack of spontaneity or human emotion.",
      "explanation_cn": "指以机械般规律和可预测的方式运行的系统或过程，常暗示缺乏自发性或人性情感。",
      "example_en": "His daily routine was like clockwork: wake up at 6 a.m., jog for an hour, then head to the office.",
      "example_cn": "他的日常作息精确如钟表：早上六点起床，慢跑一小时，然后去办公室。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Operating with precise, mechanical regularity; unvarying and predictable, often in a way that seems lifeless or automated.",
      "explanation_cn": "以精确、机械般的规律运行；一成不变且可预测，常带有缺乏生气或自动化的特点。",
      "example_en": "She delivered her lines in a clockwork fashion, showing no emotion.",
      "example_cn": "她以机械般的方式背诵台词，毫无感情。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mechanism",
      "analysis": "“Mechanism”（机制）是一个更广泛的术语，泛指任何实现特定功能的结构或系统，可以是机械的、生物的或抽象的（如社会机制）。而 “clockwork” 特指由发条和齿轮构成的精密机械系统，或比喻其规律性，更具象且常带怀旧或诗意色彩。"
    },
    {
      "word_to_compare": "routine",
      "analysis": "“Routine”（常规）指重复进行的习惯性行为或程序，强调行为模式，但不隐含机械性或物理结构。而 “clockwork” 不仅指规律性，还强烈暗示一种无生命、无情感、精确到分秒的自动化运作，带有更强的比喻性和形象性。"
    },
    {
      "word_to_compare": "automaton",
      "analysis": "“Automaton”（自动机）指完全自动运行的机器或人形装置，常带有科幻或拟人色彩，强调“自主行动”。而 “clockwork” 更侧重于驱动系统本身的精密构造，不一定具有行动能力，更多用于描述运作方式的规律性，而非实体本身。"
    }
  ]
}