{
  "word": "clouds",
  "pronunciation": "klowdz",
  "concise_definition": "n. 云, 云状物, 阴影, 大量",
  "forms": {
    "singular": "cloud"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Visible masses of water droplets or ice crystals suspended in the atmosphere, formed by condensation of water vapor and often associated with weather changes.",
      "explanation_cn": "由水蒸气凝结形成的、悬浮在大气中的可见水滴或冰晶群，常与天气变化相关。",
      "example_en": "Dark clouds gathered on the horizon, signaling an approaching storm.",
      "example_cn": "地平线上聚集起乌云，预示着暴风雨即将来临。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large number or amount of something, often used metaphorically to suggest obscurity, abundance, or overwhelming presence.",
      "explanation_cn": "指大量或众多的事物，常用于比喻，暗示模糊、丰盈或压倒性的存在。",
      "example_en": "A cloud of dust rose as the car sped down the dirt road.",
      "example_cn": "汽车疾驰在土路上，扬起一片尘土。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slight shadow, stain, or taint that diminishes the purity or clarity of something, often used in emotional or moral contexts.",
      "explanation_cn": "指轻微的阴影、污点或瑕疵，削弱了某事物的纯粹性或清晰度，常用于情感或道德语境。",
      "example_en": "There was a cloud over her happiness after the argument.",
      "example_cn": "争吵之后，她的快乐蒙上了一层阴影。"
    },
    {
      "pos": "noun",
      "explanation_en": "A networked system for storing and accessing data or computing resources over the internet, commonly used in technology contexts.",
      "explanation_cn": "指通过互联网存储和访问数据或计算资源的网络系统，常用于科技语境。",
      "example_en": "The company moved its files to the cloud to improve accessibility and backup.",
      "example_cn": "该公司将文件迁移到云端，以提高可访问性和备份能力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fog",
      "analysis": "“Fog” (雾) 是贴近地面的、低能见度的水汽凝结物，通常导致视线受阻，具有强烈的物理遮蔽性。而 “clouds” 位于高空，不一定影响地面能见度，更多是气象现象或视觉意象。"
    },
    {
      "word_to_compare": "smoke",
      "analysis": "“Smoke” (烟) 是燃烧产生的固体微粒和气体混合物，通常带有气味和污染性，常与火灾或工业活动相关。而 “clouds” 通常是自然形成的水汽结构，无污染性，除非在比喻中被赋予负面含义。"
    },
    {
      "word_to_compare": "haze",
      "analysis": "“Haze” (薄雾/霾) 是由微小颗粒（如灰尘、污染物）造成的空气浑浊现象，常与环境污染相关，视觉上比云更均匀、更稀薄。而 “clouds” 是由水滴或冰晶组成，形态更分明、可辨识，且多为气象现象。"
    },
    {
      "word_to_compare": "mass",
      "analysis": "“Mass” (大量/团块) 是一个泛指数量或体积庞大的词，可指任何聚集物，如人群、物质等，缺乏具体形态。而 “clouds” 在比喻用法中虽可表示大量，但保留了其视觉上的蓬松、飘浮、不规则的意象，更具文学性和形象性。"
    }
  ]
}