{
  "word": "club",
  "pronunciation": "klub",
  "concise_definition": "n. 俱乐部, 棍棒, 钉锤; v. 用棍棒打",
  "forms": {
    "plural": "clubs"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An organization of people with a common interest or purpose, often meeting regularly for social, recreational, or professional activities.",
      "explanation_cn": "指一群有共同兴趣或目标的人组成的组织，通常定期聚会进行社交、娱乐或专业活动。",
      "example_en": "She joined a book club to discuss novels with other literature enthusiasts.",
      "example_cn": "她加入了一个读书俱乐部，与其他文学爱好者讨论小说。"
    },
    {
      "pos": "noun",
      "explanation_en": "A heavy, blunt instrument used as a weapon, typically made of wood or metal, designed to strike or crush.",
      "explanation_cn": "一种沉重、钝头的武器，通常由木头或金属制成，用于击打或砸碎。",
      "example_en": "The guard swung his club to disperse the crowd.",
      "example_cn": "警卫挥动棍棒驱散了人群。"
    },
    {
      "pos": "noun",
      "explanation_en": "A playing card with the symbol of a clover leaf, one of the four suits in a standard deck.",
      "explanation_cn": "扑克牌中的一种花色，图案为三叶草，是标准一副牌中的四种花色之一。",
      "example_en": "He drew the ace of clubs and smiled—he had a winning hand.",
      "example_cn": "他抽到了梅花A，笑了起来——他有一手好牌。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strike or hit someone or something repeatedly with a club or similar heavy object.",
      "explanation_cn": "用棍棒或类似的重物反复击打某人或某物。",
      "example_en": "The protesters were clubbed by police officers during the demonstration.",
      "example_cn": "示威者在游行中遭到警察用警棍殴打。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "association",
      "analysis": "“Association” (协会) 更正式，常用于法律或专业语境，强调组织的结构和章程，如“Chamber of Commerce”；而 “club” 更偏向非正式、以兴趣或休闲为导向的团体，如“golf club”。"
    },
    {
      "word_to_compare": "bat",
      "analysis": "“Bat” (球棒) 通常指用于体育运动的轻型击打工具，如棒球棒或板球拍，设计精良且有特定规则；而 “club” 更泛指重型、原始的打击工具，也可用于暴力场景，语义更宽泛且更具攻击性。"
    },
    {
      "word_to_compare": "guild",
      "analysis": "“Guild” (行会) 是中世纪以来由手工业者或商人组成的传统职业组织，强调技艺传承和行业规范；而 “club” 不限于职业，更强调成员间的社交或娱乐联系，现代语境中几乎无行业管制含义。"
    }
  ]
}