{
  "word": "clutch",
  "pronunciation": "kluch",
  "concise_definition": "n. 离合器, 紧急时刻; v. 紧握, 抓住",
  "forms": {
    "third_person_singular": "clutches",
    "past_tense": "clutched",
    "past_participle": "clutched",
    "present_participle": "clutching"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A mechanical device in vehicles that connects and disconnects the engine from the transmission, allowing gear changes and smooth starts.",
      "explanation_cn": "汽车中用于连接或断开发动机与变速箱的机械装置，使换挡和平稳起步成为可能。",
      "example_en": "He pressed the clutch pedal just before shifting into second gear.",
      "example_cn": "他在换入二挡前踩下了离合器踏板。"
    },
    {
      "pos": "noun",
      "explanation_en": "A moment of great danger, stress, or crisis in which decisive action is required; often used in the phrase 'in a clutch'.",
      "explanation_cn": "指需要果断行动的危急时刻或关键时刻，常用于短语 'in a clutch'（在紧要关头）。",
      "example_en": "She made the winning shot in the final seconds — a true clutch performance.",
      "example_cn": "她在最后几秒投进了制胜一球——这是一次真正的关键表现。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, often decorative handbag carried by women, typically without straps and held in the hand or under the arm.",
      "explanation_cn": "一种小型、常带装饰性的女士手包，通常无肩带，用手或臂弯夹持。",
      "example_en": "She opened her beaded clutch to retrieve her lipstick.",
      "example_cn": "她打开珠饰手包，取出口红。"
    },
    {
      "pos": "verb",
      "explanation_en": "To grasp or hold something tightly, especially out of fear, anxiety, or urgency.",
      "explanation_cn": "指因恐惧、焦虑或紧迫感而紧紧抓住或握住某物。",
      "example_en": "The child clutched her stuffed animal as the thunder rolled.",
      "example_cn": "雷声隆隆时，孩子紧紧抱着她的毛绒玩具。"
    },
    {
      "pos": "verb",
      "explanation_en": "To seize or grab something suddenly or desperately, often in an attempt to prevent loss or failure.",
      "explanation_cn": "指突然或绝望地抓住某物，常为防止损失或失败而采取的行动。",
      "example_en": "He clutched at the rope as he slipped over the cliff edge.",
      "example_cn": "他从悬崖边缘滑落时，拼命抓住了那根绳子。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "grip",
      "analysis": "“Grip”（紧握）与 “clutch” 都表示用力握住，但 “grip” 更中性，常用于描述稳定、持续的抓握（如握拳、握工具），而 “clutch” 带有情绪色彩，暗示紧张、恐慌或急迫，常用于非理性或本能的抓取行为。"
    },
    {
      "word_to_compare": "emergency",
      "analysis": "“Emergency”（紧急情况）是泛指任何突发的危险状况，而 “clutch” 作为名词时特指需要立即做出关键决策的时刻，更强调‘关键时刻’的戏剧性与决定性，常用于体育、表演或高压力情境中。"
    },
    {
      "word_to_compare": "handbag",
      "analysis": "“Handbag”（手提包）是通用词，涵盖各种尺寸和风格的女性包袋，而 “clutch” 是手提包的一种特定类型，特指无带、需用手或臂夹持的小型包，强调其设计和使用方式，而非功能。"
    }
  ]
}