{
  "word": "clutches",
  "pronunciation": "kluch·iz",
  "concise_definition": "n. 离合器, 紧握, 抓握; v. 紧握, 抓住 (第三人称单数)",
  "forms": {
    "singular": "clutch",
    "past_tense": "clutched",
    "past_participle": "clutched",
    "present_participle": "clutching"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A mechanical device in vehicles that connects and disconnects the engine from the transmission, allowing gear changes and smooth starts.",
      "explanation_cn": "车辆中用于连接和断开发动机与变速器的机械装置，使换挡和平稳起步成为可能。",
      "example_en": "He pressed the clutch pedal to shift into second gear.",
      "example_cn": "他踩下离合器踏板以换入二挡。"
    },
    {
      "pos": "noun",
      "explanation_en": "A tight grip or hold, often due to fear, anxiety, or urgency; can also refer to a small handbag.",
      "explanation_cn": "一种因恐惧、焦虑或紧迫感而产生的紧握；也可指一种小型手提包。",
      "example_en": "The child was in the clutch of a panic attack, unable to breathe.",
      "example_cn": "孩子正陷入恐慌发作的紧握中，无法呼吸。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, often ornamental handbag carried by women, typically held in the hand or worn on a chain.",
      "explanation_cn": "一种女性常携带的小型手提包，通常有装饰性，用手拿着或用链条佩戴。",
      "example_en": "She opened her beaded clutch to find her lipstick.",
      "example_cn": "她打开珠饰手包，找口红。"
    },
    {
      "pos": "verb",
      "explanation_en": "To grasp or hold something tightly, especially in fear, desperation, or affection.",
      "explanation_cn": "紧紧抓住某物，尤其在恐惧、绝望或深情时。",
      "example_en": "She clutched the letter to her chest as tears streamed down her face.",
      "example_cn": "她将信紧紧按在胸前，泪水顺着脸颊流下。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "grip",
      "analysis": "“Grip” (抓握) 是一个更通用的词，泛指用手紧握任何物体，强调力量和稳定性，可用于工具、把手等。而 “clutch” 更常带有情绪色彩，如恐惧或依恋时的紧抓，且可作名词指代手包或离合器，语义范围更广。"
    },
    {
      "word_to_compare": "grab",
      "analysis": "“Grab” (抓取) 强调快速、突然的动作，常为一次性行为，带有目的性但不一定持续。而 “clutch” 暗示持续性的紧握，常伴随情绪反应，动作更紧张、更持久。"
    },
    {
      "word_to_compare": "transmission",
      "analysis": "“Transmission” (变速器) 是车辆中与离合器协同工作的部件，负责传递动力并改变齿轮比。虽然两者常在汽车语境中同时出现，但 “clutch” 是控制动力连接的开关装置，而 “transmission” 是实现不同速度的齿轮系统，功能不同，不可互换。"
    }
  ]
}