{
  "word": "coaches",
  "pronunciation": "kohch",
  "concise_definition": "n. 教练, 导师; v. 训练, 指导",
  "forms": {
    "singular": "coach",
    "third_person_singular": "coaches",
    "past_tense": "coached",
    "past_participle": "coached",
    "present_participle": "coaching"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who trains and instructs individuals or teams in a particular sport, skill, or activity, often with the goal of improving performance and achieving specific objectives.",
      "explanation_cn": "指专门训练和指导个人或团队在某项运动、技能或活动中提高表现、达成特定目标的人。",
      "example_en": "The soccer coach developed a new strategy that led the team to win the championship.",
      "example_cn": "这位足球教练制定了一项新策略，帮助球队赢得了冠军。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who provides guidance, support, and advice to help someone improve in personal or professional development, often outside of sports.",
      "explanation_cn": "指在体育之外，为个人或职业发展提供指导、支持和建议的导师，如生活教练、职业教练。",
      "example_en": "She hired a life coach to help her manage stress and set career goals.",
      "example_cn": "她聘请了一位生活教练，帮助自己管理压力并设定职业目标。"
    },
    {
      "pos": "verb",
      "explanation_en": "To train, instruct, or guide someone in a sport, skill, or area of personal or professional growth.",
      "explanation_cn": "指对某人在运动、技能或个人/职业成长领域进行训练、指导或辅导。",
      "example_en": "He coached the junior team for five years before becoming a scout.",
      "example_cn": "他在成为球探之前，曾执教青年队五年。"
    },
    {
      "pos": "verb",
      "explanation_en": "To prepare someone mentally or emotionally for a specific situation, often by offering advice or role-playing.",
      "explanation_cn": "指通过提供建议或角色扮演等方式，为某人应对特定情境进行心理或情感上的准备。",
      "example_en": "The lawyer coached her client on how to answer questions in court.",
      "example_cn": "律师指导她的客户如何在法庭上回答问题。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "trainer",
      "analysis": "“Trainer”（训练师）通常指专注于技术性、重复性技能训练的人，如健身教练或设备操作培训师，强调动作规范和流程执行。而 “coach” 更侧重于策略、心理激励和整体表现提升，常涉及个性化指导和目标设定。"
    },
    {
      "word_to_compare": "mentor",
      "analysis": "“Mentor”（导师）通常基于长期、非正式的关系，侧重于价值观传递、职业路径建议和人生智慧分享，关系更平等、情感更深厚。而 “coach” 通常是短期、目标导向的，聚焦于具体技能或绩效改进，结构更正式。"
    },
    {
      "word_to_compare": "instructor",
      "analysis": "“Instructor”（讲师/指导者）多用于传授系统性知识或技术，如驾驶 instructor 或舞蹈 instructor，强调知识传递和标准化教学。而 “coach” 更注重因材施教、反馈调整和激发潜能，强调互动与进步过程。"
    }
  ]
}