{
  "word": "coach",
  "pronunciation": "kohch",
  "concise_definition": "n. 教练, 长途巴士; v. 训练, 指导",
  "forms": {
    "third_person_singular": "coaches",
    "past_tense": "coached",
    "past_participle": "coached",
    "present_participle": "coaching",
    "plural": "coaches"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who trains and instructs individuals or teams in sports, skills, or performance, often with the goal of improving technique, strategy, and mental focus.",
      "explanation_cn": "指在体育、技能或表现方面训练和指导个人或团队的人，通常旨在提高技术、策略和心理专注力。",
      "example_en": "The head coach led the team to victory with a brilliant tactical adjustment.",
      "example_cn": "主教练通过一次出色的战术调整带领球队取得了胜利。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large, long-distance bus used for transporting passengers over extended routes, especially in Europe.",
      "explanation_cn": "指用于长途运送乘客的大巴，尤其在欧洲常用。",
      "example_en": "We took the coach from London to Edinburgh and enjoyed the scenic countryside.",
      "example_cn": "我们乘坐长途巴士从伦敦前往爱丁堡，沿途欣赏了美丽的乡村风光。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provide guidance, training, or support to someone to help them improve their performance, behavior, or understanding in a specific area.",
      "explanation_cn": "指为某人提供指导、训练或支持，帮助其在特定领域提升表现、行为或理解能力。",
      "example_en": "She coached her younger brother through his first job interview.",
      "example_cn": "她指导弟弟通过了人生第一次面试。"
    },
    {
      "pos": "verb",
      "explanation_en": "To privately tutor or prepare someone for an exam, presentation, or specific challenge, often intensively and individually.",
      "explanation_cn": "指对某人进行私下辅导或针对性准备，通常以密集、一对一的方式进行，用于应对考试、演讲或特定挑战。",
      "example_en": "He hired a private coach to help him prepare for the law school entrance exam.",
      "example_cn": "他聘请了一位私人辅导老师帮助他准备法学院入学考试。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "trainer",
      "analysis": "“Trainer” (训练师) 更侧重于身体技能或体能方面的系统性训练，常用于健身、康复或动物训练领域，语义范围较窄。而 “coach” 不仅包括体能训练，还涵盖心理、策略、沟通等综合指导，适用范围更广，包括体育、职场、学业等。"
    },
    {
      "word_to_compare": "instructor",
      "analysis": "“Instructor” (讲师/指导者) 通常指在正式教育或培训环境中传授知识或技能的人，如驾驶教练、舞蹈 instructor，强调知识传递的规范性和程序性。而 “coach” 更强调个性化、目标导向和激励性辅导，常伴随反馈与调整，更具互动性和发展性。"
    },
    {
      "word_to_compare": "mentor",
      "analysis": "“Mentor” (导师) 指基于长期关系、以经验与智慧为依托提供人生或职业建议的指导者，关系更偏向于情感支持与价值观引导。而 “coach” 通常目标明确、时间有限，聚焦于具体技能或绩效的提升，关系更结构化、任务导向。"
    }
  ]
}