{
  "word": "coasts",
  "pronunciation": "kōsts",
  "concise_definition": "n. 海岸, 沿海地区; v. 沿海岸行进, 滑行",
  "forms": {
    "singular": "coast"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The land along the edge of a sea, ocean, or other large body of water; a region where land meets water.",
      "explanation_cn": "指与海洋、大海或其他大型水体接壤的陆地边缘区域；陆地与水域交界的地方。",
      "example_en": "The family spent their summer vacation exploring the beautiful coasts of Maine.",
      "example_cn": "这家人把暑假花在了探索缅因州美丽的海岸线上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A region or area characterized by its proximity to the sea, often with distinct climate, economy, or culture.",
      "explanation_cn": "指因靠近海洋而具有独特气候、经济或文化的地区。",
      "example_en": "The Pacific coasts are known for their mild winters and vibrant marine ecosystems.",
      "example_cn": "太平洋沿岸地区以其温和的冬季和丰富的海洋生态系统而闻名。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move along the edge of a coast, typically by boat or vehicle, often without making stops or changing direction significantly.",
      "explanation_cn": "指沿海岸线行进，通常乘船或车辆，且不作明显停顿或方向改变。",
      "example_en": "The sailors coasted along the shoreline, avoiding the open ocean.",
      "example_cn": "水手们沿着海岸线航行，避开了开阔海域。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move smoothly and effortlessly, often with little or no power applied, as if gliding along a slope or surface.",
      "explanation_cn": "指以平稳、轻松的方式滑行，通常不施加动力，如同沿斜坡或表面滑动。",
      "example_en": "The bicycle coasted down the hill after the rider stopped pedaling.",
      "example_cn": "骑车人停止踩踏板后，自行车顺着山坡滑行而下。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "shore",
      "analysis": "“Shore”（岸边）泛指任何水体（包括湖泊、河流）与陆地的交界处，范围更广；而 “coast” 特指海洋或大海的边缘，具有更明确的地理和文化含义，常用于描述大范围的沿海区域。"
    },
    {
      "word_to_compare": "beach",
      "analysis": "“Beach”（海滩）特指海岸线上由沙子、砾石或卵石构成的平坦区域，是海岸的一部分；而 “coast” 是一个更宏观的概念，包括悬崖、岩岸、湿地等多种地貌，不一定有沙滩。"
    },
    {
      "word_to_compare": "glide",
      "analysis": "“Glide”（滑行）强调无动力、流畅的运动状态，常用于空中或冰面；而 “coast” 作为动词时，特指沿斜坡或地表因惯性滑行，常与重力相关，且多用于陆地交通工具（如自行车、汽车），语义更具体。"
    }
  ]
}