{
  "word": "coats",
  "pronunciation": "kōts",
  "concise_definition": "n. 外套, 涂层, 表层; v. 涂覆, 覆盖",
  "forms": {
    "singular": "coat",
    "third_person_singular": "coats",
    "past_tense": "coated",
    "past_participle": "coated",
    "present_participle": "coating"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An outer garment worn for warmth or protection, typically reaching from the shoulders to the hips or thighs.",
      "explanation_cn": "一种穿在身体外层的衣物，用于保暖或防护，通常从肩膀延伸至臀部或大腿。",
      "example_en": "She pulled on her wool coat before stepping out into the snow.",
      "example_cn": "她穿上羊毛外套，走出门外，踏入雪中。"
    },
    {
      "pos": "noun",
      "explanation_en": "A layer of a substance applied to a surface for protection, decoration, or functional purposes (e.g., paint, enamel, or fur).",
      "explanation_cn": "涂覆在表面的一层物质，用于保护、装饰或实现特定功能（如油漆、釉料或毛皮）。",
      "example_en": "The car had a shiny coat of lacquer that reflected the sunlight.",
      "example_cn": "这辆车涂了一层光亮的清漆，反射着阳光。"
    },
    {
      "pos": "noun",
      "explanation_en": "A natural outer layer or covering on an animal, especially fur or hair (used in plural: coats).",
      "explanation_cn": "动物体表的天然外层覆盖物，尤指毛发或皮毛（常用复数形式：coats）。",
      "example_en": "Dogs shed their winter coats in spring to adapt to warmer weather.",
      "example_cn": "狗在春天会脱去冬毛，以适应更温暖的天气。"
    },
    {
      "pos": "verb",
      "explanation_en": "To apply a layer of a substance onto a surface, such as paint, varnish, or a protective film.",
      "explanation_cn": "在表面上涂覆一层物质，如油漆、清漆或保护膜。",
      "example_en": "The workers coated the metal with rust-resistant paint.",
      "example_cn": "工人们在金属表面涂上了防锈漆。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover or surround something as if with a layer or garment, often metaphorically.",
      "explanation_cn": "像用一层衣物或覆盖物一样包裹或围住某物，常用于比喻意义。",
      "example_en": "A thick layer of fog coated the valley in the early morning.",
      "example_cn": "清晨，一层浓雾笼罩着山谷。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "jacket",
      "analysis": "“Jacket”（夹克）通常指较短、较轻便的上衣，多用于春秋季节，一般不提供极寒防护；而 “coat” 更厚重、更长，专为寒冷天气设计，强调保暖性和防护性。两者在长度、厚度和使用场景上有明显区别。"
    },
    {
      "word_to_compare": "layer",
      "analysis": "“Layer”（层）是一个通用词，泛指任何堆叠或覆盖的层次，可用于抽象概念（如社会阶层）或物理结构（如岩层）；而 “coat” 作为名词时特指一种连续、均匀的覆盖层，常用于材料、表面处理或动物皮毛，语义更具体、更偏向实体覆盖。"
    },
    {
      "word_to_compare": "fur",
      "analysis": "“Fur”（皮毛）指动物身上的毛发本身，是自然生长的生物材料；而 “coat” 在指动物时，是包含毛发、底层绒毛及整体结构的完整外层系统。可以说，fur 是 coat 的组成部分，但 coat 更强调功能性的整体覆盖。"
    }
  ]
}