{
  "word": "coat",
  "pronunciation": "kōt",
  "concise_definition": "n. 外套, 涂层, 表层; v. 涂覆, 覆盖",
  "forms": {
    "plural": "coats",
    "third_person_singular": "coats",
    "past_tense": "coated",
    "past_participle": "coated",
    "present_participle": "coating"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A piece of outerwear worn on the upper body for warmth or protection against weather, typically longer than a jacket and often with sleeves and a collar.",
      "explanation_cn": "穿在身体上部的外衣，用于保暖或抵御天气，通常比夹克长，带有袖子和领子。",
      "example_en": "She pulled on her wool coat before stepping out into the snow.",
      "example_cn": "她穿上羊毛外套，走出门外，踏入雪中。"
    },
    {
      "pos": "noun",
      "explanation_en": "A layer of material applied to a surface for protection, decoration, or functional purposes, such as paint, enamel, or a chemical film.",
      "explanation_cn": "涂覆在表面的一层物质，用于保护、装饰或实现特定功能，如油漆、釉料或化学薄膜。",
      "example_en": "The car had a protective coat of wax to prevent rust.",
      "example_cn": "这辆车涂了一层保护性蜡，以防止生锈。"
    },
    {
      "pos": "verb",
      "explanation_en": "To apply a layer of a substance onto a surface, especially to protect, seal, or decorate it.",
      "explanation_cn": "在表面上涂抹一层物质，尤其是为了保护、密封或装饰。",
      "example_en": "The technician coated the metal with a thin layer of zinc to prevent corrosion.",
      "example_cn": "技术人员在金属表面涂上一层薄薄的锌，以防止腐蚀。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover or surround something as if with a layer or outer covering, often metaphorically.",
      "explanation_cn": "像用一层外衣覆盖一样遮盖或包围某物，常用于比喻意义。",
      "example_en": "The hills were coated with a blanket of snow.",
      "example_cn": "群山被一层白雪覆盖。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "jacket",
      "analysis": "“Jacket”（夹克）通常指较短、较轻便的上衣，多用于春秋季节或作为内搭，而 “coat” 更厚重、更长，主要用于冬季或恶劣天气，强调保暖和防护功能。两者在长度、厚度和使用场景上有明显区别。"
    },
    {
      "word_to_compare": "layer",
      "analysis": "“Layer”（层）是一个通用词，泛指任何堆叠或覆盖的层次，可以是抽象的（如社会阶层）或物理的（如地壳层）。而 “coat” 特指一种连续、均匀的覆盖层，常用于材料科学或日常物品的表面处理，语义更具体、更偏向物理覆盖。"
    },
    {
      "word_to_compare": "paint",
      "analysis": "“Paint”（油漆）是“coat”作为动词时的一种具体实现方式，但 “paint” 仅指使用颜料进行涂覆，而 “coat” 的覆盖物可以是蜡、金属、塑料、釉料等多种材料，范围更广。作为名词时，“paint” 是一种物质，而 “coat” 是该物质形成的覆盖层。"
    }
  ]
}