{
  "word": "cock",
  "pronunciation": "kok",
  "concise_definition": "n. 公鸡, 雄性动物, 阴茎 (粗俗); v. 使翘起, 使竖立",
  "forms": {
    "plural": "cocks",
    "third_person_singular": "cocks",
    "past_tense": "cocked",
    "past_participle": "cocked",
    "present_participle": "cocking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A male chicken, especially one used for breeding or fighting; often used to refer to the male of other bird or animal species.",
      "explanation_cn": "公鸡，尤指用于繁殖或斗鸡的雄性鸡；也可泛指其他鸟类或动物的雄性个体。",
      "example_en": "The rooster crowed loudly at dawn, waking everyone in the village.",
      "example_cn": "公鸡在黎明时分大声啼叫，吵醒了村子里的每个人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A vulgar slang term for the human penis; used in informal or offensive contexts.",
      "explanation_cn": "对男性阴茎的粗俗俚语说法，多用于非正式或冒犯性语境中。",
      "example_en": "He used crude language, including the word 'cock', which offended many listeners.",
      "example_cn": "他使用了粗俗的语言，包括‘cock’这个词，冒犯了许多听众。"
    },
    {
      "pos": "verb",
      "explanation_en": "To tilt or raise something slightly upward, especially the head, chin, or a part of a machine or weapon.",
      "explanation_cn": "使某物略微向上倾斜，尤指头部、下巴或机器、武器的某个部分。",
      "example_en": "She cocked her head curiously as she listened to the strange noise.",
      "example_cn": "她听到奇怪的声音，好奇地歪了歪头。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pull back and lock the hammer of a firearm in preparation for firing.",
      "explanation_cn": "将枪的击锤向后拉并卡住，为射击做准备。",
      "example_en": "The soldier cocked his pistol and aimed at the target.",
      "example_cn": "士兵拉起手枪的击锤，对准了目标。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rooster",
      "analysis": "“Rooster” 是 “cock” 在指公鸡时的更中性、更常用的正式词汇，尤其在美式英语中广泛使用，避免了 “cock” 在其他语境中的粗俗含义。因此，在描述家禽时，推荐使用 “rooster” 以避免歧义或冒犯。"
    },
    {
      "word_to_compare": "penis",
      "analysis": "“Penis” 是医学和正式语境中对男性生殖器的标准术语，无俚语或冒犯色彩。而 “cock” 作为其俚语形式，带有强烈的情感色彩，常用于愤怒、戏谑或侮辱性表达中，使用时需极度谨慎。"
    },
    {
      "word_to_compare": "tilt",
      "analysis": "“Tilt” (倾斜) 是一个更通用的动词，指任何方向的倾斜，不特指向上。而 “cock” 在作动词时，特指一种轻微、突然、有意识地向上翘起的动作，常用于描述头部、枪械或机械部件的特定姿态，语义更精确且具象。"
    }
  ]
}