{
  "word": "coconut",
  "pronunciation": "koh·kun·nut",
  "concise_definition": "n. 椰子, 椰子树, 椰肉, 椰水",
  "forms": {
    "plural": "coconuts"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The hard-shelled fruit of the coconut palm tree, containing a white fleshy interior (coconut meat) and a liquid center (coconut water), commonly used in cooking, beverages, and cosmetics.",
      "explanation_cn": "椰子树的果实，外壳坚硬，内含白色果肉（椰肉）和液体中心（椰水），广泛用于烹饪、饮品和化妆品中。",
      "example_en": "She cracked open a fresh coconut to drink the sweet coconut water.",
      "example_cn": "她敲开一个新鲜的椰子，喝里面的甜椰水。"
    },
    {
      "pos": "noun",
      "explanation_en": "The tall tropical tree that produces coconuts, known for its slender trunk and large feathery leaves.",
      "explanation_cn": "指生产椰子的高大热带树木，以其细长的树干和大型羽状叶片而闻名。",
      "example_en": "The beach was lined with swaying coconut trees under the afternoon sun.",
      "example_cn": "下午的阳光下，海滩旁排列着随风摇曳的椰子树。"
    },
    {
      "pos": "noun",
      "explanation_en": "The white, oily flesh of the coconut, often dried and grated to make coconut milk, oil, or flakes used in baking and curries.",
      "explanation_cn": "指椰子的白色油脂状果肉，常被晒干并磨碎，用于制作椰奶、椰油或椰丝，广泛用于烘焙和咖喱中。",
      "example_en": "The recipe called for a cup of shredded coconut to add a tropical flavor.",
      "example_cn": "这个食谱需要一杯刨丝椰肉，以增添热带风味。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "palm",
      "analysis": "“Palm”（棕榈树）是一个更广泛的类别，包括多种热带树木，如椰子树、油棕、枣椰树等。而 “coconut” 特指椰子树及其果实，是 palm 的一种。因此，所有 coconut trees 都是 palms，但并非所有 palms 都是 coconut trees。"
    },
    {
      "word_to_compare": "nut",
      "analysis": "“Nut”（坚果）泛指各种坚硬外壳包裹的可食用种子，如杏仁、核桃、腰果等。虽然 coconut 在日常语言中被称为“坚果”，但从植物学角度，它实际上是核果（drupe），而非真正的坚果。因此，coconut 在分类上不同于传统意义上的 nut。"
    },
    {
      "word_to_compare": "papaya",
      "analysis": "“Papaya”（木瓜）是另一种热带水果，外形和口感与 coconut 截然不同：它多汁、柔软、呈橙红色，常生食或用于甜点。而 coconut 以坚硬外壳、白色果肉和清甜液体为特征，用途更广泛，包括食用、榨油、制糖和工业原料。两者虽同属热带水果，但植物学分类、结构和用途差异显著。"
    }
  ]
}