{
  "word": "cod",
  "pronunciation": "kod",
  "concise_definition": "n. 鳕鱼, 代码, 伪装; v. 装傻, 欺骗",
  "forms": {
    "plural": "cods"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A type of cold-water fish found in the North Atlantic, valued for its mild-flavored white flesh and widely used in cuisine and commercial fishing.",
      "explanation_cn": "一种生活在北大西洋的冷水鱼，以其味道清淡的白色鱼肉而闻名，广泛用于烹饪和商业捕捞。",
      "example_en": "Fish and chips in Britain are traditionally made with cod.",
      "example_cn": "英国的炸鱼薯条传统上使用鳕鱼制作。"
    },
    {
      "pos": "noun",
      "explanation_en": "A system of symbols, rules, or instructions used to represent information or instructions in computing and programming.",
      "explanation_cn": "指在计算机和编程中用于表示信息或指令的一套符号、规则或指令系统，即‘代码’。",
      "example_en": "The programmer spent hours debugging the cod before the launch.",
      "example_cn": "程序员在发布前花了数小时调试代码。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pretend to be foolish, ignorant, or unaware, often to avoid responsibility or to deceive others.",
      "explanation_cn": "假装愚笨、无知或 unaware，常用于逃避责任或欺骗他人。",
      "example_en": "He cods around when the boss asks about the missing report.",
      "example_cn": "老板问起那份丢失的报告时，他就装傻充愣。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slang term for the male genitalia, used informally or humorously.",
      "explanation_cn": "俚语，指男性生殖器，常用于非正式或幽默语境。",
      "example_en": "The joke was crude, relying on cod humor that offended some guests.",
      "example_cn": "这个笑话很粗俗，依赖于低俗的玩笑，冒犯了一些客人。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "code",
      "analysis": "“Code” 是 “cod” 作为‘代码’含义的正确拼写形式，而 “cod” 是其常见的拼写错误或非正式变体。在正式语境中，必须使用 “code”；“cod” 作为代码使用时属于口语或笔误，不应在技术文档中出现。"
    },
    {
      "word_to_compare": "fake",
      "analysis": "“Fake” (假装/伪造) 强调制造虚假的外表或物品，而 “cod” 作为动词时特指通过装傻或装无知来欺骗，更侧重于行为上的伪装而非物品的伪造。"
    },
    {
      "word_to_compare": "haddock",
      "analysis": "“Haddock” (黑线鳕) 是与 “cod” 同属鳕科的另一种食用鱼，外形和口感相似，常被混淆。但两者是不同物种，cod 肉质更厚实，haddock 更细嫩，且在商业上常被混用，但生物学上应区分。"
    }
  ]
}