{
  "word": "coherent",
  "pronunciation": "koh·hir·uhnt",
  "concise_definition": "adj. 连贯的, 一致的, 清晰的",
  "forms": {
    "comparative": "more coherent",
    "superlative": "most coherent"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Logically connected and consistent, especially in thought, speech, or writing, so that the parts form a clear and understandable whole.",
      "explanation_cn": "在思想、言语或写作中逻辑上相互关联且一致，使各部分构成清晰易懂的整体。",
      "example_en": "Her argument was coherent and well-supported by evidence.",
      "example_cn": "她的论点连贯且有充分的证据支持。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Unified and orderly in structure or appearance, often used to describe systems, designs, or narratives that lack contradiction or confusion.",
      "explanation_cn": "在结构或外观上统一有序，常用于描述没有矛盾或混乱的系统、设计或叙事。",
      "example_en": "The film had a coherent plot that tied all the subplots together neatly.",
      "example_cn": "这部电影有一个连贯的情节，将所有支线情节巧妙地串联起来。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Mentally clear and able to think or express oneself clearly, often used to describe a person’s state of mind, especially after illness or trauma.",
      "explanation_cn": "思维清晰，能够清楚地思考或表达自己，常用于描述一个人在疾病或创伤后的精神状态。",
      "example_en": "After the accident, he was barely coherent, but gradually regained his ability to speak clearly.",
      "example_cn": "事故发生后，他几乎无法清晰表达，但逐渐恢复了清晰说话的能力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "logical",
      "analysis": "“Logical”（合乎逻辑的）强调推理过程符合规则和理性，侧重于前提与结论之间的正确关系。而 “coherent” 更强调整体表达的连贯性和一致性，即使推理不完全严密，只要内容前后不矛盾、易于理解，也可称为 coherent。"
    },
    {
      "word_to_compare": "consistent",
      "analysis": "“Consistent”（一致的）强调在不同时间或情境下保持相同或相似，常用于行为、态度或数据的稳定性。而 “coherent” 不仅要求一致，还要求各部分之间有内在的逻辑联系，构成一个有意义的整体。"
    },
    {
      "word_to_compare": "clear",
      "analysis": "“Clear”（清晰的）是一个更宽泛的词，可指视觉、语言或思维上的易懂性，但不一定包含逻辑结构。而 “coherent” 特别强调内容的组织性和内在关联性，是“清晰”的更高层次，要求不仅易懂，还要有条理、不跳跃。"
    }
  ]
}