{
  "word": "coil",
  "pronunciation": "koyl",
  "concise_definition": "n. 线圈, 螺旋状物; v. 盘绕, 缠绕",
  "forms": {
    "third_person_singular": "coils",
    "past_tense": "coiled",
    "past_participle": "coiled",
    "present_participle": "coiling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A series of loops or turns of a flexible material, such as wire, rope, or hose, typically arranged in a circular or spiral pattern.",
      "explanation_cn": "指由柔性材料（如电线、绳索或软管）以圆形或螺旋状排列而成的一系列环状或卷曲结构。",
      "example_en": "The transformer contains a copper coil that conducts electricity.",
      "example_cn": "变压器内含有一个导电的铜线圈。"
    },
    {
      "pos": "noun",
      "explanation_en": "A length of something (e.g., cable, rope, or hose) wound into a circular or spiral shape for storage or transport.",
      "explanation_cn": "指为便于储存或运输而卷成圆形或螺旋状的一段物品（如电缆、绳索或软管）。",
      "example_en": "She uncoiled the garden hose and turned on the water.",
      "example_cn": "她把花园水管展开，打开了水龙头。"
    },
    {
      "pos": "verb",
      "explanation_en": "To wind or twist something into a series of loops or spirals, often tightly or repeatedly.",
      "explanation_cn": "指将某物缠绕或扭转成一系列环状或螺旋状，通常紧密或反复进行。",
      "example_en": "The snake coiled itself around the branch before striking.",
      "example_cn": "蛇在攻击前盘绕在树枝上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move in a twisting or spiraling motion, often in a controlled or deliberate way.",
      "explanation_cn": "指以扭曲或螺旋的方式移动，通常是有控制或有意识的。",
      "example_en": "Smoke coiled upward from the chimney into the clear sky.",
      "example_cn": "烟雾从烟囱中袅袅盘旋升入晴朗的天空。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "spiral",
      "analysis": "“Spiral” (螺旋) 强调一种连续的、逐渐向外或向内扩展的曲线形状，常用于描述自然形态（如星系、贝壳）或抽象概念（如情绪螺旋下降）。“Coil” 更强调物理上的缠绕动作或结构，通常由线性材料反复弯曲形成，具有更明确的环状单元。"
    },
    {
      "word_to_compare": "winding",
      "analysis": "“Winding” (缠绕) 是一个更通用的动词，泛指任何围绕某物盘绕的行为，不特指形成环状结构。而 “coil” 隐含了形成规则、紧密、多层环状排列的含义，常用于技术或工程语境，如线圈、电缆盘绕。"
    },
    {
      "word_to_compare": "roll",
      "analysis": "“Roll” (卷起) 通常指将物体围绕一个轴心卷成圆柱形，如卷地毯或卷纸，强调的是圆柱体的形成；而 “coil” 更倾向于形成扁平或螺旋状的环形结构，如弹簧或蛇的盘绕，其环与环之间可能有间隙或重叠，形态更自由。"
    }
  ]
}