{
  "word": "collecting",
  "pronunciation": "kuh·lek·ting",
  "concise_definition": "n. 收集, 收藏; v. 收集 (collect 的现在分词/动名词形式)",
  "forms": {
    "base_form": "collect",
    "third_person_singular": "collects",
    "past_tense": "collected",
    "past_participle": "collected",
    "present_participle": "collecting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The activity or hobby of systematically gathering and preserving items of a particular type, often for their aesthetic, historical, or sentimental value.",
      "explanation_cn": "指有系统地收集并保存某一类物品的活动或爱好，通常因其美学、历史或情感价值。",
      "example_en": "His collecting of vintage postage stamps has spanned over forty years.",
      "example_cn": "他收藏古董邮票的爱好已持续了四十多年。"
    },
    {
      "pos": "noun",
      "explanation_en": "A curated set or group of items gathered together, often displayed or valued as a whole (e.g., a collection of art, coins, or books).",
      "explanation_cn": "指被有意识地汇集在一起并作为整体展示或珍视的一组物品（如艺术品、硬币或书籍的收藏品）。",
      "example_en": "The museum is showcasing a rare collecting of 18th-century porcelain.",
      "example_cn": "博物馆正在展出一组稀有的18世纪瓷器收藏。"
    },
    {
      "pos": "verb",
      "explanation_en": "The present participle form of 'collect'; used to describe the ongoing action of gathering things together, often from various sources.",
      "explanation_cn": "动词 'collect' 的现在分词形式，用于描述持续进行的从不同来源聚集、收拢事物的动作。",
      "example_en": "She is collecting data for her research on climate change.",
      "example_cn": "她正在为关于气候变化的研究收集数据。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "gathering",
      "analysis": "“Gathering” (聚集) 更广泛地指将人、物或信息集中在一起，不一定有系统性或长期保存的目的。例如，gather people for a meeting 或 gather leaves in autumn。而 “collecting” 强调有目的、有选择、有持续性的积累，通常伴随分类和保存行为。"
    },
    {
      "word_to_compare": "accumulating",
      "analysis": "“Accumulating” (积累) 强调数量随时间逐渐增多，常带有被动或无意识的意味，有时甚至隐含负面含义（如积累债务）。而 “collecting” 是主动、有意识的行为，通常与兴趣、爱好或审美判断相关，更强调品质而非单纯数量。"
    },
    {
      "word_to_compare": "hoarding",
      "analysis": "“Hoarding” (囤积) 指无节制地大量储存物品，常因心理或病理原因，缺乏整理或目的性，甚至影响生活。而 “collecting” 是一种有组织、有鉴赏力的爱好，收藏者通常会分类、展示并珍惜藏品，两者在动机和行为方式上有本质区别。"
    }
  ]
}