{
  "word": "colleges",
  "pronunciation": "kol·ijz",
  "concise_definition": "n. 学院, 大学, 专科院校",
  "forms": {
    "singular": "college"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An educational institution that provides undergraduate education, often as part of a larger university, or as an independent institution offering associate degrees or specialized training.",
      "explanation_cn": "指提供本科教育的教育机构，通常是大型大学的一部分，或作为独立机构提供副学士学位或专业培训。",
      "example_en": "She enrolled in a liberal arts college in Massachusetts.",
      "example_cn": "她进入了一所位于马萨诸塞州的文理学院。"
    },
    {
      "pos": "noun",
      "explanation_en": "A constituent part of a university, especially in the UK and some Commonwealth countries, that provides academic and residential support to its students.",
      "explanation_cn": "指英国及部分英联邦国家大学中的组成部分，为学生提供学术指导与住宿支持。",
      "example_en": "Trinity College is one of the oldest and most prestigious colleges at the University of Cambridge.",
      "example_cn": "三一学院是剑桥大学历史最悠久、最负盛名的学院之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A professional association or body that regulates a particular field, such as medicine or law, often granting credentials or setting standards.",
      "explanation_cn": "指规范某一专业领域（如医学或法律）的行业协会或机构，通常负责授予资格或制定行业标准。",
      "example_en": "The American College of Surgeons sets guidelines for surgical training and practice.",
      "example_cn": "美国外科医师学会制定了外科培训与实践的指导方针。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "university",
      "analysis": "“University”（大学）通常指包含多个学院、提供本科、硕士和博士多层次教育及广泛研究项目的综合性高等教育机构。而 “college” 可以是大学的组成部分，也可以是独立的、规模较小、主要提供本科或职业培训的机构。在美国，college 常与 university 互换使用，但在英国，college 通常是大学的下属单位。"
    },
    {
      "word_to_compare": "academy",
      "analysis": "“Academy”（学院/研究院）通常指专注于特定学科、艺术或专业技能的教育机构，如军事学院、艺术学院，有时也指精英或封闭式教育机构。它比 “college” 更强调专业性或选拔性，且不一定提供正规学位。而 “college” 更普遍地指提供系统性高等教育的机构。"
    },
    {
      "word_to_compare": "institute",
      "analysis": "“Institute”（研究所/学院）通常指专注于科学研究、技术培训或专业领域的机构，如理工学院（Institute of Technology）或语言研究所。它更侧重于应用研究或职业培训，规模通常较小，而 “college” 更强调通识教育和学位授予，尤其在本科阶段。"
    }
  ]
}