{
  "word": "collar",
  "pronunciation": "koh·luhr",
  "concise_definition": "n. 衣领, 项圈; v. 逮捕, 套住",
  "forms": {
    "plural": "collars",
    "third_person_singular": "collars",
    "past_tense": "collared",
    "past_participle": "collared",
    "present_participle": "collaring"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The part of a garment, especially a shirt or jacket, that surrounds and supports the neck, often designed for decoration, function, or to hold a tie or badge.",
      "explanation_cn": "衣物（尤其是衬衫或夹克）中围绕并支撑颈部的部分，常用于装饰、功能用途或固定领带、徽章等。",
      "example_en": "He adjusted his collar before stepping onto the stage.",
      "example_cn": "他走上舞台前整理了一下衣领。"
    },
    {
      "pos": "noun",
      "explanation_en": "A band or loop, typically made of leather or metal, worn around the neck of an animal (especially a dog) to identify or control it.",
      "explanation_cn": "一种通常由皮革或金属制成的环状物，戴在动物（尤其是狗）的脖子上，用于识别或控制它。",
      "example_en": "The dog wore a collar with its name and owner's phone number engraved on it.",
      "example_cn": "这只狗戴着一个刻有它名字和主人电话号码的项圈。"
    },
    {
      "pos": "noun",
      "explanation_en": "A narrow band or rim around the top of a cylindrical object, such as a bottle or a pipe, serving as a structural or functional edge.",
      "explanation_cn": "圆柱形物体（如瓶子或管道）顶部周围的一条窄边或边缘，起结构支撑或功能作用。",
      "example_en": "The bottle's collar was designed to make it easier to grip.",
      "example_cn": "这个瓶子的瓶口设计得更容易握持。"
    },
    {
      "pos": "verb",
      "explanation_en": "To arrest or apprehend someone, especially by grabbing or restraining them, often used informally or in journalistic contexts.",
      "explanation_cn": "逮捕或拘捕某人，通常指通过抓住或制服的方式，常用于非正式语境或新闻报道中。",
      "example_en": "The police collared the suspect near the subway station.",
      "example_cn": "警察在地铁站附近将嫌疑人抓获。"
    },
    {
      "pos": "verb",
      "explanation_en": "To put a collar on someone or something, often metaphorically implying control, identification, or restriction.",
      "explanation_cn": "给某人或某物戴上项圈，常隐喻性地表示控制、识别或限制。",
      "example_en": "The company collared its new employees with ID badges on their first day.",
      "example_cn": "公司在员工第一天上班时就给他们发了工牌。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "necklace",
      "analysis": "“Necklace”（项链）是纯粹用于装饰的饰品，通常由珠宝、珠子或金属链组成，强调审美价值，不具功能性控制或识别作用。而 “collar” 可以是装饰性的（如衬衫领），但更多用于实用目的，如控制动物或固定衣物结构。"
    },
    {
      "word_to_compare": "cuff",
      "analysis": "“Cuff”（袖口）是衣物袖子末端的翻折部分，用于装饰或固定袖子，位置在手腕处；而 “collar” 位于颈部。两者虽同为衣物边缘部件，但功能和位置不同，且 “cuff” 无动物项圈或逮捕的引申义。"
    },
    {
      "word_to_compare": "arrest",
      "analysis": "“Arrest”（逮捕）是法律术语，指正式执行拘捕程序，强调合法性与程序性；而 “collar” 作为动词是口语化表达，更强调动作的突然性和物理性（如一把抓住），常用于非正式语境，语气更生动、形象。"
    }
  ]
}