{
  "word": "collect",
  "pronunciation": "kuh·lekt",
  "concise_definition": "v. 收集, 收集品, 收款, 集合",
  "forms": {
    "third_person_singular": "collects",
    "past_tense": "collected",
    "past_participle": "collected",
    "present_participle": "collecting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To gather or bring together items, information, or people from various sources or locations, often systematically or with purpose.",
      "explanation_cn": "指有目的地从不同来源或地点将物品、信息或人聚集在一起，通常具有系统性或明确目标。",
      "example_en": "She collects vintage postcards from around the world.",
      "example_cn": "她收集来自世界各地的复古明信片。"
    },
    {
      "pos": "verb",
      "explanation_en": "To receive money or payments due, especially on behalf of an organization or individual.",
      "explanation_cn": "指代他人或组织收取应得的款项，尤指定期或正式的收款行为。",
      "example_en": "The charity collects donations every month to support homeless families.",
      "example_cn": "该慈善机构每月收取捐款以资助无家可归的家庭。"
    },
    {
      "pos": "verb",
      "explanation_en": "To summon or assemble people or things in one place, often for a specific purpose.",
      "explanation_cn": "指将人或物召集到一个地方，通常为特定目的服务。",
      "example_en": "The teacher collected all the students in the auditorium for the assembly.",
      "example_cn": "老师把所有学生召集到礼堂举行集会。"
    },
    {
      "pos": "verb",
      "explanation_en": "To undergo the process of accumulating or amassing, especially over time, as in the case of dust, memories, or habits.",
      "explanation_cn": "指随着时间推移逐渐积累或积聚，如灰尘、记忆或习惯。",
      "example_en": "Dust had collected on the shelves after months of neglect.",
      "example_cn": "几个月无人打扫，书架上积满了灰尘。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "gather",
      "analysis": "“Gather” (聚集) 更强调将分散的事物自然地或临时地集中起来，常用于非正式场合，如 gather people for a meeting 或 gather flowers。而 “collect” 更强调有目的、有系统地收集，常涉及分类、保存或长期积累，如 collect stamps 或 collect data。"
    },
    {
      "word_to_compare": "accumulate",
      "analysis": "“Accumulate” (积累) 强调数量或程度随时间缓慢增加，通常不强调主动行为，而是自然或被动的结果，如 accumulate wealth 或 accumulate debt。而 “collect” 更强调主动的、有意识的收集行为，且常涉及对物品的保存或整理。"
    },
    {
      "word_to_compare": "amass",
      "analysis": "“Amass” (大量聚集) 通常用于指大量积累财富、权力或资源，带有强烈的目的性和规模感，常含褒贬色彩（如 amass a fortune）。它比 “collect” 更强调数量庞大和结果导向，而 “collect” 更注重过程和分类，常用于个人爱好或系统性行为。"
    }
  ]
}