{
  "word": "collected",
  "pronunciation": "kuh·lekt·id",
  "concise_definition": "adj. 镇定的, 沉着的; v. 收集, 收集到 (collect 的过去式和过去分词)",
  "forms": {
    "base_form": "collect",
    "third_person_singular": "collects",
    "past_tense": "collected",
    "past_participle": "collected",
    "present_participle": "collecting",
    "plural_noun": "collections"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Showing calmness and self-control, especially under pressure or in a difficult situation; not emotionally disturbed or hasty.",
      "explanation_cn": "指在压力或困难情况下仍保持冷静和自制，情绪不波动、不仓促。",
      "example_en": "Despite the chaos around her, she remained collected and gave clear instructions.",
      "example_cn": "尽管周围一片混乱，她仍保持镇定，给出了清晰的指示。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Carefully assembled or compiled, often over time, with attention to detail and quality; referring to a curated set of items.",
      "explanation_cn": "指经过长时间精心收集或整理，注重细节与品质的集合物，常用于描述有选择性的藏品或资料。",
      "example_en": "The museum houses a collected array of ancient manuscripts from across Europe.",
      "example_cn": "这座博物馆收藏了来自欧洲各地的古代手稿珍品。"
    },
    {
      "pos": "verb",
      "explanation_en": "To gather or bring together things or people from different places or sources, often systematically or over time.",
      "explanation_cn": "指从不同地点或来源将事物或人聚集起来，通常是有系统地或在一段时间内完成。",
      "example_en": "She collected seashells during her summer vacations on the coast.",
      "example_cn": "她在沿海度过的暑假里收集贝壳。"
    },
    {
      "pos": "verb",
      "explanation_en": "To receive payment for something owed, such as debts or taxes, often as part of an official or formal process.",
      "explanation_cn": "指收取应付款项，如债务或税款，通常作为正式或官方程序的一部分。",
      "example_en": "The city employs officers to collect parking fines from violators.",
      "example_cn": "市政府雇用人员向违规者收取停车罚款。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "calm",
      "analysis": "“Calm” (平静的) 是一个更通用的形容词，描述情绪或环境的安宁状态，不强调自制力或应对压力的能力。而 “collected” 更突出在压力下仍能保持理性与控制，带有更强的意志力和心理韧性。"
    },
    {
      "word_to_compare": "gathered",
      "analysis": "“Gathered” (聚集的) 是 “collect” 的近义词，但更侧重于物理上的聚集动作，常用于人群或物体的简单集中，缺乏 “collected” 所蕴含的系统性、选择性或长期积累的意味。例如，gathered leaves（捡起的落叶） vs. collected stamps（收藏的邮票）。"
    },
    {
      "word_to_compare": "curated",
      "analysis": "“Curated” (精心挑选的) 与 “collected” 在描述藏品时有重叠，但 “curated” 更强调专业性、审美判断和策展意图，常用于博物馆、艺术或数字内容领域。而 “collected” 更中性，可指任何有目的的收集行为，不一定有专业筛选。"
    }
  ]
}