{
  "word": "collection",
  "pronunciation": "kuh·lek·shun",
  "concise_definition": "n. 收集, 收藏品, 集合, 征收",
  "forms": {
    "plural": "collections"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of gathering or accumulating items, often over time, with the purpose of organizing, preserving, or studying them.",
      "explanation_cn": "指随着时间推移，有意识地收集、积累物品，目的是为了整理、保存或研究。",
      "example_en": "Her collection of vintage postcards spans over 50 years.",
      "example_cn": "她的复古明信片收藏跨越了五十余年。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of related items, especially those assembled by an artist, designer, or brand, presented together as a unified set (e.g., fashion, art, or literature).",
      "explanation_cn": "指一组具有关联性的物品，尤指由艺术家、设计师或品牌整合呈现的一套作品（如时装系列、艺术作品集或文学选集）。",
      "example_en": "The designer unveiled her spring collection at Paris Fashion Week.",
      "example_cn": "这位设计师在巴黎时装周上发布了她的春季系列。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process or act of gathering money, taxes, or payments from individuals or organizations.",
      "explanation_cn": "指从个人或组织那里收取款项、税款或费用的过程或行为。",
      "example_en": "The charity's annual collection raised over $100,000 for homeless shelters.",
      "example_cn": "该慈善机构的年度募捐活动为无家可归者收容所筹集了超过十万美元。"
    },
    {
      "pos": "noun",
      "explanation_en": "In mathematics and computer science, a group of elements treated as a single unit, such as a set, list, or array.",
      "explanation_cn": "在数学和计算机科学中，指被当作单一单元处理的一组元素，如集合、列表或数组。",
      "example_en": "The program iterates through the collection of user IDs to validate access.",
      "example_cn": "该程序遍历用户ID集合以验证访问权限。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "accumulation",
      "analysis": "“Accumulation”（积累）强调数量或物质的持续增加，通常不带有组织性或目的性，侧重于结果的堆叠。而 “collection” 更强调有意识、有选择地收集，并常隐含分类、保存或展示的意图。"
    },
    {
      "word_to_compare": "assortment",
      "analysis": "“Assortment”（ assortment， assortment）指一组多样化的物品，强调种类的丰富性，但不一定是由某人主动收集而来。而 “collection” 暗示了收集者的主动参与和长期投入，具有个人或专业意图。"
    },
    {
      "word_to_compare": "set",
      "analysis": "“Set”（集合）在数学或日常语境中指一组具有共同特征的元素，结构更严谨、边界更清晰。而 “collection” 更宽泛、更口语化，可以包含杂乱或非系统性的物品，不一定符合逻辑或数学上的集合定义。"
    }
  ]
}