{
  "word": "collective",
  "pronunciation": "kuh·lek·tiv",
  "concise_definition": "adj. 集体的, 共同的; n. 集体, 联合体",
  "forms": {
    "comparative": "more collective",
    "superlative": "most collective"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Belonging to or involving a group of people acting together as a unit, rather than as individuals; characterized by shared ownership, responsibility, or decision-making.",
      "explanation_cn": "属于或涉及一群人作为整体共同行动，而非个体单独行动；以共同拥有、责任或决策为特征。",
      "example_en": "The artists formed a collective to share studio space and exhibit their work together.",
      "example_cn": "这些艺术家组成一个联合体，共同分享工作室空间并联合展出作品。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or representing the interests of a group as a whole, rather than individual members.",
      "explanation_cn": "与群体整体的利益相关，而非单个成员的利益。",
      "example_en": "The collective memory of the community shaped its cultural identity.",
      "example_cn": "社区的集体记忆塑造了其文化认同。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of people who work together in a cooperative or non-hierarchical structure, often sharing resources and responsibilities equally.",
      "explanation_cn": "一群以合作或非等级结构共同工作的人，通常平等分享资源与责任。",
      "example_en": "The housing collective manages all maintenance and rent payments collectively.",
      "example_cn": "这个住房联合体共同管理所有维修和租金支付事务。"
    },
    {
      "pos": "noun",
      "explanation_en": "A collection or aggregation of things, especially when viewed as a unified whole rather than as separate parts.",
      "explanation_cn": "事物的集合或总和，尤其当被视为一个统一整体而非独立部分时。",
      "example_en": "The museum displayed a collective of ancient artifacts from across the Mediterranean.",
      "example_cn": "博物馆展出了来自地中海各地的一批古代文物。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "group",
      "analysis": "“Group”（群体）是一个中性、泛指的词，仅表示若干人或物的聚集，不隐含合作、共享或共同目标。而 “collective” 强调成员之间的协作、共同决策和利益共享，具有更强的社会组织性和意识形态色彩。"
    },
    {
      "word_to_compare": "community",
      "analysis": "“Community”（社区）通常指基于地理、文化或共同利益而自然形成的群体，强调归属感和长期关系。而 “collective” 更侧重于有意识组织起来、为特定目的而联合的结构，可能不依赖地域或血缘，更具行动导向。"
    },
    {
      "word_to_compare": "coalition",
      "analysis": "“Coalition”（联盟）通常指为实现特定短期目标而临时联合的不同团体或政党，常具有政治性，且成员可能保留独立身份。而 “collective” 更强调持续性、平等性和内部整合，成员身份更紧密，目标更广泛。"
    }
  ]
}