{
  "word": "collapse",
  "pronunciation": "kuh·laps",
  "concise_definition": "v. 崩溃, 倒塌, 瓦解; n. 崩溃, 倒塌",
  "forms": {
    "third_person_singular": "collapses",
    "past_tense": "collapsed",
    "past_participle": "collapsed",
    "present_participle": "collapsing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To fall down or inward suddenly and completely, often due to loss of structural integrity or support, as in buildings, bridges, or systems.",
      "explanation_cn": "指因失去结构完整性或支撑而突然且完全地向下或向内倒塌，常用于建筑物、桥梁或系统。",
      "example_en": "The old bridge collapsed under the weight of the heavy truck.",
      "example_cn": "这座旧桥在重型卡车的重压下倒塌了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fail suddenly and completely, especially in terms of systems, organizations, or bodily functions, often due to stress, exhaustion, or external pressure.",
      "explanation_cn": "指系统、组织或身体功能因压力、疲惫或外部压力而突然彻底失效或崩溃。",
      "example_en": "The stock market collapsed after the financial scandal was revealed.",
      "example_cn": "金融丑闻曝光后，股市彻底崩盘。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fold or compress something into a smaller or more compact form, often for storage or convenience.",
      "explanation_cn": "指将某物折叠或压缩成更小、更紧凑的形式，通常为了便于存放或使用。",
      "example_en": "You can collapse the stroller and fit it in the trunk.",
      "example_cn": "你可以把婴儿车折叠起来放进后备箱。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden and complete failure or breakdown of a structure, system, or organization.",
      "explanation_cn": "指结构、系统或组织的突然且彻底的失败或崩溃。",
      "example_en": "The collapse of the empire led to decades of political instability.",
      "example_cn": "帝国的崩溃导致了数十年的政治动荡。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fall",
      "analysis": "“Fall” (落下) 是一个更通用的词，指任何从高处向下的运动，可以是缓慢的、部分的或自然的（如树叶飘落）。“Collapse” 则强调结构或系统的整体性、突然性和灾难性崩塌，通常伴随功能丧失。"
    },
    {
      "word_to_compare": "crumble",
      "analysis": "“Crumble” (碎裂/瓦解) 指缓慢、渐进地分解成小块，常用于描述物质（如石头、饼干）或抽象事物（如信任）的逐渐失效。而 “collapse” 是瞬间的、整体性的崩溃，更剧烈、更彻底。"
    },
    {
      "word_to_compare": "fold",
      "analysis": "“Fold” (折叠) 通常是有意、可控地将物体变小，如折叠纸张或帐篷，不带有负面含义。“Collapse” 在表示折叠时，常指因失去支撑而意外或被迫地变小，隐含失败或失控的意味。"
    }
  ]
}