{
  "word": "collapsed",
  "pronunciation": "kuh·lapsd",
  "concise_definition": "v. 倒塌, 崩溃, 垮掉; adj. 倒塌的, 崩溃的",
  "forms": {
    "base_form": "collapse",
    "present_participle": "collapsing",
    "past_tense": "collapsed",
    "past_participle": "collapsed",
    "adjective_form": "collapsed"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To fall down or inward suddenly and completely, often due to loss of structural support or pressure; commonly used for buildings, bridges, or physical structures.",
      "explanation_cn": "指因失去结构支撑或承受过大压力而突然完全倒塌，常用于描述建筑物、桥梁等物理结构的崩塌。",
      "example_en": "The old bridge collapsed under the weight of the heavy truck.",
      "example_cn": "这座旧桥在重型卡车的重压下倒塌了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fail suddenly and completely, especially in terms of systems, organizations, or bodily functions, often due to stress, exhaustion, or overload.",
      "explanation_cn": "指系统、组织或身体功能因压力、疲惫或超负荷而突然彻底崩溃。",
      "example_en": "The company's financial system collapsed after the fraud was exposed.",
      "example_cn": "欺诈行为曝光后，公司的财务系统彻底崩溃了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fold or compress something into a smaller or more compact form, often intentionally.",
      "explanation_cn": "指将某物折叠或压缩成更小、更紧凑的形式，通常是有意为之。",
      "example_en": "She collapsed the stroller and put it in the trunk.",
      "example_cn": "她把婴儿车折叠起来，放进了后备箱。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that has fallen down or caved in, often used to refer to physical structures or conditions.",
      "explanation_cn": "形容某物已经倒塌或塌陷，常用于描述物理结构或状态。",
      "example_en": "The collapsed building was cordoned off by police.",
      "example_cn": "那座倒塌的建筑已被警方封锁。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fall",
      "analysis": "“Fall” (落下/掉落) 是一个更通用的词，指任何从高处向低处的运动，不必然伴随结构破坏。而 “collapse” 强调的是因内部失效或外力导致的整体性、突然性的崩塌，通常意味着彻底的失败或解体。"
    },
    {
      "word_to_compare": "crumble",
      "analysis": "“Crumble” (碎裂/逐渐崩解) 指缓慢、零散地分解，常用于描述材料如砖石、饼干等逐渐变碎的过程。而 “collapse” 是突然、整体性的倒塌，速度更快，破坏更剧烈。"
    },
    {
      "word_to_compare": "fail",
      "analysis": "“Fail” (失败) 是一个广泛使用的词，可指任何目标未达成，如考试失败、计划失败。而 “collapse” 更强调系统性、结构性的崩溃，常带有物理或功能上的彻底瓦解意味，语义更强烈、更具体。"
    }
  ]
}