{
  "word": "collapses",
  "pronunciation": "kuh·lapsts",
  "concise_definition": "v. 崩溃, 倒塌, 瓦解",
  "forms": {
    "base_form": "collapse",
    "third_person_singular": "collapses",
    "past_tense": "collapsed",
    "past_participle": "collapsed",
    "present_participle": "collapsing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To fall down or give way suddenly under pressure or due to structural failure, often referring to physical structures like buildings or bridges.",
      "explanation_cn": "指在压力或结构失效的情况下突然倒塌或垮塌，常用于描述建筑物、桥梁等物理结构。",
      "example_en": "The old bridge collapsed during the heavy storm.",
      "example_cn": "这座旧桥在暴雨中倒塌了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fail suddenly and completely, especially in systems, organizations, or functions, often due to internal weaknesses or external stress.",
      "explanation_cn": "指系统、组织或功能因内部弱点或外部压力而突然彻底失败。",
      "example_en": "The company collapsed after years of mismanagement and mounting debt.",
      "example_cn": "这家公司因多年管理不善和债务累积而破产了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To contract or fold inward suddenly, often describing bodily movements or containers, such as a person fainting or a chair folding.",
      "explanation_cn": "指突然向内收缩或折叠，常用于描述人体（如晕倒）或容器（如椅子折叠）的动作。",
      "example_en": "She collapsed onto the sofa after a long day of work.",
      "example_cn": "经过漫长的一天工作，她瘫倒在沙发上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a system of prices, values, or economic conditions to break down abruptly, often due to loss of confidence or external shock.",
      "explanation_cn": "指由于信心丧失或外部冲击，导致价格、价值或经济状况突然崩溃。",
      "example_en": "The currency collapsed after the government lost control of inflation.",
      "example_cn": "政府失去对通货膨胀的控制后，该国货币急剧贬值。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fall",
      "analysis": "“Fall” (落下) 是一个更通用的词，指任何从高处向低处的运动，可以是自然的、缓慢的或无破坏性的（如树叶飘落）。而 “collapse” 强调的是因结构或系统失效而导致的突然、灾难性的崩塌，具有更强的破坏性和突发性。"
    },
    {
      "word_to_compare": "crumble",
      "analysis": "“Crumble” (碎裂/瓦解) 指缓慢、逐渐地分解成小块，常用于描述固体物质（如饼干、墙壁）因老化或风化而碎裂。它强调过程的渐进性，而 “collapse” 是瞬间的、整体性的崩溃。"
    },
    {
      "word_to_compare": "fail",
      "analysis": "“Fail” (失败) 是一个广泛使用的词，泛指未能达成目标或功能失效，可以是轻微的或部分的（如考试失败）。而 “collapse” 暗示的是彻底的、不可逆转的系统性崩溃，通常伴随物理或功能上的毁灭性后果。"
    }
  ]
}