{
  "word": "collapsing",
  "pronunciation": "kuh·laps·ing",
  "concise_definition": "v. 崩溃, 倒塌, 瓦解 (现在分词形式)",
  "forms": {
    "base_form": "collapse",
    "third_person_singular": "collapses",
    "past_tense": "collapsed",
    "past_participle": "collapsed",
    "gerund": "collapsing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To fall down or inward suddenly and completely, often due to loss of structural support or pressure; used for physical structures like buildings, bridges, or bodies.",
      "explanation_cn": "指因失去结构支撑或承受过大压力而突然完全倒塌或向内塌陷，常用于描述建筑物、桥梁或人体等物理实体。",
      "example_en": "The old bridge was collapsing under the weight of the heavy truck.",
      "example_cn": "这座旧桥在重型卡车的重压下正在坍塌。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fail suddenly and completely, especially in terms of systems, organizations, or functions, often due to internal weakness or external stress.",
      "explanation_cn": "指系统、组织或功能因内部虚弱或外部压力而突然彻底崩溃或失效。",
      "example_en": "The company's financial system was collapsing under the burden of debt.",
      "example_cn": "该公司财务系统在债务重压下正在崩溃。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fold or contract suddenly into a smaller or more compact form, often used for objects like furniture or containers.",
      "explanation_cn": "指物体突然折叠或收缩成更小、更紧凑的形式，常用于描述家具、容器等可折叠物品。",
      "example_en": "She was collapsing the stroller before rushing to catch the train.",
      "example_cn": "她正忙着把婴儿车折叠起来，好赶在火车开前冲上去。"
    },
    {
      "pos": "verb",
      "explanation_en": "To lose emotional or mental stability, often used metaphorically to describe a person breaking down under pressure.",
      "explanation_cn": "指在压力下失去情绪或心理上的稳定，常用于隐喻性地描述一个人精神崩溃。",
      "example_en": "After months of sleepless nights, he was collapsing under the stress of his job.",
      "example_cn": "经历了数月的失眠后，他因工作压力而精神崩溃了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "falling",
      "analysis": "“Falling” (下落/跌落) 通常指物体在重力作用下垂直向下移动，强调方向性，不一定伴随结构破坏。而 “collapsing” 强调的是整体结构的瓦解或崩溃，可能是向内、向四周或整体性地溃败，常伴随功能丧失。"
    },
    {
      "word_to_compare": "crumbling",
      "analysis": "“Crumbling” (碎裂/逐渐崩解) 指缓慢、零散地分解，常带有渐进性和碎片化特征，如老墙一块块剥落。而 “collapsing” 是突然、整体性的崩溃，更剧烈、更彻底，通常在短时间内完成。"
    },
    {
      "word_to_compare": "failing",
      "analysis": "“Failing” (失败) 是一个更广泛的词，泛指未能达成目标或功能失效，可以是渐进的、部分的或抽象的（如考试失败）。而 “collapsing” 更强调系统性、结构性的彻底崩溃，常带有物理或情感上的灾难性含义，强度更高。"
    }
  ]
}