{
  "word": "colonies",
  "pronunciation": "kol·uh·neez",
  "concise_definition": "n. 殖民地, 群落, 移民聚居区",
  "forms": {
    "singular": "colony"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A territory or region politically controlled by a foreign power, often settled by people from that power, and governed under its laws and economic systems.",
      "explanation_cn": "指被外国势力政治控制的领土或地区，通常由该国人民移居定居，并受其法律和经济体系管辖。",
      "example_en": "The British Empire once ruled over dozens of colonies across Africa, Asia, and the Americas.",
      "example_cn": "大英帝国曾统治着遍布非洲、亚洲和美洲的数十个殖民地。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of organisms of the same species living closely together in a coordinated community, often sharing resources and labor (common in biology).",
      "explanation_cn": "指同种生物个体紧密生活在一起、形成有组织的群体，常共享资源与劳动（常见于生物学）。",
      "example_en": "Ant colonies can contain millions of individuals working together in highly organized roles.",
      "example_cn": "蚁群可以包含数百万只个体，以高度组织化的方式协同工作。"
    },
    {
      "pos": "noun",
      "explanation_en": "A settlement established by immigrants from one country in a distant land, maintaining cultural and political ties to their homeland.",
      "explanation_cn": "指一国移民在遥远土地上建立的聚居区，仍与母国保持文化和政治联系。",
      "example_en": "The early American colonies were founded by English settlers seeking religious freedom.",
      "example_cn": "早期的北美殖民地是由寻求宗教自由的英国移民建立的。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "settlement",
      "analysis": "“Settlement”（定居点）泛指人类在新地区建立的居住地，不强调政治控制或从属关系。它可以是独立的、自发形成的社区。而 “colony” 特指受外来政权统治或控制的定居地，具有明确的权力从属和剥削性质。"
    },
    {
      "word_to_compare": "community",
      "analysis": "“Community”（社区）强调人群之间的社会联系、共同利益或文化认同，可以是本地的、自发的、平等的组织。而 “colony” 通常隐含权力不平等、外部控制和资源掠夺，具有政治和经济的压迫性特征。"
    },
    {
      "word_to_compare": "outpost",
      "analysis": "“Outpost”（前哨站）指位于偏远或边境地区的军事或战略据点，规模小、功能单一，主要用于监视或防御。而 “colony” 是一个更全面、长期存在的社会实体，包含人口、经济、行政系统，远不止军事功能。"
    }
  ]
}