{
  "word": "colonization",
  "pronunciation": "kol·uh·nuh·zey·shuhn",
  "concise_definition": "n. 殖民, 殖民化, 殖民统治",
  "forms": {
    "plural": "colonizations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process by which a country establishes control over a foreign territory and its people, often through settlement, political domination, economic exploitation, and cultural assimilation.",
      "explanation_cn": "指一个国家通过移民定居、政治控制、经济剥削和文化同化等方式对外国领土及其人民实施统治的过程。",
      "example_en": "The colonization of the Americas by European powers in the 15th and 16th centuries led to widespread displacement of Indigenous populations.",
      "example_cn": "15至16世纪欧洲列强对美洲的殖民导致了原住民的大规模流离失所。"
    },
    {
      "pos": "noun",
      "explanation_en": "The establishment of a colony or colonies, especially in a region previously uninhabited or sparsely populated by the colonizing group.",
      "explanation_cn": "指在先前未被或仅零星居住的地区建立殖民地的行为，通常由殖民群体主导。",
      "example_en": "Australia's colonization by the British began in 1788 with the arrival of the First Fleet.",
      "example_cn": "英国对澳大利亚的殖民始于1788年第一舰队的抵达。"
    },
    {
      "pos": "noun",
      "explanation_en": "The metaphorical or biological process of taking over and settling in a new environment, such as the colonization of the human gut by beneficial bacteria or the colonization of Mars by future human settlers.",
      "explanation_cn": "比喻性或生物学意义上的‘占领并定居于新环境’，例如有益细菌在人体肠道内的定植，或未来人类对火星的殖民。",
      "example_en": "The colonization of Mars remains a long-term goal for space agencies seeking to ensure humanity's survival beyond Earth.",
      "example_cn": "对火星的殖民仍是太空机构为确保人类在地球之外生存而追求的长期目标。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "imperialism",
      "analysis": "“Imperialism”（帝国主义）强调国家通过政治、经济或军事手段扩张权力、控制他国或地区，是一种宏观的意识形态和政策体系；而 “colonization” 更侧重于具体的实施过程，如建立定居点、管理殖民地。帝国主义可能包含殖民化，但也可以通过间接控制实现，无需实际移民定居。"
    },
    {
      "word_to_compare": "settlement",
      "analysis": "“Settlement”（定居）仅指人们迁移到某地并建立居住点的行为，不必然包含政治控制或文化压迫；而 “colonization” 隐含了权力不对等的统治关系，通常伴随着剥削和强制同化。定居可以是和平的，殖民则几乎总是带有压迫性。"
    },
    {
      "word_to_compare": "occupation",
      "analysis": "“Occupation”（占领）通常指军事力量暂时控制某地，强调武力存在和短期控制，不一定涉及长期移民或制度建设；而 “colonization” 是长期的、系统性的统治与社会重构，目标是永久性改变被殖民地的社会结构和文化。"
    }
  ]
}