{
  "word": "colonial",
  "pronunciation": "koh·lohn·ee·uhl",
  "concise_definition": "adj. 殖民地的, 殖民的, 殖民时期风格的",
  "forms": {
    "comparative": "more colonial",
    "superlative": "most colonial"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to a colony or to the practice of establishing and maintaining colonies, especially by a foreign power over another territory and its people.",
      "explanation_cn": "指与殖民地或建立并维持殖民地的行为有关的，尤指一个外国势力对另一片领土及其人民的控制与统治。",
      "example_en": "The colonial policies of Britain in India led to widespread economic exploitation.",
      "example_cn": "英国在印度的殖民政策导致了广泛的经济剥削。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characteristic of or influenced by the architecture, design, or culture of a colonial period, especially in former colonies like the United States or Australia.",
      "explanation_cn": "指具有殖民时期特征或受其影响的建筑、设计或文化，尤指美国、澳大利亚等前殖民地的风格。",
      "example_en": "They restored the house to its original colonial style with white clapboard walls and shutters.",
      "example_cn": "他们将这栋房子修复为原始的殖民地风格，配有白色木板墙和百叶窗。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Exhibiting attitudes of superiority or domination associated with colonial rule, often used critically to describe cultural or political attitudes.",
      "explanation_cn": "带有与殖民统治相关的优越感或支配态度，常用于批评性语境中描述文化或政治上的殖民心态。",
      "example_en": "His colonial attitude toward the local staff was deeply offensive and outdated.",
      "example_cn": "他对当地员工的殖民式态度既冒犯又过时。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "imperial",
      "analysis": "“Imperial”（帝国的）强调与帝国体系、皇权或宏大统治结构相关，范围更广，可涵盖军事、政治和文化霸权，不一定局限于殖民地。而 “colonial” 更具体地指向对海外领土的直接控制与管理，常带有经济剥削和文化压制的含义。"
    },
    {
      "word_to_compare": "foreign",
      "analysis": "“Foreign”（外国的）仅表示来自其他国家，是中性描述，不隐含统治或控制关系。而 “colonial” 暗示了权力不对等的支配关系，具有强烈的政治和历史批判色彩。例如，外国公司 ≠ 殖民公司，但殖民公司一定具有外国统治背景。"
    },
    {
      "word_to_compare": "historic",
      "analysis": "“Historic”（历史的）泛指具有历史意义或来自过去的事物，不特指殖民时期。而 “colonial” 是一个具有特定历史语境的术语，专指15至20世纪欧洲列强建立殖民体系的时期及其遗留影响。一个建筑可以是historic但不colonial，反之亦然。"
    }
  ]
}