{
  "word": "colony",
  "pronunciation": "kol·uh·nee",
  "concise_definition": "n. 殖民地, 群落, 聚居地",
  "forms": {
    "plural": "colonies"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A territory under the political control of a foreign power, often settled and governed by people from that power, with limited or no self-rule.",
      "explanation_cn": "指受外国势力政治控制的领土，通常由该国人民定居并管理，缺乏或完全没有自治权。",
      "example_en": "India was a British colony until it gained independence in 1947.",
      "example_cn": "印度直到1947年独立前一直是英国的殖民地。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of organisms of the same species living closely together in a structured community, often with division of labor (e.g., ants, bees, or penguins).",
      "explanation_cn": "指同种生物以紧密结构化群体形式共同生活，常有劳动分工（如蚂蚁、蜜蜂或企鹅）。",
      "example_en": "The ant colony worked efficiently, with workers, soldiers, and a queen each fulfilling specific roles.",
      "example_cn": "这个蚁群运作高效，工蚁、兵蚁和蚁后各司其职。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of people from the same country or background living together in a foreign land, often maintaining cultural ties to their homeland.",
      "explanation_cn": "指一群来自同一国家或背景的人在异国他乡聚居，通常仍保持与祖国的文化联系。",
      "example_en": "There is a large Chinese colony in San Francisco, with its own restaurants, temples, and festivals.",
      "example_cn": "旧金山有一个庞大的华人社区，拥有自己的餐馆、寺庙和节日。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "settlement",
      "analysis": "“Settlement” (定居点) 指人们在某地建立的居住区，强调居住行为本身，不涉及政治控制或组织结构。它可以是自发形成的，也可以是临时的。而 “colony” 通常隐含外来统治、系统性管理和文化输出，具有更强的政治和历史含义。"
    },
    {
      "word_to_compare": "community",
      "analysis": "“Community” (社区) 是一个中性词，泛指任何有共同利益、地域或身份的人群集合，不涉及权力关系或地理从属。而 “colony” 特指在外部权威控制下形成的群体，常带有权力不对等的色彩，尤其在历史语境中。"
    },
    {
      "word_to_compare": "nest",
      "analysis": "“Nest” (巢穴) 通常用于描述动物（如鸟类或昆虫）为繁殖或栖息而建造的物理结构，强调的是物理空间而非社会结构。而 “colony” 指的是具有社会分工和组织的群体，即使没有固定建筑（如人类殖民地），也强调群体性与功能性。"
    }
  ]
}