{
  "word": "colour",
  "pronunciation": "kuhl·ur",
  "concise_definition": "n. 颜色, 色彩; v. 给...着色",
  "forms": {
    "plural": "colours",
    "third_person_singular": "colours",
    "past_tense": "coloured",
    "past_participle": "coloured",
    "present_participle": "colouring"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The property of an object that depends on the light it reflects or emits, perceived by the human eye as red, blue, green, etc.",
      "explanation_cn": "物体因反射或发射光线而呈现出的视觉特性，被人眼感知为红色、蓝色、绿色等。",
      "example_en": "The colour of the sky changes dramatically at sunset.",
      "example_cn": "日落时，天空的颜色会发生显著变化。"
    },
    {
      "pos": "noun",
      "explanation_en": "A particular shade or hue within a category of colour, often used to describe appearance, mood, or symbolism.",
      "explanation_cn": "某一类颜色中的特定色调，常用于描述外观、情绪或象征意义。",
      "example_en": "She chose a soft pastel colour for her bedroom walls.",
      "example_cn": "她为卧室墙壁选了一种柔和的淡彩颜色。"
    },
    {
      "pos": "noun",
      "explanation_en": "A distinguishing feature or characteristic, often used metaphorically to imply bias, perspective, or interpretation.",
      "explanation_cn": "一种区别性特征或特性，常用于比喻意义上表示偏见、视角或解释方式。",
      "example_en": "The report was written with a political colour, favouring one side of the debate.",
      "example_cn": "这份报告带有政治偏见，偏向辩论中的某一方。"
    },
    {
      "pos": "verb",
      "explanation_en": "To apply pigment or dye to something in order to change its appearance or add visual interest.",
      "explanation_cn": "通过施加颜料或染料来改变某物的外观或增加视觉吸引力。",
      "example_en": "Children love to colour in the pictures with crayons.",
      "example_cn": "孩子们喜欢用蜡笔给图画上色。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "color",
      "analysis": "“Color” 是 “colour” 的美式拼写，两者在含义和用法上完全相同，仅在拼写上因英式英语与美式英语的差异而不同。在英式英语中使用 “colour”，在美式英语中使用 “color”。"
    },
    {
      "word_to_compare": "hue",
      "analysis": "“Hue” (色相) 是颜色理论中的专业术语，特指光谱中基本的颜色类别（如红、黄、蓝），是颜色的“种类”而非深浅或饱和度。而 “colour” 是更广泛、更日常的术语，包含 hue、saturation 和 brightness 的综合感知。"
    },
    {
      "word_to_compare": "tint",
      "analysis": "“Tint” (浅色/淡彩) 指在纯色中加入白色后形成的较浅版本，强调颜色的明度变化。而 “colour” 是一个总称，不特指明暗变化。例如，粉红是红色的 tint，但红色本身是 colour。"
    }
  ]
}