{
  "word": "columbia",
  "pronunciation": "koh·lum·bee·uh",
  "concise_definition": "n. 哥伦比亚（国家/地区/大学等）",
  "forms": {
    "proper_noun": true
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The Republic of Colombia, a country in northwestern South America, bordered by Panama, Venezuela, Brazil, Peru, and Ecuador. It is known for its biodiversity, coffee production, and rich cultural heritage.",
      "explanation_cn": "位于南美洲西北部的国家，与巴拿马、委内瑞拉、巴西、秘鲁和厄瓜多尔接壤，以生物多样性、咖啡生产和丰富的文化遗产而闻名。",
      "example_en": "Colombia is famous for its high-quality Arabica coffee beans.",
      "example_cn": "哥伦比亚以其高品质的阿拉比卡咖啡豆而闻名。"
    },
    {
      "pos": "noun",
      "explanation_en": "A poetic or historical name for the United States of America, derived from Christopher Columbus, often used in literature, institutions, and patriotic contexts.",
      "explanation_cn": "源自克里斯托弗·哥伦布的美国诗意或历史名称，常用于文学、机构名称和爱国语境中。",
      "example_en": "The statue of Columbia symbolizes liberty and democracy in American iconography.",
      "example_cn": "在美國象徵體系中，哥倫比亞女神象徵自由與民主。"
    },
    {
      "pos": "noun",
      "explanation_en": "A prestigious private research university in New York City, officially named Columbia University, founded in 1754 as King's College.",
      "explanation_cn": "位于纽约市的一所著名私立研究型大学，正式名称为哥伦比亚大学，成立于1754年，原名国王学院。",
      "example_en": "She earned her Ph.D. in literature from Columbia University.",
      "example_cn": "她在哥伦比亚大学获得了文学博士学位。"
    },
    {
      "pos": "noun",
      "explanation_en": "A district or region in Canada, historically referring to the Columbia River region or the former Colony of British Columbia.",
      "explanation_cn": "加拿大历史上指哥伦比亚河流域或前英属哥伦比亚殖民地的地区。",
      "example_en": "The scenic beauty of British Columbia attracts tourists from around the world.",
      "example_cn": "不列颠哥伦比亚省的自然美景吸引了来自世界各地的游客。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "America",
      "analysis": "“America” 通常指美利坚合众国（United States），是一个现代政治实体的通用名称；而 “Columbia” 作为美国的诗意代称，更具历史和象征意义，多用于文学、艺术或国家象征中，如自由女神像的别称。"
    },
    {
      "word_to_compare": "Colombia",
      "analysis": "“Colombia”（哥伦比亚国家）与 “Columbia”（美国/大学/地区）拼写相近但发音和含义不同。前者是南美洲国家，后者多用于英语国家的名称或机构。拼写差异在于：Colombia 有双 'o'，而 Columbia 为单 'o'，这是区分两者的关键。"
    },
    {
      "word_to_compare": "Christopher Columbus",
      "analysis": "“Christopher Columbus” 是15世纪的探险家，是 “Columbia” 这一名称的词源。Columbia 是以他的名字拉丁化形式（Columbus → Columbia）衍生出的象征性名称，用于代表新大陆或美国，而 Columbus 本身是具体的历史人物。"
    }
  ]
}