{
  "word": "comb",
  "pronunciation": "kohm",
  "concise_definition": "n. 梳子, 梳理; v. 梳理, 搜寻, 梳状物",
  "forms": {
    "third_person_singular": "combs",
    "past_tense": "combed",
    "past_participle": "combed",
    "present_participle": "combing",
    "plural": "combs"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A tool with closely spaced teeth, used for untangling or styling hair, or for removing lice and debris.",
      "explanation_cn": "一种带有密集齿状结构的工具，用于梳理头发、整理发型，或去除虱子和杂物。",
      "example_en": "She ran a plastic comb through her long, curly hair.",
      "example_cn": "她用一把塑料梳子梳理她又长又卷的头发。"
    },
    {
      "pos": "noun",
      "explanation_en": "The honeycomb-like structure formed by bees, made of wax and used to store honey and raise young.",
      "explanation_cn": "蜜蜂用蜂蜡筑成的六边形蜂巢结构，用于储存蜂蜜和哺育幼虫。",
      "example_en": "The beekeeper carefully removed a frame filled with golden comb from the hive.",
      "example_cn": "养蜂人小心地从蜂箱中取下一块装满金色蜂巢的蜂框。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pass a comb through hair or fur to remove tangles, dirt, or parasites.",
      "explanation_cn": "用梳子梳理头发或毛发，以去除打结、污垢或寄生虫。",
      "example_en": "He combed his beard every morning before shaving.",
      "example_cn": "他每天早上刮胡子前都会梳理自己的胡须。"
    },
    {
      "pos": "verb",
      "explanation_en": "To search thoroughly and systematically through a place or area, often to find something hidden or lost.",
      "explanation_cn": "彻底而系统地搜寻某个地方，通常是为了寻找隐藏或丢失的东西。",
      "example_en": "Police combed the forest for clues after the disappearance.",
      "example_cn": "失踪事件发生后，警察对森林进行了彻底搜寻以寻找线索。"
    },
    {
      "pos": "noun",
      "explanation_en": "A ridge or crest, especially one that is pointed or jagged, resembling the teeth of a comb.",
      "explanation_cn": "指突出、尖锐或锯齿状的脊状结构，形状类似梳子的齿。",
      "example_en": "The mountain range had a jagged comb along its skyline.",
      "example_cn": "山脉的天际线呈现出锯齿状的山脊。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "brush",
      "analysis": "“Brush”（刷子）通常指毛发较软、较密集的工具，用于清洁、上色或抛光，适用于大面积或较柔软表面（如地板、画笔、毛刷）。而 “comb” 的齿更硬、更稀疏，专为分离、梳理或去除打结而设计，尤其适用于头发、毛发或蜂巢结构。"
    },
    {
      "word_to_compare": "rake",
      "analysis": "“Rake”（耙子）是一种用于收集落叶、杂草或松土的农具，其齿通常更长、更粗，用于地面作业。虽然 “comb” 和 “rake” 都有齿状结构，但 “comb” 用于精细梳理，而 “rake” 用于粗放收集，功能和使用场景截然不同。"
    },
    {
      "word_to_compare": "scan",
      "analysis": "“Scan”（扫描）指快速浏览或用技术手段（如雷达、摄像头）系统性地检查，常用于信息或数据领域。而 “comb” 作动词时强调物理性、细致入微的搜寻，带有手工操作和耐心的意味，如 ‘comb through documents’，比 ‘scan documents’ 更深入、更耗时。"
    }
  ]
}