{
  "word": "combined",
  "pronunciation": "kum·bīnd",
  "concise_definition": "adj. 组合的, 联合的; v. (combine 的过去式和过去分词) 结合, 联合",
  "forms": {
    "base_form": "combine",
    "third_person_singular": "combines",
    "present_participle": "combining",
    "past_tense": "combined",
    "past_participle": "combined"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Formed by joining two or more elements, parts, or entities together into a single unit or whole, often to achieve a unified effect or purpose.",
      "explanation_cn": "指将两个或多个元素、部分或实体结合成一个统一的整体，通常为了实现协同效应或共同目标。",
      "example_en": "The combined efforts of the team led to a breakthrough in research.",
      "example_cn": "团队的共同努力促成了研究上的突破。"
    },
    {
      "pos": "verb",
      "explanation_en": "To join or unite two or more things, especially to create a more effective or coherent whole through integration.",
      "explanation_cn": "指将两个或多个事物连接或联合起来，尤其通过整合以形成更有效或更连贯的整体。",
      "example_en": "They combined their resources to start a new business.",
      "example_cn": "他们将各自的资源结合起来创办了一家新企业。"
    },
    {
      "pos": "verb",
      "explanation_en": "To bring together different elements, qualities, or characteristics in a single entity or situation, often to enhance functionality or meaning.",
      "explanation_cn": "指在单一实体或情境中融合不同的元素、特质或特征，通常为了增强其功能或意义。",
      "example_en": "The chef combined sweet and savory flavors to create a unique dish.",
      "example_cn": "厨师将甜味与咸味结合，创造出一道独特的菜肴。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "merged",
      "analysis": "“Merged” (合并) 强调两个或多个原本独立的实体完全融合为一个，通常失去原有边界，常用于组织、公司或数据的整合。而 “combined” 更强调功能或目的上的联合，各部分仍可能保留其独立性。"
    },
    {
      "word_to_compare": "united",
      "analysis": "“United” (联合的) 常用于政治、情感或意识形态层面的团结，带有更强的共识或共同目标的意味，如“united nations”。而 “combined” 更中性，侧重物理或操作层面的结合，不一定隐含情感或意志的一致。"
    },
    {
      "word_to_compare": "integrated",
      "analysis": "“Integrated” (整合的) 强调各部分被系统性地融入一个整体，形成协调一致的结构，常用于技术、教育或社会系统中，隐含深度协作与功能互补。而 “combined” 可能仅是简单叠加或并置，不一定达到高度协调。"
    }
  ]
}