{
  "word": "combs",
  "pronunciation": "kohmz",
  "concise_definition": "n. 梳子, 梳理动作; v. 梳理, 搜寻",
  "forms": {
    "singular": "comb"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A tool with closely spaced teeth, used for untangling, styling, or cleaning hair, or for removing lice and debris.",
      "explanation_cn": "一种带有密集齿状结构的工具，用于梳理、造型或清洁头发，也可用于去除虱子和杂物。",
      "example_en": "She picked up her wooden comb and slowly ran it through her long hair.",
      "example_cn": "她拿起木梳，缓缓地从长发中梳过。"
    },
    {
      "pos": "noun",
      "explanation_en": "A ridge or row of raised parts resembling the teeth of a comb, often found in nature or design (e.g., the comb of a rooster, or a comb-like mountain ridge).",
      "explanation_cn": "指形状类似梳齿的凸起条状结构，常见于自然或设计中（如公鸡的鸡冠、锯齿状山脊）。",
      "example_en": "The rooster’s bright red comb stood out prominently against its feathers.",
      "example_cn": "公鸡鲜红的鸡冠在羽毛中格外醒目。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pass a comb through hair or fur to remove tangles, dirt, or parasites.",
      "explanation_cn": "用梳子梳理头发或毛发，以去除打结、污垢或寄生虫。",
      "example_en": "He combed his beard carefully before the interview.",
      "example_cn": "他在面试前仔细地梳理了胡须。"
    },
    {
      "pos": "verb",
      "explanation_en": "To search thoroughly and systematically through an area or collection, often in an effort to find something specific.",
      "explanation_cn": "彻底而系统地搜寻某个区域或集合，通常是为了寻找特定物品或信息。",
      "example_en": "Police combed the forest for clues after the disappearance.",
      "example_cn": "失踪事件发生后，警方对森林进行了彻底搜寻以寻找线索。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "brush",
      "analysis": "“Brush”（刷子）通常指具有更柔软、更蓬松毛发的工具，用于清洁、上色或抛光，适用于表面处理（如刷地板、刷油漆），而 “comb” 的齿状结构专为分离、梳理纤维（如头发、毛发）设计，强调精确的分隔而非覆盖。"
    },
    {
      "word_to_compare": "rake",
      "analysis": "“Rake”（耙子）是一种用于收集落叶、杂草或松土的农具，其齿通常更粗、更长，用于大面积地面作业。而 “comb” 的齿更细密，用于精细梳理，且多用于人体或小范围物体，动作更轻柔、更集中。"
    },
    {
      "word_to_compare": "scan",
      "analysis": "“Scan”（扫描）指快速浏览或用技术手段（如雷达、摄像头）检查大面积区域，强调效率和速度，常用于数字或视觉信息处理。而 “comb” 作为动词时，强调细致入微、逐寸排查，带有手工劳动和耐心的意味，常用于物理空间的彻底搜寻。"
    }
  ]
}