{
  "word": "comes",
  "pronunciation": "kumz",
  "concise_definition": "v. 来, 到达, 发生, 产生",
  "forms": {
    "base_form": "come",
    "past_tense": "came",
    "past_participle": "come",
    "present_participle": "coming",
    "third_person_singular": "comes"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move or travel toward a speaker, a specified location, or a point of reference; to arrive at a place.",
      "explanation_cn": "指向说话者、特定地点或参照点移动或行进；到达某个地方。",
      "example_en": "She comes to work by bus every morning.",
      "example_cn": "她每天早上乘公交车来上班。"
    },
    {
      "pos": "verb",
      "explanation_en": "To occur, happen, or arise, especially in a natural or expected way; often used for events, situations, or opportunities.",
      "explanation_cn": "指（事件、情况或机会）自然或预期地发生或出现。",
      "example_en": "A great opportunity comes once in a lifetime.",
      "example_cn": "一生中难得有一次这样的好机会。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be produced, derived, or originated from a source; to result from something.",
      "explanation_cn": "指从某来源产生、衍生或起源；由某事物导致。",
      "example_en": "This tradition comes from ancient religious practices.",
      "example_cn": "这一传统源自古代的宗教习俗。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be in a particular state or condition, often used in fixed expressions (e.g., comes easy, comes naturally).",
      "explanation_cn": "指处于某种状态或条件，常用于固定搭配（如：来得容易、自然而然地）。",
      "example_en": "Playing the piano comes naturally to her.",
      "example_cn": "弹钢琴对她来说是自然而然的事。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be mentioned, introduced, or presented in a narrative, discussion, or sequence.",
      "explanation_cn": "指在叙述、讨论或序列中被提及、引入或呈现。",
      "example_en": "In the next chapter, a mysterious stranger comes into the story.",
      "example_cn": "在下一章中，一个神秘的陌生人出现了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "arrives",
      "analysis": "“Arrives”（到达）更强调抵达某个具体目的地的终点动作，常用于交通、行程等语境，具有明确的时间和地点指向。而 “comes” 更侧重于从说话者视角出发的移动方向，不一定强调终点，语气更口语化、主观。"
    },
    {
      "word_to_compare": "occurs",
      "analysis": "“Occurs”（发生）是更正式、客观的词汇，常用于描述事件、现象或事故的客观发生，不带情感色彩。而 “comes” 在表示“发生”时更口语化，常用于描述机会、变化或趋势的自然浮现，带有一定预期性。"
    },
    {
      "word_to_compare": "arises",
      "analysis": "“Arises”（出现、产生）通常用于抽象事物（如问题、困难、机会）的突然或意外出现，强调其非计划性或不可控性。而 “comes” 在表示“产生”时更中性，可涵盖自然、预期或人为的来源，适用范围更广。"
    }
  ]
}