{
  "word": "comfort",
  "pronunciation": "kum·fert",
  "concise_definition": "n. 舒适, 安慰; v. 安慰, 使舒适",
  "forms": {
    "plural": "comforts",
    "third_person_singular": "comforts",
    "past_tense": "comforted",
    "past_participle": "comforted",
    "present_participle": "comforting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A state of physical ease and freedom from pain or constraint, often associated with pleasant surroundings, soft furnishings, or relaxation.",
      "explanation_cn": "指身体上的安逸状态，无痛苦或束缚，常与舒适的环境、柔软的家具或放松的氛围相关。",
      "example_en": "The soft mattress and warm blankets provided great comfort after a long day.",
      "example_cn": "柔软的床垫和温暖的毛毯在漫长的一天后带来了极大的舒适感。"
    },
    {
      "pos": "noun",
      "explanation_en": "Psychological or emotional reassurance provided to someone who is distressed, grieving, or anxious, aimed at reducing their suffering.",
      "explanation_cn": "指为处于痛苦、悲伤或焦虑中的人提供的心理或情感上的慰藉，旨在减轻其痛苦。",
      "example_en": "She found comfort in the words of her best friend during the difficult time.",
      "example_cn": "在那段艰难的时光里，她从最好的朋友的话语中得到了安慰。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provide solace or reassurance to someone who is upset, sad, or in distress, often through words, presence, or actions.",
      "explanation_cn": "指通过言语、陪伴或行动为感到悲伤、不安或痛苦的人提供慰藉。",
      "example_en": "He comforted his crying child by holding him close and singing a lullaby.",
      "example_cn": "他抱着哭泣的孩子，轻声哼唱摇篮曲，安慰了他。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ease",
      "analysis": "“Ease” (轻松) 强调缺乏困难、紧张或压力，常用于描述状态的平顺或无阻碍，如“in ease”或“with ease”。它更偏向于客观的无负担感，而 “comfort” 更强调主观的身心愉悦或安慰，尤其在情感层面更丰富。"
    },
    {
      "word_to_compare": "consolation",
      "analysis": "“Consolation” (安慰) 专指在遭遇损失、失败或悲伤后给予的心理抚慰，语义范围比 “comfort” 更窄，且常带有“弥补遗憾”的意味。例如，获得安慰奖是“a consolation prize”。而 “comfort” 既可用于身体舒适，也可用于情感安慰，适用范围更广。"
    },
    {
      "word_to_compare": "reassure",
      "analysis": "“Reassure” (使安心) 侧重于消除他人的疑虑、恐惧或不确定性，通常通过提供信息或保证来实现，如“reassure someone that everything is fine”。而 “comfort” 更侧重于缓解情绪上的痛苦，不一定涉及逻辑或事实的澄清，更多是情感上的支持。"
    }
  ]
}