{
  "word": "commissioned",
  "pronunciation": "kə·mish·ən·əd",
  "concise_definition": "adj. 被委任的, 被授权的; v. 委任, 委托 (commission 的过去式和过去分词)",
  "forms": {
    "base_form": "commission",
    "past_tense": "commissioned",
    "past_participle": "commissioned",
    "present_participle": "commissioning",
    "third_person_singular": "commissioned"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Holding an official rank or authority granted by a formal appointment, especially in the military or government service.",
      "explanation_cn": "指通过正式任命获得官方军衔或权力的，尤指在军队或政府服务中。",
      "example_en": "The commissioned officer led the troops with precision and discipline.",
      "example_cn": "这位委任军官以精准和纪律带领部队。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Created or produced under official order or authorization, typically for a specific purpose or client.",
      "explanation_cn": "指根据官方命令或授权而创作或制作的，通常为特定目的或客户定制。",
      "example_en": "She received a commissioned portrait from a renowned artist.",
      "example_cn": "她从一位著名艺术家那里获得了一幅定制肖像。"
    },
    {
      "pos": "verb",
      "explanation_en": "To officially appoint someone to a position of authority, especially in the armed forces.",
      "explanation_cn": "正式任命某人担任某一职位，尤指在武装部队中。",
      "example_en": "He was commissioned as a second lieutenant after graduating from West Point.",
      "example_cn": "他在西点军校毕业后被任命为少尉。"
    },
    {
      "pos": "verb",
      "explanation_en": "To formally request or order the creation of a work, such as art, music, or a building, often with payment agreed upon in advance.",
      "explanation_cn": "正式委托创作某项作品（如艺术、音乐或建筑），通常事先约定报酬。",
      "example_en": "The museum commissioned a sculpture to commemorate the war veterans.",
      "example_cn": "博物馆委托创作了一座雕塑以纪念退伍军人。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "appointed",
      "analysis": "“Appointed” (任命) 强调通过正式程序指定某人担任职务，但不一定涉及军事或创作授权。它更广泛用于行政、管理或组织职位。而 “commissioned” 特别强调获得正式权力或授权，尤其在军事或艺术委托语境中，带有更强的权威性和制度性。"
    },
    {
      "word_to_compare": "authorized",
      "analysis": "“Authorized” (授权的) 指获得许可或批准进行某项行为，但不必然意味着拥有职位或被正式任命。它侧重于权限的合法性，而非身份或创作关系。而 “commissioned” 不仅意味着授权，还隐含了责任、身份或委托关系，如军官或艺术家被正式委任。"
    },
    {
      "word_to_compare": "contracted",
      "analysis": "“Contracted” (签约的) 指通过合同协议达成服务或工作关系，通常基于商业条款，强调法律契约而非官方任命。而 “commissioned” 更多用于官方、体制性或文化性委托，如政府委托艺术品或军队委任军官，其权威来源是制度而非纯粹合同。"
    }
  ]
}