{
  "word": "committed",
  "pronunciation": "kə·mɪ·təd",
  "concise_definition": "adj. 坚定的, 忠诚的, 尽心尽力的; v. 承诺, 奉献, 实施（犯罪）",
  "forms": {
    "base_form": "commit",
    "third_person_singular": "commits",
    "past_tense": "committed",
    "past_participle": "committed",
    "present_participle": "committing"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Dedicated to a cause, belief, or task with strong determination and unwavering loyalty; willing to invest time, effort, or resources to achieve a goal.",
      "explanation_cn": "对某一事业、信念或任务抱有坚定决心和忠诚，愿意投入时间、精力或资源以实现目标。",
      "example_en": "She is a committed environmentalist who volunteers every weekend to clean local parks.",
      "example_cn": "她是一位坚定的环保主义者，每个周末都自愿去清理本地公园。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Bound by a promise, obligation, or agreement; having made a firm commitment to do something.",
      "explanation_cn": "受承诺、义务或协议约束；已做出坚定承诺去做某事。",
      "example_en": "He is committed to finishing the project by Friday, no matter the cost.",
      "example_cn": "无论付出什么代价，他都承诺在周五前完成这个项目。"
    },
    {
      "pos": "verb",
      "explanation_en": "To carry out or perform an action, especially one that is illegal, harmful, or morally wrong.",
      "explanation_cn": "实施（尤指非法、有害或不道德的）行为。",
      "example_en": "The suspect was arrested for committing a series of burglaries.",
      "example_cn": "该嫌疑人因实施一系列入室盗窃案而被逮捕。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pledge or assign resources, time, or support to a person, cause, or activity.",
      "explanation_cn": "承诺或分配资源、时间或支持给某人、某事业或某项活动。",
      "example_en": "The government has committed $50 million to improve public transportation.",
      "example_cn": "政府已拨款五千万美元用于改善公共交通。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "dedicated",
      "analysis": "“Dedicated”（献身的）与 “committed” 非常接近，都表示对目标的忠诚和投入。但 “dedicated” 更强调长期、稳定的情感投入和精神归属，常用于描述职业或信仰上的奉献；而 “committed” 更侧重于行为上的承诺和责任履行，有时带有契约性或义务性。"
    },
    {
      "word_to_compare": "devoted",
      "analysis": "“Devoted”（忠诚的、挚爱的）通常带有强烈的情感色彩，多用于人际关系（如对家人、伴侣的爱）或宗教信仰，强调情感依附；而 “committed” 更理性、更注重行动和责任，不一定包含深厚感情。"
    },
    {
      "word_to_compare": "obligated",
      "analysis": "“Obligated”（有义务的）强调因法律、道德或社会规范而被迫承担责任，带有被动性；而 “committed” 更强调主动选择承担义务，体现个人意愿和决心，语义上更积极。"
    }
  ]
}