{
  "word": "communist",
  "pronunciation": "kuh·myoo·nist",
  "concise_definition": "n. 共产主义者, 共产党员; adj. 共产主义的",
  "forms": {
    "plural": "communists",
    "adjective_form": "communist"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who supports or advocates for communism, a political and economic ideology aiming to establish a classless, stateless society where property is communally owned and production is organized to meet human needs rather than generate profit.",
      "explanation_cn": "指支持或倡导共产主义的人，共产主义是一种政治经济意识形态，旨在建立一个无阶级、无国家的社会，其中财产公有，生产以满足人类需求而非追求利润为目的。",
      "example_en": "He was arrested for distributing communist literature during the Cold War.",
      "example_cn": "他在冷战期间因分发共产主义文献而被捕。"
    },
    {
      "pos": "noun",
      "explanation_en": "A member of a political party that seeks to implement communism, especially one affiliated with a Marxist-Leninist party such as the Communist Party of China or the former Soviet Communist Party.",
      "explanation_cn": "指属于致力于实现共产主义的政治组织的成员，尤指与中国共产党或前苏联共产党等马列主义政党有关联的党员。",
      "example_en": "As a lifelong communist, she dedicated her career to workers' rights and social equality.",
      "example_cn": "作为一名终身的共产主义者，她将职业生涯奉献给了工人权利与社会平等。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characterized by communism, including its theories, systems, or practices.",
      "explanation_cn": "与共产主义相关或具有其特征的，包括其理论、制度或实践。",
      "example_en": "The country adopted a communist economic model after the revolution.",
      "example_cn": "革命后，该国采用了共产主义经济模式。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "socialist",
      "analysis": "“Socialist”（社会主义者）主张生产资料公有或国家控制，以实现社会公平，但通常允许一定程度的市场机制和民主政治；而 “communist” 指追求彻底废除私有制、阶级和国家的终极目标，通常与革命性手段和一党专政体制相联系。共产主义是社会主义的高级阶段，但实践中两者常被混用。"
    },
    {
      "word_to_compare": "Marxist",
      "analysis": "“Marxist”（马克思主义者）特指信奉卡尔·马克思理论的人，强调阶级斗争和历史唯物主义；而 “communist” 是政治实践者，可能基于马克思主义，也可能结合其他思想。所有共产主义者通常都是马克思主义者，但并非所有马克思主义者都主张立即建立共产主义政权。"
    },
    {
      "word_to_compare": "ideologue",
      "analysis": "“Ideologue”（意识形态家）泛指固守某种意识形态并以此指导行动的人，不特指共产主义；而 “communist” 是一个具体的政治身份标签，具有明确的历史、组织和制度内涵。一个共产主义者必然是某种意识形态的信徒，但一个意识形态家未必是共产主义者。"
    }
  ]
}