{
  "word": "commissioners",
  "pronunciation": "kə·mish·ən·ərz",
  "concise_definition": "n. 委员, 委员会成员, 主管官员",
  "forms": {
    "singular": "commissioner"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person appointed or elected to serve on a commission, especially one responsible for overseeing, regulating, or administering a specific public function or area (e.g., education, police, or public utilities).",
      "explanation_cn": "指被任命或选举担任委员会成员的人，通常负责监督、管理或执行某一特定公共职能或领域（如教育、警察或公共事业）。",
      "example_en": "The city commissioners voted to increase funding for public transportation.",
      "example_cn": "市委员会成员投票决定增加对公共交通的资金投入。"
    },
    {
      "pos": "noun",
      "explanation_en": "An official entrusted with authority to carry out a specific task or represent an organization, often with quasi-governmental powers.",
      "explanation_cn": "指被赋予执行特定任务或代表某一组织权力的官员，通常拥有准政府性质的职权。",
      "example_en": "The state commissioner of education announced new curriculum standards.",
      "example_cn": "州教育局局长宣布了新的课程标准。"
    },
    {
      "pos": "noun",
      "explanation_en": "In sports, a high-ranking official who oversees the administration and governance of a league or organization.",
      "explanation_cn": "在体育领域，指负责监督联赛或组织管理与运作的高级官员。",
      "example_en": "The NFL commissioner intervened to suspend the player for violating league rules.",
      "example_cn": "NFL总裁介入并暂停了违反联盟规则的球员。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "official",
      "analysis": "“Official”（官员）是一个更广泛的术语，泛指任何在政府或组织中担任职务的人，不特指委员会成员。而 “commissioner” 特指在委员会中拥有决策权或管理职责的官员，通常具有更明确的法定或行政权限。"
    },
    {
      "word_to_compare": "councilor",
      "analysis": "“Councilor”（市议员/理事）通常指在市议会或地方理事会中由选举产生的代表，侧重于立法和政策制定。而 “commissioner” 更多是执行或监管角色，有时由任命产生，职责更偏向行政管理而非代表民意。"
    },
    {
      "word_to_compare": "administrator",
      "analysis": "“Administrator”（管理者）强调日常运营和执行事务，通常不涉及政策制定或委员会决策。而 “commissioner” 通常参与集体决策，拥有更高层级的权威，常与政策制定、监管和公共责任相关联。"
    }
  ]
}