{
  "word": "commonwealth",
  "pronunciation": "ˈkɑːmənˌwɛlθ",
  "concise_definition": "n. 共和国, 共同体, 英联邦",
  "forms": {
    "plural": "commonwealths"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A political community founded for the common good, especially a republic or a state governed by the people, emphasizing shared interests and collective welfare.",
      "explanation_cn": "指为公共利益而建立的政治共同体，尤指由人民治理的共和国，强调共同利益与集体福祉。",
      "example_en": "The term 'commonwealth' was used to describe the government of England after the execution of Charles I.",
      "example_cn": "在查理一世被处决后，'commonwealth' 一词被用来描述英格兰的政府。"
    },
    {
      "pos": "noun",
      "explanation_en": "A voluntary association of independent countries, mostly former British colonies, that recognize the British monarch as a symbolic head of state, known as the Commonwealth of Nations.",
      "explanation_cn": "指由独立国家组成的自愿联合体，多数为前英国殖民地，共同承认英国君主为象征性国家元首，即‘英联邦’。",
      "example_en": "Canada, Australia, and India are all member states of the Commonwealth.",
      "example_cn": "加拿大、澳大利亚和印度都是英联邦的成员国。"
    },
    {
      "pos": "noun",
      "explanation_en": "A U.S. state that uses the term 'commonwealth' in its official name, such as Massachusetts, Pennsylvania, Virginia, and Kentucky, to emphasize its foundation on the common good rather than royal authority.",
      "explanation_cn": "指美国四个州（马萨诸塞州、宾夕法尼亚州、弗吉尼亚州和肯塔基州）在官方名称中使用 'commonwealth' 一词，以强调其建立基于公共利益而非王权。",
      "example_en": "The Commonwealth of Massachusetts was established in 1780 with a constitution that prioritized civic responsibility.",
      "example_cn": "马萨诸塞州于1780年通过一部强调公民责任的宪法成立。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "republic",
      "analysis": "“Republic”（共和国）强调国家权力属于人民并通过选举代表行使，是一个明确的政治体制术语。而 “commonwealth” 更广泛，可指共和国，也可指英联邦等非严格意义上的共和国，其含义更侧重于公共福祉和共同体理念，政治体制上不一定等同于共和国。"
    },
    {
      "word_to_compare": "federation",
      "analysis": "“Federation”（联邦）指由多个州或地区组成、共享主权的国家结构，如美国或德国，具有明确的宪法分权机制。而 “commonwealth”（如英联邦）通常不构成统一主权国家，成员保持完全独立，仅通过历史、文化或象征性联系维系，结构松散得多。"
    },
    {
      "word_to_compare": "union",
      "analysis": "“Union”（联盟/联合体）泛指任何形式的联合，如经济联盟（欧盟）、工会或婚姻联盟，语义范围更广。而 “commonwealth” 特指以公共利益为核心的政治共同体，具有更强的意识形态和历史传统色彩，尤其在英联邦语境下具有特定的国际政治含义。"
    }
  ]
}