{
  "word": "commentaries",
  "pronunciation": "kuh·men·tuh·reez",
  "concise_definition": "n. 评论, 评注, 评述",
  "forms": {
    "singular": "commentary"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A written or spoken analysis, interpretation, or explanation of a text, event, or work, often providing insight, context, or critical perspective.",
      "explanation_cn": "对文本、事件或作品所作的书面或口头分析、解释或评述，通常提供见解、背景或批判性视角。",
      "example_en": "The professor's commentaries on Shakespeare's sonnets revealed deep historical and emotional layers.",
      "example_cn": "教授对莎士比亚十四行诗的评注揭示了深刻的历史与情感层次。"
    },
    {
      "pos": "noun",
      "explanation_en": "A running verbal description of an event, especially a sports match or broadcast, intended to inform or enhance the audience's understanding.",
      "explanation_cn": "对事件（尤其是体育比赛或广播节目）进行的实时口头解说，旨在帮助观众更好地理解或增强观感体验。",
      "example_en": "The commentator's lively commentaries made the football match exciting even for those watching on radio.",
      "example_cn": "解说员生动的评述让即使通过收音机收听的听众也感到足球比赛激动人心。"
    },
    {
      "pos": "noun",
      "explanation_en": "A collection of scholarly annotations or interpretations, especially in religious, legal, or literary texts, often compiled over centuries.",
      "explanation_cn": "尤指在宗教、法律或文学文本中，由历代学者汇编而成的注释或解释集合。",
      "example_en": "The Talmud contains centuries of rabbinic commentaries on Jewish law and tradition.",
      "example_cn": "《塔木德》包含了数个世纪以来拉比对犹太法律与传统的评注。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "analysis",
      "analysis": "“Analysis” (分析) 更侧重于系统性地分解和研究事物的组成部分，强调逻辑推理和结构拆解，常用于学术或科学语境。而 “commentary” 更强调主观见解、评价或即时反应，不一定需要严谨的结构。"
    },
    {
      "word_to_compare": "review",
      "analysis": "“Review” (评论/回顾) 通常是对已完成的作品（如书籍、电影）进行总结性评价，带有推荐或批判目的，常出现在媒体或出版物中。而 “commentary” 可以是实时的、持续的，不一定有总结性，也不一定以评价为目的，更注重解释与阐释。"
    },
    {
      "word_to_compare": "annotation",
      "analysis": "“Annotation” (注释) 通常指对文本中具体词句添加的简短说明，多为脚注或旁注，形式上更零散、技术性更强。而 “commentary” 是更连贯、更全面的解释性文本，可能涵盖整部作品或事件的多个层面。"
    }
  ]
}