{
  "word": "commodore",
  "pronunciation": "kuh·moh·dohr",
  "concise_definition": "n. 海军准将, 舰队指挥官, 船长; (旧) 商船队指挥官",
  "forms": {
    "plural": "commodores"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A naval rank in many countries, typically above captain and below rear admiral, often commanding a squadron of ships or serving as a senior officer in a fleet.",
      "explanation_cn": "在许多国家的海军中，一种高于舰长、低于少将的军衔，通常指挥一支由多艘舰船组成的分舰队，或担任舰队中的高级军官。",
      "example_en": "The commodore led the fleet through the storm with calm authority.",
      "example_cn": "准将以沉着的权威率领舰队穿越风暴。"
    },
    {
      "pos": "noun",
      "explanation_en": "In historical maritime contexts, a civilian captain appointed to command a convoy of merchant ships, especially during wartime, often granted temporary naval authority.",
      "explanation_cn": "在历史航海语境中，指被任命指挥商船队（尤其在战时）的平民船长，通常被授予临时海军指挥权。",
      "example_en": "During the Napoleonic Wars, the commodore was responsible for the safe passage of 30 merchant vessels.",
      "example_cn": "在拿破仑战争期间，这位指挥官负责三十艘商船的安全航行。"
    },
    {
      "pos": "noun",
      "explanation_en": "A title used in some yacht clubs or maritime organizations to denote the president or senior officer of the club.",
      "explanation_cn": "在某些游艇俱乐部或航海组织中，用作指称俱乐部主席或高级官员的头衔。",
      "example_en": "As commodore of the Harbor Yacht Club, she organized the annual regatta.",
      "example_cn": "作为港口游艇俱乐部的主席，她组织了年度帆船赛。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "admiral",
      "analysis": "“Admiral”（海军上将）是比“commodore”更高的军衔，通常指挥整个舰队或海军区域，而“commodore”多指挥较小的分舰队或担任临时指挥职务。在现代海军中，许多国家已将“commodore”并入“rear admiral”体系，使其成为低阶将官。"
    },
    {
      "word_to_compare": "captain",
      "analysis": "“Captain”（舰长）通常指单艘军舰或商船的指挥官，而“commodore”指挥的是多艘舰船组成的编队。虽然“captain”是军衔，但“commodore”在某些语境下是职务头衔而非正式军衔，权力范围更大。"
    },
    {
      "word_to_compare": "chief",
      "analysis": "“Chief”（主管、负责人）是一个泛化的管理头衔，可用于任何组织或团队，缺乏军事或航海的特定含义。而“commodore”具有明确的海军或航海传统背景，专指舰队或船队的指挥者，语义更专业、更正式。"
    }
  ]
}