{
  "word": "communal",
  "pronunciation": "kuh·moo·nuhl",
  "concise_definition": "adj. 共有的, 公用的, 社区的",
  "forms": {
    "comparative": "more communal",
    "superlative": "most communal"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Belonging to or shared by all members of a community or group, rather than to individuals; characterized by collective ownership or use.",
      "explanation_cn": "属于或由一个社区或群体的所有成员共同拥有或使用的，而非属于个人；体现集体所有或共同使用的特征。",
      "example_en": "The village has a communal kitchen where everyone prepares meals together.",
      "example_cn": "这个村庄有一个公用厨房，所有人都一起在那里做饭。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or promoting the interests of a community as a whole, often in contrast to individual or private interests.",
      "explanation_cn": "与整个社区的利益相关，或促进社区整体利益，通常与个人或私利相对立。",
      "example_en": "The policy encourages communal living to strengthen social bonds.",
      "example_cn": "这项政策鼓励集体生活，以加强社会纽带。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used to describe spaces, resources, or systems designed for shared use by multiple people, especially in cooperative or non-private settings.",
      "explanation_cn": "用于描述为多人共同使用而设计的空间、资源或系统，尤其在合作或非私密环境中。",
      "example_en": "They live in a communal apartment with shared bathrooms and a common living room.",
      "example_cn": "他们住在一套集体公寓里，共用浴室和一个公共客厅。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "common",
      "analysis": "“Common” (共同的) 指两个或更多人或事物所共有的属性或特征，但不一定涉及集体管理或共享使用。它可以是偶然的、自然的或普遍的（如 common interest）。而 “communal” 强调有组织的、制度化的集体共享，通常涉及空间、资源或责任的共同承担。"
    },
    {
      "word_to_compare": "collective",
      "analysis": "“Collective” (集体的) 更侧重于由群体作为一个整体所采取的行动、决策或所有权，常用于政治、经济或社会结构语境（如 collective bargaining）。它强调“群体行为”，而 “communal” 更强调“生活空间”或“日常资源”的共享性质，更具生活化和地域性。"
    },
    {
      "word_to_compare": "public",
      "analysis": "“Public” (公共的) 指属于国家、政府或社会大众，通常由官方管理并面向所有人开放（如 public park）。而 “communal” 通常指较小、更紧密的群体（如社区、合作社、宗教团体）内部的共享，不一定是官方或法律意义上的公共财产。"
    }
  ]
}