{
  "word": "communism",
  "pronunciation": "kuh·myoo·niz·uhm",
  "concise_definition": "n. 共产主义",
  "forms": {
    "plural": "communisms"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A political and economic ideology based on the theory of Karl Marx and Friedrich Engels, advocating for a classless society in which all property and resources are collectively owned and controlled by the community as a whole, with the goal of eliminating social inequality and exploitation.",
      "explanation_cn": "一种基于卡尔·马克思和弗里德里希·恩格斯理论的政治经济意识形态，主张建立一个无阶级的社会，其中所有财产和资源由社会全体成员共同拥有和控制，旨在消除社会不平等与剥削。",
      "example_en": "In theory, communism aims to create a society where everyone contributes according to their ability and receives according to their needs.",
      "example_cn": "理论上，共产主义旨在建立一个每个人按能力贡献、按需分配的社会。"
    },
    {
      "pos": "noun",
      "explanation_en": "The system or practice of governing a state or society under communist principles, often characterized by a single-party state, centralized economic planning, and the abolition of private ownership of the means of production.",
      "explanation_cn": "指在共产主义原则下治理国家或社会的制度或实践，通常表现为一党专政、中央计划经济以及生产资料私有制的废除。",
      "example_en": "The Soviet Union was a historical example of a country that implemented communism as its official state ideology.",
      "example_cn": "苏联是历史上将共产主义作为官方国家意识形态实施的国家之一。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "socialism",
      "analysis": "“Socialism”（社会主义）通常指生产资料部分或全部由国家或社会所有，强调财富再分配和社会福利，但不一定完全废除私有制或立即实现无阶级社会。而 “communism” 是社会主义的更高阶段，主张彻底废除私有制、国家消亡和按需分配，更具革命性和理想性。"
    },
    {
      "word_to_compare": "collectivism",
      "analysis": "“Collectivism”（集体主义）是一种强调群体利益高于个人利益的价值观或社会原则，可以存在于多种政治体制中，包括某些形式的社会主义或传统社会。而 “communism” 是一种具体的政治理论体系，包含经济结构、阶级斗争和历史唯物主义等完整理论框架，collectivism 是其组成部分之一，但不等同于共产主义。"
    },
    {
      "word_to_compare": "marxism",
      "analysis": "“Marxism”（马克思主义）是卡尔·马克思提出的理论体系，包括历史唯物主义、剩余价值理论和阶级斗争学说，是共产主义的思想基础。而 “communism” 是马克思主义所追求的最终社会形态。简言之，Marxism 是理论，communism 是目标。"
    }
  ]
}