{
  "word": "commissions",
  "pronunciation": "kə·mɪ·ʃənz",
  "concise_definition": "n. 委托, 佣金, 委员会, 授予的职位",
  "forms": {
    "singular": "commission"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A fee or percentage paid to an agent or salesperson for services rendered, typically based on the value of transactions completed.",
      "explanation_cn": "指代理人或销售人员因完成交易而获得的报酬，通常按交易金额的一定比例计算。",
      "example_en": "She earns a 10% commission on every house she sells.",
      "example_cn": "她每卖出一套房子，就能获得10%的佣金。"
    },
    {
      "pos": "noun",
      "explanation_en": "An official group of people appointed to investigate, report on, or manage a specific issue or function.",
      "explanation_cn": "指被正式任命来调查、报告或管理某一特定事务或职能的委员会或小组。",
      "example_en": "The government established a commission to review education policies.",
      "example_cn": "政府成立了一个委员会来审查教育政策。"
    },
    {
      "pos": "noun",
      "explanation_en": "An official document authorizing a person to hold a position of authority, especially in the military or government.",
      "explanation_cn": "指授予某人担任权威职位（尤指军职或政府职位）的正式文件。",
      "example_en": "He received his commission as a second lieutenant after graduating from West Point.",
      "example_cn": "他在西点军校毕业后获得了少尉委任状。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of entrusting a task, responsibility, or artwork to someone for completion.",
      "explanation_cn": "指委托某人完成某项任务、责任或艺术作品的行为。",
      "example_en": "The museum placed a commission with the artist to create a mural for the lobby.",
      "example_cn": "博物馆委托这位艺术家为大堂创作一幅壁画。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fee",
      "analysis": "“Fee”（费用）泛指为服务支付的固定金额，通常不与业绩挂钩；而 “commission” 是绩效导向的报酬，金额随交易量或销售额浮动。例如律师费是fee，房产中介的提成是commission。"
    },
    {
      "word_to_compare": "salary",
      "analysis": "“Salary”（薪水）是固定周期支付的报酬，与工作成果无关；而 “commission” 是基于成果的激励性收入，具有不确定性。两者常在销售岗位中结合使用，如底薪+提成。"
    },
    {
      "word_to_compare": "committee",
      "analysis": "“Committee”（委员会）是泛指任何为特定目的组成的团体，不一定有官方授权；而 “commission” 强调由权威机构正式任命，具有法定或行政职能，如调查委员会、仲裁委员会。"
    },
    {
      "word_to_compare": "appointment",
      "analysis": "“Appointment”（任命）泛指被安排担任某一职位，可能是临时或非正式的；而 “commission” 特指通过正式文件授予的权威职位，尤其在军事或政府体系中具有法律效力。"
    }
  ]
}