{
  "word": "communication",
  "pronunciation": "kuh·myoo·ni·key·shun",
  "concise_definition": "n. 沟通, 交流, 传达, 通信",
  "forms": {
    "plural": "communications"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of exchanging information, ideas, thoughts, or feelings between individuals or groups through speaking, writing, gestures, or other mediums, with the goal of achieving mutual understanding.",
      "explanation_cn": "指个人或群体之间通过语言、文字、手势或其他媒介交换信息、思想、情感的过程，旨在实现相互理解。",
      "example_en": "Effective communication is essential for building strong relationships in both personal and professional settings.",
      "example_cn": "在个人和职业环境中，有效的沟通对于建立牢固的关系至关重要。"
    },
    {
      "pos": "noun",
      "explanation_en": "A system or method used to transmit messages or data, especially over distances, such as telephone networks, radio, or the internet.",
      "explanation_cn": "指用于在远距离传输信息或数据的系统或方法，例如电话网络、无线电或互联网。",
      "example_en": "Modern communications technologies have revolutionized how we connect with people around the world.",
      "example_cn": "现代通信技术彻底改变了我们与世界各地的人们联系的方式。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of conveying a specific message or signal, often non-verbal, such as body language or symbolic gestures.",
      "explanation_cn": "指传递特定信息或信号的行为，常为非语言形式，如肢体语言或象征性手势。",
      "example_en": "Her crossed arms were a clear communication of discomfort during the meeting.",
      "example_cn": "她在会议中交叉双臂，明确传达了她的不适。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "interaction",
      "analysis": "“Interaction”（互动）强调双方或多方之间的双向交流与反应，通常包含行为、情感或影响的相互作用，范围更广，可包括非语言或非信息性的互动（如肢体接触、共同活动）。而 “communication” 更聚焦于信息的传递与接收，强调内容的明确性。"
    },
    {
      "word_to_compare": "conversation",
      "analysis": "“Conversation”（对话）特指两个人或多人之间自然、口语化的语言交流，具有互动性和即时性，是 “communication” 的一种具体形式。而 “communication” 是更广泛的上位概念，可包含书面、非语言、技术媒介等多种形式。"
    },
    {
      "word_to_compare": "transmission",
      "analysis": "“Transmission”（传输）侧重于信息或信号从一点到另一点的物理或技术性传递过程，常用于工程、电子或生物学语境（如病毒传播、信号传输），强调过程而非理解。而 “communication” 不仅要求传递，更强调接收方对信息的理解与反馈。"
    }
  ]
}