{
  "word": "command",
  "pronunciation": "kuh·mahn·d",
  "concise_definition": "n. 命令, 指挥, 掌握; v. 命令, 指挥, 控制",
  "forms": {
    "third_person_singular": "commands",
    "past_tense": "commanded",
    "past_participle": "commanded",
    "present_participle": "commanding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An authoritative order or instruction given by someone in a position of authority, often requiring immediate obedience.",
      "explanation_cn": "指由权威人士发出的具有强制性的指令，通常要求立即服从。",
      "example_en": "The general gave the command to advance at dawn.",
      "example_cn": "将军下达了黎明时分进攻的命令。"
    },
    {
      "pos": "noun",
      "explanation_en": "The power or authority to control or direct people, resources, or operations, especially in a military or organizational context.",
      "explanation_cn": "指在军事或组织环境中对人员、资源或行动进行控制或指挥的权力或能力。",
      "example_en": "She has complete command of the situation and remains calm under pressure.",
      "example_cn": "她对局势有完全的掌控力，能在压力下保持冷静。"
    },
    {
      "pos": "noun",
      "explanation_en": "A high level of skill or proficiency in a subject or language, often used in the phrase 'have a command of'.",
      "explanation_cn": "指对某一学科或语言的熟练掌握，常用于短语 'have a command of'。",
      "example_en": "He has an excellent command of French and can write fluently in it.",
      "example_cn": "他法语水平极高，能流利地用法语写作。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give an authoritative order to someone, especially in a formal or military setting.",
      "explanation_cn": "指在正式或军事环境中向他人下达权威性指令。",
      "example_en": "The officer commanded the troops to halt.",
      "example_cn": "军官命令部队停止前进。"
    },
    {
      "pos": "verb",
      "explanation_en": "To have control over or be in charge of something, often due to expertise, position, or influence.",
      "explanation_cn": "指因专业知识、职位或影响力而对某事物拥有控制权或主导权。",
      "example_en": "The CEO commands respect from all employees.",
      "example_cn": "这位首席执行官赢得了所有员工的尊重。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "order",
      "analysis": "“Order” (命令) 与 “command” 非常接近，但 “order” 更通用，可用于日常语境（如‘请下单’），语气可轻可重；而 “command” 更强调权威性、强制性和等级关系，常用于军事、法律或正式场合，带有更强的不可违抗性。"
    },
    {
      "word_to_compare": "instruct",
      "analysis": "“Instruct” (指示) 侧重于提供指导、说明或教育性内容，通常不带有强制性，而是帮助对方理解如何做某事。而 “command” 强调服从，不提供选择余地。例如：老师 instruct 学生写作文，但指挥官 command 士兵冲锋。"
    },
    {
      "word_to_compare": "demand",
      "analysis": "“Demand” (要求) 强调强烈请求或索要，常带有情绪色彩（如愤怒、急切），但不一定来自权威地位；而 “command” 来自权力结构，即使语气平静，也隐含强制力。例如：孩子 demand 糖果，但上司 command 员工加班。"
    }
  ]
}