{
  "word": "commissioning",
  "pronunciation": "kə·mish·ən·iŋ",
  "concise_definition": "n. 启用, 投入使用, 委任, 委托",
  "forms": {
    "base_form": "commission",
    "past_tense": "commissioned",
    "past_participle": "commissioned",
    "present_participle": "commissioning",
    "third_person_singular": "commissions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of putting a system, facility, or piece of equipment into operation for the first time, typically after construction or installation, to verify that it functions according to design specifications.",
      "explanation_cn": "指在建造或安装完成后，首次将系统、设施或设备投入运行的过程，以验证其是否符合设计规范。",
      "example_en": "The commissioning of the new power plant is scheduled for next month.",
      "example_cn": "新电厂的启用计划定于下个月进行。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of officially authorizing or appointing someone to perform a specific duty or role, especially in a military or official context.",
      "explanation_cn": "指正式授权或任命某人担任特定职责或职务，尤指在军事或官方语境中。",
      "example_en": "The commissioning of the new naval officer was attended by senior military officials.",
      "example_cn": "新海军军官的委任仪式由高级军方官员出席。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of ordering or requesting the creation of a work, such as art, music, or a building, often through formal payment or contract.",
      "explanation_cn": "指通过正式付款或合同委托创作某项作品，如艺术、音乐或建筑。",
      "example_en": "The museum's new sculpture was the result of a private commissioning by a local philanthropist.",
      "example_cn": "博物馆的新雕塑是一位本地慈善家委托创作的成果。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "installation",
      "analysis": "“Installation”（安装）仅指物理上将设备或系统放置到位的过程，不涉及功能测试或正式启用。而 “commissioning” 包含安装后的调试、测试和验收，是确保系统可正常运行的完整流程。"
    },
    {
      "word_to_compare": "appointment",
      "analysis": "“Appointment”（任命）泛指将某人安排到某个职位，通常不强调正式授权或仪式性程序。而 “commissioning” 在军事或官方语境中带有正式授权、颁发委任状的含义，更具法律或制度权威性。"
    },
    {
      "word_to_compare": "contracting",
      "analysis": "“Contracting”（签约/承包）指通过协议委托他人完成某项工作，侧重于交易和责任分配。而 “commissioning” 强调委托行为本身及其结果——即委托作品的完成与交付，常用于艺术、建筑等创造性领域，带有文化或审美意图。"
    }
  ]
}