{
  "word": "compartments",
  "pronunciation": "kum·part·muhnts",
  "concise_definition": "n. 隔间, 分隔间, 舱室",
  "forms": {
    "singular": "compartment"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A separate, enclosed space within a larger structure, designed to organize, contain, or isolate items or functions.",
      "explanation_cn": "指在更大结构内部划分出的独立封闭空间，用于组织、容纳或隔离物品或功能。",
      "example_en": "The suitcase has several compartments for organizing clothes, shoes, and toiletries.",
      "example_cn": "这个行李箱有几个隔间，用于整理衣物、鞋子和洗漱用品。"
    },
    {
      "pos": "noun",
      "explanation_en": "One of the divided sections in a vehicle, especially in trains or airplanes, used for seating, storage, or specific operational purposes.",
      "explanation_cn": "指交通工具（如火车或飞机）中划分出的独立区域，用于座位、储物或特定操作用途。",
      "example_en": "The train's sleeping compartments were small but comfortable for overnight travel.",
      "example_cn": "火车的卧铺隔间虽小，但适合过夜旅行。"
    },
    {
      "pos": "noun",
      "explanation_en": "A metaphorical division or separation within a system, mind, or organization, often implying distinct or unrelated areas of function or thought.",
      "explanation_cn": "比喻性地指系统、思维或组织内部的划分，常暗示功能或思想上彼此独立甚至互不关联的区域。",
      "example_en": "She keeps her personal life and professional duties in separate compartments, never letting one interfere with the other.",
      "example_cn": "她将个人生活与职业职责分隔开来，从不让一方干扰另一方。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cabin",
      "analysis": "“Cabin”（舱室）通常指交通工具中供人居住或工作的封闭空间，尤其用于飞机、轮船或火车的乘客休息区，强调功能性与舒适性。而 “compartment” 更广泛，可指任何分隔空间，包括非人用的储物或功能区，且不一定提供舒适设施。"
    },
    {
      "word_to_compare": "section",
      "analysis": "“Section”（部分、区域）是一个更通用的词，指整体中的任意一部分，可以是物理的，也可以是抽象的（如文章的章节）。它不强调封闭性或物理分隔，而 “compartment” 必须是物理上被分隔或围合的独立单元。"
    },
    {
      "word_to_compare": "chamber",
      "analysis": "“Chamber”（室、腔）常用于更正式或科学语境，指具有特定功能的内部空间，如心脏的“心室”、议会的“议院”或密室。它常带有神秘、庄严或生理结构的意味，而 “compartment” 更日常、实用，多用于人造结构中的功能性分隔。"
    }
  ]
}