{
  "word": "complex",
  "pronunciation": "kum·pleks",
  "concise_definition": "adj. 复杂的, 综合的; n. 综合体, 复合体",
  "forms": {
    "comparative": "more complex",
    "superlative": "most complex"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Consisting of many different and connected parts, often making something difficult to understand or analyze due to intricate relationships or structures.",
      "explanation_cn": "由许多不同且相互关联的部分组成，通常因内部关系错综复杂而难以理解或分析。",
      "example_en": "The legal system in this country is too complex for most people to navigate without professional help.",
      "example_cn": "这个国家的法律体系过于复杂，大多数人没有专业帮助就难以应对。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Not simple or straightforward; involving subtle or layered elements that require careful thought or interpretation.",
      "explanation_cn": "不简单或直接的；包含需要仔细思考或解读的微妙或多层次的要素。",
      "example_en": "Her emotional response to the news was complex, mixing grief, relief, and guilt.",
      "example_cn": "她对这个消息的情感反应很复杂，交织着悲伤、释然和内疚。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of related buildings or structures, often designed for a specific purpose such as housing, recreation, or administration.",
      "explanation_cn": "一组相互关联的建筑或结构，通常为特定目的而设计，如住宅、娱乐或行政用途。",
      "example_en": "The sports complex includes a swimming pool, tennis courts, and a gymnasium.",
      "example_cn": "这个体育综合体包括一个游泳池、网球场和一个体育馆。"
    },
    {
      "pos": "noun",
      "explanation_en": "In psychology, a group of emotionally charged ideas or memories that influence behavior unconsciously, often rooted in early experiences.",
      "explanation_cn": "在心理学中，指一组具有强烈情感色彩的想法或记忆，无意识地影响行为，通常源于早期经历。",
      "example_en": "Freud described the Oedipus complex as a key stage in psychosexual development.",
      "example_cn": "弗洛伊德将俄狄浦斯情结描述为心理性欲发展中的一个关键阶段。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "complicated",
      "analysis": "“Complicated” 强调事物因步骤繁多、结构繁琐或细节过多而难以处理，常带有负面含义，暗示不必要的麻烦。而 “complex” 更中性，强调系统内部各部分之间有逻辑关联和层次性，未必难以理解，甚至可能具有内在美感或功能性。"
    },
    {
      "word_to_compare": "intricate",
      "analysis": "“Intricate” 侧重于细节的精细和交织的复杂性，常用于描述图案、机械或设计，强调视觉或结构上的精巧。而 “complex” 更广泛，可用于抽象概念（如思想、系统），强调关系的多样性和深度，不局限于视觉层面。"
    },
    {
      "word_to_compare": "compound",
      "analysis": "“Compound” 指由两个或多个独立元素组合而成的物质或结构，强调成分的叠加，但不一定具有内在的互动或层次。而 “complex” 不仅包含组合，还强调各部分之间动态的、相互影响的关系，具有系统性特征。"
    }
  ]
}