{
  "word": "composition",
  "pronunciation": "kohm·puh·zish·uhn",
  "concise_definition": "n. 构成, 组成, 作文, 乐曲",
  "forms": {
    "plural": "compositions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The way in which parts or elements are arranged or combined to form a whole, especially in art, writing, or music.",
      "explanation_cn": "指各个部分或元素如何被安排或组合以形成一个整体，尤其用于艺术、写作或音乐领域。",
      "example_en": "The composition of the painting balances warm and cool colors effectively.",
      "example_cn": "这幅画的构图巧妙地平衡了暖色与冷色。"
    },
    {
      "pos": "noun",
      "explanation_en": "A piece of writing, especially an essay or school assignment, in which ideas are expressed in structured form.",
      "explanation_cn": "指一篇有组织地表达思想的书面作品，尤指作文或学校作业。",
      "example_en": "She wrote a composition on the causes of the French Revolution.",
      "example_cn": "她写了一篇关于法国大革命起因的作文。"
    },
    {
      "pos": "noun",
      "explanation_en": "A piece of music that has been written or arranged by a composer.",
      "explanation_cn": "指由作曲家创作或编排的一首乐曲。",
      "example_en": "Beethoven's Ninth Symphony is one of the greatest compositions in classical music.",
      "example_cn": "贝多芬的第九交响曲是古典音乐中最伟大的作品之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "The chemical or structural makeup of a substance or system.",
      "explanation_cn": "指某种物质或系统的化学成分或结构组成。",
      "example_en": "The composition of the alloy includes copper, zinc, and nickel.",
      "example_cn": "这种合金的成分包括铜、锌和镍。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "structure",
      "analysis": "“Structure” (结构) 更侧重于事物的组织框架或支撑体系，强调形式和逻辑关系，常用于建筑、组织或语法层面。而 “composition” 更强调各部分如何艺术性或功能性地组合成一个和谐的整体，尤其在创作性领域（如音乐、绘画、写作）中使用更广泛。"
    },
    {
      "word_to_compare": "content",
      "analysis": "“Content” (内容) 指的是信息、思想或材料本身，即‘说了什么’；而 “composition” 关注的是‘如何组织和呈现’这些内容。例如，一篇作文的内容可能是‘环保的重要性’，而其composition则是段落安排、论点推进和语言风格。"
    },
    {
      "word_to_compare": "arrangement",
      "analysis": "“Arrangement” (安排) 通常指对已有元素进行顺序或位置上的调整，偏重于物理或逻辑上的排序，如花束的摆放或会议议程的安排。而 “composition” 更具创造性，常暗示从零开始构建一个具有审美或功能统一性的整体，尤其在艺术和音乐语境中不可替代。"
    }
  ]
}