{
  "word": "compost",
  "pronunciation": "käm·pōst",
  "concise_definition": "n. 堆肥, 腐殖质; v. 制作堆肥",
  "forms": {
    "third_person_singular": "composts",
    "past_tense": "composted",
    "past_participle": "composted",
    "present_participle": "composting",
    "plural": "composts"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A dark, rich soil-like material made from decomposed organic matter such as food scraps, leaves, and grass clippings, used to enrich garden soil.",
      "explanation_cn": "由食物残渣、落叶、草屑等有机物分解而成的深色、富含养分的类土壤物质，用于改良园艺土壤。",
      "example_en": "She added a layer of compost to her vegetable garden to improve soil fertility.",
      "example_cn": "她在菜园里铺了一层堆肥，以提高土壤肥力。"
    },
    {
      "pos": "verb",
      "explanation_en": "To process organic waste materials through decomposition to produce compost, typically by mixing them in a pile or bin and allowing natural microbes to break them down.",
      "explanation_cn": "通过分解有机废弃物（如厨余、植物残渣）来制作堆肥，通常通过将其堆叠或放入容器中，利用微生物自然降解。",
      "example_en": "Many households now compost their kitchen scraps to reduce landfill waste.",
      "example_cn": "如今许多家庭将厨房垃圾进行堆肥，以减少填埋废物。"
    },
    {
      "pos": "verb",
      "explanation_en": "To become decomposed and turn into compost over time through natural biological processes.",
      "explanation_cn": "通过自然生物过程逐渐分解，最终转化为堆肥。",
      "example_en": "The fallen leaves composted over the winter and enriched the soil beneath.",
      "example_cn": "落叶在冬季逐渐腐烂，为下方的土壤增添了养分。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fertilizer",
      "analysis": "“Fertilizer” (肥料) 是指为植物提供营养的化学或有机物质，通常是直接施用的成品，如氮磷钾复合肥。而 “compost” 是一种通过自然分解制成的有机改良剂，不仅提供养分，还能改善土壤结构和微生物环境。"
    },
    {
      "word_to_compare": "mulch",
      "analysis": "“Mulch” (覆盖物) 是铺在土壤表面以保湿、抑草和调节温度的材料，如木屑、稻草或塑料膜，它不一定会分解成养分。而 “compost” 是可分解的有机物质，其主要目的是在分解后为土壤提供营养，通常被混入土中而非仅覆盖表面。"
    },
    {
      "word_to_compare": "decompose",
      "analysis": "“Decompose” (分解) 是一个通用动词，指任何有机物在微生物作用下自然腐烂的过程，不特指最终产物。而 “compost” 作为动词时，特指有意识地控制分解过程以生产可用的堆肥，强调目的性和人为管理。"
    }
  ]
}