{
  "word": "compass",
  "pronunciation": "kum·puhs",
  "concise_definition": "n. 指南针, 范围, 圆规; v. 包围, 设法完成",
  "forms": {
    "plural": "compasses"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A navigational instrument that uses a magnetized needle to indicate direction relative to the Earth's magnetic poles, commonly used in outdoor activities and maritime navigation.",
      "explanation_cn": "一种利用磁化指针指示相对于地球磁极方向的导航工具，常用于户外活动和航海。",
      "example_en": "The hiker used a compass to find his way through the dense forest.",
      "example_cn": "徒步者用指南针在茂密的森林中辨认方向。"
    },
    {
      "pos": "noun",
      "explanation_en": "The range or scope of something, often used in the phrase 'within the compass of' to denote limits or boundaries of possibility, influence, or understanding.",
      "explanation_cn": "指某事物的范围或界限，常用于短语 'within the compass of' 表示可能性、影响或理解的限度。",
      "example_en": "The issue falls outside the compass of our current authority.",
      "example_cn": "这个问题超出了我们当前权限的范围。"
    },
    {
      "pos": "noun",
      "explanation_en": "A drafting tool consisting of two arms, one with a point and the other with a pencil or pen, used to draw circles or arcs.",
      "explanation_cn": "一种绘图工具，由两臂组成，一端为尖点，另一端为铅笔或笔，用于绘制圆形或圆弧。",
      "example_en": "She used a compass to draw a perfect circle on the blueprint.",
      "example_cn": "她用圆规在蓝图上画了一个完美的圆。"
    },
    {
      "pos": "verb",
      "explanation_en": "To surround or encircle something, often implying a sense of containment or limitation.",
      "explanation_cn": "指包围或环绕某物，常暗示一种包含或限制的意味。",
      "example_en": "The mountains compassed the valley, creating a natural fortress.",
      "example_cn": "群山环绕着山谷，形成了一座天然堡垒。"
    },
    {
      "pos": "verb",
      "explanation_en": "To achieve or accomplish something, especially through effort or ingenuity; often used in the phrase 'to compass one's goal'.",
      "explanation_cn": "指通过努力或智慧达成某目标，常用于短语 'to compass one's goal'。",
      "example_en": "Despite the obstacles, she compassed her dream of becoming a pilot.",
      "example_cn": "尽管障碍重重，她还是实现了成为飞行员的梦想。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "direction",
      "analysis": "“Direction” (方向) 是一个抽象名词，泛指方位或趋势，如“前进的方向”或“政策方向”。而 “compass” 作为名词时特指物理工具（指南针）或其指示的精确方位，具有具体性和工具性。"
    },
    {
      "word_to_compare": "range",
      "analysis": "“Range” (范围) 是一个通用词，指从最小到最大的跨度，如价格范围、音域等。而 “compass” 在表示范围时更正式、文学化，常用于书面语，强调界限或能力所及的边界，如 'within the compass of'。"
    },
    {
      "word_to_compare": "protractor",
      "analysis": "“Protractor” (量角器) 是一种用于测量角度的工具，常用于几何绘图。而 “compass”（圆规）用于绘制圆形或弧线，两者虽同为绘图工具，但功能不同：圆规画弧，量角器测角。"
    }
  ]
}