{
  "word": "complemented",
  "pronunciation": "kum·pluh·muhnt",
  "concise_definition": "v. 补充, 补足, 使完善",
  "forms": {
    "base_form": "complement",
    "third_person_singular": "complements",
    "past_tense": "complemented",
    "past_participle": "complemented",
    "present_participle": "complementing",
    "noun_form": "complement"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To add something to another thing in a way that improves or enhances it by providing what is missing or needed, often creating a more complete or harmonious whole.",
      "explanation_cn": "指通过添加某物来弥补另一物的不足，从而提升其整体性或和谐性，使其更加完整或完美。",
      "example_en": "The red scarf complemented her black coat perfectly.",
      "example_cn": "这条红色围巾与她的黑色外套完美搭配。"
    },
    {
      "pos": "verb",
      "explanation_en": "In mathematics or logic, to form a set or value that, when combined with another, completes a whole or equals a defined total (e.g., the complement of 3 in 10 is 7).",
      "explanation_cn": "在数学或逻辑中，指与另一集合或数值相加后构成完整整体或等于某一确定总数的补集或补数。",
      "example_en": "The complement of angle A is 60 degrees if angle A is 30 degrees.",
      "example_cn": "如果角A是30度，那么它的余角就是60度。"
    },
    {
      "pos": "verb",
      "explanation_en": "To serve as a counterpart or counterpart element that enhances the effectiveness or appeal of something else, often in a balanced or synergistic way.",
      "explanation_cn": "指作为与另一事物相辅相成的对应元素，以平衡或协同的方式增强其效果或吸引力。",
      "example_en": "His calm demeanor complemented her energetic personality.",
      "example_cn": "他冷静的举止与她充满活力的性格相得益彰。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "supplement",
      "analysis": "“Supplement” (补充) 强调在原有基础上增加额外内容以增强功能或数量，常用于信息、营养或资源的附加，不一定追求和谐或匹配。而 “complement” 更强调两者之间的搭配性、协调性和整体性的提升，如颜色、性格或功能的互补。"
    },
    {
      "word_to_compare": "enhance",
      "analysis": "“Enhance” (增强) 指直接提升某物的质量、价值或效果，不必然涉及添加另一个事物。而 “complement” 必须涉及两个事物之间的相互作用，通过搭配使彼此更完善。例如，灯光增强氛围，但围巾与外套互补。"
    },
    {
      "word_to_compare": "complete",
      "analysis": "“Complete” (完成) 指使某物达到完整状态，可能通过填补缺失部分实现，但不强调搭配或协调性。而 “complement” 不仅填补缺失，还强调所添之物与原物在风格、性质或功能上的匹配与和谐。"
    }
  ]
}