{
  "word": "competing",
  "pronunciation": "kum·pih·ting",
  "concise_definition": "adj. 竞争的, 对抗的; v. 竞争 (compete 的现在分词)",
  "forms": {
    "base_form": "compete",
    "third_person_singular": "competes",
    "past_tense": "competed",
    "past_participle": "competed",
    "present_participle": "competing"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing something that is involved in or characterized by rivalry or contest, especially in business, sports, or other fields where success is determined by outperforming others.",
      "explanation_cn": "指参与或具有竞争性质的，尤其在商业、体育或其他领域中，通过超越他人来决定成败的状态。",
      "example_en": "The two companies are in competing markets for smartphone technology.",
      "example_cn": "这两家公司正在智能手机技术的市场竞争中相互对抗。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strive to win or succeed against others in a contest, game, or endeavor, often by offering better quality, price, or service.",
      "explanation_cn": "指在比赛、游戏或活动中努力战胜他人，通常通过提供更优的质量、价格或服务来实现。",
      "example_en": "Local businesses are competing with large online retailers for customer loyalty.",
      "example_cn": "本地企业正在与大型在线零售商争夺客户的忠诚度。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be in opposition or conflict with another option, demand, or priority, often requiring a choice between alternatives.",
      "explanation_cn": "指与其他选项、需求或优先事项发生冲突，通常需要在多个选择之间做出取舍。",
      "example_en": "Her career goals are competing with her family responsibilities.",
      "example_cn": "她的职业目标与家庭责任发生了冲突。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rivaling",
      "analysis": "“Rivaling” (与…竞争/匹敌) 更强调双方实力接近、势均力敌，常用于描述一种持续的、高水平的对抗关系，语气更正式或文学化。而 “competing” 更通用，可涵盖从激烈对抗到普通商业竞争的广泛情境。"
    },
    {
      "word_to_compare": "contesting",
      "analysis": "“Contesting” (争夺/质疑) 常用于法律、选举或正式权利的争夺，带有对抗性和争议性，强调对某项权利、地位或结果的挑战。而 “competing” 更中性，侧重于通过努力争取优势，不一定涉及冲突或异议。"
    },
    {
      "word_to_compare": "striving",
      "analysis": "“Striving” (努力奋斗) 强调个人或群体为达成目标所付出的持续努力，不必然涉及与他人的直接对抗。而 “competing” 明确包含与他人比较和对抗的维度，是社会性行为，而 “striving” 可以是内在驱动的。"
    }
  ]
}