{
  "word": "compact",
  "pronunciation": "kum·paktt",
  "concise_definition": "adj. 紧凑的, 简明的; v. 压紧, 使紧凑; n. 合同, 协议",
  "forms": {
    "comparative": "more compact",
    "superlative": "most compact",
    "third_person_singular": "compacts",
    "past_tense": "compacted",
    "past_participle": "compacted",
    "present_participle": "compacting"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Designed or arranged in a small, efficient space without unnecessary elements; closely packed together.",
      "explanation_cn": "设计或安排得空间紧凑、高效，没有多余元素；紧密地聚集在一起。",
      "example_en": "The new smartphone has a compact design that fits easily in a pocket.",
      "example_cn": "这款新智能手机采用紧凑设计，轻松放入口袋。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Expressed in a brief and clear way, using few words without losing meaning.",
      "explanation_cn": "用简洁明了的方式表达，用极少的词语传达完整含义。",
      "example_en": "She gave a compact summary of the report, covering all key points in two sentences.",
      "example_cn": "她用两句话对报告做了简明扼要的总结，涵盖了所有要点。"
    },
    {
      "pos": "verb",
      "explanation_en": "To press or squeeze something together to reduce its size or volume.",
      "explanation_cn": "通过按压或挤压使某物体积缩小或更紧密。",
      "example_en": "The garbage truck compacts waste to maximize its carrying capacity.",
      "example_cn": "垃圾车将垃圾压紧，以最大化其载重能力。"
    },
    {
      "pos": "noun",
      "explanation_en": "A formal agreement or contract, especially one between parties with mutual obligations, often used in political or legal contexts.",
      "explanation_cn": "一种正式协议或合同，尤其指双方承担相互义务的约定，常用于政治或法律语境。",
      "example_en": "The two nations signed a compact to reduce military presence along the border.",
      "example_cn": "两国签署了一项协议，以减少在边境的军事部署。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "concise",
      "analysis": "“Concise”（简洁的）强调语言或表达的精炼，去除冗余，但不涉及物理形态。而 “compact” 既可以用于语言（与 concise 近义），也可用于物理空间或物体的紧凑性，语义范围更广。"
    },
    {
      "word_to_compare": "tight",
      "analysis": "“Tight”（紧的）通常指物理上的紧绷或密封，如衣服贴身、盖子拧紧，侧重张力或封闭性；而 “compact” 更强调空间利用效率和结构密度，不一定有张力，如紧凑型汽车。"
    },
    {
      "word_to_compare": "contract",
      "analysis": "“Contract”（收缩/合同）作为动词时，指体积或范围的缩小，常伴随物理或医学含义（如肌肉收缩）；作为名词时，与 “compact” 在法律语境中可互换，但 “contract” 更正式、法律约束力更强，而 “compact” 多用于国家或组织间的非正式协议。"
    }
  ]
}