{
  "word": "compounds",
  "pronunciation": "kum·pawndz",
  "concise_definition": "n. 化合物, 复合物, 复合词, 院落",
  "forms": {
    "singular": "compound"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A substance formed when two or more different chemical elements are chemically bonded together in fixed proportions.",
      "explanation_cn": "指两种或两种以上不同化学元素以固定比例通过化学键结合而成的物质。",
      "example_en": "Water is a compound made of hydrogen and oxygen.",
      "example_cn": "水是由氢和氧组成的化合物。"
    },
    {
      "pos": "noun",
      "explanation_en": "A word formed by combining two or more words to create a new meaning, such as 'notebook' or 'mother-in-law'.",
      "explanation_cn": "指由两个或多个词组合而成、具有新含义的词语，如 'notebook'（笔记本）或 'mother-in-law'（岳母）。",
      "example_en": "'Sunflower' is a compound word that combines 'sun' and 'flower'.",
      "example_cn": "'Sunflower'（向日葵）是一个由 'sun' 和 'flower' 组合而成的复合词。"
    },
    {
      "pos": "noun",
      "explanation_en": "An enclosed area, especially one surrounded by walls or fences, often containing buildings or residences.",
      "explanation_cn": "指一个被围墙或围栏围起来的区域，通常包含建筑物或住宅。",
      "example_en": "The university has several residential compounds for international students.",
      "example_cn": "这所大学为国际学生设有多个住宅院落。"
    },
    {
      "pos": "noun",
      "explanation_en": "A mixture of different substances that are physically combined but not chemically bonded, especially in contexts like pharmaceuticals or construction materials.",
      "explanation_cn": "指在制药或建筑材料等语境中，物理混合但未发生化学结合的多种物质的组合。",
      "example_en": "The pharmacist prepared a compound ointment with three active ingredients.",
      "example_cn": "药剂师配制了一种含有三种活性成分的复合药膏。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mixture",
      "analysis": "“Mixture”（混合物）指两种或多种物质物理混合，各成分保持原有化学性质，可分离；而 “compound”（化合物）是通过化学键结合形成的全新物质，具有不同于组成元素的性质，无法通过物理方法分离。"
    },
    {
      "word_to_compare": "combination",
      "analysis": "“Combination”（组合）是一个更宽泛的术语，可指任何事物的结合，包括抽象概念、数字、颜色等，不强调化学或结构上的融合；而 “compound” 在科学语境中特指通过化学反应形成的稳定新物质，具有明确的分子结构。"
    },
    {
      "word_to_compare": "complex",
      "analysis": "“Complex”（复合体/复杂体）强调由多个部分构成的系统性整体，常用于描述结构、心理或社会现象，如 ‘complex system’；而 ‘compound’ 更侧重于物质或语言层面的组合，具有可定义的组成规则（如化学式或构词法）。"
    }
  ]
}