{
  "word": "compliment",
  "pronunciation": "kum·pluh·muhnt",
  "concise_definition": "n. 赞美, 称赞; v. 赞美, 表扬",
  "forms": {
    "plural": "compliments",
    "third_person_singular": "compliments",
    "past_tense": "complimented",
    "past_participle": "complimented",
    "present_participle": "complimenting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An expression of praise, admiration, or approval, often directed toward someone's appearance, abilities, or achievements.",
      "explanation_cn": "指对某人的外貌、能力或成就所表达的赞美、钦佩或认可。",
      "example_en": "She received many compliments on her elegant dress at the gala.",
      "example_cn": "她在晚宴上穿着优雅的礼服，收到了许多赞美。"
    },
    {
      "pos": "noun",
      "explanation_en": "A polite gesture or remark, sometimes used to convey respect or maintain social harmony, even if not entirely sincere.",
      "explanation_cn": "指一种礼貌性的言辞或举动，有时用于表达尊重或维持社交和谐，即使并非完全真诚。",
      "example_en": "He offered a compliment about the weather to break the awkward silence.",
      "example_cn": "他夸了一句天气好，以打破尴尬的沉默。"
    },
    {
      "pos": "verb",
      "explanation_en": "To express admiration or praise for someone or something, often in a sincere and appreciative manner.",
      "explanation_cn": "指以真诚和赞赏的方式对某人或某事表示赞美。",
      "example_en": "The teacher complimented the student on her thoughtful essay.",
      "example_cn": "老师称赞了这名学生富有思想性的论文。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a polite or flattering remark, sometimes as a social courtesy or to gain favor.",
      "explanation_cn": "指出于社交礼仪或为博取好感而说出恭维或讨好的话。",
      "example_en": "He complimented her on her cooking, though he didn't really enjoy the meal.",
      "example_cn": "他夸了她的厨艺，尽管他其实并不喜欢这顿饭。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "praise",
      "analysis": "“Praise” (赞扬) 更强调对成就、行为或品质的正式或严肃的认可，语气通常更庄重、更强烈，常用于教育、工作或道德层面。而 “compliment” 更偏向日常、轻松的赞美，常针对外貌、举止或表面特征，情感色彩更温和。"
    },
    {
      "word_to_compare": "flattery",
      "analysis": "“Flattery” (奉承) 通常带有贬义，指过度或虚伪的赞美，目的是取悦或操纵他人。而 “compliment” 通常是真诚或至少是礼貌的，不必然带有功利动机。两者在语义上可能重叠，但情感倾向截然不同。"
    },
    {
      "word_to_compare": "commendation",
      "analysis": "“Commendation” (嘉奖) 是一种正式的、书面或官方的表扬，常见于军事、学术或机构环境中，具有权威性和记录性。而 “compliment” 是非正式的口头或书面表达，不具制度性效力，更贴近人际互动。"
    }
  ]
}