{
  "word": "compromise",
  "pronunciation": "käm·prə·mīz",
  "concise_definition": "n. 妥协, 折中; v. 妥协, 让步, 危及",
  "forms": {
    "third_person_singular": "compromises",
    "past_tense": "compromised",
    "past_participle": "compromised",
    "present_participle": "compromising"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A settlement of differences in which each side makes concessions to reach an agreement, often resulting in a middle-ground solution that is acceptable but not ideal for all parties.",
      "explanation_cn": "指各方为达成协议而相互让步，通常形成一种折中方案，虽非各方理想之选，但可被接受。",
      "example_en": "After hours of negotiation, both parties reached a compromise on the new tax policy.",
      "example_cn": "经过数小时的谈判，双方就新的税收政策达成了妥协。"
    },
    {
      "pos": "noun",
      "explanation_en": "A reduction in quality, integrity, or value due to an unacceptable adjustment or sacrifice.",
      "explanation_cn": "指因做出不可接受的让步或牺牲而导致质量、诚信或价值的降低。",
      "example_en": "The artist refused to make any compromise on his creative vision.",
      "example_cn": "这位艺术家拒绝在创作理念上做出任何妥协。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make concessions in order to reach an agreement or resolve a conflict, often by giving up part of one's demands.",
      "explanation_cn": "指为达成协议或解决冲突而做出让步，通常意味着放弃部分要求。",
      "example_en": "The manager compromised with the employees by agreeing to a shorter workweek.",
      "example_cn": "经理通过同意实行更短的工作周，与员工达成了妥协。"
    },
    {
      "pos": "verb",
      "explanation_en": "To expose or endanger something (such as safety, reputation, or security) by making a risky or unwise decision.",
      "explanation_cn": "指因做出冒险或不明智的决定而危及某事物（如安全、声誉或保密性）。",
      "example_en": "Sharing passwords with colleagues can compromise the security of the entire system.",
      "example_cn": "与同事共享密码可能会危及整个系统的安全。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "concession",
      "analysis": "“Concession” (让步) 指单方面做出的让步，通常是为满足对方要求而放弃某项立场或利益，不必然包含双方互动或协议。而 “compromise” 强调双方相互让步，形成共同接受的解决方案。"
    },
    {
      "word_to_compare": "mediation",
      "analysis": "“Mediation” (调解) 是指由第三方介入帮助双方达成协议的过程，是一种方法或机制；而 “compromise” 是该过程中可能达成的结果。调解是过程，妥协是结果。"
    },
    {
      "word_to_compare": "sacrifice",
      "analysis": "“Sacrifice” (牺牲) 指为他人或更高目标而主动放弃重要利益，常带有道德或情感上的崇高意味；而 “compromise” 更偏向实用主义，强调权衡与平衡，不一定涉及高尚动机，有时甚至带有负面含义（如降低标准）。"
    }
  ]
}