{
  "word": "competitions",
  "pronunciation": "kam·puh·tish·uhnz",
  "concise_definition": "n. 比赛, 竞赛, 竞争",
  "forms": {
    "singular": "competition"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An organized event in which individuals or teams compete against each other to determine a winner based on skill, performance, or achievement.",
      "explanation_cn": "指组织化的活动，个人或团队在此类活动中通过技能、表现或成就相互竞争以决出优胜者。",
      "example_en": "The international chess competition attracted participants from over 50 countries.",
      "example_cn": "这场国际象棋比赛吸引了来自50多个国家的参赛者。"
    },
    {
      "pos": "noun",
      "explanation_en": "A struggle or rivalry between two or more parties for superiority, advantage, or limited resources, often in business, science, or culture.",
      "explanation_cn": "指两个或多个主体之间为争取优势、主导地位或有限资源而进行的斗争或竞争，常用于商业、科学或文化领域。",
      "example_en": "The competition among tech companies to innovate has accelerated the pace of digital transformation.",
      "example_cn": "科技公司之间为创新而展开的竞争加速了数字化转型的步伐。"
    },
    {
      "pos": "noun",
      "explanation_en": "A contest or challenge designed to test ability, creativity, or endurance, often with prizes or recognition as incentives.",
      "explanation_cn": "指为测试能力、创造力或耐力而设计的竞赛或挑战，通常以奖品或荣誉作为激励。",
      "example_en": "She entered a baking competition and won first prize for her chocolate cake.",
      "example_cn": "她参加了一场烘焙比赛，并因她的巧克力蛋糕获得了一等奖。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "contest",
      "analysis": "“Contest”（竞赛）与 “competition” 非常接近，常可互换，但 “contest” 更强调规则明确、有明确胜负判定的对抗，常用于单次性活动（如歌唱比赛、选美）。而 “competition” 范围更广，可指长期、系统性的竞争，包括市场或行业层面的竞争。"
    },
    {
      "word_to_compare": "rivalry",
      "analysis": "“Rivalry”（敌对竞争）侧重于长期存在的对立关系，通常带有情感色彩（如仇恨、嫉妒或自豪感），多用于描述两个固定对手之间的持续对抗（如球队之间的宿敌关系）。而 “competition” 更中性，可指任何有输赢结果的较量，不一定有情感纠葛。"
    },
    {
      "word_to_compare": "tournament",
      "analysis": "“Tournament”（锦标赛）特指一种有固定赛制、多轮淘汰或循环赛结构的竞赛形式，常见于体育项目（如足球世界杯、网球大满贯）。它是 “competition” 的一种具体类型，而 “competition” 是更上位的总称，可涵盖非体育类或非结构化竞争。"
    }
  ]
}