{
  "word": "conan",
  "pronunciation": "koh·nahn",
  "concise_definition": "n. （专有名词）康纳（人名或作品名）",
  "forms": {
    "plural": "Conans"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A proper noun commonly referring to Conan the Barbarian, a fictional sword-and-sorcery hero created by Robert E. Howard, known for his strength, courage, and adventures in a mythical ancient world.",
      "explanation_cn": "专有名词，通常指由罗伯特·E·霍华德创作的虚构英雄‘野蛮人柯南’，以力量、勇气和在神话古代世界中的冒险而闻名。",
      "example_en": "Conan the Barbarian has inspired countless fantasy novels and movies since his debut in 1932.",
      "example_cn": "自1932年首次登场以来，野蛮人柯南已启发了无数奇幻小说和电影。"
    },
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to Conan O'Brien, a well-known American television host, comedian, and writer, famous for his late-night talk shows and satirical humor.",
      "explanation_cn": "专有名词，指美国著名电视主持人、喜剧演员和作家康南·奥布莱恩，以其深夜脱口秀和讽刺幽默而闻名。",
      "example_en": "Conan O'Brien's witty monologues and celebrity interviews made him a staple of late-night TV for decades.",
      "example_cn": "康南·奥布莱恩机智的开场独白和名人访谈使他成为深夜电视节目数十年的标志性人物。"
    },
    {
      "pos": "noun",
      "explanation_en": "A proper noun used as a given name in various cultures, derived from Irish origins meaning 'little hound' or 'wolf', sometimes used in modern contexts as a unique personal name.",
      "explanation_cn": "作为人名在多种文化中使用的专有名词，源自爱尔兰语，意为‘小猎犬’或‘狼’，有时在现代语境中用作独特的个人姓名。",
      "example_en": "The baby was named Conan after his grandfather, a proud Gaelic descendant.",
      "example_cn": "这个婴儿以祖父的名字命名，名为康纳，因其祖父是骄傲的盖尔族后裔。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "barbarian",
      "analysis": "“Barbarian”（野蛮人）是一个普通名词，泛指未开化或粗野的人，常带有贬义。而 “Conan” 是专有名词，特指一个具体的文学/影视角色，其形象虽为“野蛮人”，但已升华为文化符号，承载英雄主义与冒险精神，语义远超普通名词。"
    },
    {
      "word_to_compare": "host",
      "analysis": "“Host”（主持人）是一个通用职业名词，指主持节目或活动的人。而 “Conan”（指康南·奥布莱恩）是具体人物的专有名称，虽其职业是主持人，但该词本身不具职业含义，仅作为个体标识。"
    },
    {
      "word_to_compare": "name",
      "analysis": "“Name”（名字）是泛指任何称呼，而 “Conan” 是一个具体的、具有文化背景和多重指涉的专有名称。它不是普通名词，不能直接等同于“名字”这一抽象概念，而是承载了历史、流行文化与个人身份的具体实体。"
    }
  ]
}