{
  "word": "condemnation",
  "pronunciation": "kon·duh·mey·shun",
  "concise_definition": "n. 谴责, 判刑, 宣判",
  "forms": {
    "plural": "condemnations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A strong expression of disapproval or criticism, often moral or ethical in nature, directed at an action, behavior, or person deemed wrong or unacceptable.",
      "explanation_cn": "对某种行为、举动或人所作出的强烈反对或批评，通常基于道德或伦理立场，认为其错误或不可接受。",
      "example_en": "The public expressed widespread condemnation of the politician's corrupt practices.",
      "example_cn": "公众对这位政客的腐败行为表达了广泛的谴责。"
    },
    {
      "pos": "noun",
      "explanation_en": "A legal judgment or sentence, especially one that declares someone guilty and imposes a penalty, such as death or imprisonment.",
      "explanation_cn": "法律上的判决，特别是宣告某人有罪并施加刑罚（如死刑或监禁）的正式裁定。",
      "example_en": "The court handed down a condemnation of life imprisonment for the convicted murderer.",
      "example_cn": "法院对这名被定罪的杀人犯判处了终身监禁。"
    },
    {
      "pos": "noun",
      "explanation_en": "The official declaration that a building or structure is unsafe and must be demolished or vacated.",
      "explanation_cn": "官方宣布某建筑物或结构存在安全隐患，必须被拆除或清空。",
      "example_en": "The old factory was marked for condemnation due to structural instability.",
      "example_cn": "由于结构不稳，这座旧工厂被宣布为危房。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "criticism",
      "analysis": "“Criticism”（批评）是一个更广泛、更中性的词，可以指建设性或非建设性的意见，不一定带有道德或法律的严厉性。而 “condemnation” 意味着更强烈的否定，通常包含道德审判或最终判决的意味，语气更严厉、更不容辩驳。"
    },
    {
      "word_to_compare": "denunciation",
      "analysis": "“Denunciation”（公开谴责）与 “condemnation” 非常接近，都表示公开的强烈反对。但 “denunciation” 更强调公开宣告、控诉的行为，常用于政治或宗教语境，带有煽动性或呼吁他人共同反对的色彩；而 “condemnation” 更侧重于判断结果本身，可以是官方、法律或社会层面的定性。"
    },
    {
      "word_to_compare": "sentence",
      "analysis": "“Sentence”（判决）特指司法系统中对罪犯所作的正式刑罚决定，是 “condemnation” 在法律语境下的具体表现形式。而 “condemnation” 的含义更广，可涵盖道德、社会、建筑等多领域，不限于法律程序。"
    }
  ]
}