{
  "word": "conduct",
  "pronunciation": "kun·dukt",
  "concise_definition": "v. 组织, 实施, 引导, 行为; n. 行为, 举止",
  "forms": {
    "third_person_singular": "conducts",
    "past_tense": "conducted",
    "past_participle": "conducted",
    "present_participle": "conducting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To organize and carry out an activity, especially one that is systematic or formal, such as an experiment, investigation, or event.",
      "explanation_cn": "指有组织地实施或开展某项活动，尤其是实验、调查或正式事件。",
      "example_en": "The researchers conducted a survey to understand public opinion on climate change.",
      "example_cn": "研究人员开展了一项调查，以了解公众对气候变化的看法。"
    },
    {
      "pos": "verb",
      "explanation_en": "To lead or direct a group, performance, or process, especially in a formal or authoritative manner (e.g., conducting an orchestra or a meeting).",
      "explanation_cn": "指以正式或权威的方式领导或指导一个团体、表演或过程（如指挥乐队或主持会议）。",
      "example_en": "She conducted the symphony with great precision and emotion.",
      "example_cn": "她以极高的精准度和情感指挥了交响乐。"
    },
    {
      "pos": "verb",
      "explanation_en": "To behave in a particular way, especially in terms of moral or social standards; often used in the context of personal or professional demeanor.",
      "explanation_cn": "指以某种方式行事，尤其涉及道德或社会规范；常用于描述个人或职业行为举止。",
      "example_en": "He was reprimanded for his unprofessional conduct during the meeting.",
      "example_cn": "他因在会议中的不专业行为而受到训斥。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person's behavior or manner of acting, especially as judged by moral, social, or professional standards.",
      "explanation_cn": "指一个人的行为或处事方式，尤其依据道德、社会或职业标准进行评判。",
      "example_en": "Her conduct in the workplace has always been exemplary.",
      "example_cn": "她在工作场所的行为一直堪称典范。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "carry out",
      "analysis": "“Carry out”（执行）强调完成一项任务或计划，侧重于行动的落实，语义较中性，常用于日常或行政语境。而 “conduct” 更强调过程的组织性、系统性或权威性，常用于正式场合，如实验、调查或指挥。"
    },
    {
      "word_to_compare": "manage",
      "analysis": "“Manage”（管理）侧重于控制、协调资源或人员以达成目标，常用于商业或行政语境。而 “conduct” 更强调亲自引导或主持某项活动，尤其在艺术、科学或行为规范方面，更突出主导者的角色。"
    },
    {
      "word_to_compare": "behavior",
      "analysis": "“Behavior”（行为）是名词，泛指一个人的外在表现，是中性描述词。而 “conduct” 作为名词时，带有更强的道德或规范评判色彩，常用于正式或法律语境，如“professional conduct”（职业操守）或“misconduct”（不当行为）。"
    }
  ]
}