{
  "word": "condemned",
  "pronunciation": "kon·demd",
  "concise_definition": "adj. 被谴责的, 被判刑的; v. 谴责, 判刑 (过去式和过去分词)",
  "forms": {
    "base_form": "condemn",
    "third_person_singular": "condemns",
    "present_participle": "condemning",
    "past_tense": "condemned",
    "past_participle": "condemned"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing someone or something that has been officially judged guilty or morally unacceptable, often resulting in punishment or social rejection.",
      "explanation_cn": "指某人或某事物已被正式判定为有罪或道德上不可接受，通常导致惩罚或社会排斥。",
      "example_en": "The condemned prisoner was taken to the execution chamber.",
      "example_cn": "这名被判处死刑的囚犯被带到了行刑室。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used to describe buildings or areas declared unsafe or unfit for use by authorities, often due to structural damage or violation of regulations.",
      "explanation_cn": "指被当局宣布为不安全或不适合使用的建筑或区域，通常因结构损坏或违反法规。",
      "example_en": "The old factory building was condemned and scheduled for demolition.",
      "example_cn": "这座旧工厂大楼被宣布为危楼，即将被拆除。"
    },
    {
      "pos": "verb",
      "explanation_en": "To express strong disapproval or criticism of someone or something, especially on moral or ethical grounds.",
      "explanation_cn": "指强烈谴责某人或某事，尤其基于道德或伦理立场。",
      "example_en": "The international community condemned the act of aggression as a violation of human rights.",
      "example_cn": "国际社会谴责这一侵略行为是对人权的侵犯。"
    },
    {
      "pos": "verb",
      "explanation_en": "To sentence someone to a punishment, especially death or imprisonment, by legal authority.",
      "explanation_cn": "指由法律权威对某人判处刑罚，尤其是死刑或监禁。",
      "example_en": "He was condemned to life in prison for murder.",
      "example_cn": "他因谋杀被判处终身监禁。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "criticize",
      "analysis": "“Criticize” (批评) 是一个更中性或普遍的词，指指出缺点或错误，不一定带有强烈的道德判断或法律后果。而 “condemn” 意味着更严厉、更正式的否定，常伴随道德义愤或法律制裁。"
    },
    {
      "word_to_compare": "denounce",
      "analysis": "“Denounce” (公开谴责) 与 “condemn” 非常接近，都表示公开强烈反对，但 “denounce” 更强调在公众场合或通过声明进行揭露和控诉，常用于政治或道德运动中；而 “condemn” 更常用于司法判决或权威机构的正式裁决。"
    },
    {
      "word_to_compare": "sentence",
      "analysis": "“Sentence” (判刑) 是法律术语，专指法院对罪犯正式宣告刑罚，是 “condemn” 在司法语境下的具体执行方式。而 “condemn” 可用于更广泛的语境，包括道德、社会或建筑层面的否定，不限于法律判决。"
    }
  ]
}