{
  "word": "conditioner",
  "pronunciation": "kun·di·shuh·nuhr",
  "concise_definition": "n. 护发素, 条件调节剂, 调节器",
  "forms": {
    "plural": "conditioners"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A cosmetic or hair care product applied to hair after shampooing to improve its texture, manageability, and appearance by moisturizing and smoothing the hair cuticle.",
      "explanation_cn": "一种用于洗发后涂抹在头发上的化妆品或护发产品，通过保湿和平滑毛鳞片来改善头发的质地、易梳理性和外观。",
      "example_en": "She uses a deep-conditioning treatment once a week to restore her dry, damaged hair.",
      "example_cn": "她每周使用一次深层护发素来修复干燥受损的头发。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device or system that regulates environmental conditions, especially temperature and humidity, such as an air conditioner or a soil conditioner.",
      "explanation_cn": "一种用于调节环境条件（尤其是温度和湿度）的装置或系统，例如空调或土壤调节剂。",
      "example_en": "The greenhouse uses a sophisticated climate conditioner to maintain optimal growing conditions.",
      "example_cn": "温室使用先进的气候调节器以维持最佳的生长环境。"
    },
    {
      "pos": "noun",
      "explanation_en": "A substance added to a material to improve its properties, such as fabric softener or a leather conditioner.",
      "explanation_cn": "添加到某种材料中以改善其性能的物质，例如织物柔顺剂或皮革护理剂。",
      "example_en": "He applied leather conditioner to keep his boots supple and prevent cracking.",
      "example_cn": "他涂抹皮革护理剂以保持靴子柔软并防止开裂。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "shampoo",
      "analysis": "“Shampoo”（洗发水）主要用于清洁头发和头皮，去除油脂和污垢；而 “conditioner”（护发素）则在清洁后使用，目的是修复、滋养和柔顺头发，两者功能互补但目的不同。"
    },
    {
      "word_to_compare": "softener",
      "analysis": "“Softener”（柔顺剂）通常指用于衣物洗涤后使织物变柔软的化学剂，侧重于减少静电和纤维僵硬；而 “conditioner” 范围更广，可应用于头发、皮革、土壤等，不仅改善柔软度，还涉及保湿、修复和保护等多重功能。"
    },
    {
      "word_to_compare": "regulator",
      "analysis": "“Regulator”（调节器）是一个更通用的术语，泛指任何控制或稳定系统参数的装置（如电压调节器、压力调节器）；而 “conditioner” 特指通过添加物质或调整环境来改善特定材料或环境的“状态”或“品质”，更强调改善而非单纯控制。"
    }
  ]
}