{
  "word": "condition",
  "pronunciation": "kun·dih·shuhn",
  "concise_definition": "n. 状态, 条件, 环境; v. 约定, 使适应",
  "forms": {
    "plural": "conditions",
    "third_person_singular": "conditions",
    "past_tense": "conditioned",
    "past_participle": "conditioned",
    "present_participle": "conditioning"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The state or quality of something at a particular time, especially in terms of its physical, mental, or functional well-being.",
      "explanation_cn": "指某物在特定时间的状态或品质，尤其指其身体、心理或功能上的健康状况。",
      "example_en": "After the accident, his health was in poor condition.",
      "example_cn": "事故发生后，他的健康状况很差。"
    },
    {
      "pos": "noun",
      "explanation_en": "A stipulation or requirement that must be met for something to happen or be valid, often used in contracts, agreements, or rules.",
      "explanation_cn": "指为使某事发生或有效而必须满足的条款或要求，常用于合同、协议或规则中。",
      "example_en": "The deal is subject to the condition that the buyer secures financing.",
      "example_cn": "这笔交易以买方获得融资为前提条件。"
    },
    {
      "pos": "noun",
      "explanation_en": "The circumstances or environment in which something exists or occurs, often influencing outcomes or behavior.",
      "explanation_cn": "指某事物存在或发生时所处的环境或情形，通常会影响结果或行为。",
      "example_en": "The workers demanded better working conditions.",
      "example_cn": "工人要求改善工作环境。"
    },
    {
      "pos": "verb",
      "explanation_en": "To train or adapt someone or something to respond in a particular way through repeated exposure or practice.",
      "explanation_cn": "指通过反复接触或训练，使某人或某物适应某种特定反应或行为模式。",
      "example_en": "Athletes condition their bodies through daily exercise and diet.",
      "example_cn": "运动员通过每日锻炼和饮食来增强体能。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make something dependent on a specific requirement or circumstance.",
      "explanation_cn": "指使某事依赖于特定的要求或情况。",
      "example_en": "The grant is conditioned on the submission of a progress report.",
      "example_cn": "该资助以提交进展报告为条件。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "state",
      "analysis": "“State” (状态) 更侧重于描述事物在某一时刻的总体情况，常用于抽象或物理状态，如“state of mind”或“state of repair”。“Condition” 更强调事物的健康、功能或适配性，常带有评估或规范的意味，如“in good condition”。"
    },
    {
      "word_to_compare": "term",
      "analysis": "“Term” (条款) 通常指协议或合同中的具体规定，是法律或正式语境中的固定用语。而 “condition” 虽然也可指条款，但更强调其作为前提或必要条件的功能性，常隐含“若不满足则无效”的逻辑关系。"
    },
    {
      "word_to_compare": "environment",
      "analysis": "“Environment” (环境) 指外部的物理、社会或自然背景，通常是客观存在的。而 “condition” 在表示环境时，更侧重于对主体产生直接影响的特定情境或制约因素，如“working conditions”强调的是对人的影响，而非地理或生态背景。"
    },
    {
      "word_to_compare": "train",
      "analysis": "“Train” (训练) 是一个更通用的动词，泛指通过教学或练习提升技能或行为。“Condition” 作为动词时，特指通过系统性锻炼或适应性训练来增强身体或系统的功能耐力，常用于体育、军事或生理语境，语义更专业、更具体。"
    }
  ]
}