{
  "word": "conducts",
  "pronunciation": "kun·dukt",
  "concise_definition": "v. 组织, 实施, 指挥, 行为",
  "forms": {
    "base_form": "conduct",
    "third_person_singular": "conducts",
    "past_tense": "conducted",
    "past_participle": "conducted",
    "present_participle": "conducting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To organize and carry out an activity, especially one that is formal, systematic, or requires leadership (e.g., an experiment, survey, or ceremony).",
      "explanation_cn": "指组织并执行某项活动，尤其是需要领导力的正式或系统性活动（如实验、调查或仪式）。",
      "example_en": "The university conducts annual research surveys on student well-being.",
      "example_cn": "这所大学每年都会开展关于学生福祉的调研。"
    },
    {
      "pos": "verb",
      "explanation_en": "To direct or lead a musical performance, especially by an orchestra or choir, using gestures and cues to coordinate the musicians.",
      "explanation_cn": "指通过手势和提示来指挥管弦乐队或合唱团的音乐表演。",
      "example_en": "She conducts the symphony with remarkable precision and emotion.",
      "example_cn": "她以惊人的精准度和情感指挥交响乐。"
    },
    {
      "pos": "verb",
      "explanation_en": "To behave or act in a particular way, especially in terms of personal demeanor or moral standards.",
      "explanation_cn": "指以某种特定方式行事，尤其涉及个人举止或道德标准。",
      "example_en": "He conducts himself with dignity and professionalism in all situations.",
      "example_cn": "他在所有情况下都以尊严和专业精神行事。"
    },
    {
      "pos": "verb",
      "explanation_en": "To serve as a medium or carrier for the transmission of something, such as electricity, heat, or sound.",
      "explanation_cn": "指作为某种事物（如电、热或声音）传输的媒介或载体。",
      "example_en": "Copper conducts electricity better than most other metals.",
      "example_cn": "铜比大多数其他金属更能导电。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "carry out",
      "analysis": "“Carry out”（执行）强调完成一项任务或计划，语气较中性，常用于日常或行政语境，如“carry out an order”。而 “conduct” 更强调有组织性、系统性或权威性的引导过程，常用于正式或专业场景，如“conduct an investigation”。"
    },
    {
      "word_to_compare": "lead",
      "analysis": "“Lead”（领导）侧重于引导他人前进或决策，强调方向性和影响力，常用于团队或项目管理。而 “conduct” 在指挥音乐或实验时，更强调技术性操作和精确控制，不一定是决策者，而是执行流程的协调者。"
    },
    {
      "word_to_compare": "behave",
      "analysis": "“Behave”（表现）仅指个人的举止或行为方式，通常用于道德或社会规范层面，如“behave well”。而 “conduct” 在此义项下更正式、更全面，可涵盖长期一贯的行为模式，常用于评价职业操守或社会角色，如“conduct oneself”。"
    },
    {
      "word_to_compare": "transmit",
      "analysis": "“Transmit”（传输）专指能量、信号或信息的传递，强调物理或技术层面的转移，如“transmit a signal”。而 “conduct” 在此语境中不仅指传递，还隐含了物质作为媒介的特性（如导体），更强调材料本身的传导能力。"
    }
  ]
}