{
  "word": "conditioning",
  "pronunciation": "kun·duh·shuh·ning",
  "concise_definition": "n. 训练, 调节, 适应,  conditioning",
  "forms": {
    "plural": "conditionings"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of training or adapting someone or something to respond in a particular way through repeated exposure or practice, especially in psychology or sports.",
      "explanation_cn": "指通过反复的接触或练习，使某人或某物形成特定反应或行为模式的过程，尤其在心理学或体育训练中。",
      "example_en": "Athletes undergo rigorous physical conditioning to improve their performance.",
      "example_cn": "运动员通过严格的体能训练来提高表现。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process of modifying the environment or properties of a substance to achieve a desired state, such as air conditioning or hair conditioning.",
      "explanation_cn": "指通过调整环境或物质的特性以达到理想状态的过程，如空调调节空气、护发素调理头发。",
      "example_en": "The building has state-of-the-art air conditioning to maintain a comfortable temperature.",
      "example_cn": "这座建筑配备了先进的空调系统，以保持舒适的温度。"
    },
    {
      "pos": "noun",
      "explanation_en": "In psychology, the formation of associations between stimuli and responses, as in classical or operant conditioning.",
      "explanation_cn": "在心理学中，指刺激与反应之间形成关联的过程，如经典条件反射或操作性条件反射。",
      "example_en": "Pavlov's experiments on dogs demonstrated classical conditioning through the association of a bell with food.",
      "example_cn": "巴甫洛夫对狗的实验通过将铃声与食物关联，展示了经典条件反射。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "training",
      "analysis": "“Training” (训练) 更广泛地指为掌握技能或行为而进行的系统性指导，强调教学和学习过程，常用于职业、教育或技能培养。而 “conditioning” 更侧重于通过重复刺激形成自动反应，尤其在生理或心理层面，带有更强的无意识适应意味。"
    },
    {
      "word_to_compare": "adaptation",
      "analysis": "“Adaptation” (适应) 指生物或系统为应对环境变化而发生的自然或被动调整，通常是长期演化或自我调节的结果。而 “conditioning” 是一种有意识或人为干预的、通过重复强化实现的改变，更具主动性和可控性。"
    },
    {
      "word_to_compare": "treatment",
      "analysis": "“Treatment” (治疗/处理) 通常指为纠正问题或改善状况而采取的医学、心理或技术手段，如疾病治疗。而 “conditioning” 不一定针对问题，更多是优化或塑造状态，如体能强化或环境调节，目的性更偏向提升而非修复。"
    }
  ]
}