{
  "word": "cone",
  "pronunciation": "kohn",
  "concise_definition": "n. 圆锥, 锥形物, 松果; v. 形成圆锥形",
  "forms": {
    "plural": "cones"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A three-dimensional geometric shape with a circular base that tapers smoothly to a point called the apex or vertex.",
      "explanation_cn": "一种三维几何形状，具有圆形底面，并平滑地向一个称为顶点或尖端的点收窄。",
      "example_en": "The ice cream was served in a crispy sugar cone.",
      "example_cn": "冰淇淋被装在一个酥脆的糖锥里。"
    },
    {
      "pos": "noun",
      "explanation_en": "A solid, often pointed object shaped like a cone, such as a traffic cone or a pinecone.",
      "explanation_cn": "一种形状如圆锥的固体物体，例如交通锥或松果。",
      "example_en": "Workers placed orange cones around the construction site to warn drivers.",
      "example_cn": "工人在施工区域周围放置了橙色的锥形路障以警示司机。"
    },
    {
      "pos": "noun",
      "explanation_en": "A specialized cell in the retina of the eye that detects color and functions best in bright light.",
      "explanation_cn": "眼睛视网膜中的一种特殊细胞，负责感知颜色，并在强光下发挥最佳功能。",
      "example_en": "Humans have three types of cone cells, each sensitive to red, green, or blue light.",
      "example_cn": "人类有三种视锥细胞，分别对红光、绿光或蓝光敏感。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form or shape something into a cone or cone-like structure.",
      "explanation_cn": "将某物形成或塑造成圆锥形或类似圆锥的结构。",
      "example_en": "The snow began to cone around the top of the mountain as the wind blew.",
      "example_cn": "风吹动时，雪开始在山顶形成圆锥状堆积。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pyramid",
      "analysis": "“Pyramid”（金字塔）是一种底面为多边形（通常是正方形）并向上收拢至一个顶点的立体形状，而 “cone” 的底面是圆形。两者虽都有尖顶，但 “cone” 的侧面是光滑曲面，而 “pyramid” 由多个平面构成。"
    },
    {
      "word_to_compare": "wedge",
      "analysis": "“Wedge”（楔子）是呈三角形或梯形截面的物体，通常用于劈开或固定，其形状是线性收窄而非圆形收拢。而 “cone” 是围绕一个轴线旋转形成的对称体，强调曲面和旋转对称性。"
    },
    {
      "word_to_compare": "spire",
      "analysis": "“Spires”（尖塔）通常指建筑中高耸、细长的尖顶结构，如教堂尖塔，其形状可能类似圆锥，但更强调垂直高度和建筑美学，而非几何精确性。而 “cone” 是纯粹的几何术语，不涉及文化或功能语境。"
    }
  ]
}