{
  "word": "confederate",
  "pronunciation": "kun·fed·er·it",
  "concise_definition": "n. 同谋者, 联盟成员; adj. 联盟的, 共谋的",
  "forms": {
    "plural": "confederates",
    "adjective_form": "confederate",
    "noun_form": "confederate"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who is allied with others in a secret or illegal scheme, especially one who collaborates in wrongdoing or deception.",
      "explanation_cn": "指与他人结成同盟、共同参与秘密或非法计划的人，尤指在犯罪或欺骗行为中相互勾结的同谋者。",
      "example_en": "The thief was arrested along with his confederates who helped him plan the robbery.",
      "example_cn": "这名小偷与其同谋者一同被捕，这些人协助他策划了抢劫案。"
    },
    {
      "pos": "noun",
      "explanation_en": "A member of a political or military alliance, especially referring to soldiers or citizens of the Confederate States of America during the U.S. Civil War.",
      "explanation_cn": "指政治或军事联盟的成员，尤指美国内战期间美利坚联盟国（南方邦联）的士兵或公民。",
      "example_en": "The museum displays artifacts from both Union and Confederate soldiers.",
      "example_cn": "博物馆展出了联邦军和南方邦联军的文物。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Acting in alliance or cooperation, especially in a secret or coordinated way; sharing in a common purpose or plan.",
      "explanation_cn": "指以联盟或合作方式行动的，尤指以秘密或协调的方式共同参与某一目的或计划的。",
      "example_en": "The two companies made a confederate effort to dominate the market.",
      "example_cn": "这两家公司联手合作，试图垄断市场。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ally",
      "analysis": "“Ally”（盟友）通常指在政治、军事或战略上正式结盟的国家或团体，语义中性或正面，强调合作关系。而 “confederate” 更常用于非法或秘密勾结的语境，带有负面色彩，且多用于个人层面的共谋。"
    },
    {
      "word_to_compare": "accomplice",
      "analysis": "“Accomplice”（共犯）专指在犯罪中协助主犯的人，法律术语，强调参与具体违法行为。而 “confederate” 范围更广，可指非犯罪性的联盟成员（如历史中的南方邦联），也可用于犯罪语境，但不如 “accomplice” 专业和精确。"
    },
    {
      "word_to_compare": "alliance",
      "analysis": "“Alliance”（联盟）是名词，指两个或多个实体之间的正式合作关系，强调结构和协议。而 “confederate” 是形容词或名词，描述个体在联盟中的角色，更侧重于参与者的身份，而非联盟本身。"
    }
  ]
}