{
  "word": "confront",
  "pronunciation": "kun·fruhnt",
  "concise_definition": "v. 面对, 面临, 正视, 当面质问",
  "forms": {
    "third_person_singular": "confronts",
    "past_tense": "confronted",
    "past_participle": "confronted",
    "present_participle": "confronting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To face or deal with a difficult situation, problem, or emotion directly and without avoidance, often requiring courage or determination.",
      "explanation_cn": "指直接面对并处理一个困难的局面、问题或情绪，通常需要勇气或决心，而非回避。",
      "example_en": "She finally confronted her fear of public speaking by joining a toastmasters club.",
      "example_cn": "她通过加入演讲俱乐部，终于正视了自己对公众演讲的恐惧。"
    },
    {
      "pos": "verb",
      "explanation_en": "To meet someone face-to-face, especially to challenge them or hold them accountable for their actions or behavior.",
      "explanation_cn": "指与某人当面相遇，尤其是为了挑战对方或要求其对其行为负责。",
      "example_en": "The manager confronted the employee about the missed deadlines and unprofessional conduct.",
      "example_cn": "经理当面质问员工为何屡次错过截止日期并行为不专业。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be faced with or encounter something, especially something unpleasant or challenging, often unexpectedly.",
      "explanation_cn": "指遭遇或面临某种情况，尤其是不愉快或具有挑战性的情况，常带有意外性。",
      "example_en": "The country is confronting a severe shortage of medical supplies.",
      "example_cn": "该国正面临医疗物资严重短缺的困境。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "face",
      "analysis": "“Face” (面对) 是一个更通用、语气更中性的词，仅表示“与某事物相遇”或“处于某种境地”，不一定包含主动应对或挑战的意味。而 “confront” 强调主动、直接、有时带有对抗性地面对困难或责任，情感色彩更强。"
    },
    {
      "word_to_compare": "challenge",
      "analysis": "“Challenge” (挑战) 更侧重于主动发起对抗或提出质疑，通常带有发起行动的意味，如挑战权威或规则。而 “confront” 更强调“遭遇”并“应对”某种已存在的压力、问题或人，不一定是主动挑衅，但必须直面。"
    },
    {
      "word_to_compare": "encounter",
      "analysis": "“Encounter” (遭遇) 通常指偶然或中性地遇到某人或某事，不带有情绪或行动倾向，可能是正面、中性或负面的。而 “confront” 总是隐含一种需要处理、解决或回应的紧张感，常用于负面或困难情境，且强调主动性。"
    }
  ]
}