{
  "word": "confronts",
  "pronunciation": "kənˈfrʌnts",
  "concise_definition": "v. 面对, 直面, 对峙",
  "forms": {
    "base_form": "confront",
    "third_person_singular": "confronts",
    "past_tense": "confronted",
    "past_participle": "confronted",
    "present_participle": "confronting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To face or deal with a problem, challenge, or difficult situation directly and without avoidance, often requiring courage or determination.",
      "explanation_cn": "指直接面对并处理一个问题、挑战或困难局面，通常需要勇气或决心，而非回避。",
      "example_en": "She finally confronts her fear of public speaking by joining a toastmasters club.",
      "example_cn": "她通过加入演讲俱乐部，终于直面了自己对公众演讲的恐惧。"
    },
    {
      "pos": "verb",
      "explanation_en": "To come face to face with someone, especially in a challenging, hostile, or tense situation, often to demand accountability or express disagreement.",
      "explanation_cn": "指与某人正面相遇，尤其是在具有挑战性、敌对或紧张的情境中，通常是为了要求对方负责或表达异议。",
      "example_en": "The journalist confronts the politician with evidence of corruption.",
      "example_cn": "记者向这位政客出示了腐败的证据，当面质问。"
    },
    {
      "pos": "verb",
      "explanation_en": "To present something (such as a choice, option, or reality) to someone, forcing them to acknowledge or deal with it.",
      "explanation_cn": "指向某人提出某种事物（如选择、选项或现实），迫使其正视或应对。",
      "example_en": "The report confronts us with the harsh reality of climate change.",
      "example_cn": "这份报告让我们直面气候变化的严峻现实。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "face",
      "analysis": "“Face” (面对) 语义较中性，泛指“与某事物相遇”或“处于某种境况中”，不一定包含主动应对或对抗的意味。而 “confront” 更强调主动、直接、甚至带有对抗性地面对困难或责任，情感色彩更强烈。"
    },
    {
      "word_to_compare": "challenge",
      "analysis": "“Challenge” (挑战) 通常指主动发起对抗或提出质疑，带有进攻性；而 “confront” 更侧重于“应对”来自外部的压力、问题或人，可能是被动的、防御性的，但态度坚决。例如：你挑战一个人（challenge someone），但你面对一个人（confront someone）。"
    },
    {
      "word_to_compare": "encounter",
      "analysis": "“Encounter” (遭遇) 强调偶然或中性地遇到某人或某事，不带有情绪或意图。它可以是愉快的、中立的或意外的。而 “confront” 总是带有某种紧张、冲突或必须处理的意味，具有明确的目的性和心理张力。"
    }
  ]
}