{
  "word": "connection",
  "pronunciation": "kə·nek·shən",
  "concise_definition": "n. 连接, 关系, 联系, 人脉",
  "forms": {
    "plural": "connections"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A physical or abstract link between two or more things, people, or systems that enables interaction, communication, or transfer of energy, data, or resources.",
      "explanation_cn": "指两个或多个事物、人或系统之间存在的物理或抽象联系，使互动、沟通或能量、数据、资源的传递成为可能。",
      "example_en": "The train station has a direct connection to the airport via subway.",
      "example_cn": "火车站可通过地铁直接连接到机场。"
    },
    {
      "pos": "noun",
      "explanation_en": "A relationship or association between people, often based on shared interests, social ties, or mutual benefit, especially in professional contexts.",
      "explanation_cn": "指人与人之间的关系或联系，通常基于共同兴趣、社会纽带或互利关系，尤其在职业语境中指人脉关系。",
      "example_en": "She got the job through a connection she had at the company.",
      "example_cn": "她通过在公司认识的一位人脉关系获得了这份工作。"
    },
    {
      "pos": "noun",
      "explanation_en": "An emotional or psychological bond between individuals, often implying deep understanding or empathy.",
      "explanation_cn": "指人与人之间的情感或心理纽带，常暗示着深刻的理解或共情。",
      "example_en": "There was an instant connection between them when they met.",
      "example_cn": "他们一见面就产生了强烈的共鸣。"
    },
    {
      "pos": "noun",
      "explanation_en": "A logical or causal relationship between ideas, events, or phenomena, indicating that one influences or relates to another.",
      "explanation_cn": "指思想、事件或现象之间的逻辑或因果关系，表明一方影响或关联着另一方。",
      "example_en": "The study found a connection between sleep deprivation and decreased cognitive performance.",
      "example_cn": "这项研究发现睡眠不足与认知能力下降之间存在关联。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "link",
      "analysis": "“Link” (链接) 通常指更具体、更直接的连接，常用于技术、物理或逻辑层面，如网页链接、链条连接。它比 “connection” 更中性、更机械，较少用于情感或社会关系。而 “connection” 的语义范围更广，可涵盖抽象、情感和人际层面。"
    },
    {
      "word_to_compare": "relation",
      "analysis": "“Relation” (关系) 更强调两个实体之间的相互作用或状态，常用于学术或正式语境，如数学关系、亲属关系。它偏重描述性质，而 “connection” 更强调连接的动作或结果，更具动态性和功能性。"
    },
    {
      "word_to_compare": "bond",
      "analysis": "“Bond” (纽带) 通常指更牢固、更持久的情感或道德联系，如亲情、友情或忠诚。它带有强烈的情感色彩和深度，而 “connection” 可以是短暂、表面或功能性的，如一次商务会面建立的联系。"
    },
    {
      "word_to_compare": "tie",
      "analysis": "“Tie” (纽带/联系) 常用于比喻性表达，如 “family tie” 或 “political tie”，强调一种束缚性或义务性的连接。它比 “connection” 更具约束感，有时带有负面含义（如被束缚），而 “connection” 更中性甚至积极，常用于表达机会或便利。"
    }
  ]
}