{
  "word": "conservatory",
  "pronunciation": "kun·sər·vuh·tuh·ree",
  "concise_definition": "n. 温室, 音乐学院, 保守派",
  "forms": {
    "plural": "conservatories"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A building or structure with glass walls and roof, designed to protect and cultivate plants, especially in cold climates, often used for scientific study or public display.",
      "explanation_cn": "一种具有玻璃墙壁和屋顶的建筑，用于在寒冷气候中保护和培育植物，常用于科学研究或公众展示。",
      "example_en": "The botanical garden features a magnificent Victorian conservatory filled with exotic orchids.",
      "example_cn": "这座植物园内有一座宏伟的维多利亚式温室，里面种满了异国兰花。"
    },
    {
      "pos": "noun",
      "explanation_en": "An educational institution dedicated to training students in music, dance, or drama, often offering professional-level instruction and performance opportunities.",
      "explanation_cn": "一种专门致力于音乐、舞蹈或戏剧训练的教育机构，通常提供专业水平的教学和表演机会。",
      "example_en": "She graduated from the Juilliard School, one of the most prestigious conservatories in the world.",
      "example_cn": "她毕业于茱莉亚学院，这是世界上最有声望的音乐学院之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or group with conservative political or social views, especially in British English, used informally to refer to members of the Conservative Party.",
      "explanation_cn": "（英式英语中非正式用法）指持有保守政治或社会观点的人或群体，常用于指代保守党成员。",
      "example_en": "The debate turned heated when the liberal candidate challenged the conservatory's stance on taxation.",
      "example_cn": "当自由派候选人挑战保守派的税收立场时，辩论变得激烈起来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "greenhouse",
      "analysis": "“Greenhouse”（温室）与 “conservatory” 在植物栽培功能上高度重叠，但 “greenhouse” 更强调实用性和功能性，常用于农业或商业种植；而 “conservatory” 通常更具装饰性、建筑美学价值，常与住宅或公共建筑结合，用于观赏和休闲。"
    },
    {
      "word_to_compare": "academy",
      "analysis": "“Academy”（学院）是一个更广泛的术语，泛指各类高等教育或专业培训机构，涵盖科学、艺术、军事等领域；而 “conservatory” 专指音乐、舞蹈或戏剧等表演艺术领域的专业学院，教学内容和实践导向更集中。"
    },
    {
      "word_to_compare": "traditionalist",
      "analysis": "“Traditionalist”（传统主义者）是描述保守思想的抽象名词，强调对传统价值观的坚守；而 “conservatory” 作为政治含义的用法是英式英语中的非正式转喻，特指保守党支持者，带有语境依赖性，不如 “traditionalist” 普遍或中性。"
    }
  ]
}