{
  "word": "console",
  "pronunciation": "kun·sohl",
  "concise_definition": "n. 控制台, 控制面板; v. 安慰, 慰藉",
  "forms": {
    "third_person_singular": "consoles",
    "past_tense": "consoled",
    "past_participle": "consoled",
    "present_participle": "consoled",
    "plural": "consoles"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A panel or unit containing controls, displays, or interfaces for operating a machine, system, or device, especially in technical, industrial, or computing contexts.",
      "explanation_cn": "指用于操作机器、系统或设备的控制面板或单元，通常包含按钮、开关、屏幕等界面，常见于技术、工业或计算机环境中。",
      "example_en": "The technician adjusted the settings on the server console.",
      "example_cn": "技术人员在服务器控制台上调整了设置。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of electronic device designed primarily for playing video games, typically connected to a television or monitor.",
      "explanation_cn": "指专为玩电子游戏而设计的电子设备，通常连接到电视或显示器上，如 PlayStation 或 Xbox。",
      "example_en": "He spent the evening playing his favorite game on the new gaming console.",
      "example_cn": "他晚上在新游戏主机上玩自己最喜欢的游戏。"
    },
    {
      "pos": "verb",
      "explanation_en": "To comfort or provide emotional support to someone who is sad, disappointed, or grieving.",
      "explanation_cn": "指安慰处于悲伤、失望或悲痛中的人，给予情感上的支持。",
      "example_en": "Her friends gathered around to console her after the loss of her pet.",
      "example_cn": "在失去宠物后，她的朋友们围在她身边安慰她。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "terminal",
      "analysis": "“Terminal”（终端）通常指计算机系统中用于输入/输出命令的接口，强调其作为通信端点的功能，常用于服务器或命令行环境。而 “console” 更强调控制和操作的物理或逻辑面板，可能包含图形界面，用途更广泛，包括游戏和工业控制。"
    },
    {
      "word_to_compare": "panel",
      "analysis": "“Panel”（面板）是一个更通用的词，泛指任何扁平的、带有控制元件的表面，如控制面板、太阳能板等。而 “console” 是一种特定类型的面板，通常集成有显示屏、输入设备和完整控制系统，功能更复杂、更专业。"
    },
    {
      "word_to_compare": "comfort",
      "analysis": "“Comfort”（安慰）是更广泛、更通用的动词，指提供身体或心理上的舒适感，可以是物质上的（如提供毯子）或情感上的。而 “console” 专指在情绪低落或悲伤时给予精神上的抚慰，语义更聚焦于情感支持，常带有同情和关怀的语境。"
    }
  ]
}