{
  "word": "consort",
  "pronunciation": "kun·sawrt",
  "concise_definition": "n. 配偶, 伴侣; v. 与...为伴, 联合",
  "forms": {
    "third_person_singular": "consorts",
    "past_tense": "consorted",
    "past_participle": "consorted",
    "present_participle": "consorting",
    "plural": "consorts"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A husband or wife, especially the spouse of a reigning monarch; often used in formal or royal contexts to denote a partner of high status.",
      "explanation_cn": "指配偶，尤指在位君主的配偶；常用于正式或王室语境中，表示具有较高地位的伴侣。",
      "example_en": "The queen's consort, Prince Philip, supported her throughout her reign.",
      "example_cn": "女王的配偶菲利普亲王在她整个统治期间一直支持着她。"
    },
    {
      "pos": "noun",
      "explanation_en": "A companion or associate, especially one who is closely connected with another in a particular activity or context, sometimes with a negative or informal connotation.",
      "explanation_cn": "指同伴或伙伴，尤指在特定活动或情境中与某人密切关联者，有时带有贬义或非正式色彩。",
      "example_en": "He was seen in the company of known criminals and their consorts.",
      "example_cn": "他被看到与一些罪犯及其同伙在一起。"
    },
    {
      "pos": "verb",
      "explanation_en": "To associate or keep company with someone, often implying a close or intimate connection, sometimes with social or moral implications.",
      "explanation_cn": "指与某人交往或为伴，通常暗示亲密关系，有时带有社会或道德层面的含义。",
      "example_en": "She was criticized for consorting with people of dubious reputation.",
      "example_cn": "她因与声誉不佳的人交往而受到批评。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "spouse",
      "analysis": "“Spouse”（配偶）是中性、通用的法律术语，指任何婚姻关系中的伴侣，无地位或语境限制。而 “consort” 更具正式性，常特指君主配偶，且在非王室语境中使用较少，有时隐含社会地位差异。"
    },
    {
      "word_to_compare": "companion",
      "analysis": "“Companion”（同伴）泛指任何一起活动或陪伴的人，语义中性，可适用于朋友、同事或旅伴。而 “consort” 作为名词时，常带有某种依附性、非对等性或负面色彩，尤其在指涉罪犯或社会边缘人物时。"
    },
    {
      "word_to_compare": "associate",
      "analysis": "“Associate”（合作者/关联者）强调职业或事务上的联系，通常为中性或正式用语，如商业伙伴。而 “consort” 作为动词时，更强调情感或私密层面的交往，且常隐含不被社会认可的关联，语义色彩更强烈。"
    }
  ]
}