{
  "word": "construct",
  "pronunciation": "kun·strukt",
  "concise_definition": "v. 建造, 构建, 创造; n. 构造, 概念",
  "forms": {
    "third_person_singular": "constructs",
    "past_tense": "constructed",
    "past_participle": "constructed",
    "present_participle": "constructing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To build or assemble something physically, especially a structure such as a building, bridge, or machine, using materials and planned methods.",
      "explanation_cn": "指使用材料和计划方法物理性地建造或组装某物，尤指建筑物、桥梁或机器等结构。",
      "example_en": "The engineers constructed a new bridge across the river to improve transportation.",
      "example_cn": "工程师们建造了一座横跨河流的新桥，以改善交通。"
    },
    {
      "pos": "verb",
      "explanation_en": "To create or form something abstract, such as an idea, theory, or system, through reasoning or mental effort.",
      "explanation_cn": "指通过推理或脑力劳动创造或形成某种抽象事物，如概念、理论或体系。",
      "example_en": "She constructed a compelling argument to support her hypothesis.",
      "example_cn": "她构建了一个令人信服的论点来支持她的假设。"
    },
    {
      "pos": "noun",
      "explanation_en": "An abstract idea or concept that is created by the mind, often used in social sciences, linguistics, or philosophy to describe a mental framework or theoretical model.",
      "explanation_cn": "指由心智构建的抽象概念或观念，常用于社会科学、语言学或哲学中，描述一种心理框架或理论模型。",
      "example_en": "Gender is a social construct, shaped by cultural norms rather than biological factors.",
      "example_cn": "性别是一种社会建构，由文化规范塑造，而非生物因素决定。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "build",
      "analysis": "“Build” (建造) 是更通用、更口语化的词，常用于物理建造，也可用于抽象概念，但语气较随意。而 “construct” 更正式，强调有计划、有结构的建造过程，常用于技术、学术或工程语境中。"
    },
    {
      "word_to_compare": "create",
      "analysis": "“Create” (创造) 强调从无到有的原创性，适用于艺术、思想、生命等广泛领域，不强调结构或方法。而 “construct” 更注重通过已有元素、逻辑或材料进行系统性组装或组织，更偏向理性与结构。"
    },
    {
      "word_to_compare": "assemble",
      "analysis": "“Assemble” (组装) 指将已有的部件组合成一个整体，通常不涉及从零设计或创造新结构。而 “construct” 包含设计、规划和建造全过程，可能涉及定制部件，强调整体性与系统性。"
    }
  ]
}