{
  "word": "consultations",
  "pronunciation": "kahn·sul·tay·shuhnz",
  "concise_definition": "n. 咨询, 会诊, 商议",
  "forms": {
    "singular": "consultation"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A formal meeting or exchange of advice between professionals, especially between a doctor and patient, or between experts and clients, to discuss a problem or make a decision.",
      "explanation_cn": "指专业人士（如医生与患者、顾问与客户）之间为讨论问题或做出决策而进行的正式会面或意见交流。",
      "example_en": "The patient had three consultations with the specialist before receiving a diagnosis.",
      "example_cn": "患者在获得诊断前与专家进行了三次会诊。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process of seeking expert advice or input from others, often in a professional, legal, or administrative context.",
      "explanation_cn": "指在专业、法律或行政背景下，主动寻求他人专业意见或建议的过程。",
      "example_en": "The government conducted public consultations before passing the new environmental law.",
      "example_cn": "政府在通过新的环保法之前开展了公众咨询。"
    },
    {
      "pos": "noun",
      "explanation_en": "A session in which a professional (e.g., therapist, lawyer, or financial advisor) provides guidance or recommendations based on their expertise.",
      "explanation_cn": "指专业人士（如治疗师、律师或财务顾问）基于其专业知识提供指导或建议的会谈时段。",
      "example_en": "She scheduled a consultation with a financial planner to review her retirement options.",
      "example_cn": "她预约了一次与财务规划师的咨询，以审查她的退休选择。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "meeting",
      "analysis": "“Meeting”（会议）是一个更宽泛的词，泛指任何人员聚集讨论事务的场合，不一定是专业性的或以获取建议为目的。而 “consultation” 强调以获取专业意见为核心目的，通常具有单向指导性（专家→客户），而非平等讨论。"
    },
    {
      "word_to_compare": "advice",
      "analysis": "“Advice”（建议）是名词，指具体的建议内容，是咨询的产出；而 “consultation” 是指获取建议的整个过程或事件。例如，你可以提供 advice，但必须通过 consultation 才能获得它。"
    },
    {
      "word_to_compare": "discussion",
      "analysis": "“Discussion”（讨论）强调双向或多向的交流，参与者共同探讨观点，没有明确的权威角色。而 “consultation” 通常隐含一方是专家、另一方是寻求帮助者，具有明确的指导关系，更正式、目的性更强。"
    }
  ]
}