{
  "word": "constructed",
  "pronunciation": "kun·struhk·tid",
  "concise_definition": "adj. 建造的, 人为的, 非自然的",
  "forms": {
    "base_form": "construct",
    "present_participle": "constructing",
    "past_tense": "constructed",
    "past_participle": "constructed",
    "plural": "constructed (unchanged as adjective)"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Made or formed by human effort rather than occurring naturally; deliberately built or assembled according to a plan.",
      "explanation_cn": "指由人类努力建造或形成，而非自然发生的；根据某种计划有意识地构建或组装而成的。",
      "example_en": "The bridge is a remarkable example of engineered construction, entirely constructed from steel and concrete.",
      "example_cn": "这座桥是工程建造的杰出范例，完全由钢铁和混凝土建造而成。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Not natural or spontaneous; created artificially, often to serve a specific purpose or convey a particular impression.",
      "explanation_cn": "指非自然或非自发的；人为创造的，通常为了实现特定目的或传达某种特定印象。",
      "example_en": "Her confident demeanor was a constructed persona designed to mask her insecurities.",
      "example_cn": "她自信的举止是一种人为塑造的形象，旨在掩盖她的不安全感。"
    },
    {
      "pos": "adjective",
      "explanation_en": "In linguistics or social theory, referring to ideas, categories, or identities that are shaped by cultural, historical, or social forces rather than being innate or objective.",
      "explanation_cn": "在语言学或社会理论中，指由文化、历史或社会力量塑造而成的概念、类别或身份，而非与生俱来或客观存在的。",
      "example_en": "Gender roles are often seen as socially constructed rather than biologically determined.",
      "example_cn": "性别角色常被视为社会建构的产物，而非生物决定的。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "built",
      "analysis": "“Built” (建造的) 更侧重于物理结构的建造过程，常用于房屋、桥梁等实体对象，语义更具体、更偏向工程实践。而 “constructed” 更广泛，可指抽象概念（如理论、身份）的系统性构建，语义更正式、更具分析性。"
    },
    {
      "word_to_compare": "artificial",
      "analysis": "“Artificial” (人造的) 强调与自然状态的对立，常带有贬义，暗示虚假或不真实（如 artificial flavor）。而 “constructed” 更中性，强调有意识的设计和结构，不一定暗示欺骗性，常用于学术语境中描述社会或语言现象。"
    },
    {
      "word_to_compare": "made",
      "analysis": "“Made” (制造的) 是最通用的词，可用于任何由人制作的事物，但缺乏 “constructed” 所蕴含的系统性、计划性和复杂性。例如 “a made-up story” 仅表示编造，而 “a constructed narrative” 暗示精心设计的逻辑结构。"
    }
  ]
}