{
  "word": "conservative",
  "pronunciation": "kun·suhr·vuh·tiv",
  "concise_definition": "adj. 保守的, 守旧的; n. 保守主义者",
  "forms": {
    "comparative": "more conservative",
    "superlative": "most conservative",
    "noun_form": "conservatism"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Resistant to change or innovation; preferring traditional values, practices, or structures, especially in politics, religion, or social norms.",
      "explanation_cn": "抵制变革或创新；倾向于坚持传统价值观、做法或结构，尤其在政治、宗教或社会规范方面。",
      "example_en": "The conservative party opposes sweeping tax reforms that could disrupt the economy.",
      "example_cn": "保守党反对可能扰乱经济的全面税制改革。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Cautious or restrained in behavior, spending, or expression; avoiding risk or excess.",
      "explanation_cn": "在行为、支出或表达上谨慎克制；避免冒险或过度。",
      "example_en": "She took a conservative approach to investing, preferring low-risk bonds over stocks.",
      "example_cn": "她在投资上采取了保守策略，更倾向于低风险债券而非股票。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who holds conservative political or social views, typically supporting tradition, limited government, and established institutions.",
      "explanation_cn": "持有保守政治或社会观点的人，通常支持传统、有限政府和既定制度。",
      "example_en": "As a conservative, he believes in personal responsibility and strong national defense.",
      "example_cn": "作为一名保守主义者，他相信个人责任和强大的国防。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "traditional",
      "analysis": "“Traditional”（传统的）强调遵循历史或文化中长期存在的做法，侧重于时间延续性，但不一定带有抵制变革的立场。而 “conservative” 不仅指遵循传统，还隐含主动反对变革、维护现状的意识形态倾向。"
    },
    {
      "word_to_compare": "cautious",
      "analysis": "“Cautious”（谨慎的）泛指在行动中小心避免风险，适用于任何情境（如驾驶、决策），是中性描述。而 “conservative” 在经济或政治语境中特指基于价值观的保守立场，其谨慎源于对变革的不信任，而非单纯的风险规避。"
    },
    {
      "word_to_compare": "reactionary",
      "analysis": "“Reactionary”（极端保守的/反动的）比 “conservative” 更强烈，指不仅反对变革，还试图恢复过去已被废除的制度或价值观，常带贬义。而 “conservative” 是主流政治光谱中的正常一极，不必然具有颠覆性或极端性。"
    }
  ]
}