{
  "word": "constable",
  "pronunciation": "kahn·stuh·buhl",
  "concise_definition": "n. 警察, 低级警官, 乡警",
  "forms": {
    "plural": "constables"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A low-ranking police officer, especially in the United Kingdom and some Commonwealth countries, responsible for patrolling, maintaining public order, and enforcing minor laws.",
      "explanation_cn": "指英国及部分英联邦国家中级别较低的警察，负责巡逻、维持公共秩序和执行轻微法律。",
      "example_en": "The constable stopped the speeding car and issued a warning.",
      "example_cn": "这名警察拦下了超速行驶的汽车，并给予了警告。"
    },
    {
      "pos": "noun",
      "explanation_en": "A historical or ceremonial official in some English towns or parishes, often with duties related to law enforcement, tax collection, or organizing local events.",
      "explanation_cn": "指在某些英国城镇或教区中具有历史或礼仪性质的官员，职责可能包括执法、征税或组织地方活动。",
      "example_en": "In medieval times, the constable was responsible for maintaining the king's peace in the village.",
      "example_cn": "在中世纪，乡警负责维护村庄内的王室治安。"
    },
    {
      "pos": "noun",
      "explanation_en": "A title used in some military or security contexts, such as a constable of a castle or a royal constable with ceremonial authority.",
      "explanation_cn": "在某些军事或安保语境中使用的头衔，如城堡守卫或拥有礼仪性权威的皇家警官。",
      "example_en": "The royal constable led the procession during the coronation ceremony.",
      "example_cn": "皇家警官在加冕典礼上引领了游行队伍。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "police officer",
      "analysis": "“Police officer”（警察）是一个泛指所有执法警察的通用术语，涵盖从巡警到高级警官的所有级别。而 “constable” 是一个具体职位，通常指最低级别的警员，尤其在英式英语中具有特定法律地位和传统含义。"
    },
    {
      "word_to_compare": "sheriff",
      "analysis": "“Sheriff”（治安官）主要在美国使用，是县一级的民选执法官员，权力范围更广，包括管理监狱、执行法院命令等。而 “constable” 通常是被任命的基层警员，权力较小，且在英国多为礼仪性或地方性职务。"
    },
    {
      "word_to_compare": "officer",
      "analysis": "“Officer”（官员/军官）是一个更宽泛的词，可指军队、警察、政府等任何有权威职位的人。而 “constable” 是一个具体职业头衔，特指某些司法体系中的低级执法者，其含义远比 “officer” 狭窄且更具文化背景。"
    }
  ]
}