{
  "word": "constitution",
  "pronunciation": "kons·tuh·toon·shuhn",
  "concise_definition": "n. 宪法, 体质, 构成",
  "forms": {
    "plural": "constitutions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A fundamental set of principles and established precedents that govern a country, organization, or group, outlining the structure of government, rights of citizens, and limits of power.",
      "explanation_cn": "指一个国家、组织或团体的根本性原则和既定先例，规定了政府的结构、公民的权利以及权力的界限。",
      "example_en": "The United States Constitution is the supreme law of the land and has guided American governance for over two centuries.",
      "example_cn": "美国宪法是国家的最高法律，两个多世纪以来一直指导着美国的治理。"
    },
    {
      "pos": "noun",
      "explanation_en": "The physical or mental makeup of a person, especially in terms of health, strength, or resilience.",
      "explanation_cn": "指一个人的体质或身心构成，尤其指健康状况、体力或抗压能力。",
      "example_en": "She has a strong constitution and rarely gets sick, even during flu season.",
      "example_cn": "她体质很好，即使在流感季节也很少生病。"
    },
    {
      "pos": "noun",
      "explanation_en": "The composition or arrangement of parts that make up a whole, especially in a chemical, biological, or structural context.",
      "explanation_cn": "指构成整体的各个部分的组成或排列方式，尤其用于化学、生物或结构语境中。",
      "example_en": "The constitution of the alloy determines its resistance to corrosion and heat.",
      "example_cn": "这种合金的成分决定了它对腐蚀和高温的抵抗力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "charter",
      "analysis": "“Charter”（宪章）通常指由权威机构授予的正式文件，规定特定团体、城市或组织的权利与特权，如城市宪章或公司特许状。它更侧重于授权和许可，而 “constitution” 更强调根本性、系统性的治理框架，具有更高的法律权威和稳定性。"
    },
    {
      "word_to_compare": "bylaw",
      "analysis": "“Bylaw”（规章、内部条例）是组织或地方政府为执行更高层级法律（如宪法）而制定的细则性规则，仅适用于特定范围。它属于次级规范，而 “constitution” 是最高法律依据，所有其他规则都必须与其一致。"
    },
    {
      "word_to_compare": "nature",
      "analysis": "“Nature”（本性）指事物固有的、本质的属性或倾向，常用于哲学或生物学语境，强调内在本质而非人为构建的体系。而 “constitution” 在指体质时虽也涉及内在特性，但更偏向可观察、可描述的生理结构；在指宪法时，则完全是人为设计的制度性文本。"
    }
  ]
}