{
  "word": "contour",
  "pronunciation": "kon·toor",
  "concise_definition": "n. 轮廓, 外形; v. 描绘轮廓",
  "forms": {
    "plural": "contours",
    "third_person_singular": "contours",
    "past_tense": "contoured",
    "past_participle": "contoured",
    "present_participle": "contouring"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The line that defines the outer edge or shape of an object, especially when viewed from a particular angle; a boundary that distinguishes one form from its surroundings.",
      "explanation_cn": "指物体外部边缘或形状的线条，尤其在特定角度下观察时，用以区分该形体与其周围环境的边界。",
      "example_en": "The artist carefully rendered the contour of the mountain against the sunset.",
      "example_cn": "艺术家仔细描绘了山峦在夕阳下的轮廓。"
    },
    {
      "pos": "noun",
      "explanation_en": "A line on a map or chart that connects points of equal elevation, used to represent the shape and slope of terrain.",
      "explanation_cn": "在地图或图表上连接海拔高度相等点的线条，用于表示地形的形状和坡度。",
      "example_en": "Hikers rely on contour lines to navigate steep trails and identify ridges or valleys.",
      "example_cn": "徒步者依靠等高线在陡峭小径上导航，并识别山脊或山谷。"
    },
    {
      "pos": "verb",
      "explanation_en": "To draw or outline the shape of something, especially to emphasize its form or structure.",
      "explanation_cn": "指描绘或勾勒某物的形状，尤其为了突出其形态或结构。",
      "example_en": "The designer contoured the car's body to reduce air resistance.",
      "example_cn": "设计师勾勒出汽车车身的轮廓以减少空气阻力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "outline",
      "analysis": "“Outline” (轮廓/概要) 通常指简单、粗略的外部边界线，强调的是整体形状的简化表达，常用于草图或文字摘要。而 “contour” 更精确，常包含细节变化，尤其在地形图或艺术描绘中体现曲面的微妙起伏，更具技术性和视觉丰富性。"
    },
    {
      "word_to_compare": "shape",
      "analysis": "“Shape” (形状) 是一个更宽泛的术语，泛指物体的外形或结构，可以是抽象的（如“幸福的形状”）。而 “contour” 特指由线条定义的外部边界，强调的是边缘的精确走向和曲率，更具物理性和可测量性。"
    },
    {
      "word_to_compare": "profile",
      "analysis": "“Profile” (侧面轮廓) 专指从侧面观察物体时所呈现的轮廓，常用于人像、建筑或地形的侧视图。而 “contour” 可以是任意角度的边界线，不限于侧面，且在地图学中特指等高线，应用范围更广。"
    }
  ]
}