{
  "word": "contained",
  "pronunciation": "kən·teyn·id",
  "concise_definition": "adj. 克制的, 冷静的, 受控的; v. 包含, 控制, 限制 (contain 的过去式和过去分词)",
  "forms": {
    "base_form": "contain",
    "third_person_singular": "contains",
    "present_participle": "containing",
    "past_tense": "contained",
    "past_participle": "contained"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Showing self-control and composure, especially in a situation that might provoke strong emotion or reaction; not expressing feelings openly or excessively.",
      "explanation_cn": "在可能引发强烈情绪或反应的情境中仍表现出自制与镇定，不轻易外露情感或过度反应。",
      "example_en": "She remained contained despite the shocking news, speaking calmly to the reporters.",
      "example_cn": "尽管听到这个令人震惊的消息，她仍保持冷静，平静地对记者说话。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Kept within limits or boundaries; not spreading or escaping; controlled or confined.",
      "explanation_cn": "被限制在一定范围或边界内；未扩散或逸出；受到控制或约束的。",
      "example_en": "The fire was contained within the building thanks to the quick response of firefighters.",
      "example_cn": "由于消防员迅速响应，火势被控制在建筑物内。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hold or include something within a boundary, space, or limit; to enclose or encompass.",
      "explanation_cn": "将某物容纳、包含在某个边界、空间或限制之内；围住或涵盖。",
      "example_en": "The book contains detailed instructions for assembling the furniture.",
      "example_cn": "这本书包含了组装家具的详细说明。"
    },
    {
      "pos": "verb",
      "explanation_en": "To prevent something from spreading, growing, or becoming worse; to control or restrain.",
      "explanation_cn": "阻止某事物扩散、增长或恶化；控制或抑制。",
      "example_en": "Health officials worked to contain the outbreak before it became a pandemic.",
      "example_cn": "卫生官员努力控制疫情，防止其演变为大流行。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "restrained",
      "analysis": "“Restrained”（克制的）与 “contained” 在描述情绪控制时非常接近，但 “restrained” 更强调主动压抑或抑制，常带有某种刻意或勉强的意味；而 “contained” 更侧重于内在的稳定与冷静，不一定是压抑，而是自然保持平衡。"
    },
    {
      "word_to_compare": "confined",
      "analysis": "“Confined”（被限制的）强调物理或空间上的局限，如被关在房间里；而 “contained” 可用于抽象或非物理情境，如情绪、火势、信息的控制，适用范围更广。"
    },
    {
      "word_to_compare": "included",
      "analysis": "“Included”（被包括的）仅表示某物是整体的一部分，不涉及控制或限制的含义；而 “contained” 不仅表示包含，还隐含了边界、范围和控制的意味，如‘a box contained ten apples’ 暗示了这些苹果被限制在盒子里，而非简单地列在清单上。"
    }
  ]
}