{
  "word": "controlling",
  "pronunciation": "kun·troh·ling",
  "concise_definition": "adj. 控制的, 支配的, 操纵的; n. 控制权, 控制手段",
  "forms": {
    "base_form": "control",
    "comparative": "more controlling",
    "superlative": "most controlling"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing a person or behavior that seeks to dominate, manage, or dictate the actions, decisions, or emotions of others, often in an excessive or oppressive way.",
      "explanation_cn": "形容一个人或行为试图支配、管理或强加他人行动、决定或情绪，通常带有过度或压迫性的特征。",
      "example_en": "Her controlling attitude made it difficult for her partner to make any independent decisions.",
      "example_cn": "她控制欲强的态度让伴侣难以做出任何独立的决定。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to a system, mechanism, or process that regulates or manages the operation of something else, often to maintain stability or desired outcomes.",
      "explanation_cn": "指用于调节或管理其他事物运行的系统、机制或过程，通常旨在维持稳定或实现预期结果。",
      "example_en": "The aircraft is equipped with advanced controlling systems that adjust flight dynamics in real time.",
      "example_cn": "这架飞机配备了先进的控制系统，可实时调整飞行动态。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device, mechanism, or set of rules used to regulate or manage a process, system, or behavior.",
      "explanation_cn": "用于调节、管理某一过程、系统或行为的装置、机制或规则集合。",
      "example_en": "The thermostat is a simple controlling that maintains the room temperature at a set level.",
      "example_cn": "恒温器是一种简单的控制装置，用于将室温维持在设定水平。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "dominant",
      "analysis": "“Dominant”（占主导地位的）强调在群体、竞争或影响中处于优势地位，但不一定包含主动干预或操纵他人的行为。而 “controlling” 更侧重于对他人自由或选择的主动限制和干预，常带有负面情感色彩。"
    },
    {
      "word_to_compare": "authoritative",
      "analysis": "“Authoritative”（权威的）指基于专业知识、地位或经验而自然获得的影响力，通常被尊重且不具压迫性。而 “controlling” 则常暗示滥用权力、缺乏信任，带有强制性和不健康的人际动态。"
    },
    {
      "word_to_compare": "regulating",
      "analysis": "“Regulating”（调节的）是中性术语，用于描述为维持秩序、安全或效率而进行的系统性管理，如政府法规或技术控制。而 “controlling” 在描述人时往往带有主观操控的意味，情感色彩更强烈，常含贬义。"
    }
  ]
}