{
  "word": "contracting",
  "pronunciation": "kun·trak·ting",
  "concise_definition": "v. 收缩, 签订合同, 感染 (疾病), 承包",
  "forms": {
    "base_form": "contract",
    "third_person_singular": "contracts",
    "past_tense": "contracted",
    "past_participle": "contracted",
    "present_participle": "contracting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To become smaller in size, volume, or extent, often due to physical or mechanical force, or as a natural physiological process.",
      "explanation_cn": "指因物理力、机械作用或生理过程而使尺寸、体积或范围缩小。",
      "example_en": "The muscles in her abdomen were contracting during labor.",
      "example_cn": "她在分娩时腹部肌肉正在收缩。"
    },
    {
      "pos": "verb",
      "explanation_en": "To enter into a formal agreement or arrangement, especially for services, goods, or construction work, typically with a third party.",
      "explanation_cn": "指与第三方正式签订协议，通常涉及服务、货物或建筑工程的承包。",
      "example_en": "The city is contracting a private firm to manage waste collection.",
      "example_cn": "该市正在与一家私营公司签订合同，负责垃圾收集工作。"
    },
    {
      "pos": "verb",
      "explanation_en": "To acquire or catch a disease, especially through exposure to an infectious agent.",
      "explanation_cn": "指通过接触传染源而感染某种疾病。",
      "example_en": "He contracted measles as a child and was ill for several weeks.",
      "example_cn": "他小时候感染了麻疹，病了几个星期。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reduce the scope, scale, or number of something, often in a deliberate effort to cut costs or streamline operations.",
      "explanation_cn": "指有意识地缩减某事物的范围、规模或数量，通常是为了降低成本或优化运营。",
      "example_en": "The company is contracting its operations to focus on core markets.",
      "example_cn": "该公司正在缩减业务，以专注于核心市场。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "shrinking",
      "analysis": "“Shrinking” (缩小) 通常指物理尺寸或数量的减少，强调结果而非过程，常用于描述自然或被动的变化，如布料缩水或人口减少。而 “contracting” 更强调主动或机制性的收缩，尤其在生理（如肌肉）或商业（如业务缩减）语境中更正式、更具体。"
    },
    {
      "word_to_compare": "hiring",
      "analysis": "“Hiring” (雇佣) 是指雇用人员，与 “contracting” 在商业语境中常形成对比。当企业 “contract” 服务时，通常是外包给外部承包商，而非直接雇佣员工；“hiring” 意味着建立正式雇佣关系，而 “contracting” 通常是临时性、项目制的商业合作。"
    },
    {
      "word_to_compare": "infecting",
      "analysis": "“Infecting” (感染) 是医学上描述病原体侵入并引发疾病的直接动词，语义更狭窄、更生物性。而 “contracting” 在此语境中是更常用、更口语化的表达，涵盖从接触病原体到发病的全过程，常用于日常对话和医疗报告中，语气更中性。"
    }
  ]
}