{
  "word": "contradicted",
  "pronunciation": "kon·truh·dik·tɪd",
  "concise_definition": "v. 否认, 反驳, 与...相矛盾",
  "forms": {
    "base_form": "contradict",
    "third_person_singular": "contradicts",
    "past_tense": "contradicted",
    "past_participle": "contradicted",
    "present_participle": "contradicting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To assert the opposite of a statement or claim, thereby denying its truth or validity; to directly oppose or conflict with something previously stated or believed.",
      "explanation_cn": "断言某陈述或主张的相反内容，从而否认其真实性或有效性；直接与先前所说或相信的事物相抵触。",
      "example_en": "She contradicted his account of the event by presenting eyewitness testimony.",
      "example_cn": "她通过提供目击者的证词，反驳了他对事件的描述。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be inconsistent or incompatible with something else, especially facts, data, or prior statements, creating logical conflict.",
      "explanation_cn": "与他物不一致或不相容，尤其指与事实、数据或先前的陈述相冲突，从而造成逻辑矛盾。",
      "example_en": "His new policy contradicts the principles his party has long supported.",
      "example_cn": "他的新政策与其政党长期支持的原则相矛盾。"
    },
    {
      "pos": "verb",
      "explanation_en": "To challenge or dispute someone’s statement in a direct or confrontational manner, often in debate or argument.",
      "explanation_cn": "在辩论或争论中，以直接或对抗的方式质疑或驳斥他人的说法。",
      "example_en": "The lawyer contradicted the witness during cross-examination, exposing inconsistencies in his story.",
      "example_cn": "律师在交叉质询中驳斥了证人的说法，揭露了其陈述中的矛盾之处。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "deny",
      "analysis": "“Deny” (否认) 通常指拒绝承认某事的真实性，语气更直接、更绝对，常用于个人对指控或事实的否定，不一定涉及逻辑冲突。而 “contradicted” 更强调与另一方陈述或事实之间的对立关系，常用于语境中的相互反驳。"
    },
    {
      "word_to_compare": "refute",
      "analysis": "“Refute” (驳斥) 指用证据或逻辑有力地证明某观点是错误的，带有更强的论证性和说服力，通常成功地推翻了原主张。而 “contradicted” 仅表示提出相反说法，不一定提供证据或成功证明对方错误。"
    },
    {
      "word_to_compare": "inconsistent",
      "analysis": "“Inconsistent” (不一致的) 是形容词，描述状态或性质，指事物之间缺乏逻辑连贯性。而 “contradicted” 是动词的过去式，强调一个主动的、具体的反驳行为或事件。前者是描述特征，后者是描述动作。"
    }
  ]
}