{
  "word": "contact",
  "pronunciation": "kon·takt",
  "concise_definition": "n. 联系, 接触, 人脉; v. 联系, 接触",
  "forms": {
    "third_person_singular": "contacts",
    "past_tense": "contacted",
    "past_participle": "contacted",
    "present_participle": "contacting",
    "plural": "contacts"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A means of communication or connection between people or groups, especially for the purpose of exchanging information or achieving cooperation.",
      "explanation_cn": "指人与人或群体之间用于交流信息或实现合作的沟通渠道或连接方式。",
      "example_en": "She added the new client to her contact list.",
      "example_cn": "她把这位新客户添加到了她的联系人名单中。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who serves as a link or intermediary in a network, especially in business or politics.",
      "explanation_cn": "指在人际网络中作为联络人或中间人的个体，尤其在商业或政治领域中。",
      "example_en": "He's a valuable contact in the government who can help us get the permit.",
      "example_cn": "他在政府里有个重要人脉，能帮我们拿到许可证。"
    },
    {
      "pos": "noun",
      "explanation_en": "The physical meeting or touching of two objects or surfaces.",
      "explanation_cn": "指两个物体或表面之间的物理接触或碰触。",
      "example_en": "The two balls made contact just before the collision.",
      "example_cn": "两个球在碰撞前发生了接触。"
    },
    {
      "pos": "verb",
      "explanation_en": "To communicate with someone, typically by phone, email, or other means, in order to convey information or request assistance.",
      "explanation_cn": "指通过电话、电子邮件或其他方式与某人取得联系，以传递信息或寻求帮助。",
      "example_en": "Please contact me if you have any questions about the schedule.",
      "example_cn": "如果你对日程有任何疑问，请与我联系。"
    },
    {
      "pos": "verb",
      "explanation_en": "To come into physical touch or interaction with something or someone.",
      "explanation_cn": "指与某物或某人发生物理上的接触或互动。",
      "example_en": "The spacecraft made contact with the Martian surface.",
      "example_cn": "航天器与火星表面成功接触。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "connect",
      "analysis": "“Connect” (连接) 更强调建立某种关系、网络或系统性的关联，可以是抽象的（如连接两个城市、两个想法）或技术性的（如连接设备）。它不必然涉及主动沟通，而 “contact” 更侧重于主动发起交流或互动，尤其在人际层面。"
    },
    {
      "word_to_compare": "communicate",
      "analysis": "“Communicate” (交流) 指信息的传递与接收，强调内容的交换，可以是语言、文字、符号等任何形式。而 “contact” 更侧重于建立或维持联系的渠道或行为本身，不一定包含完整的信息传递。例如，你可“contact”某人但不说话，仅发个短信问候。"
    },
    {
      "word_to_compare": "touch",
      "analysis": "“Touch” (触摸) 通常指物理接触，且多用于感官层面，常带有情感或直接性（如 touch someone’s hand）。而 “contact” 在物理意义上更中性、更广泛，可用于科学、技术或正式语境（如电路接触、客户接触），且可作名词和动词，语义范围更广。"
    }
  ]
}