{
  "word": "contacts",
  "pronunciation": "kon·takts",
  "concise_definition": "n. 联系人, 交往, 接触, 眼镜",
  "forms": {
    "singular": "contact"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person with whom one has communication or interaction, especially for professional or social purposes; a person's name, phone number, email, or other information used to reach them.",
      "explanation_cn": "指与某人有沟通或互动的对象，尤指用于职业或社交目的的人；也指用于联系某人的姓名、电话、电子邮件等信息。",
      "example_en": "I added her to my contacts after our meeting at the conference.",
      "example_cn": "我在会议后把她加到了我的联系人列表中。"
    },
    {
      "pos": "noun",
      "explanation_en": "The state of having communication or interaction with someone or something; a means of connection or communication.",
      "explanation_cn": "指与某人或某事物保持沟通或互动的状态；也指建立联系或沟通的途径。",
      "example_en": "The organization maintains contacts with governments around the world.",
      "example_cn": "该组织与世界各国政府保持联系。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of corrective lens worn directly on the eye, replacing or supplementing eyeglasses.",
      "explanation_cn": "指直接佩戴在眼球表面的矫正镜片，用以替代或补充眼镜。",
      "example_en": "She prefers contacts because they don't fog up in cold weather.",
      "example_cn": "她更喜欢戴隐形眼镜，因为它们在寒冷天气中不会起雾。"
    },
    {
      "pos": "noun",
      "explanation_en": "The physical or direct interaction between two surfaces or objects; a point of touch or connection.",
      "explanation_cn": "指两个表面或物体之间的物理接触或直接互动；接触点或连接点。",
      "example_en": "The two wires must make proper contact to complete the circuit.",
      "example_cn": "两根电线必须良好接触才能完成电路。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "acquaintances",
      "analysis": "“Acquaintances”（熟人）指认识但关系不深的人，强调社交层面的浅层关系，通常不涉及频繁互动或信息交换。而 “contacts” 更侧重于功能性联系，常用于职业或实用目的，可能包括陌生人但有联络价值的人。"
    },
    {
      "word_to_compare": "network",
      "analysis": "“Network”（人脉网络）是一个集合概念，指由多个联系人构成的系统性关系网，强调结构和广度。“Contacts” 是构成网络的单个节点，是具体的个体或信息条目。网络是宏观的，联系人是微观的。"
    },
    {
      "word_to_compare": "connection",
      "analysis": "“Connection”（联系）含义更广，可指抽象的关系（如情感联系、网络连接），也可指物理连接。而 “contact” 更强调实际的、可操作的沟通或物理接触，常用于具体的人或设备交互场景。"
    }
  ]
}