{
  "word": "continuity",
  "pronunciation": "kahn·tuh·noot·ee",
  "concise_definition": "n. 连续性, 连贯性, 持续",
  "forms": {
    "plural": "continuities"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The uninterrupted and consistent connection or sequence of events, actions, or states over time, ensuring that one part logically follows another without disruption.",
      "explanation_cn": "指事件、行为或状态在时间上不间断、一致的连接或序列，确保各部分之间逻辑连贯、无中断。",
      "example_en": "The film's continuity was maintained by carefully matching the actors' clothing and props across scenes.",
      "example_cn": "通过仔细匹配演员在不同场景中的服装和道具，影片保持了情节的连贯性。"
    },
    {
      "pos": "noun",
      "explanation_en": "The quality of being logically coherent and consistent, especially in narrative, argument, or design, so that elements fit together without contradiction.",
      "explanation_cn": "指在叙述、论证或设计中保持逻辑一致性和内在协调性，使各组成部分相互契合、无矛盾。",
      "example_en": "The novel's strength lies in its narrative continuity, where every subplot ties back to the central theme.",
      "example_cn": "这部小说的亮点在于其叙事的连贯性，每个支线情节都与主题紧密相连。"
    },
    {
      "pos": "noun",
      "explanation_en": "In mathematics and physics, the property of a function or system that varies without abrupt changes or discontinuities.",
      "explanation_cn": "在数学和物理学中，指函数或系统在变化过程中没有突变或间断的特性。",
      "example_en": "The function is continuous across its entire domain, meaning there are no jumps or breaks in its graph.",
      "example_cn": "该函数在其整个定义域内都是连续的，意味着其图像上没有跳跃或间断。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "consistency",
      "analysis": "“Consistency” (一致性) 强调的是在不同时间或情境下保持相同的标准、行为或特征，侧重于“不变性”和“可预测性”。而 “continuity” 更强调“时间上的不间断流动”，即使内容变化，其连接也必须自然流畅。例如，一个演员的妆容保持一致是 consistency，而整个故事线无断裂则是 continuity。"
    },
    {
      "word_to_compare": "coherence",
      "analysis": "“Coherence” (连贯性) 指思想、语言或结构在逻辑上清晰、有条理，各部分能被理解为一个整体。它更侧重于“理解上的可整合性”。而 “continuity” 更关注物理或时间上的持续连接，即使逻辑上不完全严密，只要没有中断，也可称为 continuity。"
    },
    {
      "word_to_compare": "duration",
      "analysis": "“Duration” (持续时间) 仅指某事物持续的长度或时间跨度，是一个量化的概念。而 “continuity” 关注的是在该时间段内是否保持了连贯、无中断的状态。例如，一场战争持续了五年（duration），但若期间有停火或混乱，则其 continuity 可能被破坏。"
    }
  ]
}