{
  "word": "convention",
  "pronunciation": "kun·ven·shun",
  "concise_definition": "n. 会议, 习俗, 惯例, 规约",
  "forms": {
    "plural": "conventions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A large formal meeting of people with a shared interest, especially members of a political party, professional group, or organization, often held to make decisions or discuss issues.",
      "explanation_cn": "指具有共同兴趣的人们（尤其是政党成员、专业人士或组织成员）举行的正式大型会议，通常用于做出决策或讨论问题。",
      "example_en": "The Democratic National Convention will nominate its presidential candidate next month.",
      "example_cn": "民主党全国代表大会将于下月提名其总统候选人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A widely accepted practice or custom, especially in social, artistic, or linguistic contexts, that is followed by tradition rather than by necessity.",
      "explanation_cn": "指在社会、艺术或语言语境中，因传统而非必要性而被广泛接受的做法或习俗。",
      "example_en": "In Western cultures, it is a convention to shake hands when meeting someone for the first time.",
      "example_cn": "在西方文化中，初次见面时握手是一种惯例。"
    },
    {
      "pos": "noun",
      "explanation_en": "An agreed-upon standard or rule, especially in fields like art, literature, or science, that governs how something is done or interpreted.",
      "explanation_cn": "指在艺术、文学或科学等领域中，为规范某种行为或解释方式而达成的共识性规则或标准。",
      "example_en": "The convention of using perspective in Renaissance painting revolutionized visual art.",
      "example_cn": "文艺复兴时期绘画中使用透视法的惯例彻底改变了视觉艺术。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "meeting",
      "analysis": "“Meeting”（会议）是一个通用词，泛指任何形式的聚集讨论，可以是小型、非正式或临时的。而 “convention” 特指规模大、组织严密、有固定议程和正式目的的大型会议，通常具有周期性或制度性。"
    },
    {
      "word_to_compare": "custom",
      "analysis": "“Custom”（习俗）强调一个群体长期沿袭的行为方式，通常根植于文化或地域传统，具有较强的自发性和历史延续性。而 “convention” 更强调一种被广泛接受的规范或协议，可能由人为约定形成，不一定有深厚历史背景，且更常用于抽象或专业领域。"
    },
    {
      "word_to_compare": "norm",
      "analysis": "“Norm”（规范）侧重于社会或群体中被默认接受的行为标准，常带有道德或心理约束力，违反它可能引发社会压力。而 “convention” 更中性，强调的是约定俗成的做法，不一定涉及道德判断，更多用于描述技术性、艺术性或程序性共识。"
    }
  ]
}