{
  "word": "converts",
  "pronunciation": "kənˈvɜːrts",
  "concise_definition": "v. 转换, 改变, 使转变; n. 改宗者, 转变者",
  "forms": {
    "base_form": "convert",
    "third_person_singular": "converts",
    "past_tense": "converted",
    "past_participle": "converted",
    "present_participle": "converting",
    "noun_form": "convert"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To change something from one form, state, system, or use to another, often through a deliberate process or transformation.",
      "explanation_cn": "指通过有意识的过程将某物从一种形式、状态、系统或用途转变为另一种。",
      "example_en": "The old factory was converted into a modern art museum.",
      "example_cn": "这座旧工厂被改造成了一座现代艺术博物馆。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause someone to change their beliefs, religion, or opinions, especially to adopt a new faith or system.",
      "explanation_cn": "指使某人改变其信仰、宗教或观点，尤其是转而接受新的信仰或体系。",
      "example_en": "The missionary worked hard to convert the local population to Christianity.",
      "example_cn": "传教士努力使当地居民皈依基督教。"
    },
    {
      "pos": "verb",
      "explanation_en": "To change units of measurement or data from one system to another, such as currency, temperature, or digital formats.",
      "explanation_cn": "指将度量单位或数据从一种系统转换为另一种，如货币、温度或数字格式。",
      "example_en": "You can convert dollars to euros using this online calculator.",
      "example_cn": "你可以使用这个在线计算器将美元兑换为欧元。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who has changed their religious, political, or ideological beliefs, especially one who has adopted a new faith or system.",
      "explanation_cn": "指改变了自己的宗教、政治或意识形态信仰的人，尤其是那些皈依新信仰或体系的人。",
      "example_en": "He is a convert to Buddhism after years of studying Eastern philosophy.",
      "example_cn": "他在多年研究东方哲学后皈依了佛教。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "transform",
      "analysis": "“Transform” (彻底改变) 强调发生根本性、结构性或本质上的变化，通常涉及外观、功能或性质的全面重塑，语气更强烈。而 “convert” 更侧重于形式、用途或信仰的转变，不一定涉及内在本质的改变。例如，冰转化为水是 transform；而将车库改为卧室是 convert。"
    },
    {
      "word_to_compare": "change",
      "analysis": "“Change” (改变) 是最通用的词，泛指任何类型的变动，可以是轻微或表面的，如换衣服、换位置。而 “convert” 更具体，通常指有目的、有方向的转变，尤其涉及系统、信仰或单位的转换，语义更专业和明确。"
    },
    {
      "word_to_compare": "switch",
      "analysis": "“Switch” (切换) 强调在两个或多个选项之间快速、直接地更换，常用于偏好、设备或选择，如 switch channels 或 switch jobs。它不涉及深层的转化或信仰的改变，而 “convert” 更强调内在立场或系统的根本性转变。"
    }
  ]
}