{
  "word": "conventions",
  "pronunciation": "kahn·ven·shuhnz",
  "concise_definition": "n. 惯例, 习俗, 规范, 会议",
  "forms": {
    "singular": "convention"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A generally accepted practice, rule, or method that is followed by a group, especially in areas such as language, art, or social behavior, often for the sake of consistency or clarity.",
      "explanation_cn": "指一个群体（尤其是在语言、艺术或社会行为领域）为保持一致性或清晰性而普遍遵循的惯例、规则或方法。",
      "example_en": "In English, it's a convention to capitalize the first letter of proper nouns.",
      "example_cn": "在英语中，专有名词的首字母大写是一种惯例。"
    },
    {
      "pos": "noun",
      "explanation_en": "A formal meeting or assembly of people with a shared interest, especially for discussion, decision-making, or networking (e.g., political, professional, or fan conventions).",
      "explanation_cn": "指具有共同兴趣的人们为讨论、决策或建立联系而举行的正式集会，如政治会议、专业年会或粉丝大会。",
      "example_en": "Thousands of comic book fans gathered at the annual comic convention.",
      "example_cn": "成千上万的漫画迷聚集在年度漫画大会中。"
    },
    {
      "pos": "noun",
      "explanation_en": "An agreed-upon standard or protocol, especially in international relations, law, or technology, that governs behavior or interaction between parties.",
      "explanation_cn": "指在国际关系、法律或技术领域中，各方为规范行为或互动而达成的协议性标准或规程。",
      "example_en": "The Geneva Conventions establish rules for the humane treatment of prisoners of war.",
      "example_cn": "《日内瓦公约》确立了战俘人道待遇的规则。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "norms",
      "analysis": "“Norms” (规范) 更侧重于社会或文化中非正式但被广泛接受的行为标准，通常带有道德或社会压力的色彩，不一定有明文规定。而 “conventions” 更强调一种约定俗成的、可被明确识别的实践或程序，常用于专业或制度性语境中。"
    },
    {
      "word_to_compare": "customs",
      "analysis": "“Customs” (风俗) 通常指一个地区或民族长期传承下来的传统行为方式，具有强烈的文化和历史背景，多用于描述节日、礼仪等。而 “conventions” 更广泛，可涵盖语言、技术、法律等非文化性领域，且不一定具有历史延续性。"
    },
    {
      "word_to_compare": "rules",
      "analysis": "“Rules” (规则) 通常是明确制定、具有强制性或惩罚性后果的条文，如法律、游戏规则。而 “conventions” 多为非强制性的共识，违反它们可能被视为不妥或不专业，但通常不会导致正式处罚。"
    }
  ]
}