{
  "word": "converted",
  "pronunciation": "kən·vər·tɪd",
  "concise_definition": "adj. 已转化的, 已改变信仰的; v. 转化, 改变, 转换（convert 的过去式和过去分词）",
  "forms": {
    "base_form": "convert",
    "third_person_singular": "converts",
    "past_tense": "converted",
    "past_participle": "converted",
    "present_participle": "converting",
    "noun_form": "conversion"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having changed from one belief, religion, system, or state to another, especially in a religious or ideological context.",
      "explanation_cn": "指已从一种信仰、宗教、体系或状态转变为另一种，尤其用于宗教或意识形态的转变语境。",
      "example_en": "She is a converted Buddhist who once practiced Christianity.",
      "example_cn": "她曾信奉基督教，现已皈依佛教。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Modified or adapted to serve a new purpose or function, often through technical or structural change.",
      "explanation_cn": "指通过技术或结构上的调整，被改造以适应新的用途或功能。",
      "example_en": "The old factory has been converted into a modern art gallery.",
      "example_cn": "这座旧工厂已被改造成一座现代艺术画廊。"
    },
    {
      "pos": "verb",
      "explanation_en": "To change something from one form, state, system, or use to another, often systematically or deliberately.",
      "explanation_cn": "指有系统或有意识地将某物从一种形式、状态、体系或用途转变为另一种。",
      "example_en": "The team converted the raw data into a visual chart.",
      "example_cn": "团队将原始数据转换为可视化图表。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause someone to adopt a different belief, religion, or opinion, especially through persuasion or influence.",
      "explanation_cn": "指通过劝说或影响，使某人接受另一种信仰、宗教或观点。",
      "example_en": "The missionary hoped to convert the local population to his faith.",
      "example_cn": "传教士希望使当地居民皈依他的信仰。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "transform",
      "analysis": "“Transform”（彻底改变）强调本质或形态上的根本性变化，常带有强烈、戏剧性的含义，如“蝴蝶化蛹成蝶”。而 “converted” 更侧重于从一种既定状态转向另一种，常用于信仰、用途或系统层面，变化可能更渐进或功能性。"
    },
    {
      "word_to_compare": "change",
      "analysis": "“Change”（改变）是最通用的词，可指任何程度的变动，从轻微到剧烈均可。“Converted” 是 “change” 的一种特定类型，特指有方向性、有目的性的转变，尤其涉及信仰、系统或功能的切换，语义更具体。"
    },
    {
      "word_to_compare": "switch",
      "analysis": "“Switch”（切换）通常指在两个或多个选项之间快速、直接地更换，如切换频道、切换账户，带有临时性或操作性色彩。“Converted” 则暗示更持久、更深层的转变，常伴随态度或结构的调整，而非简单替换。"
    }
  ]
}