{
  "word": "conversion",
  "pronunciation": "kun·ver·zhun",
  "concise_definition": "n. 转换, 转化, 改宗, 转让",
  "forms": {
    "plural": "conversions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act or process of changing from one form, state, system, or function to another, often involving a fundamental transformation in nature or purpose.",
      "explanation_cn": "指从一种形式、状态、系统或功能转变为另一种，通常涉及本质或目的的根本性变化。",
      "example_en": "The conversion of solar energy into electricity powers the entire village.",
      "example_cn": "将太阳能转化为电能为整个村庄供电。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of changing one's religious beliefs or affiliations, especially adopting a new faith.",
      "explanation_cn": "指改变宗教信仰或归属，尤其是皈依一种新的宗教。",
      "example_en": "His conversion to Buddhism came after years of meditation and spiritual searching.",
      "example_cn": "经过多年的冥想与精神探索，他皈依了佛教。"
    },
    {
      "pos": "noun",
      "explanation_en": "In marketing or business, the process of turning a visitor or prospect into a customer, typically measured as a percentage.",
      "explanation_cn": "在市场营销或商业中，指将访客或潜在客户转化为实际客户的流程，通常以百分比衡量。",
      "example_en": "The website's conversion rate improved from 2% to 5% after redesigning the checkout page.",
      "example_cn": "在重新设计结账页面后，该网站的转化率从2%提升至5%。"
    },
    {
      "pos": "noun",
      "explanation_en": "The legal or formal transfer of ownership or property from one party to another.",
      "explanation_cn": "指财产或所有权在双方之间依法或正式的转让。",
      "example_en": "The conversion of the old factory into a public park was approved by the city council.",
      "example_cn": "将旧工厂改建为公园的转让计划已获市政府批准。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "transformation",
      "analysis": "“Transformation” (转变) 强调深刻、彻底、有时是革命性的变化，常用于描述结构、本质或身份的根本性重塑，语义范围更广、更抽象。而 “conversion” 更常用于具体领域，如宗教、能源、商业，且常隐含一个明确的起点与终点。"
    },
    {
      "word_to_compare": "change",
      "analysis": "“Change” (改变) 是最通用的词，可指任何程度的变动，从轻微到剧烈均可。而 “conversion” 暗示一种更系统、有目的、有时是不可逆的转变，尤其在宗教、技术或商业语境中具有特定含义。"
    },
    {
      "word_to_compare": "translation",
      "analysis": "“Translation” (翻译) 专指语言之间的转换，或在数学/科学中指位置或形式的平移，不涉及本质改变。而 “conversion” 指的是功能、性质或状态的实质转变，不仅限于形式上的表达。"
    }
  ]
}