{
  "word": "cool",
  "pronunciation": "kool",
  "concise_definition": "adj. 凉爽的, 冷静的, 酷的, 时髦的; v. 冷却, 镇静",
  "forms": {
    "comparative": "cooler",
    "superlative": "coolest",
    "third_person_singular": "cools",
    "past_tense": "cooled",
    "past_participle": "cooled",
    "present_participle": "cooling"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having a low temperature; not hot or warm, often providing comfort or relief from heat.",
      "explanation_cn": "温度较低的，不热或不暖的，常用于提供凉爽或缓解炎热的感觉。",
      "example_en": "The water from the spring was refreshingly cool.",
      "example_cn": "泉水的水清凉宜人。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Calm, composed, and not easily excited or emotional; showing self-control in stressful situations.",
      "explanation_cn": "冷静、镇定、不易激动或情绪化；在压力情境下表现出自制力。",
      "example_en": "She stayed cool under pressure during the negotiation.",
      "example_cn": "她在谈判中保持冷静。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Fashionable, stylish, or admired for being trendy and appealing, especially among young people.",
      "explanation_cn": "时尚的、有型的，因符合潮流而受到赞赏，尤其在年轻人中流行。",
      "example_en": "Those sneakers are so cool — everyone wants a pair.",
      "example_cn": "那双运动鞋太酷了——人人都想买一双。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reduce in temperature, either naturally or by external means, often to make something more comfortable or safe.",
      "explanation_cn": "通过自然方式或外部手段降低温度，通常是为了使某物更舒适或更安全。",
      "example_en": "Let the soup cool before you taste it.",
      "example_cn": "喝汤前先让汤凉一凉。"
    },
    {
      "pos": "verb",
      "explanation_en": "To become less intense, excited, or angry; to calm down emotionally.",
      "explanation_cn": "指情绪、热情或愤怒减弱，变得平静下来。",
      "example_en": "He needed some time to cool down after the argument.",
      "example_cn": "争吵后，他需要一些时间来平复情绪。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cold",
      "analysis": "“Cold” (冷的) 是一个更中性或客观的温度描述，通常指温度极低，可能带有负面含义（如冷酷、无情）。而 “cool” 是相对温和的低温，常带有积极或舒适的情感色彩，如凉爽宜人或冷静沉着。"
    },
    {
      "word_to_compare": "calm",
      "analysis": "“Calm” (平静的) 专指情绪或环境的安宁，强调无波动、无干扰的状态。而 “cool” 在情绪语境中不仅指平静，还隐含一种自信、不慌乱甚至带点疏离感的镇定，常用于形容在压力下仍保持风度的人。"
    },
    {
      "word_to_compare": "trendy",
      "analysis": "“Trendy” (时髦的) 仅指跟随当前流行趋势，偏重于外在的时尚性，有时带有短暂或肤浅的贬义。而 “cool” 不仅包含时尚，还融合了个性、态度和文化认同，是一种更深层、更持久的吸引力，常超越潮流本身。"
    }
  ]
}