{
  "word": "coop",
  "pronunciation": "koop",
  "concise_definition": "n. 鸡舍, 小屋; v. 关在鸡舍中, 合作",
  "forms": {
    "third_person_singular": "coops",
    "past_tense": "cooped",
    "past_participle": "cooped",
    "present_participle": "cooping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small enclosed structure, typically made of wire or wood, used to house chickens or other small animals.",
      "explanation_cn": "一种小型封闭结构，通常由金属丝或木材制成，用于饲养鸡或其他小型动物。",
      "example_en": "The chickens were clucking loudly as they pecked at the feed in their coop.",
      "example_cn": "鸡群在鸡舍里啄食饲料，发出咯咯的叫声。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, cramped room or space, often used figuratively to describe a confined or restricted environment.",
      "explanation_cn": "指狭小、拥挤的房间或空间，常用于比喻形容受限或压抑的环境。",
      "example_en": "After being cooped up in the apartment all week, she needed to get outside for some fresh air.",
      "example_cn": "在公寓里憋了一周后，她需要到外面呼吸些新鲜空气。"
    },
    {
      "pos": "verb",
      "explanation_en": "To confine someone or something in a small space, often against their will or for an extended period.",
      "explanation_cn": "将某人或某物关在狭小的空间内，通常是非自愿的或持续较长时间。",
      "example_en": "The storm cooped us inside for three days.",
      "example_cn": "这场风暴把我们困在屋里整整三天。"
    },
    {
      "pos": "verb",
      "explanation_en": "To work together in a cooperative manner, especially in a business or organizational context (often used in the phrase 'to coop together').",
      "explanation_cn": "以合作的方式共同工作，尤其在商业或组织背景下（常用于短语 'cooperate together'）。",
      "example_en": "The local farmers decided to coop together to sell their produce directly to consumers.",
      "example_cn": "当地农民决定合作，直接向消费者销售农产品。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cage",
      "analysis": "“Cage”（笼子）泛指任何用于关押动物或物品的封闭结构，通常强调物理隔离和限制自由，不特指家禽饲养。而 “coop” 专指用于饲养鸡等家禽的简易围栏，具有特定的农业用途，且结构通常更开放、更简陋。"
    },
    {
      "word_to_compare": "shelter",
      "analysis": "“Shelter”（庇护所）强调提供保护和安全，用途广泛，可指人类或动物的临时或永久性住所，不一定有围栏结构。而 “coop” 更具体，通常指为家禽设计的、有明确功能性的封闭空间，且常带有饲养目的。"
    },
    {
      "word_to_compare": "cooperate",
      "analysis": "“Cooperate”（合作）是正式的动词，指各方为共同目标而协同努力，语义抽象且广泛用于社会、政治、商业语境。而 “coop” 作为动词时是其非正式缩略形式，多用于口语或特定语境（如农民合作社），语义更口语化、地域化，且常与集体经济行为相关。"
    }
  ]
}