{
  "word": "copper",
  "pronunciation": "kaw·pər",
  "concise_definition": "n. 铜, 铜币, 红褐色; v. 用铜覆盖, 铜化",
  "forms": {
    "plural": "coppers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A reddish-brown metallic element with high thermal and electrical conductivity, widely used in electrical wiring, plumbing, and coinage.",
      "explanation_cn": "一种红棕色的金属元素，具有优良的导热性和导电性，广泛用于电线、管道和铸币。",
      "example_en": "The electrical wires are made of copper for better conductivity.",
      "example_cn": "这些电线用铜制成，以获得更好的导电性。"
    },
    {
      "pos": "noun",
      "explanation_en": "A coin made of copper or copper alloy, especially in historical or informal contexts (e.g., British penny).",
      "explanation_cn": "由铜或铜合金制成的硬币，尤其在历史或非正式语境中使用（如英国便士）。",
      "example_en": "He found an old copper in his grandfather's pocket, dating back to the 1920s.",
      "example_cn": "他在祖父的口袋里发现了一枚古老的铜币，可追溯到20世纪20年代。"
    },
    {
      "pos": "noun",
      "explanation_en": "A reddish-brown color resembling the metal copper.",
      "explanation_cn": "一种类似铜金属的红褐色。",
      "example_en": "Her hair had a beautiful copper tone in the sunlight.",
      "example_cn": "她的头发在阳光下呈现出美丽的铜红色。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover or coat something with copper, often for decorative or protective purposes.",
      "explanation_cn": "用铜覆盖或镀上铜，通常用于装饰或保护目的。",
      "example_en": "The roof was coppered to prevent corrosion and give it a distinctive patina.",
      "example_cn": "屋顶镀了铜以防止腐蚀，并形成独特的铜绿。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bronze",
      "analysis": "“Bronze” (青铜) 是铜与锡等其他金属的合金，颜色偏暗、硬度更高，常用于雕塑和武器；而 “copper” 是纯金属，颜色更鲜艳红润，导电性更强，主要用于电气和管道领域。"
    },
    {
      "word_to_compare": "brass",
      "analysis": "“Brass” (黄铜) 是铜与锌的合金，呈金黄色，耐腐蚀性好，常用于乐器和装饰件；而 “copper” 本身是单一元素，颜色为红棕色，更柔软，导电性优于黄铜。"
    },
    {
      "word_to_compare": "metal",
      "analysis": "“Metal” (金属) 是一个泛称，涵盖铁、铝、金、银等所有金属元素；而 “copper” 是其中一种具体的金属元素，具有独特的物理和化学特性，如高导电性、易氧化形成铜绿。"
    }
  ]
}