{
  "word": "copying",
  "pronunciation": "kohp·ing",
  "concise_definition": "n. 复制, 抄袭; v. 复制, 仿效, 抄袭 (动名词形式)",
  "forms": {
    "base_form": "copy",
    "third_person_singular": "copies",
    "past_tense": "copied",
    "past_participle": "copied",
    "present_participle": "copying"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of making an exact or close reproduction of something, such as a document, artwork, or digital file, often for practical or legal purposes.",
      "explanation_cn": "指对某物（如文件、艺术品或数字文件）进行精确或近似的复制行为，通常出于实用或法律目的。",
      "example_en": "The museum displayed a high-quality copying of the ancient manuscript.",
      "example_cn": "博物馆展出了这份古手稿的高质量复制品。"
    },
    {
      "pos": "noun",
      "explanation_en": "The unauthorized reproduction of someone else's work, especially in writing, art, or music, often violating copyright or ethical standards.",
      "explanation_cn": "指未经授权复制他人的作品，尤其在写作、艺术或音乐领域，通常违反版权或道德规范，即抄袭。",
      "example_en": "The student was punished for academic copying in his research paper.",
      "example_cn": "该学生因论文中的学术抄袭行为而受到处罚。"
    },
    {
      "pos": "verb",
      "explanation_en": "To produce a duplicate or imitation of something, especially by hand, mechanically, or digitally.",
      "explanation_cn": "指通过手工、机械或数字方式制作某物的复制品或仿制品。",
      "example_en": "She was copying the notes from the board while the teacher spoke.",
      "example_cn": "老师讲课时，她正在抄写黑板上的笔记。"
    },
    {
      "pos": "verb",
      "explanation_en": "To imitate someone's behavior, style, or ideas, often in an attempt to gain approval or success.",
      "explanation_cn": "指模仿他人的行为、风格或想法，通常是为了获得认可或成功。",
      "example_en": "Many young designers are copying the minimalist aesthetic of Scandinavian brands.",
      "example_cn": "许多年轻设计师正在模仿斯堪的纳维亚品牌的极简主义风格。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "reproduction",
      "analysis": "“Reproduction” (复制品) 是一个更中性、更技术性的术语，常用于艺术、科学或出版领域，强调复制过程的精确性和客观性，不带有道德判断。而 “copying” 在作为名词时，常隐含非授权或不道德的含义，尤其在学术或创意领域。"
    },
    {
      "word_to_compare": "plagiarism",
      "analysis": "“Plagiarism” (剽窃) 是一个法律和学术术语，特指在未注明来源的情况下使用他人作品并据为己有，是 “copying” 的一种严重且不道德的形式。所有 plagiarism 都是 copying，但并非所有 copying 都构成 plagiarism。"
    },
    {
      "word_to_compare": "imitation",
      "analysis": "“Imitation” (模仿) 更强调风格、行为或形式上的效仿，通常不涉及逐字或逐件的复制，且不一定具有负面含义（如模仿名人演讲风格）。而 “copying” 更倾向于直接、机械地复制内容，常带有贬义，尤其在涉及知识产权时。"
    }
  ]
}