{
  "word": "cora",
  "pronunciation": "koh·ruh",
  "concise_definition": "n. (专有名词) 科拉（人名、地名或品牌名）",
  "forms": {
    "plural": "coras"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A proper noun used as a given name, often of Greek or Latin origin, sometimes associated with the Latin word 'cor' meaning 'heart'. It may also appear as a variant spelling of 'Cora', a name popular in English-speaking countries.",
      "explanation_cn": "用作人名的专有名词，常源于希腊语或拉丁语，有时与拉丁语 'cor'（意为‘心’）相关。它也可能是英文名 'Cora' 的变体拼写，在英语国家中较为流行。",
      "example_en": "Cora was known for her kindness and unwavering spirit.",
      "example_cn": "科拉以她的仁慈和坚定的精神而闻名。"
    },
    {
      "pos": "noun",
      "explanation_en": "A brand or product name used in various industries, such as fashion, cosmetics, or technology, often chosen for its soft, melodic sound and association with elegance or nature.",
      "explanation_cn": "用于时尚、化妆品或科技等行业的品牌或产品名称，常因其柔和悦耳的发音及与优雅或自然的关联而被选用。",
      "example_en": "The new skincare line, Cora, launched with organic ingredients and minimalist packaging.",
      "example_cn": "新的护肤系列‘科拉’以有机成分和极简包装推出。"
    },
    {
      "pos": "noun",
      "explanation_en": "A rare geographical name, occasionally used for small towns, streets, or natural features, particularly in regions with historical ties to classical languages.",
      "explanation_cn": "罕见的地名，偶尔用于小镇、街道或自然地貌，尤其在与古典语言有历史关联的地区。",
      "example_en": "We hiked to the top of Cora Hill, where the view stretched endlessly.",
      "example_cn": "我们徒步登上了科拉山，从那里望去，景色无边无际。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "Cora",
      "analysis": "‘Cora’ 是 ‘cora’ 的标准英文拼写形式，作为人名或品牌名时，两者在语义和用法上完全一致。‘cora’ 作为小写形式，通常仅在非专有名词语境中出现，如文本中未首字母大写的引用，但实际使用中几乎总是以 ‘Cora’ 形式出现。"
    },
    {
      "word_to_compare": "Kora",
      "analysis": "‘Kora’ 是另一个拼写变体，常见于西非乐器名（一种21弦竖琴）或某些非洲人名，发音相近但文化背景不同。‘Cora’ 与西方古典传统和‘心’的意象相关，而 ‘Kora’ 则与非洲音乐文化紧密相连，二者不可混淆。"
    },
    {
      "word_to_compare": "Corra",
      "analysis": "‘Corra’ 是 ‘Cora’ 的另一种变体拼写，多见于西班牙语或意大利语语境中，有时作为姓氏使用。它与 ‘cora’ 在发音上相似，但拼写和地域文化背景不同，通常不用于英语命名体系。"
    }
  ]
}