{
  "word": "cord",
  "pronunciation": "kawrd",
  "concise_definition": "n. 绳索, 电线, 音 cord; v. 用绳捆扎",
  "forms": {
    "plural": "cords"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A thick, flexible line made by twisting or braiding fibers, often used for tying, pulling, or hanging objects.",
      "explanation_cn": "由纤维捻合或编织而成的粗而柔韧的绳索，常用于捆绑、牵引或悬挂物品。",
      "example_en": "She tied the package securely with a sturdy cord.",
      "example_cn": "她用一根结实的绳子把包裹牢牢捆好。"
    },
    {
      "pos": "noun",
      "explanation_en": "A flexible cable that conducts electricity, typically connecting an appliance to a power source.",
      "explanation_cn": "用于传导电流的柔性电缆，通常用于连接电器与电源。",
      "example_en": "Don't forget to plug in the charger—the cord is disconnected.",
      "example_cn": "别忘了插上充电器——电线没接上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A unit of volume for firewood, equal to a stack 4 feet high, 4 feet wide, and 8 feet long (128 cubic feet).",
      "explanation_cn": "木材的体积单位，等于高4英尺、宽4英尺、长8英尺的木柴堆（128立方英尺）。",
      "example_en": "We bought three cords of wood for the winter.",
      "example_cn": "我们为过冬买了三捆木柴。"
    },
    {
      "pos": "noun",
      "explanation_en": "Anatomical structure: a bundle of nerve fibers or tendons, especially the spinal cord or umbilical cord.",
      "explanation_cn": "解剖学结构：神经纤维或肌腱的束状结构，尤指脊髓或脐带。",
      "example_en": "The injury affected her spinal cord, causing partial paralysis.",
      "example_cn": "这次受伤影响了她的脊髓，导致部分瘫痪。"
    },
    {
      "pos": "verb",
      "explanation_en": "To bind or tie something with a cord or rope.",
      "explanation_cn": "用绳索或带子将某物捆绑起来。",
      "example_en": "They corded the bundles of hay before loading them onto the wagon.",
      "example_cn": "他们在把干草捆装上马车前用绳子捆好了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rope",
      "analysis": "“Rope”（绳子）通常比 “cord” 更粗、更强韧，用于承重或高强度用途，如攀岩、拖船；而 “cord” 更细、更柔韧，常用于轻型捆绑、电器连接或解剖结构，语义范围更广。"
    },
    {
      "word_to_compare": "wire",
      "analysis": "“Wire”（电线/金属丝）是金属制成的刚性或半刚性导体，主要用于导电或结构支撑；而 “cord” 虽可指电线，但通常指外层有绝缘皮的柔性组合线缆，包含多根导线和保护层，更强调整体连接功能。"
    },
    {
      "word_to_compare": "string",
      "analysis": "“String”（细线）比 “cord” 更细、更柔软，常用于缝纫、系气球或儿童玩具；而 “cord” 更粗，结构更紧密，具有更强的拉力和实用性，多用于实用或技术性场景。"
    }
  ]
}