{
  "word": "cores",
  "pronunciation": "kohrs",
  "concise_definition": "n. 核心, 果核, 原子核, 中心部分",
  "forms": {
    "singular": "core"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The central or most important part of something, especially the innermost part around which other parts are arranged or organized.",
      "explanation_cn": "指某物的中心或最重要的部分，尤其是其他部分围绕其排列或组织的最内层部分。",
      "example_en": "The core of the Earth is composed of iron and nickel.",
      "example_cn": "地球的核心由铁和镍组成。"
    },
    {
      "pos": "noun",
      "explanation_en": "The hard, inedible inner part of a fruit, such as an apple or pear, containing the seeds.",
      "explanation_cn": "指水果（如苹果或梨）坚硬不可食用的内部部分，内含种子。",
      "example_en": "She removed the core from the apple before slicing it.",
      "example_cn": "她在切苹果之前去掉了果核。"
    },
    {
      "pos": "noun",
      "explanation_en": "The central processing unit (CPU) in a computer chip, representing an independent processing unit capable of executing instructions.",
      "explanation_cn": "指计算机芯片中的中央处理器（CPU），代表一个能够独立执行指令的处理单元。",
      "example_en": "Modern processors often have eight cores to handle multiple tasks simultaneously.",
      "example_cn": "现代处理器通常具有八个核心，以同时处理多个任务。"
    },
    {
      "pos": "noun",
      "explanation_en": "The central or essential element of an idea, argument, or system; the fundamental principle or issue.",
      "explanation_cn": "指一个想法、论点或体系中的中心或本质要素；基本原理或关键问题。",
      "example_en": "The core of her argument is that education should be accessible to everyone.",
      "example_cn": "她论点的核心是教育应面向所有人开放。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "center",
      "analysis": "“Center”（中心）泛指空间或抽象事物的中间位置，强调几何或功能上的居中性，不一定具有内在重要性。而 “core” 更强调事物内在的本质、关键或不可分割的部分，常带有功能性和结构性的含义。"
    },
    {
      "word_to_compare": "heart",
      "analysis": "“Heart”（心脏/核心）常用于比喻，强调情感或象征意义上的中心，如“the heart of the city”；而 “core” 更偏向客观、技术或物理层面的中心，如“core of a planet”或“CPU core”，更理性、更具体。"
    },
    {
      "word_to_compare": "nucleus",
      "analysis": "“Nucleus”（原子核/细胞核）是科学术语，特指细胞或原子的中心结构，与 “core” 在科学语境中常可互换，但 “nucleus” 更精确地用于生物学和物理学，而 “core” 适用范围更广，可用于抽象概念（如核心思想）和日常物体（如果核）。"
    }
  ]
}