{
  "word": "cork",
  "pronunciation": "kawrk",
  "concise_definition": "n. 软木, 软木塞; v. 用软木塞封住",
  "forms": {
    "plural": "corks",
    "third_person_singular": "corks",
    "past_tense": "corked",
    "past_participle": "corked",
    "present_participle": "corking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A stopper made from the bark of the cork oak tree, typically used to seal bottles, especially wine bottles.",
      "explanation_cn": "由软木橡树的树皮制成的塞子，通常用于密封瓶子，尤其是葡萄酒瓶。",
      "example_en": "She pulled the cork from the bottle and poured two glasses of wine.",
      "example_cn": "她拔出瓶塞，倒了两杯葡萄酒。"
    },
    {
      "pos": "noun",
      "explanation_en": "The lightweight, porous material harvested from the bark of the cork oak tree, used in insulation, bulletin boards, and other products due to its buoyancy and shock-absorbing properties.",
      "explanation_cn": "从软木橡树树皮中收获的轻质、多孔材料，因其浮力和减震性能，常用于隔热材料、软木板和其他产品。",
      "example_en": "The floor was covered with cork tiles for their sound-dampening qualities.",
      "example_cn": "地板铺满了软木瓷砖，以发挥其吸音效果。"
    },
    {
      "pos": "verb",
      "explanation_en": "To seal or close a container, especially a bottle, with a cork.",
      "explanation_cn": "用软木塞封住或关闭容器，尤指瓶子。",
      "example_en": "He corked the bottle tightly after finishing the last sip.",
      "example_cn": "他喝完最后一口后，紧紧地塞上了瓶塞。"
    },
    {
      "pos": "verb",
      "explanation_en": "To prevent the escape or spread of something by blocking it, often metaphorically.",
      "explanation_cn": "比喻性地通过堵塞来阻止某物的逸出或扩散。",
      "example_en": "The government tried to cork public outrage by censoring the news.",
      "example_cn": "政府试图通过审查新闻来压制公众的愤怒。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "stopper",
      "analysis": "“Stopper”（塞子）是更通用的术语，指任何用于封闭容器口的物体，可以是塑料、金属或玻璃制成。而 “cork” 特指由软木制成的塞子，具有天然弹性与透气性，常用于酒类容器，具有文化与使用场景上的特殊性。"
    },
    {
      "word_to_compare": "plug",
      "analysis": "“Plug”（塞子/插头）通常指用于堵塞孔洞或管道的硬质物体，如水管塞或电源插头，强调物理填充功能，常用于工程或技术语境。而 “cork” 更多用于日常物品（如酒瓶），且具有天然材质和传统用途的联想。"
    },
    {
      "word_to_compare": "cap",
      "analysis": "“Cap”（盖子）通常指旋拧式或扣合式的容器封口，如瓶盖、罐盖，多为金属或塑料，可重复使用。而 “cork” 是插入式封口，通常一次性使用，且与自然材料和传统工艺紧密关联，如葡萄酒文化。"
    }
  ]
}