{
  "word": "corner",
  "pronunciation": "kawr·nər",
  "concise_definition": "n. 角落, 拐角, 困境; v. 使陷入困境, 占据优势",
  "forms": {
    "plural": "corners",
    "third_person_singular": "corners",
    "past_tense": "cornered",
    "past_participle": "cornered",
    "present_participle": "cornering"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The point or area where two lines, edges, or surfaces meet at an angle, especially in a room, building, or street.",
      "explanation_cn": "指两条线、边缘或表面相交形成的角，尤指房间、建筑或街道中的拐角处。",
      "example_en": "She hung the painting in the corner of the living room.",
      "example_cn": "她把画挂在了客厅的角落里。"
    },
    {
      "pos": "noun",
      "explanation_en": "A difficult or inescapable situation, often implying being trapped or under pressure with limited options.",
      "explanation_cn": "指一种困难或无法逃脱的处境，常暗示被逼入绝境或处于压力之下，选择有限。",
      "example_en": "The company was cornered by its mounting debts and had to file for bankruptcy.",
      "example_cn": "公司因债务累积而陷入困境，不得不申请破产。"
    },
    {
      "pos": "noun",
      "explanation_en": "A secluded or remote place, often used to describe a hidden or less frequented area.",
      "explanation_cn": "指一个偏僻或隐秘的地方，常用于描述较少有人涉足的区域。",
      "example_en": "He found a quiet corner in the library to study undisturbed.",
      "example_cn": "他在图书馆里找到了一个安静的角落专心学习。"
    },
    {
      "pos": "verb",
      "explanation_en": "To force someone or something into a position where escape or escape options are limited, often through strategic pressure or restriction.",
      "explanation_cn": "指通过策略性施压或限制，迫使某人或某物陷入难以脱身的境地。",
      "example_en": "The detective cornered the suspect in the alley behind the building.",
      "example_cn": "侦探在大楼后的小巷里将嫌疑人逼入绝境。"
    },
    {
      "pos": "verb",
      "explanation_en": "To gain a dominant or controlling position in a market, resource, or situation, often by monopolizing or accumulating control.",
      "explanation_cn": "指通过垄断或集中控制，获得对某个市场、资源或局势的主导权。",
      "example_en": "The corporation has cornered the market on rare earth metals.",
      "example_cn": "这家企业已垄断了稀土金属市场。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "angle",
      "analysis": "“Angle” (角度) 侧重于几何学中两条线之间的夹角，强调度数或方向，是抽象的数学概念。而 “corner” 更强调物理空间中由两个面或边交汇形成的实际角落，具有空间和实体属性。"
    },
    {
      "word_to_compare": "nook",
      "analysis": "“Nook” (角落/凹处) 指一个舒适、隐蔽的小空间，常带有温馨或私密的意味，如窗台下的小座位。它比 “corner” 更具情感色彩，且通常暗示舒适性，而 “corner” 可以是中性甚至负面的（如被逼入角落）。"
    },
    {
      "word_to_compare": "trap",
      "analysis": "“Trap” (陷阱) 强调一种有意识设置的、旨在捕获或限制的装置或情境，通常是预先设计的。而 “corner” 作为动词时，强调通过逐步施压使对方无路可退，更侧重于动态的逼迫过程，而非静态的陷阱设置。"
    }
  ]
}