{
  "word": "corners",
  "pronunciation": "kawr·nuhz",
  "concise_definition": "n. 角落, 转角, 有利位置, 困境",
  "forms": {
    "singular": "corner"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The point or area where two edges or sides meet, especially at an angle, such as the intersection of two walls or the outer edge of a room.",
      "explanation_cn": "两条边或面相交形成的点或区域，通常呈角度，例如两面墙的交界处或房间的外角。",
      "example_en": "She hung the painting in the corner of the living room.",
      "example_cn": "她把画挂在了客厅的角落里。"
    },
    {
      "pos": "noun",
      "explanation_en": "A secluded or remote place, often used metaphorically to describe a hidden or less accessible area.",
      "explanation_cn": "一个偏僻或隐秘的地方，常用于比喻指难以触及或被忽视的区域。",
      "example_en": "The old bookstore was tucked away in a quiet corner of the city.",
      "example_cn": "那家旧书店藏在城市一个安静的角落里。"
    },
    {
      "pos": "noun",
      "explanation_en": "A position of advantage or control, especially in business or negotiation, where one party has leverage or the upper hand.",
      "explanation_cn": "一种优势地位或控制权，尤其在商业或谈判中，指一方拥有主动权或优势。",
      "example_en": "The company has cornered the market on electric vehicle batteries.",
      "example_cn": "这家公司已垄断了电动汽车电池市场。"
    },
    {
      "pos": "noun",
      "explanation_en": "A difficult or inescapable situation, often used in the phrase 'to be backed into a corner' to describe being forced into a tight or desperate position.",
      "explanation_cn": "一种困难或无法逃脱的处境，常用于短语 '被逼入绝境'，形容被迫陷入窘迫或绝望的境地。",
      "example_en": "After the scandal broke, the politician was cornered by reporters and had no good answers.",
      "example_cn": "丑闻曝光后，这位政客被记者围堵，无言以对。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "angle",
      "analysis": "“Angle” (角度) 侧重于几何或方向上的倾斜度，强调两条线或面之间的夹角，常用于数学、设计或摄影语境。而 “corner” 更强调空间中的交汇点或区域，具有物理存在感和位置属性。"
    },
    {
      "word_to_compare": "nook",
      "analysis": "“Nook” (角落/凹处) 指一个较小、舒适、隐蔽的角落，常带有温馨或休闲的联想，如阅读角。它比 “corner” 更具情感色彩和私密性，通常用于描述宜人的空间，而非中性或对抗性的位置。"
    },
    {
      "word_to_compare": "edge",
      "analysis": "“Edge” (边缘) 指物体或区域的边界线，强调的是界限而非交汇点。例如，桌子的边缘、悬崖的边缘。而 “corner” 是两条边缘相交形成的点或区域，具有更强的结构性和空间定位特征。"
    }
  ]
}