{
  "word": "corona",
  "pronunciation": "koh·roh·nuh",
  "concise_definition": "n. 日冕, 冠状物, 新冠病毒",
  "forms": {
    "plural": "coronae"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The outermost layer of the Sun's atmosphere, visible as a glowing halo during a total solar eclipse, composed of hot, ionized gas extending millions of kilometers into space.",
      "explanation_cn": "太阳大气的最外层，在日全食时可见为一圈发光的光晕，由数百万公里长的高温电离气体组成。",
      "example_en": "During the total solar eclipse, scientists studied the corona to understand solar wind patterns.",
      "example_cn": "在日全食期间，科学家研究日冕以了解太阳风的模式。"
    },
    {
      "pos": "noun",
      "explanation_en": "A crown-like structure or ring-shaped part, often used in biology, architecture, or design to describe a circular or radiating feature.",
      "explanation_cn": "指呈冠状或环状的结构，常用于生物学、建筑或设计中，描述圆形或放射状的特征。",
      "example_en": "The flower's corona consists of bright yellow petals arranged in a circular pattern around the center.",
      "example_cn": "这种花的冠状结构由一圈明亮的黄色花瓣围绕中心排列而成。"
    },
    {
      "pos": "noun",
      "explanation_en": "A common name for the virus SARS-CoV-2, which causes the disease COVID-19, named for the crown-like spikes on its surface.",
      "explanation_cn": "指引起新冠肺炎（COVID-19）的病毒 SARS-CoV-2 的俗称，因其表面具有冠状突起而得名。",
      "example_en": "The global pandemic was triggered by the spread of the corona virus in late 2019.",
      "example_cn": "2019年底，冠状病毒的传播引发了全球大流行。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "crown",
      "analysis": "“Crown”（王冠）是具体指代君主佩戴的实体冠冕，具有明确的文化和象征意义；而 “corona” 更广泛地用于描述任何类似冠状的自然或人工结构，包括天文、生物或医学语境，语义更抽象、更科学。"
    },
    {
      "word_to_compare": "halo",
      "analysis": "“Halo”（光环）通常指围绕天体（如太阳、月亮）或人物头部的光圈，常带有宗教或诗意色彩，强调视觉上的光晕效果；而 “corona” 是天文学中的专业术语，特指太阳大气层的物理结构，具有明确的科学定义和组成。"
    },
    {
      "word_to_compare": "virus",
      "analysis": "“Virus”（病毒）是生物学中对所有微小病原体的统称；而 “corona” 在现代语境中特指冠状病毒家族（Coronaviridae），尤其是 SARS-CoV-2，是其子类的俗称，具有更强的语义特异性。"
    }
  ]
}