{
  "word": "corporations",
  "pronunciation": "kawr·puh·ray·shuhnz",
  "concise_definition": "n. 公司, 法人团体, 企业",
  "forms": {
    "singular": "corporation"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A legal entity that is separate and distinct from its owners, authorized by law to act as a single person and to own property, enter contracts, and be sued in its own name.",
      "explanation_cn": "一种法律上独立于其所有者的实体，依法被授权以单一主体身份拥有财产、签订合同并被起诉。",
      "example_en": "Multinational corporations like Apple and Toyota have operations in dozens of countries.",
      "example_cn": "苹果和丰田等跨国公司在数十个国家拥有业务。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large business organization, often with a hierarchical structure and significant economic influence, typically focused on profit generation.",
      "explanation_cn": "一种规模庞大、通常具有层级结构并具有显著经济影响力的企业组织，通常以盈利为主要目标。",
      "example_en": "The new tax law was designed to reduce the burden on small businesses but not on large corporations.",
      "example_cn": "这项新税法旨在减轻中小企业的负担，但不减轻大型企业的负担。"
    },
    {
      "pos": "noun",
      "explanation_en": "An incorporated organization, such as a university, hospital, or nonprofit, that has been granted legal personhood under the law.",
      "explanation_cn": "指根据法律被授予法人资格的组织，如大学、医院或非营利机构。",
      "example_en": "The corporation of Harvard University manages its endowments and academic programs.",
      "example_cn": "哈佛大学法人机构负责管理其捐赠基金和学术项目。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "company",
      "analysis": "“Company”（公司）是一个更通用的词，可指任何形式的商业组织，从个体经营到大型企业均可使用；而 “corporation” 是一个法律术语，特指经过法定注册、具有独立法人地位的公司，通常规模更大、结构更复杂。"
    },
    {
      "word_to_compare": "enterprise",
      "analysis": "“Enterprise”（企业）强调创业精神和主动性，常用于描述具有创新性或冒险性的商业项目，可包括非公司形式的个体经营；而 “corporation” 更侧重于法律结构和组织形式，不强调创新性，但强调制度化和规模。"
    },
    {
      "word_to_compare": "firm",
      "analysis": "“Firm”（公司/事务所）通常用于专业服务行业（如律师事务所、会计师事务所），规模较小，且不一定具有法人资格；而 “corporation” 是正式注册的法人实体，通常拥有股东、董事会和复杂的治理结构。"
    }
  ]
}