{
  "word": "corruption",
  "pronunciation": "kohr-up-shuhn",
  "concise_definition": "n. 腐败, 贪污, 败坏, 变质",
  "forms": {
    "plural": "corruptions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The abuse of entrusted power for private gain, especially by government officials or people in positions of authority, involving bribery, embezzlement, or other unethical practices.",
      "explanation_cn": "指滥用被赋予的权力以谋取私利，尤指政府官员或有权势者通过贿赂、贪污或其他不道德手段获取利益的行为。",
      "example_en": "The investigation revealed widespread corruption within the city's public works department.",
      "example_cn": "调查揭示了该市公共工程部门内普遍存在的腐败现象。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process of becoming morally or ethically degraded; the deterioration of integrity, values, or standards in individuals or institutions.",
      "explanation_cn": "指个人或机构的道德或伦理品质逐渐堕落的过程；正直、价值观或标准的退化。",
      "example_en": "The once-respected institution suffered from moral corruption over decades of unchecked power.",
      "example_cn": "这个曾经受人尊敬的机构在数十年的权力失控中逐渐道德败坏。"
    },
    {
      "pos": "noun",
      "explanation_en": "The physical or chemical decay or alteration of a substance, especially food or organic material, leading to spoilage or loss of original quality.",
      "explanation_cn": "指物质（尤其是食物或有机物）因物理或化学变化而发生的腐烂或变质，导致原有品质丧失。",
      "example_en": "The smell of corruption from the spoiled meat filled the kitchen.",
      "example_cn": "腐烂的肉味弥漫了整个厨房。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bribery",
      "analysis": "“Bribery” (行贿/受贿) 是 “corruption” 的一种具体表现形式，特指通过给予或接受金钱或利益来影响他人行为。而 “corruption” 是一个更广泛的概念，涵盖贿赂、贪污、裙带关系、滥用职权等多种形式的不正当行为。"
    },
    {
      "word_to_compare": "fraud",
      "analysis": "“Fraud” (欺诈) 指通过欺骗手段非法获取利益，通常涉及虚假陈述或隐瞒真相，其核心是“欺骗”。而 “corruption” 的核心是“权力滥用”，即使没有直接欺骗，只要利用职权谋私即构成腐败。两者可能重叠，但动机和机制不同。"
    },
    {
      "word_to_compare": "degradation",
      "analysis": "“Degradation” (退化/贬低) 是一个更通用的词，可指环境、道德、地位或质量的下降，不必然涉及权力或利益交换。而 “corruption” 在道德语境下特指因权力滥用导致的伦理堕落，具有更强的社会和制度指向性。"
    }
  ]
}