{
  "word": "corrupted",
  "pronunciation": "kuh·rup·tuhd",
  "concise_definition": "adj. 腐败的, 被玷污的, 被破坏的",
  "forms": {
    "base_form": "corrupt",
    "comparative": "more corrupted",
    "superlative": "most corrupted",
    "adverb": "corruptly"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having been morally degraded or tainted by dishonesty, bribery, or unethical behavior, especially in positions of power or authority.",
      "explanation_cn": "指因贪污、贿赂或不道德行为而道德堕落或被玷污，尤指在权力或权威职位中。",
      "example_en": "The politician was accused of being corrupted by corporate donations.",
      "example_cn": "这位政治家被指控因接受企业捐款而腐败。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Damaged or altered in a way that renders data, files, or systems unusable or unreliable, often due to software errors, viruses, or physical damage.",
      "explanation_cn": "指因软件错误、病毒或物理损坏而导致数据、文件或系统无法使用或不可靠的状态。",
      "example_en": "The hard drive became corrupted after the sudden power outage.",
      "example_cn": "突然断电后，硬盘数据被破坏了。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Contaminated or spoiled in content, meaning, or integrity, such as a text, tradition, or cultural value, often through external influence or distortion.",
      "explanation_cn": "指内容、意义或完整性被外部影响或扭曲而遭到污染或败坏，如文本、传统或文化价值。",
      "example_en": "The original meaning of the ritual was corrupted over centuries of misinterpretation.",
      "example_cn": "这个仪式的原始意义在几个世纪的误解中被扭曲了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bribed",
      "analysis": "“Bribed”（收受贿赂的）特指因接受金钱或利益而做出不正当行为，是“corrupted”的一种具体手段。而 “corrupted” 范围更广，可涵盖道德、数据、文化等多方面的败坏，不一定是通过贿赂实现的。"
    },
    {
      "word_to_compare": "damaged",
      "analysis": "“Damaged”（损坏的）泛指任何形式的物理或功能损伤，可能是意外或中性结果，不隐含道德或系统性败坏。而 “corrupted” 在描述数据或道德时，强调的是内在结构或原则的扭曲，具有负面价值判断。"
    },
    {
      "word_to_compare": "degraded",
      "analysis": "“Degraded”（退化的）侧重于从较高状态下降到较低状态，常用于环境、地位或品质的衰落，语气偏客观。而 “corrupted” 更强调主动的、人为的污染或堕落，带有更强的道德谴责意味。"
    }
  ]
}