{
  "word": "cortez",
  "pronunciation": "kor·teth",
  "concise_definition": "n. 科特兹（人名/地名）",
  "forms": {
    "plural": "Cortezes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to Hernán Cortés (1485–1547), the Spanish conquistador who led the expedition that caused the fall of the Aztec Empire and brought large portions of mainland Mexico under Spanish rule.",
      "explanation_cn": "专有名词，指西班牙征服者埃尔南·科尔特斯（1485–1547），他率领远征队导致阿兹特克帝国覆灭，并使墨西哥大陆大片地区沦为西班牙殖民地。",
      "example_en": "Cortez's conquest of Mexico remains one of the most controversial events in colonial history.",
      "example_cn": "科尔特斯对墨西哥的征服仍是殖民史上最具争议的事件之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A surname of Spanish origin, commonly found in Hispanic communities, often associated with descendants of Hernán Cortés or places named after him.",
      "explanation_cn": "源自西班牙语的姓氏，常见于西班牙语裔社群，常与埃尔南·科尔特斯的后裔或以其命名的地点相关。",
      "example_en": "Dr. Maria Cortez is a leading researcher in Latin American studies.",
      "example_cn": "玛丽亚·科特兹博士是拉丁美洲研究领域的权威学者。"
    },
    {
      "pos": "noun",
      "explanation_en": "A brand or model name, especially in footwear, such as the Nike Cortez, a classic running shoe first released in 1972.",
      "explanation_cn": "用作品牌或型号名称，尤指耐克（Nike）于1972年首次推出的经典跑鞋——耐克科特兹。",
      "example_en": "He wore his old Nike Cortez sneakers to the marathon, a nostalgic choice.",
      "example_cn": "他穿着那双旧款耐克科特兹跑鞋参加马拉松，这是一种怀旧的选择。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cortes",
      "analysis": "“Cortes” 是西班牙语中 “Cortés” 的拼写变体，省略了重音符号。在非西班牙语语境中，常被误拼为 “Cortes”，但正式历史文献和人名中应保留重音（Cortés）。两者指代同一人物，但拼写规范性不同。"
    },
    {
      "word_to_compare": "conquistador",
      "analysis": "“Conquistador”（征服者）是描述科尔特斯身份的通用名词，泛指16世纪西班牙在美洲进行殖民扩张的军事领袖。而 “Cortez” 是特指其中最著名的一位，是专有名词，不能互换使用。"
    },
    {
      "word_to_compare": "shoe",
      "analysis": "“Shoe” 是普通名词，泛指任何穿在脚上的 footwear。而 “Cortez” 作为鞋款名称，是品牌赋予的专有型号，具有文化符号意义，常代表复古风格与运动历史，其内涵远超普通鞋子。"
    }
  ]
}