{
  "word": "cosmic",
  "pronunciation": "koh·zuh·mik",
  "concise_definition": "adj. 宇宙的, 宇宙间极大的, 宇宙观的",
  "forms": {
    "comparative": "cosmic",
    "superlative": "cosmic"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to the universe as a whole, especially in terms of its vastness, origin, or structure; often used to describe phenomena beyond Earth or human scale.",
      "explanation_cn": "指与整个宇宙相关，尤其强调其浩瀚、起源或结构；常用于描述超越地球或人类尺度的现象。",
      "example_en": "The telescope captured images of cosmic radiation from distant galaxies.",
      "example_cn": "这台望远镜捕捉到了来自遥远星系的宇宙辐射图像。"
    },
    {
      "pos": "adjective",
      "explanation_en": "So large or extreme as to seem beyond human comprehension or earthly significance; used figuratively to emphasize enormity or importance.",
      "explanation_cn": "形容规模或程度极大，仿佛超出了人类的理解或尘世的意义；常用于比喻，强调其庞大或重要性。",
      "example_en": "It was a cosmic mistake—one that changed the course of history.",
      "example_cn": "这是一个天大的错误——它改变了历史的进程。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to a philosophical or spiritual worldview that sees the universe as an interconnected, harmonious whole, often in contrast to materialism.",
      "explanation_cn": "指一种哲学或精神世界观，认为宇宙是一个相互联系、和谐统一的整体，常与唯物主义相对。",
      "example_en": "Her poetry reflects a cosmic sense of unity between nature and the human soul.",
      "example_cn": "她的诗歌体现了自然与人类灵魂之间宇宙般的统一感。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "universal",
      "analysis": "“Universal”（普遍的）强调适用于所有地方、所有人或事物，侧重于普遍性与包容性，如“universal law”（普遍法则）。“Cosmic”则更强调与宇宙本身相关，具有空间尺度和神秘感，常带有超然或宏大的意味。"
    },
    {
      "word_to_compare": "astronomical",
      "analysis": "“Astronomical”（天文学的；极大的）主要指与天文学相关，或形容数量极大（如天文数字），侧重于可测量的规模。“Cosmic”更偏向哲学或诗意的宏大，不一定可量化，常用于表达超越物理尺度的精神或情感体验。"
    },
    {
      "word_to_compare": "galactic",
      "analysis": "“Galactic”（银河的）特指与银河系或星系相关，范围比“cosmic”更具体、更局限。而“cosmic”涵盖整个宇宙，包括星系、恒星、暗物质等所有层面，语义范围更广，更具整体性和抽象性。"
    }
  ]
}