{
  "word": "cosmetic",
  "pronunciation": "kəz·met·ik",
  "concise_definition": "adj. 美容的, 外表的, 修辞的; n. 化妆品",
  "forms": {
    "comparative": "cosmetic",
    "superlative": "cosmetic",
    "plural": "cosmetics"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or used for enhancing physical appearance, especially through the use of makeup or beauty treatments; superficial or only affecting the outward appearance without changing the underlying substance.",
      "explanation_cn": "与美容或提升外貌有关，通常指使用化妆品或美容手段；也可指仅影响外表而未改变实质内容的，表面的、修辞性的。",
      "example_en": "The company made cosmetic changes to the product packaging to attract younger customers.",
      "example_cn": "该公司对产品包装进行了外观上的调整，以吸引年轻顾客。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Designed to create a favorable impression without addressing the real issue; often used to describe actions that are symbolic rather than substantive.",
      "explanation_cn": "旨在制造良好印象，但并未解决实际问题；常用于描述象征性而非实质性的举措。",
      "example_en": "The government's reforms were merely cosmetic, failing to tackle corruption at its core.",
      "example_cn": "政府的改革只是表面文章，并未触及腐败的根本问题。"
    },
    {
      "pos": "noun",
      "explanation_en": "A substance or product used to enhance or alter the appearance of the face or body, such as lipstick, foundation, or eyeshadow.",
      "explanation_cn": "用于增强或改变面部或身体外观的物质或产品，如口红、粉底或眼影。",
      "example_en": "She bought a new set of cosmetics for her wedding day.",
      "example_cn": "她为婚礼买了一套新的化妆品。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "aesthetic",
      "analysis": "“Aesthetic”（美学的）强调对美、艺术性或感官愉悦的追求，通常涉及整体设计、风格或艺术价值，具有更深层的文化或哲学内涵。而 “cosmetic” 更侧重于外在修饰，常带有表面化、非本质的贬义色彩。"
    },
    {
      "word_to_compare": "superficial",
      "analysis": "“Superficial”（表面的）泛指缺乏深度或仅停留在表层，可用于任何情境，如思想、情感或分析。而 “cosmetic” 专指通过外在手段（如化妆或包装）进行的修饰，常用于描述人为的、刻意的表象工程，语义更具体且常含批评意味。"
    },
    {
      "word_to_compare": "makeup",
      "analysis": "“Makeup”（化妆品）是 “cosmetics” 的具体指代，特指用于面部的彩妆产品，是 “cosmetics” 的子集。而 “cosmetic” 作为形容词时，可延伸用于非化妆语境（如 ‘cosmetic surgery’ 或 ‘cosmetic changes’），范围更广，语义更抽象。"
    }
  ]
}