{
  "word": "cosmopolitan",
  "pronunciation": "kohz·muh·pol·i·tuh·n",
  "concise_definition": "adj. 世界性的, 国际化的; n. 世界主义者, 见多识广的人",
  "forms": {
    "comparative": "more cosmopolitan",
    "superlative": "most cosmopolitan",
    "plural": "cosmopolitans"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Characterized by or familiar with many different countries and cultures; having a worldwide scope or outlook, often reflecting diversity and sophistication.",
      "explanation_cn": "以熟悉或包容众多国家和文化为特征的；具有全球视野或格局，常体现多元性与精致性。",
      "example_en": "New York is a cosmopolitan city with people from every corner of the globe.",
      "example_cn": "纽约是一座世界性的城市，汇聚了来自全球各地的人们。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Not limited by local or national traditions; open to and influenced by international ideas, styles, or practices.",
      "explanation_cn": "不受地方或民族传统限制的；对国际思想、风格或实践持开放态度并受其影响。",
      "example_en": "Her cosmopolitan taste in art includes everything from Japanese ink paintings to modern abstract sculptures.",
      "example_cn": "她对艺术的世界性品味涵盖了从日本水墨画到现代抽象雕塑的各种作品。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is at home in many parts of the world, often well-traveled and culturally sophisticated, with no strong allegiance to a single nation or culture.",
      "explanation_cn": "指在世界各地都如鱼得水的人，通常见多识广、文化修养高，对单一国家或文化没有强烈归属感。",
      "example_en": "As a cosmopolitan who has lived in five continents, she speaks six languages and adapts effortlessly to any environment.",
      "example_cn": "作为一名曾在五大洲生活过的世界主义者，她会说六种语言，并能轻松适应任何环境。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "international",
      "analysis": "“International” (国际的) 强调涉及多个国家或跨越国界，常用于描述政策、组织或活动，偏重客观的地理或政治范围。而 “cosmopolitan” 更强调个人或文化层面的开放性、包容性和全球化的气质，带有更浓厚的主观修养色彩。"
    },
    {
      "word_to_compare": "global",
      "analysis": "“Global” (全球的) 侧重于规模和覆盖范围，常用于经济、气候或技术等宏观语境，如全球市场、全球变暖。它不必然包含文化多样性或个人修养的含义。而 “cosmopolitan” 则隐含对多元文化的欣赏与融入，更贴近人文语境。"
    },
    {
      "word_to_compare": "urbane",
      "analysis": "“Urbane” (温文尔雅的) 描述一个人举止得体、有教养、有礼貌，通常与城市生活和上流社会的礼仪相关，但不一定涉及国际视野。而 “cosmopolitan” 不仅包含优雅，更强调跨文化的阅历与开放心态，是更广义的‘世界公民’形象。"
    }
  ]
}