{
  "word": "counseling",
  "pronunciation": "koun·suh·ling",
  "concise_definition": "n. 咨询, 心理辅导, 建议",
  "forms": {
    "verb_base": "counsel",
    "present_participle": "counseling",
    "past_tense": "counseled",
    "past_participle": "counseled"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The professional guidance provided by a trained counselor to help individuals understand and manage personal, emotional, or psychological issues, often through structured conversations.",
      "explanation_cn": "由受过专业训练的咨询师提供的指导，帮助个体理解并应对个人、情感或心理问题，通常通过有结构的对话进行。",
      "example_en": "She sought counseling after the death of her husband to cope with her grief.",
      "example_cn": "丈夫去世后，她寻求心理咨询以应对悲痛。"
    },
    {
      "pos": "noun",
      "explanation_en": "Advice or recommendations given, especially in a formal or professional context, to help someone make a decision or solve a problem.",
      "explanation_cn": "在正式或专业背景下提供的建议或指导，旨在帮助某人做出决定或解决问题。",
      "example_en": "The financial counselor offered valuable counseling on budgeting and debt management.",
      "example_cn": "财务顾问就预算编制和债务管理提供了宝贵的建议。"
    },
    {
      "pos": "noun",
      "explanation_en": "A therapeutic process aimed at improving mental health and emotional well-being, often used interchangeably with psychotherapy in clinical settings.",
      "explanation_cn": "一种旨在改善心理健康和情绪福祉的治疗过程，在临床环境中常与心理治疗互换使用。",
      "example_en": "School-based counseling programs have been shown to reduce student anxiety and improve academic performance.",
      "example_cn": "研究表明，学校提供的心理辅导项目能有效减轻学生的焦虑并提升学业表现。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "advice",
      "analysis": "“Advice”（建议）是泛指任何非正式的、通常基于个人经验的意见，不一定是专业性的。而 “counseling” 强调系统性、专业性和持续性的指导过程，通常由持证专业人士提供，具有治疗或发展性目标。"
    },
    {
      "word_to_compare": "therapy",
      "analysis": "“Therapy”（治疗）范围更广，常特指以临床诊断为基础的心理或生理治疗（如认知行为疗法），通常用于治疗精神障碍。而 “counseling” 更侧重于支持性、预防性和发展性干预，常用于应对生活压力、人际关系或短期情绪困扰，程度较轻。"
    },
    {
      "word_to_compare": "mentoring",
      "analysis": "“Mentoring”（指导）通常发生在职业或技能发展语境中，由经验更丰富者向新手提供长期指导，强调榜样作用和成长路径。而 “counseling” 更关注个体的情感、心理或行为问题，目标是缓解困扰而非传授技能。"
    }
  ]
}