{
  "word": "counselors",
  "pronunciation": "koun·suh·luhrz",
  "concise_definition": "n. 心理咨询师, 辅导员, 顾问",
  "forms": {
    "singular": "counselor"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A professional who provides guidance, advice, or support to individuals facing personal, emotional, academic, or career-related challenges, often through structured conversations and therapeutic techniques.",
      "explanation_cn": "指为面临个人、情感、学业或职业困扰的个体提供指导、建议或支持的专业人士，通常通过结构化对话和心理辅导技术进行工作。",
      "example_en": "The school counselor helped the student navigate anxiety about college applications.",
      "example_cn": "学校的辅导员帮助这名学生应对大学申请带来的焦虑。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person appointed or elected to advise others, especially in legal, organizational, or governmental contexts, offering expertise to inform decisions.",
      "explanation_cn": "指被任命或选举出来为他人提供建议的人，尤其在法律、组织或政府背景下，通过专业意见协助决策。",
      "example_en": "The city council hired legal counselors to review the new zoning regulations.",
      "example_cn": "市政府聘请了法律顾问来审查新的分区法规。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who offers spiritual or moral guidance, often within religious or faith-based communities, helping individuals reflect on life choices and ethical dilemmas.",
      "explanation_cn": "指在宗教或信仰团体中为个人提供精神或道德指导的人，帮助他们反思人生选择与伦理困境。",
      "example_en": "The church counselor provided comfort and biblical insight to the grieving family.",
      "example_cn": "教会辅导员为悲痛的家庭提供了安慰和圣经视角的指引。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "therapist",
      "analysis": "“Therapist”（治疗师）通常指接受过临床心理学或精神医学专业训练、以治疗心理障碍为主要目标的专业人士，如认知行为治疗师或精神分析治疗师。而 “counselor” 更侧重于提供支持性、导向性建议，常用于非临床情境，如学校或职业咨询，治疗深度通常较浅。"
    },
    {
      "word_to_compare": "advisor",
      "analysis": "“Advisor”（顾问）多用于专业或行政领域，如财务顾问、学术顾问，强调提供策略性、技术性或制度性建议，通常不涉及情感支持或心理疏导。而 “counselor” 更注重倾听、共情与个人成长，语义范围更广，包含情感维度。"
    },
    {
      "word_to_compare": "mentor",
      "analysis": "“Mentor”（导师）通常基于长期、非正式的关系，侧重于经验传承、职业发展和人格影响，多见于职场或学术环境。而 “counselor” 是一种正式角色，有明确职责边界和专业伦理规范，其互动更结构化，目标更聚焦于解决具体问题。"
    }
  ]
}