{
  "word": "counters",
  "pronunciation": "koun·turs",
  "concise_definition": "n. 柜台, 计数器, 反驳, 反制措施",
  "forms": {
    "singular": "counter"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long, flat surface, typically in a shop, bank, or restaurant, where goods are sold, services are provided, or transactions are conducted.",
      "explanation_cn": "指商店、银行或餐厅中用于销售商品、提供服务或进行交易的长条形平面台面。",
      "example_en": "She waited at the counter to pay for her groceries.",
      "example_cn": "她站在柜台前支付她的杂货费用。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device or instrument that records the number of times something has occurred, often used in sports, manufacturing, or computing.",
      "explanation_cn": "一种用于记录某事件发生次数的装置或仪器，常用于体育、制造或计算机领域。",
      "example_en": "The website's counter shows over a million visits.",
      "example_cn": "该网站的计数器显示访问量已超过一百万次。"
    },
    {
      "pos": "noun",
      "explanation_en": "An action, argument, or strategy designed to oppose, neutralize, or respond effectively to another action or claim.",
      "explanation_cn": "指为对抗、中和或有效回应另一行动或主张而采取的行动、论点或策略。",
      "example_en": "The government introduced tax reforms as counters to rising inflation.",
      "example_cn": "政府推出了税收改革作为应对通货膨胀的反制措施。"
    },
    {
      "pos": "verb",
      "explanation_en": "To respond to an action, argument, or accusation with a contrasting or opposing action or statement.",
      "explanation_cn": "指以相反或对立的行动或陈述来回应某一行为、论点或指控。",
      "example_en": "She countered his criticism with solid evidence.",
      "example_cn": "她用确凿的证据反驳了他的批评。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "counterfeit",
      "analysis": "“Counterfeit”（伪造品）指非法复制的物品，如假币或仿冒商品，强调非法性和欺骗性。而 “counter” 作为名词时指物理台面或计数器，作为动词时指反驳或反制，两者语义无直接关联，仅在拼写上相似。"
    },
    {
      "word_to_compare": "response",
      "analysis": "“Response”（回应）是更通用的词，泛指对任何刺激或行为的反应，可以是口头、情感或行为上的。而 “counter” 作为动词时特指具有对抗性、针对性的回应，常用于辩论、策略或政治语境中，语气更主动、更具对抗性。"
    },
    {
      "word_to_compare": "tab",
      "analysis": "“Tab”（标签/账单）在某些语境下可指餐厅或酒吧的消费账单，常与 “counter” 搭配使用（如 pay at the tab），但其本身不表示物理台面或计数功能。而 “counter” 是实体结构或计数设备，功能更具体、更物理化。"
    }
  ]
}