{
  "word": "countries",
  "pronunciation": "kuhn·triz",
  "concise_definition": "n. 国家, 国土, 领土",
  "forms": {
    "singular": "country"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A politically organized territory with defined borders, a permanent population, a government, and sovereignty over its internal and external affairs.",
      "explanation_cn": "指拥有明确边界、常住人口、政府机构，并对其内政与外交事务拥有主权的政治组织区域。",
      "example_en": "The United Nations includes representatives from nearly 200 countries.",
      "example_cn": "联合国包括来自近200个国家的代表。"
    },
    {
      "pos": "noun",
      "explanation_en": "A distinct geographic and cultural region often identified by its unique traditions, language, and national identity, even if not fully sovereign.",
      "explanation_cn": "指具有独特传统、语言和民族认同的地理与文化区域，即使尚未完全独立或未被普遍承认为主权国家。",
      "example_en": "The Scottish people often refer to Scotland as their country, despite it being part of the United Kingdom.",
      "example_cn": "苏格兰人常称苏格兰为他们的国家，尽管它属于联合王国的一部分。"
    },
    {
      "pos": "noun",
      "explanation_en": "A rural or non-urban area, often used in contrast to cities or towns; synonymous with 'the countryside'.",
      "explanation_cn": "指与城市或城镇相对的乡村地区，常用于强调非都市环境，与 'the countryside' 同义。",
      "example_en": "After years in the city, she moved back to the country to enjoy peace and fresh air.",
      "example_cn": "在城市生活多年后，她回到乡下，享受宁静与新鲜空气。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "nation",
      "analysis": "“Nation”（民族/国家）强调共同的语言、文化、历史和民族认同，不一定拥有独立的政治主权。例如，库尔德人是一个民族（nation），但不是一个国家（country）。而 “country” 更侧重于地理和政治实体，即使其人口由多个民族组成。"
    },
    {
      "word_to_compare": "state",
      "analysis": "“State”（国家/政体）是国际法和政治学中的正式术语，指拥有主权、政府和领土的法律实体。它更强调制度性与合法性，常用于正式语境（如“sovereign state”）。而 “country” 更口语化、通用，常用于日常交流，两者在多数情况下可互换，但 “state” 更具技术性。"
    },
    {
      "word_to_compare": "region",
      "analysis": "“Region”（地区）指地理或文化上具有某种共性的区域，但不具备国家的主权或政府结构。例如，地中海地区、东南亚地区。它比 “country” 范围更广、更模糊，且无政治独立性。"
    }
  ]
}