{
  "word": "counsellor",
  "pronunciation": "koun·sel·er",
  "concise_definition": "n. 顾问, 辅导员, 心理咨询师",
  "forms": {
    "plural": "counsellors",
    "us_spelling": "counselor"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A professional who provides guidance and support to individuals facing personal, emotional, or psychological challenges, helping them explore feelings, make decisions, and develop coping strategies.",
      "explanation_cn": "指为面临个人、情感或心理困扰的个体提供指导与支持的专业人士，帮助他们探索情绪、做出决定并发展应对策略。",
      "example_en": "She saw a school counsellor after her parents' divorce to help her process her emotions.",
      "example_cn": "父母离婚后，她去找学校辅导员，以帮助自己处理情绪。"
    },
    {
      "pos": "noun",
      "explanation_en": "An advisor who offers expert advice in a specific field, such as law, education, or career planning, often within an institutional setting.",
      "explanation_cn": "指在特定领域（如法律、教育或职业规划）提供专业建议的顾问，通常在机构环境中工作。",
      "example_en": "The university counsellor helped me choose the right courses for my degree program.",
      "example_cn": "大学辅导员帮助我为我的学位课程选择了合适的课程。"
    },
    {
      "pos": "noun",
      "explanation_en": "A member of a governing or advisory body, especially in Commonwealth countries, such as a member of the Cabinet.",
      "explanation_cn": "指在英联邦国家中担任政府或咨询机构成员的人，例如内阁成员。",
      "example_en": "The Prime Minister consulted with her senior counsellors before announcing the new policy.",
      "example_cn": "总理在宣布新政策前，咨询了她的高级顾问们。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "therapist",
      "analysis": "“Therapist”（治疗师）通常指接受过临床心理学或精神医学训练、专门从事心理治疗的专业人员，如认知行为治疗师或精神分析治疗师，其工作更侧重于诊断和治疗心理障碍。而 “counsellor” 更侧重于提供短期支持、生活指导和情绪疏导，不一定具备临床诊断资格。"
    },
    {
      "word_to_compare": "advisor",
      "analysis": "“Advisor”（顾问）通常指在专业、学术或行政领域提供策略性建议的人，如财务顾问或学术顾问，其角色更偏向于提供客观建议和解决方案，而非情感支持。而 “counsellor” 更强调倾听、共情和帮助个体自我探索，具有更强的心理支持属性。"
    },
    {
      "word_to_compare": "mentor",
      "analysis": "“Mentor”（导师）通常指经验更丰富的人对较年轻或资历较浅者进行长期指导，侧重于职业发展、人生智慧和榜样作用，关系往往非正式且基于信任。而 “counsellor” 的关系通常是专业、有界限的，以解决特定问题为目标，不强调长期个人纽带。"
    }
  ]
}