{
  "word": "counterpoint",
  "pronunciation": "koun·ter·point",
  "concise_definition": "n. 对位法, 对比, 反论点",
  "forms": {
    "plural": "counterpoints"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "In music, the technique of combining two or more independent melodic lines in a harmonious way, where each line retains its own identity while interacting with the others.",
      "explanation_cn": "在音乐中，指将两条或更多条独立的旋律线以和谐的方式结合在一起，每条旋律线保持自身的独特性，同时与其他旋律相互作用。",
      "example_en": "Bach's fugues are masterpieces of counterpoint, with each voice weaving a complex, independent melody.",
      "example_cn": "巴赫的赋格曲是对位法的杰作，每条声部都编织出复杂而独立的旋律。"
    },
    {
      "pos": "noun",
      "explanation_en": "A contrasting idea, element, or situation that creates a striking difference or balance when placed alongside another.",
      "explanation_cn": "指与另一事物形成鲜明对比或平衡的对立观点、元素或情境，常用于强调差异或丰富整体内涵。",
      "example_en": "The quiet countryside provided a perfect counterpoint to the noise and rush of city life.",
      "example_cn": "宁静的乡村与城市的喧嚣和匆忙形成了完美的对比。"
    },
    {
      "pos": "noun",
      "explanation_en": "An opposing argument or viewpoint presented to challenge or balance a primary position, often in debate or rhetoric.",
      "explanation_cn": "在辩论或修辞中，指为挑战或平衡主要观点而提出的对立论点。",
      "example_en": "Her argument about economic growth was strengthened by the counterpoint that environmental sustainability must not be ignored.",
      "example_cn": "她关于经济增长的论点，因提出了‘不可忽视环境可持续性’这一反论点而更加有力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "contrast",
      "analysis": "“Contrast”（对比）泛指任何两个事物之间的差异，强调的是差异本身，不涉及结构或互动关系。而 “counterpoint” 更强调对立元素之间的动态平衡或相互补充，尤其在音乐和修辞中具有结构性和艺术性。"
    },
    {
      "word_to_compare": "antithesis",
      "analysis": "“Antithesis”（对偶/对立）是修辞学中一种明确的、平行结构的对立表达，如“爱与恨”“光明与黑暗”，通常用于句式对称的修辞手法。而 “counterpoint” 更广泛，可以是思想、情境或旋律的对立，不一定要求句式对称，更注重整体效果而非形式。"
    },
    {
      "word_to_compare": "opposition",
      "analysis": "“Opposition”（对立）侧重于直接的冲突或对抗，常带有负面或敌对含义，如政治对立。而 “counterpoint” 更中性甚至积极，强调互补性与和谐共存，常用于艺术、哲学或文学中表达丰富性而非冲突。"
    }
  ]
}