{
  "word": "courts",
  "pronunciation": "korts",
  "concise_definition": "n. 法院, 法庭, 朝廷, 球场",
  "forms": {
    "singular": "court"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A formal institution or tribunal where legal matters are heard and decided by a judge or jury, operating under the authority of the state.",
      "explanation_cn": "指在国家权威下，由法官或陪审团审理和裁决法律事务的正式机构或法庭。",
      "example_en": "The defendant was found guilty in a federal court.",
      "example_cn": "被告在联邦法院被裁定有罪。"
    },
    {
      "pos": "noun",
      "explanation_en": "The royal household or the group of advisors and attendants surrounding a monarch, especially in historical or ceremonial contexts.",
      "explanation_cn": "指围绕君主的宫廷、皇室随从或顾问集团，尤用于历史或礼仪语境中。",
      "example_en": "The king held lavish parties at his court to display his power.",
      "example_cn": "国王在宫廷举办奢华宴会以展示其权力。"
    },
    {
      "pos": "noun",
      "explanation_en": "A designated area marked for playing a sport such as tennis, basketball, or volleyball, typically with boundaries and a flat surface.",
      "explanation_cn": "指为网球、篮球或排球等运动划定的有界线、表面平整的专用场地。",
      "example_en": "They played a match on the outdoor tennis court.",
      "example_cn": "他们在室外网球场打了一场比赛。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of seeking favor or attention, especially from someone in power or influence; often used in the phrase 'to court someone'.",
      "explanation_cn": "指试图获得某位有权势或有影响力人士的青睐或关注，常用于短语 'to court someone'（争取某人支持）。",
      "example_en": "The company is courting new investors to fund its expansion.",
      "example_cn": "该公司正在争取新投资者以资助其扩张。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tribunal",
      "analysis": "“Tribunal”（法庭/仲裁庭）通常指专门处理特定类型案件（如军事、税务或国际事务）的司法机构，语义更窄、更正式，常用于非普通法体系或国际语境。而 “court” 是通用词，涵盖从地方法院到最高法院的所有层级。"
    },
    {
      "word_to_compare": "palace",
      "analysis": "“Palace”（宫殿）指君主或贵族居住的宏伟建筑，强调物理空间和居住功能；而 “court” 指围绕君主的权力核心群体或活动中心，是政治与社交的集合体，不一定是建筑物本身。"
    },
    {
      "word_to_compare": "arena",
      "analysis": "“Arena”（竞技场）通常指大型露天或室内体育或表演场地，规模更大，用途更广泛（如演唱会、马术比赛），而 “court” 专指有明确边界和规则的运动场地，尺寸较小且标准化。"
    },
    {
      "word_to_compare": "lobby",
      "analysis": "“Lobby”（游说/大堂）指通过私下接触或影响来争取支持的行为，常用于政治语境，与 “court” 在‘争取支持’义项上部分重叠，但 “lobby” 更强调非正式、私下、有策略的施压，而 “court” 可包含公开、正式的示好行为。"
    }
  ]
}