{
  "word": "court",
  "pronunciation": "kawrt",
  "concise_definition": "n. 法院, 朝廷, 球场; v. 争取, 追求, 招致",
  "forms": {
    "plural": "courts",
    "third_person_singular": "courts",
    "past_tense": "courted",
    "past_participle": "courted",
    "present_participle": "courting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A formal institution where legal cases are heard and decided by a judge or jury, operating under established laws and procedures.",
      "explanation_cn": "指依法审理和裁决法律案件的正式机构，由法官或陪审团主持，遵循既定的法律程序。",
      "example_en": "The trial will take place in the federal court next Monday.",
      "example_cn": "审判将于下周一在联邦法院进行。"
    },
    {
      "pos": "noun",
      "explanation_en": "The royal household or the group of advisors and attendants surrounding a monarch, often symbolizing power and influence.",
      "explanation_cn": "指围绕君主的宫廷、随从及顾问群体，常象征权力与影响力。",
      "example_en": "The king held a grand banquet at court to celebrate the treaty.",
      "example_cn": "国王在宫廷举行盛大宴会，以庆祝条约的签订。"
    },
    {
      "pos": "noun",
      "explanation_en": "A designated area where a particular sport, such as tennis or basketball, is played, typically marked with boundaries and lines.",
      "explanation_cn": "指进行特定运动（如网球或篮球）的专用场地，通常有明确的边界和标记线。",
      "example_en": "They played a match on the clay court after school.",
      "example_cn": "他们放学后在红土球场打了一场比赛。"
    },
    {
      "pos": "verb",
      "explanation_en": "To actively seek to gain the favor, support, or affection of someone, often through deliberate and flattering actions.",
      "explanation_cn": "指通过有意识的、讨好的行为积极争取某人的青睐、支持或爱慕。",
      "example_en": "The politician is courting young voters with promises of education reform.",
      "example_cn": "这位政治家通过承诺教育改革来争取年轻选民的支持。"
    },
    {
      "pos": "verb",
      "explanation_en": "To invite or bring about something, often something undesirable, through one's actions or behavior.",
      "explanation_cn": "指通过自己的行为招致某种结果，常指不好的后果。",
      "example_en": "His reckless spending is courting financial disaster.",
      "example_cn": "他挥霍无度，正招致财务灾难。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tribunal",
      "analysis": "“Tribunal”（法庭/审判庭）通常指专门处理特定类型案件（如军事、国际或行政）的司法机构，语义更狭窄、更正式，常用于非普通民事或刑事司法体系。而 “court” 是通用词，涵盖从地方法院到最高法院的所有司法机构。"
    },
    {
      "word_to_compare": "palace",
      "analysis": "“Palace”（宫殿）指君主或贵族居住的宏伟建筑，强调物理空间和奢华；而 “court” 指围绕君主的权力核心群体及其活动，是政治与社交的中心，不一定是建筑物本身。"
    },
    {
      "word_to_compare": "arena",
      "analysis": "“Arena”（竞技场）泛指大型体育或表演活动的场地，通常规模更大、更开放，用于足球、演唱会等；而 “court” 专指有明确边界和规则的运动场地，如网球、篮球场，更小、更标准化。"
    },
    {
      "word_to_compare": "woo",
      "analysis": "“Woo”（追求）与 “court” 在表示追求爱慕时可互换，但 “woo” 更口语化、情感化，常用于浪漫语境；而 “court” 更正式，也可用于政治、商业等非情感语境，如争取支持或选票，语义范围更广。"
    }
  ]
}