{
  "word": "courses",
  "pronunciation": "kawrs·iz",
  "concise_definition": "n. 课程, 路线, 一道菜, 一系列",
  "forms": {
    "singular": "course"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A series of lessons or lectures on a particular subject, typically offered by an educational institution to help students gain knowledge or skills.",
      "explanation_cn": "指由教育机构提供的、围绕某一特定主题的一系列课程或讲座，旨在帮助学生获得知识或技能。",
      "example_en": "She is taking three courses this semester: biology, chemistry, and physics.",
      "example_cn": "这学期她选了三门课程：生物、化学和物理。"
    },
    {
      "pos": "noun",
      "explanation_en": "A route or path taken by a vehicle, athlete, or natural phenomenon, often marked or defined for a specific purpose.",
      "explanation_cn": "指车辆、运动员或自然现象所经过的路线或路径，通常为特定目的而划定或标记。",
      "example_en": "The marathon course runs along the river and through the city park.",
      "example_cn": "马拉松比赛的路线沿着河流穿过城市公园。"
    },
    {
      "pos": "noun",
      "explanation_en": "One of the parts of a meal served in sequence, such as an appetizer, main dish, or dessert.",
      "explanation_cn": "指一餐中按顺序上桌的某一道菜，如开胃菜、主菜或甜点。",
      "example_en": "The restaurant offers a five-course dinner with wine pairing.",
      "example_cn": "这家餐厅提供五道菜的晚餐搭配葡萄酒。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sequence or progression of events, actions, or developments over time.",
      "explanation_cn": "指一段时间内一系列事件、行动或发展的进程。",
      "example_en": "The course of history was changed by that single decision.",
      "example_cn": "那个决定改变了历史的进程。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "class",
      "analysis": "“Class”（班级/课）通常指一次具体的授课或一个教学单位，强调的是教学发生的场景或群体（如‘I have math class at 9 a.m.’）。而 ‘course’ 指的是一个完整的、持续数周或数月的学习计划，包含多个‘class’。"
    },
    {
      "word_to_compare": "program",
      "analysis": "“Program”（项目/课程计划）范围更广，常指包含多个课程、实习、考核等环节的综合性学习或培训体系（如‘a degree program’）。‘Course’ 是构成‘program’的基本单元，而‘program’是更高层级的组织结构。"
    },
    {
      "word_to_compare": "route",
      "analysis": "“Route”（路线）与‘course’在表示路径时部分重叠，但‘route’更强调地理或交通意义上的起点到终点的路径，常用于导航或运输语境。‘Course’除了路径外，还广泛用于教育、饮食、进程等抽象含义，语义更丰富。"
    },
    {
      "word_to_compare": "menu",
      "analysis": "“Menu”（菜单）是列出所有可选菜品的清单，而‘course’是菜单中实际被上桌的某一道菜或某一组菜。‘Menu’是选择的集合，‘course’是执行的环节。"
    }
  ]
}