{
  "word": "crack",
  "pronunciation": "krak",
  "concise_definition": "n. 裂缝, 裂纹; v. 破裂, 破碎, 破解, 爆笑",
  "forms": {
    "third_person_singular": "cracks",
    "past_tense": "cracked",
    "past_participle": "cracked",
    "present_participle": "cracking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A narrow opening or line of division in a solid surface, typically caused by stress, pressure, or damage, which does not fully separate the material.",
      "explanation_cn": "指固体表面因受力、压力或损伤而产生的狭窄缝隙或分界线，但并未使材料完全分离。",
      "example_en": "A small crack in the wall let in a draft of cold air.",
      "example_cn": "墙上的一个小裂缝让冷空气透了进来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To break or cause to break with a sudden, sharp sound, often without complete separation into pieces.",
      "explanation_cn": "指突然发出清脆声响而破裂或使某物破裂，通常不会完全碎成碎片。",
      "example_en": "The ice cracked under the weight of the skater.",
      "example_cn": "冰面在滑冰者的重量下发出咔嚓声裂开了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To solve or decode something complex or encrypted, especially a code, password, or puzzle.",
      "explanation_cn": "指破解或解码复杂或加密的内容，尤其是密码、代码或谜题。",
      "example_en": "The hackers cracked the company’s security system within hours.",
      "example_cn": "黑客在数小时内破解了公司的安全系统。"
    },
    {
      "pos": "verb",
      "explanation_en": "To laugh suddenly and loudly, especially uncontrollably; to break into laughter.",
      "explanation_cn": "指突然大笑，尤其是无法控制地爆笑。",
      "example_en": "The joke was so funny that everyone cracked up.",
      "example_cn": "这个笑话太好笑了，大家都笑得前仰后合。"
    },
    {
      "pos": "noun",
      "explanation_en": "A brief, often humorous or witty remark; a joke or quip.",
      "explanation_cn": "指简短、常带有幽默或机智的言论；一句笑话或俏皮话。",
      "example_en": "He told a few cracks about his boss during lunch.",
      "example_cn": "午餐时他讲了几句关于他老板的俏皮话。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "crack",
      "analysis": "“Crack” 作为名词时指物理上的细小裂缝，与 “gap”（间隙）不同，后者通常指两个物体之间的空隙，不一定由破裂造成；与 “fissure”（裂隙）相比，后者更常用于地质或医学语境，语气更正式、更严重。"
    },
    {
      "word_to_compare": "break",
      "analysis": "“Break” (断裂) 指完全断开或破坏，强调结果的完整性丧失；而 “crack” 仅表示出现裂痕，结构仍部分保持完整。例如，玻璃可以 crack 但未 break，意味着它还能使用。"
    },
    {
      "word_to_compare": "solve",
      "analysis": "“Solve” (解决) 通常用于逻辑问题、数学题或复杂情境，强调通过理性分析得出答案；而 “crack” 在破解密码或系统时更口语化，带有技术性突破或巧妙手段的意味，常用于黑客或情报语境。"
    },
    {
      "word_to_compare": "laugh",
      "analysis": "“Laugh” 是通用词，泛指发出笑声；而 “crack up” 是习语，强调因极度好笑而失控大笑，语气更强烈、更生动，常用于非正式口语。"
    }
  ]
}