{
  "word": "cracker",
  "pronunciation": "krak·er",
  "concise_definition": "n. 苏打饼干, 爆裂声, 黑客, 爆竹",
  "forms": {
    "plural": "crackers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A thin, crisp baked snack, typically made from flour, water, and salt, often eaten with cheese or spreads.",
      "explanation_cn": "一种薄而脆的烘焙小吃，通常由面粉、水和盐制成，常与奶酪或酱料一起食用。",
      "example_en": "She served crackers and cheddar cheese as an afternoon snack.",
      "example_cn": "她下午点心端出了苏打饼干和切达奶酪。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who breaks into computer systems or networks with malicious intent, often to steal data, cause damage, or bypass security measures.",
      "explanation_cn": "指以恶意目的入侵计算机系统或网络的人，通常为窃取数据、造成破坏或绕过安全措施。",
      "example_en": "The company hired cybersecurity experts to defend against crackers trying to access its database.",
      "example_cn": "该公司聘请了网络安全专家，以防范试图访问其数据库的黑客。"
    },
    {
      "pos": "noun",
      "explanation_en": "A loud explosive sound, such as that made by a firework or a whip; also refers to a small explosive device that makes such a sound.",
      "explanation_cn": "指爆裂声，如烟花或鞭炮发出的声音；也可指能发出这种声音的小型爆炸物。",
      "example_en": "The crowd cheered as the cracker exploded in the night sky.",
      "example_cn": "当爆竹在夜空中炸响时，人群欢呼起来。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slang term, especially in American English, for a white person, sometimes used in a derogatory or ironic context.",
      "explanation_cn": "美国英语中的俚语，指白人，有时带有贬义或反讽意味。",
      "example_en": "The term 'cracker' was used in the film to highlight racial tensions in the rural South.",
      "example_cn": "这部电影中使用了 'cracker' 一词，以突出美国南方农村地区的种族紧张关系。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "biscuit",
      "analysis": "“Biscuit”（饼干）在英式英语中常指软质或蓬松的烘焙点心，而 “cracker” 则特指硬脆、低水分的咸味饼干。两者虽同为零食，但质地、口感和食用场景不同：cracker 更适合搭配奶酪或汤品，biscuit 则常作为甜点或早餐食用。"
    },
    {
      "word_to_compare": "hacker",
      "analysis": "“Hacker”（黑客）是一个更广泛术语，泛指精通计算机技术的人，可能出于好奇、研究或善意目的（白帽黑客）；而 “cracker” 特指从事非法入侵、破坏或窃取的恶意黑客。在技术语境中，cracker 是 hacker 的一个负面子集。"
    },
    {
      "word_to_compare": "firecracker",
      "analysis": "“Firecracker”（爆竹）是 “cracker” 在爆炸物语境下的具体化形式，专指用于庆祝活动的小型爆炸物。而 “cracker” 本身可泛指任何爆裂声或小型爆炸装置，语义更广，也可用于非物理的比喻用法（如 ‘a real cracker of a joke’）。"
    }
  ]
}