{
  "word": "cracking",
  "pronunciation": "krak·ing",
  "concise_definition": "adj. 极好的, 了不起的; n. 爆裂声, 开裂; v. 破解, 打破",
  "forms": {
    "base_form": "crack",
    "third_person_singular": "cracks",
    "past_tense": "cracked",
    "past_participle": "cracked",
    "present_participle": "cracking"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Used informally to describe something excellent, impressive, or highly enjoyable, often in British English.",
      "explanation_cn": "非正式用语，用于形容某事物极好、令人印象深刻或非常有趣，常见于英式英语。",
      "example_en": "That was a cracking performance — the audience stood up and cheered!",
      "example_cn": "那是一场精彩的演出——观众都起立鼓掌了！"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden sharp sound made by something breaking or splitting, such as a whip or a twig.",
      "explanation_cn": "指某物突然断裂或分裂时发出的清脆响声，如鞭子或树枝断裂的声音。",
      "example_en": "The cracking of the whip echoed through the silent forest.",
      "example_cn": "鞭子的爆裂声在寂静的森林中回荡。"
    },
    {
      "pos": "noun",
      "explanation_en": "A narrow opening or line formed when something breaks or splits, often due to stress or age.",
      "explanation_cn": "指因压力或老化导致物体破裂时形成的细缝或裂纹。",
      "example_en": "A small crack in the wall revealed moisture damage behind it.",
      "example_cn": "墙上的细小裂纹暴露了背后的潮湿损坏。"
    },
    {
      "pos": "verb",
      "explanation_en": "To break or cause to break suddenly, often with a sharp sound, without completely separating into pieces.",
      "explanation_cn": "指突然破裂或使某物破裂，常伴有清脆响声，但不一定完全碎裂。",
      "example_en": "The ice on the lake began to crack under the weight of the snow.",
      "example_cn": "湖面上的冰在积雪的重压下开始开裂。"
    },
    {
      "pos": "verb",
      "explanation_en": "To solve a difficult problem, especially a code, password, or encrypted system, often illegally or through technical skill.",
      "explanation_cn": "指破解一个难题，尤其是密码、加密系统或代码，通常通过技术手段，有时是非法的。",
      "example_en": "The hacker spent months cracking the government’s encrypted database.",
      "example_cn": "这名黑客花了数月时间破解了政府的加密数据库。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "breaking",
      "analysis": "“Breaking” (断裂) 更侧重于物理上的完全断裂或破坏，常用于描述结构失效或物品损毁，如“breaking a glass”。而 “cracking” 强调的是出现裂纹或初步破裂，尚未完全断开，具有渐进性和局部性。"
    },
    {
      "word_to_compare": "excellent",
      "analysis": "“Excellent” (极好的) 是标准正式的褒义形容词，用于评价质量、表现或水平。而 “cracking” 作为形容词是口语化、非正式的表达，带有情感色彩和地域性（英式英语），语气更生动、活泼，常用于日常称赞，如 “a cracking joke”。"
    },
    {
      "word_to_compare": "decoding",
      "analysis": "“Decoding” (解码) 是一个中性技术术语，指将编码信息还原为原始形式的过程，通常合法且系统化。而 “cracking” 在技术语境中隐含非法或突破安全机制的意味，带有更强的对抗性和技术挑战性，如 “cracking a password” 暗示绕过保护。"
    }
  ]
}