{
  "word": "cradle",
  "pronunciation": "krey·duhl",
  "concise_definition": "n. 摇篮, 发源地; v. 抚抱, 抱在怀中",
  "forms": {
    "plural": "cradles",
    "third_person_singular": "cradles",
    "past_tense": "cradled",
    "past_participle": "cradled",
    "present_participle": "cradling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small bed for a baby, typically with high sides and designed to rock gently, providing comfort and safety during sleep.",
      "explanation_cn": "一种专为婴儿设计的小床，通常有高侧栏，可轻轻摇晃，为婴儿提供睡眠时的舒适与安全。",
      "example_en": "The newborn was gently placed in a wooden cradle by the fireplace.",
      "example_cn": "新生儿被轻轻放在壁炉旁的木制摇篮里。"
    },
    {
      "pos": "noun",
      "explanation_en": "The place or environment where something originates or begins to develop, often used metaphorically to describe the birthplace of a culture, idea, or movement.",
      "explanation_cn": "指某事物起源或萌芽的地方或环境，常用于比喻文化、思想或运动的发源地。",
      "example_en": "The Nile River valley is considered the cradle of ancient Egyptian civilization.",
      "example_cn": "尼罗河谷被认为是古埃及文明的发源地。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hold or support something gently and protectively, especially in the arms, as if cradling a baby.",
      "explanation_cn": "温柔地、保护性地抱持某物，尤指像抱着婴儿一样用双臂环抱。",
      "example_en": "She cradled the injured bird in her hands, trying to calm it.",
      "example_cn": "她用双手轻轻抱着受伤的小鸟，试图安抚它。"
    },
    {
      "pos": "verb",
      "explanation_en": "To support or enclose something in a way that provides stability or protection, often referring to mechanical or structural contexts.",
      "explanation_cn": "以提供稳定或保护的方式支撑或围住某物，常用于机械或结构语境中。",
      "example_en": "The engine is cradled in a reinforced frame to reduce vibrations.",
      "example_cn": "发动机被安装在一个加固的支架中，以减少震动。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cot",
      "analysis": "“Cot”（小床）通常指一种简单、坚固、无摇动功能的儿童床，多用于营地或临时使用，强调实用性而非舒适性。而 “cradle” 特指可摇晃的婴儿床，带有安抚和亲密的情感色彩，专用于新生儿。"
    },
    {
      "word_to_compare": "birthplace",
      "analysis": "“Birthplace”（出生地）是“cradle”作为“发源地”含义时的近义词，但 “birthplace” 更中性、更常用于地理或历史语境，如国家或城市；而 “cradle” 更具诗意和象征性，常用于文学或文化语境，带有孕育、滋养的隐喻意味。"
    },
    {
      "word_to_compare": "embrace",
      "analysis": "“Embrace”（拥抱）强调情感上的接纳或支持，动作更开放、更广泛，可用于抽象概念（如拥抱变化）；而 “cradle” 的拥抱动作更轻柔、更保护性，常伴随物理支撑，多用于具体对象（如婴儿、乐器、机械部件），动作范围更小、更细致。"
    }
  ]
}