{
  "word": "craft",
  "pronunciation": "kræft",
  "concise_definition": "n. 工艺, 技艺, 行业; v. 精心制作, 精心策划",
  "forms": {
    "plural": "crafts",
    "third_person_singular": "crafts",
    "past_tense": "crafted",
    "past_participle": "crafted",
    "present_participle": "crafting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A skill or art, especially one involving manual dexterity, such as making objects by hand using traditional techniques.",
      "explanation_cn": "指一种技能或艺术，尤其指通过手工运用传统技术制作物品的能力，如陶艺、编织、木工等。",
      "example_en": "She specializes in traditional Irish crafts like lace-making and pottery.",
      "example_cn": "她专精于爱尔兰传统工艺，如刺绣和陶器制作。"
    },
    {
      "pos": "noun",
      "explanation_en": "A vehicle designed for travel on water, air, or space, especially one that is small or specialized.",
      "explanation_cn": "指用于水上、空中或太空航行的交通工具，尤指小型或专用的飞行器或船只。",
      "example_en": "The spacecraft will land on Mars next year.",
      "example_cn": "这艘宇宙飞船将于明年登陆火星。"
    },
    {
      "pos": "noun",
      "explanation_en": "A particular profession or trade, especially one requiring specialized skills.",
      "explanation_cn": "指某一特定职业或行业，尤其是需要专门技能的行业。",
      "example_en": "He comes from a family of carpenters — it's a craft passed down through generations.",
      "example_cn": "他来自一个木匠世家——这是一门代代相传的手艺。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make or create something carefully and skillfully, often with attention to detail and artistic quality.",
      "explanation_cn": "指精心细致地制作或创造某物，通常注重细节和艺术品质。",
      "example_en": "The poet crafted each line with precision and emotion.",
      "example_cn": "这位诗人以精准与情感精心雕琢每一行诗句。"
    },
    {
      "pos": "verb",
      "explanation_en": "To devise or plan something carefully, especially in a clever or subtle way, often to achieve a specific purpose.",
      "explanation_cn": "指精心策划或设计某事，常以巧妙或隐晦的方式达成特定目的。",
      "example_en": "They crafted a strategy to win over the skeptical investors.",
      "example_cn": "他们精心策划了一项策略，以争取那些持怀疑态度的投资者。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "skill",
      "analysis": "“Skill” (技能) 是一个更广泛的术语，泛指完成某项任务的能力，可以是天生的或后天习得的，不限于手工或艺术领域。而 “craft” 更强调通过长期实践形成的、具有传统或美学价值的技艺，常与手工制作或专业行业相关。"
    },
    {
      "word_to_compare": "art",
      "analysis": "“Art” (艺术) 通常指具有审美价值、表达情感或思想的创造性活动，更侧重于主观表达和灵感。而 “craft” 更注重技术性、实用性和制作过程的精确性，虽然两者常重叠，但 “craft” 更偏向‘做’，而 ‘art’ 更偏向‘表达’。"
    },
    {
      "word_to_compare": "make",
      "analysis": "“Make” (制作) 是一个通用动词，指任何类型的创造或生产，语义宽泛，不强调技巧或用心程度。而 “craft” 暗示了高度的专注、技艺和对细节的关注，带有更强烈的精心雕琢意味。例如，你可以说 ‘make a sandwich’，但不会说 ‘craft a sandwich’，除非是高端料理中的艺术化呈现。"
    }
  ]
}