{
  "word": "crank",
  "pronunciation": "krangk",
  "concise_definition": "n. 曲柄, 怪人; v. 转动, 摇动",
  "forms": {
    "third_person_singular": "cranks",
    "past_tense": "cranked",
    "past_participle": "cranked",
    "present_participle": "cranking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A lever or handle attached to a rotating shaft, used to convert circular motion into linear motion or vice versa, commonly found in mechanical devices such as engines or hand-operated tools.",
      "explanation_cn": "连接在旋转轴上的杠杆或手柄，用于将圆周运动转化为直线运动，或反之，常见于发动机或手动工具等机械装置中。",
      "example_en": "He turned the crank to start the old generator.",
      "example_cn": "他转动曲柄以启动那台老式发电机。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who holds eccentric, obsessive, or unreasonable beliefs, often with great enthusiasm and little regard for evidence or social norms.",
      "explanation_cn": "指持有古怪、偏执或不合理的信念的人，通常充满热情，却无视证据或社会规范。",
      "example_en": "The newspaper labeled him a crank for insisting the Earth is flat.",
      "example_cn": "报纸称他为怪人，因为他坚持认为地球是平的。"
    },
    {
      "pos": "verb",
      "explanation_en": "To turn a crank or handle, especially to operate a mechanical device by hand.",
      "explanation_cn": "转动曲柄或手柄，尤指用手操作某种机械装置。",
      "example_en": "She cranked the window open to let in some fresh air.",
      "example_cn": "她摇动手柄把窗户摇开了，好让新鲜空气进来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To force or push something with persistent, often frantic effort, especially to make it work or function.",
      "explanation_cn": "以持续、常常是急切的努力去推动或迫使某物运作或生效，常用于非正式语境。",
      "example_en": "He cranked up the volume until the neighbors complained.",
      "example_cn": "他把音量调到最大，直到邻居们抱怨起来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "handle",
      "analysis": "“Handle”（把手）泛指任何用于抓握或操作的部件，不一定是用于转动的；而 “crank” 特指用于旋转操作的杠杆，具有明确的机械功能。一个把手可以是直的，但曲柄一定是弯曲或偏心的，以产生旋转运动。"
    },
    {
      "word_to_compare": "nutcase",
      "analysis": "“Nutcase”（疯子）是口语中对精神异常或极端怪异者的一种贬义称呼，语气更粗俗、情绪化；而 “crank” 虽也含贬义，但更侧重于其固执的、非主流的信念体系，常用于描述有系统性怪论的理论家，而非纯粹的精神失常者。"
    },
    {
      "word_to_compare": "turn",
      "analysis": "“Turn”（转动）是通用动词，指任何方向的旋转动作，不涉及工具；而 “crank” 作为动词时，特指通过曲柄或手柄进行的、带有机械力的转动，隐含持续用力或费劲的意味，如 “crank up the volume” 比 “turn up the volume” 更强调费力和急切。"
    }
  ]
}