{
  "word": "crashed",
  "pronunciation": "krash·ed",
  "concise_definition": "v. 坠毁, 猛撞, 崩溃, 突然失败",
  "forms": {
    "base_form": "crash",
    "third_person_singular": "crashes",
    "present_participle": "crashing",
    "past_tense": "crashed",
    "past_participle": "crashed"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To collide violently with a surface or object, typically resulting in damage or destruction, especially referring to vehicles, aircraft, or machinery.",
      "explanation_cn": "指车辆、飞机或机械等与表面或物体发生剧烈碰撞，通常导致损坏或毁坏。",
      "example_en": "The plane crashed into the mountainside during the storm.",
      "example_cn": "飞机在风暴中撞上了山坡。"
    },
    {
      "pos": "verb",
      "explanation_en": "To suddenly fail or stop functioning, especially in the context of computer systems, markets, or organizations.",
      "explanation_cn": "指系统、市场或组织突然崩溃或停止运行，常用于技术或经济语境。",
      "example_en": "The website crashed under the weight of too many users at once.",
      "example_cn": "网站因同时访问用户过多而崩溃了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To attend or enter a social event uninvited, often in a disruptive or unexpected manner.",
      "explanation_cn": "指未经邀请而突然闯入社交活动，通常带有干扰或出人意料的性质。",
      "example_en": "A group of fans crashed the celebrity's private party.",
      "example_cn": "一群粉丝闯入了这位名人的私人聚会。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fall or drop suddenly and noisily, often due to loss of support or structure.",
      "explanation_cn": "指因失去支撑或结构而突然、响亮地坠落或倒塌。",
      "example_en": "The bookshelf crashed to the floor when the wall anchor gave way.",
      "example_cn": "当墙上的固定件松脱时，书架轰然倒在地上。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "collide",
      "analysis": "“Collide” (碰撞) 侧重于两个或多个物体之间的相互撞击，强调接触的物理动作，但不一定导致破坏。而 “crashed” 更强调碰撞后的严重后果，如损坏、毁灭或系统性失败，语义更强烈。"
    },
    {
      "word_to_compare": "fail",
      "analysis": "“Fail” (失败) 是一个广泛使用的词，泛指未能达成目标，可以是渐进的或轻微的失败。而 “crashed” 描述的是突然、剧烈、灾难性的失败，尤其在技术或经济语境中，带有更强的冲击感和不可逆性。"
    },
    {
      "word_to_compare": "collapse",
      "analysis": "“Collapse” (坍塌/崩溃) 通常指结构或系统因内部压力或支撑丧失而逐渐或突然瓦解，常用于建筑、经济或身体机能。而 “crashed” 更强调外部冲击或突发性事件导致的破坏，动作更迅猛，常伴随声音或视觉冲击。"
    }
  ]
}