{
  "word": "crash",
  "pronunciation": "krash",
  "concise_definition": "v. 坠毁, 碰撞, 猛撞; n. 坠毁, 碰撞, 崩盘",
  "forms": {
    "third_person_singular": "crashes",
    "past_tense": "crashed",
    "past_participle": "crashed",
    "present_participle": "crashing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To collide violently with a solid object, often resulting in damage or destruction, especially in the context of vehicles or aircraft.",
      "explanation_cn": "指车辆或飞机等与坚固物体发生剧烈碰撞，通常导致损坏或毁坏。",
      "example_en": "The car crashed into a tree after losing control on the icy road.",
      "example_cn": "汽车在结冰的道路上失控后撞上了一棵树。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fail suddenly and dramatically, especially in the context of financial markets, computer systems, or organizations.",
      "explanation_cn": "指（金融市场的崩盘、计算机系统的崩溃或组织的瓦解）突然且剧烈地失败。",
      "example_en": "The stock market crashed after the announcement of the economic crisis.",
      "example_cn": "经济危机宣布后，股市崩盘了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To enter a place or event uninvited, often in a noisy or disruptive manner.",
      "explanation_cn": "指未经邀请而喧闹或干扰性地闯入某个地方或活动。",
      "example_en": "A group of fans crashed the party and started dancing on the table.",
      "example_cn": "一群粉丝未经邀请闯入派对，开始在桌子上跳舞。"
    },
    {
      "pos": "noun",
      "explanation_en": "A violent collision between two or more objects, especially vehicles or aircraft, often resulting in serious damage or injury.",
      "explanation_cn": "指两个或多个物体（尤其是车辆或飞机）之间的剧烈碰撞，通常导致严重损坏或伤亡。",
      "example_en": "The plane crash killed all 157 passengers on board.",
      "example_cn": "这次空难导致机上157名乘客全部遇难。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden and severe collapse or failure, especially in financial markets or digital systems.",
      "explanation_cn": "指金融市场的突然严重崩溃或数字系统的彻底失败。",
      "example_en": "The 2008 financial crash led to a global recession.",
      "example_cn": "2008年的金融危机引发了全球衰退。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "collision",
      "analysis": "“Collision” (碰撞) 是一个更中性、更技术性的术语，常用于法律、物理或工程语境，强调两个物体接触的物理事件本身，不必然包含破坏或失败的含义。而 “crash” 更强调破坏性后果和突发性，常带有情感色彩，如震惊或灾难感。"
    },
    {
      "word_to_compare": "collapse",
      "analysis": "“Collapse” (坍塌/崩溃) 通常指因内部结构失效而发生的缓慢或突然的崩塌，如建筑物倒塌、系统崩溃，强调的是“内部瓦解”而非外部冲击。而 “crash” 更常由外部力量引发，如车祸、股市崩盘，强调的是“剧烈冲击”或“瞬间失败”。"
    },
    {
      "word_to_compare": "accident",
      "analysis": "“Accident” (事故) 是一个更宽泛的术语，泛指任何非故意的不幸事件，可能包括滑倒、烧伤、坠落等，不一定涉及高速或剧烈撞击。而 “crash” 特指高速、高能量的撞击事件，通常具有破坏性，语义范围更窄、更具体。"
    }
  ]
}