{
  "word": "crashing",
  "pronunciation": "krash·ing",
  "concise_definition": "v. 猛撞, 崩溃, 突然下跌; adj. 破坏性的, 巨大的",
  "forms": {
    "base_form": "crash",
    "third_person_singular": "crashes",
    "past_tense": "crashed",
    "past_participle": "crashed",
    "present_participle": "crashing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To collide violently with something, often resulting in damage or destruction, typically referring to vehicles, aircraft, or objects in motion.",
      "explanation_cn": "指以猛烈的撞击与某物相撞，通常导致损坏或毁灭，常用于描述车辆、飞机或运动中的物体。",
      "example_en": "The car was crashing into the tree at high speed.",
      "example_cn": "那辆汽车正以高速撞向树木。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fail suddenly and completely, especially in the context of financial markets, computer systems, or organizations.",
      "explanation_cn": "指突然且彻底地失败，尤其用于金融市场的崩盘、计算机系统的崩溃或组织的瓦解。",
      "example_en": "The stock market crashed after the announcement of the economic crisis.",
      "example_cn": "经济危机宣布后，股市崩盘了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To enter a place or event noisily or uninvited, often in a disruptive or overwhelming manner.",
      "explanation_cn": "指喧闹地、未经邀请地闯入某个地方或活动，通常带有干扰或压倒性的态势。",
      "example_en": "Guests were crashing the party without invitations.",
      "example_cn": "一些人未经邀请就闯入了派对。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used informally to describe something extremely large, intense, or overwhelming, often in a positive or emphatic sense.",
      "explanation_cn": "非正式用法，形容某事物极其庞大、强烈或压倒性的，常带有积极或强调的语气。",
      "example_en": "She gave a crashing performance that left the audience speechless.",
      "example_cn": "她献上了一场惊人的表演，令观众哑口无言。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "collide",
      "analysis": "“Collide” (碰撞) 侧重于两个或多个物体在运动中发生物理接触，强调接触本身，不必然包含破坏性后果。而 “crashing” 更强调撞击的猛烈性、破坏性和突发性，常带有情感色彩和严重后果。"
    },
    {
      "word_to_compare": "collapse",
      "analysis": "“Collapse” (坍塌/崩溃) 指结构或系统因内部压力或弱点而突然瓦解，通常是缓慢积累后的结果，如建筑倒塌或政府崩溃。而 “crashing” 更强调外部冲击或突发性失败，如股市暴跌或飞机坠毁，更具动态和暴力感。"
    },
    {
      "word_to_compare": "intrude",
      "analysis": "“Intrude” (闯入) 指未经允许进入某个私人或受限制的空间，语气较温和，常含冒犯之意，但不强调喧闹或破坏。而 “crashing” 在此语境下不仅表示闯入，还带有喧闹、鲁莽、甚至破坏性的意味，如 ‘crashing a party’ 比 ‘intruding on a party’ 更具戏剧性和冲击力。"
    }
  ]
}