{
  "word": "crease",
  "pronunciation": "kreez",
  "concise_definition": "n. 折痕, 线痕; v. 使起皱, 使有折痕",
  "forms": {
    "plural": "creases",
    "third_person_singular": "creases",
    "past_tense": "creased",
    "past_participle": "creased",
    "present_participle": "creasing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long, narrow line or ridge formed by folding or pressing, especially in fabric, paper, or skin.",
      "explanation_cn": "通过折叠或按压形成的细长线状或脊状痕迹，尤指在布料、纸张或皮肤上。",
      "example_en": "She smoothed out the creases in her dress before the meeting.",
      "example_cn": "她在会议前把裙子上的褶皱抚平了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A natural line or mark on the skin, especially one formed by aging, such as a wrinkle on the forehead or around the eyes.",
      "explanation_cn": "皮肤上因老化而自然形成的线条或痕迹，例如额头或眼角的皱纹。",
      "example_en": "His deep creases told the story of a life full of hardship.",
      "example_cn": "他脸上的深深皱纹诉说着饱经风霜的一生。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a long, narrow line or ridge in a surface by folding, pressing, or bending, especially in material like cloth or paper.",
      "explanation_cn": "通过折叠、按压或弯曲，在表面（尤指布料或纸张）上形成一条细长的线或脊状痕迹。",
      "example_en": "Be careful not to crease the important document when you fold it.",
      "example_cn": "折叠这份重要文件时，小心别弄出折痕。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form wrinkles or lines on the skin, especially due to age, emotion, or repeated movement.",
      "explanation_cn": "因年龄、情绪或反复动作而在皮肤上形成皱纹或线条。",
      "example_en": "Smiling frequently has creased her face around the eyes.",
      "example_cn": "经常微笑使她眼角出现了皱纹。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "wrinkle",
      "analysis": "“Wrinkle” (皱纹) 通常指皮肤上因老化或表情而形成的细小、不规则的褶皱，多用于描述人或有机物表面；而 “crease” 更强调由外力折叠或压出的清晰、规则的线状痕迹，可用于布料、纸张等硬质材料，语义范围更广。"
    },
    {
      "word_to_compare": "fold",
      "analysis": "“Fold” (折叠) 是一个动作，指将物体弯曲成两层或多层；而 “crease” 是折叠后留下的结果——即折痕。前者是过程，后者是产物。例如：You fold the paper, and it leaves a crease. "
    },
    {
      "word_to_compare": "line",
      "analysis": "“Line” (线) 是一个泛指的几何或视觉痕迹，可以是画出来的、自然形成的或抽象的；而 “crease” 特指由物理压力或折叠产生的三维凹陷痕迹，具有明确的物理形态和触感，语义更具体。"
    }
  ]
}