{
  "word": "cream",
  "pronunciation": "kree·um",
  "concise_definition": "n. 奶油, 乳脂; 精华, 最佳部分; v. 使形成奶油状, 击败",
  "forms": {
    "plural": "creams",
    "third_person_singular": "creams",
    "past_tense": "creamed",
    "past_participle": "creamed",
    "present_participle": "creaming"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A thick, rich, yellowish-white substance made from the fatty layer of milk, used in cooking, baking, or as a topping.",
      "explanation_cn": "从牛奶中分离出的浓稠、富含脂肪的淡黄色物质，常用于烹饪、烘焙或作为甜点的浇头。",
      "example_en": "She added a spoonful of heavy cream to her coffee.",
      "example_cn": "她在咖啡里加了一勺重奶油。"
    },
    {
      "pos": "noun",
      "explanation_en": "A smooth, thick cosmetic or medicinal preparation applied to the skin, often for moisturizing or treating conditions.",
      "explanation_cn": "一种用于皮肤的光滑浓稠化妆品或药膏，常用于保湿或治疗皮肤问题。",
      "example_en": "He applied a soothing cream to his sunburned skin.",
      "example_cn": "他把一种舒缓霜涂在晒伤的皮肤上。"
    },
    {
      "pos": "noun",
      "explanation_en": "The best or most desirable part of something, often used metaphorically to refer to the most talented or successful individuals in a group.",
      "explanation_cn": "某事物中最优秀或最理想的部分，常用于比喻群体中最杰出或最有能力的人。",
      "example_en": "Only the cream of the crop were selected for the prestigious scholarship.",
      "example_cn": "只有最优秀的人才被选中获得这项声望卓著的奖学金。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove the fatty layer (cream) from milk or to cause something to form a creamy texture.",
      "explanation_cn": "从牛奶中分离出奶油层，或使某物形成奶油状质地。",
      "example_en": "The milk was left to sit so the cream could rise to the top.",
      "example_cn": "牛奶被静置，以便奶油浮到顶部。"
    },
    {
      "pos": "verb",
      "explanation_en": "To defeat someone decisively or thoroughly, especially in a competition or argument.",
      "explanation_cn": "在竞赛或争论中彻底击败某人。",
      "example_en": "Our team creamed them in the final match, winning 8–1.",
      "example_cn": "我们在决赛中以8比1大胜对手。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "butter",
      "analysis": "“Butter” (黄油) 是由奶油进一步加工制成的固体脂肪，通常经过搅拌和盐渍，质地更硬，用于涂抹或烹饪。而 “cream” 是液态或半液态的乳脂，脂肪含量较低，口感更轻盈，常用于饮品或甜点增稠。"
    },
    {
      "word_to_compare": "lotion",
      "analysis": "“Lotion” (乳液) 通常比 “cream” 更稀薄、含水量更高，适合油性皮肤或日常保湿；而 “cream” 更浓稠、油脂含量更高，适合干性皮肤或需要强效滋润的场合。两者都是护肤品，但质地和用途有明显区别。"
    },
    {
      "word_to_compare": "essence",
      "analysis": "“Essence” (精华) 指某物最核心、最本质的部分，常用于抽象语境（如‘艺术的精华’），而 ‘cream’ 作为‘精华’的比喻用法更偏向于‘最优秀的人或物’，带有社会筛选或等级意味，更具形象性和口语化。"
    }
  ]
}