{
  "word": "credits",
  "pronunciation": "kred·its",
  "concise_definition": "n. 荣誉, 学分, 贷款, 字幕",
  "forms": {
    "singular": "credit"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A list of people who contributed to a film, television show, book, or other creative work, typically displayed at the beginning or end of the production.",
      "explanation_cn": "指在电影、电视节目、书籍或其他创意作品中参与制作的人员名单，通常显示在作品的开头或结尾。",
      "example_en": "The credits rolled slowly as the audience waited to see if there was a post-credits scene.",
      "example_cn": "字幕缓缓滚动，观众等待着是否会有片尾彩蛋。"
    },
    {
      "pos": "noun",
      "explanation_en": "Academic units awarded for completing a course or program, used to measure progress toward a degree.",
      "explanation_cn": "指完成一门课程或项目后所获得的学术学分，用于衡量获得学位的进展。",
      "example_en": "She needs 120 credits to graduate with a bachelor’s degree.",
      "example_cn": "她需要修满120个学分才能获得学士学位。"
    },
    {
      "pos": "noun",
      "explanation_en": "Recognition or praise given to someone for their achievements or contributions.",
      "explanation_cn": "指因某人的成就或贡献而给予的赞誉或认可。",
      "example_en": "He deserves full credit for designing the successful marketing campaign.",
      "example_cn": "他设计了成功的营销活动，理应获得全部赞誉。"
    },
    {
      "pos": "noun",
      "explanation_en": "An amount of money or financial value that is added to an account, often in contrast to a debit.",
      "explanation_cn": "指存入账户的金额或财务价值，与借方（debit）相对。",
      "example_en": "My bank statement shows a credit of $500 from my salary deposit.",
      "example_cn": "我的银行对账单显示了500美元的工资入账。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "acknowledgment",
      "analysis": "“Acknowledgment”（致谢）通常指在作品或文本中简短提及对他人帮助的感谢，形式较轻，不一定是正式名单；而 “credits” 是系统性、正式列出所有贡献者，常用于影视、出版等专业领域。"
    },
    {
      "word_to_compare": "points",
      "analysis": "“Points”（分数/积分）常用于评分系统或游戏机制中，强调数量和累积；而 “credits” 在教育语境中特指官方认可的学术单位，具有制度性和规范性，不能随意替换。"
    },
    {
      "word_to_compare": "debit",
      "analysis": "“Debit”（借方）是财务术语，表示账户的支出或负债增加，与 “credit” 在会计中互为对立概念。虽然两者都属于金融记录，但 “credits” 作为名词复数时更常用于指代荣誉、学分或字幕，而非仅限于财务含义。"
    }
  ]
}