{
  "word": "credit",
  "pronunciation": "kred·it",
  "concise_definition": "n. 信用, 声誉, 学分, 赞誉; v. 给予信用, 归功于",
  "forms": {
    "plural": "credits",
    "third_person_singular": "credits",
    "past_tense": "credited",
    "past_participle": "credited",
    "present_participle": "crediting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The ability to obtain goods or services before payment, based on the trust that payment will be made in the future; often assessed by financial institutions.",
      "explanation_cn": "指在承诺未来付款的前提下，先获得商品或服务的能力；通常由金融机构评估。",
      "example_en": "She has excellent credit and was approved for a low-interest loan.",
      "example_cn": "她的信用记录极佳，因此获得了低息贷款的批准。"
    },
    {
      "pos": "noun",
      "explanation_en": "Recognition or praise given to someone for an achievement, contribution, or role in a project.",
      "explanation_cn": "指因某人的成就、贡献或在项目中的角色而给予的赞誉或认可。",
      "example_en": "The film's success was due in large part to the director's vision — full credit goes to her.",
      "example_cn": "这部电影的成功在很大程度上归功于导演的远见——全部荣誉应归于她。"
    },
    {
      "pos": "noun",
      "explanation_en": "A unit of academic measurement awarded for the completion of a course, used to determine progress toward a degree.",
      "explanation_cn": "指完成一门课程后所获得的学术计量单位，用于衡量向学位目标的进展。",
      "example_en": "To graduate, students must earn at least 120 credits.",
      "example_cn": "学生必须修满至少120个学分才能毕业。"
    },
    {
      "pos": "verb",
      "explanation_en": "To assign praise, recognition, or responsibility to someone for an achievement or action.",
      "explanation_cn": "指将成就或行为的荣誉或责任归于某人。",
      "example_en": "The album was credited to the band's lead singer, though others contributed significantly.",
      "example_cn": "这张专辑署名为乐队主唱，尽管其他人也做出了重要贡献。"
    },
    {
      "pos": "verb",
      "explanation_en": "To record an amount of money as a deposit or addition to an account, increasing its balance.",
      "explanation_cn": "指将一笔款项记入账户，增加其余额。",
      "example_en": "The bank credited $500 to my account yesterday.",
      "example_cn": "银行昨天将500美元记入了我的账户。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "debt",
      "analysis": "“Debt” (债务) 是 “credit” 的反义词，指欠下的金钱或义务，而 “credit” 指可获得的信用额度或已获得的声誉。两者在金融语境中构成对立关系：credit 是资产，debt 是负债。"
    },
    {
      "word_to_compare": "reputation",
      "analysis": "“Reputation” (声誉) 是一个更广泛、更长期的社会评价，涵盖一个人或组织的整体形象；而 “credit” 在作为‘赞誉’时，通常指向具体事件或成就的公开认可，更具针对性和即时性。"
    },
    {
      "word_to_compare": "acknowledge",
      "analysis": "“Acknowledge” (承认) 强调对事实、存在或责任的认知，不一定包含赞美；而 “credit” 在动词用法中，不仅承认，还主动赋予荣誉或功劳，带有积极评价色彩。例如：I acknowledge your effort ≠ I credit you for your effort. 后者更强调归属与嘉奖。"
    }
  ]
}