{
  "word": "creeps",
  "pronunciation": "kreeps",
  "concise_definition": "n. 讨厌的人, 令人不安的人; v. 缓慢移动, 爬行, 悄悄行动",
  "forms": {
    "singular": "creep",
    "third_person_singular": "creeps",
    "past_tense": "crept",
    "past_participle": "crept",
    "present_participle": "creeping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who is considered unpleasant, strange, or socially inappropriate, often due to obsessive, suspicious, or predatory behavior.",
      "explanation_cn": "指行为令人不快、古怪或不合社会规范的人，通常因其痴迷、可疑或具有掠夺性的行为而令人反感。",
      "example_en": "That guy who keeps staring at you across the room is such a creep.",
      "example_cn": "那个一直隔着房间盯着你的人真是个令人讨厌的家伙。"
    },
    {
      "pos": "noun",
      "explanation_en": "A feeling of unease or discomfort that spreads slowly, often in response to something eerie or unsettling.",
      "explanation_cn": "指一种缓慢蔓延的不安或不适感，通常由某种诡异或令人不安的事物引发。",
      "example_en": "There was a creep running down my spine when I heard the whisper in the dark.",
      "example_cn": "当我听到黑暗中的低语时，一股寒意顺着脊背爬了上来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move slowly and carefully, often in a stealthy or cautious manner, typically on hands and knees or with minimal noise.",
      "explanation_cn": "指缓慢而谨慎地移动，通常以四肢着地或悄无声息的方式，常带有隐蔽或小心的意味。",
      "example_en": "The cat crept silently toward the bird perched on the fence.",
      "example_cn": "猫悄无声息地向停在篱笆上的鸟爬去。"
    },
    {
      "pos": "verb",
      "explanation_en": "To progress gradually or imperceptibly over time, often in a negative or unwanted way.",
      "explanation_cn": "指随着时间推移缓慢而难以察觉地发展，常带有负面或不受欢迎的含义。",
      "example_en": "Doubt began to creep into her mind as the evidence mounted.",
      "example_cn": "随着证据不断积累，怀疑悄然渗入了她的脑海。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "nerd",
      "analysis": "“Nerd”（书呆子）指在学术或技术领域专注但社交能力较弱的人，通常带有中性或略带调侃的意味，不必然涉及令人不适的行为。而 “creep” 强调的是行为上的令人反感或威胁性，带有更强的负面道德判断。"
    },
    {
      "word_to_compare": "stalker",
      "analysis": "“Stalker”（跟踪者）特指持续、非法地监视或骚扰他人的人，是法律和心理层面的明确犯罪行为。而 “creep” 是更口语化、模糊的贬义词，可能包含轻微的不适感，不一定构成实际威胁。"
    },
    {
      "word_to_compare": "slither",
      "analysis": "“Slither”（滑行）强调像蛇一样光滑、蜿蜒的移动方式，常用于描述动物或液体的运动，具有强烈的视觉意象。而 “creep” 更强调缓慢、隐蔽、谨慎的移动，不一定涉及身体的滑动，更侧重心理上的压抑感或行为的隐秘性。"
    }
  ]
}