{
  "word": "creep",
  "pronunciation": "kreep",
  "concise_definition": "v. 缓慢移动, 悄悄行进; n. 缓慢爬行, 讨厌的人",
  "forms": {
    "third_person_singular": "creeps",
    "past_tense": "crept",
    "past_participle": "crept",
    "present_participle": "creeping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move slowly and stealthily, often on hands and knees or in a low, cautious manner, typically to avoid notice or detection.",
      "explanation_cn": "指缓慢而隐蔽地移动，通常以匍匐或低身姿势进行，目的是不被注意或发现。",
      "example_en": "The cat crept silently toward the bird, ready to pounce.",
      "example_cn": "猫悄悄地向鸟爬去，准备扑击。"
    },
    {
      "pos": "verb",
      "explanation_en": "To spread gradually or insidiously, often in a way that is unpleasant or unwanted, such as a feeling, condition, or influence.",
      "explanation_cn": "指某种感觉、状况或影响缓慢而潜移默化地蔓延开来，通常带有令人不适或不受欢迎的意味。",
      "example_en": "A sense of unease began to creep over her as the night grew darker.",
      "example_cn": "随着夜色渐深，一种不安的感觉悄然袭上她的心头。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is perceived as strange, unsettling, or socially inappropriate, often due to obsessive or predatory behavior.",
      "explanation_cn": "指被认为古怪、令人不安或社交不当的人，通常因其痴迷或具有掠夺性的行为而被如此评价。",
      "example_en": "He was labeled a creep after repeatedly sending unwanted messages to his coworker.",
      "example_cn": "他因不断给同事发送不受欢迎的信息而被贴上了‘讨厌鬼’的标签。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slow, gradual movement or progression, especially of something undesirable or unnoticed until it becomes significant.",
      "explanation_cn": "指缓慢而渐进的移动或进展，尤指那些起初未被察觉、直到变得显著才引起注意的负面变化。",
      "example_en": "The creep of urban sprawl has swallowed up many small farming communities.",
      "example_cn": "城市无序扩张的蔓延吞噬了许多小型农业社区。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "crawl",
      "analysis": "“Crawl” (爬行) 通常指用四肢或身体贴地移动，强调物理动作本身，常用于婴儿、动物或救援场景，中性或客观描述。而 “creep” 更强调隐蔽性、谨慎性和心理上的不适感，常带有负面或神秘色彩。"
    },
    {
      "word_to_compare": "slip",
      "analysis": "“Slip” (滑动/悄悄溜走) 指快速、轻巧地移动或进入，常暗示不经意或意外，如 slip away、slip in。而 “creep” 是缓慢、持续、有意识的移动，更强调过程的持久性和潜伏性。"
    },
    {
      "word_to_compare": "linger",
      "analysis": "“Linger” (逗留/徘徊) 指不愿离开，停留时间较长，但不一定移动，常用于情感或气味的残留。而 “creep” 强调的是缓慢的位移或蔓延，具有方向性和扩张性，更偏向动态过程。"
    }
  ]
}