{
  "word": "creeping",
  "pronunciation": "kree·ping",
  "concise_definition": "adj. 缓慢移动的, 悄悄蔓延的; v. 蹒跚而行, 缓慢前进 (creep 的现在分词)",
  "forms": {
    "base_form": "creep",
    "past_tense": "crept",
    "past_participle": "crept",
    "present_participle": "creeping",
    "third_person_singular": "creeps"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing something that moves or spreads slowly, subtly, and often unnoticed, especially in a way that is unsettling or undesirable.",
      "explanation_cn": "形容某物缓慢、隐蔽地移动或蔓延，通常带有令人不安或不受欢迎的意味。",
      "example_en": "The creeping ivy covered the entire wall over the years.",
      "example_cn": "多年以来，爬行的常春藤已覆盖了整面墙壁。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used to describe a gradual and often insidious increase or expansion, especially of a negative condition or influence.",
      "explanation_cn": "用于描述某种负面状况或影响的缓慢而隐蔽的扩大或增长。",
      "example_en": "There is a creeping sense of unease among the employees as layoffs loom.",
      "example_cn": "随着裁员迫近，员工中正弥漫着一种日益加深的不安感。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move slowly and carefully, often close to the ground, typically to avoid being seen or heard.",
      "explanation_cn": "缓慢而谨慎地移动，通常贴近地面，以避免被看见或听见。",
      "example_en": "The cat was creeping toward the bird, ready to pounce.",
      "example_cn": "猫正悄悄地向鸟靠近，准备扑击。"
    },
    {
      "pos": "verb",
      "explanation_en": "To progress gradually over time, especially in an unnoticeable or unwanted way.",
      "explanation_cn": "指随着时间推移缓慢进展，尤指以不易察觉或不受欢迎的方式。",
      "example_en": "Inflation has been creeping up for months.",
      "example_cn": "通货膨胀数月来一直在缓慢上升。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "crawling",
      "analysis": "“Crawling” (爬行) 通常指四肢着地的移动方式，多用于人或动物，强调身体接触地面的动作；而 “creeping” 更强调缓慢、隐蔽、无声的移动，可适用于抽象事物（如恐惧、通胀），适用范围更广，且常带有负面或不安的语义色彩。"
    },
    {
      "word_to_compare": "spreading",
      "analysis": "“Spreading” (传播/扩散) 强调范围的扩大，可以是快速或中性的，如病毒传播、谣言扩散；而 “creeping” 强调缓慢、渐进、不易察觉的扩散过程，常用于描述负面趋势的悄然渗透，语义更细腻、更具隐喻性。"
    },
    {
      "word_to_compare": "advancing",
      "analysis": "“Advancing” (前进/推进) 通常带有积极或目的性，如军队推进、技术进步；而 “creeping” 暗示无意识、被动或非自愿的进展，常用于描述不希望发生的变化，语义上更消极、更含蓄。"
    }
  ]
}