{
  "word": "crest",
  "pronunciation": "krest",
  "concise_definition": "n. 顶峰, 山脊, 冠毛, 家徽; v. 以冠饰装饰",
  "forms": {
    "plural": "crests",
    "third_person_singular": "crests",
    "past_tense": "crested",
    "past_participle": "crested",
    "present_participle": "crested"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The top or highest point of a hill, wave, or other natural formation, often implying a sharp or prominent ridge.",
      "explanation_cn": "指山丘、波浪或其他自然形态的顶部或最高点，通常暗示一个尖锐或突出的脊状结构。",
      "example_en": "The hikers reached the crest of the mountain just as the sun rose.",
      "example_cn": "徒步者在日出时分抵达了山巅。"
    },
    {
      "pos": "noun",
      "explanation_en": "A decorative emblem or symbol, typically worn on a helmet or displayed on a coat of arms, representing a family, organization, or institution.",
      "explanation_cn": "指一种装饰性徽章或符号，通常佩戴在头盔上或展示在家族纹章上，代表某个家族、组织或机构。",
      "example_en": "The university's crest features a lion holding a book.",
      "example_cn": "这所大学的徽章是一只手持书籍的狮子。"
    },
    {
      "pos": "noun",
      "explanation_en": "A tuft or ridge of feathers, hair, or other material on the head of a bird or animal, often used for display or identification.",
      "explanation_cn": "指鸟类或动物头部的一簇羽毛、毛发或其他物质形成的突起，常用于展示或识别。",
      "example_en": "The rooster's bright red crest stood erect as it crowed.",
      "example_cn": "公鸡鸣叫时，鲜红的冠毛直立着。"
    },
    {
      "pos": "verb",
      "explanation_en": "To adorn or decorate something with a crest, especially a heraldic emblem.",
      "explanation_cn": "指用徽章、纹章等装饰某物，尤指用家族或机构的纹饰。",
      "example_en": "The ancient shield was crested with a golden eagle.",
      "example_cn": "这面古老的盾牌上饰有一只金色的鹰。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "summit",
      "analysis": "“Summit”（顶峰）专指山峰或抽象事物的最高点，强调绝对高度或成就的巅峰，常用于正式语境（如峰会）。而 “crest” 更侧重于地形上的尖锐脊线或波浪的最高点，更具视觉形态感，且可指代徽章或羽毛。"
    },
    {
      "word_to_compare": "emblem",
      "analysis": "“Emblem”（徽章）泛指任何象征性图案或标志，用途广泛，不特指头部装饰或纹章结构。而 “crest” 是一种特定类型的徽章，通常呈立体或突出形态，专用于头盔、盾牌或家族标识，具有历史和贵族传统背景。"
    },
    {
      "word_to_compare": "ridge",
      "analysis": "“Ridge”（山脊）指长条形的隆起地形，强调延伸性和平行结构，如山脉的脊线。而 “crest” 是 ridge 的最高点或顶部，更强调顶点而非整体形态，且可引申用于波浪、羽毛等非地形语境。"
    }
  ]
}