{
  "word": "crib",
  "pronunciation": "krahyb",
  "concise_definition": "n. 婴儿床, 抄袭; v. 抄袭, 偷窃",
  "forms": {
    "third_person_singular": "cribs",
    "past_tense": "cribbed",
    "past_participle": "cribbed",
    "present_participle": "cribbing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small bed with high sides, typically for infants, designed to prevent them from rolling out or getting hurt.",
      "explanation_cn": "一种四边有高栏杆的小床，通常用于婴儿，以防止他们翻身或受伤。",
      "example_en": "The baby was sleeping peacefully in her crib.",
      "example_cn": "婴儿正安静地睡在她的婴儿床里。"
    },
    {
      "pos": "noun",
      "explanation_en": "A cheat sheet or unauthorized aid used to copy information during an exam or assignment, often secretly concealed.",
      "explanation_cn": "指在考试或作业中偷偷使用的作弊小抄或未经授权的参考资料。",
      "example_en": "He got caught using a crib during the math test.",
      "example_cn": "他在数学考试中使用小抄被抓住了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To steal or copy someone else's work, ideas, or words without permission or attribution, especially in academic or creative contexts.",
      "explanation_cn": "在学术或创作语境中，未经许可或未注明出处地窃取或抄袭他人的作品、想法或文字。",
      "example_en": "She was accused of cribbing entire paragraphs from an online article.",
      "example_cn": "她被指控从网上文章中抄袭了整段文字。"
    },
    {
      "pos": "verb",
      "explanation_en": "To steal or take something, especially small items, in a sneaky or petty way.",
      "explanation_cn": "以偷偷摸摸或微不足道的方式偷窃某物，尤指小件物品。",
      "example_en": "The kids were cribbing candy from the store shelf.",
      "example_cn": "孩子们偷偷从货架上拿糖果。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "plagiarize",
      "analysis": "“Plagiarize” (抄袭) 是学术和法律语境中更正式、更严重的术语，特指未经授权使用他人作品并冒充为自己的行为，通常涉及文字、思想或研究成果，带有道德和法律后果。而 “crib” 更口语化，常用于学生作弊的日常语境，范围更窄，多指小抄或临时抄袭。"
    },
    {
      "word_to_compare": "steal",
      "analysis": "“Steal” (偷窃) 是一个通用词，指非法占有他人财物，适用于任何物品和情境。而 “crib” 作为动词时，特指偷窃小物件或抄袭内容，语义更具体，常带有狡猾、隐蔽的意味，且多用于非实物（如文字）的窃取。"
    },
    {
      "word_to_compare": "cheat",
      "analysis": "“Cheat” (作弊) 是一个更广泛的动词，泛指在考试、游戏或竞争中使用不正当手段获取优势，包括但不限于抄袭、偷看、贿赂等。而 “crib” 是 “cheat” 的一种具体形式，专指使用小抄或参考资料进行抄袭，语义更聚焦于书面内容的非法复制。"
    }
  ]
}