{
  "word": "cringe",
  "pronunciation": "krinj",
  "concise_definition": "v. 畏缩, 羞愧; n. 令人尴尬的事物, 令人不适的举动",
  "forms": {
    "third_person_singular": "cringes",
    "past_tense": "cringed",
    "past_participle": "cringed",
    "present_participle": "cringing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To shrink back or flinch involuntarily, often due to fear, pain, or embarrassment, especially when witnessing something awkward or socially inappropriate.",
      "explanation_cn": "因恐惧、疼痛或尴尬而不由自主地缩身、退避，尤其在目睹某种尴尬或不合社交规范的事物时。",
      "example_en": "She cringed when he started singing off-key at the party.",
      "example_cn": "当他派对上跑调唱歌时，她忍不住缩起了身子。"
    },
    {
      "pos": "verb",
      "explanation_en": "To feel intense discomfort or embarrassment, often vicariously, when observing someone else's awkward behavior or outdated social attempts.",
      "explanation_cn": "当目睹他人笨拙的行为或过时的社交努力时，产生强烈的不适或尴尬感，常为替人尴尬。",
      "example_en": "I cringed watching my older brother try to dance like a TikTok influencer.",
      "example_cn": "看着我哥哥模仿 TikTok 网红跳舞，我尴尬得想钻地缝。"
    },
    {
      "pos": "noun",
      "explanation_en": "Something that causes a feeling of awkwardness, embarrassment, or discomfort, especially due to forced attempts at being cool, trendy, or emotionally expressive.",
      "explanation_cn": "指那些因刻意追求酷、潮流或情感表达而令人感到尴尬或不适的事物。",
      "example_en": "That TikTok video with the over-the-top dramatic lip-sync is pure cringe.",
      "example_cn": "那段夸张到极点的对口型 TikTok 视频简直是尴尬到极致。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "embarrass",
      "analysis": "“Embarrass”（使尴尬）是使他人感到难堪的主动行为，强调外部施加的社交压力；而 “cringe” 更多是观察者自发的、内在的不适反应，常为替人尴尬（vicarious embarrassment），不一定是他人有意为之。"
    },
    {
      "word_to_compare": "awkward",
      "analysis": "“Awkward”（尴尬的）是描述一种状态或情境的形容词，指不合时宜、不自然或令人不适的氛围；而 “cringe” 既可以作动词（反应）也可以作名词（事物本身），更强调情绪上的强烈反感，带有贬义和网络流行语色彩，比 “awkward” 更具情感冲击力。"
    },
    {
      "word_to_compare": "disgust",
      "analysis": "“Disgust”（厌恶）源于道德、卫生或审美上的强烈反感，常与恶心、鄙视相关；而 “cringe” 的反感更偏向于社交笨拙、过时或虚假的表现，不涉及道德评判，更多是因‘用力过猛’或‘不合时宜’而产生的苦笑式不适。"
    }
  ]
}