{
  "word": "cripple",
  "pronunciation": "krihp·uhl",
  "concise_definition": "v. 使残废, 使丧失能力; n. 残疾人",
  "forms": {
    "third_person_singular": "cripples",
    "past_tense": "crippled",
    "past_participle": "crippled",
    "present_participle": "crippling"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To cause someone to become physically disabled, especially by injuring the limbs or spine, resulting in a severe loss of mobility or function.",
      "explanation_cn": "指通过伤害四肢或脊柱，使某人身体残疾，导致严重的行动能力或功能丧失。",
      "example_en": "The accident crippled him for life, leaving him unable to walk without assistance.",
      "example_cn": "这场事故使他终身残疾，无法在没有帮助的情况下行走。"
    },
    {
      "pos": "verb",
      "explanation_en": "To severely impair or weaken the effectiveness, function, or operation of something, such as an organization, system, or economy.",
      "explanation_cn": "指严重削弱某事物（如组织、系统或经济）的有效性、功能或运作能力。",
      "example_en": "The financial scandal crippled the company's reputation and led to its collapse.",
      "example_cn": "这场财务丑闻严重损害了公司的声誉，导致其倒闭。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is physically disabled, especially due to a permanent injury or condition affecting movement; considered outdated and offensive in modern usage.",
      "explanation_cn": "指因永久性损伤或疾病而身体残疾的人；在现代用法中被视为过时且具有冒犯性。",
      "example_en": "In the 19th century, the term 'cripple' was commonly used to describe people with mobility impairments.",
      "example_cn": "在19世纪，'cripple' 一词常被用来描述行动不便的人。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "disable",
      "analysis": "“Disable” (使丧失能力) 是一个更中性、更常用的术语，用于描述因疾病、损伤或技术原因导致功能丧失，不带有情感色彩或贬义。而 “cripple” 通常带有更强的负面情感和历史污名，尤其在指人时被视为冒犯性语言。"
    },
    {
      "word_to_compare": "paralyze",
      "analysis": "“Paralyze” (使瘫痪) 强调完全丧失运动或功能能力，常用于生理或心理层面的彻底失效，如神经损伤或恐惧导致的行动停滞。而 “cripple” 可以指部分或严重但非完全的丧失，且更常用于长期性损伤。"
    },
    {
      "word_to_compare": "undermine",
      "analysis": "“Undermine” (削弱) 指通过间接、渐进的方式破坏某事物的基础或信心，如信任、结构或权威。它强调隐蔽性和长期性，而 “cripple” 更强调直接、剧烈的破坏，常导致功能的急剧下降。"
    }
  ]
}