{
  "word": "crippled",
  "pronunciation": "krihp·tld",
  "concise_definition": "adj. 残疾的, 丧失能力的; v. 使残废, 使严重受损",
  "forms": {
    "base_form": "cripple",
    "third_person_singular": "cripples",
    "past_tense": "crippled",
    "past_participle": "crippled",
    "present_participle": "crippled"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Physically disabled or severely impaired, especially in movement or function, often due to injury, disease, or congenital condition.",
      "explanation_cn": "身体上残疾或严重受损，尤其在行动或功能方面，通常由受伤、疾病或先天状况引起。",
      "example_en": "The veteran was crippled in the war and now uses a wheelchair.",
      "example_cn": "这位退伍军人在战争中致残，如今只能使用轮椅。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Severely weakened or impaired in function, often used metaphorically to describe systems, economies, or organizations that are no longer effective.",
      "explanation_cn": "严重削弱或功能受损，常用于隐喻，形容系统、经济或组织已失去效力。",
      "example_en": "The economy was crippled by inflation and unemployment.",
      "example_cn": "通货膨胀和失业使经济陷入瘫痪。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause someone to become physically disabled, especially by injury or disease.",
      "explanation_cn": "因受伤或疾病导致某人身体残疾。",
      "example_en": "The accident crippled her leg, leaving her unable to walk without assistance.",
      "example_cn": "这场事故使她的腿残疾，导致她无法在没有帮助的情况下行走。"
    },
    {
      "pos": "verb",
      "explanation_en": "To severely damage or impair the function of something, such as an organization, system, or process.",
      "explanation_cn": "严重损害或削弱某事物（如组织、系统或流程）的功能。",
      "example_en": "Corruption crippled the government's ability to deliver public services.",
      "example_cn": "腐败严重削弱了政府提供公共服务的能力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "disabled",
      "analysis": "“Disabled” (残疾的) 是一个更中性、更广泛使用的术语，涵盖各种身体、感官或认知障碍，常用于法律和政策语境，强调社会身份。而 “crippled” 带有较强烈的负面情感色彩，有时被视为过时或冒犯性词汇，多用于描述严重功能丧失的物理状态。"
    },
    {
      "word_to_compare": "impaired",
      "analysis": "“Impaired” (受损的) 是一个更温和、更专业的术语，适用于轻度到中度的功能减退，可用于身体、认知或感官层面，不必然意味着永久性或严重性。而 “crippled” 暗示的是严重、通常不可逆的损害，语义强度更高。"
    },
    {
      "word_to_compare": "hobbled",
      "analysis": "“Hobbled” (蹒跚而行/受阻) 常用于比喻，指因某种限制而行动缓慢或受阻，但不意味着完全丧失能力。例如：‘The team was hobbled by injuries.’ 它比 “crippled” 程度轻，且多用于临时性或非致命性障碍。"
    }
  ]
}