{
  "word": "criticize",
  "pronunciation": "krit·uh·sahy",
  "concise_definition": "v. 批评, 指责, 评论",
  "forms": {
    "third_person_singular": "criticizes",
    "past_tense": "criticized",
    "past_participle": "criticized",
    "present_participle": "criticizing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To express disapproval of someone or something by pointing out faults, weaknesses, or mistakes, often with the intent to improve or warn.",
      "explanation_cn": "通过指出某人或某事物的缺点、弱点或错误来表达不满，通常旨在促使其改进或起到警示作用。",
      "example_en": "The reviewer criticized the film for its weak plot and inconsistent pacing.",
      "example_cn": "评论家批评这部电影情节薄弱、节奏不一致。"
    },
    {
      "pos": "verb",
      "explanation_en": "To analyze and evaluate something (such as a work of art, literature, or policy) in a detailed and often analytical manner, whether positively or negatively.",
      "explanation_cn": "对某事物（如艺术作品、文学作品或政策）进行细致的分析与评估，无论评价是正面还是负面。",
      "example_en": "Scholars criticize ancient texts to uncover hidden meanings and historical context.",
      "example_cn": "学者们通过批评古代文本以揭示其隐含的意义和历史背景。"
    },
    {
      "pos": "verb",
      "explanation_en": "To express negative judgment or disapproval in a general or informal way, sometimes without detailed reasoning.",
      "explanation_cn": "以一般性或非正式的方式表达负面判断或不满，有时并不提供详细理由。",
      "example_en": "She criticized her colleague for always being late, though she never explained why it bothered her.",
      "example_cn": "她批评同事总是迟到，却从未说明这为何让她困扰。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "condemn",
      "analysis": "“Condemn” (谴责) 意味着强烈、明确地否定或判罪，带有道德或法律上的严厉评判，语气比 “criticize” 更重，常用于对严重错误或不道德行为的公开指责。而 “criticize” 可以是建设性的，不一定涉及道德审判。"
    },
    {
      "word_to_compare": "complain",
      "analysis": "“Complain” (抱怨) 侧重于表达不满或不适，通常是个人情绪的宣泄，不一定包含分析或评价。而 “criticize” 更具理性成分，常包含对问题的识别和分析，目的是指出缺陷而非仅仅发泄情绪。"
    },
    {
      "word_to_compare": "review",
      "analysis": "“Review” (评论) 是一种更中性、系统性的评价行为，常见于艺术、学术或产品领域，可能包含批评，但也可能包含赞扬。而 “criticize” 更倾向于强调负面评价，即使在学术语境中，也隐含着对不足之处的关注。"
    }
  ]
}