{
  "word": "croatian",
  "pronunciation": "kroh·shee·uhn",
  "concise_definition": "adj. 克罗地亚的, 克罗地亚人的; n. 克罗地亚语, 克罗地亚人",
  "forms": {
    "comparative": "more Croatian",
    "superlative": "most Croatian"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to Croatia, its people, language, or culture; denoting origin, association, or characteristic of the Republic of Croatia.",
      "explanation_cn": "与克罗地亚、其人民、语言或文化相关的；表示源于、关联或具有克罗地亚共和国的特征。",
      "example_en": "Croatian cuisine is known for its rich use of seafood and Mediterranean spices.",
      "example_cn": "克罗地亚菜以其丰富的海鲜和地中海香料而闻名。"
    },
    {
      "pos": "noun",
      "explanation_en": "The South Slavic language spoken primarily in Croatia, also used in parts of Bosnia and Herzegovina, Serbia, and Montenegro; it is mutually intelligible with Serbian, Bosnian, and Montenegrin.",
      "explanation_cn": "主要在克罗地亚使用的南斯拉夫语，也在波斯尼亚和黑塞哥维那、塞尔维亚和黑山部分地区使用；它与塞尔维亚语、波斯尼亚语和黑山语相互可理解。",
      "example_en": "She studied Croatian for three years before moving to Zagreb.",
      "example_cn": "她在搬到萨格勒布之前学习了三年克罗地亚语。"
    },
    {
      "pos": "noun",
      "explanation_en": "A native or inhabitant of Croatia; a person of Croatian descent.",
      "explanation_cn": "克罗地亚的原住民或居民；具有克罗地亚血统的人。",
      "example_en": "Many Croatian athletes have won medals in international competitions.",
      "example_cn": "许多克罗地亚运动员在国际比赛中赢得过奖牌。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "serbian",
      "analysis": "“Serbian”（塞尔维亚语/塞尔维亚人）与 “Croatian” 同属南斯拉夫语支，语言结构高度相似，主要区别在于书写系统（塞尔维亚语使用西里尔字母和拉丁字母，克罗地亚语仅用拉丁字母）、部分词汇和语音习惯。政治和民族认同是区分两者的主要因素，而非语言本质差异。"
    },
    {
      "word_to_compare": "bosnian",
      "analysis": "“Bosnian”（波斯尼亚语/波斯尼亚人）与克罗地亚语在语法和词汇上几乎相同，主要区别在于借词来源（波斯尼亚语受土耳其语和阿拉伯语影响更深）及部分文化语境。三者（克罗地亚语、塞尔维亚语、波斯尼亚语）常被统称为“塞尔维亚-克罗地亚语”，但因民族认同而被分别命名。"
    },
    {
      "word_to_compare": "slovenian",
      "analysis": "“Slovenian”（斯洛文尼亚语）是另一种南斯拉夫语支语言，但与克罗地亚语差异显著，包括不同的语法结构、音系和词汇。斯洛文尼亚语保留了更多古斯拉夫语特征，且使用范围仅限于斯洛文尼亚，而克罗地亚语使用者更多，分布更广。"
    }
  ]
}