{
  "word": "cromwell",
  "pronunciation": "kroh·mwell",
  "concise_definition": "n. 克伦威尔（专指英国历史人物奥利弗·克伦威尔）",
  "forms": {
    "plural": "cromwells"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to Oliver Cromwell (1599–1658), the English military and political leader who played a central role in the English Civil War, led the Parliamentarian forces to victory over the Royalists, and served as Lord Protector of the Commonwealth of England, Scotland, and Ireland.",
      "explanation_cn": "专指奥利弗·克伦威尔（1599–1658），英国军事与政治领袖，在英国内战中领导议会军击败保王党，并担任英格兰、苏格兰与爱尔兰联邦的护国公。",
      "example_en": "Cromwell's rise to power marked the end of the monarchy and the establishment of a republican government in England.",
      "example_cn": "克伦威尔掌权标志着英国君主制的终结和共和政府的建立。"
    },
    {
      "pos": "noun",
      "explanation_en": "By extension, a person who is seen as a stern, puritanical, or authoritarian leader, often associated with rigid moral discipline and opposition to luxury or indulgence.",
      "explanation_cn": "引申义，指被认为严厉、清教徒式或专制的领导者，常与严格的道德自律和反对奢侈享乐相关联。",
      "example_en": "The school's new headmaster was called a 'cromwell' by students for banning all music and dance activities.",
      "example_cn": "由于禁止所有音乐和舞蹈活动，新校长被学生们称为‘克伦威尔’。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "dictator",
      "analysis": "“Dictator”（独裁者）泛指任何通过强制手段掌握绝对权力的统治者，通常带有负面含义，强调非法或非民主的统治方式。而 “Cromwell” 是一个历史专有名词，虽在某些语境下被用作“独裁者”的代称，但其本身包含复杂的历史背景——他并非通过政变夺权，而是经由议会授权担任护国公，其统治具有一定的宪政合法性。"
    },
    {
      "word_to_compare": "reformer",
      "analysis": "“Reformer”（改革者）强调推动社会、政治或宗教制度进步与改良的人，通常带有正面或中性色彩。克伦威尔常被视为改革者，因为他推翻了君主专制、推动宗教自由和议会主权，但他的手段（如镇压爱尔兰、解散议会）又使他与温和改革者区别开来，因此“Cromwell”一词比“reformer”更具争议性和矛盾性。"
    },
    {
      "word_to_compare": "protector",
      "analysis": "“Protector”（保护者）是一个通用头衔，指保护国家或人民的人，常具正面意义。克伦威尔的正式头衔是“Lord Protector”，但后世使用“Cromwell”一词时，往往不再强调其“保护者”的角色，而是聚焦于其军事威权与道德高压，因此“Cromwell”比“protector”承载了更复杂甚至负面的历史联想。"
    }
  ]
}