{
  "word": "crops",
  "pronunciation": "krawps",
  "concise_definition": "n. 农作物, 收成, 产量; v. 剪短, 修剪",
  "forms": {
    "singular": "crop"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Plants that are grown in large quantities on farms for food, fiber, fuel, or other economic uses, typically harvested seasonally.",
      "explanation_cn": "指在农场中大规模种植、用于食物、纤维、燃料或其他经济用途的植物，通常按季节收获。",
      "example_en": "Wheat, corn, and rice are staple crops in many countries.",
      "example_cn": "小麦、玉米和大米是许多国家的主要农作物。"
    },
    {
      "pos": "noun",
      "explanation_en": "The total amount of a particular crop harvested in a single season; the yield or harvest of agricultural produce.",
      "explanation_cn": "指在单个季节内收获的某种农作物的总产量；农业产品的收成。",
      "example_en": "This year's crop of apples was unusually large due to favorable weather.",
      "example_cn": "由于天气有利，今年苹果的收成异常丰富。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of people or things that appear or are produced at the same time, often used metaphorically to refer to a new generation or cohort.",
      "explanation_cn": "指同时出现或产生的一群人或事物，常用于比喻新一代或一批人。",
      "example_en": "The new crop of graduates is entering the job market with advanced digital skills.",
      "example_cn": "这一批新毕业生带着先进的数字技能进入就业市场。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cut or trim something, especially hair or fur, short, often for practical or aesthetic reasons.",
      "explanation_cn": "指将某物（尤其是头发或毛发）剪短，通常出于实用或美观的考虑。",
      "example_en": "He decided to crop his hair short for the summer.",
      "example_cn": "他决定把头发剪短以度过夏天。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "harvest",
      "analysis": "“Harvest” (收获) 强调的是收割或采集农作物的动作或过程，也可以泛指任何收获的成果，侧重于行为本身或结果的获取。而 “crop” 更侧重于指被种植和收获的植物本身，或其总产量，是名词化的产物。"
    },
    {
      "word_to_compare": "yield",
      "analysis": "“Yield” (产量) 是一个更抽象的经济或统计术语，指单位面积或单位投入所产出的数量，常用于农业、金融或科学领域。它强调效率和产出率，而 “crop” 更具体，指实际种植的植物种类或收成总量。"
    },
    {
      "word_to_compare": "trim",
      "analysis": "“Trim” (修剪) 与 “crop” 作为动词时意义相近，都指剪短，但 “trim” 更常用于精细修饰，如修剪草坪、树枝或发型的边缘，强调美观和细节；而 “crop” 更强调大幅度地剪短，有时甚至接近剃除，语气更粗犷或实用。"
    }
  ]
}