{
  "word": "cropped",
  "pronunciation": "krawpt",
  "concise_definition": "adj. 被修剪的, 被裁剪的; v. 修剪, 裁剪（crop 的过去式和过去分词）",
  "forms": {
    "base_form": "crop",
    "past_tense": "cropped",
    "past_participle": "cropped",
    "present_participle": "cropping",
    "plural": "crops"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing something, especially a photograph or image, that has been cut or trimmed to remove unwanted parts and focus on a specific area.",
      "explanation_cn": "指某物（尤指照片或图像）已被裁剪，移除不需要的部分，以突出特定区域。",
      "example_en": "She posted a cropped version of the group photo to highlight only her friends.",
      "example_cn": "她发布了一张经过裁剪的合照，只突出她的朋友们。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Referring to a hairstyle in which the hair is cut short, especially close to the scalp.",
      "explanation_cn": "指头发被剪得很短，尤其是贴近头皮的发型。",
      "example_en": "He has a cropped haircut that looks very neat and modern.",
      "example_cn": "他留着一种整洁现代的短发造型。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cut off or shorten part of something, especially to remove excess or to fit a specific size or shape.",
      "explanation_cn": "指切掉或缩短某物的一部分，通常是为了去除多余部分或使其适应特定尺寸或形状。",
      "example_en": "The photographer cropped the image to remove the distracting background.",
      "example_cn": "摄影师裁剪了这张照片，以去除干扰性的背景。"
    },
    {
      "pos": "verb",
      "explanation_en": "To harvest or gather a crop of plants, especially agricultural produce.",
      "explanation_cn": "指收割或采集农作物，尤指农业产品（此义项为动词原形 'crop' 的用法，'cropped' 为其过去式/分词形式）。",
      "example_en": "Farmers cropped the wheat fields before the first frost.",
      "example_cn": "农民们在初霜前收割了小麦田。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "trimmed",
      "analysis": "“Trimmed”（修剪）通常指轻微地修整边缘或去除零星部分，以使外观更整洁，常用于头发、植物或装饰物。而 “cropped” 更强调显著地缩短或切除，常用于图像裁剪或极短发型，动作幅度更大、更彻底。"
    },
    {
      "word_to_compare": "cut",
      "analysis": "“Cut”（切割）是一个更广泛、更通用的词，可指任何用工具分离物体的行为。而 “cropped” 是 “cut” 的一种特定形式，专指为聚焦、美化或适应尺寸而进行的有目的的裁剪，多用于视觉媒体或发型语境。"
    },
    {
      "word_to_compare": "clipped",
      "analysis": "“Clipped”（剪短）常用于描述快速、简短地修剪，如剪指甲、剪草坪或剪耳朵，动作轻快且通常不改变整体结构。而 “cropped” 更强调结构性的缩短，如将长发剪成极短寸头，或将照片主体从原图中独立出来，具有更强的视觉重构意味。"
    }
  ]
}