{
  "word": "crosses",
  "pronunciation": "krɔs·iz",
  "concise_definition": "n. 十字架, 交叉, 交叉点; v. 穿过, 交叉, 违背",
  "forms": {
    "base_form": "cross",
    "third_person_singular": "crosses",
    "past_tense": "crossed",
    "past_participle": "crossed",
    "present_participle": "crossing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A symbol consisting of two lines or bars intersecting at right angles, often used in religious, cultural, or navigational contexts, especially the Christian cross.",
      "explanation_cn": "由两条线或杆以直角相交构成的符号，常用于宗教、文化或导航语境中，尤指基督教的十字架。",
      "example_en": "She wore a small gold cross around her neck as a sign of her faith.",
      "example_cn": "她脖子上戴着一个小金十字架，作为信仰的象征。"
    },
    {
      "pos": "noun",
      "explanation_en": "A point or place where two or more roads, paths, or lines intersect.",
      "explanation_cn": "两条或更多道路、路径或线条相交的地点或位置。",
      "example_en": "Be careful at the crossroads — there was an accident at the main crosses yesterday.",
      "example_cn": "在十字路口要小心——昨天主干道的交叉口发生了事故。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move from one side to the other of a road, river, boundary, or other obstacle.",
      "explanation_cn": "从道路、河流、边界或其他障碍的一侧移动到另一侧。",
      "example_en": "We crossed the river on a narrow wooden bridge.",
      "example_cn": "我们从一座狭窄的木桥上过了河。"
    },
    {
      "pos": "verb",
      "explanation_en": "To intersect or pass over something, especially lines, paths, or directions.",
      "explanation_cn": "与某物相交或跨越，尤指线条、路径或方向。",
      "example_en": "The two roads cross near the old church.",
      "example_cn": "两条道路在老教堂附近相交。"
    },
    {
      "pos": "verb",
      "explanation_en": "To violate or go against a rule, promise, or expectation; to betray.",
      "explanation_cn": "违反、违背规则、承诺或期望；背叛。",
      "example_en": "He crossed his promise to help her by refusing to show up.",
      "example_cn": "他因拒绝出现而违背了帮助她的承诺。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "intersection",
      "analysis": "“Intersection” (交叉点) 是一个更中性、更精确的术语，专指道路、线路或抽象概念的交汇处，常用于交通或地理语境。而 “crosses” 作为名词时，可泛指十字形符号或交叉点，语义更广，且常带有文化或象征意义。"
    },
    {
      "word_to_compare": "transverse",
      "analysis": "“Transverse” (横向的) 是形容词，强调方向与主体垂直，用于描述物体或结构的方位，如“transverse section”（横截面）。而 “crosses” 是动词或名词，强调动作或实体的相交行为，更具动态性和具体性。"
    },
    {
      "word_to_compare": "contradict",
      "analysis": "“Contradict” (反驳/矛盾) 专指语言或逻辑上的对立，如观点、陈述之间的冲突。而 “crosses” 在表示“违背”时，更侧重于对承诺、约定或道德义务的背弃，带有行为和责任的维度，语义更重、更个人化。"
    }
  ]
}