{
  "word": "crowd",
  "pronunciation": "krowd",
  "concise_definition": "n. 人群, 群众; v. 拥挤, 挤满",
  "forms": {
    "plural": "crowds",
    "third_person_singular": "crowds",
    "past_tense": "crowded",
    "past_participle": "crowded",
    "present_participle": "crowding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A large number of people gathered closely together in one place, often in an unorganized or chaotic manner.",
      "explanation_cn": "指大量人群密集地聚集在某一地点，通常呈无组织或混乱状态。",
      "example_en": "A huge crowd gathered outside the stadium before the concert began.",
      "example_cn": "音乐会开始前，体育场外聚集了大批人群。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of people with shared interests or characteristics, often used to describe the general public or masses.",
      "explanation_cn": "指具有共同兴趣或特征的一群人，常用于泛指大众或普通民众。",
      "example_en": "The new movie appealed to a wide crowd, from teenagers to seniors.",
      "example_cn": "这部新电影吸引了从青少年到老年观众的广泛人群。"
    },
    {
      "pos": "verb",
      "explanation_en": "To gather or press closely together in a confined space, often causing discomfort or obstruction.",
      "explanation_cn": "指在狭小空间内密集地聚集或挤压，常导致不适或阻碍。",
      "example_en": "People crowded around the speaker to hear the announcement.",
      "example_cn": "人们围拢在演讲者周围，想听清公告内容。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fill a place to capacity or beyond, often implying overpopulation or congestion.",
      "explanation_cn": "指将某地填满至极限甚至超载，常暗示过度拥挤。",
      "example_en": "The narrow alley was crowded with vendors and shoppers.",
      "example_cn": "这条狭窄的小巷挤满了小贩和购物者。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "group",
      "analysis": "“Group”（群体）是一个中性词，泛指任何数量的人或物的集合，不强调数量或密度，可以是小规模、有组织的（如学习小组）。而 “crowd” 强调人数众多且聚集紧密，通常带有无序或喧闹的意味。"
    },
    {
      "word_to_compare": "mob",
      "analysis": "“Mob”（暴民）带有强烈负面含义，指因情绪激动、暴力或非法行为而聚集的人群，常暗示危险或失控。而 “crowd” 是中性词，仅描述聚集状态，不必然包含暴力或混乱。"
    },
    {
      "word_to_compare": "throng",
      "analysis": "“Throng”（人潮）与 “crowd” 意义非常接近，都表示大量人群密集聚集，但 “throng” 更具文学色彩，常用于描述壮观或热烈的场面，语气更正式或诗意，而 “crowd” 更口语化、日常化。"
    }
  ]
}