{
  "word": "crowned",
  "pronunciation": "krownd",
  "concise_definition": "adj. 被加冕的, 位居顶端的, 最优秀的",
  "forms": {
    "base_form": "crown",
    "past_tense": "crowned",
    "past_participle": "crowned",
    "present_participle": "crowning"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having been formally placed with a crown, typically in a ceremonial context, signifying royal status or official recognition of sovereignty.",
      "explanation_cn": "指在仪式中被正式戴上王冠，通常象征王室身份或被正式承认为统治者。",
      "example_en": "The crowned king walked slowly through the palace halls, greeted by cheering crowds.",
      "example_cn": "这位加冕的国王缓缓走过宫殿大厅，受到人群的欢呼。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used metaphorically to describe something that is the best, highest, or most perfect example of its kind; the ultimate achievement or culmination.",
      "explanation_cn": "比喻性地用于形容某事物是其类别中最优秀、最高级或最完美的典范；是最终的成就或顶点。",
      "example_en": "Her performance was the crowned jewel of the entire concert.",
      "example_cn": "她的表演是整场音乐会中最璀璨的明珠。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Referring to something that occupies the highest position or is at the apex, often in a figurative or symbolic sense (e.g., crowned with success, crowned with glory).",
      "explanation_cn": "指某事物处于最高位置或顶点，常用于比喻或象征意义（如‘功成名就’、‘荣耀加身’）。",
      "example_en": "After decades of hard work, he was crowned with the Nobel Prize.",
      "example_cn": "经过数十年的努力，他最终荣获诺贝尔奖，功成名就。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "royal",
      "analysis": "“Royal”（皇家的）强调与王室相关的属性或身份，如皇家血统、皇家特权，但不必然包含‘加冕’这一仪式动作。而 ‘crowned’ 特指通过加冕仪式获得的权威或地位，更具动作性和象征性。"
    },
    {
      "word_to_compare": "supreme",
      "analysis": "“Supreme”（至高无上的）强调在等级、质量或权力上的绝对最高性，是一个抽象的评价词，不涉及具体仪式或物理动作。而 ‘crowned’ 常带有具象的仪式感，即使用于比喻，也保留了‘加冕’这一象征性动作的意象。"
    },
    {
      "word_to_compare": "topped",
      "analysis": "“Topped”（被置于顶部的）泛指在物理或抽象层级中处于最高位置，但缺乏 ‘crowned’ 所蕴含的庄严、荣誉和仪式感。‘Crowned’ 更具文学性和情感色彩，常用于赞美或升华语境，而 ‘topped’ 更中性、日常。"
    }
  ]
}