{
  "word": "crown",
  "pronunciation": "krown",
  "concise_definition": "n. 王冠, 顶点, 荣誉; v. 加冕, 使达到顶峰",
  "forms": {
    "plural": "crowns",
    "third_person_singular": "crowns",
    "past_tense": "crowned",
    "past_participle": "crowned",
    "present_participle": "crowning"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A decorative headpiece, typically made of precious metals and jewels, worn by monarchs as a symbol of sovereignty and authority.",
      "explanation_cn": "一种由贵金属和珠宝制成的装饰性头饰，通常由君主佩戴，象征其统治权与权威。",
      "example_en": "The queen was crowned with a golden crown adorned with diamonds and rubies.",
      "example_cn": "女王戴上了一顶镶嵌着钻石和红宝石的金冠。"
    },
    {
      "pos": "noun",
      "explanation_en": "The highest point or peak of something, often representing the ultimate achievement or culmination.",
      "explanation_cn": "某物的最高点或顶峰，常指最终的成就或巅峰状态。",
      "example_en": "Winning the Olympic gold medal was the crown of her athletic career.",
      "example_cn": "赢得奥运金牌是她运动生涯的巅峰。"
    },
    {
      "pos": "noun",
      "explanation_en": "A reward or honor bestowed upon someone for exceptional achievement or service.",
      "explanation_cn": "因卓越成就或服务而授予某人的奖励或荣誉。",
      "example_en": "The Nobel Prize is considered the crown of scientific achievement.",
      "example_cn": "诺贝尔奖被视为科学成就的最高荣誉。"
    },
    {
      "pos": "verb",
      "explanation_en": "To place a crown on someone's head in a formal ceremony, especially to confer royal status or authority.",
      "explanation_cn": "在正式仪式中将王冠戴在某人头上，尤其是授予其君主身份或权威。",
      "example_en": "The archbishop crowned the new king in Westminster Abbey.",
      "example_cn": "大主教在西敏寺为新国王加冕。"
    },
    {
      "pos": "verb",
      "explanation_en": "To bring something to a perfect or climactic conclusion; to complete or finalize with distinction.",
      "explanation_cn": "使某事达到完美或高潮的结局；以卓越的方式完成或终结。",
      "example_en": "The final goal crowned an unforgettable match.",
      "example_cn": "最后一个进球为这场难忘的比赛画上了完美句号。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tiara",
      "analysis": "“Tiara”（发冠）是一种半圆形的装饰性头饰，通常由女性佩戴，多用于婚礼或正式场合，但不象征统治权。而 “crown” 是君主权威的正式象征，具有政治和法律意义，结构更完整、更庄严。"
    },
    {
      "word_to_compare": "peak",
      "analysis": "“Peak”（顶峰）是一个中性词，泛指任何事物的最高点，如山峰、业绩高峰，强调的是位置或程度。而 “crown” 在比喻义中不仅指最高点，还隐含了荣誉、成就和仪式感，带有文化与象征色彩。"
    },
    {
      "word_to_compare": "award",
      "analysis": "“Award”（奖项）是泛指任何形式的奖励或荣誉，如奖金、奖杯、证书，强调结果和授予行为。而 “crown” 作为名词的比喻义，不仅指荣誉本身，更强调其至高无上的地位和象征性，常用于文学或修辞语境中，更具诗意和庄严感。"
    }
  ]
}