{
  "word": "cruise",
  "pronunciation": "krooz",
  "concise_definition": "v. 巡航, 漫游, 以恒定速度行驶; n. 巡航, 乘船旅行",
  "forms": {
    "third_person_singular": "cruises",
    "past_tense": "cruised",
    "past_participle": "cruised",
    "present_participle": "cruising"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To travel steadily and smoothly at a constant speed, especially in a vehicle such as a car, boat, or aircraft, often for pleasure or without a specific destination.",
      "explanation_cn": "指以恒定速度平稳地行驶，尤指在汽车、船或飞机上，通常为了休闲或没有明确目的地。",
      "example_en": "He cruised along the coast at 60 miles per hour, enjoying the ocean view.",
      "example_cn": "他以每小时60英里的速度沿着海岸线巡航，欣赏着海景。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move around a place in a relaxed or aimless way, often while looking for something or someone.",
      "explanation_cn": "指在某地悠闲地或漫无目的地游荡，通常是为了寻找某物或某人。",
      "example_en": "They were cruising the streets looking for a good restaurant.",
      "example_cn": "他们在街上闲逛，寻找一家不错的餐厅。"
    },
    {
      "pos": "noun",
      "explanation_en": "A long journey, typically by ship, taken for pleasure and involving stops at several destinations.",
      "explanation_cn": "指一次长时间的休闲旅行，通常乘船进行，并停靠多个目的地。",
      "example_en": "We went on a seven-day cruise to the Caribbean.",
      "example_cn": "我们进行了一次为期七天的加勒比海邮轮旅行。"
    },
    {
      "pos": "noun",
      "explanation_en": "The state or act of traveling at a steady speed, especially in a vehicle.",
      "explanation_cn": "指以恒定速度行驶的状态或行为，尤指在车辆中。",
      "example_en": "The car's cruise control kept the speed at 70 mph on the highway.",
      "example_cn": "汽车的定速巡航系统在高速公路上将车速保持在每小时70英里。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sail",
      "analysis": "“Sail” (航行) 通常特指乘船，尤其是借助风力的航行，强调与水和帆船的关联；而 “cruise” 更广泛，可指任何交通工具以稳定速度的平稳行驶，且常带有休闲、度假的意味，不一定依赖自然动力。"
    },
    {
      "word_to_compare": "travel",
      "analysis": "“Travel” (旅行) 是一个泛指从一地到另一地的移动行为，不强调方式、速度或目的；而 “cruise” 特指以恒定速度、舒适、非紧急的方式移动，常用于描述度假性质的旅程，语义更具体、更情境化。"
    },
    {
      "word_to_compare": "drive",
      "analysis": "“Drive” (驾驶) 强调主动操控车辆的过程，通常涉及频繁的加速、减速和转向；而 “cruise” 指的是在设定速度下保持匀速、无需频繁操作的行驶状态，常与定速巡航功能相关，更强调轻松与自动化。"
    }
  ]
}