{
  "word": "cruising",
  "pronunciation": "kroo·zihng",
  "concise_definition": "v. 巡航, 漫游, 闲逛; n. 巡航, 休闲航行",
  "forms": {
    "base_form": "cruise",
    "third_person_singular": "cruises",
    "past_tense": "cruised",
    "past_participle": "cruised",
    "present_participle": "cruising"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To travel steadily and smoothly, especially in a vehicle such as a ship, plane, or car, often at a constant speed and for pleasure or efficiency.",
      "explanation_cn": "指以稳定、平稳的速度旅行，尤指在船、飞机或汽车中，通常为了休闲或提高效率而保持恒定速度。",
      "example_en": "The luxury liner was cruising peacefully across the Mediterranean.",
      "example_cn": "这艘豪华邮轮正平静地巡航于地中海之上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To drive or move slowly and aimlessly through an area, often in search of entertainment, companionship, or opportunity.",
      "explanation_cn": "指在某区域缓慢、无目的地行驶或移动，通常是为了寻找娱乐、伴侣或机会。",
      "example_en": "He spent the evening cruising the downtown streets, looking for a place to hang out.",
      "example_cn": "他整晚在市中心街道上闲逛，想找地方消遣。"
    },
    {
      "pos": "noun",
      "explanation_en": "A journey made by a ship or boat, typically for pleasure, often involving multiple ports of call and onboard amenities.",
      "explanation_cn": "指以休闲为目的的船舶航行，通常包括多个停靠港口和船上设施。",
      "example_en": "We booked a two-week cruise to the Caribbean for our anniversary.",
      "example_cn": "我们为纪念日预订了一次为期两周的加勒比海邮轮之旅。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "driving",
      "analysis": "“Driving” (驾驶) 强调控制车辆进行有目的的移动，通常指向一个特定目的地，具有功能性。而 “cruising” 更强调轻松、无明确目标的移动，常带有休闲或漫游的意味，速度也往往更稳定、缓慢。"
    },
    {
      "word_to_compare": "sailing",
      "analysis": "“Sailing” (航行) 专指借助风力或动力在水上移动，强调交通工具（船）和介质（水）。而 “cruising” 是一个更广义的术语，可适用于船、车、飞机，且更侧重于旅行的休闲性质，而非运输方式本身。"
    },
    {
      "word_to_compare": "wandering",
      "analysis": "“Wandering” (漫游) 通常指步行或无固定路线的游荡，带有更强烈的随意性和不确定性，常用于人或动物。“Cruising” 则多用于交通工具，且常隐含一种有节奏、有控制的移动，即使没有明确目的地，也保持一定的速度和方向性。"
    }
  ]
}