{
  "word": "crunch",
  "pronunciation": "krunch",
  "concise_definition": "v. 咀嚼, 压碎; n. 咬碎声, 压 crunch",
  "forms": {
    "third_person_singular": "crunches",
    "past_tense": "crunched",
    "past_participle": "crunched",
    "present_participle": "crunching"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To bite or crush something with a loud, grinding sound, typically referring to hard or brittle food.",
      "explanation_cn": "用牙齿咬碎或压碎某物，通常发出响亮的嘎吱声，多用于描述坚硬或脆性食物。",
      "example_en": "She crunched on an apple while walking to class.",
      "example_cn": "她一边走路去上课，一边咔嚓咔嚓地啃着苹果。"
    },
    {
      "pos": "verb",
      "explanation_en": "To compress or squeeze something with great force, often resulting in damage or deformation.",
      "explanation_cn": "用巨大压力挤压或压缩某物，常导致损坏或变形。",
      "example_en": "The car was crunched in the collision.",
      "example_cn": "这辆车在碰撞中被压扁了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To work intensively under pressure, especially to meet a deadline, often involving long hours and heavy workloads.",
      "explanation_cn": "在压力下高强度工作，尤其指为赶截止日期而长时间加班、承担繁重任务。",
      "example_en": "We're crunching numbers to finish the quarterly report by Friday.",
      "example_cn": "我们正在加紧核算数据，以便在周五前完成季度报告。"
    },
    {
      "pos": "noun",
      "explanation_en": "A loud, sharp sound made by crushing or chewing something hard.",
      "explanation_cn": "因压碎或咀嚼坚硬物体而发出的响亮、尖锐的声音。",
      "example_en": "The crunch of gravel underfoot signaled we were approaching the driveway.",
      "example_cn": "脚下碎石的嘎吱声表明我们快到车道了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A period of intense pressure or financial strain, especially when resources are stretched thin or deadlines are looming.",
      "explanation_cn": "一段压力巨大或财务紧张的时期，尤其当资源紧张或截止日期临近时。",
      "example_en": "The company is facing a cash crunch this quarter.",
      "example_cn": "公司本季度正面临资金紧张的困境。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "chew",
      "analysis": "“Chew” (咀嚼) 指用牙齿磨碎食物，强调动作本身，不必然伴随声音；而 “crunch” 特指咀嚼时发出响亮的嘎吱声，强调听觉效果，常用于描述脆性食物。"
    },
    {
      "word_to_compare": "crush",
      "analysis": "“Crush” (压碎) 是更通用的物理动作，指施加压力使物体变形或破碎，不强调声音；而 “crunch” 通常包含声音元素，且常用于描述较脆物体（如饼干、骨头）被压碎时的特定声响。"
    },
    {
      "word_to_compare": "deadline",
      "analysis": "“Deadline” (截止日期) 是一个时间点，而 “crunch” 在名词用法中指围绕截止日期所经历的紧张压力期。例如，'the crunch before the deadline' 指的是临近截止时的高压阶段，而非日期本身。"
    }
  ]
}