{
  "word": "crunchy",
  "pronunciation": "krunch·ee",
  "concise_definition": "adj. 脆的, 发出嘎吱声的, 有嚼劲的",
  "forms": {
    "comparative": "crunchier",
    "superlative": "crunchiest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having a hard, brittle texture that makes a sharp, audible sound when bitten or crushed, often used to describe food such as vegetables, snacks, or cereals.",
      "explanation_cn": "具有坚硬、易碎的质地，咀嚼或压碎时会发出清脆响声，常用于描述蔬菜、零食或麦片等食物。",
      "example_en": "The salad had fresh, crunchy celery and carrots that added great texture.",
      "example_cn": "这道沙拉里有新鲜脆爽的芹菜和胡萝卜，增添了极佳的口感。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Figuratively describing something as having a sharp, energetic, or unconventional quality, often in music, fashion, or political views.",
      "explanation_cn": "比喻性地形容某事物具有鲜明、充满活力或非传统的特质，常用于描述音乐、时尚或政治观点。",
      "example_en": "Her indie band has a crunchy, raw sound that stands out in today’s polished pop scene.",
      "example_cn": "她的独立乐队拥有粗粝而富有张力的声音，在当今精致的流行乐坛中脱颖而出。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing a person or lifestyle that is perceived as earthy, natural, or countercultural, often associated with environmentalism or alternative living.",
      "explanation_cn": "形容一个人或生活方式显得质朴、自然或具有反主流文化色彩，常与环保主义或另类生活方式相关联。",
      "example_en": "He’s a crunchy granola type who only eats organic and bikes everywhere.",
      "example_cn": "他是个典型的‘天然派’，只吃有机食品，出行全靠骑自行车。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "crisp",
      "analysis": "“Crisp”（清脆的）强调的是轻快、干净、不油腻的脆感，常用于形容苹果、薯片或天气，带有优雅或清爽的联想；而 “crunchy” 更强调咀嚼时的强烈声响和物理阻力，更具粗犷、实在的质感。"
    },
    {
      "word_to_compare": "brittle",
      "analysis": "“Brittle”（易碎的）侧重于材料容易断裂、缺乏韧性，常含负面含义（如玻璃、老化塑料）；而 “crunchy” 是一种积极的口感特征，强调在断裂瞬间的愉悦声响，多用于食品和感官体验。"
    },
    {
      "word_to_compare": "chewy",
      "analysis": "“Chewy”（有嚼劲的）描述的是需要长时间咀嚼、富有弹性的质地（如太妃糖、牛皮糖），与 “crunchy” 形成鲜明对比：前者柔软耐嚼，后者坚硬短促、一咬即碎。两者常在食品描述中作为对立属性出现。"
    }
  ]
}