{
  "word": "crush",
  "pronunciation": "krush",
  "concise_definition": "n. 痴迷, 短暂的爱慕; v. 压碎, 挤压, 挫败",
  "forms": {
    "third_person_singular": "crushes",
    "past_tense": "crushed",
    "past_participle": "crushed",
    "present_participle": "crushing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A strong but usually short-lived romantic attraction or infatuation toward someone, often unrequited or idealized.",
      "explanation_cn": "指对某人产生的一种强烈但通常短暂的浪漫迷恋或倾慕，常为单相思或理想化的感情。",
      "example_en": "She had a crush on her history teacher in high school.",
      "example_cn": "她上高中时曾对历史老师产生过迷恋。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is the object of such romantic infatuation.",
      "explanation_cn": "指成为这种浪漫迷恋对象的人。",
      "example_en": "I told my best friend about my crush — he’s the one who sits next to me in math class.",
      "example_cn": "我告诉了我最好的朋友我的暗恋对象——他就是坐在数学课我旁边的那个男生。"
    },
    {
      "pos": "verb",
      "explanation_en": "To press or squeeze something with force so that it becomes flattened, broken, or deformed.",
      "explanation_cn": "指用力挤压某物，使其压扁、破碎或变形。",
      "example_en": "The car was crushed under the weight of the fallen bridge.",
      "example_cn": "汽车被倒塌的桥梁压得粉碎。"
    },
    {
      "pos": "verb",
      "explanation_en": "To defeat someone decisively or overwhelm them completely, especially in a competition or conflict.",
      "explanation_cn": "指在竞争或冲突中彻底击败或压倒某人。",
      "example_en": "Our team crushed the opponents in the final match with a score of 10–1.",
      "example_cn": "我们在决赛中以10比1的比分彻底击败了对手。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reduce something to a fine powder or pulp by grinding or pressing.",
      "explanation_cn": "指通过研磨或挤压将某物碾成粉末或浆状。",
      "example_en": "She crushed the garlic cloves with the side of a knife before adding them to the sauce.",
      "example_cn": "她在把蒜瓣加入酱汁前，用刀背将其压碎。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "infatuation",
      "analysis": "“Infatuation”（迷恋）与 “crush” 在情感意义上高度重叠，都指短暂、非理性的爱慕。但 “infatuation” 更正式、更常用于心理学或文学语境，强调情感的盲目性和不成熟；而 “crush” 更口语化，常用于日常对话，带有轻快甚至俏皮的色彩。"
    },
    {
      "word_to_compare": "squeeze",
      "analysis": "“Squeeze”（挤压）指施加压力使物体变形或从中挤出内容，动作较温和、可控，常用于挤果汁、捏肩膀等场景；而 “crush” 强调破坏性、毁灭性的压力，结果通常是变形、破碎或彻底压扁，语义强度更高。"
    },
    {
      "word_to_compare": "defeat",
      "analysis": "“Defeat”（击败）是通用词，指在比赛、战争或竞争中战胜对手，中性客观；而 “crush” 作为动词时，强调压倒性的优势和彻底的失败，带有强烈的情感色彩和视觉冲击力，常用于强调悬殊的比分或心理上的碾压。"
    }
  ]
}