{
  "word": "crusher",
  "pronunciation": "kroo·sher",
  "concise_definition": "n. 破碎机, 压碎者, 压倒性优势者",
  "forms": {
    "plural": "crushers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A machine designed to crush or grind hard materials such as rocks, minerals, or waste into smaller pieces, commonly used in mining, construction, and recycling industries.",
      "explanation_cn": "一种用于破碎或研磨岩石、矿物或废弃物等坚硬材料成小块的机器，常用于采矿、建筑和回收行业。",
      "example_en": "The quarry uses a massive rock crusher to break down boulders for road construction.",
      "example_cn": "采石场使用一台巨大的岩石破碎机将巨石粉碎，用于道路建设。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that overwhelms or defeats another decisively, often in a competitive or emotional context.",
      "explanation_cn": "指在竞争或情感情境中以压倒性优势击败或击垮他人的人或事物。",
      "example_en": "She was the ultimate crusher in the debate, leaving her opponent speechless.",
      "example_cn": "她在辩论中是绝对的压倒性赢家，让对手哑口无言。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of candy or confection that is hard and designed to be crushed in the mouth, often with a crunchy texture.",
      "explanation_cn": "一种坚硬的糖果或甜点，设计为在口中咬碎，通常具有酥脆的口感。",
      "example_en": "He reached for a chocolate crusher after dinner, craving something sweet and crunchy.",
      "example_cn": "晚饭后他拿了一块巧克力脆糖，想吃点又甜又脆的东西。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "crusher",
      "analysis": "“Crusher” 作为机器时，与 “grinder”（研磨机）相似，但 “crusher” 更强调通过压力将大块物体破碎成碎片，而 “grinder” 更侧重于精细研磨成粉末。作为比喻义时，与 “dominator”（支配者）或 “overwhelmer”（压倒者）相近，但 “crusher” 更具暴力和毁灭性的意象，常用于体育或辩论中形容彻底击败对手。"
    },
    {
      "word_to_compare": "breaker",
      "analysis": "“Breaker”（破坏者）泛指任何造成断裂或中断的事物，如海浪破坏者、电路断路器，其动作更偏向于“断裂”而非“压碎”。“Crusher” 则强调施加巨大压力使物体变形或粉碎，动作更重、更彻底。"
    },
    {
      "word_to_compare": "smasher",
      "analysis": "“Smasher”（砸碎者）与 “crusher” 在口语中常可互换，但 “smasher” 更常用于描述通过撞击或猛击造成破坏（如棒球击球手），而 “crusher” 更强调持续性压力下的粉碎，如机械压碎或情感上的彻底击垮。"
    }
  ]
}