{
  "word": "crushes",
  "pronunciation": "krush·iz",
  "concise_definition": "n. 痴迷, 短暂的爱慕; v. 压碎, 挤压; (复数形式) 多个痴迷对象或压碎行为",
  "forms": {
    "singular": "crush",
    "third_person_singular": "crushes",
    "past_tense": "crushed",
    "past_participle": "crushed",
    "present_participle": "crushing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A strong but usually short-lived romantic attraction or infatuation toward someone, often experienced during adolescence or in unrequited situations.",
      "explanation_cn": "指对某人产生的一种强烈但通常短暂的浪漫迷恋或倾慕，常出现在青春期或单恋情境中。",
      "example_en": "She had a crush on her math teacher in high school.",
      "example_cn": "她上高中时曾对数学老师产生过迷恋。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is the object of such an infatuation; often used in plural to refer to multiple such individuals.",
      "explanation_cn": "指成为这种迷恋对象的人；常以复数形式出现，表示多个迷恋对象。",
      "example_en": "He still talks about his high school crushes like they were movie stars.",
      "example_cn": "他至今仍像谈论电影明星一样谈论他高中时的暗恋对象。"
    },
    {
      "pos": "verb",
      "explanation_en": "To press or squeeze something with force, causing it to become flattened, broken, or deformed.",
      "explanation_cn": "指用力挤压某物，使其变平、破碎或变形。",
      "example_en": "The car was crushed under the weight of the fallen bridge.",
      "example_cn": "汽车被倒塌的桥梁压得粉碎。"
    },
    {
      "pos": "verb",
      "explanation_en": "To defeat someone overwhelmingly, especially in a competition or contest.",
      "explanation_cn": "指在竞争或比赛中彻底击败某人。",
      "example_en": "Our team crushed the opponents in the final match.",
      "example_cn": "我们的球队在决赛中以压倒性优势击败了对手。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "infatuation",
      "analysis": "“Infatuation” (迷恋) 与 “crush” 意义高度重叠，都指短暂的、非理性的爱慕。但 “infatuation” 更正式、更常用于心理学或书面语境，而 “crush” 更口语化，常用于青少年语境，且常带有轻松或戏谑的语气。"
    },
    {
      "word_to_compare": "squeeze",
      "analysis": "“Squeeze” (挤压) 指施加压力使物体变形或从中挤出内容，强调动作的持续性和控制性，如挤牙膏、挤果汁。而 “crush” 强调的是破坏性、一次性、高强度的压迫，常导致结构破坏，语义更强烈。"
    },
    {
      "word_to_compare": "defeat",
      "analysis": "“Defeat” (击败) 是通用词，泛指在竞争中战胜对手，中性且正式。而 “crush” 作为动词时，强调压倒性的胜利，带有强烈的主观情绪色彩，常用于口语或体育评论中，传达一种碾压式的优越感。"
    }
  ]
}