{
  "word": "crusade",
  "pronunciation": "kroo·seyd",
  "concise_definition": "n. 十字军东征, 运动; v. 发起运动, 奋力倡导",
  "forms": {
    "third_person_singular": "crusades",
    "past_tense": "crusaded",
    "past_participle": "crusaded",
    "present_participle": "crusading"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A military expedition, especially one of the medieval campaigns launched by European Christians to reclaim the Holy Land from Muslim control.",
      "explanation_cn": "指中世纪欧洲基督徒为从穆斯林手中夺回圣地而发起的军事远征，尤指历史上著名的多次十字军东征。",
      "example_en": "The First Crusade began in 1096 and resulted in the capture of Jerusalem.",
      "example_cn": "第一次十字军东征始于1096年，并最终攻占了耶路撒冷。"
    },
    {
      "pos": "noun",
      "explanation_en": "A vigorous and passionate campaign to achieve a social, political, or moral goal, often with a sense of moral righteousness.",
      "explanation_cn": "指为实现某种社会、政治或道德目标而发起的充满热情和坚定信念的运动，常带有道德正义感。",
      "example_en": "She has been crusading for better healthcare access for low-income families.",
      "example_cn": "她一直为低收入家庭争取更好的医疗保障而奔走呼号。"
    },
    {
      "pos": "verb",
      "explanation_en": "To actively and passionately campaign for a cause, especially one perceived as morally right or urgently needed.",
      "explanation_cn": "指积极而热情地为某一事业奔走倡导，尤指那些被视为道德正确或迫切需要的事业。",
      "example_en": "He crusaded against corruption in government for over two decades.",
      "example_cn": "他二十多年来一直致力于反对政府腐败。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "campaign",
      "analysis": "“Campaign”（运动）是一个中性词，泛指为实现特定目标（如选举、销售、政策改革）而组织的有计划活动，可强可弱，可正式可商业。而 “crusade” 带有强烈的情感色彩和道德使命感，通常暗示一种近乎宗教般的热情和正义感，语气更激烈、更理想化。"
    },
    {
      "word_to_compare": "movement",
      "analysis": "“Movement”（运动）指由大量人群参与的、长期的社会或政治变革趋势，强调集体性和结构性，如民权运动、环保运动。而 “crusade” 更侧重于个人或小团体发起的、带有强烈个人信念的倡导行为，常以领导者为核心，更具战斗性和使命感。"
    },
    {
      "word_to_compare": "war",
      "analysis": "“War”（战争）是国家或群体之间使用暴力手段进行的武装冲突，强调军事对抗和实际暴力。而 “crusade” 虽源于军事远征，但在现代用法中多为比喻义，指非暴力的道德或社会斗争，其“战斗性”是象征性的，而非物理性的。"
    }
  ]
}