{
  "word": "crushed",
  "pronunciation": "kroosh·d",
  "concise_definition": "adj. 被压碎的, 被压扁的; v. 压碎, 压扁, 摧毁; n. 暗恋对象",
  "forms": {
    "base_form": "crush",
    "present_participle": "crushing",
    "past_tense": "crushed",
    "past_participle": "crushed"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To press or squeeze something with great force until it is flattened, broken, or reduced to pieces.",
      "explanation_cn": "指用极大的力量挤压某物，使其压扁、破碎或变成碎片。",
      "example_en": "The car was crushed under the weight of the fallen bridge.",
      "example_cn": "汽车被倒塌的桥梁压得粉碎。"
    },
    {
      "pos": "verb",
      "explanation_en": "To defeat or overwhelm someone or something completely, often in a competition or emotional context.",
      "explanation_cn": "指在竞争或情感上彻底击败或压倒某人或某事物。",
      "example_en": "Her performance crushed all competition at the talent show.",
      "example_cn": "她在才艺表演中的表现彻底碾压了所有竞争对手。"
    },
    {
      "pos": "verb",
      "explanation_en": "To experience an intense but often short-lived romantic attraction to someone, typically without reciprocation.",
      "explanation_cn": "指对某人产生强烈但通常是短暂的浪漫好感，通常没有得到回应。",
      "example_en": "She had a crush on her math teacher since middle school.",
      "example_cn": "她从中学起就暗恋她的数学老师。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that has been physically flattened or broken into small pieces by pressure.",
      "explanation_cn": "形容因受压而被压扁或压成碎片的状态。",
      "example_en": "The crushed leaves released a strong herbal scent.",
      "example_cn": "压碎的叶子散发出浓郁的草本香气。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "smashed",
      "analysis": "“Smashed”（砸碎）强调暴力性的、突然的破坏，常用于玻璃、容器等硬物被击碎的情境，语气更强烈、更粗暴。而 “crushed” 更侧重于通过持续压力导致的变形或粉碎，可能更缓慢或更全面，如被重物压扁。"
    },
    {
      "word_to_compare": "destroyed",
      "analysis": "“Destroyed”（摧毁）是更广泛的术语，指彻底毁坏，可能包括焚烧、爆炸、拆除等，不局限于物理挤压。而 “crushed” 仅指因压力导致的形态改变，破坏方式更具体、更物理化。"
    },
    {
      "word_to_compare": "infatuated",
      "analysis": "“Infatuated”（着迷）是描述浪漫情感的正式术语，强调一种盲目、热烈但不成熟的迷恋，常用于心理层面。而 “crush” 作为名词或动词时更口语化，常用于青少年或轻度情感，带有短暂性和非正式色彩。"
    }
  ]
}