{
  "word": "crust",
  "pronunciation": "krust",
  "concise_definition": "n. 壳, 外皮, 地壳; v. 形成外壳",
  "forms": {
    "plural": "crusts"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The hard, outer layer of something, especially food such as bread or pizza, formed by baking or cooking.",
      "explanation_cn": "指某种事物（尤其是面包、披萨等食物）经烘烤或烹制后形成的坚硬外层。",
      "example_en": "She prefers her pizza with a thin, crispy crust.",
      "example_cn": "她更喜欢薄而酥脆的披萨饼底。"
    },
    {
      "pos": "noun",
      "explanation_en": "The outermost solid layer of the Earth, composed of rock and extending from the surface to the upper mantle.",
      "explanation_cn": "指地球最外层的固体部分，由岩石构成，从地表延伸至地幔上部。",
      "example_en": "Tectonic plates float on the mantle beneath the Earth's crust.",
      "example_cn": "板块漂浮在地球地壳下方的地幔之上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A hard, dry layer or coating that forms on a surface, often due to drying, freezing, or accumulation of debris.",
      "explanation_cn": "指因干燥、冻结或杂物堆积而在表面形成的坚硬、干燥的层或覆盖物。",
      "example_en": "A crust of mud had formed on the boots after the hike.",
      "example_cn": "徒步后，靴子上结了一层泥壳。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form a hard outer layer or coating on a surface, typically through drying, cooling, or chemical reaction.",
      "explanation_cn": "指通过干燥、冷却或化学反应在表面形成坚硬的外层或覆盖物。",
      "example_en": "The paint began to crust over in the hot sun.",
      "example_cn": "油漆在烈日下开始结皮。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "shell",
      "analysis": "“Shell”（壳）通常指生物体（如蛋、贝类、坚果）天然形成的坚硬保护层，强调其结构的完整性和保护功能；而 “crust” 更常用于非生物或地质语境，指由外部条件（如加热、干燥）形成的硬层，不一定具有生物起源或完整包裹性。"
    },
    {
      "word_to_compare": "rind",
      "analysis": "“Rind”（外皮）特指水果或奶酪等食物的天然外皮，通常较薄且可食用，如橙子皮或奶酪表皮；而 “crust” 更强调通过加工（如烘烤）形成的坚硬、非天然的表层，常不可食用或质地更硬。"
    },
    {
      "word_to_compare": "surface",
      "analysis": "“Surface”（表面）是一个中性、泛指的词，指任何物体的最外层，不涉及质地或形成方式；而 “crust” 特指具有硬度、厚度或结壳特征的表面，隐含了物理或化学变化的过程，语义更具体、更具质感。"
    }
  ]
}