{
  "word": "crutches",
  "pronunciation": "kruch·iz",
  "concise_definition": "n. 拐杖, 依赖物, 借口",
  "forms": {
    "singular": "crutch"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A physical support device, typically made of wood or metal, used to help a person with a leg injury or disability walk by transferring weight from the legs to the upper body.",
      "explanation_cn": "一种物理辅助工具，通常由木头或金属制成，用于帮助腿部受伤或残疾的人行走，通过将体重从腿部转移到上半身来提供支撑。",
      "example_en": "After his surgery, he needed crutches to get around for several weeks.",
      "example_cn": "手术后，他需要拐杖辅助行走数周。"
    },
    {
      "pos": "noun",
      "explanation_en": "Something relied upon for support or assistance, especially when lacking the ability or confidence to function independently; often used metaphorically to describe psychological or emotional dependencies.",
      "explanation_cn": "指在缺乏独立能力或信心时所依赖的支撑物，常用于隐喻，形容心理或情感上的依赖。",
      "example_en": "For many people, social media has become a crutch to avoid real human connection.",
      "example_cn": "对许多人来说，社交媒体已成为逃避真实人际交往的依赖物。"
    },
    {
      "pos": "noun",
      "explanation_en": "An excuse or justification used to defend or explain away behavior, especially when it is irrational or inadequate.",
      "explanation_cn": "指用来为某种行为辩护或开脱的借口，尤其当该行为非理性或不充分时。",
      "example_en": "His constant lateness wasn't due to traffic—it was just a crutch to avoid responsibility.",
      "example_cn": "他总是迟到并不是因为交通堵塞，而只是逃避责任的借口。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "support",
      "analysis": "“Support”（支持）是一个更广泛、更中性的词，可指任何形式的帮助或支撑，包括情感、经济或物理层面。而 “crutch” 带有负面或依赖性含义，暗示这种支持是临时的、非健康的，或阻碍了独立发展。"
    },
    {
      "word_to_compare": "aid",
      "analysis": "“Aid”（援助）通常指积极、有益的帮助，常用于正式或人道主义语境（如医疗援助）。而 “crutch” 强调一种被动依赖，甚至可能延缓康复或成长，带有贬义色彩。"
    },
    {
      "word_to_compare": "excuse",
      "analysis": "“Excuse”（借口）与 “crutch” 在隐喻义上相近，但 “excuse” 更侧重于为错误行为找理由，而 “crutch” 更强调一种长期的心理依赖或惯性依赖，不一定是故意撒谎，而是一种无意识的逃避机制。"
    }
  ]
}