{
  "word": "crystal",
  "pronunciation": "kris·tl",
  "concise_definition": "n. 水晶, 晶体; adj. 晶莹的, 清澈的",
  "forms": {
    "plural": "crystals"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A solid material whose constituents (such as atoms, molecules, or ions) are arranged in a highly ordered, repeating pattern extending in all three spatial dimensions.",
      "explanation_cn": "指由原子、分子或离子以高度有序、重复的模式在三维空间中排列而成的固体物质，具有规则的几何外形。",
      "example_en": "Quartz is a common mineral that forms natural crystals.",
      "example_cn": "石英是一种常见的能形成天然晶体的矿物。"
    },
    {
      "pos": "noun",
      "explanation_en": "A transparent, colorless form of quartz, often used in jewelry or decorative objects due to its clarity and brilliance.",
      "explanation_cn": "指一种透明无色的石英，因其清澈和光泽常被用于珠宝或装饰品。",
      "example_en": "She wore a delicate necklace made of clear crystal.",
      "example_cn": "她戴着一条由透明水晶制成的精致项链。"
    },
    {
      "pos": "noun",
      "explanation_en": "A glassware item, especially a drinking vessel, made of high-quality, transparent glass that rings when tapped.",
      "explanation_cn": "指一种高质量、透明的玻璃器皿，尤指酒杯，轻敲时会发出清脆声响。",
      "example_en": "They toasted with crystal goblets filled with champagne.",
      "example_cn": "他们举着装满香槟的水晶高脚杯干杯。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Perfectly clear or transparent, often used to describe clarity of vision, sound, or expression.",
      "explanation_cn": "形容极其清晰、透明，常用于描述视觉、声音或表达的明澈无碍。",
      "example_en": "The lake was crystal clear, revealing every pebble on the bottom.",
      "example_cn": "湖水清澈见底，每一块小石子都清晰可见。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "glass",
      "analysis": "“Glass” (玻璃) 是一种泛指的无机非金属材料，通常为非晶态，质地较普通，不一定透明或有光泽。而 “crystal” 特指具有高度有序结构的矿物晶体，或指含铅量高、更重更亮的优质玻璃器皿，具有更佳的折射率和清脆音质。"
    },
    {
      "word_to_compare": "mineral",
      "analysis": "“Mineral” (矿物) 是一个更广泛的地质学术语，指自然界中天然形成的无机固体，具有特定化学成分和晶体结构。所有水晶（如石英）都是矿物，但并非所有矿物都是水晶。例如，铁矿石是矿物但不是水晶。"
    },
    {
      "word_to_compare": "clear",
      "analysis": "“Clear” (清晰的) 是一个通用形容词，可描述任何透明或易理解的事物，如天气、语言或情绪。而 “crystal” 作为形容词时，强调的是一种近乎完美的、如水晶般纯净透亮的清晰度，带有更强的感官意象和文学色彩。"
    }
  ]
}