{
  "word": "csi",
  "pronunciation": "sē·ī·ˈes",
  "concise_definition": "n. 刑事调查科, 犯罪现场调查, 电脑系统集成",
  "forms": {
    "plural": "csis"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A specialized unit within a police force responsible for investigating crimes by collecting and analyzing physical evidence at crime scenes; commonly associated with forensic science and television dramas.",
      "explanation_cn": "警察部门中专门负责通过收集和分析犯罪现场的物证来调查犯罪的单位；常与法医学及电视剧集相关联。",
      "example_en": "The CSI team arrived at the scene within minutes to collect fingerprints and DNA samples.",
      "example_cn": "刑事调查科团队在几分钟内抵达现场，收集指纹和DNA样本。"
    },
    {
      "pos": "noun",
      "explanation_en": "A television crime drama series, most notably 'CSI: Crime Scene Investigation,' which popularized the portrayal of forensic investigators solving crimes through scientific methods.",
      "explanation_cn": "一部电视犯罪剧集，最著名的是《CSI：犯罪现场调查》，该剧通过科学方法描绘法医调查员破案的过程，广受欢迎。",
      "example_en": "Many students are inspired to pursue forensic careers after watching CSI.",
      "example_cn": "许多学生在观看《CSI》后受到启发，立志从事法医工作。"
    },
    {
      "pos": "noun",
      "explanation_en": "Computer Systems Integration: The process of connecting different computer systems, software, and hardware components to function as a unified whole.",
      "explanation_cn": "计算机系统集成：将不同的计算机系统、软件和硬件组件连接起来，使其作为一个统一的整体运行。",
      "example_en": "The company hired a consultant to handle the CSI of its legacy and new cloud-based platforms.",
      "example_cn": "该公司聘请了一名顾问来处理其遗留系统与新云平台的系统集成。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "forensics",
      "analysis": "“Forensics”（法医学）是一个更广泛的术语，指所有应用于法律系统的科学方法，包括毒理学、弹道学、DNA分析等。而 “CSI” 通常特指执行现场调查的团队或节目，是法医学在实践和媒体中的具体体现。"
    },
    {
      "word_to_compare": "detective",
      "analysis": "“Detective”（侦探）泛指从事犯罪调查的警员，通常依赖证人证词、逻辑推理和传统调查手段；而 “CSI” 更强调通过物证和科学技术（如指纹比对、痕迹分析）进行破案，是技术导向型的调查方式。"
    },
    {
      "word_to_compare": "integration",
      "analysis": "在计算机领域，”integration“（集成）是通用术语，指任何系统或组件的整合；而 “CSI” 作为缩写特指”Computer Systems Integration“，是该术语在专业语境中的具体应用，具有行业特定含义。"
    }
  ]
}