{
  "word": "cue",
  "pronunciation": "kew",
  "concise_definition": "n. 暗号, 提示, 线索; v. 给提示, 发信号",
  "forms": {
    "plural": "cues",
    "third_person_singular": "cues",
    "past_tense": "cued",
    "past_participle": "cued",
    "present_participle": "cuing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A signal or prompt, often non-verbal, that indicates when someone should begin an action, especially in theater, film, or broadcasting.",
      "explanation_cn": "一种信号或提示，通常是非语言的，用于指示某人何时应开始行动，尤其在戏剧、电影或广播中。",
      "example_en": "The actor waited for the cue to enter the stage.",
      "example_cn": "演员等待入场的提示信号。"
    },
    {
      "pos": "noun",
      "explanation_en": "A hint or clue that helps someone understand or solve a problem, often based on subtle observations or context.",
      "explanation_cn": "一种暗示或线索，帮助某人理解或解决问题，通常基于细微的观察或上下文。",
      "example_en": "The broken window was a cue that someone had broken in.",
      "example_cn": "破碎的窗户是一个有人闯入的线索。"
    },
    {
      "pos": "noun",
      "explanation_en": "A long, tapered stick used to strike the balls in games such as pool or snooker.",
      "explanation_cn": "一种细长、锥形的棍子，用于击打台球或斯诺克中的球。",
      "example_en": "He picked up his cue and lined up the shot.",
      "example_cn": "他拿起球杆，瞄准击球。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give a signal or prompt to someone to begin an action, especially in a performance setting.",
      "explanation_cn": "在表演场合中，向某人发出开始行动的信号或提示。",
      "example_en": "The stage manager cued the lights to dim as the music began.",
      "example_cn": "舞台监督在音乐开始时示意灯光变暗。"
    },
    {
      "pos": "verb",
      "explanation_en": "To add a piece of audio or video to a playlist or sequence to be played next, especially in broadcasting or digital media.",
      "explanation_cn": "在广播或数字媒体中，将一段音频或视频添加到播放列表中，作为下一个播放的内容。",
      "example_en": "The DJ cued up the next track before the current one ended.",
      "example_cn": "DJ 在当前曲目结束前就预加载了下一首歌。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "signal",
      "analysis": "“Signal” (信号) 是一个更广泛、更通用的词，指任何传递信息的物理或抽象方式（如灯光、声音、手势）。而 “cue” 更特指在表演、媒体或程序中用于触发特定动作的预设提示，具有更强的程序性和时机性。"
    },
    {
      "word_to_compare": "hint",
      "analysis": "“Hint” (暗示) 通常用于信息或线索的间接传达，目的是引导对方推理或发现答案，常用于智力或情感语境。而 “cue” 更强调外部触发，是直接的、行为导向的提示，不一定需要理解其含义即可响应。"
    },
    {
      "word_to_compare": "prompt",
      "analysis": "“Prompt” (提示) 与 “cue” 在很多语境中可互换，尤其在戏剧或计算机界面中。但 “prompt” 更常用于语言或文字形式的引导（如系统提示），而 “cue” 更多用于非语言的、时机性的触发，尤其在表演艺术中。"
    }
  ]
}