{
  "word": "cues",
  "pronunciation": "kooz",
  "concise_definition": "n. 暗示, 线索, 台词, 信号",
  "forms": {
    "singular": "cue"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A signal or prompt, often nonverbal, that indicates when someone should take a specific action, especially in performance or communication contexts.",
      "explanation_cn": "一种暗示或提示，通常是非语言的，用于表明某人应在特定情境下采取某种行动，尤其在表演或沟通中。",
      "example_en": "The stage manager gave the actor a cue to enter the room.",
      "example_cn": "舞台监督给了演员一个进场的提示。"
    },
    {
      "pos": "noun",
      "explanation_en": "A piece of information or a subtle sign that helps someone understand or infer something, often used in problem-solving or observation.",
      "explanation_cn": "一种信息或细微的迹象，有助于某人理解或推断某事，常用于解决问题或观察情境中。",
      "example_en": "The detective found several clues and cues that pointed to the suspect’s alibi being false.",
      "example_cn": "侦探发现了几个线索和暗示，表明嫌疑人的不在场证明是假的。"
    },
    {
      "pos": "noun",
      "explanation_en": "The lines of dialogue that a performer must remember and respond to in a play or script, typically spoken by another actor.",
      "explanation_cn": "演员在戏剧或剧本中必须记住并回应的台词，通常由另一位演员说出。",
      "example_en": "She missed her cue and forgot to deliver her next line.",
      "example_cn": "她错过了自己的台词，忘了说下一句。"
    },
    {
      "pos": "noun",
      "explanation_en": "A stick used in cue sports such as pool or snooker to strike the balls.",
      "explanation_cn": "用于台球或斯诺克等台球运动中击打球杆的长杆。",
      "example_en": "He picked up his cue and lined up the shot carefully.",
      "example_cn": "他拿起球杆，仔细瞄准击球。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "clue",
      "analysis": "“Clue”（线索）通常指用于推理或调查的客观证据，强调逻辑性和发现性，多用于侦探或解谜语境；而 “cue” 更侧重于提示或信号，常用于行为引导，如表演、对话或操作中的触发点，主观性和即时性更强。"
    },
    {
      "word_to_compare": "signal",
      "analysis": "“Signal”（信号）是更广泛、更中性的术语，可指任何形式的通信指示，包括电子、视觉或听觉信号；而 “cue” 更特指在特定情境（如戏剧、对话、体育）中预设的、具有行为引导功能的提示，语境依赖性更强。"
    },
    {
      "word_to_compare": "prompt",
      "analysis": "“Prompt”（提示）与 “cue” 在表演和计算机语境中常可互换，但 “prompt” 更常用于系统或技术环境（如命令行提示），强调主动请求输入；而 “cue” 更多用于人际或艺术场景，强调被动接收并响应的时机。"
    },
    {
      "word_to_compare": "hint",
      "analysis": "“Hint”（暗示）通常指间接、含蓄的信息，目的是引导对方自行领悟，带有轻微的保密性；而 “cue” 更直接、明确，常作为行动的触发点，不依赖对方猜测，尤其在表演或协作中具有强制性。"
    }
  ]
}