{
  "word": "cultivated",
  "pronunciation": "kul·tuh·veyt·id",
  "concise_definition": "adj. 有教养的, 精心培育的, 有文化的",
  "forms": {
    "comparative": "more cultivated",
    "superlative": "most cultivated"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Referring to a person who has refined manners, broad knowledge, and an appreciation for the arts and intellectual pursuits, often as a result of education and exposure to high culture.",
      "explanation_cn": "形容一个人举止优雅、学识广博、富有艺术修养，通常源于良好的教育和对高雅文化的接触。",
      "example_en": "She is a cultivated woman who speaks five languages and enjoys classical music and fine art.",
      "example_cn": "她是一位有教养的女性，会说五种语言，喜爱古典音乐和美术。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing land or crops that have been carefully tended and improved through human effort, such as plowing, fertilizing, or irrigation.",
      "explanation_cn": "形容经过人为精心照料和改良的土地或作物，例如通过耕作、施肥或灌溉。",
      "example_en": "The farm features cultivated fields of wheat and organic vegetables.",
      "example_cn": "这个农场拥有精心耕作的小麦田和有机蔬菜地。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterizing behavior, tastes, or habits that are deliberately developed and refined rather than natural or spontaneous.",
      "explanation_cn": "形容经过刻意培养和锤炼而非天生或自发的行为、品味或习惯。",
      "example_en": "His cultivated silence during the debate suggested deep thought rather than disinterest.",
      "example_cn": "他在辩论中刻意保持沉默，显示出深思熟虑而非漠不关心。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "refined",
      "analysis": "“Refined”（精致的）强调去除粗俗或原始成分后的优雅与精致，常用于形容品味、语言或行为的高雅。而 “cultivated” 更强调通过长期教育、努力和环境熏陶所获得的修养，带有主动培育的意味。"
    },
    {
      "word_to_compare": "educated",
      "analysis": "“Educated”（受过教育的）侧重于正式学习和知识积累，如学历或学术训练。而 “cultivated” 不仅包含知识，更强调文化素养、审美能力和社交风度，范围更广，更偏向人文修养。"
    },
    {
      "word_to_compare": "tended",
      "analysis": "“Tended”（照料的）是 “cultivated” 在农业语境下的近义词，但仅指物理上的护理行为，如浇水、除草。而 “cultivated” 在此语境下隐含了系统性、长期性和目的性，不仅照料，更追求品质提升。"
    }
  ]
}