{
  "word": "cult",
  "pronunciation": "kult",
  "concise_definition": "n. 崇拜, 迷信, 狂热追随; 小众宗教团体",
  "forms": {
    "plural": "cults"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A system of religious worship, often centered around a particular person, object, or idea, typically characterized by intense devotion and ritual practices that may be considered extreme or unconventional by mainstream society.",
      "explanation_cn": "一种宗教崇拜体系，通常围绕某个人、物体或理念展开，以强烈的虔诚和仪式性实践为特征，这些实践常被主流社会视为极端或非正统。",
      "example_en": "The cult of personality surrounding the dictator attracted widespread criticism.",
      "example_cn": "围绕这位独裁者形成的个人崇拜引发了广泛批评。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, often secretive religious or spiritual group whose beliefs and practices are considered unusual or extreme, and which may exert excessive control over its members.",
      "explanation_cn": "一个小型、常为秘密的宗教或灵性团体，其信仰和实践被视为异常或极端，且可能对成员施加过度控制。",
      "example_en": "Authorities raided the compound after reports that the cult had isolated its members from the outside world.",
      "example_cn": "有报道称该教派将成员与外界隔绝，当局遂突袭了其据点。"
    },
    {
      "pos": "noun",
      "explanation_en": "An intense and often obsessive devotion to or admiration of a person, thing, or idea, especially in popular culture or among a specific group.",
      "explanation_cn": "对某人、某物或某种理念的强烈甚至痴迷的崇拜或钦佩，尤其在流行文化或特定群体中。",
      "example_en": "There's a cult following for that obscure 1970s sci-fi movie.",
      "example_cn": "那部冷门的1970年代科幻电影拥有大批狂热粉丝。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "religion",
      "analysis": "“Religion”（宗教）指系统化、制度化、被广泛接受的信仰体系，通常拥有悠久历史、正式组织和大量信徒。而 “cult” 通常指边缘化、小规模、常被主流视为异端的信仰团体，带有负面或贬义色彩。"
    },
    {
      "word_to_compare": "sect",
      "analysis": "“Sect”（教派）是宗教内部因教义分歧而分裂出的小团体，通常仍根植于主流宗教传统（如基督教中的新教各派）。而 “cult” 往往完全脱离传统宗教框架，甚至创立全新信仰体系，且更强调对领袖的绝对服从。"
    },
    {
      "word_to_compare": "fandom",
      "analysis": "“Fandom”（粉丝群体）指对某位名人、作品或IP的热爱与追随，虽可能表现出狂热，但通常不涉及宗教性仪式、精神控制或封闭性组织。而 “cult” 在文化语境中虽可借指狂热粉丝群，但其本质仍包含信仰、崇拜与控制等宗教性维度，语义更沉重。"
    }
  ]
}