{
  "word": "cults",
  "pronunciation": "kults",
  "concise_definition": "n. 邪教, 个人崇拜, 极端崇拜",
  "forms": {
    "singular": "cult"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A group of people who follow an extreme or unorthodox religious, spiritual, or philosophical belief system, often under the influence of a charismatic leader, and which may involve manipulation, isolation, or exploitation of members.",
      "explanation_cn": "指一群追随极端或非正统宗教、精神或哲学信仰体系的人，通常在一位富有魅力的领袖影响下活动，可能涉及对成员的操控、孤立或剥削。",
      "example_en": "The police raided the compound after reports that the cult had been holding members against their will.",
      "example_cn": "在接到该邪教非法拘禁成员的举报后，警方突袭了其据点。"
    },
    {
      "pos": "noun",
      "explanation_en": "An intense and often excessive devotion to or admiration of a person, idea, or thing, especially when it borders on irrational or obsessive behavior.",
      "explanation_cn": "指对某人、某种思想或事物的强烈甚至过度的崇拜或迷恋，尤其当这种崇拜接近非理性或强迫性行为时。",
      "example_en": "There's a cult of personality surrounding the celebrity, with fans treating her like a goddess.",
      "example_cn": "这位名人周围存在着一种个人崇拜，粉丝们将她奉若神明。"
    },
    {
      "pos": "noun",
      "explanation_en": "A system of religious veneration and ritual directed toward a particular figure or object, often outside mainstream religious traditions.",
      "explanation_cn": "指围绕某一特定人物或物体建立的宗教崇拜与仪式体系，通常不属于主流宗教传统。",
      "example_en": "Ancient civilizations often had cults dedicated to nature deities like the sun or the moon.",
      "example_cn": "古代文明常设有崇拜太阳或月亮等自然神祇的崇拜体系。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sect",
      "analysis": "“Sect”（教派）通常指从主流宗教中分裂出来的小型团体，虽有独特教义，但未必具有操控性或非法性；而 “cult” 更强调极端性、对领袖的盲目服从及对成员的控制，常带有负面含义。"
    },
    {
      "word_to_compare": "fanaticism",
      "analysis": "“Fanaticism”（狂热）描述的是个体或群体对某种信仰或理念的极端热忱，是一种心理状态；而 “cult” 是一个组织实体，可能催生 fanaticism，但本身是结构性的社会群体。"
    },
    {
      "word_to_compare": "fandom",
      "analysis": "“Fandom”（粉丝群体）指对某位名人、作品或IP的热爱与追随，通常是健康、公开且无强制性的；而 “cult” 暗示着排他性、精神控制和潜在危害，二者在社会接受度和伦理边界上有本质区别。"
    }
  ]
}