{
  "word": "culture",
  "pronunciation": "kul·chur",
  "concise_definition": "n. 文化, 文明, 培养, 理解力",
  "forms": {
    "plural": "cultures"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The customs, arts, social institutions, and achievements of a particular nation, people, or other social group, encompassing shared beliefs, values, behaviors, and traditions passed down through generations.",
      "explanation_cn": "指特定国家、民族或社会群体的风俗、艺术、社会制度和成就，涵盖代代相传的共同信仰、价值观、行为方式和传统。",
      "example_en": "Japanese culture places a strong emphasis on respect, harmony, and ritual etiquette.",
      "example_cn": "日本文化高度重视尊重、和谐与礼仪规范。"
    },
    {
      "pos": "noun",
      "explanation_en": "The set of attitudes, values, goals, and practices that characterizes an institution, organization, or group, such as a company or a scientific community.",
      "explanation_cn": "指某一机构、组织或群体所特有的态度、价值观、目标和实践方式，如公司文化或学术圈文化。",
      "example_en": "The company has a culture of innovation and open communication.",
      "example_cn": "这家公司拥有鼓励创新和开放沟通的文化。"
    },
    {
      "pos": "noun",
      "explanation_en": "The cultivation or breeding of microorganisms, plants, or tissues under controlled conditions, especially in a laboratory setting.",
      "explanation_cn": "指在受控条件下（尤其在实验室中）培养微生物、植物或组织的行为或过程。",
      "example_en": "The microbiologist grew a bacterial culture to study antibiotic resistance.",
      "example_cn": "这位微生物学家培养了一种细菌培养物，以研究抗生素耐药性。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "civilization",
      "analysis": "“Civilization” (文明) 通常指具有复杂社会结构、城市、政府和文字系统的高级社会形态，强调物质与制度层面的成就，如古埃及文明或中华文明。而 “culture” 更广泛，涵盖精神、艺术、习俗等非物质层面，一个文明可以包含多种文化。"
    },
    {
      "word_to_compare": "society",
      "analysis": "“Society” (社会) 指由相互关联的个体组成的群体结构，强调人际关系、组织和制度的集合。而 “culture” 是这个社会所共享的思想、行为和符号系统。简言之，社会是人与人的关系网络，文化是这个网络中的精神内容。"
    },
    {
      "word_to_compare": "tradition",
      "analysis": "“Tradition” (传统) 是文化的一部分，特指代代相传的习俗、仪式或信仰，具有历史延续性。而 “culture” 是一个更全面的概念，包含传统，也包括现代创新、流行趋势和亚文化等动态元素。传统是文化的静态组成部分，文化则是动态的整体。"
    }
  ]
}