{
  "word": "cup",
  "pronunciation": "kup",
  "concise_definition": "n. 杯子, 杯状物, 奖杯; v. 用手捧住",
  "forms": {
    "plural": "cups"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small, open container, typically made of ceramic, glass, or plastic, used for drinking liquids such as tea, coffee, or water.",
      "explanation_cn": "一种小型开口容器，通常由陶瓷、玻璃或塑料制成，用于盛装茶、咖啡或水等液体饮品。",
      "example_en": "She sipped her tea from a delicate porcelain cup.",
      "example_cn": "她从小巧的瓷杯中啜饮着茶。"
    },
    {
      "pos": "noun",
      "explanation_en": "A trophy or award, often in the shape of a cup, given to the winner of a competition or contest.",
      "explanation_cn": "一种奖杯，通常呈杯状，授予比赛或竞赛的获胜者。",
      "example_en": "The team lifted the championship cup after a thrilling victory.",
      "example_cn": "球队在一场激动人心的胜利后举起了冠军奖杯。"
    },
    {
      "pos": "noun",
      "explanation_en": "A unit of volume used in cooking, especially in the United States, equal to 8 fluid ounces or approximately 237 milliliters.",
      "explanation_cn": "一种用于烹饪的容量单位，尤其在美国使用，等于8液量盎司，约237毫升。",
      "example_en": "The recipe calls for two cups of flour and one cup of sugar.",
      "example_cn": "这个食谱需要两杯面粉和一杯糖。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hold or cradle something gently in the hands, especially to support or protect it.",
      "explanation_cn": "用手轻轻捧住或环抱某物，通常是为了支撑或保护它。",
      "example_en": "He cupped the injured bird in his hands and carried it to the vet.",
      "example_cn": "他用手捧住受伤的小鸟，带它去看了兽医。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "glass",
      "analysis": "“Glass”（玻璃杯）通常指由玻璃制成、壁较薄、常用于盛装水或酒的容器，强调材质和透明性；而 “cup” 更泛指任何杯状容器，材质多样（陶瓷、塑料等），且常用于热饮，有时带把手。"
    },
    {
      "word_to_compare": "mug",
      "analysis": "“Mug”（马克杯）是 “cup” 的一种子类，通常更大、有把手，专用于热饮如咖啡或茶，且更厚重耐用；而 “cup” 是更通用的术语，可指任何小型饮具，包括无把手的茶杯或纸杯。"
    },
    {
      "word_to_compare": "bowl",
      "analysis": "“Bowl”（碗）是深而宽的容器，主要用于盛放固体食物如汤、沙拉或谷物，开口较大且无明确边缘；而 “cup” 通常较浅、有明确边缘，主要用于液体，且更便于手持饮用。"
    }
  ]
}