{
  "word": "cups",
  "pronunciation": "kups",
  "concise_definition": "n. 杯子, 杯状物, 杯形量具, 杯赛冠军",
  "forms": {
    "singular": "cup"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small, open container, typically made of ceramic, glass, or plastic, used for drinking liquids such as water, tea, or coffee.",
      "explanation_cn": "一种小型开口容器，通常由陶瓷、玻璃或塑料制成，用于盛装饮用水、茶或咖啡等液体。",
      "example_en": "She sipped her tea from a delicate porcelain cup.",
      "example_cn": "她从一个精致的瓷杯中啜饮着茶。"
    },
    {
      "pos": "noun",
      "explanation_en": "A standardized unit of volume used in cooking, especially in the United States, equal to 8 fluid ounces or approximately 237 milliliters.",
      "explanation_cn": "烹饪中使用的标准体积单位，尤其在美国，等于8液量盎司（约237毫升）。",
      "example_en": "The recipe calls for two cups of flour and one cup of sugar.",
      "example_cn": "这个食谱需要两杯面粉和一杯糖。"
    },
    {
      "pos": "noun",
      "explanation_en": "A trophy or award in the shape of a cup, given to the winner of a competition, especially in sports or tournaments.",
      "explanation_cn": "一种杯状奖杯，授予体育比赛或锦标赛的优胜者。",
      "example_en": "The team lifted the championship cup after a thrilling final match.",
      "example_cn": "球队在一场激动人心的决赛后举起了冠军奖杯。"
    },
    {
      "pos": "noun",
      "explanation_en": "A cup-shaped part or structure, such as the cup of a bra or the cup of a mushroom.",
      "explanation_cn": "呈杯状的部位或结构，如文胸的罩杯或蘑菇的菌盖。",
      "example_en": "The mushroom's cup caught the morning dew.",
      "example_cn": "蘑菇的菌盖上凝结着晨露。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "glass",
      "analysis": "“Glass”（玻璃杯）通常指由玻璃制成的、更透明、更薄壁的饮具，常用于盛装水、酒或果汁，强调材质和透明性；而 “cup” 更泛指任何杯状容器，材质多样，可能带把手，更常用于热饮或日常使用。"
    },
    {
      "word_to_compare": "mug",
      "analysis": "“Mug”（马克杯）是“cup”的一种，通常更大、更厚重，有把手，专用于热饮如咖啡或茶，强调实用性和保温性；而 “cup” 是更通用的术语，可指任何尺寸或用途的杯状物，包括无把手的小杯。"
    },
    {
      "word_to_compare": "bowl",
      "analysis": "“Bowl”（碗）是开口更大、更深的容器，主要用于盛放固体或半固体食物（如汤、沙拉、谷物），而 “cup” 通常较浅，主要用于液体或小份量食物，且常用于饮用。"
    }
  ]
}