{
  "word": "cured",
  "pronunciation": "kyoord",
  "concise_definition": "adj. 已治愈的, 经过处理的; v. 治愈, 腌制, 风干",
  "forms": {
    "base_form": "cure",
    "third_person_singular": "cures",
    "past_tense": "cured",
    "past_participle": "cured",
    "present_participle": "curing"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "No longer affected by a disease or condition; having been successfully treated or healed.",
      "explanation_cn": "不再受疾病或状况影响；已通过治疗成功康复的。",
      "example_en": "After months of therapy, she was finally cured of her chronic illness.",
      "example_cn": "经过数月的治疗，她终于治愈了慢性病。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Preserved by smoking, salting, or drying, especially in the context of meat or fish to extend shelf life and enhance flavor.",
      "explanation_cn": "通过烟熏、腌制或风干等方式保存的，尤指用于肉类或鱼类以延长保质期并增强风味。",
      "example_en": "We enjoyed cured ham and aged cheese at the gourmet market.",
      "example_cn": "我们在精品市场品尝了腌制火腿和陈年奶酪。"
    },
    {
      "pos": "verb",
      "explanation_en": "To treat a disease or condition successfully so that the patient recovers health.",
      "explanation_cn": "通过治疗使疾病或状况痊愈，使患者恢复健康。",
      "example_en": "Modern medicine has cured many diseases that were once fatal.",
      "example_cn": "现代医学已治愈了许多曾经致命的疾病。"
    },
    {
      "pos": "verb",
      "explanation_en": "To preserve food, especially meat or fish, by salting, smoking, or drying to prevent spoilage.",
      "explanation_cn": "通过加盐、烟熏或风干等方式保存食物，尤其是肉类或鱼类，以防止腐败。",
      "example_en": "The farmers cure their pork with salt and herbs before smoking it.",
      "example_cn": "农民们在烟熏前用盐和香草腌制猪肉。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "healed",
      "analysis": "“Healed” (愈合) 强调身体组织或伤口的自然修复过程，常用于描述皮肤、骨骼或器官的恢复，带有生理层面的隐喻。而 “cured” 更侧重于疾病本身的消除，通常涉及医疗干预，适用范围更广，包括心理疾病或慢性病。"
    },
    {
      "word_to_compare": "preserved",
      "analysis": "“Preserved” (保存) 是一个更宽泛的术语，泛指通过任何方法（如冷藏、罐装、糖渍）防止食物变质。而 “cured” 是一种特定的食品保存方式，特指使用盐、硝石、烟熏等化学或物理手段改变食物结构以延长保存期，常与风味强化相关。"
    },
    {
      "word_to_compare": "recovered",
      "analysis": "“Recovered” (恢复) 强调从疾病、损伤或不良状态中恢复过来，但不一定意味着疾病被彻底根除，有时只是症状缓解或功能恢复。而 “cured” 暗示病因已被消除，不再复发，具有更彻底、更医学化的含义。"
    }
  ]
}