{
  "word": "cure",
  "pronunciation": "kyoor",
  "concise_definition": "n. 治疗, 疗法, 根治; v. 治愈, 治疗",
  "forms": {
    "third_person_singular": "cures",
    "past_tense": "cured",
    "past_participle": "cured",
    "present_participle": "curing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A treatment or method that eliminates a disease or condition, restoring health; often implies a complete and lasting resolution.",
      "explanation_cn": "指能够消除疾病或病症、恢复健康的治疗方法，通常暗示彻底且持久的解决。",
      "example_en": "Scientists are still searching for a cure for Alzheimer's disease.",
      "example_cn": "科学家们仍在寻找治疗阿尔茨海默病的方法。"
    },
    {
      "pos": "noun",
      "explanation_en": "A solution or remedy for a problem, not necessarily medical, that restores normal function or resolves an issue.",
      "explanation_cn": "指解决非医疗问题的对策或补救措施，能够恢复正常状态或解决问题。",
      "example_en": "The new policy is seen as a cure for the company's declining morale.",
      "example_cn": "这项新政策被视为提振公司士气的良方。"
    },
    {
      "pos": "verb",
      "explanation_en": "To restore someone to health by treating a disease or medical condition.",
      "explanation_cn": "通过治疗疾病或医学状况使某人恢复健康。",
      "example_en": "The antibiotics cured her infection within a week.",
      "example_cn": "抗生素在一周内治愈了她的感染。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove or correct a problem, flaw, or undesirable condition, often through deliberate intervention.",
      "explanation_cn": "通过有意识的干预消除、纠正问题、缺陷或不良状况。",
      "example_en": "They cured the wood to prevent it from warping.",
      "example_cn": "他们对木材进行了干燥处理，以防止其变形。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "treat",
      "analysis": "“Treat” (治疗) 指对疾病或症状进行医疗干预，但不一定意味着完全康复，可能只是缓解症状或控制病情。而 “cure” 强调彻底根除病因，实现痊愈。例如：医生可以治疗糖尿病，但目前尚无治愈方法。"
    },
    {
      "word_to_compare": "heal",
      "analysis": "“Heal” (愈合) 更侧重于身体或心理的自然恢复过程，常用于伤口、创伤或情感的修复，不一定需要外部治疗。而 “cure” 通常指通过医学手段主动消除疾病。例如：伤口会自然愈合（heal），但感染需要被治愈（cure）。"
    },
    {
      "word_to_compare": "remedy",
      "analysis": "“Remedy” (补救措施) 与 “cure” 在非医疗语境中可互换，但更常用于抽象问题（如社会问题、系统缺陷），语气较温和，不一定保证彻底解决。而 “cure” 在非医疗语境中带有更强的“根本性解决”含义，语气更果断。"
    }
  ]
}