{
  "word": "curing",
  "pronunciation": "kyoor·ing",
  "concise_definition": "n. 保存, 治疗, 熟成; v. 保存（食物）, 治疗, 使固化",
  "forms": {
    "base_form": "cure",
    "third_person_singular": "cures",
    "past_tense": "cured",
    "past_participle": "cured",
    "present_participle": "curing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of preserving food, especially meat or fish, by salting, smoking, drying, or using chemical additives to prevent spoilage and enhance flavor.",
      "explanation_cn": "指通过腌制、熏制、干燥或添加化学物质来保存食物（尤其是肉类或鱼类），以防止腐败并增强风味的过程。",
      "example_en": "The curing of ham takes several weeks and involves a mixture of salt, sugar, and nitrites.",
      "example_cn": "火腿的腌制过程需要数周，涉及盐、糖和亚硝酸盐的混合物。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process of healing or treating a disease, condition, or injury, especially when it results in complete recovery.",
      "explanation_cn": "指治疗疾病、状况或损伤的过程，尤其指最终实现完全康复的情况。",
      "example_en": "After months of therapy, the patient finally achieved a full curing of the chronic infection.",
      "example_cn": "经过数月的治疗，患者最终完全治愈了慢性感染。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process by which a material, such as concrete or resin, hardens or sets through chemical reaction over time.",
      "explanation_cn": "指材料（如混凝土或树脂）通过随时间发生的化学反应而硬化或定型的过程。",
      "example_en": "The curing of concrete is critical to ensure its long-term strength and durability.",
      "example_cn": "混凝土的固化过程对其长期强度和耐久性至关重要。"
    },
    {
      "pos": "verb",
      "explanation_en": "To preserve food by salting, smoking, or drying to extend its shelf life and improve taste.",
      "explanation_cn": "通过腌制、熏制或干燥来保存食物，以延长其保质期并改善风味。",
      "example_en": "Farmers traditionally cure pork belly to make bacon.",
      "example_cn": "农民传统上通过腌制猪腩肉来制作培根。"
    },
    {
      "pos": "verb",
      "explanation_en": "To treat a medical condition successfully so that the patient recovers completely.",
      "explanation_cn": "通过治疗使疾病痊愈，使患者完全康复。",
      "example_en": "Modern medicine has cured many diseases that were once fatal.",
      "example_cn": "现代医学已治愈了许多曾经致命的疾病。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a material to harden or set through chemical reaction, such as in polymers or concrete.",
      "explanation_cn": "通过化学反应使材料（如聚合物或混凝土）硬化或定型。",
      "example_en": "The epoxy resin requires 24 hours of curing before it can be sanded.",
      "example_cn": "环氧树脂需要24小时固化后才能打磨。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "preserving",
      "analysis": "“Preserving”（保存）是一个更广泛的术语，泛指任何防止食物腐败的方法，包括冷藏、罐装、真空包装等。而 “curing” 是一种特定的保存方式，主要依赖盐、糖、硝酸盐或烟熏等化学或物理手段，通常伴随风味的显著改变。"
    },
    {
      "word_to_compare": "healing",
      "analysis": "“Healing”（愈合）强调身体或心理的自然恢复过程，常带有情感或生理修复的意味，如伤口愈合或心灵疗愈。“Curing” 则更侧重于通过外部干预（如药物、手术）彻底消除病因，实现医学意义上的康复。"
    },
    {
      "word_to_compare": "hardening",
      "analysis": "“Hardening”（硬化）仅描述材料变硬的物理状态变化，可能是由于冷却、脱水或压力所致，不涉及化学反应。而 “curing” 在材料科学中特指通过化学交联反应实现的永久性固化，如树脂或橡胶的硫化过程，具有不可逆性。"
    }
  ]
}