{
  "word": "curry",
  "pronunciation": "kur·ee",
  "concise_definition": "n. 咖喱, 咖喱菜; v. 炒制, 用咖喱烹调",
  "forms": {
    "plural": "curries",
    "third_person_singular": "curries",
    "past_tense": "curried",
    "past_participle": "curried",
    "present_participle": "currying"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A dish originating in South Asia, typically made with a mixture of spices including turmeric, cumin, coriander, and chili, often cooked with meat, fish, or vegetables in a sauce.",
      "explanation_cn": "起源于南亚的一道菜肴，通常由姜黄、孜然、香菜和辣椒等多种香料混合制成，常与肉类、鱼类或蔬菜一起炖煮成酱汁状。",
      "example_en": "She ordered a chicken curry with basmati rice for dinner.",
      "example_cn": "她晚餐点了一份鸡肉咖喱配香米。"
    },
    {
      "pos": "noun",
      "explanation_en": "A powdered or paste mixture of spices used as a seasoning, especially in Indian and Southeast Asian cuisines.",
      "explanation_cn": "一种用作调味料的香料粉或糊状混合物，尤指在印度和东南亚菜系中使用。",
      "example_en": "He bought a jar of homemade curry powder from the local market.",
      "example_cn": "他从当地市场买了一罐自制的咖喱粉。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cook food with curry spices or in a curry sauce, especially in the style of Indian or Thai cuisine.",
      "explanation_cn": "用咖喱香料或咖喱酱烹调食物，尤指印度或泰国菜式。",
      "example_en": "They curried the lamb slowly over low heat until it was tender.",
      "example_cn": "他们用小火慢炖咖喱羊肉，直到肉质软烂。"
    },
    {
      "pos": "verb",
      "explanation_en": "To try to gain favor or support by flattering or ingratiating oneself, often used in the phrase 'to curry favor'.",
      "explanation_cn": "通过奉承或讨好来争取好感或支持，常用于短语 'curry favor'（讨好）。",
      "example_en": "He was currying favor with the boss by always agreeing with his opinions.",
      "example_cn": "他总是附和老板的意见，以此来讨好他。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "spice",
      "analysis": "“Spice” (香料) 指单一种类的香辛料，如胡椒、肉桂或姜粉，是构成咖喱的基础成分。而 “curry” 是多种香料混合后形成的复合调味品或菜肴，具有特定的风味体系和文化背景。"
    },
    {
      "word_to_compare": "stew",
      "analysis": "“Stew” (炖菜) 是一种广义的慢煮菜肴，通常以液体为介质长时间烹煮食材，但不一定使用咖喱香料。而 “curry” 是一种特定风味的炖菜，其核心特征是使用咖喱香料混合物，具有鲜明的南亚或东南亚风味。"
    },
    {
      "word_to_compare": "flatter",
      "analysis": "“Flatter” (奉承) 是直接通过赞美来讨好他人，语义更中性或负面，强调言语行为。而 “curry favor” 是一个固定短语，带有更强烈的功利性和策略性，常暗含刻意讨好以获取利益，语义更丰富，且源自烹饪隐喻（原指用香料讨好味蕾）。"
    }
  ]
}