{
  "word": "curse",
  "pronunciation": "kurs",
  "concise_definition": "n. 诅咒, 祸患; v. 诅咒, 骂人",
  "forms": {
    "third_person_singular": "curses",
    "past_tense": "cursed",
    "past_participle": "cursed",
    "present_participle": "cursing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A solemn utterance intended to invoke a supernatural power to inflict harm or punishment on someone or something, often due to anger or revenge.",
      "explanation_cn": "一种庄严的言辞，旨在召唤超自然力量对某人或某物施加伤害或惩罚，通常源于愤怒或报复心理。",
      "example_en": "The witch placed a curse on the village, causing all the crops to wither.",
      "example_cn": "女巫对村庄施加了诅咒，导致所有庄稼枯萎。"
    },
    {
      "pos": "noun",
      "explanation_en": "A condition or situation regarded as a source of persistent misfortune or suffering; something that brings repeated bad luck.",
      "explanation_cn": "一种被视为持续不幸或痛苦根源的状态或情境；带来反复厄运的事物。",
      "example_en": "The old house was said to be under a curse—every owner met with tragedy.",
      "example_cn": "据说那栋老房子被下了诅咒——每一位主人都遭遇了不幸。"
    },
    {
      "pos": "verb",
      "explanation_en": "To utter a curse against someone, expressing anger or wishing harm upon them.",
      "explanation_cn": "对某人说出诅咒之语，表达愤怒或希望其遭受不幸。",
      "example_en": "He cursed loudly when he stubbed his toe on the table.",
      "example_cn": "他撞到脚趾时大声咒骂起来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to be afflicted by a curse or to bring about misfortune through supernatural means.",
      "explanation_cn": "通过超自然手段使某物遭受诅咒，或导致其陷入厄运。",
      "example_en": "Legends say the treasure was cursed by the ancient king to protect it from thieves.",
      "example_cn": "传说中，这笔财宝被古代国王诅咒，以保护它免受盗贼侵害。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "curse",
      "analysis": "“Curse” 作为名词时，强调一种超自然的、带有恶意的惩罚性力量；而 “hex”（巫术诅咒）更具体地指向巫术或魔法仪式中的咒语，常用于民间传说，语义范围更窄。"
    },
    {
      "word_to_compare": "swear",
      "analysis": "“Swear” (咒骂) 指使用粗俗或亵渎的语言表达愤怒，通常是口头发泄，不涉及超自然力量。而 “curse” 可以是纯粹的语言发泄，也可以是相信能引发超自然后果的正式诅咒，语义层次更深。"
    },
    {
      "word_to_compare": "blessing",
      "analysis": "“Blessing” (祝福) 是 “curse” 的反义词，指祈求神灵赐予恩惠、保护或好运。两者在文化语境中常形成对立：一个带来灾祸，一个带来福祉，常用于宗教、神话或文学中的道德对比。"
    }
  ]
}