{
  "word": "cushion",
  "pronunciation": "kush·uhn",
  "concise_definition": "n. 垫子, 垫料; v. 缓冲, 减轻",
  "forms": {
    "plural": "cushions",
    "third_person_singular": "cushions",
    "past_tense": "cushioned",
    "past_participle": "cushioned",
    "present_participle": "cushioning"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A soft, padded object designed to provide comfort or support, typically used for sitting or leaning on.",
      "explanation_cn": "一种柔软、有衬垫的物品，用于提供舒适感或支撑，通常用于坐或倚靠。",
      "example_en": "She placed a decorative cushion on the wooden chair to make it more comfortable.",
      "example_cn": "她把一个装饰性垫子放在木椅上，使其更舒适。"
    },
    {
      "pos": "noun",
      "explanation_en": "A reserve or buffer of resources, money, or time that protects against unexpected losses or difficulties.",
      "explanation_cn": "指用于应对意外损失或困难的资源、资金或时间储备，起到缓冲作用。",
      "example_en": "The company maintained a financial cushion to weather economic downturns.",
      "example_cn": "该公司保留了一笔资金储备，以应对经济衰退。"
    },
    {
      "pos": "verb",
      "explanation_en": "To protect or soften the impact of something by placing a buffer or padding between it and a hard surface or force.",
      "explanation_cn": "通过在某物与硬表面或外力之间放置缓冲物或衬垫，以减轻其冲击或影响。",
      "example_en": "The firefighters cushioned the fall of the child with a large blanket.",
      "example_cn": "消防员用一条大毯子缓冲了孩子的坠落。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reduce the severity, harshness, or negative effect of something, especially in communication or financial impact.",
      "explanation_cn": "减轻某事物的严重性、严厉性或负面影响，尤指在沟通或经济影响方面。",
      "example_en": "The report cushioned the blow of the bad news by highlighting potential recovery measures.",
      "example_cn": "这份报告通过强调潜在的恢复措施，减轻了坏消息带来的冲击。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pad",
      "analysis": "“Pad” (垫子/衬垫) 通常指薄而简单的缓冲材料，多用于物理层面的减震，如键盘垫、鞋垫。而 “cushion” 更强调柔软、厚实、舒适性，常用于家具或抽象情境中的缓冲，语义范围更广。"
    },
    {
      "word_to_compare": "buffer",
      "analysis": "“Buffer” (缓冲) 多用于技术、经济或系统语境，指一种机制或储备以吸收冲击，如数据缓冲区、财政缓冲。它更抽象、更功能化；而 “cushion” 既可用于物理垫子，也可用于比喻，语义更生活化、形象化。"
    },
    {
      "word_to_compare": "pillow",
      "analysis": "“Pillow” (枕头) 是特指用于头部支撑的卧具，属于 “cushion” 的一种子类，但用途更专一。而 “cushion” 可用于座椅、地板、窗台等多种场景，适用范围更广。"
    }
  ]
}