{
  "word": "custodial",
  "pronunciation": "kus·dee·uh·l",
  "concise_definition": "adj. 监护的, 看管的, 保管的",
  "forms": {
    "comparative": "custodial",
    "superlative": "custodial"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to the responsibility of caring for, protecting, or managing someone or something, especially in a legal or official capacity.",
      "explanation_cn": "指在法律或官方职责下对某人或某物进行照料、保护或管理的责任，常用于监护权、看管或保管的语境。",
      "example_en": "The court awarded sole custodial rights to the mother after the divorce.",
      "example_cn": "离婚后，法院将唯一的监护权判给了母亲。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Pertaining to the role of a custodian, such as cleaning, maintenance, or security duties in institutions like schools, hospitals, or prisons.",
      "explanation_cn": "指看守人（custodian）的职责，如在学校、医院或监狱等机构中从事清洁、维护或安保工作。",
      "example_en": "The school hired additional custodial staff to ensure the building was cleaned after hours.",
      "example_cn": "学校雇佣了额外的保洁人员，以确保大楼在下班后保持清洁。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Held or controlled by a custodian, often in a temporary or protective capacity, especially in financial or legal contexts.",
      "explanation_cn": "指由看管人持有或控制，通常为临时性或保护性安排，常见于金融或法律语境，如托管资金。",
      "example_en": "The assets were placed in custodial accounts until the minor reached legal age.",
      "example_cn": "这些资产被存入托管账户，直至该未成年人达到法定年龄。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "guardian",
      "analysis": "“Guardian”（监护人）是名词，指实际承担监护责任的人，而 “custodial” 是形容词，描述与监护相关的性质或状态。例如，a guardian has custodial rights。前者是主体，后者是属性。"
    },
    {
      "word_to_compare": "maintenance",
      "analysis": "“Maintenance”（维护）侧重于保持事物处于良好状态，如设备维修、房屋保养，通常不涉及法律或人身责任。而 “custodial” 不仅包含维护，还隐含对人或物的法律或道德责任，范围更广。"
    },
    {
      "word_to_compare": "supervisory",
      "analysis": "“Supervisory”（监督的）强调对他人工作的观察、指导和管理，常用于管理职位，如监督员。而 “custodial” 更强调直接的照料、看护或保管，通常不涉及决策或指导，而是执行性职责，如清洁工或托管人。"
    }
  ]
}