{
  "word": "custodian",
  "pronunciation": "kuh·stoh·dee·uhn",
  "concise_definition": "n. 管理人, 保管人, 看守者",
  "forms": {
    "plural": "custodians"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person or organization responsible for safeguarding, managing, or administering assets, property, or records on behalf of others, often in a legal or fiduciary capacity.",
      "explanation_cn": "指代表他人负责保护、管理或监管资产、财产或记录的人或机构，通常具有法律或受托责任。",
      "example_en": "The bank acts as the custodian of the retirement fund's assets.",
      "example_cn": "该银行担任退休基金资产的保管人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who maintains and looks after a building or facility, often performing cleaning and minor maintenance tasks.",
      "explanation_cn": "指负责维护和照看建筑物或设施的人，通常从事清洁和简单维修工作。",
      "example_en": "The custodian arrived early to clean the classrooms before the students came.",
      "example_cn": "管理员早早来到学校，在学生到来前打扫教室。"
    },
    {
      "pos": "noun",
      "explanation_en": "In legal or institutional contexts, a person entrusted with the care and control of something valuable, such as historical documents or cultural artifacts.",
      "explanation_cn": "在法律或机构语境中，指被委托保管和控制某项贵重物品（如历史文献或文化文物）的人。",
      "example_en": "The museum's custodian ensured the ancient manuscript was stored in a climate-controlled vault.",
      "example_cn": "博物馆的保管员确保这份古籍被存放在恒温恒湿的保险库中。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "guardian",
      "analysis": "“Guardian”（监护人）通常指对人（尤其是儿童或无行为能力者）负有保护和照顾责任的人，强调人身保护和道德/法律义务。而 “custodian” 更侧重于对物（如财产、文件、设施）的保管和管理，不涉及人身关系。"
    },
    {
      "word_to_compare": "caretaker",
      "analysis": "“Caretaker”（看护人）与 “custodian” 在管理建筑或设施方面含义接近，但 “caretaker” 更常用于临时性或非正式的看护角色，如度假屋的看管者；而 “custodian” 更正式，常用于机构或公共设施中的专职岗位，职责更系统化。"
    },
    {
      "word_to_compare": "trustee",
      "analysis": "“Trustee”（受托人）是法律术语，特指依据信托协议管理他人财产并负有最高诚信义务的人，其职责范围更广、法律约束更强。而 “custodian” 通常仅负责保管或执行具体操作，不涉及投资决策或信托义务。"
    }
  ]
}