{
  "word": "cut",
  "pronunciation": "kut",
  "concise_definition": "v. 切, 剪, 切断; n. 切口, 切法, 剪裁",
  "forms": {
    "third_person_singular": "cuts",
    "past_tense": "cut",
    "past_participle": "cut",
    "present_participle": "cutting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To divide or separate something with a sharp instrument, such as a knife, scissors, or blade.",
      "explanation_cn": "用刀、剪刀或刀片等锋利工具将某物切开或分离。",
      "example_en": "She cut the bread with a sharp knife.",
      "example_cn": "她用一把锋利的刀切开了面包。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reduce or remove something, especially in quantity, cost, or content, often to improve efficiency or save resources.",
      "explanation_cn": "减少或移除某物，尤其指数量、成本或内容，通常为了提高效率或节约资源。",
      "example_en": "The company decided to cut its budget by 20% this year.",
      "example_cn": "公司今年决定将预算削减20%。"
    },
    {
      "pos": "verb",
      "explanation_en": "To stop or interrupt a signal, connection, or activity suddenly.",
      "explanation_cn": "突然中断信号、连接或活动。",
      "example_en": "The phone call was cut off due to poor reception.",
      "example_cn": "由于信号不好，电话被切断了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To edit or remove parts of a film, video, or text to shorten or improve it.",
      "explanation_cn": "通过删减部分影像、视频或文本以缩短或优化内容。",
      "example_en": "The director cut five minutes from the final scene to tighten the pacing.",
      "example_cn": "导演删掉了最后一场五分种的镜头，以加快节奏。"
    },
    {
      "pos": "noun",
      "explanation_en": "A style or method of cutting hair, clothing, or other materials, often referring to a fashionable design.",
      "explanation_cn": "指头发、衣物或其他材料的剪裁方式，常指时尚的设计样式。",
      "example_en": "He got a new cut for the summer — short on the sides, longer on top.",
      "example_cn": "他夏天换了新发型：两侧短，顶部留长。"
    },
    {
      "pos": "noun",
      "explanation_en": "A portion or serving of food, especially meat, that has been sliced or prepared for eating.",
      "explanation_cn": "指一块已切好或准备食用的食物，尤指肉类。",
      "example_en": "The restaurant serves a perfect cut of ribeye steak.",
      "example_cn": "这家餐厅提供一块完美的肋眼牛排。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "chop",
      "analysis": "“Chop” (剁) 通常指用重力或猛力将物体砍断，动作更粗暴、不精确，常用于处理骨头或硬质食材，如“chop vegetables”；而 “cut” 更通用，可指精细或轻柔的切割动作，适用范围更广。"
    },
    {
      "word_to_compare": "slice",
      "analysis": "“Slice” (切片) 特指将物体切成薄片，强调形状和厚度的均匀性，常用于食物（如切面包、奶酪）；而 “cut” 是更宽泛的动词，可包含切片、切断、剪断等多种方式，不特指薄片。"
    },
    {
      "word_to_compare": "trim",
      "analysis": "“Trim” (修剪) 指轻微地剪去多余或不整齐的部分，以改善外观或功能，如修剪草坪、指甲或头发边缘；而 “cut” 可以是大幅度的分离，不一定是为了修饰，可能涉及移除大量部分。"
    }
  ]
}