{
  "word": "cutoff",
  "pronunciation": "kut·off",
  "concise_definition": "n. 切断, 截止点, 停止; adj. 截止的, 切断的",
  "forms": {
    "plural": "cutoffs"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A point or time at which something stops, ends, or is no longer allowed or applicable, often used in contexts like deadlines, eligibility, or access.",
      "explanation_cn": "指某事物停止、结束或不再被允许或适用的时间点或界限，常用于截止日期、资格门槛或访问权限等语境。",
      "example_en": "The cutoff date for submitting applications is Friday at 5 p.m.",
      "example_cn": "提交申请的截止日期是周五下午5点。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of cutting off or the state of being cut off, especially in reference to utilities, services, or connections (e.g., water, electricity, or communication).",
      "explanation_cn": "指切断或被切断的行为或状态，尤其指水电、通信等服务的中断。",
      "example_en": "The cutoff of water supply lasted for three days due to pipe repairs.",
      "example_cn": "由于管道维修，供水中断了三天。"
    },
    {
      "pos": "noun",
      "explanation_en": "A minimum score, level, or standard required for selection or qualification, especially in exams, sports, or hiring processes.",
      "explanation_cn": "指在考试、体育或招聘等过程中，用于选拔或资格认定的最低分数、水平或标准。",
      "example_en": "He just missed the cutoff for the national team by two points.",
      "example_cn": "他仅以两分之差未能达到国家队的入选分数线。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that serves as a limit or boundary, especially one that excludes or terminates.",
      "explanation_cn": "形容用作限制或边界的事物，尤其指具有排除或终止作用的。",
      "example_en": "The cutoff score for admission is 85 percent.",
      "example_cn": "录取的分数线是85%。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "deadline",
      "analysis": "“Deadline”（截止日期）特指必须完成某事的最后时限，强调时间上的强制性，通常用于任务、项目或提交。而 “cutoff” 范围更广，可指时间、分数、资格等任何类型的终止点，不一定仅限于时间。"
    },
    {
      "word_to_compare": "barrier",
      "analysis": "“Barrier”（障碍）泛指任何阻碍前进或进入的事物，可以是物理的、心理的或制度性的，强调阻碍作用。而 “cutoff” 更具体地指一个明确的终止点或门槛，常用于量化标准（如分数、时间），更具操作性。"
    },
    {
      "word_to_compare": "termination",
      "analysis": "“Termination”（终止）是一个更正式、更广泛的术语，指任何结束状态，常用于合同、雇佣或程序的正式结束。而 “cutoff” 更口语化，常用于日常语境中表示‘停止准入’或‘不再有效’，语气更轻、更实用。"
    }
  ]
}