{
  "word": "cuts",
  "pronunciation": "kuts",
  "concise_definition": "n. 切口, 削减, 修剪; v. 切, 削减, 剪裁",
  "forms": {
    "base_form": "cut",
    "third_person_singular": "cuts",
    "past_tense": "cut",
    "past_participle": "cut",
    "present_participle": "cutting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A narrow opening or incision made by cutting something, especially with a sharp object like a knife or blade.",
      "explanation_cn": "指用刀、剪等锋利工具切开物体所形成的狭长开口或切口。",
      "example_en": "She had a deep cut on her finger from the broken glass.",
      "example_cn": "她的手指被碎玻璃划出了一道深口子。"
    },
    {
      "pos": "noun",
      "explanation_en": "A reduction in the amount, size, or level of something, especially in budgets, prices, or services.",
      "explanation_cn": "指对数量、规模或水平的削减，尤指预算、价格或服务的缩减。",
      "example_en": "The government announced deep cuts in public spending.",
      "example_cn": "政府宣布大幅削减公共支出。"
    },
    {
      "pos": "noun",
      "explanation_en": "A style or shape of hair, especially one that has been trimmed or styled in a particular way.",
      "explanation_cn": "指头发的样式，特指经过修剪或造型后的发型。",
      "example_en": "He got a new cut last week and loves how it looks.",
      "example_cn": "他上周换了新发型，非常喜欢现在的样子。"
    },
    {
      "pos": "verb",
      "explanation_en": "To divide or separate something with a sharp instrument, such as a knife, scissors, or saw.",
      "explanation_cn": "指用刀、剪刀或锯等锋利工具将某物切开或分离。",
      "example_en": "She cut the paper into small pieces for the collage.",
      "example_cn": "她把纸剪成小块用于拼贴画。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reduce the amount, number, or level of something, especially in financial or operational contexts.",
      "explanation_cn": "指在财务或运营语境中减少数量、金额或水平。",
      "example_en": "The company had to cut costs to survive the economic downturn.",
      "example_cn": "公司不得不削减成本以度过经济低迷期。"
    },
    {
      "pos": "verb",
      "explanation_en": "To edit or remove parts of a film, text, or performance to make it shorter or more suitable.",
      "explanation_cn": "指通过删减电影、文本或表演中的部分内容，使其更短或更合适。",
      "example_en": "The director cut five minutes from the final scene to improve pacing.",
      "example_cn": "导演删掉了最后一场五分种的镜头，以改善节奏。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "slice",
      "analysis": "“Slice”（薄片/切片）通常指从整体上切下的一片，强调形状扁平、厚度均匀，常用于食物（如切片面包）或抽象比喻（如社会阶层的切片）。而 “cut” 更泛指任何方式的切割动作或结果，不强调形状，适用范围更广。"
    },
    {
      "word_to_compare": "reduction",
      "analysis": "“Reduction”（减少）是抽象名词，泛指数量、规模或程度的降低，常用于正式语境（如数据、成本、风险的减少）。“Cut” 作为名词时更口语化，常用于具体情境（如预算削减、裁员），带有更强的行动感和突然性。"
    },
    {
      "word_to_compare": "trim",
      "analysis": "“Trim”（修剪）通常指轻微、精细地剪去多余部分，以改善外观或功能，如修剪草坪、头发或句子。它暗示的是修饰性、非破坏性的操作。而 “cut” 更中性，可指任何程度的切割，包括剧烈或彻底的去除。"
    }
  ]
}