{
  "word": "cutter",
  "pronunciation": "koo·tər",
  "concise_definition": "n. 切割工具, 切割机, 切割者",
  "forms": {
    "plural": "cutters"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A tool or device designed to cut materials such as paper, fabric, metal, or food, often with a blade, edge, or mechanical mechanism.",
      "explanation_cn": "指用于切割纸张、布料、金属或食物等材料的工具或装置，通常带有刀片、刃口或机械结构。",
      "example_en": "She used a paper cutter to trim the edges of the poster.",
      "example_cn": "她用切纸机修剪了海报的边缘。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or machine that performs the act of cutting, especially in a professional or industrial context.",
      "explanation_cn": "指从事切割工作的人或机器，尤其在专业或工业环境中，如裁缝、金属切割工或自动化切割设备。",
      "example_en": "The factory hired a new cutter to handle the textile production line.",
      "example_cn": "工厂雇佣了一名新操作员来负责纺织品生产线的切割工作。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of vehicle or vessel designed for speed and maneuverability, especially in racing or military use (e.g., a yacht cutter or ice cutter).",
      "explanation_cn": "指一种设计用于高速和高机动性的船只或车辆，尤其用于竞赛或军事用途，如纵帆船（cutter yacht）或破冰船（ice cutter）。",
      "example_en": "The historic wooden cutter sailed gracefully through the icy waters.",
      "example_cn": "这艘历史悠久的木制纵帆船优雅地穿行于冰封的水域中。"
    },
    {
      "pos": "noun",
      "explanation_en": "In dentistry, a small instrument used to shape or trim dental materials such as amalgam or composite resin.",
      "explanation_cn": "在牙科中，指用于塑形或修整牙科材料（如银汞合金或复合树脂）的小型器械。",
      "example_en": "The dentist used a cutter to refine the filling's contour.",
      "example_cn": "牙医使用切割器修整了补牙材料的轮廓。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "knife",
      "analysis": "“Knife”（刀）通常指一种手持、单刃的切割工具，主要用于食物切割或日常用途，结构简单，依赖手动操作。而 “cutter” 范围更广，可包含机械装置、电动工具或专业设备，不一定为手持或单刃，功能更专业化。"
    },
    {
      "word_to_compare": "blade",
      "analysis": "“Blade”（刀片）是切割工具的组成部分，本身不是完整工具，而是指锋利的薄片状部件。而 “cutter” 是包含刀片在内的完整工具或设备，强调功能性和整体性。例如，剃须刀的刀片是 blade，而剃须刀整体是 cutter。"
    },
    {
      "word_to_compare": "trimmer",
      "analysis": "“Trimmer”（修整器）通常用于精细修整、边缘处理，如草坪修剪机或毛发修整器，强调的是“修饰”而非“切断”。而 “cutter” 更侧重于彻底分离或切断材料，动作更剧烈、目的更直接。"
    }
  ]
}