{
  "word": "cutting",
  "pronunciation": "kut·ing",
  "concise_definition": "n. 切割, 剪裁, 剪辑; adj. 尖锐的, 严厉的, 前沿的",
  "forms": {
    "base_form": "cut",
    "past_tense": "cut",
    "past_participle": "cut",
    "present_participle": "cutting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act or process of cutting something, especially in manufacturing, tailoring, or film editing, resulting in a shaped or trimmed piece.",
      "explanation_cn": "指切割、剪裁或剪辑某物的行为或过程，尤其在制造、裁缝或电影剪辑中，产生经过塑形或修剪的片段。",
      "example_en": "The tailor made a precise cutting of the fabric to fit the pattern.",
      "example_cn": "裁缝精确地剪裁了布料以符合图案。"
    },
    {
      "pos": "noun",
      "explanation_en": "In film or video, a transition or edit between two scenes; a specific edited segment used to enhance pacing or narrative flow.",
      "explanation_cn": "在电影或视频中，指两个场景之间的过渡或剪辑；用于增强节奏或叙事流畅性的特定剪辑片段。",
      "example_en": "The film’s cutting was so seamless that the audience barely noticed the scene changes.",
      "example_cn": "这部电影的剪辑如此流畅，观众几乎察觉不到场景的转换。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Sharp, harsh, or severe in tone, style, or effect; often used to describe criticism, humor, or language that is pointed and impactful.",
      "explanation_cn": "语气、风格或效果尖锐、严厉或苛刻的；常用于形容具有尖锐性和冲击力的批评、幽默或语言。",
      "example_en": "Her cutting remarks left the entire room in silence.",
      "example_cn": "她尖锐的评论让整个房间陷入沉默。"
    },
    {
      "pos": "adjective",
      "explanation_en": "At the forefront of innovation or trend; describing technology, design, or ideas that are highly advanced or modern.",
      "explanation_cn": "处于创新或潮流前沿的；形容技术、设计或理念极为先进或现代。",
      "example_en": "The gallery showcased cutting-edge art using augmented reality.",
      "example_cn": "画廊展出了使用增强现实技术的前沿艺术作品。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "slice",
      "analysis": "“Slice” (切片) 通常指将某物切成薄片，强调形状和厚度，多用于食物或物理对象，如切面包或切奶酪。而 “cutting” 更广泛，可指任何切割行为，包括抽象的剪辑或尖锐的言辞，语义范围更广。"
    },
    {
      "word_to_compare": "edit",
      "analysis": "“Edit” (编辑) 是一个更通用的术语，指对文本、视频或音频进行修改、删减或重组，强调过程和目的。而 “cutting” 在影视语境中特指剪掉片段的动作，是编辑的一部分，更具动作性和技术性。"
    },
    {
      "word_to_compare": "sharp",
      "analysis": "“Sharp” (锋利的/尖锐的) 是一个形容词，描述物理上的锋利或语言上的尖刻，但不包含动作或结果的含义。而 “cutting” 作为形容词时，不仅描述尖锐性，还隐含了“造成伤害”或“产生强烈效果”的动态意味，语义更丰富。"
    },
    {
      "word_to_compare": "innovative",
      "analysis": "“Innovative” (创新的) 强调原创性和突破性，常用于科技或商业模式。而 “cutting-edge”（前沿的）是 “cutting” 的衍生用法，更侧重于当前最先进、最时髦的状态，常与技术、设计相关，语义更具体、更具时效性。"
    }
  ]
}