{
  "word": "cutters",
  "pronunciation": "kut·erz",
  "concise_definition": "n. 切割工具, 切割机, 裁缝, 剪裁者",
  "forms": {
    "singular": "cutter"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A tool or device designed to cut materials such as paper, fabric, metal, or food, often with a blade, shears, or electric mechanism.",
      "explanation_cn": "指用于切割纸张、布料、金属或食物等材料的工具或装置，通常带有刀片、剪刀或电动装置。",
      "example_en": "The kitchen counter was cluttered with various cutters for vegetables and herbs.",
      "example_cn": "厨房台面上堆满了各种用于切蔬菜和香草的刀具。"
    },
    {
      "pos": "noun",
      "explanation_en": "A machine used in manufacturing or industry to cut shapes out of raw materials, such as metal sheets or plastic.",
      "explanation_cn": "指在制造业或工业中用于从原材料（如金属板或塑料）上切割出特定形状的机器。",
      "example_en": "The factory uses laser cutters to produce precise components for aerospace parts.",
      "example_cn": "该工厂使用激光切割机为航空航天部件生产高精度零件。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who cuts or trims, especially a tailor or stylist who cuts fabric or hair.",
      "explanation_cn": "指从事剪裁工作的人，尤指裁缝或发型师，负责剪裁布料或头发。",
      "example_en": "The cutters at the fashion house are known for their precision and creativity.",
      "example_cn": "这家时装屋的裁缝以精准和创意著称。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of sandwich or roll, especially in American English, often served sliced and filled with meats or cheeses.",
      "explanation_cn": "（美式英语）指一种三明治或长条面包，通常切开后填入肉类或奶酪。",
      "example_en": "We ordered a foot-long cutters with ham, cheese, and mustard for lunch.",
      "example_cn": "我们午餐点了一份一英尺长的火腿奶酪芥末三明治。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "knife",
      "analysis": "“Knife”（刀）是通用的切割工具，通常为手持、单刃，适用于多种日常用途，如切菜、削皮。而 “cutter” 更强调专门设计用于特定材料或精确切割的工具，可能包含机械结构（如旋转刀片、模具），功能更专一。"
    },
    {
      "word_to_compare": "shears",
      "analysis": "“Shears”（大剪刀）通常指双刃、长柄的手动剪切工具，主要用于剪布料、树枝或金属丝。它是一种特定类型的 cutter，但 “cutter” 范围更广，可包括电动、激光或冲压设备，不限于手动双刃结构。"
    },
    {
      "word_to_compare": "trimmer",
      "analysis": "“Trimmer”（修整器）侧重于精细修整或边缘处理，如修剪草坪、胡须或多余的线头，强调的是“修饰”而非“切割主体”。而 “cutter” 更强调从主体材料中分离出部分，动作更彻底、更具结构性。"
    }
  ]
}