{
  "word": "cyclone",
  "pronunciation": "sahy·klohn",
  "concise_definition": "n. 气旋, 飓风, 龙卷风",
  "forms": {
    "plural": "cyclones"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A system of winds rotating rapidly around a low-pressure center, typically accompanied by heavy rain, strong winds, and stormy weather, especially in tropical regions.",
      "explanation_cn": "指围绕低气压中心高速旋转的风系统，通常伴随暴雨、强风和恶劣天气，尤指发生在热带地区的气旋。",
      "example_en": "The cyclone devastated coastal villages, leaving thousands homeless.",
      "example_cn": "这场气旋摧毁了沿海村庄，使数千人无家可归。"
    },
    {
      "pos": "noun",
      "explanation_en": "A violent, rotating column of air extending from a thunderstorm to the ground, commonly known as a tornado in North America.",
      "explanation_cn": "指从雷暴云延伸至地面的强烈旋转气柱，在北美地区通常称为龙卷风。",
      "example_en": "Residents took shelter as the cyclone touched down near the town center.",
      "example_cn": "当龙卷风在镇中心附近着陆时，居民们纷纷躲进避难所。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device or machine that uses a swirling motion to separate particles from a gas or liquid, such as in vacuum cleaners or industrial filters.",
      "explanation_cn": "指利用旋转气流将颗粒物从气体或液体中分离的装置或机器，如吸尘器或工业过滤器。",
      "example_en": "The vacuum cleaner uses a cyclone system to trap dust without a bag.",
      "example_cn": "这款吸尘器采用气旋系统，在不使用集尘袋的情况下捕捉灰尘。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hurricane",
      "analysis": "“Hurricane”（飓风）特指在大西洋或东北太平洋形成的、风速达到或超过119公里/小时的强烈热带气旋，是“cyclone”的一种子类。而 “cyclone” 是更广泛的术语，可指全球任何区域的热带或温带气旋，包括印度洋的“cyclone”和西北太平洋的“typhoon”。"
    },
    {
      "word_to_compare": "typhoon",
      "analysis": "“Typhoon”（台风）是西北太平洋地区对强烈热带气旋的称呼，本质上与 “cyclone” 和 “hurricane” 相同，只是地理区域不同。因此，“cyclone” 是一个通用术语，而 “typhoon” 是区域性术语，用于特定海域。"
    },
    {
      "word_to_compare": "tornado",
      "analysis": "“Tornado”（龙卷风）是小尺度、高风速、短寿命的旋转气柱，通常由单个雷暴产生，直径仅几十米至数百米。而 “cyclone” 通常指大尺度、持续数天、覆盖数百公里的天气系统。虽然在某些语境下 “cyclone” 可指龙卷风，但科学上二者尺度和形成机制截然不同。"
    }
  ]
}