{
  "word": "cycles",
  "pronunciation": "sī·kəlz",
  "concise_definition": "n. 循环, 周期, 轮次; v. 循环, 周而复始",
  "forms": {
    "singular": "cycle",
    "third_person_singular": "cycles",
    "past_tense": "cycled",
    "past_participle": "cycled",
    "present_participle": "cycling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A series of events or phenomena that repeat in a regular and predictable pattern over time, often returning to the starting point.",
      "explanation_cn": "指在一段时间内以规律且可预测的方式重复发生的一系列事件或现象，通常会回到初始状态。",
      "example_en": "The water cycle includes evaporation, condensation, precipitation, and collection.",
      "example_cn": "水循环包括蒸发、凝结、降水和收集四个阶段。"
    },
    {
      "pos": "noun",
      "explanation_en": "A complete round or circuit of a process, especially one involving mechanical or physical movement, such as a bicycle or engine operation.",
      "explanation_cn": "指某一过程的完整一圈或循环，尤其指机械或物理运动，如自行车骑行或发动机运转。",
      "example_en": "He completed five cycles on the stationary bike this morning.",
      "example_cn": "今天早上他在固定自行车上完成了五圈骑行。"
    },
    {
      "pos": "noun",
      "explanation_en": "A recurring phase or stage in a social, economic, or natural process, often used to describe trends or fluctuations.",
      "explanation_cn": "指社会、经济或自然过程中反复出现的阶段或时期，常用于描述趋势或波动。",
      "example_en": "The economy is currently in a downturn phase of the business cycle.",
      "example_cn": "当前经济正处于商业周期的下行阶段。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or operate in a repeated pattern, returning to a previous state or position over time.",
      "explanation_cn": "指以重复的模式运动或运作，随着时间推移回到先前的状态或位置。",
      "example_en": "The seasons cycle through spring, summer, autumn, and winter.",
      "example_cn": "四季周而复始地更替为春、夏、秋、冬。"
    },
    {
      "pos": "verb",
      "explanation_en": "To transport or deliver something using a bicycle, especially as a means of delivery or commuting.",
      "explanation_cn": "指使用自行车运输或递送某物，尤指作为送货或通勤方式。",
      "example_en": "She cycles to work every day to stay fit and reduce her carbon footprint.",
      "example_cn": "她每天骑自行车上班，以保持健康并减少碳足迹。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cycle",
      "analysis": "“Cycle” 是名词和动词的原形，泛指任何重复的模式或过程；而 “cycles” 是其复数形式或第三人称单数动词形式，强调多个循环或重复发生的事件。在语义上无本质区别，仅在语法功能和数量上不同。"
    },
    {
      "word_to_compare": "loop",
      "analysis": "“Loop” (回路/循环) 通常指一个封闭的、重复的路径或过程，常用于技术语境（如编程中的循环结构），强调空间或逻辑上的闭合性。而 “cycle” 更强调时间上的周期性与自然节律，如季节、经济周期等。"
    },
    {
      "word_to_compare": "revolution",
      "analysis": "“Revolution” (旋转/革命) 在物理意义上指物体围绕一个中心点完整转一圈，强调空间位移；在社会意义上则指剧烈变革。而 “cycle” 不一定涉及旋转，更侧重于时间上的重复性，且通常不带有剧烈变革的含义。"
    },
    {
      "word_to_compare": "phase",
      "analysis": "“Phase” (阶段) 指一个周期中的特定部分，如月相、心理发展阶段。它是周期的组成部分，而非整个循环本身。而 “cycle” 包含多个阶段，是完整的重复过程。"
    }
  ]
}