{
  "word": "dab",
  "pronunciation": "dab",
  "concise_definition": "v. 轻拍, 轻点; n. 一小块, 一点",
  "forms": {
    "third_person_singular": "dabs",
    "past_tense": "dabbed",
    "past_participle": "dabbed",
    "present_participle": "dabbing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To touch or press something lightly and briefly, especially with a soft or absorbent material, often to remove moisture or apply a substance gently.",
      "explanation_cn": "指用柔软或吸水的材料轻轻触碰或按压某物，通常是为了吸去水分或轻柔地涂抹某种物质。",
      "example_en": "She dabbed her eyes with a tissue to wipe away the tears.",
      "example_cn": "她用纸巾轻轻擦拭眼睛，擦去泪水。"
    },
    {
      "pos": "verb",
      "explanation_en": "To apply paint or pigment in small, quick touches, often used in painting techniques to create texture or subtle color variations.",
      "explanation_cn": "指用快速、短促的笔触涂抹颜料，常用于绘画技法中以制造纹理或微妙的色彩变化。",
      "example_en": "The artist dabbed red and yellow onto the canvas to suggest the glow of sunset.",
      "example_cn": "画家用点彩手法在画布上轻点红黄两色，以表现日落的余晖。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small amount of something, especially a soft or sticky substance, such as a dab of paint, glue, or butter.",
      "explanation_cn": "指少量的某种物质，尤其是柔软或粘稠的物质，如一点颜料、胶水或黄油。",
      "example_en": "Add a dab of honey to sweeten the tea.",
      "example_cn": "往茶里加一点蜂蜜来调味。"
    },
    {
      "pos": "noun",
      "explanation_en": "A distinctive, often exaggerated gesture or dance move, popularized in modern culture, involving one arm bent at the elbow and the head tilted down toward the bent arm.",
      "explanation_cn": "指一种在现代文化中流行的独特、常带夸张风格的手势或舞蹈动作，通常是一只手臂弯曲，头部朝弯曲的手臂方向倾斜。",
      "example_en": "The kids were doing the dab all over the playground.",
      "example_cn": "孩子们在操场上纷纷做起了‘轻拍舞’。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pat",
      "analysis": "“Pat” (轻拍) 与 “dab” 都表示轻柔的接触，但 “pat” 更常用于有节奏地、稍用力地拍打，如拍背安慰；而 “dab” 更强调轻柔、短暂、无节奏的触碰，常用于吸干或点涂，动作更细腻。"
    },
    {
      "word_to_compare": "smear",
      "analysis": "“Smear” (涂抹) 指将物质大面积、不均匀地涂开，常带有杂乱或污迹的负面含义；而 “dab” 是小范围、精准、轻柔地施加，通常是为了控制量或避免扩散，动作更克制、更精致。"
    },
    {
      "word_to_compare": "dot",
      "analysis": "“Dot” (点) 指形成一个明确的、孤立的点状物，常用于描述形状或标记，如点号或点阵；而 “dab” 更强调动作本身，是通过轻触留下的一小块物质，不一定形成清晰的几何形状，更偏向于质感和动作过程。"
    }
  ]
}