{
  "word": "damascus",
  "pronunciation": "dæm·əs·kəs",
  "concise_definition": "n. 大马士革（叙利亚首都）；大马士革钢；大马士革花纹",
  "forms": {
    "proper_noun": true
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The capital city of Syria, historically a major cultural, commercial, and political center in the Middle East, known for its ancient architecture, markets, and role in Islamic civilization.",
      "explanation_cn": "叙利亚的首都，历史上是中东地区重要的文化、商业和政治中心，以其古老的建筑、市场和在伊斯兰文明中的地位而闻名。",
      "example_en": "Damascus has been continuously inhabited for over 11,000 years, making it one of the oldest cities in the world.",
      "example_cn": "大马士革已持续有人居住超过一万一千年的历史，是世界上最古老的城市之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of high-quality steel originally made in Damascus, characterized by its distinctive wavy or watered pattern and exceptional hardness and sharpness, traditionally used for swords and knives.",
      "explanation_cn": "一种原产于大马士革的优质钢材，以其独特的波浪状或水纹状花纹、极高的硬度和锋利度著称，传统上用于制造刀剑。",
      "example_en": "The antique dagger was forged from authentic damascus steel, its surface shimmering with intricate patterns.",
      "example_cn": "这把古董短刀由正宗的大马士革钢锻造而成，表面闪烁着精美的花纹。"
    },
    {
      "pos": "noun",
      "explanation_en": "A decorative pattern resembling the distinctive layered appearance of damascus steel, often used in textiles, paper, or metalwork to evoke luxury and craftsmanship.",
      "explanation_cn": "一种模仿大马士革钢独特层状外观的装饰性花纹，常用于纺织品、纸张或金属制品中，以体现奢华与工艺感。",
      "example_en": "The book's cover featured a damascus pattern in gold foil, giving it an elegant, timeless look.",
      "example_cn": "这本书的封面采用金色箔片印制的大马士革花纹，呈现出优雅而永恒的外观。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "steel",
      "analysis": "“Steel”（钢）是一个通用术语，泛指铁碳合金，而 “damascus” 特指具有独特花纹和历史工艺的特定类型钢材。并非所有钢都是大马士革钢，但所有大马士革钢都是钢的一种。"
    },
    {
      "word_to_compare": "pattern",
      "analysis": "“Pattern”（图案）是泛指任何重复的装饰设计，而 “damascus” 作为名词时特指源自大马士革钢的水纹状花纹，具有明确的历史、材料和工艺背景，是“pattern”的一个子类。"
    },
    {
      "word_to_compare": "city",
      "analysis": "“City”（城市）是通用名词，指任何人口密集的聚居地，而 “Damascus” 是专有名词，特指叙利亚的这座历史名城。它承载着独特的文化、地理和历史意义，不能与其他城市互换使用。"
    }
  ]
}