{
  "word": "dance",
  "pronunciation": "dans",
  "concise_definition": "v. 跳舞, 跳跃; n. 舞蹈, 舞会",
  "forms": {
    "third_person_singular": "dances",
    "past_tense": "danced",
    "past_participle": "danced",
    "present_participle": "dancing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move rhythmically, typically to music, using a set of prescribed or improvised steps, often for enjoyment, expression, or ritual.",
      "explanation_cn": "指随着音乐有节奏地移动身体，通常使用一套规定或即兴的舞步，常用于娱乐、表达情感或仪式场合。",
      "example_en": "They danced the night away at the wedding reception.",
      "example_cn": "他们在婚礼晚宴上跳了一整晚的舞。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or behave in a light, quick, or erratic manner, often to avoid something or to convey nervousness or excitement.",
      "explanation_cn": "指轻快、迅速或不规则地移动，常用于躲避某物，或表达紧张、兴奋的情绪。",
      "example_en": "The children danced around the fire, laughing and shouting.",
      "example_cn": "孩子们围着篝火蹦蹦跳跳，又笑又喊。"
    },
    {
      "pos": "noun",
      "explanation_en": "A social or artistic activity involving rhythmic movement to music, often performed in a structured style such as ballet, salsa, or hip-hop.",
      "explanation_cn": "指一种伴随音乐进行的有节奏的肢体活动，通常以特定风格呈现，如芭蕾、萨尔萨或嘻哈舞。",
      "example_en": "She has been studying classical dance since she was five.",
      "example_cn": "她五岁起就开始学习古典舞蹈。"
    },
    {
      "pos": "noun",
      "explanation_en": "A social gathering where people dance together, often to live or recorded music.",
      "explanation_cn": "指人们聚集在一起跳舞的社交活动，通常伴随着现场或录音音乐。",
      "example_en": "The annual charity ball is the highlight of the social calendar — a grand dance with live orchestra.",
      "example_cn": "年度慈善舞会是社交日历上的重头戏——一场由现场交响乐团伴奏的盛大舞会。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "move",
      "analysis": "“Move” (移动) 是一个更宽泛的词，泛指任何位置的变化，可以是机械的、无节奏的或无意识的。而 “dance” 特指有节奏、有美感或有文化意义的身体运动，通常与音乐相关，具有表现性或仪式性。"
    },
    {
      "word_to_compare": "step",
      "analysis": "“Step” (步伐) 指舞蹈中的单个动作或单位，是构成舞蹈的基本元素。而 “dance” 是由多个“step”组成的完整行为或艺术形式。可以说，step 是 dance 的组成部分，但 dance 包含情感、风格和整体结构。"
    },
    {
      "word_to_compare": "waltz",
      "analysis": "“Waltz” (华尔兹) 是一种具体的舞蹈类型，属于 “dance” 的子类。它有特定的节奏（3/4拍）和舞步模式。而 “dance” 是一个总称，涵盖所有舞蹈形式，包括 waltz、tango、breakdance 等。因此，waltz 是 dance 的一种，但 dance 不等于 waltz。"
    }
  ]
}