{
  "word": "dances",
  "pronunciation": "dans·iz",
  "concise_definition": "n. 舞蹈, 舞会; v. 跳舞, 跳舞表演",
  "forms": {
    "singular": "dance",
    "third_person_singular": "dances",
    "past_tense": "danced",
    "past_participle": "danced",
    "present_participle": "dancing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A series of rhythmic movements, typically performed to music, that express cultural, artistic, or emotional ideas; often structured in specific styles such as ballet, salsa, or hip-hop.",
      "explanation_cn": "指伴随音乐进行的一系列有节奏的动作，通常用于表达文化、艺术或情感内涵，常以芭蕾、萨尔萨或嘻哈等特定风格呈现。",
      "example_en": "She performed a beautiful traditional Irish dance at the festival.",
      "example_cn": "她在音乐节上表演了一支优美的传统爱尔兰舞蹈。"
    },
    {
      "pos": "noun",
      "explanation_en": "A social gathering where people dance together, often to live or recorded music, such as a ball, prom, or nightclub event.",
      "explanation_cn": "指人们聚集在一起跳舞的社交活动，通常伴随现场或录音音乐，如舞会、毕业舞会或夜总会活动。",
      "example_en": "The school organized a spring dance for all the students.",
      "example_cn": "学校为所有学生组织了一场春季舞会。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move rhythmically to music, typically following a set pattern of steps or movements, often for enjoyment, performance, or ritual.",
      "explanation_cn": "指随着音乐有节奏地移动身体，通常遵循特定的舞步或动作模式，常出于娱乐、表演或仪式目的。",
      "example_en": "They danced all night at the wedding reception.",
      "example_cn": "他们在婚礼晚宴上跳了一整晚的舞。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or behave in a lively, erratic, or evasive manner, often metaphorically (e.g., dancing around a topic or issue).",
      "explanation_cn": "指以活泼、不稳定或回避的方式移动或行为，常用于比喻意义（如回避话题、绕开问题）。",
      "example_en": "The politician danced around the question instead of giving a direct answer.",
      "example_cn": "这位政客回避了问题，没有给出直接回答。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "movement",
      "analysis": "“Movement” (动作/运动) 是一个更广泛的术语，泛指任何身体或物体的位置变化，不一定是节奏性的或与音乐相关。而 “dance” 特指有节奏、有风格、有表现力的肢体动作，通常具有艺术性或社交性。"
    },
    {
      "word_to_compare": "step",
      "analysis": "“Step” (舞步/步骤) 是舞蹈中的一个基本单位，指单个动作或位置变化。而 “dance” 是由多个“step”组成的完整序列或表演。一个“step”是组成部分，而“dance”是整体。"
    },
    {
      "word_to_compare": "performance",
      "analysis": "“Performance” (表演) 是一个更广义的词，涵盖戏剧、音乐、舞蹈等多种艺术形式的公开演出。而 “dance” 专指以身体动作为核心的艺术表达。一个舞蹈可以是表演的一部分，但并非所有表演都是舞蹈。"
    }
  ]
}