{
  "word": "dangling",
  "pronunciation": "dang·gling",
  "concise_definition": "adj. 悬垂的, 悬而未决的, 未完成的",
  "forms": {
    "base_form": "dangle",
    "present_participle": "dangling",
    "past_tense": "dangled",
    "past_participle": "dangled"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Hanging loosely or unattached from something, often in a way that appears unstable or unfinished.",
      "explanation_cn": "松散地悬挂或未固定在某物上，常给人一种不稳定或未完成的感觉。",
      "example_en": "The dangling wires posed a safety hazard.",
      "example_cn": "那些悬垂的电线构成了安全隐患。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Referring to a grammatical construction in which a modifier is not clearly connected to the word it is intended to modify, leading to ambiguity.",
      "explanation_cn": "指语法结构中修饰语未能清晰地与其所修饰的词相连接，从而造成语义模糊的现象，即‘悬垂修饰语’。",
      "example_en": "The sentence 'Running down the street, the dog chased the ball' contains a dangling modifier — it suggests the dog was running down the street, but the intended meaning was that the person was running.",
      "example_cn": "句子 'Running down the street, the dog chased the ball' 包含一个悬垂修饰语——它暗示狗在街上奔跑，但原意其实是人在奔跑。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing a matter, decision, or issue that has not been resolved or concluded, often left in an uncertain state.",
      "explanation_cn": "指尚未解决或完成的事项、决定或问题，常处于悬而未决的状态。",
      "example_en": "There are still several dangling issues from the last negotiation.",
      "example_cn": "上次谈判中仍有几个悬而未决的问题。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hanging",
      "analysis": "“Hanging” (悬挂) 是一个更通用的词，仅描述物体被悬挂的状态，不隐含不稳定或未完成的含义。而 “dangling” 强调悬挂物的松动、摇晃或不完整，常带有负面或令人不安的语义色彩。"
    },
    {
      "word_to_compare": "pending",
      "analysis": "“Pending” (待定的) 专指等待决定或解决的事项，语气更正式，常用于法律、行政或商务语境，强调时间上的等待。而 “dangling” 在描述未决事项时，更强调其‘悬而未落’的模糊状态，有时带有疏忽或结构缺陷的意味。"
    },
    {
      "word_to_compare": "loose",
      "analysis": "“Loose” (松散的) 描述的是某物未被紧固或控制的状态，但不一定垂直悬挂。例如松开的纽扣、松散的绳子。“Dangling” 则特指垂直或近垂直方向的悬挂，且常带有摆动或下垂的视觉意象。"
    }
  ]
}