{
  "word": "dares",
  "pronunciation": "dairz",
  "concise_definition": "n. 勇气, 胆量; v. 敢于, 挑战 (第三人称单数形式)",
  "forms": {
    "base_form": "dare",
    "plural": "dares",
    "third_person_singular": "dares",
    "past_tense": "dared",
    "past_participle": "dared",
    "present_participle": "daring"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A bold or reckless act undertaken to prove courage or defiance, often in a social context involving risk or challenge.",
      "explanation_cn": "指为证明勇气或反抗精神而采取的大胆甚至鲁莽的行为，通常发生在涉及风险或挑战的社会情境中。",
      "example_en": "He accepted the dare to jump off the bridge into the river.",
      "example_cn": "他接受了跳下桥进入河里的挑战。"
    },
    {
      "pos": "noun",
      "explanation_en": "A challenge or provocation issued to someone to do something risky or embarrassing, often among peers.",
      "explanation_cn": "指在同伴之间发出的、要求对方做某件有风险或尴尬之事的挑衅或挑战。",
      "example_en": "The kids made a game of dares during the sleepover.",
      "example_cn": "孩子们在过夜聚会时玩起了挑战游戏。"
    },
    {
      "pos": "verb",
      "explanation_en": "To have the courage or boldness to do something, especially something risky, difficult, or socially unacceptable.",
      "explanation_cn": "指有勇气或胆量去做某事，尤其是涉及风险、困难或社会不被接受的事情。",
      "example_en": "She dares to speak truth to power, even when others stay silent.",
      "example_cn": "即使他人沉默，她也敢于向权力说真话。"
    },
    {
      "pos": "verb",
      "explanation_en": "To challenge someone to do something, often as a test of courage or as a form of teasing.",
      "explanation_cn": "指挑战某人去做某事，通常是为了测试其勇气或作为一种戏弄方式。",
      "example_en": "He dared his friend to eat the spicy pepper.",
      "example_cn": "他挑衅朋友吃下那颗辣辣椒。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bravery",
      "analysis": "“Bravery” (勇敢) 是一个抽象名词，指一种内在的品质或状态，强调面对危险时的心理勇气。而 “dare” 作为名词时，特指一个具体的、外在的挑战行为，是勇敢的体现，而非品质本身。"
    },
    {
      "word_to_compare": "challenge",
      "analysis": "“Challenge” (挑战) 是一个更广泛、中性的词，可指任何困难的任务或竞争，不必然涉及勇气或冒险。而 “dare” 作为名词时，特指带有风险、挑衅或社交压力的挑战，常用于青少年或游戏语境。"
    },
    {
      "word_to_compare": "audacity",
      "analysis": "“Audacity” (大胆/无礼) 强调一种近乎无礼或冒犯的胆量，常带贬义，指不顾社会规范或他人感受的鲁莽行为。而 “dare” 可以是中性甚至褒义的，不一定含有冒犯意味，更多强调行为的冒险性。"
    }
  ]
}