{
  "word": "darker",
  "pronunciation": "dahr·kuhr",
  "concise_definition": "adj. 更暗的, 更深的, 更阴暗的",
  "forms": {
    "base_form": "dark",
    "comparative": "darker",
    "superlative": "darkest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having less light; of a deeper or more intense shade of a color, especially black or gray; describing a physical condition of reduced illumination.",
      "explanation_cn": "指光线较少，颜色更深或更浓烈，尤指黑色或灰色的色调；描述物理环境中光照减弱的状态。",
      "example_en": "The room became darker as the sun set behind the hills.",
      "example_cn": "太阳在山后落下，房间变得越来越暗。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by gloom, negativity, or moral corruption; used metaphorically to describe emotional, psychological, or ethical states.",
      "explanation_cn": "形容充满忧郁、消极或道德堕落的状态；常用于隐喻，描述情绪、心理或伦理上的阴暗面。",
      "example_en": "His latest novel explores darker themes of guilt and isolation.",
      "example_cn": "他最新的一部小说探讨了内疚与孤独等更阴暗的主题。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Referring to a person's skin tone that is more deeply pigmented than another's, often used in comparative contexts regarding race or ethnicity.",
      "explanation_cn": "指某人的肤色比他人更深，常用于比较种族或族裔之间的肤色差异。",
      "example_en": "She noticed her sister’s skin looked darker after spending the weekend at the beach.",
      "example_cn": "她注意到妹妹在海边度过周末后，皮肤变得更黑了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "dark",
      "analysis": "“Dark” 是原级形容词，泛指缺乏光线或颜色深沉，不带有比较含义。而 “darker” 是比较级，明确表示与另一个对象相比更暗，强调相对性。例如：The room is dark.（房间很暗） vs. This room is darker than the other.（这个房间比另一个更暗）"
    },
    {
      "word_to_compare": "gloomy",
      "analysis": "“Gloomy” 主要用于描述情绪或氛围上的压抑、悲观，侧重心理感受，常用于抽象语境，如天气、心情或前景。“Darker” 虽也可用于隐喻，但其本义是物理上的亮度降低，适用范围更广，既可用于视觉，也可用于道德或情绪层面。"
    },
    {
      "word_to_compare": "dusky",
      "analysis": "“Dusky” 指微暗、昏暗的色调，常用于描述黄昏时分的光线或肤色偏深但带有柔和感，语义更温和、诗意，常用于文学描写。“Darker” 更直接、中性，可用于任何程度的亮度对比，不带情感色彩。"
    }
  ]
}