{
  "word": "dark",
  "pronunciation": "dahrk",
  "concise_definition": "adj. 黑暗的, 阴暗的, 深色的; n. 黑暗, 黑夜",
  "forms": {
    "comparative": "darker",
    "superlative": "darkest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Devoid of light; not illuminated, often creating an atmosphere of obscurity or mystery.",
      "explanation_cn": "缺乏光线的；未被照亮的，常营造出模糊或神秘的氛围。",
      "example_en": "The room was so dark that I couldn't see my hand in front of my face.",
      "example_cn": "房间里黑得伸手不见五指。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Of a deep or low color, especially black, brown, or navy, as opposed to light or bright shades.",
      "explanation_cn": "颜色深沉或低饱和度的，尤其是黑色、棕色或藏青色，与浅色或明亮色调相对。",
      "example_en": "She wore a dark blue dress to the evening gala.",
      "example_cn": "她穿着一件深蓝色的礼服参加晚宴。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by gloom, evil, or moral corruption; often used metaphorically to describe sinister or depressing qualities.",
      "explanation_cn": "带有阴郁、邪恶或道德败坏特征的；常用于隐喻，形容阴险或令人沮丧的特质。",
      "example_en": "The novel explores dark themes of betrayal and revenge.",
      "example_cn": "这部小说探讨了背叛与复仇等阴暗主题。"
    },
    {
      "pos": "noun",
      "explanation_en": "The absence of light; the state or time of night when no sunlight is visible.",
      "explanation_cn": "光线的缺失；指没有阳光可见的夜晚或黑暗状态。",
      "example_en": "He walked cautiously through the dark, afraid of what might be lurking ahead.",
      "example_cn": "他谨慎地穿过黑暗，害怕前方潜伏着什么。"
    },
    {
      "pos": "noun",
      "explanation_en": "A state of ignorance, despair, or moral blindness; often used in abstract or philosophical contexts.",
      "explanation_cn": "一种无知、绝望或道德盲目的状态；常用于抽象或哲学语境中。",
      "example_en": "The Enlightenment sought to bring reason out of the dark of superstition.",
      "example_cn": "启蒙运动旨在将理性从迷信的黑暗中解放出来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "black",
      "analysis": "“Black” (黑色) 是一种具体的颜色名称，强调视觉上的纯黑或极深色调，常用于物理描述。而 “dark” 是一个更宽泛的形容词，可指任何缺乏光亮或颜色深沉的状态，不一定限于黑色，如深蓝、深灰都可称 dark。"
    },
    {
      "word_to_compare": "gloomy",
      "analysis": "“Gloomy” (阴郁的) 主要强调情绪或氛围上的压抑、悲观，常用于心理或情感层面，如天气、心情或环境带来的沉重感。而 “dark” 可以是物理性的（无光），也可以是隐喻性的，但不必然带有情绪色彩。"
    },
    {
      "word_to_compare": "shadowy",
      "analysis": "“Shadowy” (朦胧的、有阴影的) 指由阴影造成的模糊不清、若隐若现的状态，强调视觉上的不清晰和不确定性。而 “dark” 更强调完全缺乏光线，是更彻底的黑暗，不一定有轮廓或阴影的层次感。"
    }
  ]
}