{
  "word": "dashed",
  "pronunciation": "dash·ed",
  "concise_definition": "adj. 短暂的, 疾驰的; v. 猛冲, 破坏 (dash 的过去式和过去分词)",
  "forms": {
    "base_form": "dash",
    "third_person_singular": "dashes",
    "past_tense": "dashed",
    "past_participle": "dashed",
    "present_participle": "dashing"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing something that is brief, hurried, or done in a quick, energetic manner; often used to characterize a short burst of action or a fleeting moment.",
      "explanation_cn": "形容某事短暂、匆忙或以快速、充满活力的方式完成；常用于描述短暂的行动或转瞬即逝的时刻。",
      "example_en": "She gave him a dashed smile before rushing out the door.",
      "example_cn": "她冲出门前匆匆给了他一个微笑。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used in British English to emphasize enthusiasm or intensity, often as an intensifier (e.g., 'dashed clever'), though this usage is now archaic.",
      "explanation_cn": "在英式英语中用作强调词，表达热情或强烈程度（如 'dashed clever'），但这一用法现已过时。",
      "example_en": "He was a dashed good cricketer in his day.",
      "example_cn": "他当年是个非常出色的板球运动员。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move suddenly and quickly in a particular direction, often with urgency or excitement.",
      "explanation_cn": "指突然而迅速地朝某个方向移动，常带有紧迫感或兴奋感。",
      "example_en": "The children dashed across the playground as soon as the bell rang.",
      "example_cn": "铃声一响，孩子们就冲向操场。"
    },
    {
      "pos": "verb",
      "explanation_en": "To destroy or ruin something suddenly and violently, often by breaking or smashing.",
      "explanation_cn": "指突然且猛烈地破坏或毁掉某物，通常通过击碎或摔坏实现。",
      "example_en": "The storm dashed the boat against the rocks.",
      "example_cn": "风暴把船撞向了岩石。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rushed",
      "analysis": "“Rushed” (匆忙) 强调因时间紧迫而加快速度，常带有焦虑或压力的语义色彩；而 “dashed” 更强调动作的突然性、爆发性和方向性，常带有更生动、更具画面感的动态意味。"
    },
    {
      "word_to_compare": "sprinted",
      "analysis": "“Sprinted” (短跑) 专指在短距离内以最快速度奔跑，是体育语境中的精确术语；“dashed” 则更口语化、更广泛，可用于非运动场景（如情绪冲动下的行动），不限于跑步。"
    },
    {
      "word_to_compare": "smashed",
      "analysis": "“Smashed” (砸碎) 侧重于物理破坏的结果，强调物体被彻底粉碎；而 “dashed” 在表示破坏时，常暗示撞击导致的破碎或毁灭，但不一定完全粉碎，有时保留部分形态，如 ‘dashed against the wall’。"
    }
  ]
}