{
  "word": "dash",
  "pronunciation": "dash",
  "concise_definition": "n. 短跑, 破折号, 一瞥; v. 猛冲, 粉碎, 涂抹",
  "forms": {
    "third_person_singular": "dashes",
    "past_tense": "dashed",
    "past_participle": "dashed",
    "present_participle": "dashing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A short, fast run or movement, often over a short distance, typically done with urgency or energy.",
      "explanation_cn": "指短距离内快速奔跑或移动，通常带有紧迫感或充沛的活力。",
      "example_en": "He made a dash for the exit when the alarm sounded.",
      "example_cn": "警报响起时，他冲向出口。"
    },
    {
      "pos": "noun",
      "explanation_en": "A punctuation mark (—) used to indicate a break in a sentence, to set off parenthetical information, or to introduce a summary or conclusion.",
      "explanation_cn": "一种标点符号（—），用于表示句子中的停顿、插入补充信息，或引出总结或结论。",
      "example_en": "She was brilliant—courageous, witty, and utterly devoted to her cause.",
      "example_cn": "她才华横溢——勇敢、机智，且全心全意投入她的事业。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small amount of something added quickly, especially a liquid or seasoning, often used in cooking.",
      "explanation_cn": "指快速加入的一小部分物质，尤指液体或调味品，常用于烹饪中。",
      "example_en": "Add a dash of salt and a dash of pepper to enhance the flavor.",
      "example_cn": "加一点盐和一点胡椒以提升风味。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or send something suddenly and forcefully in a particular direction, often at high speed.",
      "explanation_cn": "指突然而有力地向某个方向移动或投掷某物，通常速度很快。",
      "example_en": "He dashed the cup to the floor in anger.",
      "example_cn": "他愤怒地把杯子摔在地上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move very quickly, especially in a hurried or frantic manner.",
      "explanation_cn": "指以非常快的速度移动，通常带有匆忙或慌乱的意味。",
      "example_en": "The children dashed across the playground before the bell rang.",
      "example_cn": "孩子们在铃声响起前冲过了操场。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sprint",
      "analysis": "“Sprint”（短跑）专指体育或竞技中的全力快速奔跑，强调速度和耐力的极限表现，通常有明确的距离和规则。而 “dash” 更广泛，可用于非体育语境，强调动作的突然性和紧迫感，不一定有竞技性质。"
    },
    {
      "word_to_compare": "hyphen",
      "analysis": "“Hyphen”（连字符，-）用于连接单词或构成复合词（如 well-known），长度较短，功能是连接；而 “dash”（破折号，—）更长，用于表示语义上的中断、强调或补充，功能更接近括号或冒号。两者在排版和语义上不可互换。"
    },
    {
      "word_to_compare": "smear",
      "analysis": "“Smear”（涂抹）强调将物质（如颜料、污渍）不均匀地、缓慢地或故意地涂开，常带有负面含义（如抹黑声誉）；而 “dash” 在表示涂抹时，强调快速、短促、点状的动作，如用笔一划，更轻快且常用于调味或绘画中的点缀。"
    }
  ]
}