{
  "word": "dating",
  "pronunciation": "dey·ting",
  "concise_definition": "n. 恋爱, 约会; v. 约会, 确定年代",
  "forms": {
    "base_form": "date",
    "third_person_singular": "dates",
    "past_tense": "dated",
    "past_participle": "dated",
    "present_participle": "dating"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The activity of going out with someone romantically, typically as a preliminary stage in a relationship, involving social outings such as dinner, movies, or walks.",
      "explanation_cn": "指两个人以浪漫为目的进行的外出交往活动，通常是关系发展的初期阶段，包括共进晚餐、看电影或散步等社交行为。",
      "example_en": "They've been dating for six months and are considering moving in together.",
      "example_cn": "他们已经约会六个月了，正在考虑同居。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of assigning a date or time to an object, event, or artifact, especially in archaeology, history, or geology, to determine its age or period.",
      "explanation_cn": "指为某物、事件或文物确定其年代或时期，常用于考古学、历史学或地质学中，以判断其时间归属。",
      "example_en": "The archaeologists used carbon dating to establish the age of the ancient pottery.",
      "example_cn": "考古学家使用碳定年法确定了古代陶器的年代。"
    },
    {
      "pos": "verb",
      "explanation_en": "To engage in romantic or social meetings with someone regularly, often with the intention of exploring a potential relationship.",
      "explanation_cn": "指定期与某人进行浪漫或社交性质的会面，通常旨在探索建立潜在的亲密关系。",
      "example_en": "She's dating a musician from Berlin and says he's very thoughtful.",
      "example_cn": "她正在和一位来自柏林的音乐家约会，说他非常体贴。"
    },
    {
      "pos": "verb",
      "explanation_en": "To determine or assign the time period to which something belongs, especially through scientific or historical analysis.",
      "explanation_cn": "指通过科学或历史分析来确定某物所属的时代或年代。",
      "example_en": "Experts dated the manuscript to the 14th century based on its ink and parchment.",
      "example_cn": "专家根据墨水和羊皮纸将这份手稿的年代确定为14世纪。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "courtship",
      "analysis": "“Courtship”（求爱）强调传统、正式且有明确婚姻意图的恋爱过程，通常包含家庭参与和礼仪规范；而 “dating” 更现代、随意，不一定以结婚为目的，侧重于个人情感探索和社交互动。"
    },
    {
      "word_to_compare": "appointment",
      "analysis": "“Appointment”（预约）指为任何目的（如医疗、商务）安排的正式会面，强调时间与事务性，无情感或浪漫成分；而 “dating” 专指浪漫关系中的约会，具有情感意图和社交性质。"
    },
    {
      "word_to_compare": "chronology",
      "analysis": "“Chronology”（年代学）是系统性排列事件或物品时间顺序的学科或方法，是抽象概念；而 “dating” 是实现时间定位的具体行为或过程，是建立 chronology 的手段之一。"
    }
  ]
}