{
  "word": "daytona",
  "pronunciation": "dā·tōn·ə",
  "concise_definition": "n. 迪通纳（美国佛罗里达州城市名；常用于赛车、汽车品牌）",
  "forms": {
    "plural": "daytonas"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A city in Volusia County, Florida, USA, renowned for its beaches and as the home of the Daytona International Speedway, one of the most famous motorsport venues in the world.",
      "explanation_cn": "美国佛罗里达州沃卢西亚县的一个城市，以其海滩闻名，同时也是戴通纳国际赛道的所在地——这是全球最著名的赛车场地之一。",
      "example_en": "Every February, thousands of racing fans flock to Daytona for the Daytona 500.",
      "example_cn": "每年二月，成千上万的赛车迷都会前往戴通纳观看戴通纳500大赛。"
    },
    {
      "pos": "noun",
      "explanation_en": "A model name used by automotive manufacturers, especially for high-performance or luxury vehicles, such as the Dodge Daytona or the Chrysler Daytona, evoking speed, heritage, and American muscle car culture.",
      "explanation_cn": "汽车制造商用于高性能或豪华车型的命名，如道奇戴通纳或克莱斯勒戴通纳，象征速度、传统与美国肌肉车文化。",
      "example_en": "The 1985 Dodge Daytona was a aerodynamic masterpiece designed for NASCAR racing.",
      "example_cn": "1985年的道奇戴通纳是一款为NASCAR赛事设计的空气动力学杰作。"
    },
    {
      "pos": "noun",
      "explanation_en": "A brand or product name adopted in various industries (e.g., watches, apparel) to convey a sense of speed, endurance, and American motorsport legacy.",
      "explanation_cn": "被多个行业（如手表、服装）采用的品牌或产品名称，用以传达速度、耐力与美国赛车传统的象征意义。",
      "example_en": "She wore a Daytona-style chronograph watch, a classic symbol of racing elegance.",
      "example_cn": "她佩戴了一款戴通纳风格的计时表，这是赛车优雅的经典象征。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "speedway",
      "analysis": "“Speedway”（赛车场）是一个通用术语，泛指任何用于赛车的赛道，而 “Daytona” 特指位于佛罗里达州的戴通纳国际赛道，是具体地名和文化符号，承载着历史与品牌价值。"
    },
    {
      "word_to_compare": "NASCAR",
      "analysis": "“NASCAR” 是美国全国运动汽车竞赛协会的缩写，指代一项赛车赛事体系，而 “Daytona” 是该体系中最著名的举办地和标志性赛事（如Daytona 500）的代名词。前者是组织，后者是地点与象征。"
    },
    {
      "word_to_compare": "monaco",
      "analysis": "“Monaco”（摩纳哥）是欧洲著名的赛车圣地，以F1摩纳哥大奖赛闻名，代表欧洲的精致与街道赛传统；而 “Daytona” 代表美国的高速椭圆赛道文化与肌肉车精神，两者在地理、文化与赛车风格上形成鲜明对比。"
    }
  ]
}