{
  "word": "dealt",
  "pronunciation": "delt",
  "concise_definition": "v. 处理, 应对, 发牌, 交易 (deal 的过去式和过去分词)",
  "forms": {
    "base_form": "deal",
    "third_person_singular": "deals",
    "present_participle": "dealing",
    "past_tense": "dealt",
    "past_participle": "dealt"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To handle or manage a situation, problem, or task, often in a particular way, especially when it is difficult or complex.",
      "explanation_cn": "指以某种方式处理、应对或管理一种情况、问题或任务，尤其当其困难或复杂时。",
      "example_en": "She dealt with the complaint calmly and professionally.",
      "example_cn": "她冷静而专业地处理了这起投诉。"
    },
    {
      "pos": "verb",
      "explanation_en": "To distribute cards to players in a game, especially in card games like poker or bridge.",
      "explanation_cn": "指在纸牌游戏中将牌分发给玩家，尤指扑克或桥牌等游戏。",
      "example_en": "The dealer dealt five cards to each player.",
      "example_cn": "发牌人给每位玩家发了五张牌。"
    },
    {
      "pos": "verb",
      "explanation_en": "To engage in business or trade, especially in a particular type of goods or services.",
      "explanation_cn": "指从事商业或交易，尤指经营某种商品或服务。",
      "example_en": "The shop deals in antique furniture and rare books.",
      "example_cn": "这家商店经营古董家具和珍本书籍。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give or impose something, especially something unpleasant or a punishment, often in a decisive or forceful manner.",
      "explanation_cn": "指给予或施加某种事物，尤指不愉快的事物或惩罚，常带有果断或强硬的意味。",
      "example_en": "The judge dealt a harsh sentence to the convicted criminal.",
      "example_cn": "法官对这名罪犯判处了严厉的刑罚。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "handled",
      "analysis": "“Handled” (处理) 更侧重于对人、物或事务的直接操作或管理，语气中性，常用于日常语境。而 “dealt” 在表示处理时，常隐含应对挑战、困难或复杂局面的意味，语气更强烈，有时带有策略性或果断性。"
    },
    {
      "word_to_compare": "distributed",
      "analysis": "“Distributed” (分发) 是一个更通用、更中性的词，强调将物品或资源按一定方式分配给多人，不局限于纸牌游戏。而 “dealt” 专用于纸牌游戏中的发牌行为，具有特定语境和文化含义。"
    },
    {
      "word_to_compare": "traded",
      "analysis": "“Traded” (交易) 强调双方交换商品、服务或价值，是双向行为。而 “dealt” 在商业语境中更宽泛，可指经营、从事某类业务，不一定涉及直接交换，例如‘a store deals in electronics’ 不等于‘trades electronics’。"
    },
    {
      "word_to_compare": "imposed",
      "analysis": "“Imposed” (强加) 通常带有强制、单方面施加的负面含义，如强加规则或惩罚。而 “dealt” 在表示施加惩罚时，语气更中性或正式，常用于法律或权威语境，且不必然带有压迫感。"
    }
  ]
}