{
  "word": "deck",
  "pronunciation": "dek",
  "concise_definition": "n. 甲板, 扑克牌, 一层楼面; v. 装饰, 布置",
  "forms": {
    "plural": "decks",
    "third_person_singular": "decks",
    "past_tense": "decked",
    "past_participle": "decked",
    "present_participle": "decking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The flat floor or platform of a ship, airplane, or other vehicle, typically used for walking, working, or storing equipment.",
      "explanation_cn": "船、飞机或其他交通工具上的平坦地板或平台，通常用于行走、工作或存放设备。",
      "example_en": "The crew cleaned the deck before the ship set sail.",
      "example_cn": "船员在船启航前清扫了甲板。"
    },
    {
      "pos": "noun",
      "explanation_en": "A complete set of playing cards, usually consisting of 52 cards divided into four suits, sometimes including jokers.",
      "explanation_cn": "一副完整的扑克牌，通常由52张牌组成，分为四种花色，有时还包括大小王。",
      "example_en": "He shuffled the deck and dealt five cards to each player.",
      "example_cn": "他洗了牌，给每位玩家发了五张牌。"
    },
    {
      "pos": "noun",
      "explanation_en": "A level or floor of a building, especially one that is open or partially open, such as a rooftop deck or a balcony.",
      "explanation_cn": "建筑物的某一层或平台，尤其是开放或半开放的区域，如屋顶露台或阳台。",
      "example_en": "We enjoyed the sunset from the back deck of the house.",
      "example_cn": "我们在房子的后院露台上欣赏日落。"
    },
    {
      "pos": "verb",
      "explanation_en": "To decorate or adorn something elaborately, often for a special occasion or to create a festive atmosphere.",
      "explanation_cn": "以华丽的方式装饰或布置某物，通常用于特殊场合或营造节日气氛。",
      "example_en": "They decked the halls with garlands and lights for Christmas.",
      "example_cn": "他们用花环和彩灯把大厅装饰得充满圣诞气氛。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "platform",
      "analysis": "“Platform”（平台）泛指任何用于站立、支撑或操作的平坦表面，可以是建筑结构、铁路站台或数字系统中的基础架构，语义更广，不特指船舶或建筑的楼层。而 “deck” 通常特指船舶、飞机或住宅的露天平台，具有明确的物理和功能语境。"
    },
    {
      "word_to_compare": "pack",
      "analysis": "“Pack”（一包/套）常用于指一组捆绑或包装在一起的物品，如一包香烟、一包纸牌，但不强调其作为完整游戏工具的规范性。而 “deck” 在扑克语境中特指标准的52张牌组合，具有固定结构和文化共识，是专业术语。"
    },
    {
      "word_to_compare": "decorate",
      "analysis": "“Decorate”（装饰）是通用动词，泛指任何美化行为，如挂画、摆花等。而 “deck” 作为动词时，特指以大量、隆重、节日性的方式进行装饰，常与 “out” 连用（deck out），带有更强的视觉冲击力和仪式感，语义更具体、更具表现力。"
    }
  ]
}