{
  "word": "decks",
  "pronunciation": "dekz",
  "concise_definition": "n. 甲板, 扑克牌, 一叠, 层",
  "forms": {
    "singular": "deck"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A flat horizontal surface forming the floor of a ship, airplane, or other vehicle, typically used for walking, working, or storing equipment.",
      "explanation_cn": "指船舶、飞机或其他交通工具上的水平平面结构，通常用作行走、工作或存放设备的平台。",
      "example_en": "The crew cleaned the deck after the storm.",
      "example_cn": "风暴过后，船员们清理了甲板。"
    },
    {
      "pos": "noun",
      "explanation_en": "A complete set of playing cards, usually consisting of 52 cards divided into four suits, sometimes including jokers.",
      "explanation_cn": "指一套完整的扑克牌，通常由52张牌组成，分为四种花色，有时还包括大小王。",
      "example_en": "He shuffled the deck before dealing the cards.",
      "example_cn": "发牌前，他洗了洗牌。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large, flat structure built on top of a building, often used for outdoor activities or relaxation, such as a rooftop deck.",
      "explanation_cn": "指建在建筑物顶部的大型平坦结构，常用于户外活动或休闲，如屋顶露台。",
      "example_en": "We enjoyed dinner on the deck with a view of the ocean.",
      "example_cn": "我们在露台上享用晚餐，俯瞰大海。"
    },
    {
      "pos": "noun",
      "explanation_en": "A stack or layer of objects arranged neatly on top of one another, such as a deck of papers or a deck of tiles.",
      "explanation_cn": "指整齐堆叠在一起的一叠或一层物体，如一叠文件或一叠瓷砖。",
      "example_en": "She stacked the books into a neat deck on the shelf.",
      "example_cn": "她把书整齐地堆成一叠放在书架上。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "platform",
      "analysis": "“Platform”（平台）泛指任何用于支撑、站立或操作的水平表面，可以是建筑结构、铁路站台或抽象概念（如技术平台）。它不特指船舶或建筑顶部，也不包含“叠放”的含义。而 “deck” 更具体地指船舶、飞机或房屋顶部的结构，或一叠整齐的物品。"
    },
    {
      "word_to_compare": "pack",
      "analysis": "“Pack”（一包）通常指用包装材料包裹起来的一组物品，如一包香烟或一包衣服，强调封装和运输。而 “deck” 用于扑克牌时，强调的是牌的完整性和标准组合，且通常未被封装，可随时取用。"
    },
    {
      "word_to_compare": "layer",
      "analysis": "“Layer”（层）强调的是物质或结构在垂直方向上的叠加，常用于地质、化学或抽象语境（如数据层）。它不带有“整齐堆叠”或“可计数单位”的含义。而 “deck” 在表示叠放时，隐含了物品的完整性与规范性，如一叠牌或一叠纸，具有明确的边界和数量。"
    }
  ]
}