{
  "word": "decomposition",
  "pronunciation": "dee·komp·uh·zish·uhn",
  "concise_definition": "n. 分解, 腐烂, 退化",
  "forms": {
    "plural": "decompositions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process by which organic matter breaks down into simpler substances through the action of bacteria, fungi, or other biological and chemical processes.",
      "explanation_cn": "指有机物质在细菌、真菌或其他生物和化学作用下分解为更简单物质的过程。",
      "example_en": "The decomposition of fallen leaves enriches the soil with nutrients.",
      "example_cn": "落叶的分解为土壤增添了养分。"
    },
    {
      "pos": "noun",
      "explanation_en": "The state or process of something breaking down into its constituent parts, often leading to deterioration or loss of integrity, whether physical, structural, or conceptual.",
      "explanation_cn": "指某事物分解为其组成部分的状态或过程，常导致其物理、结构或概念上的退化或完整性丧失。",
      "example_en": "The decomposition of the political alliance led to widespread instability.",
      "example_cn": "政治联盟的瓦解导致了广泛的不稳定。"
    },
    {
      "pos": "noun",
      "explanation_en": "In mathematics or computer science, the act of breaking a complex problem, system, or function into smaller, more manageable components for analysis or computation.",
      "explanation_cn": "在数学或计算机科学中，将一个复杂的问题、系统或函数分解为更小、更易管理的组成部分以进行分析或计算的过程。",
      "example_en": "Algorithmic decomposition allows programmers to solve large problems by tackling smaller subproblems.",
      "example_cn": "算法分解使程序员能够通过解决较小的子问题来应对大型问题。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "decay",
      "analysis": "“Decay” (腐烂/衰败) 通常指因自然老化、侵蚀或腐败而导致的逐渐恶化，多用于生物体或物质的物理退化，带有负面情感色彩。而 “decomposition” 更中性，强调分解的科学过程，可涵盖生物、化学或抽象系统的结构拆解。"
    },
    {
      "word_to_compare": "deterioration",
      "analysis": "“Deterioration” (恶化) 强调质量、状态或条件的下降，侧重结果而非过程。它不必然涉及物质被分解，而可能是功能减弱或性能降低。而 “decomposition” 更具体地指物质或结构被拆解为基本成分的过程。"
    },
    {
      "word_to_compare": "disintegration",
      "analysis": "“Disintegration” (瓦解/解体) 指整体结构的崩溃或分裂，常用于组织、系统或情感层面，强调突然或剧烈的破碎。而 “decomposition” 更倾向于缓慢、渐进的化学或生物分解，也更常用于自然科学语境。"
    }
  ]
}