{
  "word": "decorating",
  "pronunciation": "dih·kawr·uh·tying",
  "concise_definition": "v. 装饰, 布置, 修饰",
  "forms": {
    "base_form": "decorate",
    "third_person_singular": "decorates",
    "past_tense": "decorated",
    "past_participle": "decorated",
    "present_participle": "decorating"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To make something more attractive by adding ornamental elements, such as colors, patterns, lights, or objects, often for aesthetic or celebratory purposes.",
      "explanation_cn": "通过添加装饰性元素（如颜色、图案、灯光或物品）使某物更具吸引力，通常用于审美或庆祝目的。",
      "example_en": "They spent the whole weekend decorating the house with lights and garlands for Christmas.",
      "example_cn": "他们整个周末都在用彩灯和花环装饰房子，为圣诞节做准备。"
    },
    {
      "pos": "verb",
      "explanation_en": "To enhance the appearance of a space, object, or surface by applying design elements, often to reflect a particular style or theme.",
      "explanation_cn": "通过应用设计元素来提升空间、物体或表面的外观，通常为了体现某种风格或主题。",
      "example_en": "She is decorating her apartment in a minimalist Scandinavian style.",
      "example_cn": "她正在以极简的斯堪的纳维亚风格装饰她的公寓。"
    },
    {
      "pos": "verb",
      "explanation_en": "To adorn or embellish something, especially in a ceremonial or symbolic context, such as awarding medals or placing honors.",
      "explanation_cn": "在仪式或象征性语境中装饰或美化某物，例如授予奖章或佩戴荣誉标志。",
      "example_en": "The general was decorated with the highest military honors for his bravery.",
      "example_cn": "这位将军因英勇表现被授予了最高军事荣誉。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "adorn",
      "analysis": "“Adorn”（装饰）更强调以优雅或高贵的方式美化，常用于文学语境，多指添加精致、持久的装饰物，如珠宝、刺绣等，语气较正式。而 “decorating” 更通用，涵盖从日常布置到节日装点的各种场景，语气更生活化。"
    },
    {
      "word_to_compare": "embellish",
      "analysis": "“Embellish”（修饰）常指通过添加细节或夸张元素来增强表现力，有时带有‘过度修饰’或‘虚构’的隐含意义（如 embellish a story）。而 “decorating” 通常不带贬义，纯粹指视觉上的美化，不涉及内容的扭曲。"
    },
    {
      "word_to_compare": "furnish",
      "analysis": "“Furnish”（配备家具）指为房间或空间提供功能性家具和设备，强调实用性和布局。而 “decorating” 侧重于非功能性、审美性的元素，如墙纸、挂画、靠垫等，目的是提升美感而非满足基本使用需求。"
    }
  ]
}