{
  "word": "deep",
  "pronunciation": "deepp",
  "concise_definition": "adj. 深的, 深刻的, 深远的; adv. 深深地, 深入地",
  "forms": {
    "comparative": "deeper",
    "superlative": "deepest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Extending far down from the top or surface; describing physical depth, such as in water, holes, or containers.",
      "explanation_cn": "指从顶部或表面向下延伸得很远的，用于描述物理上的深度，如水、洞穴或容器的深度。",
      "example_en": "The diver explored the deep ocean trenches.",
      "example_cn": "潜水员探索了深海海沟。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Of great intensity, complexity, or emotional significance; describing something that is profound, serious, or meaningful.",
      "explanation_cn": "指具有极大强度、复杂性或情感意义的，用于描述深刻、严肃或有意义的事物。",
      "example_en": "She offered a deep insight into human nature.",
      "example_cn": "她对人性提出了深刻的见解。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Producing a low or resonant sound; describing tones that are low in pitch.",
      "explanation_cn": "指发出低沉或共鸣声音的，用于描述音调低的声音。",
      "example_en": "The deep voice of the narrator added gravity to the story.",
      "example_cn": "叙述者低沉的声音为故事增添了庄重感。"
    },
    {
      "pos": "adverb",
      "explanation_en": "To a great depth; describing the extent of physical or metaphorical penetration.",
      "explanation_cn": "指达到很大的深度，用于描述物理上或隐喻上的深入程度。",
      "example_en": "He slept deep into the morning.",
      "example_cn": "他一直睡到上午很晚。"
    },
    {
      "pos": "adverb",
      "explanation_en": "In a profound or intense manner; describing actions or states that are thorough or emotionally intense.",
      "explanation_cn": "以深刻或强烈的方式，用于描述彻底或情感强烈的行为或状态。",
      "example_en": "They were deeply moved by the performance.",
      "example_cn": "他们被这场演出深深打动了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "profound",
      "analysis": "“Profound”（深刻的）更强调思想、情感或意义的深度，常用于抽象概念，如洞见、影响或理解，语气更正式、更严肃。而 “deep” 既可用于物理深度，也可用于抽象意义，适用范围更广，语体更中性。"
    },
    {
      "word_to_compare": "intense",
      "analysis": "“Intense”（强烈的）侧重于程度的激烈或集中，如情绪、压力或活动，但不一定涉及“深度”。“Deep” 强调从表面到内部的延伸或渗透，更注重纵向维度，而 “intense” 更强调横向的强烈程度。"
    },
    {
      "word_to_compare": "thick",
      "analysis": "“Thick”（厚的）描述的是物体在三维空间中横向的尺寸，如厚书、厚雾，与“深”（纵向）形成对比。例如，深海是深度，厚雾是密度或宽度。两者不可互换，常被误用，但语义维度完全不同。"
    }
  ]
}