{
  "word": "defences",
  "pronunciation": "dih·fen·siz",
  "concise_definition": "n. 防御, 防护, 辩护, 防御工事",
  "forms": {
    "singular": "defence"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Measures taken to protect against attack, harm, or danger, whether physical, military, or abstract (e.g., legal, psychological).",
      "explanation_cn": "为抵御攻击、伤害或危险而采取的措施，可以是物理的、军事的，也可以是抽象的（如法律上的、心理上的）。",
      "example_en": "The castle's defences included high walls, moats, and watchtowers.",
      "example_cn": "这座城堡的防御工事包括高墙、护城河和瞭望塔。"
    },
    {
      "pos": "noun",
      "explanation_en": "A legal argument or strategy used to justify or excuse a person's actions in court, aiming to avoid liability or punishment.",
      "explanation_cn": "在法庭上为辩解或开脱某人行为而提出的法律论点或策略，旨在避免承担责任或惩罚。",
      "example_en": "His defence of self-defence was accepted by the jury.",
      "example_cn": "陪审团接受了他关于正当防卫的辩护。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of protecting or supporting someone or something against criticism or attack; a form of advocacy.",
      "explanation_cn": "为保护或支持某人或某事物免受批评或攻击而进行的辩护行为，是一种倡导形式。",
      "example_en": "Her defence of free speech earned her widespread respect.",
      "example_cn": "她为言论自由所做的辩护赢得了广泛的尊重。"
    },
    {
      "pos": "noun",
      "explanation_en": "In sports, the team or players responsible for preventing the opposing side from scoring.",
      "explanation_cn": "在体育运动中，负责阻止对方得分的队伍或球员。",
      "example_en": "The team's defences held strong throughout the second half.",
      "example_cn": "整场下半场，球队的防守都十分稳固。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "protection",
      "analysis": "“Protection” (保护) 是一个更广泛、更通用的词，泛指任何使某物免受伤害的行为或措施，不特指对抗性情境。而 “defence” 更强调主动应对威胁或攻击，常带有对抗性、战略性含义，如军事防御或法律辩护。"
    },
    {
      "word_to_compare": "shield",
      "analysis": "“Shield” (盾牌/防护物) 通常指具体的物理屏障或工具，如武器或设备，也可作动词使用。它强调的是物理阻隔功能。而 “defence” 是抽象概念，涵盖策略、法律、心理等多层面的防护机制，不局限于实体。"
    },
    {
      "word_to_compare": "argument",
      "analysis": "“Argument” (论点) 指为支持某种立场而提出的理由或陈述，可以是中立的或辩论性的。而 “defence” 在法律或道德语境中特指为开脱责任而提出的系统性论点，具有明确的保护性目的，语义更聚焦于‘辩护’而非‘争论’。"
    }
  ]
}