{
  "word": "deformation",
  "pronunciation": "dee·fawr·mey·shun",
  "concise_definition": "n. 变形, 变状, 扭曲",
  "forms": {
    "plural": "deformations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A change in the shape or form of an object or structure, often due to external force, pressure, or stress, resulting in a deviation from its original or intended form.",
      "explanation_cn": "指物体或结构因外力、压力或应力作用而发生的形状或形态改变，导致其偏离原始或预期形态。",
      "example_en": "The metal beam showed visible deformation after the earthquake.",
      "example_cn": "地震后，金属梁出现了明显的变形。"
    },
    {
      "pos": "noun",
      "explanation_en": "A distortion or alteration in appearance, meaning, or function, especially when referring to abstract concepts such as perception, language, or social norms.",
      "explanation_cn": "指外观、意义或功能上的扭曲或改变，尤其用于抽象概念，如知觉、语言或社会规范的扭曲。",
      "example_en": "The media's portrayal of beauty has led to a dangerous deformation of self-image among teenagers.",
      "example_cn": "媒体对美的描绘导致青少年自我形象的严重扭曲。"
    },
    {
      "pos": "noun",
      "explanation_en": "In mathematics or physics, a transformation of a geometric figure or material that alters its dimensions or configuration while preserving certain properties (e.g., continuity).",
      "explanation_cn": "在数学或物理学中，指几何图形或物质发生的改变其尺寸或构型的变换，同时保留某些特性（如连续性）。",
      "example_en": "In continuum mechanics, deformation is analyzed to understand how materials respond to applied forces.",
      "example_cn": "在连续介质力学中，通过分析变形来理解材料如何响应外力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "distortion",
      "analysis": "“Distortion”（扭曲）更侧重于信息、图像或声音的失真，或抽象概念的歪曲，常带有负面价值判断，如偏见或误导。而 “deformation” 更常用于物理形态的改变，强调结构或形状的实际变化，语义范围更偏向于物质层面。"
    },
    {
      "word_to_compare": "alteration",
      "analysis": "“Alteration”（改变）是一个更中性、更广泛的词，泛指任何形式的修改或调整，不一定是形态上的破坏或偏离。而 “deformation” 隐含了不自然、非预期或有害的形态变化，语义更具体且常带负面含义。"
    },
    {
      "word_to_compare": "warpage",
      "analysis": "“Warpage”（翘曲）是 “deformation” 的一个子类，特指材料因受热、湿度或应力不均而发生的弯曲或扭曲，多用于工程和制造领域。而 “deformation” 是更通用的术语，涵盖所有类型的形状改变，包括压缩、拉伸、弯曲等。"
    }
  ]
}