{
  "word": "degenerate",
  "pronunciation": "dih·jen·uh·reyt",
  "concise_definition": "v. 退化, 堕落; adj. 退化的, 堕落的",
  "forms": {
    "third_person_singular": "degenerates",
    "past_tense": "degenerated",
    "past_participle": "degenerated",
    "present_participle": "degenerating"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To decline in quality, morality, or physical condition; to become worse or more corrupt over time, often through neglect or decay.",
      "explanation_cn": "指在质量、道德或生理状态上逐渐衰退，因疏忽或腐化而变得越来越糟糕。",
      "example_en": "The once-thriving neighborhood has degenerated into a center of crime and poverty.",
      "example_cn": "这个曾经繁荣的社区已退化为犯罪和贫困的中心。"
    },
    {
      "pos": "verb",
      "explanation_en": "In biology, to lose specialized features or functions through evolutionary or pathological change, often reverting to a simpler or less efficient form.",
      "explanation_cn": "在生物学中，指因进化或病理变化而丧失特化特征或功能，常退化为更简单或效率更低的形式。",
      "example_en": "Cave-dwelling fish have degenerated eyesight due to living in perpetual darkness.",
      "example_cn": "穴居鱼类因长期生活在黑暗中，视力已退化。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Having declined in moral, intellectual, or physical quality; characterized by corruption, decay, or lack of refinement.",
      "explanation_cn": "在道德、智力或生理品质上已衰退的；以腐败、腐化或缺乏教养为特征的。",
      "example_en": "The film was criticized for its degenerate portrayal of human relationships.",
      "example_cn": "这部电影因其对人际关系的堕落描绘而受到批评。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "deteriorate",
      "analysis": "“Deteriorate” (恶化) 强调状态或条件的逐渐变差，通常用于物理、健康或环境层面，中性且客观。而 “degenerate” 更具道德或价值判断色彩，常暗示堕落、腐化或丧失高尚性，语义更强烈、更负面。"
    },
    {
      "word_to_compare": "corrupt",
      "analysis": "“Corrupt” (腐败) 侧重于因贪婪、贿赂或不道德行为而导致的道德败坏，通常是主动的、人为的堕落。而 “degenerate” 可以是主动的，也可以是被动的、渐进的退化，不一定涉及故意的恶行，可能源于环境或遗传。"
    },
    {
      "word_to_compare": "decay",
      "analysis": "“Decay” (腐烂/衰败) 多用于物质或有机体的自然分解过程，如食物腐烂、建筑朽坏，强调物理或生物层面的分解。而 “degenerate” 更常用于抽象概念（如道德、文化、能力）的退化，具有更广泛的社会或哲学含义。"
    }
  ]
}