{
  "word": "degeneration",
  "pronunciation": "dee·juh·ner·ay·shun",
  "concise_definition": "n. 退化, 衰退, 变质",
  "forms": {
    "plural": "degenerations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process by which something deteriorates in quality, structure, or function over time, often leading to a loss of complexity, vitality, or moral integrity.",
      "explanation_cn": "指某事物在时间推移中质量、结构或功能逐渐恶化的过程，常导致复杂性、活力或道德品质的丧失。",
      "example_en": "The degeneration of the city's infrastructure has led to frequent power outages and unsafe roads.",
      "example_cn": "城市基础设施的退化导致了频繁的停电和危险的道路。"
    },
    {
      "pos": "noun",
      "explanation_en": "A decline in moral, cultural, or social standards, often used to criticize perceived decay in societal values or behavior.",
      "explanation_cn": "指道德、文化或社会标准的下降，常用于批评社会价值观或行为的堕落。",
      "example_en": "Critics argue that the rise of sensationalist media reflects a broader cultural degeneration.",
      "example_cn": "批评者认为，耸人听闻的媒体兴起反映了更广泛的文化堕落。"
    },
    {
      "pos": "noun",
      "explanation_en": "In biology, the gradual loss of function or structure in an organ, tissue, or organism, often due to disease, aging, or genetic factors.",
      "explanation_cn": "在生物学中，指由于疾病、衰老或遗传因素，器官、组织或生物体的功能或结构逐渐丧失。",
      "example_en": "Neurodegenerative diseases like Alzheimer's involve the degeneration of nerve cells in the brain.",
      "example_cn": "阿尔茨海默病等神经退行性疾病涉及大脑神经细胞的退化。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "decline",
      "analysis": "“Decline” (衰退) 是一个更广泛、更中性的词，可指数量、质量、地位或影响力的下降，不一定包含结构性或不可逆的恶化。而 “degeneration” 更强调内在结构或本质的退化，常带有负面、病理性的含义，暗示一种更深层的腐化或瓦解。"
    },
    {
      "word_to_compare": "deterioration",
      "analysis": "“Deterioration” (恶化) 与 “degeneration” 非常接近，常可互换，但 “deterioration” 更侧重于物理或功能状态的变差，如材料老化、健康状况变差；而 “degeneration” 更常用于抽象层面（如道德、文化）或生物学中的结构性退化，语义更深刻、更系统化。"
    },
    {
      "word_to_compare": "decay",
      "analysis": "“Decay” (腐烂/衰败) 常用于有机物的自然分解（如食物腐烂、牙齿蛀坏），或道德上的腐败，带有强烈的生物或物质分解意象。而 “degeneration” 更强调一种系统性、渐进性的功能丧失，不一定伴随物理分解，可应用于社会制度、神经系统或文明形态的退化。"
    }
  ]
}