{
  "word": "dehydrated",
  "pronunciation": "dee·hī·drā·təd",
  "concise_definition": "adj. 脱水的, 失水的",
  "forms": {
    "comparative": "more dehydrated",
    "superlative": "most dehydrated"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having lost a significant amount of water from the body or from a substance, often to the point of impairing normal function or structure.",
      "explanation_cn": "指身体或物质失去了大量水分，通常达到影响正常功能或结构的程度。",
      "example_en": "After running the marathon, he was severely dehydrated and needed immediate medical attention.",
      "example_cn": "跑完马拉松后，他严重脱水，需要立即接受医疗救助。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Of food or other materials that have had moisture removed to preserve them or reduce weight, often through drying or evaporation.",
      "explanation_cn": "指通过干燥或蒸发去除水分以保存或减轻重量的食物或其他材料。",
      "example_en": "Dehydrated fruits are a convenient snack for hikers because they are lightweight and long-lasting.",
      "example_cn": "脱水水果是徒步旅行者方便的零食，因为它们轻便且保质期长。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing a state of extreme dryness or lack of moisture in an environment or material, often resulting from artificial or natural processes.",
      "explanation_cn": "形容环境或物质处于极度干燥或缺乏水分的状态，通常由人为或自然过程造成。",
      "example_en": "The dehydrated soil cracked under the relentless summer sun.",
      "example_cn": "在持续的夏日阳光下，干裂的土地出现了裂缝。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "dry",
      "analysis": "“Dry” (干燥的) 是一个更广泛、更通用的词，泛指缺乏水分，可用于任何程度的水分缺失，如干燥的空气、干燥的皮肤。而 “dehydrated” 通常暗示水分流失已达到生理或功能上的显著程度，尤其用于生物体或需要保留水分的物质，带有更强烈的负面或技术性含义。"
    },
    {
      "word_to_compare": "dried",
      "analysis": "“Dried” (已干燥的) 强调的是一个已完成的处理过程，通常指人为去除水分（如晒干、烘干），多用于食品、衣物或材料，不必然伴随功能损害。而 “dehydrated” 可以是自然发生或病理性的，常用于描述生物体因失水而受损的状态，语义更侧重结果的影响而非过程。"
    },
    {
      "word_to_compare": "desiccated",
      "analysis": "“Desiccated” (极度干燥的) 与 “dehydrated” 非常接近，但更常用于科学或文学语境，强调彻底、极端的干燥，常用于植物、昆虫或考古遗物，带有“风干至枯槁”的意象。而 “dehydrated” 更常用于医学、营养学和日常语境，强调水分流失对生命体的影响。"
    }
  ]
}