{
  "word": "delayed",
  "pronunciation": "dih·leyd·id",
  "concise_definition": "adj. 延迟的, 推迟的, 落后的",
  "forms": {
    "base_form": "delay",
    "present_participle": "delaying",
    "past_tense": "delayed",
    "past_participle": "delayed"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Not happening or arriving at the expected or scheduled time; postponed or held back intentionally or due to circumstances.",
      "explanation_cn": "未在预期或预定时间发生或到达；因客观原因或人为因素被推迟或滞后的。",
      "example_en": "The delayed flight finally landed at midnight after a three-hour wait.",
      "example_cn": "延误的航班在等待三小时后终于在午夜降落。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by a slower-than-normal progression or response, especially in development, reaction, or performance.",
      "explanation_cn": "指发展、反应或表现比正常速度更慢的，常用于描述儿童发育、系统响应或进程缓慢的情况。",
      "example_en": "Children with delayed speech development may benefit from early intervention programs.",
      "example_cn": "语言发育迟缓的儿童可能从早期干预项目中受益。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used to describe a decision, action, or consequence that was intentionally postponed to a later time for strategic or practical reasons.",
      "explanation_cn": "用于描述因策略性或实际原因而有意推迟到以后才执行的决定、行动或后果。",
      "example_en": "The delayed implementation of the new policy allowed more time for public feedback.",
      "example_cn": "新政策的延迟实施为公众反馈争取了更多时间。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "late",
      "analysis": "“Late”（迟到的）通常指时间上已经超过了预定或正常的时间点，强调结果状态，多用于描述人或事物未按时到达或完成。而 “delayed” 更强调“被推迟”的过程或原因，可能尚未发生但已计划延后，具有更强的主动或被动干预含义。"
    },
    {
      "word_to_compare": "postponed",
      "analysis": "“Postponed”（延期的）特指有意识地将原定计划推到以后，通常带有主动决策的意味，常用于会议、事件等正式安排。而 “delayed” 可以是主动的，也可以是被动的（如因天气、故障等不可控因素），适用范围更广，语气更中性。"
    },
    {
      "word_to_compare": "slowed",
      "analysis": "“Slowed”（变慢的）强调速度降低，但不一定导致时间上的延迟，例如交通变慢但未错过时间表。而 “delayed” 明确表示时间上的滞后，已造成实际的错过或滞后结果，是“速度减慢”导致的最终状态。"
    }
  ]
}