{
  "word": "delicate",
  "pronunciation": "del·i·kut",
  "concise_definition": "adj. 精致的, 精细的, 脆弱的, 敏感的",
  "forms": {
    "comparative": "more delicate",
    "superlative": "most delicate"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Made with great care, precision, or fine detail; often implying fragility or subtle beauty.",
      "explanation_cn": "以极大的细心、精确或精细细节制作而成；常暗示着脆弱性或微妙的美感。",
      "example_en": "She wore a delicate lace dress that shimmered in the sunlight.",
      "example_cn": "她穿着一件精致的蕾丝连衣裙，在阳光下闪闪发光。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Easily damaged, broken, or disturbed; requiring careful handling or treatment.",
      "explanation_cn": "容易受损、破碎或被打扰；需要小心处理或对待。",
      "example_en": "The antique vase is very delicate and must be transported with extreme caution.",
      "example_cn": "这件古董花瓶非常脆弱，必须极其小心地运输。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Involving complex, subtle, or sensitive issues that require tact and discretion.",
      "explanation_cn": "涉及复杂、微妙或敏感的问题，需要谨慎和圆滑的处理方式。",
      "example_en": "The diplomat handled the delicate negotiations with great skill.",
      "example_cn": "这位外交官以高超的技巧处理了这场敏感的谈判。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Having a fine or subtle sense of perception, especially regarding taste, smell, or emotion.",
      "explanation_cn": "具有敏锐或细腻的感知力，尤其在味觉、嗅觉或情感方面。",
      "example_en": "He has a delicate palate and can distinguish subtle flavors in wine.",
      "example_cn": "他味觉细腻，能分辨出葡萄酒中微妙的风味。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fragile",
      "analysis": "“Fragile”（易碎的）更强调物理上的脆弱性，常用于描述物体容易破裂或损坏，如玻璃、瓷器。而 “delicate” 不仅包含物理脆弱，还涵盖情感、社会或审美层面的精细与敏感，语义范围更广。"
    },
    {
      "word_to_compare": "sensitive",
      "analysis": "“Sensitive”（敏感的）侧重于对刺激、情绪或外界变化的反应强烈，常用于人或系统（如皮肤敏感、情绪敏感）。而 “delicate” 在描述人时，更强调需要温和、谨慎对待，带有礼貌和优雅的语义色彩，不强调反应强度。"
    },
    {
      "word_to_compare": "elegant",
      "analysis": "“Elegant”（优雅的）强调美感、品位和高贵的风格，常用于服饰、举止或设计。而 “delicate” 更强调精细、纤巧和脆弱的特质，不一定具有高贵感，有时甚至带有易损的负面含义。"
    }
  ]
}