{
  "word": "demands",
  "pronunciation": "di·mændz",
  "concise_definition": "n. 要求, 需求, 需要; v. 强烈要求, 需要",
  "forms": {
    "singular": "demand",
    "third_person_singular": "demands",
    "past_tense": "demanded",
    "past_participle": "demanded",
    "present_participle": "demanding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A strong or urgent request for something, often made with authority or insistence, especially in a social, economic, or political context.",
      "explanation_cn": "指在社会、经济或政治背景下，以权威或坚持的态度提出的强烈或迫切的要求。",
      "example_en": "The workers made demands for higher wages and better working conditions.",
      "example_cn": "工人们提出了提高工资和改善工作条件的要求。"
    },
    {
      "pos": "noun",
      "explanation_en": "The need or requirement for a particular product, service, or resource, especially in economic terms.",
      "explanation_cn": "指对某种产品、服务或资源的需要或需求，尤指在经济语境中的市场需求。",
      "example_en": "There is a high demand for electric vehicles in this region.",
      "example_cn": "本地区对电动汽车的需求很高。"
    },
    {
      "pos": "verb",
      "explanation_en": "To ask for something forcefully or insistently, often expecting immediate compliance or action.",
      "explanation_cn": "指以强硬或坚持的方式要求某物，通常期望立即得到满足或采取行动。",
      "example_en": "She demanded an explanation for the delay.",
      "example_cn": "她要求对延误给出解释。"
    },
    {
      "pos": "verb",
      "explanation_en": "To require something as necessary or essential, often due to circumstances or standards.",
      "explanation_cn": "指由于环境或标准而需要某物作为必要条件。",
      "example_en": "This job demands complete dedication and long hours.",
      "example_cn": "这份工作需要全身心投入和长时间工作。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "request",
      "analysis": "“Request”（请求）语气较温和、礼貌，通常不带有强制性，强调礼貌地提出愿望；而 “demand” 则带有更强的权威性、紧迫性甚至压迫感，暗示对方必须满足。"
    },
    {
      "word_to_compare": "need",
      "analysis": "“Need”（需要）是客观存在的必要性，常用于描述基本生存或功能上的必需，语气中性；而 “demand” 更强调主观的、主动的、有时是强势的索取行为，常用于人际或制度性互动中。"
    },
    {
      "word_to_compare": "requirement",
      "analysis": "“Requirement”（要求、条件）是正式或制度化的标准，通常用于规则、合同或系统中，是客观列出的条件；而 “demand” 更具动态性和情感色彩，常用于表达人或群体的主动诉求，可能不被制度化承认。"
    }
  ]
}