{
  "word": "demand",
  "pronunciation": "dih·mænd",
  "concise_definition": "n. 需求, 要求, 紧迫; v. 要求, 需要, 强烈请求",
  "forms": {
    "third_person_singular": "demands",
    "past_tense": "demanded",
    "past_participle": "demanded",
    "present_participle": "demanding",
    "plural": "demands"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The desire or need for a product, service, or resource, especially when backed by the ability and willingness to pay for it; often used in economic contexts.",
      "explanation_cn": "指对某种产品、服务或资源的渴望或需求，尤其当这种渴望伴随着支付能力和意愿时；常用于经济语境。",
      "example_en": "There is a high demand for electric vehicles in this region.",
      "example_cn": "本地区对电动汽车的需求很高。"
    },
    {
      "pos": "noun",
      "explanation_en": "A firm or urgent request, often made with authority or insistence, sometimes implying an expectation of compliance.",
      "explanation_cn": "指一种坚定或迫切的请求，通常带有权威性或强制性，有时隐含要求对方服从的期望。",
      "example_en": "The union made a demand for higher wages and better working conditions.",
      "example_cn": "工会提出了提高工资和改善工作条件的要求。"
    },
    {
      "pos": "verb",
      "explanation_en": "To ask for something forcefully or insistently, often with an expectation that it will be granted.",
      "explanation_cn": "指强烈或坚持地要求某物，通常预期对方会满足这一要求。",
      "example_en": "She demanded an explanation for the delay.",
      "example_cn": "她要求对延误给出解释。"
    },
    {
      "pos": "verb",
      "explanation_en": "To require something as necessary or essential, often due to circumstances or inherent qualities.",
      "explanation_cn": "指因环境或内在特性而需要某物作为必要条件。",
      "example_en": "This job demands complete dedication and long hours.",
      "example_cn": "这份工作需要全身心投入和长时间工作。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "request",
      "analysis": "“Request” (请求) 是一种礼貌、温和的表达需求的方式，不带有强制性或压力，接受与否由对方决定。而 “demand” 则更加强硬，隐含不容拒绝的权威或紧迫感，常用于权力不对等的情境中。"
    },
    {
      "word_to_compare": "need",
      "analysis": "“Need” (需要) 是一个中性词，描述客观上的必要性，不带有情绪色彩或强制意味。而 “demand” 不仅表示必要性，还包含主动施加压力、要求满足的行动意图，更强调主观意志和外在表达。"
    },
    {
      "word_to_compare": "claim",
      "analysis": "“Claim” (主张/索要) 指基于权利、法律或道德立场提出的要求，通常认为自己有正当理由获得某物。而 “demand” 更侧重于语气的强硬和紧迫性，不一定基于权利，可能仅出于意志或压力。"
    }
  ]
}