{
  "word": "demo",
  "pronunciation": "dee·moh",
  "concise_definition": "n. 演示, 试用版; v. 演示, 展示",
  "forms": {
    "plural": "demos",
    "third_person_singular": "demos",
    "past_tense": "demoed",
    "past_participle": "demoed",
    "present_participle": "demoing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A short, simplified presentation or version of a product, service, or system, intended to show its key features or functionality to potential users or buyers.",
      "explanation_cn": "指产品、服务或系统的简短、简化版本或展示，旨在向潜在用户或买家展示其主要功能或特性。",
      "example_en": "The software company gave us a demo of the new app before the official launch.",
      "example_cn": "这家软件公司在正式发布前为我们演示了这款新应用。"
    },
    {
      "pos": "noun",
      "explanation_en": "A musical recording, typically by an independent artist, used to showcase their style and attract record labels or audiences.",
      "explanation_cn": "指由独立音乐人制作的音乐录音，用于展示其风格，以吸引唱片公司或听众。",
      "example_en": "She sent her demo tape to five different record labels last week.",
      "example_cn": "她上周把她的试音带寄给了五家不同的唱片公司。"
    },
    {
      "pos": "verb",
      "explanation_en": "To present or demonstrate something, especially a product or feature, in a live or interactive setting.",
      "explanation_cn": "指在实际或互动环境中展示或演示某物，尤其是产品或功能。",
      "example_en": "The sales team will demo the new device at the trade show next week.",
      "example_cn": "销售团队将在下周的展会上演示这款新设备。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "example",
      "analysis": "“Example”（例子）是用于说明一个概念、规则或理论的具体实例，侧重于解释和佐证；而 “demo”（演示）是主动展示一个产品或功能的实际运作过程，强调体验和直观呈现，通常具有互动性和目的性（如销售或推广）。"
    },
    {
      "word_to_compare": "sample",
      "analysis": "“Sample”（样本）通常是可触摸、可试用的实物小样，用于评估质量或特性（如布料样本、食品试吃），强调“可复制性”和“代表性”；而 “demo” 更侧重于功能展示，不一定是完整产品，而是为了说明其工作方式或优势，常为虚拟或动态呈现。"
    },
    {
      "word_to_compare": "presentation",
      "analysis": "“Presentation”（演示/汇报）是一个更广泛、更正式的术语，常用于商业或学术场合，包含数据、图表、演讲和结构化内容；而 “demo” 更具体、更技术导向，专注于功能的实时运行和操作，通常更简短、更注重实践效果。"
    }
  ]
}