{
  "word": "demon",
  "pronunciation": "dee·muhn",
  "concise_definition": "n. 魔鬼, 恶魔, 精灵, 瘟神",
  "forms": {
    "plural": "demons"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A supernatural evil spirit, often associated with hell, temptation, or possession, believed in many religious and mythological traditions to cause harm, corruption, or moral decay.",
      "explanation_cn": "一种超自然的邪恶灵体，常与地狱、诱惑或附身相关，在许多宗教和神话传统中被认为会带来伤害、堕落或道德败坏。",
      "example_en": "In medieval art, demons were often depicted with horns, tails, and fiery eyes.",
      "example_cn": "在中世纪艺术中，恶魔常被描绘为长着角、尾巴和燃烧的眼睛。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that causes persistent trouble, suffering, or obsession, often used metaphorically to describe an inner compulsion or destructive habit.",
      "explanation_cn": "指造成持续困扰、痛苦或执念的人或事物，常用于隐喻，形容一种内在的强迫性冲动或破坏性习惯。",
      "example_en": "Alcohol became his demon, slowly destroying his career and relationships.",
      "example_cn": "酒精成了他的瘟神，逐渐摧毁了他的事业和人际关系。"
    },
    {
      "pos": "noun",
      "explanation_en": "In ancient Greek and Roman religion, a spirit or divine power that could be either benevolent or malevolent, not necessarily evil as in later Christian interpretations.",
      "explanation_cn": "在古希腊和罗马宗教中，一种可以是仁慈或邪恶的灵体或神力，并非如后来基督教解释中那样必然是邪恶的。",
      "example_en": "Socrates believed his daimonion was a guiding inner voice, not a malevolent force.",
      "example_cn": "苏格拉底相信他的‘代蒙’是一种指引的内在声音，而非邪恶的力量。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "devil",
      "analysis": "“Devil”（魔鬼）特指基督教传统中与上帝对立的终极邪恶存在（如撒旦），具有明确的拟人化和神学地位；而 “demon” 更广泛，可指众多低阶邪恶灵体，不一定有统一的领袖，也存在于非基督教文化中。"
    },
    {
      "word_to_compare": "spirit",
      "analysis": "“Spirit”（灵体）是一个中性词，泛指任何非肉体的存在，可以是善的（如守护灵）、中性的（如自然精灵）或恶的（如恶魔）。“Demon” 则特指具有恶意或破坏性的灵体，语义范围更窄、更具负面色彩。"
    },
    {
      "word_to_compare": "monster",
      "analysis": "“Monster”（怪物）强调外形恐怖或行为残忍的生物，通常是物理存在的（如神话中的巨兽或科幻生物），而 “demon” 更侧重超自然、精神或道德层面的邪恶本质，不一定有具体形态。"
    }
  ]
}