{
  "word": "democrat",
  "pronunciation": "dee·muh·krat",
  "concise_definition": "n. 民主党人, 民主派人士; adj. 民主的, 支持民主的",
  "forms": {
    "plural": "democrats",
    "adjective_form": "democratic"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A member or supporter of the Democratic Party in the United States, which generally advocates for social equality, progressive policies, and a strong social safety net.",
      "explanation_cn": "指美国民主党的成员或支持者，该党通常倡导社会平等、进步政策和强有力的社会保障体系。",
      "example_en": "She ran for Congress as a democrat, focusing on healthcare reform and climate action.",
      "example_cn": "她以民主党人的身份竞选国会议员，重点关注医疗改革和气候行动。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who believes in or supports the principles of democracy, such as popular sovereignty, political equality, and civil liberties.",
      "explanation_cn": "指相信或支持民主原则的人，如人民主权、政治平等和公民自由。",
      "example_en": "True democrats value the voice of every citizen, regardless of background or status.",
      "example_cn": "真正的民主派人士珍视每一位公民的声音，不论其背景或地位如何。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characterized by democracy; promoting the participation of the people in government and decision-making.",
      "explanation_cn": "与民主相关或体现民主特征的；促进人民参与政府和决策。",
      "example_en": "The country is striving to build a more democrat system of governance.",
      "example_cn": "该国正努力构建一个更加民主的治理体系。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "liberal",
      "analysis": "“Liberal”（自由派）通常指在社会和经济政策上持开放、进步立场的人，常与民主党人重叠，但并非所有自由派都是民主党人，也并非所有民主党人都是自由派。自由派更侧重意识形态，而“democrat”是政党身份的明确标签。"
    },
    {
      "word_to_compare": "populist",
      "analysis": "“Populist”（民粹主义者）强调代表普通民众对抗精英阶层，其主张可能与民主党重合，但也可能出现在右翼政治中。而“democrat”是制度性政党成员，其立场受政党纲领约束，不必然以反精英为特征。"
    },
    {
      "word_to_compare": "democratic",
      "analysis": "“Democratic” 是 “democrat” 的形容词形式，用于描述制度、过程或原则（如民主选举、民主氛围），而 “democrat” 是指人或政党成员。前者是抽象概念，后者是具体主体。"
    }
  ]
}