{
  "word": "democratic",
  "pronunciation": "dih·mok·rat·ik",
  "concise_definition": "adj. 民主的, 民主制度的, 平等的",
  "forms": {
    "comparative": "more democratic",
    "superlative": "most democratic"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or supporting a system of government in which power is vested in the people, who rule either directly or through freely elected representatives.",
      "explanation_cn": "指与民主制度相关或支持人民通过直接或经自由选举的代表行使权力的政治体制。",
      "example_en": "The country held its first democratic elections after decades of authoritarian rule.",
      "example_cn": "该国在数十年的专制统治后举行了首次民主选举。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by equal participation, fairness, and openness in decision-making, especially in organizations or groups where all members have a voice.",
      "explanation_cn": "指在决策过程中体现平等参与、公平与开放，尤其在组织或团体中所有成员都能发声的特征。",
      "example_en": "The team adopted a democratic approach to choosing the project leader.",
      "example_cn": "团队采用民主方式选举项目负责人。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Belonging to or characteristic of the Democratic Party, especially in the United States.",
      "explanation_cn": "属于或体现美国民主党特征的，尤指与该政党相关的政治立场或政策。",
      "example_en": "She ran for office as a democratic candidate advocating healthcare reform.",
      "example_cn": "她以民主党候选人的身份参选，主张医疗改革。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "republican",
      "analysis": "“Republican”（共和党的/共和制的）在政治语境中常指美国共和党的立场，与“democratic”形成对立；在政体意义上，“republic”指代没有君主的国家体制，而“democratic”强调人民参与决策的方式。两者可重叠，但不等同：一个国家可以是共和制但非民主（如某些威权共和国），也可以是民主但非共和制（如君主立宪制下的民主国家）。"
    },
    {
      "word_to_compare": "egalitarian",
      "analysis": "“Egalitarian”（平等主义的）强调社会成员在权利、地位和机会上的绝对平等，常用于社会或经济层面；而“democratic”更侧重于政治决策过程中的参与权和代表性。一个社会可以是民主的但不完全平等（如存在经济不平等），也可以是平等主义的但缺乏民主机制（如某些集体主义社区）。"
    },
    {
      "word_to_compare": "populist",
      "analysis": "“Populist”（民粹主义的）指迎合大众情绪、强调普通民众对抗精英的政治策略，常带有情感动员色彩；而“democratic”是制度性概念，强调程序、法治与权利保障。民粹主义可能利用民主形式，但常破坏民主的制度基础，如削弱少数群体权利或独立司法。"
    }
  ]
}