{
  "word": "demonstrations",
  "pronunciation": "dem·uhn·stray·shuhnz",
  "concise_definition": "n. 示威, 演示, 证明",
  "forms": {
    "singular": "demonstration"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A public display of group opinion, typically organized to express protest, support, or demand for change, often involving marches, rallies, or picketing.",
      "explanation_cn": "指一群人有组织地公开表达意见，通常用于抗议、支持或要求变革，常以游行、集会或静坐等形式进行。",
      "example_en": "Thousands took to the streets in peaceful demonstrations against the new law.",
      "example_cn": "成千上万的人走上街头，和平示威反对这项新法律。"
    },
    {
      "pos": "noun",
      "explanation_en": "A practical exhibition or explanation of how something works, often used in education, sales, or technical contexts to clarify a process or product.",
      "explanation_cn": "指对某事物如何运作进行的实际展示或说明，常用于教育、销售或技术场景，以澄清某个过程或产品。",
      "example_en": "The teacher gave a demonstration of the chemical reaction using safe materials.",
      "example_cn": "老师用安全的材料演示了这个化学反应。"
    },
    {
      "pos": "noun",
      "explanation_en": "A clear and convincing proof or evidence of something, often used to show the validity or effectiveness of a claim or theory.",
      "explanation_cn": "指对某事物清晰而有说服力的证明或证据，常用于表明某个主张或理论的有效性或真实性。",
      "example_en": "The data provides strong demonstrations of the algorithm's efficiency.",
      "example_cn": "这些数据有力地证明了该算法的效率。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "protest",
      "analysis": "“Protest” (抗议) 是一个更广泛的术语，泛指任何形式的反对行为，可以是口头、书面或行动上的，不一定公开或有组织。而 “demonstration” 特指公开、有组织的集体行动，强调可见性和群体性。"
    },
    {
      "word_to_compare": "exhibition",
      "analysis": "“Exhibition” (展览) 通常指在博物馆、画廊或展会中对物品、艺术或技术成果的展示，目的是观赏或教育，不带有政治或社会诉求。而 “demonstration” 在作为‘演示’时更强调功能性和操作性，有时还包含说服或教学目的。"
    },
    {
      "word_to_compare": "proof",
      "analysis": "“Proof” (证明) 是一个逻辑或数学意义上的确证，强调客观性和不可辩驳性，常用于学术或科学语境。而 “demonstration” 作为‘证明’时，更偏向于通过实际展示或例证来使人信服，不一定达到严格的逻辑证明标准。"
    }
  ]
}