{
  "word": "denominations",
  "pronunciation": "dih·nom·uh·ney·shuhnz",
  "concise_definition": "n. 宗派, 货币单位, 名称",
  "forms": {
    "singular": "denomination"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A distinct subgroup within a religion, characterized by its own beliefs, practices, and organizational structure, often differing from other groups within the same broader faith.",
      "explanation_cn": "指在同一种宗教信仰内，具有自身独特教义、实践和组织结构的特定派别，通常与其他派别存在差异。",
      "example_en": "Christianity includes many denominations, such as Catholicism, Protestantism, and Eastern Orthodoxy.",
      "example_cn": "基督教包含许多宗派，如天主教、新教和东正教。"
    },
    {
      "pos": "noun",
      "explanation_en": "The face value of a unit of currency, such as a coin or banknote, used to classify different monetary amounts in circulation.",
      "explanation_cn": "指货币单位的面值，用于区分流通中的不同金额，如硬币或纸币的面额。",
      "example_en": "The ATM dispensed bills in denominations of $20, $50, and $100.",
      "example_cn": "自动取款机吐出面额为20美元、50美元和100美元的钞票。"
    },
    {
      "pos": "noun",
      "explanation_en": "A name or term used to classify or identify something according to its type, category, or class, especially in formal or technical contexts.",
      "explanation_cn": "指用于根据类型、类别或等级对某事物进行分类或识别的名称或术语，尤其用于正式或技术性语境中。",
      "example_en": "The wine was labeled with its denomination of origin, indicating its regional authenticity.",
      "example_cn": "这款葡萄酒上标注了原产地名称，以表明其地域真实性。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sect",
      "analysis": "“Sect”（教派）通常带有轻微贬义，指从主流宗教中分裂出来的小规模、激进或边缘化的团体，强调其异端性或排他性。而 “denomination” 更中性，用于正式描述宗教内部合法且被广泛承认的分支。"
    },
    {
      "word_to_compare": "currency",
      "analysis": "“Currency”（货币）指一种国家或地区通用的交换媒介整体，如美元、欧元。而 “denomination” 是货币的组成部分，即具体的面值单位（如1元、10元）。前者是系统，后者是单位。"
    },
    {
      "word_to_compare": "classification",
      "analysis": "“Classification”（分类）是一个通用术语，指根据共同特征将事物分组的过程或结果，适用于任何领域。而 “denomination” 是一种特定类型的分类名称，常用于宗教、货币或地理标识等特定语境，具有更强的规范性和制度性。"
    }
  ]
}