{
  "word": "dent",
  "pronunciation": "dent",
  "concise_definition": "n. 凹痕, 凹陷; v. 使凹陷, 损伤",
  "forms": {
    "plural": "dents",
    "third_person_singular": "dents",
    "past_tense": "dented",
    "past_participle": "dented",
    "present_participle": "denting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small hollow or depression in a surface, typically caused by impact or pressure, often damaging the shape or appearance of a hard object like metal or plastic.",
      "explanation_cn": "指物体表面因撞击或压力而形成的微小凹陷，通常会损害金属、塑料等硬物的形状或外观。",
      "example_en": "The car door had a noticeable dent after the minor collision.",
      "example_cn": "汽车车门在轻微碰撞后出现了一个明显的凹痕。"
    },
    {
      "pos": "noun",
      "explanation_en": "A reduction or setback in something abstract, such as reputation, confidence, or financial resources, often implying a noticeable but not total decline.",
      "explanation_cn": "指抽象事物（如声誉、信心或财务资源）的减少或挫折，通常暗示显著但非彻底的衰退。",
      "example_en": "The scandal dealt a serious dent to the politician's public image.",
      "example_cn": "这起丑闻严重损害了这位政治家的公众形象。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a dent in something by applying force, resulting in a depression or indentation on a surface.",
      "explanation_cn": "通过施加外力使某物表面产生凹陷或压痕。",
      "example_en": "The hockey puck dented the metal goalpost.",
      "example_cn": "冰球击中了金属门柱，留下了一个凹痕。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reduce or impair something significantly, especially in a way that is noticeable but not catastrophic.",
      "explanation_cn": "显著减少或削弱某事物，尤其是造成明显但非毁灭性的影响。",
      "example_en": "The new tax policy dented the company's profits for the quarter.",
      "example_cn": "新的税收政策使该公司本季度的利润受到了明显影响。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "scratch",
      "analysis": "“Scratch”（刮痕）指物体表面因摩擦而产生的细小划痕，通常较浅且不改变整体结构，主要影响外观；而 “dent” 是物理凹陷，涉及材料的形变，通常更深、更结构性，可能影响功能。"
    },
    {
      "word_to_compare": "crack",
      "analysis": "“Crack”（裂纹）指材料因应力而出现的断裂或缝隙，通常意味着结构完整性受损，可能进一步扩大；而 “dent” 是表面凹陷，材料未断裂，修复可能性更高，破坏程度较轻。"
    },
    {
      "word_to_compare": "impair",
      "analysis": "“Impair”（损害）是更抽象、广泛的动词，泛指削弱功能、能力或质量，可用于健康、智力、性能等；而 “dent” 作为动词时，特指造成一种可察觉但非彻底的削弱，常用于声誉、利润等抽象概念，语气更形象、口语化。"
    }
  ]
}