{
  "word": "deposition",
  "pronunciation": "dep·uh·zish·uhn",
  "concise_definition": "n. 证词, 降职, 沉积, 沉积物",
  "forms": {
    "plural": "depositions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A formal written or recorded statement of testimony given under oath, typically outside of court, often used in legal proceedings to gather evidence.",
      "explanation_cn": "指在法庭外、在宣誓下作出的正式书面或录音证词，常用于法律程序中收集证据。",
      "example_en": "The lawyer reviewed the witness's deposition before the trial.",
      "example_cn": "律师在庭审前审阅了证人的证词笔录。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of removing someone from a position of power or office, especially by force or official action.",
      "explanation_cn": "指通过武力或官方行动将某人从权力或职位上罢免的行为。",
      "example_en": "The king's deposition marked the end of the monarchy in that country.",
      "example_cn": "国王的被废黜标志着该国君主制的终结。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process by which sediment, minerals, or other materials are laid down or settled, especially by water, wind, or ice.",
      "explanation_cn": "指沉积物、矿物或其他物质通过水、风或冰的作用而沉积或沉降的过程。",
      "example_en": "The deposition of silt over thousands of years formed the fertile plains of the Nile River.",
      "example_cn": "数千年来泥沙的沉积形成了尼罗河沿岸肥沃的平原。"
    },
    {
      "pos": "noun",
      "explanation_en": "The material that has been deposited, especially in geology or environmental science.",
      "explanation_cn": "指已经沉积下来的物质，尤其在地质学或环境科学中。",
      "example_en": "Geologists studied the deposition layers to determine the region's ancient climate.",
      "example_cn": "地质学家研究了沉积层以确定该地区的古代气候。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "testimony",
      "analysis": "“Testimony”（证词）泛指在法庭上或正式场合下口头或书面提供的证言，强调内容的真实性与法律效力；而 “deposition” 特指在庭审前、在律师在场情况下所作的宣誓证词，属于取证程序的一部分，具有更强的程序性和预备性。"
    },
    {
      "word_to_compare": "removal",
      "analysis": "“Removal”（移除）是一个通用词，指任何从某处移走的行为，可以是物理的、职位的或抽象的；而 “deposition” 在政治语境中专指对统治者或官员的正式罢免，带有强烈的历史和法律色彩，语义更具体、更正式。"
    },
    {
      "word_to_compare": "sediment",
      "analysis": "“Sediment”（沉积物）是名词，指实际沉积下来的物质本身，如沙、泥、碎石；而 “deposition” 是指沉积这一过程或行为，是动态的地质作用，强调机制而非结果。两者是过程与产物的关系。"
    }
  ]
}