{
  "word": "deposit",
  "pronunciation": "dih·pos·it",
  "concise_definition": "n. 存款, 押金, 沉积物; v. 存放, 存款, 沉积",
  "forms": {
    "third_person_singular": "deposits",
    "past_tense": "deposited",
    "past_participle": "deposited",
    "present_participle": "depositing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Money placed into a bank account for safekeeping and potential future use, often earning interest over time.",
      "explanation_cn": "存入银行账户以供安全保管和未来使用的资金，通常会随时间产生利息。",
      "example_en": "She made a deposit of $5,000 into her savings account last week.",
      "example_cn": "她上周向她的储蓄账户存入了5000美元。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sum of money paid upfront as security or guarantee for the return of an item or fulfillment of an obligation, often refundable.",
      "explanation_cn": "为确保物品归还或义务履行而预先支付的一笔款项，通常可退还。",
      "example_en": "The apartment requires a $1,000 deposit before you can move in.",
      "example_cn": "入住公寓前需支付1000美元的押金。"
    },
    {
      "pos": "noun",
      "explanation_en": "A natural accumulation of material, such as sand, silt, or minerals, laid down by water, wind, or ice over time.",
      "explanation_cn": "由水、风或冰长期作用而自然沉积下来的物质，如沙子、淤泥或矿物质。",
      "example_en": "The river left a rich deposit of silt on the floodplain after the storm.",
      "example_cn": "风暴过后，河流在洪泛平原上留下了一层肥沃的淤泥沉积物。"
    },
    {
      "pos": "verb",
      "explanation_en": "To place money into a bank or financial account for storage or investment purposes.",
      "explanation_cn": "将资金存入银行或金融机构账户以供存储或投资。",
      "example_en": "He deposits his paycheck directly into his checking account every Friday.",
      "example_cn": "他每周五都把工资直接存入支票账户。"
    },
    {
      "pos": "verb",
      "explanation_en": "To place something temporarily in a specific location, often as security or for safekeeping.",
      "explanation_cn": "将某物暂时放置在特定地点，通常作为担保或保管之用。",
      "example_en": "Please deposit your coats in the cloakroom before entering the theater.",
      "example_cn": "进入剧院前，请将外套存放在衣帽间。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause material to settle or accumulate in a particular place, especially through natural processes.",
      "explanation_cn": "使物质在特定地点沉积或积聚，通常通过自然过程实现。",
      "example_en": "The ocean currents deposit nutrients along the continental shelf.",
      "example_cn": "洋流将营养物质沉积在大陆架沿线。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "storage",
      "analysis": "“Storage”（储存）泛指将物品或信息保存起来以备后用，不涉及金钱或担保性质，也不强调物理沉积。而 “deposit” 在作为名词时，特指为担保或金融目的而存放的资金或物质，具有明确的法律或经济含义。"
    },
    {
      "word_to_compare": "save",
      "analysis": "“Save”（储蓄）强调长期积累资金以备未来使用，通常不涉及第三方机构或担保机制，语义更宽泛。而 “deposit” 更具体，常指将钱正式存入银行账户，或作为押金交付，具有明确的交易或契约属性。"
    },
    {
      "word_to_compare": "precipitate",
      "analysis": "“Precipitate”（沉淀）是化学术语，指溶液中物质因化学反应而迅速析出，强调快速、由化学驱动的过程。而 “deposit” 的沉积过程更广泛，包括物理性、缓慢的自然堆积，如泥沙沉积，不涉及化学反应。"
    }
  ]
}