{
  "word": "deprivation",
  "pronunciation": "dee·pruh·vay·shuhn",
  "concise_definition": "n. 剥夺, 缺乏, 丧失",
  "forms": {
    "plural": "deprivations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The state of being denied something essential or desirable, such as food, sleep, freedom, or affection, often leading to physical, emotional, or psychological harm.",
      "explanation_cn": "指被剥夺了某种基本或理想的事物（如食物、睡眠、自由或情感）的状态，通常会导致身体、情感或心理上的伤害。",
      "example_en": "Children raised in conditions of severe deprivation often struggle with emotional development.",
      "example_cn": "在严重匮乏环境中长大的儿童往往在情感发展上遇到困难。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of taking away or withholding something that is normally available or deserved, especially by authority or circumstance.",
      "explanation_cn": "指通过权威或环境因素主动剥夺或拒绝提供通常应得或可获得的事物的行为。",
      "example_en": "The prison system has been criticized for the deprivation of basic human rights.",
      "example_cn": "该监狱系统因剥夺基本人权而受到批评。"
    },
    {
      "pos": "noun",
      "explanation_en": "A condition of extreme lack or scarcity, particularly in socioeconomic contexts, such as poverty or lack of access to education or healthcare.",
      "explanation_cn": "指在社会经济背景下极度匮乏或稀缺的状态，例如贫困或缺乏教育、医疗资源。",
      "example_en": "Deprivation in rural areas has led to widespread migration to urban centers.",
      "example_cn": "农村地区的匮乏导致了大规模向城市中心的迁移。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "lack",
      "analysis": "“Lack”（缺乏）是一个更通用、中性的词，仅表示某物不存在或不足，不必然带有强制或系统性剥夺的含义。而 “deprivation” 暗示了外部力量的干预或制度性拒绝，情感色彩更强烈，常带有不公或伤害的意味。"
    },
    {
      "word_to_compare": "denial",
      "analysis": "“Denial”（否认/拒绝）侧重于拒绝承认某事的真实性，或拒绝给予某人某物，常用于心理或沟通语境（如否认事实、拒绝请求）。而 “deprivation” 更强调实际状态的缺失，尤其是长期、系统性的剥夺，常用于社会、医疗或人权语境。"
    },
    {
      "word_to_compare": "shortage",
      "analysis": "“Shortage”（短缺）通常指资源或物品的供应不足，是客观的、暂时的、可量化的，如食物短缺、水资源短缺。而 “deprivation” 更强调对个体或群体造成的负面影响，是主观体验的后果，常涉及权利、尊严和基本需求的丧失。"
    }
  ]
}