{
  "word": "deputies",
  "pronunciation": "dep·yoo·teez",
  "concise_definition": "n. 副手, 代理人, 议员",
  "forms": {
    "singular": "deputy"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person authorized to act on behalf of another, especially someone who holds a position of authority and assumes responsibility in the absence of the primary officeholder.",
      "explanation_cn": "指被授权代表他人行事的人，尤其是当主要官员缺席时，承担其职责和权力的副职人员。",
      "example_en": "The mayor appointed a deputy to manage city affairs during her vacation.",
      "example_cn": "市长任命了一名副手在她休假期间管理市政事务。"
    },
    {
      "pos": "noun",
      "explanation_en": "An elected official who serves as a representative in a legislative body, especially in countries like France or Italy where the term refers to members of the lower house of parliament.",
      "explanation_cn": "指在立法机构中担任代表的民选官员，尤其在法国、意大利等国，用于指代议会下议院的议员。",
      "example_en": "The deputies voted overwhelmingly in favor of the new environmental bill.",
      "example_cn": "议员们以压倒性多数投票支持这项新的环保法案。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person appointed or elected to assist a higher-ranking official in law enforcement or public service, such as a sheriff’s deputy.",
      "explanation_cn": "指被任命或选举出来协助高级官员执行公务的人，例如县治安官的副手。",
      "example_en": "The sheriff’s deputies responded quickly to the emergency call.",
      "example_cn": "县治安官的副手迅速响应了紧急呼叫。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "assistant",
      "analysis": "“Assistant” (助手) 是一个通用词，泛指任何提供支持或协助的人，职位层级和权力通常较低，不一定有正式授权。而 “deputy” 通常具有法定或正式的代理权力，可在主要官员缺席时行使职权，地位更接近于副职。"
    },
    {
      "word_to_compare": "representative",
      "analysis": "“Representative” (代表) 强调代表某个群体、选区或利益发声，尤其在政治语境中，多用于民主选举产生的议员。而 “deputy” 可以是代表，但更强调代理或辅助角色，不一定由选举产生，有时是任命的。在某些国家（如法国），“député” 等同于 representative，但在英语中两者语义重心不同。"
    },
    {
      "word_to_compare": "lieutenant",
      "analysis": "“Lieutenant” (中尉/副官) 多用于军事或警察系统，是明确的军衔或职务等级，通常有严格的上下级结构。而 “deputy” 更广泛用于行政、司法或政治领域，语义更灵活，不一定涉及军衔体系。两者在功能上相似，但 “lieutenant” 更具体制化和等级色彩。"
    }
  ]
}