{
  "word": "derelict",
  "pronunciation": "deh·relik",
  "concise_definition": "adj. 被遗弃的, 疏于管理的; n. 被遗弃者, 疏忽职守者",
  "forms": {
    "comparative": "derelict",
    "superlative": "derelict"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "In a state of neglect or abandonment; no longer maintained or used, often due to decay or disuse.",
      "explanation_cn": "处于被忽视或被遗弃的状态；因年久失修或长期不用而无人维护。",
      "example_en": "The derelict factory on the edge of town had been abandoned for over twenty years.",
      "example_cn": "镇边缘那座被遗弃的工厂已经荒废了二十多年。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Neglecting one's duties or responsibilities; failing to fulfill obligations through carelessness or indifference.",
      "explanation_cn": "疏忽职责或义务；因粗心或冷漠而未能履行应尽的责任。",
      "example_en": "He was accused of being derelict in his duties as a security guard.",
      "example_cn": "他被指控在担任保安时玩忽职守。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is homeless or destitute, often due to personal failure or societal neglect.",
      "explanation_cn": "指因个人失败或社会忽视而无家可归、生活困苦的人。",
      "example_en": "The city shelter provides food and medical care for the derelict and other vulnerable populations.",
      "example_cn": "这座城市收容所为无家可归者和其他弱势群体提供食物和医疗救助。"
    },
    {
      "pos": "noun",
      "explanation_en": "Something that has been abandoned or left behind, especially a vessel or property.",
      "explanation_cn": "指被遗弃或丢弃之物，尤指船只或财产。",
      "example_en": "Rescuers spotted a derelict fishing boat drifting off the coast.",
      "example_cn": "救援人员发现一艘废弃的渔船在海岸外漂浮。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "abandoned",
      "analysis": "“Abandoned” (被遗弃的) 强调被主动抛弃或离开，通常指人或物被遗弃，但不一定包含“破败”或“疏于管理”的含义。而 “derelict” 不仅表示被遗弃，更强调因长期忽视而导致的衰败状态，语义更重、更具画面感。"
    },
    {
      "word_to_compare": "neglected",
      "analysis": "“Neglected” (被忽视的) 指未被适当照顾或关注，但不一定达到“完全废弃”的程度。它更侧重于“未尽责任”的过程，而 “derelict” 可以是结果状态，且常带有道德谴责意味，尤其在指人时。"
    },
    {
      "word_to_compare": "vagrant",
      "analysis": "“Vagrant” (流浪者) 侧重于无固定住所、四处漂泊的人，通常不包含“被遗弃的建筑”或“疏忽职责”的含义。而 “derelict” 作为名词时，更强调因个人失败或社会抛弃而陷入贫困的流浪者，语义更复杂，常含贬义。"
    }
  ]
}