{
  "word": "derivative",
  "pronunciation": "dih·riv·uh·tiv",
  "concise_definition": "n. 衍生物, 派生词, 依赖性的事物; adj. 无原创性的, 派生的",
  "forms": {
    "plural": "derivatives",
    "comparative": "more derivative",
    "superlative": "most derivative"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A word or form that is derived from another word or root, often through the addition of prefixes or suffixes.",
      "explanation_cn": "指通过添加前缀或后缀从另一个词或词根派生出来的词或形式。",
      "example_en": "\"Happiness\" is a derivative of the word \"happy\".",
      "example_cn": "\"幸福\" 是由 \"快乐\" 派生而来的词。"
    },
    {
      "pos": "noun",
      "explanation_en": "A financial instrument whose value is based on the performance of an underlying asset, such as stocks, bonds, or commodities.",
      "explanation_cn": "指一种金融工具，其价值取决于基础资产（如股票、债券或商品）的表现。",
      "example_en": "Options and futures are common types of financial derivatives.",
      "example_cn": "期权和期货是常见的金融衍生品。"
    },
    {
      "pos": "noun",
      "explanation_en": "Something that is derived from or based on another source, often lacking originality.",
      "explanation_cn": "指源于或基于其他来源的事物，通常缺乏原创性。",
      "example_en": "The film is a derivative work, heavily inspired by classic horror movies.",
      "example_cn": "这部电影是一部缺乏新意的作品，深受经典恐怖片的影响。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Lacking originality; derived from or imitative of something else.",
      "explanation_cn": "缺乏原创性；源于或模仿其他事物的。",
      "example_en": "The artist's latest exhibition was criticized for being too derivative.",
      "example_cn": "这位艺术家最新的展览因过于模仿他人而受到批评。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "derived",
      "analysis": "“Derived” 是 “derivative” 的动词过去分词形式，强调来源或产生过程，常作形容词使用，但更侧重于客观的派生关系，如 “a derived formula”。而 “derivative” 作为形容词时，带有更强的贬义色彩，暗示缺乏原创性或创新性，如 “a derivative novel”。"
    },
    {
      "word_to_compare": "original",
      "analysis": "“Original” (原创的) 与 “derivative” 意义相反，强调新颖性、独创性和独立性。一个作品如果是 “original”，意味着它不是模仿或依赖已有形式；而 “derivative” 则暗示其核心内容或结构直接取自其他作品，缺乏独立创造。"
    },
    {
      "word_to_compare": "offshoot",
      "analysis": "“Offshoot” (分支/衍生品) 指从主体发展出来的分支，常用于生物、组织或思想体系，强调物理或逻辑上的延续性，如 “a political offshoot of the main party”。而 “derivative” 更广泛，可用于语言、金融或艺术领域，且更常带有负面评价，暗示复制而非自然演化。"
    }
  ]
}