{
  "word": "descriptions",
  "pronunciation": "dih·skrip·shuhnz",
  "concise_definition": "n. 描述, 说明, 介绍",
  "forms": {
    "singular": "description"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A detailed account or representation of the characteristics, appearance, or nature of someone or something, often used to convey understanding or enable identification.",
      "explanation_cn": "对某人或某物的特征、外观或本质所作的详细说明或描述，常用于传达理解或帮助识别。",
      "example_en": "The detective relied on the witness's description of the suspect to create a sketch.",
      "example_cn": "侦探依靠目击者对嫌疑人的描述绘制了肖像。"
    },
    {
      "pos": "noun",
      "explanation_en": "A written or spoken explanation that clarifies the function, use, or features of an object, system, or concept, often found in manuals, catalogs, or instructions.",
      "explanation_cn": "对某物体、系统或概念的功能、用途或特点所作的书面或口头解释，常见于手册、目录或说明中。",
      "example_en": "The product descriptions on the website helped me choose the right model.",
      "example_cn": "网站上的产品说明帮助我选到了合适的型号。"
    },
    {
      "pos": "noun",
      "explanation_en": "A literary or artistic portrayal that evokes sensory impressions or emotional responses through vivid language.",
      "explanation_cn": "通过生动的语言唤起感官印象或情感反应的文学或艺术性描绘。",
      "example_en": "The poet's descriptions of the sunset painted a hauntingly beautiful image in the reader's mind.",
      "example_cn": "诗人对日落的描写在读者心中勾勒出一幅令人难忘的美丽画面。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "definition",
      "analysis": "“Definition” (定义) 是对一个词、概念或术语的精确、简洁的解释，通常用于确定其本质或边界，强调准确性与规范性。而 “description” 更注重细节和感官信息，用于呈现整体面貌，不一定追求严格界定。"
    },
    {
      "word_to_compare": "account",
      "analysis": "“Account” (叙述/报告) 通常指对事件、经历或过程的陈述，带有时间顺序和主观视角，常用于记录事实或个人经历。而 “description” 更侧重于静态特征的呈现，不强调过程或因果关系。"
    },
    {
      "word_to_compare": "specification",
      "analysis": "“Specification” (规格/技术参数) 是一种精确、量化、结构化的说明，常用于工程、制造或技术领域，强调可测量的标准。而 “description” 更偏向于语言性、非量化的表达，用于传达印象而非执行标准。"
    }
  ]
}