{
  "word": "designed",
  "pronunciation": "dih·zynd",
  "concise_definition": "adj. 有目的地设计的, 故意的; v. 设计 (design 的过去式和过去分词)",
  "forms": {
    "base_form": "design",
    "third_person_singular": "designs",
    "past_tense": "designed",
    "past_participle": "designed",
    "present_participle": "designing"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Intentionally created or arranged with a specific purpose or function in mind, often implying careful planning and thoughtfulness.",
      "explanation_cn": "有意识地创造或安排，具有特定目的或功能，通常暗示经过周密的规划与深思熟虑。",
      "example_en": "The app has a designed user interface that makes navigation intuitive.",
      "example_cn": "这款应用程序具有经过精心设计的用户界面，使操作直观易懂。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Deliberately caused or arranged, often to achieve a particular outcome, sometimes with a connotation of manipulation or strategy.",
      "explanation_cn": "故意造成或安排，通常是为了实现某种特定结果，有时带有操纵或策略的意味。",
      "example_en": "It was a designed distraction to divert attention from the real issue.",
      "example_cn": "这是一次故意制造的干扰，以转移人们对真正问题的注意力。"
    },
    {
      "pos": "verb",
      "explanation_en": "To plan and create the structure, appearance, or function of something, especially through technical or artistic skill.",
      "explanation_cn": "通过技术或艺术技能规划并创造出某物的结构、外观或功能。",
      "example_en": "She designed the building to maximize natural light and energy efficiency.",
      "example_cn": "她设计了这座建筑，以最大限度地利用自然光并提高能源效率。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "planned",
      "analysis": "“Planned” (计划的) 强调对行动或事件的预先安排，侧重于时间、步骤和目标的设定，适用于广泛的情境（如旅行、项目）。而 “designed” 更强调为实现特定功能或美学效果而进行的结构化构思，常用于产品、系统或环境的创造。"
    },
    {
      "word_to_compare": "intentional",
      "analysis": "“Intentional” (有意的) 是一个更宽泛的形容词，泛指任何有意识的行为或决定，不涉及具体的设计过程。而 “designed” 暗示了通过创造性或工程性手段实现目的，具有更强的物质性或结构性内涵。例如：‘It was intentional’ 可指说谎，而 ‘It was designed’ 则暗示这个谎言是精心编排的。"
    },
    {
      "word_to_compare": "engineered",
      "analysis": "“Engineered” (工程设计的) 通常用于技术或科学语境，强调基于科学原理和精确计算的系统性构建，常用于机械、软件或基础设施。而 “designed” 更通用，可涵盖艺术、用户体验、服装等非技术领域，范围更广，但精确性略低。"
    }
  ]
}