{
  "word": "desire",
  "pronunciation": "dih·zahyhr",
  "concise_definition": "n. 欲望, 愿望, 渴望; v. 渴望, 想要",
  "forms": {
    "third_person_singular": "desires",
    "past_tense": "desired",
    "past_participle": "desired",
    "present_participle": "desiring",
    "plural": "desires"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A strong feeling of wanting something, often something that is emotionally or physically compelling, whether it is material, romantic, or abstract.",
      "explanation_cn": "一种强烈的想要某物的感觉，通常涉及情感或生理上的驱动力，可以是物质的、浪漫的或抽象的。",
      "example_en": "Her desire for knowledge led her to pursue a PhD.",
      "example_cn": "她对知识的渴望促使她攻读博士学位。"
    },
    {
      "pos": "noun",
      "explanation_en": "Something that is longed for or wished for, often representing a goal or aspiration.",
      "explanation_cn": "指被渴望或向往的事物，常代表一种目标或理想。",
      "example_en": "The desire for freedom is universal among oppressed peoples.",
      "example_cn": "对自由的渴望在受压迫的人民中是普遍的。"
    },
    {
      "pos": "verb",
      "explanation_en": "To feel a strong wish or longing for something, often implying emotional or passionate motivation.",
      "explanation_cn": "感到对某物有强烈的愿望或渴望，通常带有情感或激情的驱动力。",
      "example_en": "He desired nothing more than to see his family again.",
      "example_cn": "他再无他求，只希望能再次见到家人。"
    },
    {
      "pos": "verb",
      "explanation_en": "To ask for or request something formally or politely, especially in older or literary usage.",
      "explanation_cn": "（尤用于较旧或文学语境中）正式或礼貌地提出请求。",
      "example_en": "She desired his presence at the ceremony.",
      "example_cn": "她恳请他出席仪式。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "want",
      "analysis": "“Want” (想要) 是最通用的词，语气较弱，常用于日常口语，可指轻微的偏好或需求。而 “desire” 更强烈、更深刻，常带有情感色彩或精神层面的追求，语气更正式或文学化。"
    },
    {
      "word_to_compare": "crave",
      "analysis": "“Crave” (渴求) 强调一种生理或心理上的强烈冲动，常与成瘾、饥饿或情感依赖相关，比 “desire” 更具紧迫性和本能性。而 “desire” 可以是理性驱动的长期愿望，不一定伴随焦虑或迫切感。"
    },
    {
      "word_to_compare": "aspiration",
      "analysis": "“Aspiration” (抱负) 指长期、崇高的目标或理想，通常与职业、道德或人生价值相关，具有正面和规划性。而 “desire” 更广泛，可以是短暂的、具体的、甚至非理性的愿望，不一定有长远意义。"
    }
  ]
}