{
  "word": "design",
  "pronunciation": "dih·zīn",
  "concise_definition": "n. 设计, 图案, 意图; v. 设计, 计划, 构思",
  "forms": {
    "third_person_singular": "designs",
    "past_tense": "designed",
    "past_participle": "designed",
    "present_participle": "designing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A plan or drawing produced to show the look and function or workings of a building, garment, or other object before it is made.",
      "explanation_cn": "指在制作之前为建筑、服装或其他物品绘制的计划或图样，用以展示其外观、功能或运作方式。",
      "example_en": "The architect presented the final design for the new museum.",
      "example_cn": "建筑师展示了新博物馆的最终设计方案。"
    },
    {
      "pos": "noun",
      "explanation_en": "A pattern or decorative motif, especially one that is repeated, such as on fabric, wallpaper, or pottery.",
      "explanation_cn": "指一种图案或装饰性纹样，尤其指在布料、墙纸或陶器上重复出现的样式。",
      "example_en": "The dress featured a floral design in soft pastel colors.",
      "example_cn": "这件连衣裙上印有柔和的粉彩色调的花卉图案。"
    },
    {
      "pos": "noun",
      "explanation_en": "A purposeful or intentional arrangement, often implying forethought or strategy, especially in human behavior or events.",
      "explanation_cn": "指有目的或有意为之的安排，常暗示深思熟虑或策略性，尤其用于描述人类行为或事件。",
      "example_en": "Some believe the accident was no coincidence—it was by design.",
      "example_cn": "有些人认为这场事故并非偶然，而是蓄意为之。"
    },
    {
      "pos": "verb",
      "explanation_en": "To plan and create something with a specific purpose, function, or aesthetic in mind, often involving creativity and technical skill.",
      "explanation_cn": "指有特定目的、功能或审美考量地规划并创造某物，通常涉及创造力与技术能力。",
      "example_en": "She designed a user-friendly app for elderly people to track their medication.",
      "example_cn": "她为老年人设计了一款易于使用的应用程序，用于追踪服药情况。"
    },
    {
      "pos": "verb",
      "explanation_en": "To intend or plan something deliberately, especially an outcome or consequence.",
      "explanation_cn": "指有意识地计划或意图达成某种结果或后果。",
      "example_en": "The policy was designed to reduce traffic congestion in the city center.",
      "example_cn": "这项政策旨在减少市中心的交通拥堵。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "plan",
      "analysis": "“Plan”（计划）更侧重于步骤、时间表或策略的安排，强调逻辑性和可执行性，不一定包含视觉或美学成分。而 “design” 不仅包含计划，还强调形式、结构和功能的综合构思，尤其在视觉或实体创造中更为突出。"
    },
    {
      "word_to_compare": "pattern",
      "analysis": "“Pattern”（模式/图案）通常指重复出现的结构或样式，是 “design” 的一个组成部分。例如，一个服装设计可能包含多个图案，但 “design” 是整体的构思，而 “pattern” 是其中的元素。"
    },
    {
      "word_to_compare": "concept",
      "analysis": "“Concept”（概念）是抽象的初步想法或核心理念，是设计的起点。而 “design” 是将概念具体化、可视化并转化为可实施方案的过程。概念是‘为什么’，设计是‘怎么做’。"
    }
  ]
}