{
  "word": "detailing",
  "pronunciation": "dih·tay·ling",
  "concise_definition": "n. 细节描述, 细节处理, 装饰性细节",
  "forms": {
    "base_form": "detail",
    "present_participle": "detailing",
    "past_tense": "detailed",
    "past_participle": "detailed"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process or act of providing or examining detailed information about something, especially to clarify or enhance understanding.",
      "explanation_cn": "指提供或审查某事物的详细信息的过程或行为，尤其用于澄清或增强理解。",
      "example_en": "The detailing of the contract took several weeks, as every clause had to be precisely worded.",
      "example_cn": "合同的细节描述花了数周时间，因为每一条款都必须精确措辞。"
    },
    {
      "pos": "noun",
      "explanation_en": "The decorative or functional elements added to an object, especially in design, architecture, or automotive contexts, to enhance its appearance or craftsmanship.",
      "explanation_cn": "指在设计、建筑或汽车等领域中，为增强外观或工艺感而添加的装饰性或功能性细节部分。",
      "example_en": "The car's detailing included chrome trim, hand-stitched leather seats, and custom wheel caps.",
      "example_cn": "这辆车的细节处理包括镀铬饰条、手工缝制的皮革座椅和定制轮毂盖。"
    },
    {
      "pos": "noun",
      "explanation_en": "In art or writing, the careful inclusion of small, specific elements that contribute to realism or depth.",
      "explanation_cn": "在艺术或写作中，指精心加入的微小、具体元素，以增强真实感或深度。",
      "example_en": "The painter's detailing of the fabric's folds gave the portrait an astonishing sense of texture.",
      "example_cn": "画家对布料褶皱的细致描绘赋予了这幅肖像惊人的质感。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "description",
      "analysis": "“Description”（描述）是一个更广泛的术语，泛指对事物特征、外观或性质的陈述，可以是概括性的。而 “detailing” 特指对细节的深入呈现，强调具体、精细的部分，常用于视觉或工艺语境中。"
    },
    {
      "word_to_compare": "specification",
      "analysis": "“Specification”（规格/规范）侧重于技术性、标准化的参数或要求，常用于工程或制造领域，强调准确性与可执行性。而 “detailing” 更偏向于表现性或美学层面的细节，不一定具有强制性规范。"
    },
    {
      "word_to_compare": "embellishment",
      "analysis": "“Embellishment”（修饰/装饰）通常带有额外添加、可能非必要的含义，有时甚至暗示过度装饰。而 “detailing” 是设计中必要的、有目的的精细处理，通常提升整体品质而非单纯装饰。"
    }
  ]
}