{
  "word": "detail",
  "pronunciation": "dee·tayl",
  "concise_definition": "n. 细节, 细目; v. 详细说明, 详述",
  "forms": {
    "plural": "details",
    "third_person_singular": "details",
    "past_tense": "detailed",
    "past_participle": "detailed",
    "present_participle": "detailing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small, specific part or feature of something, especially one that contributes to its overall character or function; often used to refer to minor but important elements that provide clarity or completeness.",
      "explanation_cn": "指某事物的某个小而具体的组成部分或特征，尤其是那些对整体特性或功能有贡献的细微要素；常用于指提供清晰度或完整性的次要但重要的元素。",
      "example_en": "The artist paid attention to every detail of the painting, from the brushstrokes to the shadows.",
      "example_cn": "这位艺术家对画作的每一个细节都极为用心，从笔触到阴影无不精心处理。"
    },
    {
      "pos": "noun",
      "explanation_en": "A list or itemized account of specific facts, components, or steps, often presented in an organized manner for clarity or analysis.",
      "explanation_cn": "指以条目形式列出的具体事实、组成部分或步骤，通常以有组织的方式呈现以便于清晰理解或分析。",
      "example_en": "The report includes a detailed breakdown of expenses by department.",
      "example_cn": "这份报告按部门详细列出了各项开支。"
    },
    {
      "pos": "verb",
      "explanation_en": "To describe or explain something thoroughly, providing all relevant specifics and minor elements to ensure full understanding.",
      "explanation_cn": "指全面地描述或解释某事物，提供所有相关的具体信息和细微之处，以确保充分理解。",
      "example_en": "She detailed the entire process step by step so that everyone could follow along.",
      "example_cn": "她一步步详细说明了整个过程，以便每个人都能跟上。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "aspect",
      "analysis": "“Aspect”（方面）指某事物的某个特定角度、层面或特征，通常用于宏观或抽象层面的划分，如‘经济方面’‘社会方面’。它不强调具体细节，而是关注整体结构中的不同维度。而 ‘detail’ 则聚焦于微观、具体的组成部分，是‘aspect’的进一步细化。"
    },
    {
      "word_to_compare": "feature",
      "analysis": "“Feature”（特征）通常指某事物中突出、显著或具有代表性的部分，常用于产品、设计或人物描述中，强调其独特性或吸引力。例如‘手机的摄像头功能’。而 ‘detail’ 更中性，涵盖所有大小不一的组成部分，包括那些不显眼但必要的部分，如‘按钮的螺丝纹路’。"
    },
    {
      "word_to_compare": "item",
      "analysis": "“Item”（项目）泛指清单中的一个条目，可以是任何事物，如购物清单中的‘牛奶’或会议议程中的‘预算讨论’。它强调的是独立性和可枚举性，但不隐含‘精细性’或‘完整性’。而 ‘detail’ 暗示该条目是构成整体复杂性的重要组成部分，具有解释或补充作用。"
    }
  ]
}