{
  "word": "detox",
  "pronunciation": "dee·tahks",
  "concise_definition": "v. 解毒, 清除毒素; n. 解毒疗法, 清毒期",
  "forms": {
    "third_person_singular": "detoxes",
    "past_tense": "detoxed",
    "past_participle": "detoxed",
    "present_participle": "detoxing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To remove harmful or toxic substances from the body, often through dietary changes, hydration, or medical treatment, to improve health or recover from substance abuse.",
      "explanation_cn": "通过饮食调整、补水或医疗手段，从体内清除有害或有毒物质，以改善健康或从药物滥用中恢复。",
      "example_en": "She spent a week detoxing after the holiday binge eating.",
      "example_cn": "假期暴饮暴食后，她进行了一周的排毒。"
    },
    {
      "pos": "verb",
      "explanation_en": "To eliminate the influence of addictive or harmful habits, such as social media, sugar, or alcohol, often as part of a lifestyle change.",
      "explanation_cn": "指摆脱成瘾性或有害习惯（如社交媒体、糖分或酒精）的影响，通常作为生活方式改变的一部分。",
      "example_en": "He decided to detox from his phone for a month to reduce anxiety.",
      "example_cn": "他决定一个月不碰手机，以减轻焦虑。"
    },
    {
      "pos": "noun",
      "explanation_en": "A period or program during which a person eliminates toxins from their body, often involving fasting, special diets, or supplements.",
      "explanation_cn": "指一个人通过禁食、特殊饮食或补充剂等方式，从体内清除毒素的一段时期或计划。",
      "example_en": "The spa offers a seven-day detox program with organic juices and yoga.",
      "example_cn": "这家水疗中心提供为期七天的排毒计划，包含有机果汁和瑜伽。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cleanse",
      "analysis": "“Cleanse”（净化）含义更广泛，可用于身体、心灵、环境甚至数字空间的清洁，强调去除杂质或不洁之物，不一定特指化学毒素。而 “detox” 更聚焦于生理或心理上的毒素清除，尤其与健康疗法或成瘾戒断相关。"
    },
    {
      "word_to_compare": "purify",
      "analysis": "“Purify”（纯化）强调使物质达到纯净状态，常用于水、空气或金属等物理或化学过程，具有科学或工业语境色彩。而 “detox” 更具生活化和医学语境，侧重于人体对毒素的代谢与清除，带有主观健康目标。"
    },
    {
      "word_to_compare": "recover",
      "analysis": "“Recover”（恢复）泛指从疾病、损伤或不良状态中复原，是一个广义结果性动词，不特指清除毒素的过程。而 “detox” 是实现恢复的一种具体手段，是恢复过程中的一个阶段，而非最终目标。"
    }
  ]
}