{
  "word": "detour",
  "pronunciation": "dee·toor",
  "concise_definition": "n. 绕行, 绕道; v. 绕道而行",
  "forms": {
    "plural": "detours",
    "third_person_singular": "detours",
    "past_tense": "detoured",
    "past_participle": "detoured",
    "present_participle": "detouring"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A temporary or planned change in a route or path, typically taken to avoid an obstacle, congestion, or closed area, such as a roadblock or construction zone.",
      "explanation_cn": "指为避开障碍物、交通拥堵或封闭区域而临时或计划性地改变原有路线或路径，例如绕行施工区或道路封闭段。",
      "example_en": "Due to the accident, drivers were directed to take a detour through the side streets.",
      "example_cn": "由于事故，司机被引导通过侧街绕行。"
    },
    {
      "pos": "noun",
      "explanation_en": "A departure from the main course or topic, often implying a delay or distraction from the original purpose.",
      "explanation_cn": "指偏离主要路线或主题，常暗示对原定目标的延误或分心。",
      "example_en": "The meeting took a detour into unrelated personal stories, wasting valuable time.",
      "example_cn": "会议偏离了主题，转而讨论无关的个人故事，浪费了宝贵时间。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause or force someone or something to take an indirect or alternative route, often temporarily.",
      "explanation_cn": "指使某人或某物被迫或临时采取一条间接或替代路线。",
      "example_en": "The floodwaters detoured the highway, forcing commuters to find alternate routes.",
      "example_cn": "洪水使高速公路改道，迫使通勤者寻找其他路线。"
    },
    {
      "pos": "verb",
      "explanation_en": "To divert attention or effort away from the original goal or plan, often unintentionally.",
      "explanation_cn": "指无意中将注意力或精力从原定目标或计划上转移开。",
      "example_en": "The colorful graphics detoured the audience from the core message of the presentation.",
      "example_cn": "绚丽的图形分散了观众对演示核心信息的注意力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "diversion",
      "analysis": "“Diversion” (转移/ diversion) 指将注意力、资源或交通从原定方向转移，常用于更抽象或策略性的语境，如心理上的分心或军事上的佯攻。而 “detour” 更具体地指物理路径的改变，多用于交通或地理场景。"
    },
    {
      "word_to_compare": "detour",
      "analysis": "“Reroute” (改道) 是一个更中性、技术性的术语，常用于系统或计划层面的路线调整，如航班改道或导航软件重新规划路径。而 “detour” 常带有临时性、非计划性甚至不便的含义，情感色彩更明显。"
    },
    {
      "word_to_compare": "side trip",
      "analysis": "“Side trip” (顺道游览) 指主动、自愿地偏离主路线去参观或探索某个地方，通常带有积极或休闲的目的。而 “detour” 多为被迫或必要之举，常伴随不便或延误，情感上更中性或负面。"
    }
  ]
}