{
  "word": "deutsche",
  "pronunciation": "dɔʏtʃə",
  "concise_definition": "n. 德语, 德国人（复数）; adj. 德国的, 德语的",
  "forms": {
    "singular": "Deutsche",
    "masculine": "Deutscher",
    "feminine": "Deutsche",
    "neuter": "Deutsches"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The plural form of 'Deutsche' referring to the people of Germany; used to denote Germans collectively, especially in contrast to other nationalities.",
      "explanation_cn": "“Deutsche”的复数形式，指德国人民，常用于集体指代德国人，尤其在与其他国籍对比时使用。",
      "example_en": "The Deutsche have a strong tradition of engineering and precision manufacturing.",
      "example_cn": "德国人有着深厚的工程与精密制造传统。"
    },
    {
      "pos": "noun",
      "explanation_en": "The German language, especially when used in the context of native speakers or linguistic identity.",
      "explanation_cn": "德语，尤其在指母语者或语言身份时使用（此用法在英语中较少见，多见于德语语境或学术引用）。",
      "example_en": "She studied linguistics to better understand how Deutsche evolved from Old High German.",
      "example_cn": "她学习语言学，以更好地理解德语如何从古高地德语演变而来。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to Germany, its people, language, or culture; used to describe anything originating from or characteristic of Germany.",
      "explanation_cn": "与德国、其人民、语言或文化相关的；用于描述源自德国或具有德国特征的任何事物。",
      "example_en": "Deutsche cuisine includes sausages, pretzels, and beer brewed according to the Reinheitsgebot.",
      "example_cn": "德国菜包括香肠、椒盐卷饼和按照《纯净法》酿造的啤酒。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "German",
      "analysis": "“German” 是英语中最常用、最标准的词，既可作名词（指德国人或德语），也可作形容词（德国的）。而 “Deutsche” 是德语原词，在英语中使用时通常保留其德语拼写和发音，多用于强调文化身份、学术语境或文学表达，日常英语中极少使用。"
    },
    {
      "word_to_compare": "Teutonic",
      "analysis": "“Teutonic” 是一个更古老、更学术化的词，源自古代日耳曼部落 Teutones，常用于历史或语言学语境中，指日耳曼语族或其文化特征，带有古典色彩。而 “Deutsche” 专指现代德国人或德语，更具民族和当代性。"
    },
    {
      "word_to_compare": "Germany",
      "analysis": "“Germany” 是国家名称，指地理或政治实体，不能直接指代人民或语言。而 “Deutsche” 专指人民（复数）或语言本身，是民族和语言层面的术语，与国家名称有本质区别。"
    }
  ]
}