{
  "word": "devil",
  "pronunciation": "dih·vuhl",
  "concise_definition": "n. 恶魔, 魔鬼, 恶棍, 淘气鬼; interj. (表示愤怒或惊讶) 见鬼!",
  "forms": {
    "plural": "devils"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A supernatural evil being, often depicted as the embodiment of evil or the ruler of hell in Christian theology and other religious traditions.",
      "explanation_cn": "一种超自然的邪恶存在，常在基督教神学及其他宗教传统中被描绘为邪恶的化身或地狱的统治者。",
      "example_en": "The story tells of a man who made a pact with the devil to gain wealth and power.",
      "example_cn": "这个故事讲述了一个与魔鬼签订契约以换取财富与权力的人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is cruel, wicked, or mischievous; often used informally to describe someone who is annoying or playful in a troublesome way.",
      "explanation_cn": "指一个残忍、邪恶或淘气的人；常用于非正式场合，形容令人恼火或顽皮捣蛋的人。",
      "example_en": "That little devil stole my cookies again!",
      "example_cn": "那个小淘气鬼又偷了我的饼干！"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is extremely skilled or passionate about something, often used in compound expressions like 'devil driver' or 'devil dancer'.",
      "explanation_cn": "指在某方面极其擅长或充满热情的人，常用于复合词中，如 'devil driver'（疯狂司机）或 'devil dancer'（狂热舞者）。",
      "example_en": "He's a real devil on the guitar—he plays like no one else.",
      "example_cn": "他是个吉他高手——弹得无人能及。"
    },
    {
      "pos": "interjection",
      "explanation_en": "An exclamation used to express anger, frustration, or surprise, often as a milder substitute for stronger profanity.",
      "explanation_cn": "用作感叹词，表达愤怒、沮丧或惊讶，常作为更强脏话的温和替代。",
      "example_en": "Devil! I forgot my keys again!",
      "example_cn": "见鬼！我又忘带钥匙了！"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "demon",
      "analysis": "“Demon” (恶魔) 通常指源自异教或神话体系中的邪恶灵体，不必然与基督教的地狱体系直接关联，语义更偏向超自然的灵体而非道德象征。而 “devil” 更特指基督教传统中与上帝对立的终极邪恶实体，具有更强的宗教和道德含义。"
    },
    {
      "word_to_compare": "fiend",
      "analysis": "“Fiend” (恶棍/魔鬼) 强调极端的邪恶或残忍，常用于形容人或行为的变态与残暴，如 “drug fiend”（毒瘾者）。“Devil” 则更广泛，既可指超自然存在，也可用于轻度调侃的语境（如淘气鬼），语义范围更广、语气更灵活。"
    },
    {
      "word_to_compare": "satan",
      "analysis": "“Satan” (撒旦) 是专有名词，特指基督教《圣经》中堕落天使的名字，是魔鬼的正式名称。而 “devil” 是通用名词，可泛指任何邪恶存在，也可用于比喻或口语中。在宗教语境中，Satan = Devil，但在日常语言中，devil 更常用、更口语化。"
    }
  ]
}