{
  "word": "devotion",
  "pronunciation": "dih·voh·shun",
  "concise_definition": "n. 忠诚, 奉献, 虔诚, 热爱",
  "forms": {
    "plural": "devotions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A deep commitment or dedication to a person, cause, activity, or belief, often demonstrated through consistent effort, loyalty, or sacrifice.",
      "explanation_cn": "指对某人、事业、活动或信仰的深厚承诺或奉献，通常通过持续的努力、忠诚或牺牲来体现。",
      "example_en": "Her devotion to her patients made her one of the most respected doctors in the hospital.",
      "example_cn": "她对病人的奉献使她成为医院最受尊敬的医生之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A religious practice or act of worship, such as prayer, meditation, or ritual, performed regularly to express spiritual commitment.",
      "explanation_cn": "指为表达宗教信仰而定期进行的宗教实践或崇拜行为，如祈祷、冥想或仪式。",
      "example_en": "Morning prayer is an important part of her daily devotions.",
      "example_cn": "晨祷是她每日宗教修行的重要组成部分。"
    },
    {
      "pos": "noun",
      "explanation_en": "Intense love or affection, often directed toward a person, pet, or ideal, characterized by emotional attachment and unwavering loyalty.",
      "explanation_cn": "指对某人、宠物或理想表现出的强烈爱意或情感依恋，以情感纽带和坚定不移的忠诚为特征。",
      "example_en": "The dog's devotion to its owner was evident in the way it waited faithfully at the door every evening.",
      "example_cn": "这只狗对主人的忠诚体现在每天傍晚忠实地守在门口等待。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "loyalty",
      "analysis": "“Loyalty” (忠诚) 强调对某人或某组织的忠心不二，尤其在困难或诱惑面前仍保持不变。它更侧重于行为上的坚守，常用于人际关系或政治语境。而 “devotion” 范围更广，可包含情感、信仰和行动，常带有更深的情感色彩和精神维度。"
    },
    {
      "word_to_compare": "dedication",
      "analysis": "“Dedication” (奉献) 与 “devotion” 非常接近，都指投入时间和精力于某事。但 “dedication” 更偏向于理性、目标导向的投入，如职业上的奉献；而 “devotion” 常带有情感、宗教或浪漫色彩，更强调内心的热忱与依恋。"
    },
    {
      "word_to_compare": "piety",
      "analysis": "“Piety” (虔诚) 专指宗教信仰上的虔敬和顺从，强调对神或宗教规范的敬畏与遵守。它是一个更狭义、更宗教化的词。而 “devotion” 可用于宗教语境，也可用于世俗领域（如对家人、事业的奉献），适用范围更广。"
    }
  ]
}