{
  "word": "dharma",
  "pronunciation": "dahr·muh",
  "concise_definition": "n. 法, 正法, 道德义务, 宇宙秩序",
  "forms": {
    "plural": "dharmas"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "In Hinduism and Buddhism, a fundamental concept referring to the cosmic law and order that governs the universe, as well as an individual's moral duty, righteousness, and ethical conduct in accordance with their role in society and nature.",
      "explanation_cn": "在印度教和佛教中，指支配宇宙的宇宙法则与秩序，也指个人根据其在社会与自然中的角色所应履行的道德义务、正直行为与伦理责任。",
      "example_en": "A king's dharma is to protect his people and uphold justice, even at great personal cost.",
      "example_cn": "国王的正法是保护子民、维护正义，即使付出巨大个人代价。"
    },
    {
      "pos": "noun",
      "explanation_en": "In Buddhism, the teachings of the Buddha; the truth or law that leads to enlightenment and liberation from suffering.",
      "explanation_cn": "在佛教中，指佛陀的教义；通向觉悟与解脱苦难的真理或法则。",
      "example_en": "She spent years studying the dharma under a Zen master in Kyoto.",
      "example_cn": "她曾在京都的一位禅师门下潜心修习佛法多年。"
    },
    {
      "pos": "noun",
      "explanation_en": "In a broader philosophical sense, the inherent nature or essential quality of a person, thing, or phenomenon that defines its true purpose or function.",
      "explanation_cn": "在更广泛的哲学意义上，指一个人、事物或现象所固有的本性或本质特征，决定了其真正的目的或功能。",
      "example_en": "The dharma of fire is to burn and transform; the dharma of water is to flow and cleanse.",
      "example_cn": "火的本性是燃烧与转化；水的本性是流动与净化。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "law",
      "analysis": "“Law”（法律）通常指由人类社会制定的强制性规则，强调外在约束与惩罚机制。而 “dharma” 更侧重于内在的道德秩序与宇宙自然法则，是自发遵循的义务，超越人为立法，具有宗教与哲学深度。"
    },
    {
      "word_to_compare": "duty",
      "analysis": "“Duty”（责任）是道德或社会角色所要求的行为，常具功利性或义务性，如职业责任。而 “dharma” 不仅包含责任，还涵盖宇宙真理、生命目的与精神觉醒，是更宏大、更根本的存在性准则。"
    },
    {
      "word_to_compare": "doctrine",
      "analysis": "“Doctrine”（教义）指宗教或哲学体系中系统化的信条或理论，通常是被教导和传播的文本内容。而 “dharma” 不仅是教义，更是实践的路径、生命的真理，是需要亲证与体悟的实相，而非仅靠语言传达的观念。"
    }
  ]
}