{
  "word": "diamonds",
  "pronunciation": "dai·uh·muhndz",
  "concise_definition": "n. 钻石, 钻石饰品, 钻石形状, 扑克牌中的方块",
  "forms": {
    "singular": "diamond"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A precious gemstone composed of crystallized carbon, known for its exceptional hardness, brilliance, and high value, often used in jewelry.",
      "explanation_cn": "由结晶碳组成的珍贵宝石，以其极高的硬度、闪耀的光泽和高昂的价值著称，常用于制作珠宝。",
      "example_en": "She wore a necklace adorned with flawless diamonds.",
      "example_cn": "她戴着一条镶嵌着无瑕钻石的项链。"
    },
    {
      "pos": "noun",
      "explanation_en": "A geometric shape with four equal sides and two pairs of opposite equal angles, often used in patterns, symbols, or playing cards.",
      "explanation_cn": "一种几何形状，具有四条等长边和两对相等的对角，常用于图案、符号或扑克牌中。",
      "example_en": "The suit of diamonds on the playing card was glowing under the casino lights.",
      "example_cn": "扑克牌中的方块花色在赌场灯光下熠熠生辉。"
    },
    {
      "pos": "noun",
      "explanation_en": "A decorative pattern or design consisting of repeated diamond shapes, commonly seen in textiles, architecture, or fashion.",
      "explanation_cn": "由重复的菱形图案组成的装饰性设计，常见于纺织品、建筑或时尚中。",
      "example_en": "The rug featured an elegant diamond motif in gold and crimson.",
      "example_cn": "这块地毯上饰有优雅的金色与深红色菱形图案。"
    },
    {
      "pos": "noun",
      "explanation_en": "A collective term for valuable or sparkling things, often used metaphorically to describe people or objects of exceptional quality or brilliance.",
      "explanation_cn": "用于比喻性地指代具有卓越品质或闪耀特质的人或物，常用于形容杰出人物或珍贵事物。",
      "example_en": "The cast of the play was a true diamond — each performer shone with talent.",
      "example_cn": "这部剧的演员阵容堪称群星璀璨，每位演员都才华横溢。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "gem",
      "analysis": "“Gem”（宝石）是更广泛的类别，包括红宝石、蓝宝石、祖母绿等，而 “diamond” 是其中一种特定且最坚硬的宝石。所有钻石都是宝石，但并非所有宝石都是钻石。"
    },
    {
      "word_to_compare": "crystal",
      "analysis": "“Crystal”（水晶）泛指透明或半透明的矿物晶体，如石英水晶，虽然也可能闪耀，但硬度和价值远低于钻石。钻石是碳的结晶，而水晶通常是二氧化硅的结晶，两者在化学成分和物理特性上截然不同。"
    },
    {
      "word_to_compare": "jewel",
      "analysis": "“Jewel”（珠宝）是泛指所有用于装饰的贵重物品，包括钻石、珍珠、黄金制品等。钻石是珠宝的一种材料，而 “jewel” 更强调成品的装饰属性，而非材料本身。"
    }
  ]
}