{
  "word": "dies",
  "pronunciation": "dīz",
  "concise_definition": "n. 骰子, 模具, 印章; v. 死亡, 消失, 褪色",
  "forms": {
    "third_person_singular": "dies",
    "past_tense": "died",
    "past_participle": "died",
    "present_participle": "dying"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small cube with numbered sides, used in games of chance to generate random numbers.",
      "explanation_cn": "一种带有数字面的小立方体，用于赌博或游戏中以产生随机数字。",
      "example_en": "He rolled a six on the dice and moved his piece to the final square.",
      "example_cn": "他掷出了六点，将自己的棋子移到了终点格。"
    },
    {
      "pos": "noun",
      "explanation_en": "A hardened steel tool used to shape or stamp material, especially in manufacturing processes such as coin minting or metal forming.",
      "explanation_cn": "一种用于在制造过程中塑造或冲压材料的硬化钢制工具，常用于铸币或金属成型。",
      "example_en": "The mint uses custom dies to produce coins with intricate designs.",
      "example_cn": "造币厂使用特制模具来铸造具有复杂图案的硬币。"
    },
    {
      "pos": "noun",
      "explanation_en": "A stamp or seal used to imprint a design, logo, or text onto a surface, often for official or decorative purposes.",
      "explanation_cn": "用于在表面压印图案、标志或文字的印章，常用于官方或装饰性用途。",
      "example_en": "The wedding invitation bore the family's crest, impressed by a brass die.",
      "example_cn": "婚礼请柬上印有家族徽章，是用黄铜印章压印而成的。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cease living; to become dead, typically as the result of illness, injury, or old age.",
      "explanation_cn": "停止生命活动；因疾病、伤害或年老而死亡。",
      "example_en": "The old tree died during the drought last summer.",
      "example_cn": "那棵老树在去年夏天的干旱中枯死了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To gradually fade, disappear, or cease to exist, often used metaphorically for sounds, light, or emotions.",
      "explanation_cn": "逐渐减弱、消失或不复存在，常用于比喻声音、光线或情感的消退。",
      "example_en": "The cheers died away as the crowd dispersed.",
      "example_cn": "人群散去后，欢呼声渐渐消失了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To lose color or vibrancy, especially in fabrics or pigments, due to exposure to light, water, or time.",
      "explanation_cn": "因光照、水洗或时间推移而失去颜色或鲜艳度，尤指织物或颜料。",
      "example_en": "The red curtains have died to a pale pink after years of sunlight.",
      "example_cn": "这些红色窗帘在多年日晒后褪成了淡粉色。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "dice",
      "analysis": "“Dice” 是 “die” 的复数形式，指多个骰子。虽然在口语中常以复数形式出现，但 “die” 作为单数名词特指一个骰子，而 “dice” 有时也被用作单复数同形词。在正式语境中，应区分 “a die” 和 “two dice”。"
    },
    {
      "word_to_compare": "mold",
      "analysis": "“Mold” (模具) 与 “die” 在制造领域有重叠，但 “mold” 通常指用于铸造液体材料（如塑料、金属）的空腔模具，而 “die” 更常用于冲压、挤压或 stamping（冲压成型）固体材料，如金属片或硬币。"
    },
    {
      "word_to_compare": "perish",
      "analysis": "“Perish” (死亡/毁灭) 与 “die” 同义，但语气更正式或文学化，常用于描述因灾难、恶劣环境或道德堕落而毁灭，如 “The crops perished in the frost.” 而 “die” 更通用，涵盖从生物死亡到声音消失等广泛语境。"
    },
    {
      "word_to_compare": "fade",
      "analysis": "“Fade” (褪色/减弱) 与 “die” 在描述颜色或声音消退时可互换，但 “fade” 更强调渐进性与温和性，如颜色慢慢变淡；而 “die” 更具突然性或终结性，如 ‘the light died’ 暗示彻底熄灭。"
    }
  ]
}