{
  "word": "dig",
  "pronunciation": "dihg",
  "concise_definition": "v. 挖掘, 喜爱, 理解; n. 挖掘, 攻击性评论",
  "forms": {
    "third_person_singular": "digs",
    "past_tense": "dug",
    "past_participle": "dug",
    "present_participle": "digging"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To break up and remove earth, soil, or other material using a tool or one's hands, typically to create a hole or trench.",
      "explanation_cn": "使用工具或双手翻动并移除泥土、土壤或其他物质，通常是为了挖出一个洞或沟渠。",
      "example_en": "They dug a deep well to access clean water.",
      "example_cn": "他们挖了一口深井以获取干净的水源。"
    },
    {
      "pos": "verb",
      "explanation_en": "To have a strong liking or enthusiasm for something, often used informally.",
      "explanation_cn": "非正式用语，表示对某事物有强烈的喜爱或热情。",
      "example_en": "I really dig this jazz band—their improvisation is amazing.",
      "example_cn": "我超爱这个爵士乐队——他们的即兴演奏太棒了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To understand or grasp something, especially after effort or thought; often used in negative or interrogative contexts.",
      "explanation_cn": "经过努力或思考后理解或领会某事，常用于否定或疑问句中。",
      "example_en": "I just can't dig why he would say something like that.",
      "example_cn": "我实在搞不懂他为什么会说那样的话。"
    },
    {
      "pos": "noun",
      "explanation_en": "An act of digging, especially in the context of excavation or archaeology.",
      "explanation_cn": "挖掘的行为，尤其在挖掘或考古的语境中。",
      "example_en": "The archaeological dig revealed artifacts dating back 3,000 years.",
      "example_cn": "这次考古发掘出土了距今三千年的文物。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sarcastic or critical remark, often delivered in a humorous or biting way.",
      "explanation_cn": "一种讽刺性或批评性的评论，常以幽默或尖锐的方式表达。",
      "example_en": "That joke about his haircut was a pretty sharp dig.",
      "example_cn": "那个关于他发型的笑话真是刻薄得很。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "excavate",
      "analysis": "“Excavate” (发掘/挖掘) 是更正式、技术性的词汇，常用于考古、工程或地质领域，强调系统性、专业性的挖掘行为。而 “dig” 更口语化，适用范围更广，可指任何用手或工具挖土的行为，不强调专业性。"
    },
    {
      "word_to_compare": "like",
      "analysis": "“Like” (喜欢) 是中性、通用的表达喜爱的词，适用于所有语境。而 “dig” 作为“喜爱”义项时，是非正式俚语，带有强烈个人情感色彩，常用于年轻人或流行文化中，语气更生动、随意。"
    },
    {
      "word_to_compare": "criticize",
      "analysis": "“Criticize” (批评) 是中性或正式的动词，指指出错误或不足，可正面可负面。而 “dig” 作为名词或动词表示“讽刺性攻击”时，语气更尖酸、带有幽默或恶意，通常不是严肃的批评，而是言语上的刺探或调侃。"
    }
  ]
}