{
  "word": "digging",
  "pronunciation": "dig·ing",
  "concise_definition": "n. 挖掘, 挖掘行为, 探究; v. 挖掘 (dig 的现在分词)",
  "forms": {
    "base_form": "dig",
    "third_person_singular": "digs",
    "past_tense": "dug",
    "past_participle": "dug",
    "present_participle": "digging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The action or process of excavating earth or other material using tools or hands, often to uncover something buried or to create a hole or trench.",
      "explanation_cn": "指使用工具或双手挖掘泥土或其他物质的行为或过程，通常是为了发现埋藏物或开凿洞穴、沟渠。",
      "example_en": "The archaeologists were engaged in careful digging at the ancient site.",
      "example_cn": "考古学家们正在古遗址进行细致的挖掘。"
    },
    {
      "pos": "noun",
      "explanation_en": "A metaphorical search or investigation into a subject, especially one that is complex or hidden, often implying persistence or thoroughness.",
      "explanation_cn": "比喻对某一主题进行深入探究或调查，尤其指涉及复杂或隐秘内容时，常暗示坚持不懈或彻底深入。",
      "example_en": "The journalist's digging revealed corruption in the city council.",
      "example_cn": "记者的深入调查揭露了市议会的腐败行为。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of informal or humorous reference to a person's persistent interest or obsession with something, often used in phrases like 'the digging game'.",
      "explanation_cn": "一种非正式或幽默的说法，指某人对某事物的执着兴趣或痴迷，常用于如‘挖掘游戏’这类表达中。",
      "example_en": "He’s got a real digging for old vinyl records — his apartment is full of them.",
      "example_cn": "他特别痴迷于老式黑胶唱片——他的公寓里堆满了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "excavation",
      "analysis": "“Excavation” (发掘/挖掘) 是一个更正式、技术性的术语，常用于考古学、建筑或工程领域，强调系统性、有计划的挖掘行为。而 “digging” 更口语化，可泛指任何形式的挖掘，包括随意或体力性的动作。"
    },
    {
      "word_to_compare": "investigation",
      "analysis": "“Investigation” (调查) 是一个更广泛的抽象名词，指系统性地收集信息以查明真相，适用于法律、科学或新闻领域。而 “digging” 作为比喻用法时，虽与之相近，但更强调主动、深入甚至带有冒险性质的挖掘过程，语气更生动、非正式。"
    },
    {
      "word_to_compare": "tunneling",
      "analysis": "“Tunneling” (挖掘隧道) 专指在地下开凿通道的行为，强调方向性（通常是水平）和结构目的。而 “digging” 是一个更通用的词，可指向上、向下或向四周的挖掘，不局限于通道或特定形状。"
    }
  ]
}