{
  "word": "dimensional",
  "pronunciation": "dī·men·shən·əl",
  "concise_definition": "adj. 有维度的, 多维的, 维度的",
  "forms": {
    "comparative": "more dimensional",
    "superlative": "most dimensional"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or having dimensions, especially in terms of spatial measurement such as length, width, and height; used to describe objects or spaces that exist in one or more measurable directions.",
      "explanation_cn": "与维度相关或具有维度的，尤其指在长度、宽度和高度等空间测量方面的特性；用于描述存在于一个或多个可测量方向中的物体或空间。",
      "example_en": "The artist created a three-dimensional sculpture that seemed to float in space.",
      "example_cn": "这位艺术家创作了一件三维雕塑，仿佛悬浮在空间中。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used in mathematics and physics to describe systems or models that involve multiple variables or axes, such as two-dimensional graphs or four-dimensional spacetime.",
      "explanation_cn": "在数学和物理学中用于描述涉及多个变量或轴的系统或模型，例如二维图形或四维时空。",
      "example_en": "Einstein’s theory of relativity introduced the concept of four-dimensional spacetime.",
      "example_cn": "爱因斯坦的相对论引入了四维时空的概念。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Figuratively, describing something that has depth, complexity, or multiple layers of meaning, often in contrast to something simplistic or flat.",
      "explanation_cn": "比喻意义上，指某事物具有深度、复杂性或多层次的含义，常与简单或单薄的事物形成对比。",
      "example_en": "Her character in the novel is highly dimensional, with conflicting emotions and evolving motivations.",
      "example_cn": "小说中她的角色极具层次感，充满矛盾的情感和不断变化的动机。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "three-dimensional",
      "analysis": "“Three-dimensional” (三维的) 是 “dimensional” 的一个具体子类，特指具有长、宽、高三个空间维度的物体。而 “dimensional” 是更广泛的术语，可指一维、二维、三维甚至更高维度，也可用于抽象语境。"
    },
    {
      "word_to_compare": "spatial",
      "analysis": "“Spatial” (空间的) 专指与物理空间位置、形状或关系相关，强调物体在空间中的分布和相互关系。而 “dimensional” 更侧重于维度的数量和数学属性，不一定涉及具体的空间感知。"
    },
    {
      "word_to_compare": "complex",
      "analysis": "“Complex” (复杂的) 是一个通用形容词，泛指结构或内容难以理解，可能包含多个部分或因素。而 “dimensional” 在比喻用法中特指具有多维度、多层次的深度，常用于艺术、心理学或叙事分析中，强调结构的丰富性而非单纯数量的繁多。"
    }
  ]
}