{
  "word": "dip",
  "pronunciation": "dip",
  "concise_definition": "v. 浸入, 浸蘸, 下降; n. 浸蘸, 降低, 酱料",
  "forms": {
    "third_person_singular": "dips",
    "past_tense": "dipped",
    "past_participle": "dipped",
    "present_participle": "dipping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To lower something briefly into a liquid or other substance, often to coat or soak it.",
      "explanation_cn": "指将某物短暂地浸入液体或其他物质中，通常为了使其表面被覆盖或浸透。",
      "example_en": "She dipped the cookie into her coffee to soften it.",
      "example_cn": "她把饼干浸入咖啡里使其变软。"
    },
    {
      "pos": "verb",
      "explanation_en": "To decrease or sink temporarily, especially in level, value, or intensity.",
      "explanation_cn": "指（水平、价值或强度）暂时下降或降低。",
      "example_en": "The stock market dipped sharply after the announcement.",
      "example_cn": "公告发布后，股市急剧下跌。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sauce or mixture served with food, especially for dipping bread, chips, or vegetables into.",
      "explanation_cn": "指一种用于蘸食的酱料或混合物，常用于蘸面包、薯片或蔬菜。",
      "example_en": "The party featured a variety of dips, including guacamole and hummus.",
      "example_cn": "派对上提供了多种蘸酱，包括鳄梨酱和鹰嘴豆泥。"
    },
    {
      "pos": "noun",
      "explanation_en": "A downward slope or depression in a surface, such as a dip in the road or in the ground.",
      "explanation_cn": "指表面的下凹或低洼处，如道路或地面的凹陷。",
      "example_en": "The car bounced as it went through the dip in the road.",
      "example_cn": "汽车驶过路面的凹陷处时颠簸了一下。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "immerse",
      "analysis": "“Immerse”（沉浸/浸入）强调完全或长时间地进入液体或某种环境中，常用于抽象意义（如沉浸于学习），带有深度和专注的意味。而 “dip” 仅指短暂、轻浅的浸入，动作更轻微、短暂。"
    },
    {
      "word_to_compare": "submerge",
      "analysis": "“Submerge”（淹没/沉入）指完全被液体覆盖，通常带有被动或强制的意味，常用于物理层面的完全浸没。而 “dip” 仅涉及部分或表面的接触，程度远轻于 “submerge”。"
    },
    {
      "word_to_compare": "sauce",
      "analysis": "“Sauce”（酱汁）是泛指任何用于调味的液体或半液体调料，不一定用于蘸食；而 “dip” 作为名词时特指用于蘸食的浓稠酱料，强调其功能性（供蘸取），语义范围更窄、更具体。"
    },
    {
      "word_to_compare": "decline",
      "analysis": "“Decline”（下降/衰退）多用于抽象概念，如人口、经济、健康等的长期或趋势性下降，语气较正式；而 “dip” 描述的是短暂、轻微的下降，常用于数据、价格或物理高度的短期波动，语气更口语化。"
    }
  ]
}