{
  "word": "dipping",
  "pronunciation": "dip·ing",
  "concise_definition": "n. 沾蘸, 浸入; v. 沾, 浸, 使浸入 (dip 的现在分词和动名词形式)",
  "forms": {
    "base_form": "dip",
    "third_person_singular": "dips",
    "past_tense": "dipped",
    "past_participle": "dipped",
    "present_participle": "dipping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The action of briefly immersing something into a liquid or sauce, typically to coat or flavor it; often refers to a food item served with a complementary sauce.",
      "explanation_cn": "指将某物短暂浸入液体或酱料中，以使其表面沾上液体，常用于描述配酱食用的食品，如蘸酱食物。",
      "example_en": "The party featured a variety of dips, including guacamole and hummus, perfect for dipping chips.",
      "example_cn": "派对上提供了多种蘸酱，如鳄梨酱和鹰嘴豆泥，非常适合搭配薯片蘸食。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slight downward movement or decline, especially in price, level, or intensity.",
      "explanation_cn": "指价格、水平或强度的轻微下降或降低。",
      "example_en": "There was a slight dipping in stock prices after the earnings report.",
      "example_cn": "财报发布后，股价出现轻微下跌。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move something briefly into and out of a liquid, especially to coat or moisten it.",
      "explanation_cn": "指将某物短暂地浸入并取出液体中，尤其是为了使其表面沾上液体或变湿。",
      "example_en": "She was dipping a strawberry into melted chocolate.",
      "example_cn": "她正把一颗草莓浸入融化的巧克力中。"
    },
    {
      "pos": "verb",
      "explanation_en": "To decrease slightly or temporarily, especially in value, amount, or level.",
      "explanation_cn": "指（价值、数量或水平）暂时或轻微地下降。",
      "example_en": "The temperature dipped below freezing last night.",
      "example_cn": "昨晚气温降至冰点以下。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "immersion",
      "analysis": "“Immersion”（沉浸/浸入）强调完全或长时间地进入液体或环境中，常用于抽象语境（如语言沉浸式学习），具有深度和持续性。而 “dipping” 是短暂、轻触式的接触，强调动作的快速和表面性。"
    },
    {
      "word_to_compare": "submerging",
      "analysis": "“Submerging”（淹没/完全浸没）指将物体完全置于液体之下，通常带有强制性或彻底性，常用于物理或危险情境（如潜艇下潜）。而 “dipping” 仅涉及部分或短暂接触，语气更轻、更日常。"
    },
    {
      "word_to_compare": "decline",
      "analysis": "“Decline”（下降/衰退）是更正式、更广泛的术语，用于描述长期或显著的减少趋势，如人口下降、经济衰退。而 “dipping” 仅指轻微、短暂的下降，语气更口语化，常用于描述波动而非趋势。"
    }
  ]
}