{
  "word": "direct",
  "pronunciation": "dih·rekt",
  "concise_definition": "adj. 直接的, 直线的; v. 指导, 指挥, 导演",
  "forms": {
    "third_person_singular": "directs",
    "past_tense": "directed",
    "past_participle": "directed",
    "present_participle": "directing",
    "comparative": "more direct",
    "superlative": "most direct"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Proceeding in a straight line or without interruption, deviation, or intermediaries; not indirect or mediated.",
      "explanation_cn": "指沿直线进行，无中断、无偏差或无中间环节；非间接或非经过中介的。",
      "example_en": "She gave me a direct answer to my question.",
      "example_cn": "她对我的问题给出了一个直接的回答。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Being the most immediate or closest in relationship, time, or cause; not secondary or remote.",
      "explanation_cn": "指在关系、时间或因果上最直接、最接近的；非次要或遥远的。",
      "example_en": "The direct cause of the accident was faulty brakes.",
      "example_cn": "这起事故的直接原因是刹车失灵。"
    },
    {
      "pos": "verb",
      "explanation_en": "To manage, control, or guide the actions or performance of a person, group, or activity, especially in a formal or authoritative way.",
      "explanation_cn": "指以正式或权威的方式管理、控制或指导某人、某群体或某项活动的行动或表现。",
      "example_en": "The CEO directed the company’s expansion into Asia.",
      "example_cn": "首席执行官指导了公司向亚洲的扩张。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be the creative leader of a film, play, or other performance, determining the artistic vision and guiding the actors and crew.",
      "explanation_cn": "指担任电影、戏剧或其他表演的创意领导者，决定艺术愿景并指导演员和摄制组。",
      "example_en": "She directed several award-winning documentaries before moving to feature films.",
      "example_cn": "她在转向故事片之前执导了多部获奖纪录片。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "straight",
      "analysis": "“Straight” (笔直的) 主要描述物理空间中的直线形态，强调几何意义上的无弯曲，如一条直路或直尺。而 “direct” 更侧重于逻辑、路径或沟通上的无迂回，可指时间、因果或信息传递的直接性，适用范围更广。"
    },
    {
      "word_to_compare": "immediate",
      "analysis": "“Immediate” (立即的) 强调时间上的无延迟，如“immediate response”（立即回应）。“Direct” 则强调路径或关系上的无中介，即使有时间延迟，只要没有中间环节，仍可称为 direct。例如，直接投票 vs. 通过代表投票。"
    },
    {
      "word_to_compare": "guide",
      "analysis": "“Guide” (引导) 通常带有辅助、建议或带领的意味，语气较温和，不强调权威性。而 “direct” 更具命令性或控制性，常用于上级对下级、导演对演员等具有明确指挥关系的语境中。"
    }
  ]
}