{
  "word": "directed",
  "pronunciation": "dih·rek·tuhd",
  "concise_definition": "adj. 有方向的, 指导的; v. 指导, 导演 (direct 的过去式和过去分词)",
  "forms": {
    "base_form": "direct",
    "third_person_singular": "directs",
    "past_tense": "directed",
    "past_participle": "directed",
    "present_participle": "directing",
    "adjective_form": "directed"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having a specific direction, purpose, or target; intentionally guided or controlled toward a particular outcome.",
      "explanation_cn": "具有特定方向、目的或目标；有意识地引导或控制以达成特定结果。",
      "example_en": "The campaign was a directed effort to increase voter turnout.",
      "example_cn": "这场运动是有针对性地旨在提高选民投票率。"
    },
    {
      "pos": "adjective",
      "explanation_en": "In film or theater, referring to a work that has been consciously shaped by a director’s vision and choices.",
      "explanation_cn": "在电影或戏剧中，指由导演的愿景和选择有意识塑造的作品。",
      "example_en": "Her directed style is known for its stark lighting and minimalist dialogue.",
      "example_cn": "她的导演风格以强烈的光影和极简的对白著称。"
    },
    {
      "pos": "verb",
      "explanation_en": "To guide, manage, or control the actions or development of someone or something, often with authority or expertise.",
      "explanation_cn": "以权威或专业知识引导、管理或控制某人或某事物的行动或发展。",
      "example_en": "She directed the team through the complex project with remarkable clarity.",
      "example_cn": "她以清晰的思路带领团队完成了这个复杂的项目。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be the creative leader of a film, play, or television production, making decisions about performances, camera work, and overall vision.",
      "explanation_cn": "担任电影、戏剧或电视制作的创意领导者，对表演、镜头运用和整体风格做出决策。",
      "example_en": "Steven Spielberg directed over 30 films, many of which became cultural landmarks.",
      "example_cn": "史蒂文·斯皮尔伯格执导了三十多部电影，其中许多成为文化里程碑。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "guided",
      "analysis": "“Guided” (引导) 强调提供方向或支持，通常语气较温和，可能不具权威性，如导师引导学生。而 “directed” 更强调控制、命令或明确的指挥，常带有权威或决策的意味。"
    },
    {
      "word_to_compare": "instructed",
      "analysis": "“Instructed” (指示) 侧重于提供具体步骤或命令，常用于教学或操作场景，如“被指示如何操作机器”。“Directed” 范围更广，可涵盖战略、艺术或整体方向的引导，不仅限于步骤说明。"
    },
    {
      "word_to_compare": "managed",
      "analysis": "“Managed” (管理) 强调组织、协调和资源调配，关注效率与结果，常用于商业或行政语境。而 “directed” 更侧重于领导力、愿景和创意方向，尤其在艺术或战略层面，不一定涉及日常运营。"
    }
  ]
}