{
  "word": "dirt",
  "pronunciation": "durt",
  "concise_definition": "n. 泥土, 污垢, 垃圾; v. 弄脏",
  "forms": {
    "plural": "dirts"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Loose earth or soil, especially when dry and dusty, often found on the ground or clinging to surfaces.",
      "explanation_cn": "松散的泥土或土壤，尤其指干燥多尘时，常出现在地面或附着在物体表面。",
      "example_en": "The children came in with dirt on their shoes after playing outside.",
      "example_cn": "孩子们在外面玩完后，鞋子上沾满了泥土进来了。"
    },
    {
      "pos": "noun",
      "explanation_en": "Filth or unclean substance, such as grease, grime, or waste, that makes something dirty or unsanitary.",
      "explanation_cn": "污垢、污物或不洁物质，如油脂、污渍或废弃物，使某物变得肮脏或不卫生。",
      "example_en": "She wiped the kitchen counter to remove the dirt and grease.",
      "example_cn": "她擦拭了厨房台面，以清除污垢和油渍。"
    },
    {
      "pos": "noun",
      "explanation_en": "Informal or slang term for scandalous or damaging information about someone, often used in the context of gossip or media exposure.",
      "explanation_cn": "非正式或俚语用法，指关于某人的丑闻或损害性信息，常用于八卦或媒体曝光的语境中。",
      "example_en": "The journalist dug up some dirt on the politician that made headlines.",
      "example_cn": "记者挖出了这位政客的一些丑闻，登上了头条新闻。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make something dirty or unclean, especially by covering it with soil, dust, or filth.",
      "explanation_cn": "使某物变脏，尤其是通过覆盖泥土、灰尘或污垢。",
      "example_en": "The dog dirtied the carpet by running through the mud.",
      "example_cn": "狗从泥地里跑过，把地毯弄脏了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "soil",
      "analysis": "“Soil”（土壤）是更中性、科学的术语，指支持植物生长的天然地表物质，通常不含贬义。而 “dirt” 更常用于日常语境，带有脏污、不洁的负面含义，有时泛指任何令人不悦的地面物质。"
    },
    {
      "word_to_compare": "grime",
      "analysis": "“Grime”（污垢）特指长期积累的、油腻或顽固的污渍，通常与工业环境或未清洁的表面相关，比 “dirt” 更具体、更黏稠。而 “dirt” 是更宽泛的词，可涵盖灰尘、泥土、垃圾等多种形态。"
    },
    {
      "word_to_compare": "garbage",
      "analysis": "“Garbage”（垃圾）指被丢弃的废弃物，如食物残渣、包装等，强调“废弃性”和“可回收/处理性”。而 “dirt” 指附着在物体上的脏物，不一定被丢弃，更多是污染状态。两者在语义上不重叠，但都可属于‘不洁物’的广义范畴。"
    }
  ]
}