{
  "word": "disarm",
  "pronunciation": "dih·zarm",
  "concise_definition": "v. 解除武装, 消除敌意, 使失去效力",
  "forms": {
    "third_person_singular": "disarms",
    "past_tense": "disarmed",
    "past_participle": "disarmed",
    "present_participle": "disarming"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To remove weapons from someone or something, especially in a military or conflict context, to reduce the threat of violence.",
      "explanation_cn": "指从某人或某方移除武器，尤其在军事或冲突背景下，以降低暴力威胁。",
      "example_en": "The peace treaty required both sides to disarm their nuclear arsenals.",
      "example_cn": "和平条约要求双方解除其核武库。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reduce or eliminate hostility, suspicion, or tension, often by using charm, humor, or sincerity to make someone less defensive.",
      "explanation_cn": "指通过魅力、幽默或真诚来减少敌意、猜疑或紧张情绪，使对方不再戒备。",
      "example_en": "Her warm smile and honest apology completely disarmed the angry customer.",
      "example_cn": "她温暖的微笑和真诚的道歉完全化解了那位愤怒顾客的敌意。"
    },
    {
      "pos": "verb",
      "explanation_en": "To render something ineffective or harmless, especially a mechanism, argument, or strategy that was intended to cause harm or have impact.",
      "explanation_cn": "指使某物（如机制、论点或策略）失去效力或危害性，尤其是原本旨在造成伤害或产生影响的事物。",
      "example_en": "The lawyer disarmed the prosecution's key argument by presenting contradictory evidence.",
      "example_cn": "律师通过出示矛盾证据，使检方的关键论点失去了效力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "demilitarize",
      "analysis": "“Demilitarize” (非军事化) 专指从军事角度解除武装或移除军事设施，通常用于国家或地区层面的正式政策，语义范围较窄且更制度化。而 “disarm” 适用范围更广，可指个人、组织或抽象事物的解除武装或去威胁化。"
    },
    {
      "word_to_compare": "appease",
      "analysis": "“Appease” (安抚/迁就) 指通过让步或满足要求来平息不满或愤怒，常带有负面含义，暗示牺牲原则。而 “disarm” 更侧重于通过情感或策略手段消除敌意，不一定涉及让步，有时甚至通过真诚或智慧化解冲突。"
    },
    {
      "word_to_compare": "neutralize",
      "analysis": "“Neutralize” (中和/使无效) 强调通过技术或化学手段使某物失去作用，如中和酸性物质或瘫痪敌方系统。它更偏向物理或科学语境。而 “disarm” 更常用于人际、政治或象征性语境，强调解除威胁而非单纯功能失效。"
    }
  ]
}