{
  "word": "disability",
  "pronunciation": "dih·suh·bil·uh·tee",
  "concise_definition": "n. 残疾, 无能, 局限",
  "forms": {
    "plural": "disabilities"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A physical, mental, cognitive, or sensory condition that substantially limits one or more major life activities, such as walking, seeing, hearing, speaking, breathing, learning, or working.",
      "explanation_cn": "指一种身体、精神、认知或感官上的状况，显著限制一个人的一项或多项主要生活活动，如行走、视觉、听觉、说话、呼吸、学习或工作。",
      "example_en": "She has a mobility disability and uses a wheelchair for daily transportation.",
      "example_cn": "她有行动障碍，日常出行依靠轮椅。"
    },
    {
      "pos": "noun",
      "explanation_en": "A legal or social disadvantage or limitation imposed on an individual due to societal barriers, rather than the condition itself, as recognized in disability rights frameworks.",
      "explanation_cn": "指由于社会障碍而非个体自身状况所导致的法律或社会性劣势或限制，这在残疾人权利框架中被广泛承认。",
      "example_en": "The lack of ramps and accessible restrooms is not a disability of the person—it’s a societal disability.",
      "example_cn": "缺乏坡道和无障碍洗手间，并非个人的残疾，而是社会性的障碍。"
    },
    {
      "pos": "noun",
      "explanation_en": "A lack or deficiency in a particular ability or skill, often used in a figurative or non-medical context.",
      "explanation_cn": "指在某种能力或技能上的缺乏或不足，常用于比喻或非医学语境中。",
      "example_en": "His biggest disability is his inability to work well in teams.",
      "example_cn": "他最大的不足是无法与团队良好协作。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "impairment",
      "analysis": "“Impairment”（功能障碍）指身体或心理功能的损伤或异常，是医学层面的客观描述，如视力下降或记忆减退。而 “disability” 更强调这种损伤如何影响个体在社会环境中的功能发挥，是功能与环境互动的结果。"
    },
    {
      "word_to_compare": "handicap",
      "analysis": "“Handicap”（障碍）传统上与 “disability” 混用，但现代用法中已逐渐被视为过时甚至冒犯，因为它暗示个体本身是“负担”或“劣势”。如今，“disability” 是更中性、尊重的术语，强调社会应消除环境障碍，而非将责任归于个体。"
    },
    {
      "word_to_compare": "limitation",
      "analysis": "“Limitation”（限制）是一个更宽泛、中性的词，可指任何约束或边界，如时间限制、资源限制。而 “disability” 特指因生理或心理状况导致的、影响基本生活能力的限制，具有特定的社会和法律含义。"
    }
  ]
}