{
  "word": "disco",
  "pronunciation": "dis·koh",
  "concise_definition": "n. 迪斯科, 迪斯科舞厅, 迪斯科音乐",
  "forms": {
    "plural": "discos"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A type of dance music that emerged in the 1970s, characterized by a strong beat, syncopated basslines, and electronic instrumentation, often played in nightclubs to encourage dancing.",
      "explanation_cn": "一种20世纪70年代兴起的舞蹈音乐，以强烈的节拍、切分低音和电子乐器为特征，常在夜总会播放以促进跳舞。",
      "example_en": "The party was filled with classic disco hits like 'Stayin' Alive' by the Bee Gees.",
      "example_cn": "派对上播放着比吉斯乐队的经典迪斯科歌曲《Stayin' Alive》。"
    },
    {
      "pos": "noun",
      "explanation_en": "A nightclub or venue where people dance to disco music, often featuring a dance floor, strobe lights, and a DJ.",
      "explanation_cn": "一种供人们跳迪斯科舞的夜总会或场所，通常设有舞池、频闪灯和DJ。",
      "example_en": "In the 1970s, every major city had at least one popular disco where people dressed up and danced all night.",
      "example_cn": "在20世纪70年代，每个大城市至少都有一家热门的迪斯科舞厅，人们盛装打扮，彻夜跳舞。"
    },
    {
      "pos": "noun",
      "explanation_en": "A shortened form of 'disc jockey' or 'phonograph record', especially in British English, referring to a record or the act of playing records.",
      "explanation_cn": "（尤指英式英语）'disc jockey' 或 '唱片' 的缩写，指唱片或播放唱片的行为。",
      "example_en": "He bought a new disco to add to his vinyl collection.",
      "example_cn": "他买了一张新唱片，加入他的黑胶收藏。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "dance",
      "analysis": "“Dance” (舞蹈) 是一个泛指动作或艺术形式的词，可指任何类型的肢体律动，如芭蕾、街舞或社交舞。而 “disco” 是一种特定风格的音乐和文化现象，特指20世纪70年代兴起的、以电子节拍为驱动的舞厅文化。前者是行为，后者是风格与场景。"
    },
    {
      "word_to_compare": "club",
      "analysis": "“Club” (俱乐部) 是一个广义词，泛指任何提供社交、娱乐或特定兴趣活动的场所，如高尔夫俱乐部、读书俱乐部或夜总会。而 “disco” 是一种特定类型的俱乐部，其核心功能是播放迪斯科音乐并提供跳舞环境。因此，所有 disco 都是 club，但并非所有 club 都是 disco。"
    },
    {
      "word_to_compare": "pop",
      "analysis": "“Pop” (流行音乐) 是一种广泛流行的音乐类型，涵盖多种风格和时代，强调旋律性和大众吸引力。而 “disco” 是流行音乐的一个子类，具有鲜明的节奏特征和舞曲导向。所有 disco 都属于 pop 的范畴，但 pop 音乐不一定是 disco，例如摇滚流行或民谣流行就不具备 disco 的节拍结构。"
    }
  ]
}