{
  "word": "discipline",
  "pronunciation": "dis·sih·plin",
  "concise_definition": "n. 纪律, 学科, 自律; v. 训练, 惩罚",
  "forms": {
    "plural": "disciplines",
    "third_person_singular": "disciplines",
    "past_tense": "disciplined",
    "past_participle": "disciplined",
    "present_participle": "disciplining"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A system of rules or behavior that controls how people act, especially in an organized setting such as a school, military, or workplace, to ensure order and efficiency.",
      "explanation_cn": "指一套用于规范人们行为的规则体系，尤其在学校、军队或工作场所等组织环境中，以确保秩序和效率。",
      "example_en": "The army demands strict discipline from all its soldiers.",
      "example_cn": "军队要求所有士兵严守纪律。"
    },
    {
      "pos": "noun",
      "explanation_en": "A branch of knowledge or academic field of study, often with its own methods and theories.",
      "explanation_cn": "指一个知识领域或学术研究分支，通常具有其独特的方法和理论体系。",
      "example_en": "She earned her Ph.D. in the discipline of cognitive psychology.",
      "example_cn": "她获得了认知心理学领域的博士学位。"
    },
    {
      "pos": "noun",
      "explanation_en": "Personal self-control and the ability to follow a routine or goal despite distractions or difficulties.",
      "explanation_cn": "指个人的自我控制能力，能够在受到干扰或困难时仍坚持既定的计划或目标。",
      "example_en": "His success came from years of discipline and hard work.",
      "example_cn": "他的成功源于多年的自律与努力。"
    },
    {
      "pos": "verb",
      "explanation_en": "To train or correct someone by enforcing rules or imposing penalties for misbehavior.",
      "explanation_cn": "指通过强制执行规则或施加惩罚来训练或纠正某人的不当行为。",
      "example_en": "The teacher disciplined the student for talking during the exam.",
      "example_cn": "老师因学生考试时讲话而惩罚了他。"
    },
    {
      "pos": "verb",
      "explanation_en": "To train oneself or others to follow a strict routine or code of conduct, often to improve performance or character.",
      "explanation_cn": "指训练自己或他人遵循严格的日常规范或行为准则，以提升表现或品格。",
      "example_en": "She disciplines herself to wake up at 5 a.m. every day for meditation.",
      "example_cn": "她自律地每天早上五点起床冥想。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "control",
      "analysis": "“Control” (控制) 更广泛地指对人、事物或情况施加影响以达到预期结果，可以是外在的、强制的，也可以是技术性的（如控制温度）。而 “discipline” 更强调通过规则、训练或自我约束来维持秩序和规范行为，具有道德或教育层面的内涵。"
    },
    {
      "word_to_compare": "training",
      "analysis": "“Training” (训练) 侧重于通过教学和练习来提升技能或能力，通常是积极、建设性的过程。而 “discipline” 可以包含训练，但更强调遵守规则、纠正错误，甚至包含惩罚成分，其范围更广，也更具约束性。"
    },
    {
      "word_to_compare": "regulation",
      "analysis": "“Regulation” (规章/监管) 指由权威机构制定的正式规则或法律，用于管理行为或系统运作，通常是外部强加的。而 “discipline” 可以是外部规则，也可以是内在的自我约束，更侧重于行为的执行与习惯养成，而非规则本身。"
    }
  ]
}