{
  "word": "disclosures",
  "pronunciation": "dih·sklohr·cherz",
  "concise_definition": "n. 披露, 透露, 公开",
  "forms": {
    "singular": "disclosure"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of making previously hidden or confidential information known to the public or to a specific party, often for legal, ethical, or transparency reasons.",
      "explanation_cn": "指将先前隐藏或保密的信息向公众或特定方公开的行为，通常出于法律、道德或透明度的要求。",
      "example_en": "The company was fined for failing to make full financial disclosures to its shareholders.",
      "example_cn": "该公司因未向股东充分披露财务信息而被罚款。"
    },
    {
      "pos": "noun",
      "explanation_en": "A statement or document that reveals important facts, especially in contexts such as law, finance, or personal relationships.",
      "explanation_cn": "指在法律、金融或人际关系等语境中揭示重要事实的陈述或文件。",
      "example_en": "Her disclosure of the conflict of interest led to a change in the board's decision.",
      "example_cn": "她披露了利益冲突，导致董事会改变了决定。"
    },
    {
      "pos": "noun",
      "explanation_en": "In legal or regulatory contexts, formal reports required by authorities that detail financial interests, relationships, or potential biases.",
      "explanation_cn": "在法律或监管语境中，指由当局要求提交的、详细说明财务利益、关系或潜在偏见的正式报告。",
      "example_en": "All politicians must file annual disclosures of their assets and outside income.",
      "example_cn": "所有政治家都必须提交年度资产和外部收入披露报告。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "revelation",
      "analysis": "“Revelation”（揭示）通常带有神秘、戏剧性或突然性的色彩，常用于宗教、文学或情感语境，强调被隐藏的真相被意外或神圣地揭露。而 “disclosure” 更正式、更制度化，多用于法律、商业或行政场景，强调义务性或程序性的公开。"
    },
    {
      "word_to_compare": "announcement",
      "analysis": "“Announcement”（公告）泛指任何公开传达的信息，不一定是秘密或敏感内容，可以是喜讯、通知或宣传。而 “disclosure” 特指原本应保密或未公开的信息被主动或强制性地公开，隐含着责任或风险。"
    },
    {
      "word_to_compare": "confession",
      "analysis": "“Confession”（坦白）通常带有道德或情感上的内疚成分，多用于个人承认错误、罪行或秘密，强调主观意愿和心理负担。而 “disclosure” 更中性，可出于法律义务、职业规范或公共利益，不一定涉及内疚或悔意。"
    }
  ]
}