{
  "word": "disciplines",
  "pronunciation": "dih·suh·plin",
  "concise_definition": "n. 学科, 纪律, 自律, 惩戒",
  "forms": {
    "singular": "discipline"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A branch of knowledge or academic field of study, typically taught and researched in universities and colleges.",
      "explanation_cn": "指在大学和学院中教授与研究的某一知识领域或学术分支。",
      "example_en": "She is pursuing graduate studies in the discipline of cognitive psychology.",
      "example_cn": "她正在攻读认知心理学这一学科的研究生课程。"
    },
    {
      "pos": "noun",
      "explanation_en": "A system of rules or training intended to promote order, self-control, and obedience, often within an institution or group.",
      "explanation_cn": "指一套旨在促进秩序、自控和服从的规则或训练体系，通常应用于机构或团体中。",
      "example_en": "The military emphasizes strict discipline to ensure efficiency and safety.",
      "example_cn": "军队强调严格的纪律以确保效率与安全。"
    },
    {
      "pos": "noun",
      "explanation_en": "Personal self-control or the ability to regulate one's behavior, emotions, or impulses to achieve long-term goals.",
      "explanation_cn": "指个人的自我控制能力，即调节自身行为、情绪或冲动以实现长期目标的能力。",
      "example_en": "Success in any field requires discipline, consistency, and patience.",
      "example_cn": "任何领域的成功都需要自律、坚持与耐心。"
    },
    {
      "pos": "noun",
      "explanation_en": "Punishment imposed to correct behavior or enforce rules, often in educational or institutional settings.",
      "explanation_cn": "指为纠正行为或强制执行规则而施加的惩罚，常见于教育或机构环境中。",
      "example_en": "The student received a disciplinary action for violating the school's code of conduct.",
      "example_cn": "该学生因违反校规而受到纪律处分。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "subjects",
      "analysis": "“Subjects”（科目）通常指教学中具体的学习内容，如数学、历史，偏重课程名称；而 “disciplines” 更强调该领域的系统性知识体系、研究方法和学术传统，具有更强的学术性和专业性。"
    },
    {
      "word_to_compare": "rules",
      "analysis": "“Rules”（规则）是具体的条文或指令，是纪律的外在表现；而 “discipline” 是对规则的内化与执行，包含行为习惯、态度和自我约束，是更深层的规范体系。"
    },
    {
      "word_to_compare": "training",
      "analysis": "“Training”（训练）侧重于技能或行为的外部指导与练习过程；而 “discipline” 不仅包括训练，更强调持续的自我约束、意志力和对标准的坚守，是训练所要培养的内在品质。"
    }
  ]
}