{
  "word": "disciplined",
  "pronunciation": "dis·uh·plind",
  "concise_definition": "adj. 有纪律的, 严于律己的, 受过训练的",
  "forms": {
    "adverb": "disciplinedly",
    "noun": "discipline",
    "comparative": "more disciplined",
    "superlative": "most disciplined"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Showing control over one's behavior, emotions, or actions through self-regulation and adherence to rules or routines, often requiring persistence and restraint.",
      "explanation_cn": "指通过自我调节和遵守规则或惯例，对自身行为、情绪或行动表现出高度控制力，通常需要毅力与克制。",
      "example_en": "She is a disciplined athlete who trains every morning without fail.",
      "example_cn": "她是一位有纪律的运动员，每天早晨都坚持训练，从不缺席。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by strict training, structure, or order, often applied to systems, methods, or environments that enforce conformity and efficiency.",
      "explanation_cn": "形容具有严格训练、结构或秩序的特征，常用于描述强制规范行为、追求效率的体系、方法或环境。",
      "example_en": "The military unit maintained a disciplined approach to daily drills and protocol.",
      "example_cn": "这支军队对日常操练和规程保持着严谨有序的态度。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Having been trained to follow specific standards or codes of conduct, often implying a history of correction or conditioning.",
      "explanation_cn": "指经过训练而能遵循特定标准或行为准则，常暗示曾经历过纠正或行为塑造的过程。",
      "example_en": "The disciplined dog responded instantly to every command.",
      "example_cn": "这只经过严格训练的狗对每一个口令都能立即做出反应。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "strict",
      "analysis": "“Strict”（严格的）强调对规则、标准或要求的严格执行，常用于描述人或制度的外在约束力，但不一定包含内在的自我控制。而 “disciplined” 更强调个体主动遵守规则、自我约束的能力，是内在品质的体现。"
    },
    {
      "word_to_compare": "organized",
      "analysis": "“Organized”（有条理的）侧重于事物或行为的结构清晰、安排有序，如时间管理或物品摆放。它描述的是外在秩序，而 “disciplined” 更关注行为背后的意志力、持续性和自我控制，是驱动条理性的内在动力。"
    },
    {
      "word_to_compare": "controlled",
      "analysis": "“Controlled”（受控的）强调对情绪、反应或行为的抑制或管理，常用于描述暂时性的克制，如“controlled anger”。而 “disciplined” 是一种长期稳定的状态，体现的是习惯性、系统性的自我管理，具有更强的持续性和主动性。"
    }
  ]
}