{
  "word": "discharge",
  "pronunciation": "dis·chärj",
  "concise_definition": "v. 解雇, 释放, 排出, 履行; n. 解雇, 释放, 排出物,  discharged",
  "forms": {
    "third_person_singular": "discharges",
    "past_tense": "discharged",
    "past_participle": "discharged",
    "present_participle": "discharging"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To officially release someone from a position, obligation, or institution, such as a job, hospital, or military service.",
      "explanation_cn": "指正式解除某人的职位、义务或机构身份，如解雇、出院或退伍。",
      "example_en": "The hospital discharged the patient after a full recovery.",
      "example_cn": "病人完全康复后，医院准予出院。"
    },
    {
      "pos": "verb",
      "explanation_en": "To release or let out a substance, especially a liquid or gas, from a container or system.",
      "explanation_cn": "指从容器或系统中释放或排出某种物质，尤其是液体或气体。",
      "example_en": "The factory was fined for discharging toxic waste into the river.",
      "example_cn": "该工厂因将有毒废物排入河中而被罚款。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fulfill or perform a duty, responsibility, or function.",
      "explanation_cn": "指履行或完成一项职责、义务或功能。",
      "example_en": "She discharged her duties as a nurse with great compassion.",
      "example_cn": "她以极大的同情心履行了护士的职责。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of releasing or letting something out, especially a fluid, gas, or person from confinement.",
      "explanation_cn": "指释放或排出某物的行为，尤指液体、气体或被拘禁者的释放。",
      "example_en": "The discharge of pollutants into the air has decreased significantly this year.",
      "example_cn": "今年排入空气中的污染物排放量已显著减少。"
    },
    {
      "pos": "noun",
      "explanation_en": "The official release of a person from a hospital, military service, or employment.",
      "explanation_cn": "指某人从医院、军队或工作岗位上获得的正式释放或解除。",
      "example_en": "He received his discharge papers after completing two years of service.",
      "example_cn": "他在服役两年后收到了退伍证明。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "release",
      "analysis": "“Release” (释放) 是一个更广泛、更中性的词，可用于物理、情感或法律层面的释放，如释放囚犯、释放情绪。而 “discharge” 更常用于正式或制度性情境，如医院出院、军队退伍、排放污染物，带有更强的程序性和规范性含义。"
    },
    {
      "word_to_compare": "fire",
      "analysis": "“Fire” (解雇) 是 “discharge” 在职场语境中的口语化表达，语气更直接、情绪化，常含贬义；而 “discharge” 更正式，可中性或褒义，如因合同到期或表现优异而被解除职务。在法律或官方文件中，通常使用 “discharge” 而非 “fire”。"
    },
    {
      "word_to_compare": "emit",
      "analysis": "“Emit” (排放) 侧重于物理或化学过程中的释放，常用于气体、光、热等，强调来源的主动输出，多用于科学语境。而 “discharge” 不仅指排放，还包含制度性释放（如病人出院），语义范围更广，且常含负面后果（如污染）。"
    }
  ]
}