{
  "word": "discriminating",
  "pronunciation": "dih·skrim·uh·ney·ting",
  "concise_definition": "adj. 有辨别力的, 精明的, 挑剔的",
  "forms": {
    "comparative": "more discriminating",
    "superlative": "most discriminating"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having or showing good judgment in making distinctions, especially between things of high quality or subtle differences; able to appreciate fine details or nuances.",
      "explanation_cn": "具有或表现出在区分事物（尤其是高品质或细微差异）时的良好判断力；能够欣赏细节或微妙之处。",
      "example_en": "She is a discriminating art collector who only buys works from emerging avant-garde artists.",
      "example_cn": "她是一位有鉴赏力的艺术收藏家，只购买新兴前卫艺术家的作品。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Showing a high standard of taste or preference, often implying selectiveness and refusal to accept anything mediocre or inferior.",
      "explanation_cn": "表现出高标准的品味或偏好，通常暗示选择性严格，拒绝平庸或低劣之物。",
      "example_en": "His discriminating palate makes him a sought-after food critic.",
      "example_cn": "他挑剔的味蕾使他成为备受追捧的美食评论家。"
    },
    {
      "pos": "adjective",
      "explanation_en": "In a negative context, referring to the act of making unjust distinctions between people based on race, gender, or other characteristics (though this usage is rare and usually expressed as 'discriminatory').",
      "explanation_cn": "在负面语境中，指基于种族、性别或其他特征对人做出不公正的区分（但此用法罕见，通常用 'discriminatory' 表达）。",
      "example_en": "The policy was criticized as being subtly discriminating against minority applicants.",
      "example_cn": "该政策因对少数族裔申请者隐性歧视而受到批评。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "selective",
      "analysis": "“Selective”（有选择性的）强调基于标准进行挑选，但不一定包含审美或判断力的深度。例如，一个学校可能只录取高分学生，这是“selective”，但不一定是“discriminating”——后者隐含了对品质的敏锐识别能力。"
    },
    {
      "word_to_compare": "critical",
      "analysis": "“Critical”（批判性的）侧重于分析、评价甚至挑剔，常带有否定或审查意味。而 “discriminating” 更偏向积极的鉴赏力，强调欣赏与识别优质事物的能力，而非单纯批评。"
    },
    {
      "word_to_compare": "fastidious",
      "analysis": "“Fastidious”（一丝不苟的）强调对细节的极端关注和对不完美事物的厌恶，常带有一种神经质或苛刻的意味。而 “discriminating” 更中性或褒义，强调的是敏锐的判断力而非强迫症式的挑剔。"
    }
  ]
}