{
  "word": "disguise",
  "pronunciation": "dis·gahyz",
  "concise_definition": "n. 伪装, 假装; v. 伪装, 隐藏",
  "forms": {
    "third_person_singular": "disguises",
    "past_tense": "disguised",
    "past_participle": "disguised",
    "present_participle": "disguising"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An external appearance or costume adopted to conceal one's true identity or nature, often for deceptive purposes.",
      "explanation_cn": "指为掩盖真实身份或本性而采用的外部装扮或服饰，通常用于欺骗目的。",
      "example_en": "The spy wore a disguise of glasses and a fake beard to avoid detection.",
      "example_cn": "间谍戴上眼镜并留了假胡子作为伪装，以避免被发现。"
    },
    {
      "pos": "noun",
      "explanation_en": "A false or misleading representation of something, especially to hide its true character or purpose.",
      "explanation_cn": "指对某事物的虚假或误导性表现，尤其用于掩盖其真实性质或目的。",
      "example_en": "The company's charitable donations were a disguise for tax evasion.",
      "example_cn": "这家公司的慈善捐赠其实是逃税的伪装。"
    },
    {
      "pos": "verb",
      "explanation_en": "To change one's appearance or behavior in order to conceal one's true identity or intentions.",
      "explanation_cn": "指通过改变外貌或行为来隐藏真实身份或意图。",
      "example_en": "He disguised his voice over the phone to prevent them from recognizing him.",
      "example_cn": "他通过改变声音在电话中伪装自己，以免被认出来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To conceal or obscure the true nature, function, or meaning of something by presenting it in a different form.",
      "explanation_cn": "指通过以不同形式呈现来掩盖某事物的真实性质、功能或含义。",
      "example_en": "The politician disguised his harsh policy as a compassionate reform.",
      "example_cn": "这位政客将自己严苛的政策伪装成一项富有同情心的改革。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mask",
      "analysis": "“Mask” (面具/掩盖) 通常指物理上的遮盖物，如戴在脸上的面具，或比喻性地掩盖情绪或真相。它更强调表面的遮蔽，而 “disguise” 更全面，包含服装、行为、声音等多方面的伪装，常用于主动欺骗的语境。"
    },
    {
      "word_to_compare": "conceal",
      "analysis": "“Conceal” (隐藏) 是一个更广泛的词，泛指使某物不被看见或发现，不一定要改变外貌或形式。例如隐藏物品、秘密或情感。而 “disguise” 特指通过改变外观或表现来欺骗性地隐藏，强调伪装的手段。"
    },
    {
      "word_to_compare": "pretend",
      "analysis": "“Pretend” (假装) 指表现出并非真实的状态或情感，常用于心理或行为层面，如假装开心或不懂。它不一定涉及外在形象的改变，而 “disguise” 通常包含视觉或物理层面的伪装，更具体、更外显。"
    }
  ]
}