{
  "word": "dish",
  "pronunciation": "dish",
  "concise_definition": "n. 盘子, 菜肴, v. 上菜, 透露",
  "forms": {
    "plural": "dishes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A container, typically shallow and round, used for serving or eating food; often made of ceramic, glass, or metal.",
      "explanation_cn": "一种通常较浅且呈圆形的容器，用于盛放或食用食物，常由陶瓷、玻璃或金属制成。",
      "example_en": "She placed the lasagna on a large ceramic dish and brought it to the table.",
      "example_cn": "她把千层面放在一个大瓷盘里，端到了桌上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A prepared food item, especially one that is cooked and served as part of a meal; often refers to a specific recipe or culinary specialty.",
      "explanation_cn": "指经过烹制、作为一餐中一部分上桌的菜肴，常指某种特定的食谱或地方特色菜。",
      "example_en": "Italian cuisine offers many delicious dishes, such as risotto and tiramisu.",
      "example_cn": "意大利菜提供许多美味的菜肴，比如意大利调味饭和提拉米苏。"
    },
    {
      "pos": "verb",
      "explanation_en": "To serve food, especially in an informal or casual manner; often used in the phrase 'dishing out'.",
      "explanation_cn": "指上菜，尤指非正式或随意地分发食物；常用于短语 'dishing out'。",
      "example_en": "The waiter was dishing out portions of pasta to each guest.",
      "example_cn": "服务员正给每位客人分发意大利面。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reveal or gossip about private or confidential information, often in an informal or sensational way.",
      "explanation_cn": "指非正式或耸人听闻地透露私人或机密信息，常用于‘八卦’或‘爆料’的语境。",
      "example_en": "She couldn't resist dishing the latest gossip about the celebrity couple.",
      "example_cn": "她忍不住透露了这对名人夫妇的最新八卦。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "plate",
      "analysis": "“Plate”（盘子）通常指用于盛放食物的平坦器皿，更强调其物理形态和用途，多用于餐具语境，不用于指菜肴本身。而 “dish” 既可以指容器，也可以指其中的食物，语义范围更广。"
    },
    {
      "word_to_compare": "course",
      "analysis": "“Course”（一道菜）指正餐中按顺序上的一道菜，如前菜、主菜、甜点，强调的是用餐流程中的位置。而 “dish” 更侧重于具体的菜品内容，不涉及上菜顺序。"
    },
    {
      "word_to_compare": "reveal",
      "analysis": "“Reveal”（揭示）是中性或正式的动词，指使隐藏的信息变得可见，常用于严肃语境。而 “dish”（作动词）带有口语化、八卦甚至轻浮的色彩，多用于非正式场合中透露私人消息。"
    }
  ]
}