{
  "word": "dismiss",
  "pronunciation": "dis·mís",
  "concise_definition": "v. 解雇, 驱散, 不予考虑, 驳回",
  "forms": {
    "third_person_singular": "dismisses",
    "past_tense": "dismissed",
    "past_participle": "dismissed",
    "present_participle": "dismissing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To officially remove someone from a job or position, often due to poor performance, misconduct, or organizational changes.",
      "explanation_cn": "指因表现不佳、不当行为或组织调整等原因，正式解除某人的职务或职位。",
      "example_en": "The CEO was dismissed after the company's financial scandal came to light.",
      "example_cn": "公司在财务丑闻曝光后，首席执行官被解雇了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a group of people to leave, especially in an orderly or formal manner, such as ending a meeting or court session.",
      "explanation_cn": "指让一群人离开，通常以有秩序或正式的方式结束会议、庭审等场合。",
      "example_en": "The judge dismissed the jury until tomorrow morning.",
      "example_cn": "法官宣布休庭，陪审团明天早上再集合。"
    },
    {
      "pos": "verb",
      "explanation_en": "To refuse to consider or take seriously an idea, suggestion, or person, often because it is deemed unimportant or irrelevant.",
      "explanation_cn": "指因认为某想法、建议或人不重要或无关紧要而拒绝认真对待或忽视。",
      "example_en": "Don't dismiss her concerns—she has valid points about the safety protocol.",
      "example_cn": "不要忽视她的担忧，她对安全规程提出了合理的观点。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reject or terminate a legal case or claim, typically by a court or authority.",
      "explanation_cn": "指法院或权威机构驳回或终止一项法律案件或诉求。",
      "example_en": "The court dismissed the lawsuit for lack of evidence.",
      "example_cn": "法院因证据不足驳回了该诉讼。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fire",
      "analysis": "“Fire” (解雇) 是 “dismiss” 在职场语境中的非正式同义词，语气更直接、口语化，常带有情绪色彩。而 “dismiss” 更正式，可涵盖更广的语境，如法庭、会议等，且不一定带有负面情绪。"
    },
    {
      "word_to_compare": "ignore",
      "analysis": "“Ignore” (忽视) 指完全不注意或不理睬，通常出于主观选择，不涉及正式程序。而 “dismiss” 虽也有忽视之意，但常隐含一种权威性的判断——即经过评估后认为不值得考虑，带有决策性质。"
    },
    {
      "word_to_compare": "discharge",
      "analysis": "“Discharge” (解除职务) 常用于军事或医疗语境，指正式结束某人的职责或服务，有时是中性或正面的（如士兵退役）。而 “dismiss” 更常用于因过错或非自愿原因终止雇佣关系，负面含义更强。"
    }
  ]
}