{
  "word": "disney",
  "pronunciation": "diz·nee",
  "concise_definition": "n. 迪士尼（美国娱乐公司/品牌），adj. 迪士尼的",
  "forms": {
    "proper_noun": "Disney"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A multinational mass media and entertainment conglomerate founded by Walt Disney and Roy O. Disney in 1923, known for animated films, theme parks, television networks, and consumer products.",
      "explanation_cn": "由沃尔特·迪士尼和罗伊·O·迪士尼于1923年创立的跨国传媒与娱乐集团，以动画电影、主题公园、电视网络和消费品而闻名。",
      "example_en": "Disney has produced iconic films like The Lion King and Frozen.",
      "example_cn": "迪士尼制作了《狮子王》和《冰雪奇缘》等标志性影片。"
    },
    {
      "pos": "noun",
      "explanation_en": "A cultural symbol representing childhood nostalgia, fantasy, and family-friendly entertainment, often associated with magic, cartoon characters, and fairy tales.",
      "explanation_cn": "一种文化象征，代表童年的怀旧、幻想和家庭友好型娱乐，常与魔法、卡通角色和童话故事相关联。",
      "example_en": "For many children, visiting Disney World is a dream come true.",
      "example_cn": "对许多孩子来说，参观迪士尼乐园是梦想成真。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characteristic of the Walt Disney Company or its style, especially in animation, storytelling, or theme park design.",
      "explanation_cn": "与华特·迪士尼公司或其风格相关的，尤指在动画、叙事或主题公园设计方面具有迪士尼特色的。",
      "example_en": "The park has a classic Disney aesthetic with pastel colors and whimsical architecture.",
      "example_cn": "这个公园具有经典的迪士尼美学，采用柔和的色彩和梦幻般的建筑风格。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pixar",
      "analysis": "“Pixar”（皮克斯）是迪士尼旗下的动画工作室，专注于计算机生成的3D动画电影，风格更偏向现代科技感与情感深度，如《玩具总动员》《寻梦环游记》。而 “Disney” 传统上以手绘动画和经典童话改编著称，如《白雪公主》《小美人鱼》。两者虽同属迪士尼集团，但艺术风格与受众定位略有不同。"
    },
    {
      "word_to_compare": "universal",
      "analysis": "“Universal”（环球影城）是另一家大型娱乐公司，其主题公园和影视作品更侧重于真人电影IP（如《侏罗纪公园》《速度与激情》）和惊险刺激的游乐设施。相比之下，Disney 更强调家庭价值观、童话幻想与角色情感联结，整体氛围更温馨、纯净。"
    },
    {
      "word_to_compare": "dreamworks",
      "analysis": "“DreamWorks”（梦工厂）以幽默、反讽和成人化叙事风格著称，如《怪物史莱克》《驯龙高手》，常打破传统童话框架。而 Disney 通常遵循经典叙事结构，强调道德教化、善恶分明与圆满结局，更具传统与仪式感。"
    }
  ]
}