{
  "word": "displaced",
  "pronunciation": "dih·spleyst",
  "concise_definition": "adj. 被驱逐的, 被取代的, 被移置的",
  "forms": {
    "base_form": "displace",
    "past_tense": "displaced",
    "past_participle": "displaced",
    "present_participle": "displacing",
    "noun_form": "displacement"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Forced to leave one's home or usual place of residence, often due to war, natural disaster, or political upheaval; referring to people who have been uprooted from their communities.",
      "explanation_cn": "因战争、自然灾害或政治动荡而被迫离开家园或常住地的人，指那些被从社区中连根拔起的流离失所者。",
      "example_en": "The war created thousands of displaced persons who sought refuge in neighboring countries.",
      "example_cn": "这场战争造成了数千名流离失所者，他们前往邻国寻求庇护。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Replaced or pushed out of a position, role, or location by someone or something else; often used in economic or technological contexts.",
      "explanation_cn": "被他人或他物取代或挤出原有位置、角色或场所，常用于经济或技术语境中。",
      "example_en": "Automation has displaced many factory workers who once performed manual tasks.",
      "example_cn": "自动化取代了许多曾经从事手工操作的工厂工人。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Moved from its original or natural position, especially in a physical or spatial sense; often used in physics or archaeology.",
      "explanation_cn": "从其原始或自然位置被移动，尤其在物理或空间意义上使用，常见于物理学或考古学中。",
      "example_en": "The earthquake displaced several large boulders from their original resting places.",
      "example_cn": "地震将几块大石头从它们原本的 resting 位置移开了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "evicted",
      "analysis": "“Evicted”（被驱逐）特指因法律程序（如未付租金）被强制逐出住所，强调法律权威的执行，通常用于房东与租客关系。而 “displaced” 范围更广，可涵盖非法律原因（如战争、灾害）导致的被迫离开，不必然涉及产权纠纷。"
    },
    {
      "word_to_compare": "replaced",
      "analysis": "“Replaced”（被替代）强调一个事物被另一个事物完全取代，常用于物品、职位或功能，中性或技术性较强。而 “displaced” 更强调被‘挤出’或‘推离’原有位置的过程，带有被动性和失去感，常隐含负面情绪或结构性损失。"
    },
    {
      "word_to_compare": "uprooted",
      "analysis": "“Uprooted”（连根拔起）是 “displaced” 的强烈同义词，尤其用于描述人被强行从文化、社会或地理根源中剥离，带有强烈的情感和象征意义，常用于文学语境。而 “displaced” 更中性、更常用于官方或统计报告中，情感色彩较弱。"
    }
  ]
}