{
  "word": "displays",
  "pronunciation": "dih·spleyz",
  "concise_definition": "n. 展示, 展览, 显示; v. 展示, 表现, 显现",
  "forms": {
    "singular": "display",
    "third_person_singular": "displays",
    "past_tense": "displayed",
    "past_participle": "displayed",
    "present_participle": "displaying"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A public exhibition or arrangement of items, often for decorative, informational, or commercial purposes, designed to attract attention or convey a message.",
      "explanation_cn": "指为装饰、信息传递或商业目的而公开陈列或布置的物品，旨在吸引注意或传达某种信息。",
      "example_en": "The museum opened a new display of ancient Egyptian artifacts.",
      "example_cn": "博物馆推出了一个新的古埃及文物展览。"
    },
    {
      "pos": "noun",
      "explanation_en": "The visual presentation of information on a screen, such as on a computer, smartphone, or digital sign.",
      "explanation_cn": "指在屏幕（如电脑、智能手机或数字标牌）上呈现的信息视觉形式。",
      "example_en": "The temperature is shown on the digital display.",
      "example_cn": "温度显示在数字屏幕上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To show or exhibit something visibly, especially behavior, emotion, or qualities, often intentionally.",
      "explanation_cn": "指明显地展示或呈现某物，尤其是行为、情绪或品质，通常是出于有意为之。",
      "example_en": "She displayed remarkable courage during the emergency.",
      "example_cn": "她在紧急情况下表现出非凡的勇气。"
    },
    {
      "pos": "verb",
      "explanation_en": "To present or arrange items for public viewing, such as in a store window or at an exhibition.",
      "explanation_cn": "指为公众观看而陈列或布置物品，例如商店橱窗或展览中的展示。",
      "example_en": "The store displays its latest fashion line in the front window.",
      "example_cn": "这家商店在橱窗中陈列了最新的时尚系列。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "exhibit",
      "analysis": "“Exhibit” (展览/展出) 更常用于正式场合，如博物馆、画廊或学术环境中的作品展示，强调内容的权威性和文化价值。而 “display” 更广泛，可用于商业、日常或技术场景，强调视觉呈现和吸引力。"
    },
    {
      "word_to_compare": "demonstrate",
      "analysis": "“Demonstrate” (演示/证明) 强调通过行动或过程来说明或验证某种原理、功能或能力，具有教育性或说服性目的。而 “display” 更侧重于静态或表面的呈现，不必然包含解释或证明的过程。"
    },
    {
      "word_to_compare": "show",
      "analysis": "“Show” (展示) 是最通用的词，可用于口语和书面语，涵盖从简单地让某人看见到有目的地呈现的广泛含义。而 “display” 更正式，常暗示精心安排、引人注目或具有装饰性/功能性目的的展示。"
    }
  ]
}