{
  "word": "dispersal",
  "pronunciation": "dih·spur·zuhl",
  "concise_definition": "n. 分散, 散布, 传播",
  "forms": {
    "plural": "dispersals"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act or process of spreading or scattering something widely over an area or among a group, often to reduce concentration or promote wider distribution.",
      "explanation_cn": "指将某物广泛散布或分散到某一区域或群体中，通常是为了减少集中度或促进更广泛的分布。",
      "example_en": "The dispersal of seeds by wind is essential for the survival of many plant species.",
      "example_cn": "风力传播种子对许多植物物种的生存至关重要。"
    },
    {
      "pos": "noun",
      "explanation_en": "The movement of individuals or populations away from their original location, especially in biology, to reduce competition or find new resources.",
      "explanation_cn": "指个体或种群离开其原栖息地的移动，尤其在生物学中，用于减少竞争或寻找新的资源。",
      "example_en": "The dispersal of young lions from their pride helps prevent inbreeding and promotes genetic diversity.",
      "example_cn": "幼狮离开狮群有助于防止近亲繁殖并促进基因多样性。"
    },
    {
      "pos": "noun",
      "explanation_en": "The distribution of information, ideas, or influence across a wide area or population, often through communication or media.",
      "explanation_cn": "指信息、思想或影响力通过传播或媒体在广大区域或人群中扩散的过程。",
      "example_en": "The dispersal of misinformation on social media can have serious societal consequences.",
      "example_cn": "社交媒体上错误信息的传播可能带来严重的社会后果。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "distribution",
      "analysis": "“Distribution” (分布) 是一个更中性、更广泛的术语，泛指某物在空间或群体中的安排或分配方式，不强调过程或动机。而 “dispersal” 更侧重于从集中到分散的动态过程，常带有主动或自然扩散的含义，尤其在生态或社会语境中。"
    },
    {
      "word_to_compare": "scattering",
      "analysis": "“Scattering” (散开) 强调物理上随机或无序地抛洒、分散，常用于具体物体（如沙子、碎片），语气较随意或混乱。而 “dispersal” 更常用于系统性、有目的或自然规律驱动的扩散，如生物迁徙或信息传播，语义更正式、更结构化。"
    },
    {
      "word_to_compare": "migration",
      "analysis": "“Migration” (迁徙) 特指生物（尤其是动物或人类）为生存、繁殖或季节变化而进行的有方向、有规律的长距离移动。而 “dispersal” 可以是短距离、非周期性、无固定路线的扩散，范围更广，不局限于迁徙行为。"
    }
  ]
}