{
  "word": "dispatch",
  "pronunciation": "dih·spach",
  "concise_definition": "v. 派遣, 处理, 迅速完成; n. 急件, 电报, 派遣",
  "forms": {
    "third_person_singular": "dispatches",
    "past_tense": "dispatched",
    "past_participle": "dispatched",
    "present_participle": "dispatching"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To send someone or something off quickly for a specific purpose, especially in an official or urgent context.",
      "explanation_cn": "指迅速派遣某人或某物前往特定地点或执行特定任务，尤其用于官方或紧急情境。",
      "example_en": "The army dispatched a team of engineers to repair the bridge.",
      "example_cn": "军队派遣了一支工程师团队去修复桥梁。"
    },
    {
      "pos": "verb",
      "explanation_en": "To deal with or complete a task efficiently and promptly, often implying finality or decisiveness.",
      "explanation_cn": "指高效且迅速地处理或完成某项任务，常带有果断或彻底结束的意味。",
      "example_en": "She dispatched all her emails before lunch.",
      "example_cn": "她在午餐前迅速处理完了所有邮件。"
    },
    {
      "pos": "noun",
      "explanation_en": "An official message or report, especially one sent urgently by telegraph, radio, or digital means.",
      "explanation_cn": "指通过电报、无线电或数字方式紧急发送的官方消息或报告。",
      "example_en": "The journalist filed a dispatch from the war zone describing the latest developments.",
      "example_cn": "记者从战区发回了一篇急电，描述了最新进展。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of sending someone or something away, especially in an official or organized manner.",
      "explanation_cn": "指以官方或有组织的方式派遣某人或某物的行为。",
      "example_en": "The dispatch of relief supplies was delayed due to bad weather.",
      "example_cn": "由于恶劣天气，救援物资的派遣被推迟了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "send",
      "analysis": "“Send” (发送) 是一个通用词，泛指将人或物从一处转移到另一处，无速度或目的上的特殊含义。而 “dispatch” 强调快速、有目的、常具官方或紧急性质的派遣，语义更具体、更正式。"
    },
    {
      "word_to_compare": "delegate",
      "analysis": "“Delegate” (委派) 指将任务或权力授予他人执行，强调责任的转移，但不一定涉及物理移动。而 “dispatch” 更侧重于将人员或物品送往某地执行任务，强调行动的出发和送达。"
    },
    {
      "word_to_compare": "issue",
      "analysis": "“Issue” (发布/发放) 常用于官方发布文件、命令或物资，强调的是分发行为本身，不强调速度或目的地。而 “dispatch” 更强调行动的紧迫性和目标导向性，常用于军事、新闻或物流语境。"
    }
  ]
}