{
  "word": "displacement",
  "pronunciation": "dis·plās·mənt",
  "concise_definition": "n. 位移, 排斥, 替代, 移民",
  "forms": {
    "plural": "displacements"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of moving an object from its original position to another, especially in physics, measured as the straight-line distance and direction from the initial to the final point.",
      "explanation_cn": "指物体从原始位置移动到另一位置的行为，尤其在物理学中，指从初始点到终点的直线距离和方向。",
      "example_en": "The displacement of the car was 15 meters east after it turned the corner.",
      "example_cn": "汽车拐过弯后，其位移为向东15米。"
    },
    {
      "pos": "noun",
      "explanation_en": "The forced removal of people from their homes or communities, often due to conflict, natural disaster, or development projects.",
      "explanation_cn": "指因冲突、自然灾害或发展项目等原因，人们被迫离开家园或社区的现象。",
      "example_en": "The construction of the dam led to the displacement of over 20,000 villagers.",
      "example_cn": "大坝的建设导致超过两万名村民被迫迁移。"
    },
    {
      "pos": "noun",
      "explanation_en": "The substitution of one person, thing, or idea for another, often in psychology or economics, where an original desire or function is replaced by a less threatening or more acceptable one.",
      "explanation_cn": "指一个人、事物或观念被另一个所替代，常用于心理学或经济学中，指原始的欲望或功能被一个更少威胁或更可接受的替代物所取代。",
      "example_en": "In psychoanalysis, displacement is a defense mechanism where emotions are redirected from a threatening target to a safer one.",
      "example_cn": "在精神分析中，替代是一种防御机制，指情绪从一个具有威胁性的对象转移到一个更安全的对象上。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "migration",
      "analysis": "“Migration”（迁移）通常指人口为寻求更好生活条件而进行的自愿或长期性移动，如季节性迁徙或跨国移民。而 “displacement” 强调被迫性、非自愿性，常伴随暴力、灾难或政策强制，具有创伤性和临时性特征。"
    },
    {
      "word_to_compare": "movement",
      "analysis": "“Movement”（移动）是一个广义词，泛指任何位置变化，可以是自然、自愿或无目的的。而 “displacement” 更具体，通常指有明确起点和终点的物理位移，或社会结构中被强制替换的系统性变化，语义更精确且常含负面含义。"
    },
    {
      "word_to_compare": "substitution",
      "analysis": "“Substitution”（替代）是一个中性词，泛指用一个事物替换另一个，如替换零件或替换词语。而 “displacement” 在心理学或社会语境中带有深层结构变化的意味，常暗示被替代者被边缘化或压抑，情感和权力维度更强烈。"
    }
  ]
}