{
  "word": "dispute",
  "pronunciation": "dih·spyo͞ot",
  "concise_definition": "n. 争论, 争端, 争议; v. 争论, 质疑, 反对",
  "forms": {
    "third_person_singular": "disputes",
    "past_tense": "disputed",
    "past_participle": "disputed",
    "present_participle": "disputing",
    "plural": "disputes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A heated argument or disagreement, especially one involving opposing claims or rights, often leading to conflict or legal action.",
      "explanation_cn": "指涉及对立主张或权利的激烈争论或分歧，常导致冲突或法律诉讼。",
      "example_en": "The two companies are locked in a bitter dispute over patent ownership.",
      "example_cn": "两家公司正因专利所有权问题陷入激烈的争端。"
    },
    {
      "pos": "noun",
      "explanation_en": "A formal challenge or contest, especially in law or sports, where the validity of a claim or decision is questioned.",
      "explanation_cn": "指在法律或体育等领域中对某项主张或决定的正式质疑或挑战。",
      "example_en": "The athlete filed a dispute against the referee's ruling.",
      "example_cn": "这名运动员对裁判的判罚提出了正式申诉。"
    },
    {
      "pos": "verb",
      "explanation_en": "To argue against or challenge the truth, validity, or fairness of something, often publicly or formally.",
      "explanation_cn": "指公开或正式地反驳、质疑某事的真实性、有效性或公正性。",
      "example_en": "She disputed the claim that the project was over budget.",
      "example_cn": "她质疑了该项目超支的说法。"
    },
    {
      "pos": "verb",
      "explanation_en": "To engage in a disagreement or argument with someone, typically over a specific issue or matter.",
      "explanation_cn": "指与他人就某一具体问题发生争论或争执。",
      "example_en": "They disputed for hours about the best way to solve the problem.",
      "example_cn": "他们就解决问题的最佳方式争论了数小时。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "argument",
      "analysis": "“Argument” (争论) 是更通用的词，泛指任何表达不同意见的言语交锋，可以是理性讨论，也可以是情绪化争吵。而 “dispute” 更强调对立双方立场明确、常涉及权利、利益或规则，且往往更正式或激烈，甚至可能进入法律程序。"
    },
    {
      "word_to_compare": "quarrel",
      "analysis": "“Quarrel” (争吵) 通常指情绪化、非正式的口角，常带有个人恩怨或情绪爆发，缺乏理性基础。而 “dispute” 更侧重于围绕事实、规则或利益的理性对抗，即使激烈，也常保持一定克制和形式。"
    },
    {
      "word_to_compare": "controversy",
      "analysis": "“Controversy” (争议) 指广泛引起公众或群体分歧的议题，通常是长期的、公开的、涉及价值观或社会共识的争论。而 “dispute” 更聚焦于两个或多个具体主体之间的直接对抗，范围较小、更具体。"
    }
  ]
}