{
  "word": "disqualification",
  "pronunciation": "dis·kwol·uh·fih·key·shuhn",
  "concise_definition": "n. 取消资格, 剥夺资格, 不合格",
  "forms": {
    "plural": "disqualifications"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of officially removing someone's eligibility to participate in a competition, activity, or role due to violation of rules, ethical standards, or legal requirements.",
      "explanation_cn": "因违反规则、道德标准或法律要求，而正式取消某人参与竞赛、活动或担任职务的资格。",
      "example_en": "The athlete faced disqualification after testing positive for banned substances.",
      "example_cn": "该运动员因药检呈阳性而被取消参赛资格。"
    },
    {
      "pos": "noun",
      "explanation_en": "A condition or circumstance that renders someone unsuitable or ineligible for a particular position, task, or privilege.",
      "explanation_cn": "指某种状况或情形使某人不适合担任某一职位、执行某项任务或享有某种特权。",
      "example_en": "His prior conviction is a disqualification for holding public office.",
      "example_cn": "他之前的犯罪记录使他不具备担任公职的资格。"
    },
    {
      "pos": "noun",
      "explanation_en": "In computing or data processing, the rejection of a record, entry, or submission due to failure to meet specified criteria or formatting standards.",
      "explanation_cn": "在计算或数据处理中，因未达到指定标准或格式要求而被拒绝的记录、条目或提交内容。",
      "example_en": "The application was rejected due to disqualification: missing required fields.",
      "example_cn": "该申请因不合格被拒：缺少必填字段。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "exclusion",
      "analysis": "“Exclusion” (排除) 指将某人或某物从群体、范围或过程中移除，不一定涉及规则违规，可能是出于政策、安全或管理原因。而 “disqualification” 特指因违反既定标准或规则而导致的资格丧失，具有更强的规范性和惩罚性。"
    },
    {
      "word_to_compare": "invalidation",
      "analysis": "“Invalidation” (作废/无效化) 强调某事物（如合同、证书、投票）因法律或程序缺陷而失去效力，侧重于结果的无效性。而 “disqualification” 更侧重于对主体（人或参赛者）资格的剥夺，常用于竞技、选举或职业场景。"
    },
    {
      "word_to_compare": "ban",
      "analysis": "“Ban” (禁令) 是一种更广泛、更严厉的禁止措施，可能永久或长期禁止某人从事某项活动，通常由权威机构颁布。而 “disqualification” 通常是针对特定事件或竞赛的临时性处罚，且常伴随重新申请资格的可能性。"
    }
  ]
}