{
  "word": "disqualified",
  "pronunciation": "dis·kwol·uh·fahyd",
  "concise_definition": "v. 取消资格, 剥夺资格",
  "forms": {
    "base_form": "disqualify",
    "third_person_singular": "disqualifies",
    "past_tense": "disqualified",
    "past_participle": "disqualified",
    "present_participle": "disqualifying"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To officially remove someone's eligibility to participate in a competition, process, or role due to violation of rules, standards, or requirements.",
      "explanation_cn": "因违反规则、标准或要求，正式取消某人参与竞赛、程序或担任职务的资格。",
      "example_en": "The athlete was disqualified for using performance-enhancing drugs.",
      "example_cn": "该运动员因使用兴奋剂而被取消资格。"
    },
    {
      "pos": "verb",
      "explanation_en": "To render someone unfit or unsuitable for a particular position, task, or function, often due to conflict of interest, bias, or lack of competence.",
      "explanation_cn": "因利益冲突、偏见或缺乏能力等原因，使某人不适合担任某一职位、执行某项任务或履行某种职能。",
      "example_en": "The judge disqualified himself from the case due to a personal connection to the defendant.",
      "example_cn": "法官因与被告有私人关系而主动回避此案。"
    },
    {
      "pos": "verb",
      "explanation_en": "To invalidate or nullify something, such as a result, entry, or application, because it fails to meet required criteria.",
      "explanation_cn": "因未达到规定标准而使某项结果、参赛作品或申请无效。",
      "example_en": "His application was disqualified because he failed to submit the required documentation.",
      "example_cn": "他的申请因未提交所需文件而被作废。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "banned",
      "analysis": "“Banned” (禁止) 指完全禁止某人或某物参与、使用或存在，通常具有长期性或永久性，且多由权威机构强制执行。而 “disqualified” 更侧重于因违反特定规则而临时或具体地取消资格，通常仅限于某一事件或程序。"
    },
    {
      "word_to_compare": "excluded",
      "analysis": "“Excluded” (排除) 是一个更中性的词，泛指将某人或某物从群体、范围或活动中移除，原因可能是规则、偏好或客观条件，不一定涉及违规。而 “disqualified” 隐含了因不符合标准或违反规定而导致的负面后果。"
    },
    {
      "word_to_compare": "invalidated",
      "analysis": "“Invalidated” (使无效) 强调某事物因不符合法律、技术或形式要求而失去效力，常用于文件、合同或结果。而 “disqualified” 更常用于人或参赛者，强调资格的丧失，而非事物本身的失效。两者在语境中有时重叠，但主体不同。"
    }
  ]
}