{
  "word": "disrespect",
  "pronunciation": "dis·rih·spekt",
  "concise_definition": "n. 不尊重, 无礼; v. 不尊重, 藐视",
  "forms": {
    "third_person_singular": "disrespects",
    "past_tense": "disrespected",
    "past_participle": "disrespected",
    "present_participle": "disrespecting",
    "noun_form": "disrespect"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of showing lack of respect, courtesy, or consideration for someone or something, often through rude behavior, dismissive language, or disregard for authority or social norms.",
      "explanation_cn": "指对某人或某事物表现出缺乏尊重、礼貌或考虑的行为，通常通过粗鲁的言行、轻视态度或无视权威与社会规范来体现。",
      "example_en": "His loud interruptions during the meeting were seen as a clear act of disrespect.",
      "example_cn": "他在会议中大声打断别人，被视为明显的不尊重行为。"
    },
    {
      "pos": "verb",
      "explanation_en": "To treat someone or something with contempt or disregard, especially by failing to honor their status, feelings, or rights.",
      "explanation_cn": "以轻蔑或漠视的态度对待某人或某事物，尤其指未能尊重其地位、感受或权利。",
      "example_en": "She felt disrespected when her opinion was ignored by the team leader.",
      "example_cn": "当她的意见被团队领导忽视时，她感到被轻视了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To violate social or cultural norms of politeness and deference, often intentionally, in a way that undermines dignity or authority.",
      "explanation_cn": "故意违反社会或文化中的礼貌与敬重规范，从而削弱他人的尊严或权威。",
      "example_en": "Wearing hats indoors during the ceremony was considered disrespectful in that culture.",
      "example_cn": "在那个文化中，仪式期间戴帽子被视为不敬之举。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "insult",
      "analysis": "“Insult” (侮辱) 通常指明确、直接的言语或行为，旨在伤害对方的自尊或情感，具有更强的攻击性和主观恶意。而 “disrespect” 更广泛，可以是间接的、持续的漠视或不礼貌，不一定包含明确的攻击意图，但同样破坏了应有的尊重关系。"
    },
    {
      "word_to_compare": "contempt",
      "analysis": "“Contempt” (蔑视) 是一种深层的情感态度，指认为某人或某事物低劣、不值得尊重，常带有道德或阶级上的优越感。它更偏向内在心理状态；而 “disrespect” 是这种态度的外在表现，是可观察的行为或言语。"
    },
    {
      "word_to_compare": "rudeness",
      "analysis": "“Rudeness” (粗鲁) 强调违反基本社交礼仪，如插话、大声说话、不打招呼等，属于表面行为规范的缺失。而 “disrespect” 更深入，涉及对权威、身份或价值的否定，其后果往往更严重，可能引发关系破裂或权力冲突。"
    }
  ]
}