{
  "word": "disturbing",
  "pronunciation": "dih·stur·bing",
  "concise_definition": "adj. 令人不安的, 令人困扰的, 扰乱的",
  "forms": {
    "comparative": "more disturbing",
    "superlative": "most disturbing"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Causing feelings of unease, anxiety, or moral discomfort; something that disrupts one's sense of peace, normalcy, or emotional stability.",
      "explanation_cn": "引起不安、焦虑或道德上的不适感；扰乱人的平静感、正常感或情绪稳定的事物。",
      "example_en": "The documentary showed disturbing footage of animal cruelty in factory farms.",
      "example_cn": "这部纪录片展示了工厂化农场中令人不安的动物虐待画面。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Intrusive or interfering in a way that prevents normal functioning or concentration; often used to describe interruptions or behaviors that are unsettling.",
      "explanation_cn": "以干扰正常运作或注意力的方式侵入；常用于描述令人困扰的打断或行为。",
      "example_en": "His constant phone calls during the meeting were disturbing and unprofessional.",
      "example_cn": "他在会议期间不断打电话，令人困扰且不专业。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Evoking a sense of dread or horror, especially when describing content that is morally repugnant or psychologically unsettling.",
      "explanation_cn": "引发恐惧或恐怖感，尤其用于描述道德上令人憎恶或心理上令人不安的内容。",
      "example_en": "The novel contained disturbing themes of isolation and madness.",
      "example_cn": "这部小说包含了关于孤独与疯狂的令人不安的主题。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "upsetting",
      "analysis": "“Upsetting”（令人难过的）侧重于引发悲伤、失望或情绪低落，通常用于日常情境中的情感冲击，如坏消息或失望事件。而 “disturbing” 更强烈，常涉及道德、心理或视觉上的冲击，带有更深层的不安或恐惧感。"
    },
    {
      "word_to_compare": "alarming",
      "analysis": "“Alarming”（令人惊恐的）强调引发警觉或对危险的担忧，通常与潜在威胁或紧急情况相关。而 “disturbing” 不一定涉及危险，更多是心理或情感上的不适，可能没有直接威胁，但令人难以接受或挥之不去。"
    },
    {
      "word_to_compare": "unsettling",
      "analysis": "“Unsettling”（令人不安的）与 “disturbing” 非常接近，常可互换，但 “unsettling” 更偏向于模糊、微妙、难以言喻的不适感，如诡异的氛围或不合常理的现象；而 “disturbing” 更直接、更强烈，常用于明确令人反感或痛苦的内容。"
    }
  ]
}