{
  "word": "distributing",
  "pronunciation": "dih·struh·byoo·ting",
  "concise_definition": "v. 分发, 分配, 发行",
  "forms": {
    "base_form": "distribute",
    "third_person_singular": "distributes",
    "past_tense": "distributed",
    "past_participle": "distributed",
    "present_participle": "distributing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To divide and deliver goods, services, or information to multiple recipients or locations, often systematically or on a large scale.",
      "explanation_cn": "指将商品、服务或信息系统性地或大规模地分割并交付给多个接收者或地点。",
      "example_en": "The company is distributing free samples of the new snack to supermarkets nationwide.",
      "example_cn": "该公司正在向全国的超市分发新零食的免费样品。"
    },
    {
      "pos": "verb",
      "explanation_en": "To allocate resources, responsibilities, or tasks among individuals or groups in a fair or planned manner.",
      "explanation_cn": "指以公平或有计划的方式在个人或群体之间分配资源、责任或任务。",
      "example_en": "The teacher is distributing the exam papers to the students before the test.",
      "example_cn": "老师正在考试前将试卷分发给学生。"
    },
    {
      "pos": "verb",
      "explanation_en": "To release or make available content, such as movies, music, or software, to the public through various channels.",
      "explanation_cn": "指通过各种渠道向公众发布或提供内容，如电影、音乐或软件。",
      "example_en": "The film studio is distributing the new documentary on streaming platforms next month.",
      "example_cn": "这家电影公司下个月将在流媒体平台上发行这部新纪录片。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "delivering",
      "analysis": "“Delivering” (递送) 强调将物品或服务从一个地点运送到另一个地点，通常侧重于物流过程的终点环节，如快递、送货上门。而 “distributing” 更强调将物品或信息分发给多个接收者，过程更具系统性和广泛性，可能包含多个分发节点。"
    },
    {
      "word_to_compare": "allocating",
      "analysis": "“Allocating” (分配) 侧重于根据计划、需求或优先级将资源（如资金、时间、人力）指派给特定用途或对象，常用于抽象或管理语境。而 “distributing” 更强调物理或实际的分发行为，对象通常是可触达的实体或内容。"
    },
    {
      "word_to_compare": "issuing",
      "analysis": "“Issuing” (发布/颁发) 通常指官方或权威机构正式发布文件、证件、指令或货币，具有权威性和正式性，如政府发行债券、学校颁发证书。而 “distributing” 更中性，可适用于商业、日常或非正式场景，不必然带有权威色彩。"
    }
  ]
}