{
  "word": "distribution",
  "pronunciation": "dis·truh·byoo·shun",
  "concise_definition": "n. 分配, 分发, 分布, 发行",
  "forms": {
    "plural": "distributions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of giving out or delivering something, such as goods, resources, or information, to multiple recipients in a systematic or organized manner.",
      "explanation_cn": "指以系统或有组织的方式将物品、资源或信息分发给多个接收者的行为。",
      "example_en": "The charity organized a food distribution to help families affected by the flood.",
      "example_cn": "该慈善机构组织了一次食品分发，以帮助受洪水影响的家庭。"
    },
    {
      "pos": "noun",
      "explanation_en": "The way in which something is spread out or arranged over a particular area or among a group of people, often in terms of frequency, quantity, or probability.",
      "explanation_cn": "指某事物在特定区域或人群中如何分布，常用于描述频率、数量或概率的分布模式。",
      "example_en": "The distribution of wealth in the country remains highly unequal.",
      "example_cn": "该国的财富分配仍然严重不均。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process of releasing a product, especially movies, music, or software, to the public or market for sale or consumption.",
      "explanation_cn": "指将产品（尤其是电影、音乐或软件）推向公众或市场进行销售或消费的过程。",
      "example_en": "The film's distribution will begin in theaters next month and later on streaming platforms.",
      "example_cn": "这部电影的发行将于下月在影院开始，之后登陆流媒体平台。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "allocation",
      "analysis": "“Allocation” (分配) 强调根据计划、需求或优先级将资源分配给特定对象，常用于预算、人力或物资的正式分配，带有决策和规划色彩。而 “distribution” 更侧重于实际的传递或散布过程，不一定涉及优先级判断。"
    },
    {
      "word_to_compare": "dispersion",
      "analysis": "“Dispersion” (分散) 指事物在空间或群体中自然或无序地散开，常用于物理或统计语境，强调“扩散”或“离散”的状态。而 “distribution” 更中性，可指有序或无序的分布，且常用于社会、经济或商业语境。"
    },
    {
      "word_to_compare": "delivery",
      "analysis": "“Delivery” (递送) 通常指将具体物品从一个地点运送到另一个地点，强调物流和终点送达，常用于快递、订单等场景。而 “distribution” 范围更广，可涉及多个接收者和更复杂的分发网络，不一定有明确的起点-终点路径。"
    }
  ]
}