{
  "word": "distributions",
  "pronunciation": "dih·struh·byoo·shuhnz",
  "concise_definition": "n. 分配, 分发, 分布",
  "forms": {
    "singular": "distribution"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of dividing and delivering something (such as goods, resources, or information) among a group of people or locations according to a plan or system.",
      "explanation_cn": "指根据某种计划或系统，将物品、资源或信息等分发或分配给一群人或多个地点的行为。",
      "example_en": "The charity organized the distribution of food to families affected by the flood.",
      "example_cn": "该慈善机构组织向受洪水影响的家庭分发食物。"
    },
    {
      "pos": "noun",
      "explanation_en": "The way in which something is spread out or arranged across a range, especially in statistics, economics, or natural phenomena.",
      "explanation_cn": "指某事物在一定范围内如何分布或排列，尤其在统计学、经济学或自然现象中。",
      "example_en": "The normal distribution is a fundamental concept in probability theory.",
      "example_cn": "正态分布是概率论中的一个基本概念。"
    },
    {
      "pos": "noun",
      "explanation_en": "A company's method of delivering its products to retailers or end consumers, often involving logistics, warehouses, and transportation networks.",
      "explanation_cn": "指企业将其产品送达零售商或终端消费者的方式，通常涉及物流、仓库和运输网络。",
      "example_en": "The company improved its distribution network to reduce delivery times across the country.",
      "example_cn": "该公司改进了其分销网络，以缩短全国范围内的交货时间。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "allocation",
      "analysis": "“Allocation” (分配) 强调根据特定标准或优先级将资源分配给不同用途或主体，常用于预算、人力或时间的规划，具有较强的决策性和计划性。而 “distribution” 更侧重于实际的传递或散布过程，不一定涉及优先级判断。"
    },
    {
      "word_to_compare": "dispersion",
      "analysis": "“Dispersion” (分散) 通常用于描述事物在空间或群体中自然或随机地散开，强调“分散程度”或“离散性”，多用于物理、生态或统计语境。而 “distribution” 更中性，可指有组织的或无组织的分布，且常包含系统性安排的含义。"
    },
    {
      "word_to_compare": "delivery",
      "analysis": "“Delivery” (递送) 专指将物品或服务从一个地方送到另一个地方的最终环节，强调“终点交接”。而 “distribution” 是一个更广泛的过程，包括从中心仓库到多个终端点的整个链条，涵盖运输、仓储和分拣等环节。"
    }
  ]
}