{
  "word": "divert",
  "pronunciation": "dī-vûrt",
  "concise_definition": "v. 转移, 使偏离, 使 diversion",
  "forms": {
    "third_person_singular": "diverts",
    "past_tense": "diverted",
    "past_participle": "diverted",
    "present_participle": "diverting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To cause something or someone to change direction or course from its original path or purpose, often to achieve a different goal or avoid a problem.",
      "explanation_cn": "指使某物或某人偏离其原本的路径或目的，通常是为了达成另一个目标或避免问题。",
      "example_en": "The police diverted traffic away from the accident scene to prevent congestion.",
      "example_cn": "警察将交通引导至事故现场之外，以防止拥堵。"
    },
    {
      "pos": "verb",
      "explanation_en": "To distract someone’s attention from something serious or important by offering something more entertaining or appealing.",
      "explanation_cn": "指通过提供更有趣或吸引人的事物来转移某人对严肃或重要事情的注意力。",
      "example_en": "The politician tried to divert attention from the scandal by announcing a new holiday.",
      "example_cn": "这位政客试图通过宣布一个新的假期来转移人们对丑闻的注意力。"
    },
    {
      "pos": "verb",
      "explanation_en": "To redirect funds, resources, or responsibilities from one use or recipient to another, often unofficially or for a different purpose.",
      "explanation_cn": "指将资金、资源或责任从原定用途或接收方重新分配至其他用途，有时是未经正式批准的。",
      "example_en": "The company was accused of diverting public funds to private accounts.",
      "example_cn": "该公司被指控将公共资金转移到私人账户。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "distract",
      "analysis": "“Distract” (分散注意力) 侧重于使注意力从某事上移开，通常强调心理或认知层面的干扰，不一定涉及物理路径或资源的重新分配。而 “divert” 不仅可以指注意力的转移，还可用于物理路径、资金或责任的重新导向，语义范围更广。"
    },
    {
      "word_to_compare": "redirect",
      "analysis": "“Redirect” (重定向) 通常指有计划、正式地将方向、路线或资源转至另一个目标，语气中性或积极。而 “divert” 常带有临时性、非预期性，甚至隐含隐瞒或规避的意味，语义色彩更复杂。"
    },
    {
      "word_to_compare": "deflect",
      "analysis": "“Deflect” (使偏转) 多用于物理力的改变方向（如光线、子弹），或比喻性地指回避批评、责任，强调被动或反弹式的偏离。而 “divert” 更主动、有目的性，常涉及人为干预和策略性调整。"
    }
  ]
}