{
  "word": "dive",
  "pronunciation": "dahyv",
  "concise_definition": "v. 潜水, 跳水, 猛冲; n. 潜水, 跳水, 急降",
  "forms": {
    "third_person_singular": "dives",
    "past_tense": "dived",
    "past_participle": "dived",
    "present_participle": "diving"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To plunge headfirst into water, typically as a sport or for recreation, often with controlled body movement.",
      "explanation_cn": "指头朝下跃入水中，通常作为运动或娱乐活动，动作需有控制。",
      "example_en": "She performed a perfect dive from the ten-meter platform.",
      "example_cn": "她从十米跳台完成了一次完美的跳水动作。"
    },
    {
      "pos": "verb",
      "explanation_en": "To go underwater, especially using specialized equipment such as a scuba tank, to explore or observe marine life.",
      "explanation_cn": "指使用潜水设备（如水肺）潜入水下，以探索或观察海洋生物。",
      "example_en": "They dove to a depth of 30 meters to photograph coral reefs.",
      "example_cn": "他们潜到30米深的地方拍摄珊瑚礁。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move rapidly downward, especially in an aircraft or vehicle, often suddenly or dramatically.",
      "explanation_cn": "指（尤指飞机或车辆）突然或急剧地向下俯冲。",
      "example_en": "The plane dove sharply after the engine failed.",
      "example_cn": "引擎故障后，飞机急剧俯冲。"
    },
    {
      "pos": "verb",
      "explanation_en": "To plunge into an activity or task with great enthusiasm or energy.",
      "explanation_cn": "指以极大的热情或精力投入到某项活动或任务中。",
      "example_en": "He dove into his new job with remarkable energy.",
      "example_cn": "他以惊人的热情投入了新工作。"
    },
    {
      "pos": "noun",
      "explanation_en": "An act of diving into water, especially as a competitive sport or a deliberate jump.",
      "explanation_cn": "指跃入水中的动作，尤指作为竞技运动或有意识的跳跃。",
      "example_en": "The judge gave the diver a perfect score for her final dive.",
      "example_cn": "裁判对她的最后一次跳水给出了满分。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden downward movement, especially of an aircraft or stock market value.",
      "explanation_cn": "指突然的向下运动，尤指飞机的俯冲或股票价值的暴跌。",
      "example_en": "The stock market experienced a sharp dive after the announcement.",
      "example_cn": "公告发布后，股市出现了急剧下跌。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "plunge",
      "analysis": "“Plunge” (猛冲/投入) 强调突然、猛烈地进入某种状态或动作，常用于抽象语境（如 plunge into debt），而 “dive” 更常用于物理性的向下运动，尤其是水中或空中，且常带有技巧性或目的性。"
    },
    {
      "word_to_compare": "sink",
      "analysis": "“Sink” (下沉) 指因重力或失去浮力而自然地下沉，通常是被动的、缓慢的过程（如船沉没），而 “dive” 是主动的、有控制的向下动作，常伴随动力或意图。"
    },
    {
      "word_to_compare": "fall",
      "analysis": "“Fall” (落下) 是一个通用词，指任何向下的运动，通常无方向控制，可能由外力引起（如苹果从树上掉下）。“Dive” 则隐含主动控制、方向明确，常用于体育、航空或比喻性语境，更具目的性和技巧性。"
    }
  ]
}