{
  "word": "dives",
  "pronunciation": "dīvz",
  "concise_definition": "n. 跳水, 潜水; v. 跳水, 潜水（第三人称单数）",
  "forms": {
    "base_form": "dive",
    "third_person_singular": "dives",
    "past_tense": "dived",
    "past_participle": "dived",
    "present_participle": "diving"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An act of jumping or plunging headfirst into water, especially as a sport or performance, often involving acrobatic movements.",
      "explanation_cn": "指头朝下跳入水中，尤指作为一项体育运动或表演，通常包含杂技动作。",
      "example_en": "She executed a perfect triple somersault dive and scored a perfect ten.",
      "example_cn": "她完成了一个完美的三周翻腾跳水，获得了满分。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of descending underwater, typically using scuba gear or breath-holding, for exploration, recreation, or research.",
      "explanation_cn": "指使用潜水装备或屏气潜入水下，用于探索、娱乐或研究的行为。",
      "example_en": "The marine biologists went on a dive to study coral reefs off the coast.",
      "example_cn": "海洋生物学家进行了一次潜水，以研究近海的珊瑚礁。"
    },
    {
      "pos": "verb",
      "explanation_en": "To plunge or jump headfirst into water, especially from a height.",
      "explanation_cn": "指从高处头朝下跳入水中。",
      "example_en": "He dives off the high board every morning at the pool.",
      "example_cn": "他每天早上都在泳池的跳板上跳水。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move quickly downward, especially into water or a hidden place, often to avoid detection or danger.",
      "explanation_cn": "指迅速向下移动，尤其是进入水中或隐蔽处，常为躲避注意或危险。",
      "example_en": "The duck dives beneath the surface when it hears the boat approaching.",
      "example_cn": "当它听到船靠近时，鸭子迅速潜入水下。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "plunge",
      "analysis": "“Plunge”（猛冲/跳入）强调突然、猛烈地进入某种状态或介质，可用于水、情绪、经济等抽象或具体情境，但不特指跳水动作或水下活动。而 “dives” 更具体地指向水中的跳跃或潜入行为，常与体育或潜水相关。"
    },
    {
      "word_to_compare": "submerge",
      "analysis": "“Submerge”（淹没/潜入）指完全被液体覆盖或沉入水下，强调状态而非动作，且通常不包含跳跃或主动入水的含义。而 “dives” 强调主动的、有动力的入水动作，常伴随身体姿态控制。"
    },
    {
      "word_to_compare": "splash",
      "analysis": "“Splash”（溅水）指水花四溅的动作，通常轻快、无目的，常伴随落水但不强调入水深度或技巧。而 “dives” 是有控制、有目的的入水，追求精准、优雅或深度，常用于竞技或专业场景。"
    }
  ]
}