{
  "word": "diving",
  "pronunciation": "dahy·vihng",
  "concise_definition": "n. 跳水, 潜水; v. 跳水, 潜水 (diving 是 dive 的现在分词和动名词形式)",
  "forms": {
    "base_form": "dive",
    "third_person_singular": "dives",
    "past_tense": "dived",
    "past_participle": "dived",
    "present_participle": "diving"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The sport or activity of jumping or plunging headfirst into water, often performed with acrobatic maneuvers, especially in competitive contexts such as the Olympics.",
      "explanation_cn": "指头朝下跳入水中，常伴随体操式动作的运动或活动，尤其在奥运会等竞技场合中。",
      "example_en": "She won a gold medal in synchronized diving at the World Championships.",
      "example_cn": "她在世界锦标赛上赢得了双人跳水金牌。"
    },
    {
      "pos": "noun",
      "explanation_en": "The activity of swimming underwater using specialized equipment such as a scuba tank, typically for exploration, recreation, or research.",
      "explanation_cn": "指使用潜水装备（如氧气瓶）在水下游泳的活动，通常用于探索、休闲或科研。",
      "example_en": "Diving in the Great Barrier Reef revealed a stunning array of coral and tropical fish.",
      "example_cn": "在大堡礁潜水时，发现了令人惊叹的珊瑚和热带鱼类。"
    },
    {
      "pos": "verb",
      "explanation_en": "To plunge or jump headfirst into water, often from a height such as a diving board or cliff.",
      "explanation_cn": "指从跳板、悬崖等高处头朝下跳入水中。",
      "example_en": "He was diving from the ten-meter platform when he injured his shoulder.",
      "example_cn": "他从十米跳台跳水时伤到了肩膀。"
    },
    {
      "pos": "verb",
      "explanation_en": "To go underwater, especially using breathing apparatus, for a period of time.",
      "explanation_cn": "指使用呼吸装置潜入水下并停留一段时间。",
      "example_en": "They spent the afternoon diving among the shipwrecks off the coast.",
      "example_cn": "他们下午在海岸附近的沉船间潜水。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "swimming",
      "analysis": "“Swimming” (游泳) 是指在水中通过肢体动作推进身体，通常在水面或水下水平移动，强调持续的运动和耐力。而 “diving” 强调的是进入水中的动作或水下探索行为，不一定是持续的游动，更侧重于入水瞬间或水下停留。"
    },
    {
      "word_to_compare": "plunging",
      "analysis": "“Plunging” (猛冲/跳入) 是一个更通用的动词，指快速、突然地进入某物（如水、黑暗、混乱），不限于水或运动场景。而 “diving” 是特指进入水中的动作，且常带有技术性或体育性含义，如跳水或潜水。"
    },
    {
      "word_to_compare": "submerging",
      "analysis": "“Submerging” (淹没/浸没) 是一个更中性、物理性的术语，指任何物体完全被液体覆盖，不涉及主动行为或运动意图。而 “diving” 是一个主动的、有目的的行为，通常由人执行，带有探索、运动或表演的意图。"
    }
  ]
}