{
  "word": "divine",
  "pronunciation": "dih·vahyn",
  "concise_definition": "adj. 神圣的, 天赐的; n. 神职人员; v. 推断, 猜测",
  "forms": {
    "third_person_singular": "divines",
    "past_tense": "divined",
    "past_participle": "divined",
    "present_participle": "divining",
    "comparative": "more divine",
    "superlative": "most divine"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or coming from a god or deity; possessing qualities associated with the sacred or supernatural.",
      "explanation_cn": "与神或神灵相关，或源自神灵；具有神圣或超自然的特质。",
      "example_en": "The ancient temple was considered a divine place where gods communicated with humans.",
      "example_cn": "这座古庙被视为神圣之地，神灵在此与人类沟通。"
    },
    {
      "pos": "adjective",
      "explanation_en": "So excellent or beautiful as to seem beyond human capability; heavenly or sublime.",
      "explanation_cn": "卓越或美丽到超乎凡人能力，仿佛来自天堂或崇高无比。",
      "example_en": "Her voice was divine, filling the concert hall with an ethereal beauty.",
      "example_cn": "她的嗓音天籁般美妙，使音乐厅充满了空灵之美。"
    },
    {
      "pos": "noun",
      "explanation_en": "A clergyman or religious official, especially in historical or literary contexts.",
      "explanation_cn": "神职人员，尤用于历史或文学语境中。",
      "example_en": "The divine delivered a powerful sermon on forgiveness and redemption.",
      "example_cn": "这位神职人员发表了一篇关于宽恕与救赎的有力布道。"
    },
    {
      "pos": "verb",
      "explanation_en": "To deduce or perceive something by intuition or spiritual insight, especially when evidence is lacking.",
      "explanation_cn": "通过直觉或灵性洞察力推断出某事物，尤其在缺乏证据时。",
      "example_en": "She divined his true intentions from the subtle tone of his voice.",
      "example_cn": "她从他语气的细微变化中揣测出了他真正的意图。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sacred",
      "analysis": "“Sacred” (神圣的) 强调因宗教信仰或仪式而被赋予的庄严性与不可侵犯性，常用于指场所、物品或行为（如圣书、圣礼）。而 “divine” 更侧重于来源——直接来自神明，或具有神的属性，语义范围更广，可形容美、智慧等抽象特质。"
    },
    {
      "word_to_compare": "heavenly",
      "analysis": "“Heavenly” (天堂般的) 常用于形容感官体验的极致愉悦（如味道、音乐），带有浪漫或诗意色彩，多用于非宗教语境。而 “divine” 不仅可形容愉悦，还可用于道德、权威或超自然层面，语义更庄重、更具宗教或哲学深度。"
    },
    {
      "word_to_compare": "prophesy",
      "analysis": "“Prophesy” (预言) 指声称能预知未来，通常基于神启或灵性启示，是一个主动的宣告行为。而 “divine” 作为动词，强调的是通过直觉或灵性去“推断”或“领悟”已存在但未显明的事物，不一定是关于未来的预测，更偏向于洞察本质。"
    }
  ]
}