{
  "word": "divide",
  "pronunciation": "dih·vīd",
  "concise_definition": "v. 分割, 分开, 分配, 分歧; n. 分界线, 差距",
  "forms": {
    "third_person_singular": "divides",
    "past_tense": "divided",
    "past_participle": "divided",
    "present_participle": "dividing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To separate something into two or more parts, pieces, or groups, often by physical or logical means.",
      "explanation_cn": "指通过物理或逻辑手段将某物分成两个或多个部分、块或群体。",
      "example_en": "She divided the cake into eight equal slices.",
      "example_cn": "她把蛋糕分成了八等份。"
    },
    {
      "pos": "verb",
      "explanation_en": "To distribute something among several people or groups, typically according to a rule or proportion.",
      "explanation_cn": "指根据某种规则或比例将某物分配给若干人或群体。",
      "example_en": "The prize money was divided equally among the winners.",
      "example_cn": "奖金平均分给了所有获奖者。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a disagreement or rift between people or groups, leading to separation in opinion or loyalty.",
      "explanation_cn": "指在人或群体之间引发分歧、对立，导致意见或忠诚上的分裂。",
      "example_en": "The controversial policy divided the community into two opposing camps.",
      "example_cn": "这项有争议的政策使社区分裂成两个对立的阵营。"
    },
    {
      "pos": "noun",
      "explanation_en": "A natural or artificial boundary that separates two areas, groups, or concepts, often used in geography or politics.",
      "explanation_cn": "指分隔两个区域、群体或概念的自然或人为界限，常用于地理或政治语境。",
      "example_en": "The Continental Divide runs through the Rocky Mountains, separating watersheds that flow to the Pacific from those that flow to the Atlantic.",
      "example_cn": "大陆分水岭贯穿落基山脉，将流向太平洋的流域与流向大西洋的流域分隔开来。"
    },
    {
      "pos": "noun",
      "explanation_en": "A significant difference or gap between two groups, ideas, or social classes, often implying tension or inequality.",
      "explanation_cn": "指两个群体、观念或社会阶层之间显著的差异或鸿沟，常暗示紧张或不平等。",
      "example_en": "There is a growing divide between the rich and the poor in many countries.",
      "example_cn": "许多国家中，贫富之间的差距正在不断扩大。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "separate",
      "analysis": "“Separate” (分离) 强调使原本在一起的事物彼此脱离，但不一定意味着分成多个部分；它可以是空间、情感或功能上的隔离。而 “divide” 更强调将整体切割或分配成若干部分，具有更强的结构性和数量性含义。"
    },
    {
      "word_to_compare": "share",
      "analysis": "“Share” (分享) 指共同拥有或使用某物，通常带有合作或互利的意味；而 “divide” 则强调将整体拆分后各自占有，可能隐含竞争或分配的意味。两者在语义上常呈对立关系。"
    },
    {
      "word_to_compare": "distinguish",
      "analysis": "“Distinguish” (区分) 指识别或辨别不同事物之间的差异，强调认知层面的辨识，不涉及物理或数量上的分割。而 “divide” 是实际的划分行为，可能引发对立或结构变化。"
    }
  ]
}