{
  "word": "dizzy",
  "pronunciation": "diz·ee",
  "concise_definition": "adj. 头晕的, 眩晕的; 令人眩晕的",
  "forms": {
    "comparative": "dizzier",
    "superlative": "dizziest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Feeling a sensation of whirling or unsteadiness, often accompanied by lightheadedness or loss of balance, typically due to illness, fatigue, or rapid movement.",
      "explanation_cn": "感到旋转或不稳，常伴有头昏、眩晕或失去平衡，通常由疾病、疲劳或快速运动引起。",
      "example_en": "She felt dizzy after spinning around too many times.",
      "example_cn": "她转了太多圈后感到头晕。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Causing a feeling of confusion, disorientation, or overwhelming excitement; often used to describe something visually or emotionally overwhelming.",
      "explanation_cn": "引起混乱、迷失方向或极度兴奋的感觉；常用于描述在视觉或情感上令人眼花缭乱的事物。",
      "example_en": "The dazzling lights and loud music created a dizzying atmosphere at the concert.",
      "example_cn": "演唱会中耀眼的灯光和震耳欲聋的音乐营造出令人眩晕的氛围。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Slightly foolish or irrational in behavior or thought; often used informally to describe someone acting in a silly or imprudent way.",
      "explanation_cn": "行为或思想上略显愚蠢或非理性；常用于非正式语境中形容某人行为荒唐或鲁莽。",
      "example_en": "He made a dizzy decision to quit his job without another one lined up.",
      "example_cn": "他做出了一个鲁莽的决定：在没有找到下一份工作的情况下就辞职了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "lightheaded",
      "analysis": "“Lightheaded”（头昏）主要指因血压变化或缺氧导致的轻微头昏，强调身体上的失衡感，但通常不包含旋转感或精神混乱。而 “dizzy” 更强烈，常包含旋转、天旋地转的主观体验，适用范围更广，可涵盖生理和心理层面。"
    },
    {
      "word_to_compare": "confused",
      "analysis": "“Confused”（困惑的）侧重于思维不清、无法理解或判断，是认知层面的状态。而 “dizzy” 在描述精神状态时，更强调因感官刺激或情绪过载导致的短暂迷失，常带有身体反应（如眩晕），更具生理性和即时性。"
    },
    {
      "word_to_compare": "bewildering",
      "analysis": "“Bewildering”（令人困惑的）强调复杂性或信息过载导致的难以理解，多用于抽象情境（如规则、现象）。而 “dizzying” 更侧重于感官或情绪上的强烈冲击，如视觉、声音或兴奋感，常用于描述体验的强度而非逻辑的复杂性。"
    }
  ]
}