{
  "word": "do",
  "pronunciation": "doo",
  "concise_definition": "v. 做, 进行, 完成, 代替; n. 事情, 行为, 举动",
  "forms": {
    "third_person_singular": "does",
    "past_tense": "did",
    "past_participle": "done",
    "present_participle": "doing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To perform or carry out an action, task, or activity, often with a specific purpose or result in mind.",
      "explanation_cn": "指执行、完成某项行动、任务或活动，通常带有特定目的或预期结果。",
      "example_en": "She does yoga every morning to stay healthy.",
      "example_cn": "她每天早上做瑜伽以保持健康。"
    },
    {
      "pos": "verb",
      "explanation_en": "To serve as a substitute or replacement for another verb, especially in questions, negatives, or emphatic statements to avoid repetition.",
      "explanation_cn": "用作其他动词的替代词，尤其在疑问句、否定句或强调句中，以避免重复。",
      "example_en": "Do you like coffee? — Yes, I do.",
      "example_cn": "你喜欢咖啡吗？—— 是的，我喜欢。"
    },
    {
      "pos": "verb",
      "explanation_en": "To achieve a satisfactory or acceptable result in a particular situation or task.",
      "explanation_cn": "指在某种情况或任务中取得令人满意或可接受的结果。",
      "example_en": "This sandwich will do for lunch; I'm not hungry enough for a full meal.",
      "example_cn": "这个三明治当午餐就够了，我还没饿到要吃一顿正餐。"
    },
    {
      "pos": "verb",
      "explanation_en": "To engage in a social or ceremonial activity, often used in fixed expressions.",
      "explanation_cn": "指参与某种社交或仪式性活动，常用于固定搭配中。",
      "example_en": "They did the honors at the opening ceremony.",
      "example_cn": "他们在开幕式上担任了贵宾角色。"
    },
    {
      "pos": "noun",
      "explanation_en": "A thing, matter, or affair, often used in informal contexts to refer to a situation or event.",
      "explanation_cn": "指某件事、事务或情况，常用于非正式语境中表示某种事件或状况。",
      "example_en": "That's not my do — I didn't arrange it.",
      "example_cn": "那不是我的事——我没安排过。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "perform",
      "analysis": "“Perform” (执行/表演) 更强调正式、规范或技巧性的行为，常用于艺术表演、职责履行或技术操作，带有仪式感或专业性。而 “do” 更通用、口语化，适用于日常活动，不强调形式或技巧。"
    },
    {
      "word_to_compare": "carry out",
      "analysis": "“Carry out” (执行/实施) 通常指完成一项计划、命令或任务，强调过程的完整性和执行力，语义更正式、更具体。而 “do” 更宽泛，可泛指任何行为，甚至可替代其他动词，语义更模糊但更灵活。"
    },
    {
      "word_to_compare": "make",
      "analysis": "“Make” (制造/使) 强调创造、生产或导致某种结果，常与具体产物或状态搭配（如 make a cake, make someone happy）。而 “do” 更侧重于动作本身，不强调产物，常用于抽象行为（如 do homework, do business）。"
    }
  ]
}