{
  "word": "docks",
  "pronunciation": "doks",
  "concise_definition": "n. 码头, 船坞, 装载区; v. 扣减, 停 dock",
  "forms": {
    "singular": "dock"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A structure built along or projecting into a body of water for mooring ships, loading and unloading cargo, or allowing passengers to board and disembark.",
      "explanation_cn": "建在水体边缘或延伸入水中的结构，用于停泊船只、装卸货物或让乘客上下船。",
      "example_en": "The cruise ship arrived at the main dock just before sunset.",
      "example_cn": "游轮在日落前抵达了主码头。"
    },
    {
      "pos": "noun",
      "explanation_en": "A covered area in a warehouse or factory where trucks are loaded or unloaded, often with a level platform matching the truck bed.",
      "explanation_cn": "仓库或工厂内用于装卸卡车的封闭区域，通常设有与卡车车厢高度匹配的平台。",
      "example_en": "The delivery truck pulled into dock number three for unloading.",
      "example_cn": "送货卡车驶入三号装卸平台进行卸货。"
    },
    {
      "pos": "noun",
      "explanation_en": "A place where a computer peripheral, such as a laptop or smartphone, is connected to charge or synchronize data.",
      "explanation_cn": "用于连接电脑外设（如笔记本电脑或智能手机）进行充电或数据同步的接口装置或基座。",
      "example_en": "I use a docking station to connect my laptop to my monitor and keyboard.",
      "example_cn": "我使用一个扩展坞将笔记本电脑连接到显示器和键盘。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reduce someone's pay or privileges as a punishment, especially in a military or workplace context.",
      "explanation_cn": "作为惩罚，扣减某人的工资或特权，尤指在军队或工作场所中。",
      "example_en": "The officer was docked two days' pay for being late to duty.",
      "example_cn": "该军官因迟到被扣除了两天的工资。"
    },
    {
      "pos": "verb",
      "explanation_en": "To bring a ship into a dock or harbor for repair, maintenance, or loading.",
      "explanation_cn": "将船驶入码头或船坞进行维修、保养或装载。",
      "example_en": "The cargo ship was docked for three weeks while its engines were overhauled.",
      "example_cn": "这艘货轮在发动机大修期间停靠了三周。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pier",
      "analysis": "“Pier”（栈桥）通常是细长的、延伸入水的结构，主要用于休闲、钓鱼或小型船只停泊，不强调装卸功能；而 “dock” 更侧重于功能性，用于商业运输、货物装卸或大型船舶停靠。"
    },
    {
      "word_to_compare": "wharf",
      "analysis": "“Wharf”（码头）与 “dock” 常可互换，但 “wharf” 通常指沿岸建造的坚固平台，多用于货运；“dock” 更常指船舶停泊的具体位置，有时也指船坞（dry dock）。在美式英语中，“dock” 使用更广泛。"
    },
    {
      "word_to_compare": "charging port",
      "analysis": "“Charging port”（充电接口）仅指电子设备的物理连接点，功能单一；而 “dock” 在电子语境中不仅提供充电，还常集成数据传输、外接显示器、键盘等多种功能，是一个综合性的连接平台。"
    }
  ]
}