{
  "word": "documenting",
  "pronunciation": "dok·yuh·men·tihng",
  "concise_definition": "v. 记录, 文档化, 作书面证明",
  "forms": {
    "base_form": "document",
    "third_person_singular": "documents",
    "past_tense": "documented",
    "past_participle": "documented",
    "present_participle": "documenting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To systematically record information, events, or processes in written, visual, or digital form to preserve evidence, ensure transparency, or enable future reference.",
      "explanation_cn": "以书面、视觉或数字形式系统地记录信息、事件或过程，以保存证据、确保透明度或便于日后查阅。",
      "example_en": "The researchers were documenting every step of the experiment to ensure reproducibility.",
      "example_cn": "研究人员正在记录实验的每一步，以确保结果可重复。"
    },
    {
      "pos": "verb",
      "explanation_en": "To create a formal record or archive of something, especially in contexts such as law, history, or cultural preservation.",
      "explanation_cn": "为某事物创建正式的记录或档案，尤其在法律、历史或文化保护等语境中。",
      "example_en": "The NGO is documenting the destruction of indigenous lands to present to international courts.",
      "example_cn": "该非政府组织正在记录原住民土地被破坏的情况，以便提交给国际法庭。"
    },
    {
      "pos": "verb",
      "explanation_en": "To capture experiences, behaviors, or changes through media such as photography, video, or audio for artistic, educational, or investigative purposes.",
      "explanation_cn": "通过摄影、视频或音频等媒介捕捉经历、行为或变化，用于艺术、教育或调查目的。",
      "example_en": "She spent a year documenting the daily lives of street musicians in New Orleans.",
      "example_cn": "她花了一年时间记录新奥尔良街头音乐家的日常生活。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "recording",
      "analysis": "“Recording” (记录) 是一个更广泛、更中性的词，泛指任何形式的保存信息，包括口头、数字或物理记录，不一定具有系统性或正式性。而 “documenting” 强调有目的、结构化、可验证的书面或数字记录，常用于专业或法律语境。"
    },
    {
      "word_to_compare": "archiving",
      "analysis": "“Archiving” (归档) 指将已记录的信息长期保存和组织，侧重于存储和管理，而非记录过程本身。“Documenting” 是创建记录的行为，而 “archiving” 是后续的保存行为。两者常配合使用，但阶段不同。"
    },
    {
      "word_to_compare": "noting",
      "analysis": "“Noting” (记下) 通常指简短、非正式地记录要点，如笔记或备忘，信息量小且缺乏完整性。而 “documenting” 要求更全面、详细、结构化的信息呈现，常形成可被他人审查或引用的正式材料。"
    }
  ]
}