{
  "word": "documented",
  "pronunciation": "dok·yoo·men·tuhd",
  "concise_definition": "adj. 有文件记录的, 有证据支持的",
  "forms": {
    "base_form": "document",
    "adjective_form": "documented",
    "comparative": "more documented",
    "superlative": "most documented"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Supported by written records, official papers, or verifiable evidence; something that has been formally recorded or proven through documentation.",
      "explanation_cn": "由书面记录、官方文件或可验证的证据所支持的；指某事物已被正式记录或通过文件证明属实。",
      "example_en": "The scientist provided documented evidence of climate change from the past 50 years.",
      "example_cn": "这位科学家提供了过去50年气候变化的有文件记录的证据。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Referring to a process, system, or practice that is officially recorded and standardized, often for compliance, audit, or historical purposes.",
      "explanation_cn": "指某一过程、系统或做法已被正式记录并标准化，通常用于合规、审计或历史存档目的。",
      "example_en": "Only documented procedures are allowed in this manufacturing facility to ensure quality control.",
      "example_cn": "为确保质量控制，该制造工厂仅允许使用有文件记录的程序。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used to describe knowledge, skills, or experiences that are officially recognized and recorded, often in professional or academic contexts.",
      "explanation_cn": "用于描述在专业或学术背景下被正式认可并记录的知识、技能或经验。",
      "example_en": "She has a documented history of leadership roles in nonprofit organizations.",
      "example_cn": "她拥有在非营利组织中担任领导职务的正式记录。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "recorded",
      "analysis": "“Recorded”（被记录的）泛指任何信息被保存下来，无论是否正式或用于证明。它可以是口头录音、笔记或临时记录。而 “documented” 强调正式、系统、可验证的书面或官方记录，具有更强的权威性和法律/专业效力。"
    },
    {
      "word_to_compare": "verified",
      "analysis": "“Verified”（经核实的）强调信息已被确认为真实或准确，但不一定通过书面文件实现（如通过实验、测试或第三方确认）。而 “documented” 强调信息是通过文件形式留存的，即使尚未被核实，也可能被称为 documented。两者常共存：documented evidence is often verified. "
    },
    {
      "word_to_compare": "evidenced",
      "analysis": "“Evidenced”（有证据的）是动词 evidence 的过去分词，用作形容词时较罕见，且更侧重于“存在某种证据”，但不强调证据是否以书面形式存在。而 “documented” 明确指证据是书面或档案形式的，更具结构性和可追溯性。"
    }
  ]
}