{
  "word": "dodge",
  "pronunciation": "dahj",
  "concise_definition": "v. 闪避, 逃避; n. 闪避, 诡计",
  "forms": {
    "third_person_singular": "dodges",
    "past_tense": "dodged",
    "past_participle": "dodged",
    "present_participle": "dodging"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move quickly out of the way to avoid being hit, touched, or caught by something, especially in a physical context such as sports or danger.",
      "explanation_cn": "指迅速移动身体以避开击打、触碰或捕捉，尤其用于体育运动或危险情境中的身体回避动作。",
      "example_en": "The soccer player dodged the defender and scored a goal.",
      "example_cn": "这名足球运动员闪避了防守球员，射门得分。"
    },
    {
      "pos": "verb",
      "explanation_en": "To avoid or evade something unpleasant, difficult, or responsibility, often through cleverness, deception, or indirect means.",
      "explanation_cn": "指通过机智、欺骗或间接手段逃避不愉快、困难或责任，常用于抽象情境。",
      "example_en": "He dodged the question by changing the subject.",
      "example_cn": "他通过转移话题来回避这个问题。"
    },
    {
      "pos": "noun",
      "explanation_en": "A quick, evasive movement made to avoid something, especially in sports or combat.",
      "explanation_cn": "指为避开某物而做出的迅速闪避动作，尤用于体育或格斗场景。",
      "example_en": "He made a brilliant dodge to escape the tackle.",
      "example_cn": "他一个精彩的闪避躲过了擒抱。"
    },
    {
      "pos": "noun",
      "explanation_en": "A clever or deceptive trick used to avoid an obligation, answer, or consequence.",
      "explanation_cn": "指一种用于逃避义务、回答或后果的机智或欺骗性手段。",
      "example_en": "His excuse was just a dodge to avoid paying the fine.",
      "example_cn": "他的借口不过是想逃避罚款的诡计。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "avoid",
      "analysis": "“Avoid” (避免) 是一个更广泛、更中性的词，泛指任何方式的避开，可以是主动的或被动的，不强调动作的敏捷性或技巧性。而 “dodge” 更强调通过快速、灵活的身体或言语动作来避开，常带有主动性和技巧性，有时甚至隐含狡猾的意味。"
    },
    {
      "word_to_compare": "evade",
      "analysis": "“Evade” (逃避) 与 “dodge” 在抽象意义上相近，都指逃避责任或问题，但 “evade” 更正式、更常用于法律或道德语境，如逃避税收或法律制裁，语气更严肃；而 “dodge” 更口语化，常用于日常对话，语气较轻，有时带调侃意味。"
    },
    {
      "word_to_compare": "sidestep",
      "analysis": "“Sidestep” (侧身避开) 与 “dodge” 在动作上相似，都指横向移动以避开，但 “sidestep” 更强调方向性（侧向），常用于比喻义，如回避敏感话题，语气较温和；而 “dodge” 动作更突然、更全面，可向任何方向，且在比喻义中更常暗示故意欺骗或耍花招。"
    }
  ]
}