{
  "word": "dogs",
  "pronunciation": "dawgz",
  "concise_definition": "n. 狗, 犬; (复数形式) 指多只狗，也可引申为卑劣的人、忠实的追随者等",
  "forms": {
    "singular": "dog"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A domesticated carnivorous mammal (Canis lupus familiaris), typically kept as a pet or for work such as hunting, herding, or protection.",
      "explanation_cn": "一种被驯化的食肉哺乳动物（Canis lupus familiaris），通常作为宠物饲养，或用于狩猎、放牧、看护等工作。",
      "example_en": "My dog barks every time someone knocks on the door.",
      "example_cn": "每当我家门被敲响时，我的狗都会叫。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person regarded as untrustworthy, despicable, or contemptible, often used in informal or derogatory contexts.",
      "explanation_cn": "指被认为不可信、卑劣或可鄙的人，常用于非正式或贬义语境中。",
      "example_en": "He’s a real dog for breaking his promise like that.",
      "example_cn": "他那样违背诺言，真是个卑鄙小人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A loyal follower or subordinate, especially one who is overly devoted to a person or cause.",
      "explanation_cn": "指对某人或某事业极度忠诚的追随者或下属，有时带有贬义。",
      "example_en": "The politician had a group of loyal dogs who defended him at every rally.",
      "example_cn": "这位政客有一群忠实的追随者，在每次集会上都为他辩护。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slang term for a person who is unattractive or socially awkward, often used humorously or self-deprecatingly.",
      "explanation_cn": "俚语，指相貌不佳或社交笨拙的人，常用于幽默或自嘲的语境。",
      "example_en": "I showed up to the party in pajamas—I’m such a dog tonight.",
      "example_cn": "我穿着睡衣去参加派对了——今晚我真是个丑八怪。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "canine",
      "analysis": "“Canine” (犬类的) 是一个更正式、科学的术语，通常用于生物学或医学语境中，指犬科动物或与狗相关的特征。而 “dog” 是日常通用词，涵盖情感、文化及俚语用法，语义范围更广。"
    },
    {
      "word_to_compare": "puppy",
      "analysis": "“Puppy” (小狗) 特指幼年的狗，强调年龄和发育阶段，带有可爱、稚嫩的语义色彩。而 “dog” 可指任何年龄的狗，包括成年犬，语义更中性、广泛。"
    },
    {
      "word_to_compare": "hound",
      "analysis": "“Hound” (猎犬) 通常特指用于狩猎的犬种，带有传统、文学或历史色彩，有时也用于比喻执着追踪的人。而 “dog” 是通用词，不特指用途，适用范围更广。"
    }
  ]
}