{
  "word": "doing",
  "pronunciation": "doo·ing",
  "concise_definition": "n. 行为, 活动, 事情; v. 做, 进行, 处理 (do 的现在分词)",
  "forms": {
    "base_form": "do",
    "third_person_singular": "does",
    "past_tense": "did",
    "past_participle": "done",
    "present_participle": "doing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A specific activity, action, or event, often used in informal contexts to refer to what is happening or what people are engaged in.",
      "explanation_cn": "指具体的活动、行为或事件，常用于非正式语境中表示正在发生的事情或人们所从事的活动。",
      "example_en": "There's been a lot of doing around here since the festival started.",
      "example_cn": "自从节日开始以来，这里就热闹非凡。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person's behavior or conduct, especially when judged as good, bad, or noteworthy.",
      "explanation_cn": "指一个人的行为或举止，尤其当其被评价为良好、恶劣或值得注意时。",
      "example_en": "His doing in the meeting was highly unprofessional.",
      "example_cn": "他在会议中的表现极不专业。"
    },
    {
      "pos": "verb",
      "explanation_en": "To perform or carry out an action, task, or function; to engage in an activity.",
      "explanation_cn": "指执行、完成一项行动、任务或功能；参与某项活动。",
      "example_en": "She is doing her homework right now.",
      "example_cn": "她现在正在做作业。"
    },
    {
      "pos": "verb",
      "explanation_en": "To manage, handle, or cope with a situation or responsibility.",
      "explanation_cn": "指处理、应对或应付某种情况或责任。",
      "example_en": "How are you doing with your new job?",
      "example_cn": "你新工作进展得怎么样？"
    },
    {
      "pos": "verb",
      "explanation_en": "To serve as a substitute or replacement for something else, often in casual or idiomatic expressions.",
      "explanation_cn": "在口语或习语中用作替代或代替其他事物。",
      "example_en": "This shirt will do for the party.",
      "example_cn": "这件衬衫用来参加聚会就够了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "activity",
      "analysis": "“Activity” (活动) 是一个更正式、更广泛的术语，泛指任何有目的的行为或过程，常用于科学、教育或管理语境中。而 “doing” 更口语化，常指具体、零散或临时的行为，有时带有主观评价色彩。"
    },
    {
      "word_to_compare": "action",
      "analysis": "“Action” (行动) 强调有明确意图、目标或结果的物理或心理行为，通常具有更强的动态性和决定性。而 “doing” 更中性，可指任何行为，包括重复性、无意识或日常事务，范围更广但力度更弱。"
    },
    {
      "word_to_compare": "task",
      "analysis": "“Task” (任务) 指被分配或需要完成的具体工作，通常有明确的边界和要求。而 “doing” 可以是任意行为，不一定有结构或目标，甚至可以是闲逛或无目的的活动。"
    }
  ]
}