{
  "word": "dominance",
  "pronunciation": "dohm·uh·nuhns",
  "concise_definition": "n. 支配, 主导, 优势",
  "forms": {
    "plural": "dominances"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The state or condition of being dominant; having control, power, or influence over others, especially in a social, political, or biological context.",
      "explanation_cn": "处于主导地位的状态或条件；在社会、政治或生物环境中对他人拥有控制力、权力或影响力。",
      "example_en": "The company's dominance in the smartphone market has allowed it to set industry standards.",
      "example_cn": "该公司在智能手机市场的主导地位使其能够制定行业标准。"
    },
    {
      "pos": "noun",
      "explanation_en": "A superior position or advantage in a particular area, such as in behavior, performance, or physical traits, often observed in animals or competitive systems.",
      "explanation_cn": "在特定领域（如行为、表现或生理特征）中的优越地位或优势，常用于描述动物或竞争系统中的情况。",
      "example_en": "The alpha wolf's dominance is maintained through body language and vocalizations.",
      "example_cn": "头狼通过肢体语言和叫声维持其主导地位。"
    },
    {
      "pos": "noun",
      "explanation_en": "The prevalence or prominence of a particular idea, style, or system over others, often to the exclusion or suppression of alternatives.",
      "explanation_cn": "某种思想、风格或体系相对于其他事物的普遍性或突出性，常以排斥或压制其他选择为代价。",
      "example_en": "The dominance of English as a global language has reshaped education systems worldwide.",
      "example_cn": "英语作为全球语言的主导地位重塑了世界各地的教育体系。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "control",
      "analysis": "“Control” (控制) 强调直接的管理、操纵或约束能力，通常是主动行使权力的行为，可作动词或名词。而 “dominance” 更侧重于一种结构性或长期性的优势地位，不一定需要持续的干预。例如，你可以控制一台机器，但一个物种在生态系统中占据主导地位是通过进化和适应实现的。"
    },
    {
      "word_to_compare": "authority",
      "analysis": "“Authority” (权威) 指基于法律、职位、知识或道德而被认可的正当权力，强调合法性与被接受性。而 “dominance” 可以是通过力量、资源或影响力获得的，未必合法或被他人认同。例如，一个独裁者可能拥有主导地位，但未必拥有权威。"
    },
    {
      "word_to_compare": "supremacy",
      "analysis": "“Supremacy” (至高无上) 比 “dominance” 更极端，意味着绝对的、无与伦比的最高地位，常带有排他性和终极性，多用于政治、宗教或哲学语境。例如，‘national supremacy’ 暗示完全凌驾于其他实体之上；而 ‘dominance’ 可以是相对的、可被挑战的。"
    }
  ]
}