{
  "word": "doors",
  "pronunciation": "dɔrz",
  "concise_definition": "n. 门, 门扇, 通道, 机会",
  "forms": {
    "singular": "door"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A hinged or sliding barrier that allows entry to or exit from a room, building, or vehicle, typically made of wood, glass, or metal.",
      "explanation_cn": "一种铰链式或滑动式的屏障，用于进入或离开房间、建筑物或车辆，通常由木材、玻璃或金属制成。",
      "example_en": "She closed the door quietly so as not to wake the baby.",
      "example_cn": "她轻轻关上门，以免吵醒婴儿。"
    },
    {
      "pos": "noun",
      "explanation_en": "A means of access or opportunity to something, often used metaphorically to describe possibilities or pathways to success.",
      "explanation_cn": "指通往某事物的途径或机会，常用于比喻意义上，表示通往成功或可能性的通道。",
      "example_en": "Getting an internship at that company could open doors for your future career.",
      "example_cn": "在那家公司获得实习机会可能会为你的未来职业打开大门。"
    },
    {
      "pos": "noun",
      "explanation_en": "A part of a vehicle or structure that can be opened to allow passage, such as the doors of a car, train, or airplane.",
      "explanation_cn": "指车辆或结构中可开启以供通行的部分，如汽车、火车或飞机的门。",
      "example_en": "The train doors opened automatically as the train came to a stop.",
      "example_cn": "火车停稳后，车门自动打开。"
    },
    {
      "pos": "noun",
      "explanation_en": "A metaphorical reference to a place or institution that provides access to a particular group or system, such as 'the doors of Parliament' or 'the doors of justice'.",
      "explanation_cn": "比喻性地指代提供进入某个群体或体系通道的地方或机构，如‘议会的大门’或‘正义之门’。",
      "example_en": "The law is meant to keep the doors of justice open to everyone, regardless of wealth.",
      "example_cn": "法律旨在确保每个人，无论贫富，都能进入正义之门。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "gateway",
      "analysis": "“Gateway”（门户/入口）强调作为进入更广阔区域或系统的起点，常用于抽象或象征性语境，如‘互联网的门户’或‘通往知识的门户’。而 ‘door’ 更具体，通常指物理实体，也可用于比喻，但语义范围更窄、更日常。"
    },
    {
      "word_to_compare": "entrance",
      "analysis": "“Entrance”（入口）侧重于进入的动作或地点，常用于建筑或空间的正式入口，如‘酒店的入口’。它不强调可开关的结构，而 ‘door’ 则明确指可开合的物理装置。‘Entrance’ 更抽象，‘door’ 更具体。"
    },
    {
      "word_to_compare": "portal",
      "analysis": "“Portal”（门户）多用于科技、奇幻或象征性语境，指连接两个空间或维度的通道，如‘数字门户’或‘魔法传送门’。它比 ‘door’ 更具神秘感和宏大感，而 ‘door’ 是日常生活中最普遍的物理门具。"
    }
  ]
}