{
  "word": "dora",
  "pronunciation": "doh·ruh",
  "concise_definition": "n. (专有名词) 多拉（常见于人名、地名或虚构角色名）",
  "forms": {
    "plural": "doras"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A proper noun commonly used as a given name, particularly in Spanish- and Portuguese-speaking cultures, often derived from the name 'Dorotea' or 'Dorothea', meaning 'gift of God'.",
      "explanation_cn": "一个常用作人名的专有名词，尤其在西班牙语和葡萄牙语文化中，通常源自 'Dorotea' 或 'Dorothea'，意为‘上帝的礼物’。",
      "example_en": "Dora the Explorer is a popular children's television character who goes on adventures in Latin America.",
      "example_cn": "《爱探险的朵拉》是一个广受欢迎的儿童电视角色，她在拉丁美洲展开冒险。"
    },
    {
      "pos": "noun",
      "explanation_en": "A proper noun used as a place name in various regions, such as Dora, Alabama, a small unincorporated community in the United States.",
      "explanation_cn": "用作地名的专有名词，例如美国阿拉巴马州的一个小型非建制社区——多拉（Dora）。",
      "example_en": "The train stopped at Dora, a quiet town with only a few hundred residents.",
      "example_cn": "火车在多拉停靠，这是一个只有几百名居民的宁静小镇。"
    },
    {
      "pos": "noun",
      "explanation_en": "A fictional or artistic name used in literature, film, or games to evoke a sense of whimsy, nostalgia, or cultural identity.",
      "explanation_cn": "在文学、电影或游戏中使用的虚构或艺术化名称，用以唤起奇幻感、怀旧情绪或文化认同。",
      "example_en": "In the fantasy novel, the heroine Dora wielded a staff carved with ancient runes.",
      "example_cn": "在这部奇幻小说中，女主角多拉挥舞着一根刻有古老符文的法杖。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "Dorothy",
      "analysis": "“Dorothy” 是 “Dora” 的完整形式，源自希腊语 Δωροθέα（Dōrothea），意为“上帝的礼物”。两者共享词源，但 “Dorothy” 更正式、更完整，常用于20世纪早期的英语名字；而 “Dora” 是其昵称或简化形式，更轻快、现代，常用于儿童或流行文化角色。"
    },
    {
      "word_to_compare": "Doraemon",
      "analysis": "“Doraemon” 是日本动漫中的虚构机器人猫角色，其名字中的 “Dora” 并非源自人名，而是取自日语 ‘どら’（dora），意为‘铜锣’，因他常从四次元口袋中拿出铜锣形状的道具。虽然拼写相似，但语义和文化背景完全不同，不能与作为人名的 ‘Dora’ 混淆。"
    },
    {
      "word_to_compare": "Dora Maar",
      "analysis": "“Dora Maar” 是法国摄影师与画家的名字，她是毕加索的缪斯之一。此处的 ‘Dora’ 是真实历史人物的本名，体现了其作为人名的文化真实性。与虚构角色（如 Dora the Explorer）相比，它承载了艺术史与个人身份的重量，而非娱乐化符号。"
    }
  ]
}