{
  "word": "dorian",
  "pronunciation": "dohr·ee·ən",
  "concise_definition": "adj. 多里安的；n. 多里安调式，多里安人",
  "forms": {
    "plural": "dorians"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to the ancient Dorians, a Greek tribe known for their austere and martial culture, or to the architectural and artistic styles associated with them.",
      "explanation_cn": "与古希腊多里安人相关的，该部落以简朴、尚武的文化著称；也指与之相关的建筑和艺术风格。",
      "example_en": "The temple's design reflects the simple, sturdy lines of Doric architecture.",
      "example_cn": "这座神庙的设计体现了多里安建筑简洁坚固的线条风格。"
    },
    {
      "pos": "noun",
      "explanation_en": "A member of the ancient Dorians, one of the major tribal groups of ancient Greece, traditionally associated with the Peloponnese region.",
      "explanation_cn": "古希腊多里安人的一员，是古希腊主要部落之一，传统上与伯罗奔尼撒地区相关。",
      "example_en": "The Dorians migrated southward after the collapse of the Mycenaean civilization.",
      "example_cn": "迈锡尼文明崩溃后，多里安人向南迁移。"
    },
    {
      "pos": "noun",
      "explanation_en": "A musical mode in Western music theory, characterized by a natural minor scale with a raised sixth degree, often described as melancholic yet uplifting.",
      "explanation_cn": "西方音乐理论中的一种调式，其特征是自然小调音阶但第六音升高，常被描述为忧郁而振奋。",
      "example_en": "Miles Davis's 'So What' is a famous jazz piece in the Dorian mode.",
      "example_cn": "迈尔斯·戴维斯的《So What》是一首著名的多里安调式爵士乐曲。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ionic",
      "analysis": "“Ionic”（爱奥尼亚的）指古希腊另一主要部落爱奥尼亚人及其文化风格，其建筑以优雅的卷涡柱头为特征，与多里安风格的粗犷简洁形成鲜明对比。多里安风格更庄重、朴素，而爱奥尼亚风格更精致、装饰性强。"
    },
    {
      "word_to_compare": "phrygian",
      "analysis": "“Phrygian”（弗里吉亚的）是另一种音乐调式，其特征是降低的第二音，带有异域、紧张的色彩，常用于表现戏剧性或神秘感。相比之下，多里安调式更为平衡，第六音升高使其比自然小调更明亮，情绪更积极。"
    },
    {
      "word_to_compare": "doric",
      "analysis": "“Doric” 是 “Dorian” 在建筑领域的标准拼写变体，特指多里安柱式（Doric order），是古希腊三种柱式中最古老、最简朴的一种。虽然 “Dorian” 可泛指文化、民族或音乐，但 “Doric” 几乎专用于建筑语境，二者在语义上高度重叠但使用领域不同。"
    }
  ]
}