{
  "word": "doubles",
  "pronunciation": "duhb·uhlz",
  "concise_definition": "n. 双倍, 双打, 双人项目; v. 加倍, 翻倍, 兼任",
  "forms": {
    "singular": "double"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A pair of identical or corresponding things considered together, especially two of the same item or two people performing together.",
      "explanation_cn": "指两个相同或相对应的事物被视作一个整体，尤指两个相同的物品或两个人共同完成某事。",
      "example_en": "She ordered a double espresso after her morning run.",
      "example_cn": "晨跑后，她点了一杯双份浓缩咖啡。"
    },
    {
      "pos": "noun",
      "explanation_en": "In sports, a game or event involving two players on each side, such as doubles tennis or doubles badminton.",
      "explanation_cn": "在体育运动中，指每方由两名选手组成的比赛项目，如网球双打或羽毛球双打。",
      "example_en": "They won the gold medal in men's doubles at the Olympics.",
      "example_cn": "他们在奥运会上赢得了男子双打金牌。"
    },
    {
      "pos": "noun",
      "explanation_en": "A copy or replica of something, especially one that is nearly identical to the original.",
      "explanation_cn": "指某物的复制品或仿制品，尤其是与原件几乎完全相同的东西。",
      "example_en": "The museum displayed a double of the ancient statue to protect the original.",
      "example_cn": "博物馆展出了一尊古代雕像的复制品，以保护原件。"
    },
    {
      "pos": "verb",
      "explanation_en": "To increase something to twice its amount, size, or value.",
      "explanation_cn": "指使某物的数量、大小或价值增加一倍。",
      "example_en": "The company's profits doubled last year due to increased sales.",
      "example_cn": "由于销售额增长，该公司去年的利润翻了一番。"
    },
    {
      "pos": "verb",
      "explanation_en": "To take on an additional role or responsibility in addition to one's primary one.",
      "explanation_cn": "指在承担主要职责之外，额外兼任另一项角色或职责。",
      "example_en": "He doubles as the team's coach and manager.",
      "example_cn": "他同时兼任球队的教练和经理。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pair",
      "analysis": "“Pair”（一对）泛指两个相关或配套的事物，强调互补性或成对出现，如一双鞋、一对耳环。而 “double” 更强调数量上的翻倍或两个相同事物的并列，常用于表示倍数关系或重复结构，如双份、双打。"
    },
    {
      "word_to_compare": "twin",
      "analysis": "“Twin”（双胞胎/孪生）特指两个在出生或形成时自然配对的相似个体，常用于生物或情感语境，如双胞胎兄弟。而 “double” 更广泛，可用于非生物、人工或抽象事物，如价格翻倍、角色兼任，不强调自然关联性。"
    },
    {
      "word_to_compare": "duplicate",
      "analysis": "“Duplicate”（副本/复制品）强调完全复制，常用于文件、数据或证件，侧重于功能等同而非数量增加。而 “double” 在作名词时虽可指复制品，但更常用于表示数量加倍或双人形式，如双打比赛，语义范围更广。"
    }
  ]
}