{
  "word": "double",
  "pronunciation": "duhb·l",
  "concise_definition": "adj. 双重的, 双倍的; v. 加倍, 翻倍; n. 双倍, 双人房; adv. 双倍地",
  "forms": {
    "third_person_singular": "doubles",
    "past_tense": "doubled",
    "past_participle": "doubled",
    "present_participle": "doubling",
    "plural": "doubles"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Consisting of two parts, elements, or units; having two of something in parallel or in combination.",
      "explanation_cn": "由两个部分、元素或单位组成；具有两个并列或组合的事物。",
      "example_en": "She ordered a double espresso to stay awake during the meeting.",
      "example_cn": "她点了一杯双份浓缩咖啡，以便在会议中保持清醒。"
    },
    {
      "pos": "verb",
      "explanation_en": "To increase something to twice its size, amount, or value; to multiply by two.",
      "explanation_cn": "使某物的大小、数量或价值增加一倍；乘以二。",
      "example_en": "The company's profits doubled last year after expanding into Asia.",
      "example_cn": "该公司去年进入亚洲市场后，利润翻了一番。"
    },
    {
      "pos": "noun",
      "explanation_en": "A second copy or duplicate of something, or a quantity that is twice the normal amount.",
      "explanation_cn": "某物的第二个副本或复制品，或两倍于正常数量的量。",
      "example_en": "He ordered a double of his favorite whiskey at the bar.",
      "example_cn": "他在酒吧点了一杯他最爱的威士忌的双份。"
    },
    {
      "pos": "noun",
      "explanation_en": "A room in a hotel designed for two people, often with one or two beds.",
      "explanation_cn": "酒店中为两人设计的房间，通常有一张或两张床。",
      "example_en": "We booked a double for our honeymoon trip.",
      "example_cn": "我们为蜜月旅行预订了一间双人房。"
    },
    {
      "pos": "adverb",
      "explanation_en": "In a doubled manner; twice as much or as fast.",
      "explanation_cn": "以加倍的方式；两倍多或两倍快。",
      "example_en": "She worked double time to finish the project before the deadline.",
      "example_cn": "她加班加点工作，以便在截止日期前完成项目。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "twice",
      "analysis": "“Twice” (两次，两倍) 是一个副词或限定词，专门用于表示数量或频率为二，通常直接修饰名词或动词，如 “twice as much”。而 “double” 作为形容词或动词时，不仅表示数量翻倍，还可指结构上的双重性（如 double door）或动作上的加倍行为（如 double the price），语义更丰富。"
    },
    {
      "word_to_compare": "duplicate",
      "analysis": "“Duplicate” (副本) 强调完全相同的复制品，常用于文件、证件或物品的复制，侧重于“复制”而非“数量增加”。而 “double” 更强调数量或程度上的翻倍，不一定涉及复制行为，例如 “double the speed” 并不意味着有两个速度，而是速度变为两倍。"
    },
    {
      "word_to_compare": "pair",
      "analysis": "“Pair” (一对) 指两个自然配对或组合在一起的物品（如一双鞋、一对耳环），强调的是成对关系，而非数量翻倍。而 “double” 可用于任何数量或程度的翻倍，不隐含配对关系，例如 “double the risk” 中的两个风险并非配对，而是量级加倍。"
    }
  ]
}