{
  "word": "doubt",
  "pronunciation": "dowt",
  "concise_definition": "n. 怀疑, 疑虑; v. 怀疑, 不信",
  "forms": {
    "third_person_singular": "doubts",
    "past_tense": "doubted",
    "past_participle": "doubted",
    "present_participle": "doubting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A feeling of uncertainty or lack of conviction about the truth, reliability, or quality of something or someone.",
      "explanation_cn": "对某事物或某人的真实性、可靠性或质量感到不确定或缺乏信心的心理状态。",
      "example_en": "There is some doubt about the accuracy of the data.",
      "example_cn": "关于这些数据的准确性，存在一些疑虑。"
    },
    {
      "pos": "noun",
      "explanation_en": "A state of hesitation or indecision between two or more possibilities, often leading to inaction.",
      "explanation_cn": "在两种或多种可能性之间犹豫不决的状态，常导致无所作为。",
      "example_en": "She was filled with doubt about whether to accept the job offer.",
      "example_cn": "她对是否接受这份工作邀约感到犹豫不决。"
    },
    {
      "pos": "verb",
      "explanation_en": "To feel uncertain or skeptical about the truth, validity, or reliability of something.",
      "explanation_cn": "对某事物的真实性、有效性或可靠性感到不确定或持怀疑态度。",
      "example_en": "I doubt he will arrive on time given the traffic.",
      "example_cn": "考虑到交通状况，我怀疑他能否准时到达。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hesitate or be unwilling to accept something as true or real, often due to lack of evidence or personal bias.",
      "explanation_cn": "因缺乏证据或个人偏见而不愿接受某事为真或为实，表现出犹豫或抗拒。",
      "example_en": "Many scientists still doubt the existence of life on other planets.",
      "example_cn": "许多科学家仍对其他星球上存在生命持怀疑态度。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "suspicion",
      "analysis": "“Suspicion”（怀疑/猜疑）通常带有负面或不信任的色彩，常暗示对他人动机或行为的不轨推测，多用于法律或道德语境。而 “doubt” 更中性，仅表示对事实或判断的不确定性，不一定涉及恶意。"
    },
    {
      "word_to_compare": "uncertainty",
      "analysis": "“Uncertainty”（不确定性）是一个更广泛、更抽象的术语，指缺乏确定性或可预测性，可用于天气、经济、未来等非个人情境。而 “doubt” 更强调主观的心理状态，通常与具体信念或主张相关。"
    },
    {
      "word_to_compare": "question",
      "analysis": "“Question”（质疑）是主动提出疑问或挑战，常伴随言语或行动，如提问、辩论；而 “doubt” 是内在的心理状态，可能不外显。一个人可以质疑某事而不怀疑它，也可以怀疑某事却不表达出来。"
    }
  ]
}