{
  "word": "doubled",
  "pronunciation": "dowb·ld",
  "concise_definition": "v. 加倍, 翻倍; adj. 双重的, 双层的",
  "forms": {
    "base_form": "double",
    "third_person_singular": "doubles",
    "past_tense": "doubled",
    "past_participle": "doubled",
    "present_participle": "doubling"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To increase something to twice its original amount, size, or value, often through multiplication or addition.",
      "explanation_cn": "指将某物的数量、大小或价值增加到原来的两倍，通常通过乘法或加法实现。",
      "example_en": "The company's profits doubled last year after expanding into new markets.",
      "example_cn": "该公司去年进入新市场后，利润翻了一番。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fold something over so that one part lies on top of the other, effectively making it two layers thick.",
      "explanation_cn": "指将某物对折，使一部分覆盖在另一部分之上，从而形成两层。",
      "example_en": "She doubled the napkin before placing it on her lap.",
      "example_cn": "她把餐巾对折后放在膝盖上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To perform two tasks or roles simultaneously, often with increased effort or intensity.",
      "explanation_cn": "指同时承担两项任务或角色，通常意味着付出更多努力或增强强度。",
      "example_en": "He doubled as the team’s coach and manager during the season.",
      "example_cn": "他在整个赛季中兼任球队的教练和经理。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Consisting of two parts, layers, or units combined together; having two of something in one.",
      "explanation_cn": "由两个部分、层或单位组合而成；指某物具有双重性或双层结构。",
      "example_en": "She wore a doubled coat to stay warm in the freezing weather.",
      "example_cn": "她穿了一件双层外套以在严寒中保暖。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "multiply",
      "analysis": "“Multiply”（相乘）是一个更广泛的数学或抽象概念，指按某个因子增加数量，可以是两倍、三倍或更多；而 “doubled” 专指增加到两倍，范围更窄、更具体。"
    },
    {
      "word_to_compare": "twin",
      "analysis": "“Twin”（双生的）强调两个完全相同或成对存在的事物，常用于描述人、物体或概念的配对关系，但不包含“增加”或“变化”的动作含义；而 “doubled” 强调从一个变为两个，具有动态变化的过程。"
    },
    {
      "word_to_compare": "repeat",
      "analysis": "“Repeat”（重复）指再次做相同的事，但不必然导致数量或规模的翻倍；而 “doubled” 明确表示数量或程度的精确翻倍，具有量化结果。例如，重复一次声音不等于声音强度加倍。"
    }
  ]
}