{
  "word": "douche",
  "pronunciation": "doosh",
  "concise_definition": "n. 冲洗器, 冲洗液; v. 冲洗; (俚语) 可鄙的人",
  "forms": {
    "third_person_singular": "douches",
    "past_tense": "douched",
    "past_participle": "douched",
    "present_participle": "douching"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A device or liquid used to rinse or flush a body cavity, especially the vagina, often for medical or hygiene purposes, though frequently misused for non-medical reasons.",
      "explanation_cn": "一种用于冲洗身体腔道（尤其是阴道）的装置或液体，常用于医疗或卫生目的，但常被误用于非医学原因。",
      "example_en": "The doctor recommended a saline douche to treat the infection.",
      "example_cn": "医生建议用生理盐水冲洗来治疗感染。"
    },
    {
      "pos": "verb",
      "explanation_en": "To wash out or rinse a body cavity, typically using a liquid solution, often in a medical or personal hygiene context.",
      "explanation_cn": "指用液体溶液冲洗身体腔道，通常用于医疗或个人卫生场景。",
      "example_en": "She was advised not to douche regularly, as it can disrupt natural flora.",
      "example_cn": "医生建议她不要经常冲洗，因为这会破坏正常的菌群平衡。"
    },
    {
      "pos": "noun",
      "explanation_en": "A derogatory term used to describe a person who is arrogant, obnoxious, or socially inept — often implying pretentiousness or foolishness.",
      "explanation_cn": "贬义词，用于形容傲慢、令人讨厌或社交无能的人，常暗示其装腔作势或愚蠢。",
      "example_en": "He showed up to the interview in a tuxedo — what a total douche.",
      "example_cn": "他穿着燕尾服去参加面试——真是个十足的傻瓜。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "wash",
      "analysis": "“Wash”（清洗）是通用词，指用液体清洁表面或身体，不特指腔道冲洗，也不含医疗或贬义语境。而 “douche” 专指内部冲洗，常带医学或争议性含义，且在俚语中具有强烈贬义。"
    },
    {
      "word_to_compare": "irrigate",
      "analysis": "“Irrigate”（灌溉/冲洗）是更正式、中性的医学术语，用于描述用液体冲洗体腔或伤口，常用于临床语境，无贬义。而 “douche” 虽在医学上可互换，但在日常语言中因文化污名化而带有负面联想。"
    },
    {
      "word_to_compare": "jerk",
      "analysis": "“Jerk”（混蛋）是与 “douche” 同属俚语贬义词，均形容令人讨厌的人，但 “jerk” 更侧重行为粗鲁或自私，而 “douche” 更强调装模作样、虚伪或愚蠢的优越感，语义更复杂且更具文化讽刺色彩。"
    }
  ]
}