{
  "word": "douglas",
  "pronunciation": "dow·gləs",
  "concise_definition": "n. 道格拉斯（姓氏/人名/地名）",
  "forms": {
    "plural": "douglases"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A proper noun commonly used as a surname or given name, originating from Scottish Gaelic, meaning 'dark stream' or 'black water'. It is associated with historical Scottish clans and notable figures in politics, science, and entertainment.",
      "explanation_cn": "一个常见的姓氏或名字，源自苏格兰盖尔语，意为‘黑暗的溪流’或‘黑水’。常与苏格兰历史上的道格拉斯家族以及政治、科学和娱乐领域的知名人物相关联。",
      "example_en": "Douglas Adams was the author of The Hitchhiker's Guide to the Galaxy.",
      "example_cn": "道格拉斯·亚当斯是《银河系漫游指南》的作者。"
    },
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to various places named after the Douglas family or individuals with that name, such as cities, streets, or institutions in North America and the UK.",
      "explanation_cn": "指以道格拉斯家族或同名人物命名的多个地点，如北美和英国的城镇、街道或机构。",
      "example_en": "The Douglas County Library hosts weekly community events.",
      "example_cn": "道格拉斯县图书馆每周举办社区活动。"
    },
    {
      "pos": "noun",
      "explanation_en": "A proper noun used in the names of aircraft, ships, or military equipment, particularly those manufactured by the Douglas Aircraft Company, such as the DC-3 or the A-20 Havoc.",
      "explanation_cn": "用于以道格拉斯飞机公司命名的飞机、船舶或军事装备名称中，例如DC-3或A-20‘浩劫’轰炸机。",
      "example_en": "The Douglas DC-3 revolutionized air travel in the 1930s.",
      "example_cn": "道格拉斯DC-3在20世纪30年代彻底改变了航空旅行。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "doug",
      "analysis": "“Doug” 是 “Douglas” 的常见缩写或昵称形式，多用于口语或非正式场合，语义上完全等同于全名，但缺乏正式性与历史厚重感。例如，人们可能称 Douglas Adams 为 “Doug”，但在学术或历史文献中仍使用全称。"
    },
    {
      "word_to_compare": "dougal",
      "analysis": "“Dougal” 是苏格兰语中与 “Douglas” 同源的变体拼写，主要作为人名使用，尤其在苏格兰和爱尔兰地区。它保留了原始发音和文化背景，但现代使用频率远低于 “Douglas”，且不用于地名或品牌命名。"
    },
    {
      "word_to_compare": "douglas fir",
      "analysis": "“Douglas fir” 是一种以苏格兰探险家 David Douglas 命名的针叶树种，虽然名称中包含 “Douglas”，但其作为植物学名称已脱离人名范畴，成为独立的专有名词。它与作为人名或地名的 “Douglas” 无语义关联，仅共享词源。"
    }
  ]
}