{
  "word": "downgraded",
  "pronunciation": "doun·grayd",
  "concise_definition": "v. 降级, 降低等级, 降低评价",
  "forms": {
    "base_form": "downgrade",
    "third_person_singular": "downgrades",
    "past_tense": "downgraded",
    "past_participle": "downgraded",
    "present_participle": "downgrading"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To reduce the rank, quality, importance, or value of something, often in an official or formal context, such as a rating, status, or classification.",
      "explanation_cn": "指在官方或正式语境中，降低某事物的等级、质量、重要性或价值，如评级、地位或分类。",
      "example_en": "The credit rating agency downgraded the country's sovereign debt to junk status.",
      "example_cn": "信用评级机构将该国的主权债务评级下调至垃圾级。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move someone or something to a lower position or level, often as a result of poor performance or changing circumstances.",
      "explanation_cn": "指因表现不佳或情况变化，将某人或某物调至较低的位置或级别。",
      "example_en": "After the scandal, the CEO was downgraded from executive director to a junior advisor role.",
      "example_cn": "丑闻发生后，这位首席执行官被降职为初级顾问。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reduce the specifications or features of a product or service, often to cut costs or meet budget constraints.",
      "explanation_cn": "指为降低成本或满足预算限制，减少产品或服务的规格或功能。",
      "example_en": "The manufacturer downgraded the phone's processor to lower the retail price.",
      "example_cn": "制造商降低了手机处理器的规格，以降低零售价格。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "demoted",
      "analysis": "“Demoted” (降职) 专指在组织层级中被降低职位，通常用于人事管理语境，强调职位头衔或权力的下降。而 “downgraded” 范围更广，可用于评级、产品、服务、信用等非人事场景，不一定涉及职位变动。"
    },
    {
      "word_to_compare": "devalued",
      "analysis": "“Devalued” (贬值) 主要用于经济或货币语境，指某物的市场价值或购买力下降，如货币贬值。它侧重于经济价值的减少，而 “downgraded” 更强调等级、质量或标准的降低，可能不涉及价格变化。"
    },
    {
      "word_to_compare": "reduced",
      "analysis": "“Reduced” (减少) 是一个通用词，泛指数量、规模、程度的降低，如减少用量、减少开支。它不隐含等级或质量的评判，而 “downgraded” 暗示了对原有标准或等级的负面重新评估，具有更强的评价性含义。"
    }
  ]
}