{
  "word": "down",
  "pronunciation": "doun",
  "concise_definition": "adv. 向下, 落下; adj. 向下的, 沮丧的; n. 绒毛, 羽绒; prep. 沿着, 向下",
  "forms": {
    "comparative": "downer",
    "superlative": "downest"
  },
  "definitions": [
    {
      "pos": "adverb",
      "explanation_en": "Moving from a higher to a lower position or level; used to describe physical descent or reduction in intensity.",
      "explanation_cn": "指从较高位置或水平向较低位置或水平移动；用于描述物理上的下降或强度的减弱。",
      "example_en": "She sat down on the chair and sighed.",
      "example_cn": "她坐在椅子上，叹了口气。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Feeling sad, depressed, or lacking in energy or spirits; describing a state of low mood or morale.",
      "explanation_cn": "感到悲伤、沮丧或缺乏精力或精神；描述情绪低落或士气低沉的状态。",
      "example_en": "He's been feeling down since he lost his job.",
      "example_cn": "自从他丢了工作，他就一直情绪低落。"
    },
    {
      "pos": "noun",
      "explanation_en": "The soft, fine feathers found beneath the outer feathers of birds, especially used for insulation in clothing and bedding.",
      "explanation_cn": "鸟类外层羽毛下方的柔软细羽，尤指用于衣物和床上用品的保暖材料。",
      "example_en": "The pillow was filled with goose down for maximum comfort.",
      "example_cn": "这个枕头填充了鹅绒，以提供最大的舒适感。"
    },
    {
      "pos": "preposition",
      "explanation_en": "Indicating movement or position along a route from a higher to a lower point, or in the direction of a destination.",
      "explanation_cn": "表示沿路线从高处向低处移动，或朝向某个目的地的方向。",
      "example_en": "They drove down the coast to visit their relatives.",
      "example_cn": "他们沿着海岸开车去探望亲戚。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "below",
      "analysis": "“Below” (在……下方) 是一个纯粹的方位介词，强调空间上的相对位置，不包含运动或方向的含义。而 “down” 不仅表示位置，还隐含从高到低的运动趋势或方向性，更具动态性。"
    },
    {
      "word_to_compare": "sad",
      "analysis": "“Sad” (悲伤的) 是一个直接描述情绪的形容词，语义单一且中性。而 “down” 作为情绪形容词更口语化，常用于非正式语境，且常暗示一种暂时性、轻度的低落，而非深度抑郁。"
    },
    {
      "word_to_compare": "under",
      "analysis": "“Under” (在……下面) 强调被覆盖或处于某物正下方的静态位置，常用于物理遮蔽关系（如 under the table）。而 “down” 更强调垂直方向的移动或趋势，不必然涉及遮蔽，如 “walk down the hill”。"
    }
  ]
}