{
  "word": "drafts",
  "pronunciation": "drafts",
  "concise_definition": "n. 草稿, 征兵, 气流",
  "forms": {
    "singular": "draft"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An early version of a written document, such as a letter, report, or law, that is subject to revision before finalization.",
      "explanation_cn": "指文件（如信件、报告或法律）的初稿或未定稿，需经过修改后才能最终定稿。",
      "example_en": "She spent the entire evening revising the draft of her research paper.",
      "example_cn": "她整个晚上都在修改她的研究报告草稿。"
    },
    {
      "pos": "noun",
      "explanation_en": "The compulsory enlistment of people into military service, especially during times of war or national need.",
      "explanation_cn": "指在战争或国家需要时强制征召人员入伍的行为。",
      "example_en": "The government reinstated the draft after the outbreak of the conflict.",
      "example_cn": "冲突爆发后，政府恢复了征兵制。"
    },
    {
      "pos": "noun",
      "explanation_en": "A current of air moving through a room, building, or other enclosed space, often causing a chill.",
      "explanation_cn": "指在房间、建筑或其他封闭空间内流动的空气，常使人感到寒冷。",
      "example_en": "There was a cold draft coming from the cracked window.",
      "example_cn": "从裂开的窗户吹进一股冷风。"
    },
    {
      "pos": "noun",
      "explanation_en": "In sports, the process of selecting players for teams, typically in a predetermined order, as in American football or basketball.",
      "explanation_cn": "在体育运动中，指按预定顺序挑选球员加入球队的过程，常见于美式橄榄球或篮球。",
      "example_en": "The rookie was picked in the first round of the NFL draft.",
      "example_cn": "这位新秀在NFL选秀第一轮被选中。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "version",
      "analysis": "“Version”（版本）泛指任何事物的不同形式或变体，可以是软件、翻译、艺术作品等，不特指未完成状态。而 “draft” 特指尚未定稿、仍需修改的初步版本，具有临时性和可修改性。"
    },
    {
      "word_to_compare": "conscription",
      "analysis": "“Conscription”（征兵）是 “draft” 在军事语境下的正式同义词，但 “conscription” 更常用于法律或学术语境，语气更正式；而 “draft” 更口语化，广泛用于日常和媒体表达。"
    },
    {
      "word_to_compare": "breeze",
      "analysis": "“Breeze”（微风）指轻柔、宜人的空气流动，通常带有正面情感色彩；而 “draft” 指不受欢迎的、令人不适的气流，常与寒冷、漏风等负面体验相关，语义倾向截然不同。"
    }
  ]
}