{
  "word": "drafting",
  "pronunciation": "draft·ing",
  "concise_definition": "n. 草稿, 起草, 绘图; v. 起草, 征召, 临时调用",
  "forms": {
    "base_form": "draft",
    "third_person_singular": "drafts",
    "past_tense": "drafted",
    "past_participle": "drafted",
    "present_participle": "drafting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A preliminary version of a written document, such as a law, contract, or letter, that is subject to revision before finalization.",
      "explanation_cn": "指文件（如法律、合同或信件）的初步版本，在最终定稿前需经过修改和完善。",
      "example_en": "The lawyer reviewed the drafting of the agreement before submitting it to the client.",
      "example_cn": "律师在将协议提交给客户之前，审阅了其草稿。"
    },
    {
      "pos": "noun",
      "explanation_en": "The technical process of creating detailed plans or drawings, especially in architecture, engineering, or design.",
      "explanation_cn": "指在建筑、工程或设计领域中制作详细图纸或规划的技术过程。",
      "example_en": "His expertise in drafting enabled him to produce precise blueprints for the new bridge.",
      "example_cn": "他在绘图方面的专长使他能够为新桥制作精确的施工图。"
    },
    {
      "pos": "verb",
      "explanation_en": "To write or compose a preliminary version of a text, especially for official, legal, or formal purposes.",
      "explanation_cn": "指为官方、法律或正式目的撰写文本的初稿。",
      "example_en": "The committee is drafting a new policy on remote work.",
      "example_cn": "委员会正在起草一项关于远程工作的新政策。"
    },
    {
      "pos": "verb",
      "explanation_en": "To select or enlist someone, especially for military service or a sports team, often by official or random process.",
      "explanation_cn": "指通过官方或随机方式征召某人服役或选入运动队，尤指军事征兵或体育选秀。",
      "example_en": "He was drafted into the army during the war and served for three years.",
      "example_cn": "战争期间他被征召入伍，服役三年。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "writing",
      "analysis": "“Writing”（写作）是一个广义词，泛指任何形式的文字创作，包括最终稿和非正式表达。而 “drafting” 特指写作过程中的初稿阶段，强调尚未定型、可修改的特性，具有明确的阶段性。"
    },
    {
      "word_to_compare": "designing",
      "analysis": "“Designing”（设计）侧重于整体结构、功能与美学的规划，常用于产品、空间或系统层面。而 “drafting” 在工程或建筑语境中是设计的执行环节，特指将设计转化为精确的技术图纸，更注重细节与规范。"
    },
    {
      "word_to_compare": "recruiting",
      "analysis": "“Recruiting”（招募）是一个广泛的人才选拔过程，包括发布职位、筛选简历、面试等环节。而 “drafting” 在征兵或体育语境中特指通过官方系统（如选秀）一次性选定人员，过程更制度化、集中化，且常具强制性或随机性。"
    }
  ]
}