{
  "word": "draft",
  "pronunciation": "draft",
  "concise_definition": "n. 草稿, 征兵, 汇票; v. 起草, 征召, 征用",
  "forms": {
    "third_person_singular": "drafts",
    "past_tense": "drafted",
    "past_participle": "drafted",
    "present_participle": "drafting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An initial or preliminary version of a written document, such as a letter, report, or law, that is subject to revision before finalization.",
      "explanation_cn": "指书面文件（如信件、报告或法律）的初始或初步版本，需经过修改后才能定稿。",
      "example_en": "She spent the evening revising the draft of her research paper.",
      "example_cn": "她整晚都在修改论文的草稿。"
    },
    {
      "pos": "noun",
      "explanation_en": "The selection of individuals for compulsory military service, or the group of people selected in this way.",
      "explanation_cn": "指强制征召人员入伍，或被征召入伍的人员群体。",
      "example_en": "The government announced a draft of young men aged 18 to 25.",
      "example_cn": "政府宣布征召18至25岁的青年入伍。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of negotiable financial instrument, similar to a check, used to order a bank or other party to pay a specified amount to a named recipient.",
      "explanation_cn": "指一种可转让的金融票据，类似于支票，用于指示银行或其他方支付指定金额给指定收款人。",
      "example_en": "He paid for the goods using a bank draft.",
      "example_cn": "他用银行汇票支付了货款。"
    },
    {
      "pos": "noun",
      "explanation_en": "In sports, the process of selecting players for teams, especially in professional leagues, often in reverse order of the previous season's standings.",
      "explanation_cn": "在体育中，指按上一赛季排名倒序选择球员加入球队的过程，尤指职业联赛中的选秀制度。",
      "example_en": "The NBA draft is held every June to select new talent.",
      "example_cn": "NBA选秀每年六月举行，以选拔新秀球员。"
    },
    {
      "pos": "verb",
      "explanation_en": "To write or prepare an initial version of a document, especially one that will be revised later.",
      "explanation_cn": "指撰写或准备文件的初稿，通常之后会进行修改。",
      "example_en": "The lawyer drafted a contract that protected the client's interests.",
      "example_cn": "律师起草了一份保护客户利益的合同。"
    },
    {
      "pos": "verb",
      "explanation_en": "To compel someone to serve in the armed forces, especially during wartime.",
      "explanation_cn": "指强制某人服兵役，尤指在战争期间。",
      "example_en": "Many young men were drafted during the Vietnam War.",
      "example_cn": "许多青年在越南战争期间被征召入伍。"
    },
    {
      "pos": "verb",
      "explanation_en": "To select someone for a team or role, especially in a formal or organized process.",
      "explanation_cn": "指通过正式或有组织的程序选拔某人加入团队或担任某种角色。",
      "example_en": "The team drafted a rookie quarterback with the first overall pick.",
      "example_cn": "该队用第一顺位选中了一名新秀四分卫。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "version",
      "analysis": "“Version”（版本）泛指任何事物的不同形式或变体，可以是软件、翻译、设计等，不一定是草稿，也不一定有修改意图。而 “draft” 特指尚未定稿、需进一步修改的初始版本，具有明确的临时性和可修订性。"
    },
    {
      "word_to_compare": "outline",
      "analysis": "“Outline”（提纲）是内容的结构框架，仅列出要点或逻辑顺序，缺乏完整句子和细节。而 “draft” 是已包含完整语句和内容的初步文本，更接近最终成品，只是尚未润色或定稿。"
    },
    {
      "word_to_compare": "conscription",
      "analysis": "“Conscription”（征兵）是名词，指征兵制度或政策本身，是抽象概念；而 “draft” 作为名词时，既可以指征兵制度（美式英语中常用），也可以指被征召的个人或群体，更具体、更常用在日常语境中。作为动词时，“draft” 直接表示征召行为，而 “conscription” 无动词形式。"
    }
  ]
}