{
  "word": "dragging",
  "pronunciation": "drag·ing",
  "concise_definition": "v. 拖拽, 拖行, 拖延",
  "forms": {
    "base_form": "drag",
    "third_person_singular": "drags",
    "past_tense": "dragged",
    "past_participle": "dragged",
    "present_participle": "dragging"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To pull something heavy or resistant along a surface, often with effort or difficulty.",
      "explanation_cn": "指用力将沉重或有阻力的物体沿表面拖拉，通常需要付出努力或面临困难。",
      "example_en": "He was dragging a heavy suitcase across the airport terminal.",
      "example_cn": "他正费力地拖着一个沉重的行李箱穿过机场航站楼。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move slowly or reluctantly, often due to fatigue, boredom, or lack of motivation.",
      "explanation_cn": "指因疲惫、无聊或缺乏动力而缓慢、不情愿地移动或行进。",
      "example_en": "The children were dragging their feet on the way to school.",
      "example_cn": "孩子们上学路上拖着脚步，一副不情愿的样子。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to be prolonged unnecessarily, especially a process, discussion, or event.",
      "explanation_cn": "指使某过程、讨论或事件无谓地拖延、延长。",
      "example_en": "The lawyer kept dragging out the trial with unnecessary objections.",
      "example_cn": "律师不断提出无谓的异议，拖延审判进程。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move a cursor or object on a computer screen by holding down a mouse button and moving the mouse.",
      "explanation_cn": "指在计算机屏幕上通过按住鼠标按钮并移动鼠标来移动光标或对象（即‘拖拽’操作）。",
      "example_en": "She was dragging the file into the folder to organize her desktop.",
      "example_cn": "她正在将文件拖入文件夹中，以整理桌面。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pull",
      "analysis": "“Pull”（拉）泛指施加力量使物体朝向自己，方向不限于水平，也不一定伴随摩擦或阻力。而 “dragging” 强调物体与接触面之间的摩擦，通常更费力，且多用于水平方向的拖行。"
    },
    {
      "word_to_compare": "hinder",
      "analysis": "“Hinder”（阻碍）指妨碍某事进展，是抽象意义上的阻挠，不涉及物理动作。而 “dragging” 既可以是物理拖拽，也可以比喻性地表示拖延，但其动作意象更具体、更形象。"
    },
    {
      "word_to_compare": "delay",
      "analysis": "“Delay”（延迟）是中性词，指时间上的推迟，不带有情绪色彩。而 “dragging”（拖延）常带有负面含义，暗示不情愿、懒散或故意拖延，语气更强烈，常用于口语中表达不满。"
    },
    {
      "word_to_compare": "lumber",
      "analysis": "“Lumber”（蹒跚而行）形容笨重缓慢地行走，多用于描述人或动物的步态，强调笨拙感。而 “dragging” 更强调外力作用下的移动，或主观上的不情愿，适用范围更广，包括物体和抽象行为。"
    }
  ]
}