{
  "word": "dragon",
  "pronunciation": "dray·guhn",
  "concise_definition": "n. 龙, 恶龙, 暴君",
  "forms": {
    "plural": "dragons"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A mythical creature, typically depicted as a large, serpentine or lizard-like beast with wings, scales, and the ability to breathe fire, often symbolizing power, danger, or chaos in Western folklore.",
      "explanation_cn": "一种神话生物，通常被描绘为有翅膀、鳞片、能喷火的大型蛇形或蜥蜴状生物，在西方民间传说中常象征力量、危险或混乱。",
      "example_en": "The knight slayed the dragon that had been terrorizing the village.",
      "example_cn": "骑士杀死了那头一直恐吓村庄的恶龙。"
    },
    {
      "pos": "noun",
      "explanation_en": "In East Asian cultures, a benevolent and powerful mythical creature associated with water, weather, and imperial authority, often symbolizing good fortune, strength, and nobility.",
      "explanation_cn": "在东亚文化中，一种吉祥而强大的神话生物，与水、天气和皇权相关，常象征好运、力量与尊贵。",
      "example_en": "The Chinese New Year parade featured a colorful dragon dancing through the streets.",
      "example_cn": "春节游行中，一条色彩斑斓的龙在街道上舞动。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is fierce, intimidating, or tyrannical, often used metaphorically to describe a strict or cruel individual.",
      "explanation_cn": "比喻性地指一个凶猛、令人畏惧或专横的人，常用于形容严厉或残忍的个体。",
      "example_en": "She was called the dragon of the office for her harsh management style.",
      "example_cn": "她因严厉的管理风格被称作办公室里的‘母老虎’。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "serpent",
      "analysis": "“Serpent” (蛇) 指现实或神话中的蛇类生物，通常象征狡诈、诱惑或邪恶（如《圣经》中的伊甸园之蛇），但不具备龙的翅膀、喷火能力或帝王象征意义。龙是更复杂、更强大的神话综合体，而蛇更偏向于单一的象征。"
    },
    {
      "word_to_compare": "phoenix",
      "analysis": "“Phoenix” (凤凰) 是另一种神话生物，象征重生与不朽，常与火相关，但其形象是鸟形，代表循环与希望，与龙的威严、力量或破坏性形成鲜明对比。龙多与统治和自然力量相连，凤凰则与再生和灵魂升华相关。"
    },
    {
      "word_to_compare": "wyvern",
      "analysis": "“Wyvern” (双足飞龙) 是龙的一种变体，通常只有两条腿和一对翅膀，尾部带毒刺，体型较小，象征性较弱。它常出现在欧洲纹章中，但缺乏东方龙的文化深度和神圣性，是龙的简化或次级形态。"
    }
  ]
}