{
  "word": "dragons",
  "pronunciation": "drag·uhnz",
  "concise_definition": "n. 龙（复数形式）",
  "forms": {
    "singular": "dragon"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A mythical creature, typically depicted as a large, serpentine or lizard-like beast with wings, scales, and the ability to breathe fire, often symbolizing power, danger, or wisdom in folklore and fantasy.",
      "explanation_cn": "一种神话生物，通常被描绘为体型庞大、形似蛇或蜥蜴，有翅膀、鳞片，并能喷火，常在民间传说和奇幻作品中象征力量、危险或智慧。",
      "example_en": "In medieval European tales, knights often battled dragons to rescue princesses.",
      "example_cn": "在中世纪欧洲传说中，骑士常与龙搏斗以拯救公主。"
    },
    {
      "pos": "noun",
      "explanation_en": "A symbol or metaphor used in literature, politics, or culture to represent a formidable challenge, an oppressive force, or an ancient, fearsome entity.",
      "explanation_cn": "在文学、政治或文化中用作象征，代表一个艰巨的挑战、压迫性力量或古老而可怕的实体。",
      "example_en": "The company faced the dragon of rising inflation and supply chain disruptions.",
      "example_cn": "该公司面临着通货膨胀和供应链中断这头‘巨龙’的挑战。"
    },
    {
      "pos": "noun",
      "explanation_en": "In East Asian cultures, a benevolent, celestial creature associated with imperial authority, good fortune, and control over water and weather, often depicted without wings and with a long, serpentine body.",
      "explanation_cn": "在东亚文化中，一种仁慈的天界生物，象征皇权、好运以及对水和天气的掌控，通常被描绘为无翼、身体修长如蛇。",
      "example_en": "The Chinese dragon is a central symbol in Lunar New Year celebrations, representing prosperity and strength.",
      "example_cn": "中国龙是春节庆祝活动中的核心象征，代表繁荣与力量。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "serpent",
      "analysis": "“Serpent”（蛇）通常指现实中的蛇类或象征邪恶、诱惑的蛇形生物，多与圣经中的伊甸园故事相关，强调阴险与欺骗。而 “dragon” 更庞大、更具神话色彩，常拥有翅膀、喷火能力，象征力量与威严，文化含义更复杂多样。"
    },
    {
      "word_to_compare": "phoenix",
      "analysis": "“Phoenix”（凤凰）是另一种神话生物，象征重生与不朽，常通过自焚后从灰烬中复活来体现循环与希望。与 “dragon” 的破坏性或权威性不同，凤凰更强调净化与新生，两者在象征体系中常形成对立或互补。"
    },
    {
      "word_to_compare": "wyvern",
      "analysis": "“Wyvern”（翼龙）是龙的一种变体，通常只有两条腿和一对翅膀，尾部带毒刺，体型较小，结构更简单。而 “dragon” 一般指四足、有翼、更庞大且智慧的生物，文化地位更高，常作为统治者或守护者出现。"
    }
  ]
}