{
  "word": "drains",
  "pronunciation": "draynz",
  "concise_definition": "n. 排水沟, 下水道; v. 排水, 耗尽, 使疲惫",
  "forms": {
    "singular": "drain",
    "third_person_singular": "drains",
    "past_tense": "drained",
    "past_participle": "drained",
    "present_participle": "draining"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A channel or pipe designed to carry away liquid waste or excess water from a building, street, or other area.",
      "explanation_cn": "指用于将液体废物或多余水分从建筑物、街道或其他区域排出的沟渠或管道。",
      "example_en": "The rainwater flowed into the storm drains along the sidewalk.",
      "example_cn": "雨水流入人行道旁的雨水排水沟。"
    },
    {
      "pos": "noun",
      "explanation_en": "A state of depletion or exhaustion, often used metaphorically to describe the loss of energy, resources, or vitality.",
      "explanation_cn": "指一种耗尽或枯竭的状态，常用于比喻能量、资源或活力的丧失。",
      "example_en": "The long meeting was a total drain on my patience and energy.",
      "example_cn": "这场漫长的会议完全耗尽了我的耐心和精力。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove liquid from something by allowing it to flow out through a channel or opening.",
      "explanation_cn": "指通过通道或开口将液体从某物中排出。",
      "example_en": "She drained the pasta in a colander before serving it.",
      "example_cn": "她在上菜前把意大利面沥干。"
    },
    {
      "pos": "verb",
      "explanation_en": "To gradually use up or deplete a resource, energy, or emotional capacity, often unintentionally or over time.",
      "explanation_cn": "指逐渐耗尽某种资源、精力或情感容量，通常是非故意的或长期累积的结果。",
      "example_en": "Caring for a sick relative can drain your financial and emotional reserves.",
      "example_cn": "照顾生病的亲人可能会耗尽你的经济和情感储备。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pipe",
      "analysis": "“Pipe”（管道）泛指任何用于输送液体或气体的管状结构，不强调其排水功能。而 “drain” 特指用于排放废水或多余水分的管道或沟渠，功能更具体，常与废物处理相关。"
    },
    {
      "word_to_compare": "deplete",
      "analysis": "“Deplete”（耗尽）是更正式、更广泛的动词，用于描述资源、库存或能量的显著减少，常用于经济、环境或医学语境。而 “drain” 作为动词时更形象，常带有持续、缓慢、不知不觉耗尽的意味，且常用于比喻情感或精力的消耗。"
    },
    {
      "word_to_compare": "exhaust",
      "analysis": "“Exhaust”（使筋疲力尽）强调彻底耗尽，通常用于形容人或系统达到极限，带有强烈的负面情绪色彩。而 “drain” 的程度较轻，更常用于日常语境，如 ‘drain your energy’，语气更温和，也更口语化。"
    }
  ]
}