{
  "word": "drained",
  "pronunciation": "draynd",
  "concise_definition": "adj. 精疲力尽的, 耗尽的; v. (drain 的过去式和过去分词) 排空, 耗尽",
  "forms": {
    "base_form": "drain",
    "third_person_singular": "drains",
    "present_participle": "draining",
    "past_tense": "drained",
    "past_participle": "drained"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Feeling extremely tired or exhausted, often due to physical, emotional, or mental exertion; depleted of energy or vitality.",
      "explanation_cn": "感到极度疲惫，通常由于体力、情感或精神上的过度消耗；精力或活力被耗尽的状态。",
      "example_en": "After working twelve hours straight, she felt completely drained.",
      "example_cn": "连续工作十二小时后，她感到精疲力尽。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Depleted of a resource, such as water, money, or nutrients; left empty or stripped of content.",
      "explanation_cn": "某种资源（如水、金钱或养分）被耗尽；被排空或清空的状态。",
      "example_en": "The reservoir was drained after months of drought.",
      "example_cn": "经过数月干旱，水库已被排干。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove liquid from something by letting it flow out, typically through a hole or pipe.",
      "explanation_cn": "通过孔洞或管道将液体从某物中排出。",
      "example_en": "They drained the swimming pool before cleaning it.",
      "example_cn": "他们在清洁泳池前将其水排干。"
    },
    {
      "pos": "verb",
      "explanation_en": "To exhaust or use up a resource, energy, or emotion over time, often unintentionally or excessively.",
      "explanation_cn": "随着时间推移耗尽某种资源、能量或情感，通常是非故意或过度的。",
      "example_en": "Caring for a newborn can drain even the most energetic parents.",
      "example_cn": "照顾新生儿可能会耗尽最有活力的父母的精力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "exhausted",
      "analysis": "“Exhausted”（精疲力尽的）与 “drained” 在描述精神或体力耗尽时高度相似，但 “exhausted” 更强调因过度使用而达到极限的状态，语气更强烈；而 “drained” 常带有被逐渐抽空、缓慢流失的意象，更常用于情感或心理层面的消耗。"
    },
    {
      "word_to_compare": "emptied",
      "analysis": "“Emptied”（清空的）侧重于物理空间或容器中内容物的完全移除，如 emptied a bottle 或 emptied a room，强调结果是“空的”；而 “drained” 特指液体被排出，或抽象资源（如精力）被持续抽走，隐含动态过程和流失感。"
    },
    {
      "word_to_compare": "depleted",
      "analysis": "“Depleted”（耗尽的）多用于正式语境，强调资源（如能源、储备、营养）因长期使用而显著减少，常用于科学或经济语境；“drained” 更口语化，适用范围更广，既可用于物理排液，也可用于情绪或能量的快速流失，情感色彩更浓。"
    }
  ]
}