{
  "word": "draped",
  "pronunciation": "draypt",
  "concise_definition": "v. 悬挂, 覆盖, 披垂",
  "forms": {
    "base_form": "drape",
    "third_person_singular": "drapes",
    "past_tense": "draped",
    "past_participle": "draped",
    "present_participle": "draping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To hang or arrange fabric, cloth, or other flexible material loosely and gracefully over a surface or object, often for decorative or functional purposes.",
      "explanation_cn": "指将织物、布料或其他柔韧材料松散而优雅地悬挂在某物表面或物体上，通常用于装饰或实用目的。",
      "example_en": "The curtains were draped elegantly across the windows, filtering the afternoon light.",
      "example_cn": "窗帘优雅地垂挂在窗户上，过滤着午后的阳光。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover or envelop something completely or partially with a flowing material, often suggesting a sense of elegance, mystery, or solemnity.",
      "explanation_cn": "指用流动的材料完全或部分地覆盖或包裹某物，常暗示优雅、神秘或庄重的氛围。",
      "example_en": "The statue was draped in a white shroud, adding a somber tone to the memorial.",
      "example_cn": "雕像被一层白布覆盖，为纪念仪式增添了一丝肃穆。"
    },
    {
      "pos": "verb",
      "explanation_en": "To wear clothing in a loose, flowing manner, especially in a way that suggests style or formality.",
      "explanation_cn": "指以松散、飘逸的方式穿着衣物，尤其指那种体现风格或正式感的穿法。",
      "example_en": "She draped her silk scarf loosely around her shoulders as she stepped out into the evening air.",
      "example_cn": "她走出门时，将丝绸围巾随意披在肩上。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hang",
      "analysis": "“Hang” (悬挂) 是一个更通用的词，仅表示物体被悬挂在某处，不强调方式或美感。而 “draped” 特指以柔和、流畅、有装饰性的方式悬挂，常带有美学或情感色彩。例如，衣服可以 hang on a hook，但只有当它自然垂落、富有韵律时，才称得上是 draped。"
    },
    {
      "word_to_compare": "cover",
      "analysis": "“Cover” (覆盖) 强调遮蔽功能，可以是完全或不完全的，但不涉及形态或美感。而 “draped” 不仅覆盖，还强调覆盖物的流动感、层次感和视觉效果，常用于描述布料、帷幔等柔软材质的优雅覆盖方式。"
    },
    {
      "word_to_compare": "swathe",
      "analysis": "“Swathe” (包裹) 指用布料紧密、多层地缠绕某物，常用于医疗包扎或婴儿襁褓，强调紧缚和包裹的严密性。而 “draped” 则是松散、自然地垂落，不施加压力，更注重视觉上的轻盈与流动感。"
    }
  ]
}