{
  "word": "drawn",
  "pronunciation": "drawn",
  "concise_definition": "adj. 被拉的, 被吸引的, 疲惫的, 紧张的",
  "forms": {
    "base_form": "draw",
    "past_tense": "drew",
    "past_participle": "drawn",
    "present_participle": "drawing"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having been pulled or attracted toward something, often used to describe a strong emotional or physical pull, such as being drawn to a person, idea, or place.",
      "explanation_cn": "指被某种力量（情感、吸引力或物理作用）拉向某物，常用于描述对某人、某种想法或某个地方的强烈吸引。",
      "example_en": "She was drawn to the arts from a young age.",
      "example_cn": "她从小就被艺术所吸引。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Showing signs of fatigue, tension, or stress, especially in facial features — often used to describe a weary or strained appearance.",
      "explanation_cn": "形容面部或整体状态显露出疲惫、紧张或压力的迹象，常用于描述憔悴或紧绷的外表。",
      "example_en": "After weeks of sleepless nights, he looked drawn and pale.",
      "example_cn": "连续几周失眠后，他看起来面容憔悴、脸色苍白。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Created by the act of drawing, especially in the context of art or design — referring to something that has been sketched or depicted.",
      "explanation_cn": "指通过绘画行为所创造的，尤其在艺术或设计语境中，指被素描或描绘出来的事物。",
      "example_en": "The artist’s drawn portrait captured the subject’s emotion perfectly.",
      "example_cn": "这位艺术家的素描肖像完美地捕捉到了人物的情感。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "attracted",
      "analysis": "“Attracted” (被吸引的) 是一个更通用的动词被动形式，强调吸引力的产生，常用于物理、化学或社会情境。而 “drawn” 更具文学性和情感色彩，常用于表达一种难以抗拒的、潜意识的吸引，语气更细腻、更富诗意。"
    },
    {
      "word_to_compare": "tired",
      "analysis": "“Tired” (疲倦的) 是描述身体或精神疲劳的最直接、最常用词，侧重于主观感受。而 “drawn” 描述的是疲劳在外观上的外在表现，如面部线条紧绷、眼神黯淡，更强调视觉印象而非主观状态。"
    },
    {
      "word_to_compare": "sketched",
      "analysis": "“Sketched” (草图的) 专指快速、简略的绘画行为，强调过程的临时性和不完整。而 “drawn” 是更广泛的术语，可涵盖从速写到精细素描的所有绘画形式，语义范围更广，且可作形容词独立使用，而 “sketched” 多作动词过去分词或限定性修饰语。"
    }
  ]
}