{
  "word": "draw",
  "pronunciation": "drɔ",
  "concise_definition": "v. 绘画, 拉, 吸引, 抽取, 得出; n. 平局, 抽签",
  "forms": {
    "third_person_singular": "draws",
    "past_tense": "drew",
    "past_participle": "drawn",
    "present_participle": "drawing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To make a picture or diagram by using lines, especially with a pencil, pen, or brush.",
      "explanation_cn": "指用铅笔、钢笔或画笔等工具通过线条绘制图像或图表。",
      "example_en": "She drew a portrait of her grandmother using charcoal.",
      "example_cn": "她用炭笔为祖母画了一幅肖像。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pull or attract something toward oneself, often with force or effort.",
      "explanation_cn": "指用力量或努力将某物拉向自己，也可引申为吸引注意力或兴趣。",
      "example_en": "The magnet drew the iron filings toward it.",
      "example_cn": "磁铁把铁屑吸了过去。"
    },
    {
      "pos": "verb",
      "explanation_en": "To attract or elicit a response, such as attention, interest, or people.",
      "explanation_cn": "指引起注意、兴趣或吸引人群，常用于描述人、地方或事物的吸引力。",
      "example_en": "The concert drew a crowd of over 50,000 people.",
      "example_cn": "这场音乐会吸引了五万多人前来观看。"
    },
    {
      "pos": "verb",
      "explanation_en": "To take or obtain something from a source, such as withdrawing money from a bank or selecting a card from a deck.",
      "explanation_cn": "指从某处取出或获取某物，如从银行取款或从牌堆中抽牌。",
      "example_en": "He drew $200 from the ATM this morning.",
      "example_cn": "他今天早上从自动取款机取了200美元。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reach a conclusion or inference based on evidence or reasoning.",
      "explanation_cn": "指根据证据或推理得出结论或推论。",
      "example_en": "From the data, we can draw the conclusion that the policy is ineffective.",
      "example_cn": "根据这些数据，我们可以得出结论：这项政策是无效的。"
    },
    {
      "pos": "noun",
      "explanation_en": "A tie or result in which no side wins, especially in a game or competition.",
      "explanation_cn": "指比赛中双方得分相等、无人获胜的平局结果。",
      "example_en": "The match ended in a 1-1 draw.",
      "example_cn": "这场比赛以1比1平局收场。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of selecting something randomly, such as a name from a hat or a number in a lottery.",
      "explanation_cn": "指从容器中随机抽取某物的行为，如从帽子中抽签或彩票抽奖。",
      "example_en": "The winner of the prize was chosen by a random draw.",
      "example_cn": "奖品的中奖者是通过随机抽签选出的。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sketch",
      "analysis": "“Sketch”（速写/草图）强调快速、简略地勾勒出轮廓或初步构想，通常不追求细节或完成度，多用于创作初期。而 “draw” 是更广泛的术语，可涵盖从草图到精细画作的全过程，强调动作本身，不必然暗示简略性。"
    },
    {
      "word_to_compare": "pull",
      "analysis": "“Pull”（拉）侧重于物理上的牵引力，常用于直接施加力量移动物体，如拉门、拉绳子。而 “draw” 在表示“拉”时，常带有更柔和、持续或间接的意味，如吸引注意力、抽签，甚至隐喻性地引导某人。"
    },
    {
      "word_to_compare": "infer",
      "analysis": "“Infer”（推断）专指通过已有信息或证据进行逻辑推理得出结论，强调思维过程，通常用于学术或理性语境。而 “draw a conclusion” 是一个固定搭配，虽语义相近，但 “draw” 更具动作性，常用于口语和书面语中，语气更通俗。"
    }
  ]
}