{
  "word": "drawing",
  "pronunciation": "draw·ing",
  "concise_definition": "n. 绘画, 图画, 吸引, 抽签",
  "forms": {
    "plural": "drawings"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A picture made with lines and shading using pencils, pens, or other tools, often to represent objects, people, or scenes.",
      "explanation_cn": "指用铅笔、钢笔或其他工具以线条和明暗绘制的图像，通常用于表现物体、人物或场景。",
      "example_en": "She showed me her detailed drawing of the cathedral.",
      "example_cn": "她给我看了她绘制的那座大教堂的详细图画。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or process of creating such a picture; the skill or art of producing visual representations with lines and tones.",
      "explanation_cn": "指创作此类图像的行为或过程；亦指通过线条与明暗表现视觉形象的技巧或艺术。",
      "example_en": "Drawing is one of the fundamental skills taught in art school.",
      "example_cn": "绘画是美术学院教授的基本技能之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A selection made by chance, such as in a lottery or competition, where winners are chosen randomly.",
      "explanation_cn": "指通过随机方式作出的选择，如抽奖或竞赛中抽中获奖者。",
      "example_en": "The winner of the prize was announced in the weekly drawing.",
      "example_cn": "每周抽签中，中奖者被公布了出来。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of attracting or pulling something toward oneself, especially in a figurative sense (e.g., attracting attention or interest).",
      "explanation_cn": "指吸引或把某物拉向自己，尤指比喻意义上的吸引注意力或兴趣。",
      "example_en": "The museum’s new exhibit has become a major drawing for tourists.",
      "example_cn": "博物馆的新展览已成为吸引游客的一大亮点。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sketch",
      "analysis": "“Sketch” (草图) 通常指快速、简略、未完成的绘画，用于捕捉灵感或初步构想，强调临时性和非正式性。而 “drawing” 更广泛，可以是精细、完整、经过深思熟虑的作品，不一定局限于草稿阶段。"
    },
    {
      "word_to_compare": "illustration",
      "analysis": "“Illustration” (插图) 通常具有明确的说明性目的，常用于书籍、杂志或广告中配合文字解释内容，强调功能性。而 “drawing” 更侧重于艺术表达，其目的可以是审美、情感或个人创作，不一定附属于文本。"
    },
    {
      "word_to_compare": "painting",
      "analysis": "“Painting” (绘画/油画) 使用颜料和媒介（如油彩、水彩）覆盖表面，强调色彩、质感和层次。而 “drawing” 主要依赖线条、阴影和单色或有限色彩，更注重轮廓与结构。两者在媒介和技法上有本质区别。"
    }
  ]
}