{
  "word": "dream",
  "pronunciation": "dreehm",
  "concise_definition": "n. 梦, 梦想, 愿望; v. 做梦, 梦想, 幻想",
  "forms": {
    "third_person_singular": "dreams",
    "past_tense": "dreamed/dreamt",
    "past_participle": "dreamed/dreamt",
    "present_participle": "dreaming"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A series of thoughts, images, and emotions occurring during sleep, often with a narrative or symbolic quality.",
      "explanation_cn": "指人在睡眠中经历的一系列思想、图像和情绪，通常具有叙事性或象征性。",
      "example_en": "Last night I had a vivid dream about flying over the ocean.",
      "example_cn": "昨晚我做了一个关于在海洋上空飞翔的生动梦境。"
    },
    {
      "pos": "noun",
      "explanation_en": "A cherished aspiration, ambition, or goal that one hopes to achieve, often representing deep personal desire or idealism.",
      "explanation_cn": "指一个人渴望实现的珍视的理想、抱负或目标，常代表深层的个人愿望或理想主义。",
      "example_en": "Her dream is to open a school for underprivileged children in rural areas.",
      "example_cn": "她的梦想是在农村地区为贫困儿童开办一所学校。"
    },
    {
      "pos": "verb",
      "explanation_en": "To experience a series of mental images and sensations during sleep.",
      "explanation_cn": "指在睡眠中经历一系列心理图像和感觉。",
      "example_en": "He dreams every night, but rarely remembers his dreams in the morning.",
      "example_cn": "他每晚都做梦，但很少记得早晨的梦境。"
    },
    {
      "pos": "verb",
      "explanation_en": "To imagine or contemplate something desirable as if it were real, often with a sense of longing or hope.",
      "explanation_cn": "指将某件令人向往的事物当作真实存在来想象或沉思，常带有渴望或希望的情感。",
      "example_en": "She dreams of traveling the world and writing novels in quiet coastal towns.",
      "example_cn": "她梦想着环游世界，并在宁静的海滨小镇写小说。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fantasy",
      "analysis": "“Fantasy” (幻想) 指完全脱离现实的想象，通常带有虚构、不切实际或逃避现实的色彩，多用于文学、艺术或心理语境。而 “dream” 可以是现实的抱负（如职业梦想），也可以是睡眠中的体验，情感上更具希望和目标导向。"
    },
    {
      "word_to_compare": "vision",
      "analysis": "“Vision” (远见/愿景) 通常指清晰、有条理、有战略性的未来图景，常用于领导力或组织规划中，强调理性与规划。而 “dream” 更感性、主观，可能缺乏实现路径，但充满情感力量。"
    },
    {
      "word_to_compare": "nightmare",
      "analysis": "“Nightmare” (噩梦) 是 “dream” 的负面变体，特指令人恐惧、焦虑或痛苦的梦境。虽然同属睡眠中的心理体验，但 “nightmare” 带有强烈负面情绪，而 “dream” 通常中性或积极。"
    }
  ]
}