{
  "word": "dreamers",
  "pronunciation": "dree·murs",
  "concise_definition": "n. 梦想家, 空想家, 追梦者",
  "forms": {
    "singular": "dreamer"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who has vivid imagination and often thinks about idealistic or ambitious goals, sometimes without regard for practicality or reality.",
      "explanation_cn": "指富有想象力、常思考理想化或雄心勃勃目标的人，有时忽视现实或可行性。",
      "example_en": "Many great inventions were first conceived by dreamers who refused to accept the limits of their time.",
      "example_cn": "许多伟大的发明最初都源于那些不愿接受时代局限的梦想家。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is disconnected from reality, often lost in fantasies or daydreams, sometimes to the point of inaction.",
      "explanation_cn": "指脱离现实、沉溺于幻想或白日梦中的人，有时甚至因此无所作为。",
      "example_en": "He’s a dreamer who spends hours imagining life on Mars but never studies engineering.",
      "example_cn": "他是一个梦想家，花数小时幻想在火星上的生活，却从不学习工程学。"
    },
    {
      "pos": "noun",
      "explanation_en": "In political or social contexts, a person who is undocumented but was brought to a country as a child and seeks legal status or protection, especially in the U.S. context (short for 'DREAMer').",
      "explanation_cn": "在政治或社会语境中，特指被带入某国（尤指美国）时为儿童、现无合法身份但寻求合法居留或保护的人（'DREAMer' 的缩写，源自《梦想法案》）。",
      "example_en": "The new policy aims to protect DREAMers who have grown up in the United States and consider it their home.",
      "example_cn": "新政策旨在保护那些在美国长大并视其为家园的追梦者。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "idealists",
      "analysis": "“Idealists”（理想主义者）强调对道德、社会或政治完美状态的信念与追求，通常带有哲学或伦理色彩，且往往愿意为之行动；而 “dreamers” 更侧重于想象和愿景本身，可能缺乏实际行动力，甚至被视作不切实际。"
    },
    {
      "word_to_compare": "visionaries",
      "analysis": "“Visionaries”（远见卓识者）指那些拥有超前洞察力并能将愿景转化为现实的人，通常带有褒义，强调创新与领导力；而 “dreamers” 可能仅停留在想象层面，未必具备实现愿景的能力或计划，语义中性甚至略带贬义。"
    },
    {
      "word_to_compare": "fantasists",
      "analysis": "“Fantasists”（幻想者）更强调脱离现实的、非理性的幻想，常含贬义，暗示心理逃避或病态倾向；而 “dreamers” 虽也可能不切实际，但常带有情感共鸣或敬意，尤其在文化语境中（如‘追梦人’）具有积极意义。"
    }
  ]
}