{
  "word": "dredging",
  "pronunciation": "dredj·ing",
  "concise_definition": "n. 挖泥, 挖掘; v. 挖掘, 挖泥, 翻找",
  "forms": {
    "noun": "dredging",
    "verb_third_person_singular": "dredges",
    "verb_past_tense": "dredged",
    "verb_past_participle": "dredged",
    "verb_present_participle": "dredging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of removing sediment, debris, or other materials from the bottom of bodies of water using a specialized machine, typically to deepen channels, maintain navigation routes, or reclaim land.",
      "explanation_cn": "使用专用机械从水体底部清除沉积物、杂物或其他物质的过程，通常用于加深航道、维持通航路线或填海造地。",
      "example_en": "The port authority approved a major dredging project to accommodate larger cargo ships.",
      "example_cn": "港口当局批准了一项大规模的挖泥工程，以容纳更大的货轮。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove sediment or debris from the bottom of a body of water using a dredge, often for engineering or environmental purposes.",
      "explanation_cn": "使用挖泥机从水体底部清除沉积物或杂物，通常用于工程或环境目的。",
      "example_en": "Workers are dredging the riverbed to prevent flooding during the rainy season.",
      "example_cn": "工人们正在疏浚河床，以防止雨季发生洪水。"
    },
    {
      "pos": "verb",
      "explanation_en": "To search thoroughly or persistently for something, especially information or evidence that is hidden, forgotten, or difficult to find.",
      "explanation_cn": "彻底或坚持不懈地搜寻某物，尤其是隐藏、遗忘或难以找到的信息或证据。",
      "example_en": "The journalist spent weeks dredging up old records to uncover the corruption scandal.",
      "example_cn": "这位记者花了数周时间翻查旧档案，以揭露这场腐败丑闻。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "excavation",
      "analysis": "“Excavation” (挖掘) 指在陆地上进行的挖掘活动，如考古发掘或建筑地基开挖，强调从地面或地下移除土壤和岩石。而 “dredging” 专指在水下进行的挖掘，对象是泥沙、淤积物等水底沉积物，应用场景不同。"
    },
    {
      "word_to_compare": "mining",
      "analysis": "“Mining” (采矿) 是指从地下或地表开采有价值的矿物资源，如煤炭、金属矿石，目的是获取经济价值材料。而 “dredging” 的主要目的通常是工程性（如通航）或环保性（如清淤），而非资源开采，尽管有时会伴随矿产回收。"
    },
    {
      "word_to_compare": "rummaging",
      "analysis": "“Rummaging” (翻找) 是一种非正式、随意的搜寻行为，常用于寻找物品或信息，语气较轻松，不强调系统性。而 “dredging” 在比喻义中带有强烈的目的性和持久性，常用于严肃语境，如调查、研究或揭露隐秘真相，语义更正式、更沉重。"
    }
  ]
}