{
  "word": "dresses",
  "pronunciation": "dres",
  "concise_definition": "n. 连衣裙, 女装; v. 给...穿衣, 穿上礼服",
  "forms": {
    "singular": "dress"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A garment worn by women and girls, typically consisting of a bodice and skirt joined together, extending from the shoulders to the legs, and often worn for formal or casual occasions.",
      "explanation_cn": "一种由上身和裙摆连为一体的女性服装，从肩部延伸至腿部，常用于正式或休闲场合。",
      "example_en": "She wore a beautiful silk dress to the wedding.",
      "example_cn": "她穿着一件漂亮的丝绸连衣裙参加婚礼。"
    },
    {
      "pos": "noun",
      "explanation_en": "A style or type of clothing designed for women, often used collectively to refer to women's fashion as a category.",
      "explanation_cn": "专为女性设计的服装款式，常用于泛指女性服饰类别。",
      "example_en": "The fashion show featured the latest dresses from top designers.",
      "example_cn": "这场时装秀展出了顶级设计师的最新连衣裙系列。"
    },
    {
      "pos": "verb",
      "explanation_en": "To put clothing on someone, especially formal or ceremonial attire; to clothe or adorn someone in a particular way.",
      "explanation_cn": "给某人穿上衣服，尤指正式或仪式性的服装；以某种方式为某人着装或装饰。",
      "example_en": "The maid dressed the little girl in her Sunday best.",
      "example_cn": "女仆给小女孩穿上了她最好的星期日礼服。"
    },
    {
      "pos": "verb",
      "explanation_en": "To wear a particular type of clothing, especially in a formal or symbolic context.",
      "explanation_cn": "穿着某种特定的服装，尤指在正式或象征性语境中。",
      "example_en": "The judges dressed in black robes for the ceremony.",
      "example_cn": "法官们在仪式上穿着黑色长袍。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "gown",
      "analysis": "“Gown”（长袍/礼服）通常指更正式、更长、更庄重的女性服装，如晚礼服、学位服或手术服，强调仪式感和长度；而 “dress” 是更通用的词，涵盖从日常到正式的各种连衣裙，适用范围更广。"
    },
    {
      "word_to_compare": "skirt",
      "analysis": "“Skirt”（裙子）仅指下身部分，需搭配上衣穿着；而 “dress” 是完整的上下连体服装，无需额外搭配。因此 “dress” 是一个独立完整的服饰单元，而 “skirt” 是其组成部分。"
    },
    {
      "word_to_compare": "outfit",
      "analysis": "“Outfit”（全套服装）泛指一个人整体的穿着搭配，包括上衣、裤子、鞋子、配饰等；而 “dress” 专指一件连体的女性服装，是 “outfit” 的一个子集。使用 “outfit” 更强调搭配的整体性，而 “dress” 强调单品本身。"
    }
  ]
}