{
  "word": "drifting",
  "pronunciation": "drif·ting",
  "concise_definition": "v. 漂流, 漂荡, 漫无目的地移动; n. 漂流, 漂荡",
  "forms": {
    "base_form": "drift",
    "third_person_singular": "drifts",
    "past_tense": "drifted",
    "past_participle": "drifted",
    "present_participle": "drifting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move slowly and aimlessly, typically carried by a current of air, water, or other external force, without control or direction.",
      "explanation_cn": "指在空气、水流或其他外力作用下缓慢而无目的地移动，缺乏控制或明确方向。",
      "example_en": "The boat was drifting slowly toward the rocks.",
      "example_cn": "小船正缓缓漂向岩石。"
    },
    {
      "pos": "verb",
      "explanation_en": "To gradually change or shift in opinion, behavior, or position over time, often without conscious intent.",
      "explanation_cn": "指随着时间推移，观点、行为或立场逐渐发生改变，通常并非有意为之。",
      "example_en": "Over the years, his political views have been drifting toward the center.",
      "example_cn": "多年来，他的政治观点逐渐向中间靠拢。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or travel in a relaxed, unfocused manner, often implying a lack of purpose or urgency.",
      "explanation_cn": "指以轻松、漫无目的的方式移动或行进，常暗示缺乏目标或紧迫感。",
      "example_en": "She spent the afternoon drifting through the art gallery, admiring the paintings.",
      "example_cn": "她下午漫无目的地逛着美术馆，欣赏着画作。"
    },
    {
      "pos": "noun",
      "explanation_en": "The action or process of drifting, especially in a natural or uncontrolled way.",
      "explanation_cn": "指漂流或漂荡的行为或过程，尤指自然或无控制的状态。",
      "example_en": "The drifting of icebergs in the Arctic has increased due to climate change.",
      "example_cn": "由于气候变化，北极冰山的漂流现象日益增多。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "floating",
      "analysis": "“Floating”（漂浮）强调物体因密度小于介质而停留在表面或悬浮于其中，通常指物理状态，如木头浮在水上。而 “drifting” 更强调在流动介质中被动移动的过程，带有方向性或持续性，不一定仅限于表面。"
    },
    {
      "word_to_compare": "wandering",
      "analysis": "“Wandering”（漫游）通常指有意识但无固定目标的行走或移动，常用于人或动物，隐含主观选择的自由。而 “drifting” 更强调被动性，受外力驱动，缺乏主观意志，常用于抽象概念（如思想、情绪）或无生命物体。"
    },
    {
      "word_to_compare": "sliding",
      "analysis": "“Sliding”（滑动）指物体沿表面平稳移动，通常有接触和摩擦，强调物理轨迹和方式。而 “drifting” 更多用于无接触或弱接触的环境（如空气、水流），强调无方向、无动力的自然移动，语义更抽象和诗意。"
    }
  ]
}