{
  "word": "drills",
  "pronunciation": "drilz",
  "concise_definition": "n. 训练, 演习, 钻孔; v. 训练, 演习, 钻孔",
  "forms": {
    "singular": "drill"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A repeated practice or exercise, especially one designed to improve skill, discipline, or readiness, often in military, athletic, or educational contexts.",
      "explanation_cn": "指为提高技能、纪律性或准备度而进行的重复性练习，常见于军事、体育或教育场景。",
      "example_en": "The soldiers performed morning drills to maintain their physical fitness and coordination.",
      "example_cn": "士兵们进行晨间操练，以保持体能和协调性。"
    },
    {
      "pos": "noun",
      "explanation_en": "A tool or machine used for making holes, typically by rotating a cutting or abrasive point against a surface.",
      "explanation_cn": "指用于在物体表面钻孔的工具或机器，通常通过旋转切削或研磨头实现。",
      "example_en": "He used a power drill to hang the shelf securely on the wall.",
      "example_cn": "他用电钻将书架牢固地安装在墙上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To train someone repeatedly in a particular skill or procedure through practice, often with strict discipline.",
      "explanation_cn": "指通过反复练习，以严格纪律的方式训练某人掌握某项技能或程序。",
      "example_en": "The teacher drilled the students on verb conjugations until they could recite them flawlessly.",
      "example_cn": "老师反复训练学生练习动词变位，直到他们能流利背诵为止。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a hole in something using a drill or similar tool.",
      "explanation_cn": "指使用钻头或类似工具在物体上钻孔。",
      "example_en": "They drilled holes in the metal plate to attach the brackets.",
      "example_cn": "他们在金属板上钻孔以安装支架。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "exercise",
      "analysis": "“Exercise” (锻炼/练习) 是一个更广泛的术语，泛指任何形式的身体或脑力活动，不一定具有重复性或强制性。而 “drill” 强调高度重复、结构化和纪律性的训练，常带有军事或标准化的色彩。"
    },
    {
      "word_to_compare": "practice",
      "analysis": "“Practice” (练习) 指为提高技能而进行的常规性活动，通常较自由、灵活，强调积累经验。而 “drill” 更侧重于机械性、高强度的重复训练，目标是形成肌肉记忆或自动化反应，常带有紧迫感或强制性。"
    },
    {
      "word_to_compare": "bore",
      "analysis": "“Bore” (钻孔/挖洞) 是一个动词，强调钻孔的动作本身，但不包含训练含义。而 “drill” 作为动词时，既可指钻孔，也可指训练，语义更丰富。作为名词时，“bore” 通常指孔洞本身，而 “drill” 指工具或训练活动。"
    }
  ]
}