{
  "word": "drill",
  "pronunciation": "dril",
  "concise_definition": "n. 钻孔, 训练, 演习; v. 钻孔, 训练, 反复练习",
  "forms": {
    "third_person_singular": "drills",
    "past_tense": "drilled",
    "past_participle": "drilled",
    "present_participle": "drilling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A tool with a rotating cutting edge used to make holes in hard materials such as wood, metal, or rock.",
      "explanation_cn": "一种带有旋转切削刃的工具，用于在木材、金属或岩石等硬质材料上钻孔。",
      "example_en": "He used a power drill to install the shelf on the wall.",
      "example_cn": "他用电动钻在墙上安装了搁板。"
    },
    {
      "pos": "noun",
      "explanation_en": "A repeated practice or exercise, especially one designed to improve skill, discipline, or readiness, often in military, sports, or educational contexts.",
      "explanation_cn": "一种重复性的练习或训练，尤其用于提高技能、纪律性或准备度，常见于军事、体育或教育场景。",
      "example_en": "The soldiers participated in a fire drill to practice emergency evacuation procedures.",
      "example_cn": "士兵们参加消防演习，以练习紧急疏散程序。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a hole in a surface using a rotating tool, typically powered by electricity or manual force.",
      "explanation_cn": "使用旋转工具（通常由电力或人力驱动）在表面钻孔。",
      "example_en": "The carpenter drilled holes for the screws before assembling the cabinet.",
      "example_cn": "木匠在组装橱柜前先钻好了螺丝孔。"
    },
    {
      "pos": "verb",
      "explanation_en": "To train or instruct someone repeatedly in a particular skill or procedure until it becomes automatic or deeply ingrained.",
      "explanation_cn": "通过反复训练或指导某人掌握某项技能或程序，使其成为本能或根深蒂固的习惯。",
      "example_en": "The teacher drilled the students in verb conjugations until they could recite them without hesitation.",
      "example_cn": "老师反复训练学生练习动词变位，直到他们能毫不迟疑地背诵出来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bore",
      "analysis": "“Bore”（钻孔）与 “drill” 在物理钻孔意义上可互换，但 “bore” 更强调孔洞本身或钻孔动作的持续性，常用于描述自然形成或缓慢进行的孔洞（如河流侵蚀岩层）；而 “drill” 更强调使用工具主动、有目的的钻孔行为，且常用于机械或技术语境。"
    },
    {
      "word_to_compare": "practice",
      "analysis": "“Practice”（练习）是泛指为提高技能而进行的重复性活动，强调过程和习惯养成；而 “drill” 是一种更严格、更机械、更强调纪律性和精确性的重复训练，常带有军事或标准化训练的色彩，如 ‘drill sergeant’（军士长）所执行的训练。"
    },
    {
      "word_to_compare": "exercise",
      "analysis": "“Exercise”（锻炼/练习）范围更广，可指身体活动、脑力训练或任何形式的操练，强调健康或能力提升；而 “drill” 更侧重于通过高度重复、标准化的步骤来强化特定反应或技能，常带有强制性和程序性，如 ‘marching drill’（行军操练）。"
    }
  ]
}