{
  "word": "drilling",
  "pronunciation": "dril·ing",
  "concise_definition": "n. 钻孔, 钻探, 训练, 反复练习",
  "forms": {
    "base_form": "drill",
    "third_person_singular": "drills",
    "past_tense": "drilled",
    "past_participle": "drilled",
    "present_participle": "drilling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of making a hole in a solid material, especially rock or earth, using a rotating tool called a drill, often for exploration, extraction, or construction purposes.",
      "explanation_cn": "使用旋转工具（钻头）在固体材料（如岩石或土壤）中开孔的过程，常用于勘探、开采或建筑工程。",
      "example_en": "The oil company began drilling for petroleum beneath the ocean floor.",
      "example_cn": "石油公司开始在海底下方钻探石油。"
    },
    {
      "pos": "noun",
      "explanation_en": "A systematic and repetitive practice or training session designed to improve skill, discipline, or readiness, often in military, athletic, or educational contexts.",
      "explanation_cn": "为提高技能、纪律性或准备度而进行的系统性、重复性训练，常见于军事、体育或教育场景。",
      "example_en": "The soldiers underwent hours of drilling in formation and weapon handling.",
      "example_cn": "士兵们接受了数小时的队列和武器操作训练。"
    },
    {
      "pos": "noun",
      "explanation_en": "A method of teaching or learning through repeated exercises to reinforce memory or automatic response, such as in language or math drills.",
      "explanation_cn": "通过重复练习来强化记忆或形成自动反应的教学或学习方法，如语言或数学的反复操练。",
      "example_en": "Language students benefit from vocabulary drilling to build fluency.",
      "example_cn": "语言学习者通过词汇反复练习来提高流利度。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "boring",
      "analysis": "“Boring”（钻孔）与 “drilling” 在工程语境中可互换，但 “boring” 更强调“挖洞”这一动作本身，常用于隧道或地下工程，而 “drilling” 更广泛用于指使用钻机进行的精确、高速或有目的的穿孔行为，如油井钻探或金属加工。"
    },
    {
      "word_to_compare": "practice",
      "analysis": "“Practice”（练习）是泛指为提高技能而进行的任何重复性活动，强调过程和习惯养成；而 “drilling” 是一种更严格、更机械、更强调重复性和纪律性的练习形式，常带有强制性或标准化特征，如军事操练或语法填空训练。"
    },
    {
      "word_to_compare": "training",
      "analysis": "“Training”（培训）是一个更宽泛的术语，涵盖系统性学习、指导和技能发展，可能包括理论、模拟和实践；而 “drilling” 是培训中的一个具体手段，侧重于通过高强度、重复性动作来固化行为或反应，是训练的子集。"
    }
  ]
}