{
  "word": "drinks",
  "pronunciation": "drɪŋks",
  "concise_definition": "n. 饮料, 饮品; v. 喝, 饮用",
  "forms": {
    "singular": "drink",
    "third_person_singular": "drinks",
    "past_tense": "drank",
    "past_participle": "drunk",
    "present_participle": "drinking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Any liquid intended for consumption, especially those consumed to quench thirst or for pleasure, including water, juice, tea, coffee, and alcoholic beverages.",
      "explanation_cn": "指任何用于饮用的液体，尤其是为解渴或享受而饮用的饮品，包括水、果汁、茶、咖啡和酒精饮料。",
      "example_en": "The bar offers a wide selection of drinks, from soft sodas to premium cocktails.",
      "example_cn": "这家酒吧提供种类繁多的饮品，从软饮料到高档鸡尾酒应有尽有。"
    },
    {
      "pos": "noun",
      "explanation_en": "A specific serving or portion of a beverage, often consumed in one go, especially in social or ceremonial contexts.",
      "explanation_cn": "指在社交或仪式场合中一次性饮用的一份饮品。",
      "example_en": "He ordered a drink at the pub and sat quietly by the window.",
      "example_cn": "他在酒吧点了一杯酒，静静地坐在窗边。"
    },
    {
      "pos": "verb",
      "explanation_en": "To consume a liquid by swallowing it, typically for hydration, nourishment, or enjoyment.",
      "explanation_cn": "指通过吞咽来摄入液体，通常是为了补水、营养或享受。",
      "example_en": "She drinks coffee every morning before work.",
      "example_cn": "她每天早上上班前都喝咖啡。"
    },
    {
      "pos": "verb",
      "explanation_en": "To consume alcoholic beverages, often in excess or in a social setting, implying habitual or recreational use.",
      "explanation_cn": "指饮用酒精饮料，常带有过量或在社交场合中饮用的含义，暗示习惯性或娱乐性使用。",
      "example_en": "They were drinking heavily at the party last night.",
      "example_cn": "昨晚他们在聚会上喝得很多。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "beverage",
      "analysis": "“Beverage”（饮料）是更正式、更广泛的术语，涵盖所有可饮用的液体，包括水、茶、咖啡、果汁等，常用于书面语或商业语境（如菜单、产品标签）。而 “drink” 更口语化，使用范围更广，可指单次饮用的份量，也可用于指酒精饮品，语义更灵活。"
    },
    {
      "word_to_compare": "liquid",
      "analysis": "“Liquid”（液体）是纯粹的物理状态描述，泛指任何呈液态的物质，包括非饮用的液体如油、水银等。而 “drink” 专指可供人类饮用的液体，具有明确的功能性和目的性，语义范围远小于 “liquid”。"
    },
    {
      "word_to_compare": "sip",
      "analysis": "“Sip”（小口喝）强调饮用的动作方式——缓慢、少量地啜饮，常用于描述优雅或谨慎的饮用行为。而 “drink” 是中性动词，泛指任何饮用行为，不涉及速度或量的细节。例如：She sipped her tea（她小口啜饮茶） vs. She drank her tea（她喝了茶）。"
    }
  ]
}