{
  "word": "drive",
  "pronunciation": "drahv",
  "concise_definition": "v. 驾驶, 驱动, 推动; n. 驾驶, 车程, 干劲",
  "forms": {
    "third_person_singular": "drives",
    "past_tense": "drove",
    "past_participle": "driven",
    "present_participle": "driving"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To operate and control the movement of a vehicle, especially a car, truck, or other motorized transport.",
      "explanation_cn": "指操作并控制汽车、卡车或其他机动交通工具的行驶。",
      "example_en": "She drives to work every morning using the highway.",
      "example_cn": "她每天早上都开车走高速公路去上班。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to move or function by applying force or energy, often mechanically or physically.",
      "explanation_cn": "指通过施加力量或能量使某物运动或运作，通常指机械或物理上的驱动。",
      "example_en": "The wind drives the sails of the boat forward.",
      "example_cn": "风推动着船的帆向前行进。"
    },
    {
      "pos": "verb",
      "explanation_en": "To motivate or compel someone to act, often with strong determination or pressure, whether internal or external.",
      "explanation_cn": "指以强烈的决心或压力（内在或外在）促使某人采取行动。",
      "example_en": "His ambition drives him to work longer hours than anyone else in the office.",
      "example_cn": "他的雄心驱使他比办公室里任何人都工作更长时间。"
    },
    {
      "pos": "noun",
      "explanation_en": "A journey made in a vehicle, typically for a specific purpose or over a particular distance.",
      "explanation_cn": "指乘坐车辆进行的一段旅程，通常有特定目的或特定距离。",
      "example_en": "We went for a long drive through the countryside on Sunday.",
      "example_cn": "周日我们开车去乡下兜了一大圈。"
    },
    {
      "pos": "noun",
      "explanation_en": "A strong internal motivation or determination to achieve a goal, often characterized by energy and persistence.",
      "explanation_cn": "指为实现目标而具备的强烈内在动力，常表现为精力充沛和坚持不懈。",
      "example_en": "She has the drive and discipline needed to become a top athlete.",
      "example_cn": "她具备成为一名顶尖运动员所需的干劲和自律。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "operate",
      "analysis": "“Operate”（操作）强调对机器、系统或程序的控制和运行，通常不涉及物理移动，如操作手术设备或电脑系统。而 “drive” 更侧重于控制交通工具的运动，或在比喻意义上推动人或事物向前发展，更具动态性和方向性。"
    },
    {
      "word_to_compare": "push",
      "analysis": "“Push”（推动）指施加直接的物理或心理力量使某物移动或改变状态，常为短暂、外力驱动；而 “drive” 更强调持续、内在或系统性的推动力，如驱动力（driving force）或内在动机，语义更深刻、更持久。"
    },
    {
      "word_to_compare": "transport",
      "analysis": "“Transport”（运输）是一个中性术语，指将人或物从一处移动到另一处，强调的是过程本身，不涉及操作者。而 “drive” 强调由人主动操控车辆完成移动，包含主观能动性，常用于第一人称或具体行为者。"
    }
  ]
}