{
  "word": "drives",
  "pronunciation": "draɪvz",
  "concise_definition": "n. 驱动, 动机, 驱车旅行; v. 驾驶, 驱动, 推动",
  "forms": {
    "base_form": "drive",
    "third_person_singular": "drives",
    "past_tense": "drove",
    "past_participle": "driven",
    "present_participle": "driving"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To operate a vehicle such as a car, truck, or bus by controlling its movement and direction.",
      "explanation_cn": "指操控汽车、卡车或公共汽车等交通工具，控制其行驶和方向。",
      "example_en": "She drives to work every morning at 7 a.m.",
      "example_cn": "她每天早上七点开车去上班。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to move or function by applying force or energy, often mechanically or electronically.",
      "explanation_cn": "指通过施加力量或能量使某物运动或运作，通常用于机械或电子设备。",
      "example_en": "The wind drives the turbines to generate electricity.",
      "example_cn": "风力驱动涡轮机发电。"
    },
    {
      "pos": "verb",
      "explanation_en": "To motivate or compel someone to act, often by strong internal or external pressure.",
      "explanation_cn": "指通过强烈的内在或外在压力促使某人采取行动。",
      "example_en": "His ambition drives him to work longer hours than anyone else in the team.",
      "example_cn": "他的雄心驱使他比团队中任何人都工作更长时间。"
    },
    {
      "pos": "noun",
      "explanation_en": "A journey made in a vehicle, especially for pleasure, exercise, or a specific purpose.",
      "explanation_cn": "指乘坐交通工具进行的旅程，尤其用于休闲、锻炼或特定目的。",
      "example_en": "We went for a long drive through the countryside last weekend.",
      "example_cn": "上周末我们开车去乡下兜了一圈。"
    },
    {
      "pos": "noun",
      "explanation_en": "A strong internal motivation or desire that pushes someone toward achieving a goal.",
      "explanation_cn": "指推动某人实现目标的强烈内在动力或欲望。",
      "example_en": "Her drive to succeed came from her difficult childhood.",
      "example_cn": "她成功的动力源于她艰难的童年。"
    },
    {
      "pos": "noun",
      "explanation_en": "A computer storage device that reads and writes data, such as a hard drive or USB drive.",
      "explanation_cn": "指计算机中用于读写数据的存储设备，如硬盘或U盘。",
      "example_en": "I need to back up my files to an external drive before upgrading the system.",
      "example_cn": "在升级系统之前，我需要把文件备份到一个外接硬盘上。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "motivates",
      "analysis": "“Motivates” (激励) 更侧重于心理层面的鼓励或激发，常用于描述情感、目标或奖励如何影响行为。而 “drives” 更强调一种持续、强烈甚至不可抗拒的内在力量，常带有生理或本能的意味，如饥饿驱动觅食，野心驱动成功。"
    },
    {
      "word_to_compare": "operates",
      "analysis": "“Operates” (操作) 指对机器或系统进行控制或管理，强调程序性或技术性动作，不必然包含动力或能量的传递。而 “drives” 强调提供动力或能量使系统运行，如发动机驱动车轮，而非仅仅操作按钮。"
    },
    {
      "word_to_compare": "travels",
      "analysis": "“Travels” (旅行) 是一个中性词，泛指从一地到另一地的移动行为，不强调交通工具或目的。而 “drive” 作为名词时特指“驾车出行”，隐含了使用车辆、可能有明确路线或目的（如郊游、通勤），语义更具体。"
    },
    {
      "word_to_compare": "pushes",
      "analysis": "“Pushes” (推动) 是一个更通用的物理或比喻性动词，可指外力施加，有时带有强迫或临时性。而 “drives” 在比喻义中更持久、更深层，常与内在动力（如野心、激情）相关，语义更丰富且更具主动性。"
    }
  ]
}