{
  "word": "driven",
  "pronunciation": "driv·uhn",
  "concise_definition": "adj. 有动力的, 有驱动力的, 被驱动的",
  "forms": {
    "base_form": "drive",
    "present_participle": "driving",
    "past_tense": "drove",
    "past_participle": "driven"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Motivated by a strong internal force, ambition, or determination to achieve a goal, often to the point of obsession or relentless effort.",
      "explanation_cn": "指被强烈的内在动力、抱负或决心所驱使，为实现目标而不懈努力，有时甚至达到近乎执念的程度。",
      "example_en": "She is a driven entrepreneur who works 16 hours a day to build her startup.",
      "example_cn": "她是一位充满动力的创业者，每天工作16小时来打造自己的初创公司。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Powered or controlled by a specific mechanism, force, or system, often in a technical or mechanical context.",
      "explanation_cn": "指由某种特定机制、力量或系统所驱动或控制的，常用于技术或机械语境中。",
      "example_en": "The car is front-wheel driven, offering better traction on slippery roads.",
      "example_cn": "这辆车是前轮驱动，能在湿滑路面上提供更好的抓地力。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Influenced or compelled by an external factor, such as economic pressure, social expectation, or emotional need.",
      "explanation_cn": "指受外部因素（如经济压力、社会期望或情感需求）所驱使或强迫的状态。",
      "example_en": "Driven by fear of failure, he took the risky job offer despite his doubts.",
      "example_cn": "由于害怕失败，他尽管心存疑虑，还是接受了这份有风险的工作。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "motivated",
      "analysis": "“Motivated”（有动机的）强调有明确的外部或内部诱因促使行动，语气较中性，可强可弱。而 “driven” 暗示更强烈、更持久、甚至不可抗拒的内在冲动，常带有情感张力或紧迫感。"
    },
    {
      "word_to_compare": "ambitious",
      "analysis": "“Ambitious”（有雄心的）侧重于对成就、地位或权力的渴望，通常与目标的高度相关。而 “driven” 更强调实现目标的过程和持续的努力，即使目标本身并不一定宏大。一个有雄心的人未必是被驱使的，但一个被驱使的人往往有雄心。"
    },
    {
      "word_to_compare": "compelled",
      "analysis": "“Compelled”（被迫的）强调外部压力或义务迫使行动，常带有被动或无奈的意味。而 “driven” 多数情况下是主动的、自我激励的，即使驱动力来自内心深处的恐惧或责任，也仍保留着主体性。"
    }
  ]
}