{
  "word": "driver",
  "pronunciation": "dray·vur",
  "concise_definition": "n. 司机, 驱动器, 驱动因素, 有驱动力的人",
  "forms": {
    "plural": "drivers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who operates or controls a vehicle, especially a car, truck, or other motorized transport.",
      "explanation_cn": "指操作或控制车辆（尤其是汽车、卡车或其他机动交通工具）的人。",
      "example_en": "The driver stopped at the red light and waited for the green signal.",
      "example_cn": "司机在红灯前停下，等待绿灯亮起。"
    },
    {
      "pos": "noun",
      "explanation_en": "A software component that enables a computer to communicate with and control a hardware device, such as a printer or graphics card.",
      "explanation_cn": "指一种软件组件，使计算机能够与硬件设备（如打印机或显卡）通信并对其进行控制。",
      "example_en": "You need to install the latest printer driver for your operating system to recognize the device.",
      "example_cn": "你需要为操作系统安装最新的打印机驱动程序，以便识别该设备。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or factor that motivates or causes something to happen, often acting as a primary force behind an action or change.",
      "explanation_cn": "指促使某事发生的人或因素，通常是推动某一行动或变化的主要动力。",
      "example_en": "Economic inequality has been a major driver of social unrest in many countries.",
      "example_cn": "经济不平等是许多国家社会动荡的主要驱动因素。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is highly motivated, ambitious, or determined to achieve success, often in a competitive context.",
      "explanation_cn": "指在竞争环境中极具动力、有抱负或决心取得成功的人。",
      "example_en": "She's a real driver—she started her own company before she turned 25.",
      "example_cn": "她是个真正的实干家——25岁前就创办了自己的公司。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "operator",
      "analysis": "“Operator”（操作员）泛指操作机器、系统或设备的人，范围更广，可包括电话接线员、起重机操作员等，不一定涉及驾驶。而 “driver” 特指驾驶交通工具的人，语义更具体。"
    },
    {
      "word_to_compare": "catalyst",
      "analysis": "“Catalyst”（催化剂）强调在化学或抽象情境中加速或引发变化的外部因素，本身不参与最终结果，仅起触发作用。而 “driver” 是推动变化的主动力量，常是持续参与并主导过程的核心因素。"
    },
    {
      "word_to_compare": "motivator",
      "analysis": "“Motivator”（激励者）侧重于心理或情感层面的鼓励，常用于人际关系或管理语境，如导师或领导。而 “driver” 更强调实际的推动力和执行力，既可以是人也可以是抽象因素，且常带有结果导向的含义。"
    }
  ]
}