{
  "word": "drones",
  "pronunciation": "drohnz",
  "concise_definition": "n. 无人机, 工蜂, 单调的声音",
  "forms": {
    "singular": "drone"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An unmanned aircraft or vehicle that is remotely controlled or flies autonomously using software-controlled flight plans, often equipped with sensors and cameras for surveillance, delivery, or recreational purposes.",
      "explanation_cn": "指一种无需人类飞行员 onboard，通过远程操控或预设软件程序自主飞行的飞行器，常配备传感器和摄像头，用于监控、送货或娱乐。",
      "example_en": "The police used drones to monitor the crowd during the festival.",
      "example_cn": "警方在节日期间使用无人机监控人群。"
    },
    {
      "pos": "noun",
      "explanation_en": "A male bee whose sole function is to mate with the queen; unlike worker bees, drones do not collect nectar or defend the hive.",
      "explanation_cn": "指雄蜂，其唯一功能是与蜂后交配；与工蜂不同，雄蜂不采集花蜜，也不保卫蜂巢。",
      "example_en": "In the fall, worker bees expel the drones from the hive to conserve resources.",
      "example_cn": "秋季，工蜂会将雄蜂驱逐出蜂巢以节省资源。"
    },
    {
      "pos": "noun",
      "explanation_en": "A continuous, monotonous, low humming or buzzing sound, often produced by machinery or insects.",
      "explanation_cn": "指持续、单调、低沉的嗡嗡声，通常由机械或昆虫发出。",
      "example_en": "The drone of the airplane engine lulled the child to sleep.",
      "example_cn": "飞机引擎的嗡嗡声让孩子昏昏欲睡。"
    },
    {
      "pos": "verb",
      "explanation_en": "To speak in a monotonous, dull tone, often for an extended period.",
      "explanation_cn": "以单调、乏味的语调说话，通常持续很长时间。",
      "example_en": "He droned on about his vacation for over an hour.",
      "example_cn": "他喋喋不休地讲了超过一个小时的度假经历。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "uav",
      "analysis": "“UAV”（无人驾驶航空器）是“drone”的技术性术语，专指军事或工业用途的无人飞行器，语义更精确、正式。而 “drone” 更常用于日常语境，涵盖消费级、娱乐性飞行器，甚至带有贬义或拟人化色彩。"
    },
    {
      "word_to_compare": "bee",
      "analysis": "“Bee”（蜜蜂）泛指所有蜜蜂，包括工蜂和蜂后，而 “drone” 特指雄蜂，是其子类。在生物学语境中，两者不可互换；但在比喻用法中，“drone” 可引申为无用或懒惰的人，而 “bee” 常象征勤劳。"
    },
    {
      "word_to_compare": "hum",
      "analysis": "“Hum”（嗡嗡声）与 “drone” 在描述持续低音时可互换，但 “hum” 更中性，常用于描述电器、引擎等发出的稳定声音；而 “drone” 更强调单调、令人厌烦的持续性，常带有负面情感色彩。"
    }
  ]
}