{
  "word": "drugged",
  "pronunciation": "druhgd",
  "concise_definition": "adj. 被用药的, 麻醉的, 神志不清的",
  "forms": {
    "base_form": "drug",
    "past_tense": "drugged",
    "past_participle": "drugged",
    "present_participle": "drugging",
    "adjective_form": "drugged"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Under the influence of drugs, especially illicit or sedative substances, resulting in altered consciousness, impaired judgment, or physical sluggishness.",
      "explanation_cn": "受药物（尤其是非法或镇静类药物）影响，导致意识改变、判断力受损或身体迟钝的状态。",
      "example_en": "The driver was found drugged and unable to operate the vehicle safely.",
      "example_cn": "发现该司机服药后神志不清，无法安全驾驶车辆。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Intentionally administered with a drug, often without consent, to incapacitate or manipulate someone (e.g., in cases of drugging a drink).",
      "explanation_cn": "指被人故意下药（常在未经同意的情况下），以使某人失去行动能力或被操控（例如在饮料中下药）。",
      "example_en": "She realized she had been drugged after waking up with no memory of the previous night.",
      "example_cn": "她醒来后对前一晚毫无记忆，才意识到自己被人下了药。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Affected by the effects of a drug, whether recreational, medicinal, or accidental; describing a state of altered perception or behavior.",
      "explanation_cn": "受药物作用影响的状态，无论该药物是娱乐性、药用性还是误服所致，表现为知觉或行为的改变。",
      "example_en": "The drugged patient stared blankly at the ceiling, barely responsive to questions.",
      "example_cn": "这位服药后的病人呆滞地望着天花板，对提问几乎毫无反应。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "intoxicated",
      "analysis": "“Intoxicated”（醉酒/中毒）通常特指因酒精或毒品导致的精神或身体失常，语义范围较窄，常用于法律或医学语境。而 “drugged” 更广泛，可指任何药物（包括处方药、镇静剂、迷幻剂）引起的异常状态，不一定涉及酒精。"
    },
    {
      "word_to_compare": "sedated",
      "analysis": "“Sedated”（镇静的）特指因使用镇静剂而处于放松、昏睡或意识减弱的状态，通常是医疗行为下的可控状态。而 “drugged” 更中性甚至带有负面含义，常暗示非自愿、滥用或非法用药，不局限于医疗目的。"
    },
    {
      "word_to_compare": "high",
      "analysis": "“High”（兴奋/飘然）是口语化表达，多用于描述因吸食大麻、可卡因等致幻剂产生的愉悦性精神状态。它强调主观快感，而 “drugged” 更强调客观的药物影响，可能伴随痛苦、混乱或危险，语义更严肃且中性。"
    }
  ]
}