{
  "word": "drug",
  "pronunciation": "druhg",
  "concise_definition": "n. 药物, 毒品; v. 给…服药, 用药物麻醉",
  "forms": {
    "plural": "drugs",
    "third_person_singular": "drugs",
    "past_tense": "drugged",
    "past_participle": "drugged",
    "present_participle": "drugging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A chemical substance used to treat, cure, or prevent disease, or to alter physiological function, typically prescribed or regulated by medical authorities.",
      "explanation_cn": "指用于治疗、治愈或预防疾病，或改变生理功能的化学物质，通常由医疗当局处方或监管。",
      "example_en": "The doctor prescribed a new drug to manage her chronic pain.",
      "example_cn": "医生开了一种新药来控制她的慢性疼痛。"
    },
    {
      "pos": "noun",
      "explanation_en": "A substance that alters mood, perception, or behavior, often illegally used for recreational purposes and potentially addictive.",
      "explanation_cn": "指能改变情绪、感知或行为的物质，常被非法用于娱乐目的，具有成瘾性。",
      "example_en": "The police seized several kilograms of illegal drugs during the raid.",
      "example_cn": "警方在突袭中缴获了数公斤非法毒品。"
    },
    {
      "pos": "verb",
      "explanation_en": "To administer a drug to someone, especially to impair their judgment, consciousness, or physical control, often without their knowledge or consent.",
      "explanation_cn": "指给某人服用药物，尤其是为了削弱其判断力、意识或身体控制力，通常是在其不知情或未同意的情况下。",
      "example_en": "She suspected her drink had been drugged at the party.",
      "example_cn": "她怀疑自己在派对上的饮料被人下了药。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "medication",
      "analysis": "“Medication”（药物治疗）是更正式、更中性的术语，专指用于医疗目的的药物，不包含非法或滥用的含义。而 “drug” 一词范围更广，既可指合法药品，也可指非法毒品，语义上更具歧义和情感色彩。"
    },
    {
      "word_to_compare": "chemical",
      "analysis": "“Chemical”（化学物质）是一个更宽泛的科学术语，泛指任何由化学元素组成的物质，包括水、盐、酸等，不特指具有药理或精神作用的物质。而 “drug” 特指具有生理或心理效应的化学物质，用途更具体。"
    },
    {
      "word_to_compare": "addictive substance",
      "analysis": "“Addictive substance”（成瘾性物质）是描述性短语，强调物质导致依赖的特性，常用于医学或心理学语境。而 “drug” 是一个名词性术语，可独立使用，涵盖成瘾性与非成瘾性物质，且在日常语言中更常用，甚至可作为动词使用。"
    }
  ]
}