{
  "word": "drums",
  "pronunciation": "drumz",
  "concise_definition": "n. 鼓, 鼓声, 鼓乐",
  "forms": {
    "singular": "drum"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A musical instrument consisting of a hollow cylinder or bowl with a stretched membrane (head) at one or both ends, played by striking with sticks, hands, or brushes to produce rhythmic sounds.",
      "explanation_cn": "一种打击乐器，由中空的圆柱体或碗状体构成，一端或两端蒙有紧绷的膜（鼓面），通过用鼓槌、手或刷子敲击发出节奏性声音。",
      "example_en": "The drummer played a powerful beat that drove the entire band forward.",
      "example_cn": "鼓手敲出强劲的节奏，推动了整个乐队的演奏。"
    },
    {
      "pos": "noun",
      "explanation_en": "The sound produced by striking a drum; also used metaphorically to refer to a rhythmic or repetitive noise.",
      "explanation_cn": "敲击鼓所发出的声音；也可比喻性地指有节奏的或重复性的噪音。",
      "example_en": "The drums of the marching band echoed through the streets.",
      "example_cn": "行进乐队的鼓声在街道上回荡。"
    },
    {
      "pos": "noun",
      "explanation_en": "A collective term for a set of percussion instruments including snare, bass, toms, and cymbals, commonly used in rock, jazz, and pop music.",
      "explanation_cn": "指一套包括军鼓、低音鼓、通通鼓和钹等打击乐器的组合，广泛用于摇滚、爵士和流行音乐中。",
      "example_en": "She spent years mastering the drums and now performs professionally.",
      "example_cn": "她花了多年时间钻研鼓技，如今已成为职业鼓手。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slang or informal term for the ears, often used in phrases like 'beat the drums' to mean 'to hear something'.",
      "explanation_cn": "俚语或非正式用语，指耳朵，常用于短语如 'beat the drums' 表示‘听到某事’。",
      "example_en": "I heard the news — my drums were ringing with the gossip.",
      "example_cn": "我听到了这个消息——耳朵里全是流言蜚语。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "percussion",
      "analysis": "“Percussion”（打击乐器）是一个更广泛的类别，包括所有通过敲击发声的乐器，如木琴、三角铁、康加鼓等。而 “drums” 是 percussion 中最常见、最具节奏主导性的子类，特指有鼓面的打击乐器。"
    },
    {
      "word_to_compare": "beat",
      "analysis": "“Beat”（节奏/节拍）是音乐中的时间结构单位，是抽象概念；而 “drums” 是实现 beat 的物理工具或声音来源。可以说 drums produce the beat，但 beat 本身不是乐器。"
    },
    {
      "word_to_compare": "tambourine",
      "analysis": "“Tambourine”（铃鼓）也是一种打击乐器，但结构不同：它通常有小金属片（jingles）围绕鼓面，主要发出沙沙声而非低沉的鼓声。drums 以低频、共鸣的敲击声为主，而 tambourine 更强调高频、清脆的装饰性音效。"
    }
  ]
}