{
  "word": "drum",
  "pronunciation": "drum",
  "concise_definition": "n. 鼓, 敲鼓; v. 敲击, 击鼓, 连续敲打",
  "forms": {
    "plural": "drums",
    "third_person_singular": "drums",
    "past_tense": "drummed",
    "past_participle": "drummed",
    "present_participle": "drumming"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A musical instrument consisting of a hollow cylinder or bowl with a tightly stretched membrane (head) at one or both ends, played by striking with sticks or hands to produce rhythmic sounds.",
      "explanation_cn": "一种打击乐器，由中空的圆柱体或碗状体构成，一端或两端蒙有紧绷的膜（鼓面），通过用鼓槌或手掌敲击发出节奏性声音。",
      "example_en": "The drummer kept a steady beat throughout the concert.",
      "example_cn": "鼓手在整个音乐会中保持了稳定的节奏。"
    },
    {
      "pos": "noun",
      "explanation_en": "A cylindrical container, typically made of metal or wood, used for storing or transporting goods such as oil, paint, or food.",
      "explanation_cn": "一种圆柱形容器，通常由金属或木材制成，用于储存或运输油、油漆、食品等物品。",
      "example_en": "They shipped the olive oil in 55-gallon drums.",
      "example_cn": "他们用55加仑的桶运输橄榄油。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strike a drum or any surface rhythmically with the fingers, hands, or sticks, often to produce music or signal.",
      "explanation_cn": "用手指、手掌或鼓槌有节奏地敲击鼓或其他表面，通常为了演奏音乐或发出信号。",
      "example_en": "She drummed her fingers on the table while waiting for the results.",
      "example_cn": "她在等待结果时用手指敲打着桌子。"
    },
    {
      "pos": "verb",
      "explanation_en": "To transmit information or ideas persistently and repetitively, often through propaganda or advertising.",
      "explanation_cn": "通过反复、持续地传播信息或观点，常用于宣传或广告语境中。",
      "example_en": "The campaign is drumming up support for the new policy.",
      "example_cn": "这场运动正在积极为新政策争取支持。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "beat",
      "analysis": "“Beat” (敲打) 是一个更广泛的动词，泛指任何有节奏或无节奏的击打动作，可用于身体、物体或音乐。而 “drum” 特指用特定方式（如连续快速敲击）模仿鼓的节奏，常带有音乐性或重复性，语义更具体。"
    },
    {
      "word_to_compare": "tambourine",
      "analysis": "“Tambourine” (铃鼓) 是一种具体的打击乐器，通常带有金属片，声音更清脆、明亮，常用于伴奏。而 “drum” 是一种基础打击乐器，以低沉、共鸣的节奏为主，两者在音色和结构上不同，但常在乐队中配合使用。"
    },
    {
      "word_to_compare": "barrel",
      "analysis": "“Barrel” (桶) 与 “drum” 在作为容器时可互换，但 “barrel” 通常指两端略收、中间鼓起的传统木桶，常用于酒类储存；而 “drum” 更强调标准圆柱形金属容器，多用于工业运输，语义上更偏向现代、标准化容器。"
    }
  ]
}