{
  "word": "dry",
  "pronunciation": "drī",
  "concise_definition": "adj. 干的, 无酒的, 无趣的; v. 使变干; n. 干燥状态",
  "forms": {
    "third_person_singular": "dries",
    "past_tense": "dried",
    "past_participle": "dried",
    "present_participle": "drying",
    "comparative": "drier",
    "superlative": "driest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Free from moisture or liquid; not wet or damp, often describing physical conditions of objects, skin, or environments.",
      "explanation_cn": "不含水分或液体的；不湿或不潮湿的，常用于描述物体、皮肤或环境的物理状态。",
      "example_en": "The desert air was dry and hot, making it hard to breathe.",
      "example_cn": "沙漠的空气干燥而炎热，让人难以呼吸。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Not containing alcohol or sugar; referring to wines, cocktails, or beverages with minimal sweetness or alcoholic content.",
      "explanation_cn": "不含酒精或糖分的；指葡萄酒、鸡尾酒或其他饮料中甜度或酒精含量极低。",
      "example_en": "She prefers a dry martini with just a twist of lemon.",
      "example_cn": "她更喜欢只加一片柠檬皮的干马提尼。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Lacking humor, excitement, or emotional appeal; dull or uninteresting in style or content.",
      "explanation_cn": "缺乏幽默感、刺激性或情感吸引力的；风格或内容枯燥无味。",
      "example_en": "His lecture was so dry that half the class fell asleep.",
      "example_cn": "他的讲座太枯燥了，一半学生都睡着了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove moisture or liquid from something, either naturally or by using heat, air, or absorbent materials.",
      "explanation_cn": "通过自然方式或使用热、空气或吸水材料，从某物中去除水分或液体。",
      "example_en": "She dried her hair with a towel after the shower.",
      "example_cn": "她洗完澡后用毛巾擦干头发。"
    },
    {
      "pos": "noun",
      "explanation_en": "A state or period of extreme lack of moisture, especially in weather or agriculture; often used in phrases like 'a dry spell'.",
      "explanation_cn": "极度缺乏水分的状态或时期，尤指天气或农业中的干旱；常用于如‘干旱期’等短语中。",
      "example_en": "The region is suffering through its third consecutive dry.",
      "example_cn": "该地区正经历连续第三个干旱年。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "arid",
      "analysis": "“Arid”（干旱的）专指气候或土地极度缺水、不适合植物生长的状态，常用于地理或生态语境，语气更正式、更极端。而 “dry” 是通用词，可描述任何程度的缺水，包括日常语境如干燥的皮肤或饮料。"
    },
    {
      "word_to_compare": "parched",
      "analysis": "“Parched”（干裂的）强调因极度缺水而导致的焦渴、龟裂或不适感，常带有强烈感官描写，如“parched throat”（干裂的喉咙），情感色彩更浓。而 “dry” 是中性描述，不隐含痛苦或严重性。"
    },
    {
      "word_to_compare": "sober",
      "analysis": "“Sober”（清醒的/严肃的）在描述酒精饮料时可与 “dry” 互换（如 sober wine），但其更广泛含义是“清醒的、不醉的”或“严肃认真的”，而 “dry” 仅聚焦于无糖无酒精的特性。在形容性格或风格时，“sober” 指庄重克制，“dry” 则指冷幽默或乏味。"
    }
  ]
}