{
  "word": "duality",
  "pronunciation": "doo·al·uh·tee",
  "concise_definition": "n. 二元性, 二重性, 对立统一",
  "forms": {
    "plural": "dualities"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The state or quality of having two distinct, often opposing, aspects or elements that coexist within a single system or entity, especially when they are interdependent or complementary.",
      "explanation_cn": "指一个系统或实体中同时存在两个截然不同、常为对立的方面或元素，且这些方面相互依存或互补。",
      "example_en": "The duality of human nature—good and evil—has been a central theme in literature for centuries.",
      "example_cn": "人性的二元性——善与恶——几个世纪以来一直是文学的核心主题。"
    },
    {
      "pos": "noun",
      "explanation_en": "In physics and philosophy, the concept that a single entity can exhibit two fundamentally different properties or behaviors depending on context, such as wave-particle duality.",
      "explanation_cn": "在物理学和哲学中，指某一实体在不同情境下可表现出两种根本不同的性质或行为，例如波粒二象性。",
      "example_en": "Quantum mechanics reveals the duality of light: it behaves as both a wave and a particle.",
      "example_cn": "量子力学揭示了光的二元性：它既表现为波，也表现为粒子。"
    },
    {
      "pos": "noun",
      "explanation_en": "A philosophical or spiritual belief in two fundamental principles or forces that govern reality, such as yin and yang, or mind and matter.",
      "explanation_cn": "一种哲学或精神信仰，认为现实由两种根本原则或力量支配，例如阴阳，或心与物。",
      "example_en": "In Taoist thought, the duality of yin and yang represents the balance of opposing forces in the universe.",
      "example_cn": "在道家思想中，阴阳的二元性代表了宇宙中对立力量的平衡。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "dichotomy",
      "analysis": "“Dichotomy”（二分法）强调将事物明确划分为两个互斥、非此即彼的类别，常带有割裂或对立的意味，如‘自然 vs. 文化’。而 ‘duality’ 更强调两个对立面共存、互动甚至融合，具有内在统一性，不必然排斥对方。"
    },
    {
      "word_to_compare": "ambiguity",
      "analysis": "“Ambiguity”（模糊性）指某事物因表达不清或多重解释而产生不确定性，是认知层面的混乱。而 ‘duality’ 是客观存在的双重属性，是结构或本质上的双重性，不涉及误解或含糊。"
    },
    {
      "word_to_compare": "dualism",
      "analysis": "“Dualism”（二元论）是哲学体系中的理论立场，主张世界由两种根本不同的实体构成（如灵魂与肉体），是一种形而上学主张。而 ‘duality’ 是描述现象或属性的中性术语，不必然承诺某种本体论立场，更广泛用于科学、文化或日常语境中。"
    }
  ]
}