{
  "word": "dub",
  "pronunciation": "duhb",
  "concise_definition": "v. 给……命名, 册封, 为……配音; n. 配音, 册封仪式",
  "forms": {
    "third_person_singular": "dubs",
    "past_tense": "dubbed",
    "past_participle": "dubbed",
    "present_participle": "dubbing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To officially confer a title, especially the title of knight, upon someone in a ceremonial act.",
      "explanation_cn": "指在正式仪式中授予某人头衔，尤其是骑士爵位。",
      "example_en": "The king dubbed Sir William as a knight for his bravery in battle.",
      "example_cn": "国王因威廉爵士在战场上的英勇而册封他为骑士。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give someone or something a particular name or nickname, often informally or humorously.",
      "explanation_cn": "指非正式或幽默地为某人或某物赋予一个特定的名称或绰号。",
      "example_en": "Fans dubbed the new quarterback 'The Gunslinger' for his fearless throws.",
      "example_cn": "粉丝们因这位新四分卫无所畏惧的投球风格，称他为‘枪手’。"
    },
    {
      "pos": "verb",
      "explanation_en": "To add or replace spoken dialogue or sound in a film, television show, or recording, especially in a different language.",
      "explanation_cn": "指在电影、电视节目或录音中添加或替换对白或声音，尤其是使用另一种语言。",
      "example_en": "The Japanese anime was dubbed into English for international audiences.",
      "example_cn": "这部日本动画被配音成英语，以供国际观众观看。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process or result of adding synchronized sound, especially dialogue, to a film or video in a language different from the original recording.",
      "explanation_cn": "指为电影或视频添加与画面同步的声音（尤其是对白）的过程或结果，通常用于不同语言的版本。",
      "example_en": "The dubbing of the movie was poorly done, making the characters sound unnatural.",
      "example_cn": "这部电影的配音质量很差，使角色听起来很不自然。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "title",
      "analysis": "“Title” (头衔) 是一个名词，指被授予的正式称谓（如博士、爵士），而 “dub” 作为动词，强调授予头衔的动作本身，具有仪式性和行为性。不能说 'He has a title' 等同于 'He was dubbed'，前者是状态，后者是事件。"
    },
    {
      "word_to_compare": "nickname",
      "analysis": "“Nickname” (绰号) 是一个名词，指非正式的称呼，而 “dub” 作为动词时，指赋予绰号的行为。虽然两者都涉及命名，但 “dub” 更具主动性与权威性，常用于媒体或公众语境中，带有传播和认可的意味。"
    },
    {
      "word_to_compare": "voice-over",
      "analysis": "“Voice-over” (画外音) 通常指未出现在画面中的人物声音，如纪录片旁白或广告解说，声音来源与画面角色无关；而 “dubbing” 是指将原声替换为与角色口型同步的另一种语言对白，强调角色声音的重新演绎与匹配。"
    }
  ]
}