{
  "word": "ducks",
  "pronunciation": "duks",
  "concise_definition": "n. 鸭子（复数）; v. 躲避, 低头躲闪（第三人称单数）",
  "forms": {
    "singular": "duck",
    "third_person_singular": "ducks",
    "past_tense": "ducked",
    "past_participle": "ducked",
    "present_participle": "ducking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A waterbird with a broad blunt bill, short legs, and webbed feet, typically found in ponds, rivers, or wetlands; often kept for meat or eggs.",
      "explanation_cn": "一种生活在池塘、河流或湿地的水鸟，具有宽而钝的喙、短腿和蹼足，常被饲养以获取肉或蛋。",
      "example_en": "A flock of ducks glided gracefully across the pond.",
      "example_cn": "一群鸭子优雅地滑过池塘。"
    },
    {
      "pos": "noun",
      "explanation_en": "A low, quick movement of the head or body to avoid being hit, especially in sports or combat.",
      "explanation_cn": "为躲避击打而迅速低头或俯身的动作，尤见于体育或格斗中。",
      "example_en": "He made a quick duck to avoid the flying ball.",
      "example_cn": "他迅速低头躲开了飞来的球。"
    },
    {
      "pos": "verb",
      "explanation_en": "To lower the head or body quickly to avoid being struck or seen, often in response to danger or an approaching object.",
      "explanation_cn": "为躲避打击或被看见而迅速低下头或身体，常用于应对危险或逼近的物体。",
      "example_en": "The players ducked as the ball came flying over the net.",
      "example_cn": "球员们见球飞过球网，纷纷低头躲避。"
    },
    {
      "pos": "verb",
      "explanation_en": "To evade or avoid something, especially responsibility or a difficult situation, often in a clever or temporary way.",
      "explanation_cn": "巧妙或暂时地回避某事，尤指责任或困难的局面。",
      "example_en": "He tried to duck the question by changing the subject.",
      "example_cn": "他试图通过转移话题来回避这个问题。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "birds",
      "analysis": "“Birds”（鸟类）是所有鸟类的总称，范围广泛，包括鹰、麻雀、鸽子等；而 “ducks” 是特指鸭科动物，具有蹼足、扁喙和水生习性等显著特征，属于鸟类中的一个具体类群。"
    },
    {
      "word_to_compare": "evade",
      "analysis": "“Evade”（逃避）强调系统性或策略性地避开责任、法律或问题，语气更正式、更消极；而 “duck” 作为动词时，常指短暂、本能或机敏的躲避，语气更口语化，有时带有轻巧或逃避的意味。"
    },
    {
      "word_to_compare": "dodge",
      "analysis": "“Dodge”（闪避）与 “duck” 在躲避动作上非常接近，都指快速移动身体避开攻击；但 “dodge” 更常用于运动语境（如拳击、足球），强调身体的横向或侧向闪避，而 “duck” 更强调垂直方向的低头动作，也更常用于非体育语境中的言语回避。"
    }
  ]
}