{
  "word": "duel",
  "pronunciation": "doo·el",
  "concise_definition": "n. 决斗, 比赛; v. 决斗, 竞争",
  "forms": {
    "plural": "duels",
    "third_person_singular": "duels",
    "past_tense": "dueled",
    "past_participle": "dueled",
    "present_participle": "dueling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A prearranged combat between two people, typically with weapons, to settle a dispute or defend honor, often following a code of conduct.",
      "explanation_cn": "指两人之间为解决争端或维护荣誉而预先安排的武装对决，通常遵循某种行为准则。",
      "example_en": "In the 18th century, gentlemen often settled disputes through a duel with pistols.",
      "example_cn": "在18世纪，绅士们常通过手枪决斗来解决争端。"
    },
    {
      "pos": "noun",
      "explanation_en": "A contest or rivalry between two parties, often intense and public, for supremacy, victory, or dominance in a non-physical context.",
      "explanation_cn": "指两个个体或团体之间为争夺主导权、胜利或优势而展开的激烈且公开的竞争，不一定是身体上的对抗。",
      "example_en": "The presidential election became a bitter duel between two charismatic candidates.",
      "example_cn": "总统选举演变成两位富有魅力的候选人之间激烈的较量。"
    },
    {
      "pos": "verb",
      "explanation_en": "To engage in a duel, especially with weapons, to resolve a personal conflict or challenge.",
      "explanation_cn": "指两人进行决斗，尤其是使用武器，以解决个人冲突或回应挑战。",
      "example_en": "The two rivals dueled at dawn after exchanging insults the night before.",
      "example_cn": "两位对手在前一晚互相对骂后，于黎明时分决斗。"
    },
    {
      "pos": "verb",
      "explanation_en": "To compete fiercely with another person or group for a goal, often in a public or high-stakes setting.",
      "explanation_cn": "指与另一方在公开或高风险的环境中激烈竞争，以争取某一目标。",
      "example_en": "The two tech giants are dueling for market leadership in artificial intelligence.",
      "example_cn": "这两家科技巨头正在人工智能领域激烈争夺市场主导权。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fight",
      "analysis": "“Fight” (战斗) 是一个更广泛、更通用的词，泛指任何形式的身体冲突或对抗，可以是多人参与、无规则、无预谋的。而 “duel” 特指两人之间有规则、有仪式感、通常为荣誉而战的正式对抗，更具历史和文化内涵。"
    },
    {
      "word_to_compare": "contest",
      "analysis": "“Contest” (竞赛) 指任何形式的比拼，包括体育、智力或艺术比赛，通常不涉及暴力，且规则明确、目的为公平竞争。而 “duel” 虽也可用于比喻意义，但其本义带有对抗性和危险性，常隐含生死或尊严的代价。"
    },
    {
      "word_to_compare": "rivalry",
      "analysis": "“Rivalry” (竞争/敌对关系) 指长期存在的竞争状态，可能持续数年甚至数十年，不一定是直接对抗。而 “duel” 强调一次性的、具体的对抗事件，即使在比喻用法中，也指向一个明确的交锋时刻。"
    }
  ]
}