{
  "word": "dummies",
  "pronunciation": "dum·eez",
  "concise_definition": "n. 无知的人, 傻瓜, 人偶, 示意图",
  "forms": {
    "singular": "dummy"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who is perceived as lacking intelligence or common sense; often used informally or derogatorily to describe someone who acts foolishly.",
      "explanation_cn": "指被认为缺乏智慧或常识的人；常用于非正式或贬义语境，形容行为愚蠢的人。",
      "example_en": "He kept asking the same question over and over — what a dummy!",
      "example_cn": "他一遍又一遍地问同一个问题——真是个傻瓜！"
    },
    {
      "pos": "noun",
      "explanation_en": "A mannequin or model used to display clothing, products, or for testing purposes, often resembling a human form.",
      "explanation_cn": "用于展示服装、产品或用于测试的人体模型或假人，通常形似人类。",
      "example_en": "The store window featured a dummy dressed in the latest summer fashion.",
      "example_cn": "商店橱窗里摆着一个穿着最新夏季时尚服饰的假人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A simplified diagram, chart, or representation used to explain complex systems or processes, especially in instructional materials.",
      "explanation_cn": "在教材或说明材料中，用于解释复杂系统或流程的简化图示或示意图。",
      "example_en": "The book uses dummies to show how the engine works without technical jargon.",
      "example_cn": "这本书使用示意图来解释发动机的工作原理，避免使用专业术语。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is used by others to carry blame or take the fall for their mistakes, often unknowingly.",
      "explanation_cn": "指被他人利用来承担错误或过错责任的人，通常本人并不知情。",
      "example_en": "She was made a dummy for the team’s failure, even though she had no control over the decision.",
      "example_cn": "尽管她对这个决定毫无控制权，却成了团队失败的替罪羊。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fool",
      "analysis": "“Fool”（傻瓜）更侧重于性格或行为上的愚昧，常带有道德或智力上的贬义，而 “dummy” 更口语化，有时甚至用于调侃，语气较轻，也可能指无意识的无知，而非主观愚蠢。"
    },
    {
      "word_to_compare": "mannequin",
      "analysis": "“Mannequin”（人体模型）是 “dummy” 在展示用途中的更专业、更中性的术语，专指用于服装展示的模型，而 “dummy” 可用于更广泛的非人形模型（如汽车测试假人），语义范围更广。"
    },
    {
      "word_to_compare": "guide",
      "analysis": "“Guide”（指南）是为帮助理解而提供的系统性说明，而 “dummy” 在此语境下特指一种极度简化、视觉化的辅助图示，常用于入门级材料（如《For Dummies》系列），强调‘零基础友好’而非全面性。"
    }
  ]
}