{
  "word": "dummy",
  "pronunciation": "dum·ee",
  "concise_definition": "n. 傻瓜, 人偶, 代用品; adj. 傻的, 无实际功能的",
  "forms": {
    "plural": "dummies"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who is perceived as foolish, gullible, or easily manipulated, often used in a derogatory or humorous context.",
      "explanation_cn": "指被认为愚蠢、轻信或容易被操纵的人，常用于贬义或幽默语境。",
      "example_en": "He fell for the scam — what a dummy!",
      "example_cn": "他上了这个骗局的当——真是个傻瓜！"
    },
    {
      "pos": "noun",
      "explanation_en": "A mannequin or model used to display clothing, products, or for testing purposes, often resembling a human form.",
      "explanation_cn": "用于展示服装、产品或用于测试的假人或模型，通常为人形。",
      "example_en": "The store uses life-sized dummies to showcase the new winter coats.",
      "example_cn": "这家商店使用真人大小的假人来展示新款冬装。"
    },
    {
      "pos": "noun",
      "explanation_en": "A substitute or placeholder object that serves no real function but is used for simulation, testing, or structural purposes.",
      "explanation_cn": "指没有实际功能、仅用于模拟、测试或结构支撑的替代物或假件。",
      "example_en": "The engineers installed a dummy battery to test the device's housing.",
      "example_cn": "工程师安装了一个假电池来测试设备外壳。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Lacking intelligence or function; not real or operational, often used to describe something designed to appear functional but is inert.",
      "explanation_cn": "缺乏智力或功能的；非真实的或非运行的，常用于描述看似有功能但实际是惰性的物品。",
      "example_en": "She pressed the dummy button just to see if it would light up.",
      "example_cn": "她按了那个假按钮，想看看它会不会亮起来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mannequin",
      "analysis": "“Mannequin”（人体模型）特指用于展示服装的逼真人体模型，强调其视觉展示功能，通常为艺术性或商业性用途。而 “dummy” 更广泛，可指任何无功能的替代物，包括电子设备中的假零件，语义范围更广且常含贬义。"
    },
    {
      "word_to_compare": "fool",
      "analysis": "“Fool”（傻瓜）是直接指智力低下或行为愚蠢的人，语气更严肃或冒犯；“dummy” 作为人时语气较轻，常用于口语或调侃，有时甚至带有亲昵色彩，语义强度较低。"
    },
    {
      "word_to_compare": "placeholder",
      "analysis": "“Placeholder”（占位符）是技术或设计术语，指临时替代真实内容的符号或结构，强调其过渡性与功能性目的。而 “dummy” 更强调‘无实际作用’，常用于物理对象或非技术语境，如假按钮、假电池等。"
    }
  ]
}