{
  "word": "dumping",
  "pronunciation": "dum·ping",
  "concise_definition": "n. 倾销, 倾倒, 扔弃",
  "forms": {
    "base_form": "dump",
    "present_participle": "dumping",
    "past_tense": "dumped",
    "past_participle": "dumped"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of selling goods in a foreign market at a price lower than the cost of production or below the price charged in the domestic market, often to gain market share or eliminate competition.",
      "explanation_cn": "指以低于生产成本或低于本国市场价格的方式向国外市场销售商品，通常是为了获取市场份额或消除竞争对手。",
      "example_en": "The European Union imposed anti-dumping tariffs on Chinese steel imports.",
      "example_cn": "欧盟对从中国进口的钢铁征收了反倾销关税。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of discarding or disposing of waste, debris, or unwanted materials in a careless or unregulated manner, often in a designated area.",
      "explanation_cn": "指以粗心或无监管的方式丢弃废物、残渣或不需要的材料，通常倾倒在指定区域。",
      "example_en": "Illegal dumping of hazardous chemicals has contaminated the local river.",
      "example_cn": "非法倾倒有害化学品已污染了当地河流。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large quantity of something thrown or dropped suddenly and carelessly, often referring to a pile or mass of items.",
      "explanation_cn": "指大量物品被突然且随意地扔下或倾倒，常指堆积成堆的物品。",
      "example_en": "There was a dumping of old furniture on the sidewalk after the move.",
      "example_cn": "搬家后，人行道上堆了一大堆旧家具。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "export",
      "analysis": "“Export” (出口) 是中性术语，指合法地将商品运往国外市场，价格可高可低，不涉及不公平竞争。而 “dumping” 是一种特定的、通常被规制的出口行为，其核心特征是价格低于正常价值，具有掠夺性或破坏性意图。"
    },
    {
      "word_to_compare": "disposal",
      "analysis": "“Disposal” (处置) 是一个更广泛、更中性的术语，指对废弃物进行合法、规范的处理，如回收、焚烧或填埋。而 “dumping” 强调非法、随意或不负责任的丢弃行为，带有负面道德和法律含义。"
    },
    {
      "word_to_compare": "deposition",
      "analysis": "“Deposition” (沉积/沉淀) 是地质或化学术语，指物质自然沉降或积累的过程，如泥沙沉积或矿物沉淀。它是一个中性、自然的物理过程，而 “dumping” 是人为的、主动的、常具破坏性的行为，两者在语义和语境上完全不同。"
    }
  ]
}