{
  "word": "dump",
  "pronunciation": "dum",
  "concise_definition": "v. 倾倒, 丢弃, 猛放; n. 垃圾场, 倾倒行为",
  "forms": {
    "third_person_singular": "dumps",
    "past_tense": "dumped",
    "past_participle": "dumped",
    "present_participle": "dumping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To dispose of something carelessly or in large quantities, often waste or unwanted material.",
      "explanation_cn": "指粗心地、大量地丢弃某物，通常指废弃物或不需要的物品。",
      "example_en": "The factory was fined for dumping toxic chemicals into the river.",
      "example_cn": "这家工厂因将有毒化学品倾倒入河中而被罚款。"
    },
    {
      "pos": "verb",
      "explanation_en": "To suddenly place or drop something heavily or without care, often in a physical or emotional context.",
      "explanation_cn": "指突然沉重或随意地放下某物，常用于物理动作或情感上的释放（如情绪、责任）。",
      "example_en": "She dumped her bag on the floor and collapsed onto the couch.",
      "example_cn": "她把包往地上一扔，瘫倒在沙发上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To end a romantic relationship abruptly and often unkindly, especially by one person initiating the breakup.",
      "explanation_cn": "指突然且常常不友善地结束一段恋爱关系，通常由一方主动提出分手。",
      "example_en": "He dumped her after three months without giving any explanation.",
      "example_cn": "他三个月后突然甩了她，连个解释都没有。"
    },
    {
      "pos": "noun",
      "explanation_en": "A place where waste materials are deposited and left to accumulate, often illegally or unsafely.",
      "explanation_cn": "指用于堆放和积存废弃物的场所，通常为非法或不安全的垃圾填埋地。",
      "example_en": "The abandoned dump outside the city was filled with old electronics and broken appliances.",
      "example_cn": "城市外废弃的垃圾场堆满了旧电子产品和破损的家电。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of dumping something, especially waste or data; can also refer to a large, sudden release of information or goods.",
      "explanation_cn": "指倾倒某物的行为，尤指废弃物或数据；也可指大量、突然的信息或货物释放。",
      "example_en": "The whistleblower made a dump of classified documents to the press.",
      "example_cn": "举报人向媒体泄露了大量机密文件。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "discard",
      "analysis": "“Discard” (丢弃) 更强调主动、有意识地扔掉不再需要的东西，语气较中性，常用于物品、文件或习惯。而 “dump” 更具粗暴、随意或不负责任的意味，常带有负面情感色彩，尤其在指倾倒垃圾或感情背叛时。"
    },
    {
      "word_to_compare": "dispose",
      "analysis": "“Dispose” (处理) 是更正式、中性的术语，指按照规定或程序处理废弃物或物品，如 “dispose of trash properly”。而 “dump” 常暗示非法、不负责任或不规范的处理方式，带有贬义。"
    },
    {
      "word_to_compare": "depose",
      "analysis": "“Depose” (罢免) 指通过正式程序解除某人的职位（如国王、总统），与 “dump” 在政治语境中虽都可表示‘撤换’，但 ‘depose’ 是法律或制度性行为，而 ‘dump’ 是口语化、非正式的表达，常用于人际关系或非正式场合。"
    },
    {
      "word_to_compare": "litter",
      "analysis": "“Litter” (乱扔垃圾) 指零星、散乱地丢弃垃圾，强调行为的不整洁和不文明，但规模小、分散。而 “dump” 指集中、大量地倾倒，常形成堆积，更严重且具系统性破坏。"
    }
  ]
}