{
  "word": "dumps",
  "pronunciation": "dumps",
  "concise_definition": "n. 垃圾场, 废弃物堆积处; v. 倾倒, 扔掉, 卖出",
  "forms": {
    "singular": "dump",
    "third_person_singular": "dumps",
    "past_tense": "dumped",
    "past_participle": "dumped",
    "present_participle": "dumping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A place where waste materials, especially solid refuse, are discarded and accumulated, often in an unregulated or environmentally harmful manner.",
      "explanation_cn": "指用于丢弃和堆积废弃物（尤其是固体垃圾）的场所，通常缺乏监管，可能对环境造成危害。",
      "example_en": "The city closed the old landfill after complaints about toxic leachate from the dumps.",
      "example_cn": "由于人们投诉垃圾场渗出有毒液体，该市关闭了旧的垃圾填埋场。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large quantity of something dumped at once, often in a careless or unorganized way; can refer to data, goods, or information.",
      "explanation_cn": "指一次性倾倒的大量物品，常以粗心或无组织的方式堆放；可用于指数据、货物或信息。",
      "example_en": "The website suffered a data dump after the server crash, losing weeks of user activity logs.",
      "example_cn": "服务器崩溃后，网站遭遇了数据倾倒，丢失了数周的用户活动日志。"
    },
    {
      "pos": "verb",
      "explanation_en": "To dispose of something carelessly or abruptly, especially waste, unwanted items, or large quantities of goods.",
      "explanation_cn": "指粗心或突然地处置某物，尤指废弃物、不需要的物品或大量货物。",
      "example_en": "The company was fined for dumping hazardous chemicals into the river.",
      "example_cn": "该公司因将有害化学品倾倒入河中而被罚款。"
    },
    {
      "pos": "verb",
      "explanation_en": "To sell off a large amount of goods or assets quickly, often at low prices, to raise cash or reduce inventory.",
      "explanation_cn": "指迅速大量出售商品或资产，通常以低价，以套现或减少库存。",
      "example_en": "The retailer dumped its excess winter clothing in a seasonal clearance sale.",
      "example_cn": "这家零售商在季节性清仓中抛售了多余的冬装。"
    },
    {
      "pos": "verb",
      "explanation_en": "To end a relationship suddenly and without warning, especially in romantic contexts.",
      "explanation_cn": "指突然且毫无预警地结束一段关系，尤其用于浪漫关系中。",
      "example_en": "She dumped him after he lied about his job again.",
      "example_cn": "他再次撒谎说自己工作时，她就甩了他。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "landfill",
      "analysis": "“Landfill”（垃圾填埋场）是“dump”作为名词时的一个具体类型，特指经过设计和管理的固体废弃物处理场所，通常有环保规范；而 “dump” 更泛指任意、非正式甚至非法的倾倒地点，语义更粗俗、更负面。"
    },
    {
      "word_to_compare": "discard",
      "analysis": "“Discard”（丢弃）强调主动放弃不再需要的东西，语气中性，常用于物品、想法或习惯；而 “dump” 更强调粗暴、随意或大量地扔掉，带有情感色彩（如愤怒、冷漠），尤其在关系语境中更具冲击力。"
    },
    {
      "word_to_compare": "sell off",
      "analysis": "“Sell off”（抛售）与 “dump” 在商业语境中可互换，但 “sell off” 更中性，常用于战略调整；而 “dump” 暗示仓促、低价、甚至损害市场价值的倾销行为，带有负面评价。"
    }
  ]
}