{
  "word": "dumped",
  "pronunciation": "dumpt",
  "concise_definition": "v. 扔掉, 弃置, 解雇, 终止关系",
  "forms": {
    "base_form": "dump",
    "present_participle": "dumping",
    "past_tense": "dumped",
    "past_participle": "dumped",
    "third_person_singular": "dumps"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To get rid of something unwanted by discarding it carelessly or in large quantities, often in a public or inappropriate place.",
      "explanation_cn": "指随意或大量地丢弃不需要的东西，通常扔在公共或不恰当的地方。",
      "example_en": "They dumped the old furniture on the curb for trash collection.",
      "example_cn": "他们把旧家具扔在路边等着收垃圾。"
    },
    {
      "pos": "verb",
      "explanation_en": "To terminate a romantic relationship abruptly and often unkindly, especially by one partner ending it without mutual agreement.",
      "explanation_cn": "指一方突然且常常不友善地终止恋爱关系，通常未经双方共识。",
      "example_en": "She was dumped by her boyfriend after three years of dating.",
      "example_cn": "她和男友交往三年后被对方甩了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To dismiss or fire someone from a job suddenly and without warning.",
      "explanation_cn": "指突然且毫无预警地解雇某人。",
      "example_en": "The company dumped dozens of employees without severance pay.",
      "example_cn": "公司未经支付遣散费就解雇了数十名员工。"
    },
    {
      "pos": "verb",
      "explanation_en": "To unload or discharge a large amount of something, such as cargo, data, or information, often rapidly or in an unorganized way.",
      "explanation_cn": "指快速或无序地卸下大量物品、数据或信息，如货物、数据等。",
      "example_en": "The server was dumped with millions of requests during the sale.",
      "example_cn": "促销期间，服务器被涌入数百万次请求。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "abandoned",
      "analysis": "“Abandoned” (遗弃) 强调彻底放弃某物或某人，通常带有情感上的冷漠或长期忽视，但不一定包含主动丢弃的动作。而 “dumped” 更强调主动、突然、甚至粗暴的处置行为，尤其在感情或工作语境中更具冲击力。"
    },
    {
      "word_to_compare": "fired",
      "analysis": "“Fired” (解雇) 是职场中正式的终止雇佣关系的术语，通常有程序或理由（如绩效不佳）。“Dumped” 在此语境下更口语化、情绪化，暗示不公正、无预警或缺乏尊重的解雇，语气更重。"
    },
    {
      "word_to_compare": "discarded",
      "analysis": "“Discarded” (丢弃) 是中性词，泛指不再需要而扔掉，可用于物品、想法或关系，语气较温和。“Dumped” 则带有更强的负面情感色彩，常暗示粗鲁、不负责任或伤害性的行为，尤其在人际关系中更具情感伤害性。"
    }
  ]
}