{
  "word": "durham",
  "pronunciation": "durr·uhm",
  "concise_definition": "n. 达勒姆（英国地名，英格兰东北部城市；美国北卡罗来纳州城市）",
  "forms": {
    "plural": "Durhams"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A city in northeast England, known for its historic cathedral, castle, and prestigious university; it is the administrative center of County Durham.",
      "explanation_cn": "位于英格兰东北部的一座城市，以其历史悠久的大教堂、城堡和著名的达勒姆大学而闻名；是达勒姆郡的行政中心。",
      "example_en": "Durham Cathedral, a UNESCO World Heritage Site, attracts thousands of visitors each year.",
      "example_cn": "达勒姆大教堂，一处联合国教科文组织世界遗产，每年吸引成千上万的游客。"
    },
    {
      "pos": "noun",
      "explanation_en": "A city in North Carolina, United States, known for its vibrant arts scene, research institutions, and as part of the Research Triangle with Raleigh and Chapel Hill.",
      "explanation_cn": "美国北卡罗来纳州的一座城市，以其活跃的艺术氛围、研究机构以及作为与罗利和教堂山共同组成的‘研究三角区’的一部分而著称。",
      "example_en": "Duke University, located in Durham, is renowned for its academic excellence and basketball program.",
      "example_cn": "位于达勒姆的杜克大学以其卓越的学术水平和篮球项目而闻名。"
    },
    {
      "pos": "noun",
      "explanation_en": "A surname or family name, historically derived from the place name in England, borne by notable individuals such as the American actor Durham Red.",
      "explanation_cn": "一个姓氏，历史上源自英格兰的地名，被一些知名人物使用，例如美国演员达勒姆·雷德。",
      "example_en": "The novelist Durham Red wrote several acclaimed historical fiction novels.",
      "example_cn": "小说家达勒姆·雷德创作了数部广受赞誉的历史小说。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "city",
      "analysis": "“City”（城市）是一个通用名词，泛指任何人口密集、具有行政和经济功能的都市区域。而 “Durham” 是一个专有名词，特指英国或美国的两个具体城市，不具备通用性，仅用于指代特定地理位置或文化实体。"
    },
    {
      "word_to_compare": "county",
      "analysis": "“County”（郡）是行政区域单位，通常包含多个城镇和乡村。Durham 既是英格兰达勒姆郡的首府城市，也是该郡的名称来源，但城市本身不等于郡。例如，达勒姆郡包含其他城镇如斯托克顿，而达勒姆市仅指该郡的核心城市。"
    },
    {
      "word_to_compare": "university",
      "analysis": "“University”（大学）是教育机构，而 Durham 是一个地名，尽管它因达勒姆大学而闻名，但城市本身并非大学。人们常将 “Durham” 与大学关联，但二者属于不同范畴：一个是地理实体，一个是教育机构。"
    }
  ]
}