{
  "word": "dust",
  "pronunciation": "duhst",
  "concise_definition": "n. 灰尘, 粉末; v. 打扫灰尘, 撒粉",
  "forms": {
    "plural": "dusts"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Fine, dry particles of matter, especially those that are blown about by the wind or accumulate on surfaces, often consisting of soil, pollen, skin cells, or fibers.",
      "explanation_cn": "细小干燥的颗粒物质，尤指被风吹起或积聚在表面的灰尘，通常由土壤、花粉、皮肤细胞或纤维组成。",
      "example_en": "A thick layer of dust covered the old books on the shelf.",
      "example_cn": "一层厚厚的灰尘覆盖在书架上那些旧书上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small amount of a powdered substance, especially one used for cosmetic or medicinal purposes.",
      "explanation_cn": "少量的粉末状物质，尤指用于化妆品或药品的粉末。",
      "example_en": "She applied a light dust of powder to her face.",
      "example_cn": "她往脸上轻轻扑了一层粉。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove dust from a surface, typically by wiping, brushing, or vacuuming.",
      "explanation_cn": "通过擦拭、刷洗或吸尘等方式清除表面的灰尘。",
      "example_en": "I dusted the shelves before arranging the new books.",
      "example_cn": "我在摆放新书之前把书架上的灰尘擦干净了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To sprinkle a fine powder over something, often for decorative, preservative, or functional purposes.",
      "explanation_cn": "在某物表面撒上一层细粉，常用于装饰、防腐或功能性目的。",
      "example_en": "The baker dusted the cake with powdered sugar.",
      "example_cn": "面包师在蛋糕上撒了一层糖粉。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "grime",
      "analysis": "“Grime”（污垢）指长期积累的、油腻或脏污的物质，通常与污渍、油渍或环境污染物相关，带有负面和不洁的含义。而 “dust” 更中性，主要指干燥、轻盈的微粒，不一定肮脏，如书架上的灰尘。"
    },
    {
      "word_to_compare": "powder",
      "analysis": "“Powder”（粉末）是一个更广泛的术语，泛指任何细碎的固体颗粒，可以是人工制造的（如面粉、滑石粉），也可以是天然的。而 “dust” 通常指无意中产生或积累的微粒，常带有不受欢迎的含义。当 “dust” 作为动词时，特指撒粉的动作，但语境多为轻柔、少量的撒布。"
    },
    {
      "word_to_compare": "debris",
      "analysis": "“Debris”（碎片、残骸）指较大、较明显的废弃物或破碎物，如建筑废料、灾难后的残骸。它强调的是物理结构的破坏产物，而 “dust” 是极其微小的颗粒，几乎看不见，两者在尺度和性质上截然不同。"
    }
  ]
}