{
  "word": "dwarfs",
  "pronunciation": "dwɔːrfs",
  "concise_definition": "n. 矮人, 小个子的人; v. 使显得矮小, 使相形见绌",
  "forms": {
    "singular": "dwarf",
    "plural": "dwarfs",
    "alternative_plural": "dwarves"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person of unusually short stature, typically below 4 feet (122 cm) in height, often used in medical or descriptive contexts.",
      "explanation_cn": "指身高异常矮小的人，通常低于4英尺（122厘米），常用于医学或描述性语境中。",
      "example_en": "The medical team studied the growth patterns of dwarfs to better understand skeletal development.",
      "example_cn": "医疗团队研究了矮人的生长模式，以更好地理解骨骼发育。"
    },
    {
      "pos": "noun",
      "explanation_en": "A mythical or fictional creature in folklore and fantasy, often depicted as a short, stout humanoid with great strength and skill in mining and crafting.",
      "explanation_cn": "指民间传说和奇幻作品中的虚构生物，通常被描绘为身材矮小、体格健壮的人形生物，擅长采矿和工艺制作。",
      "example_en": "In Tolkien’s legendarium, dwarfs are master smiths who forge powerful weapons and artifacts.",
      "example_cn": "在托尔金的传说体系中，矮人是精通锻造的工匠，能打造强大的武器与神器。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make something appear small or insignificant in comparison, often due to its overwhelming scale or magnitude.",
      "explanation_cn": "指因某物规模或体量巨大，而使另一事物显得渺小或微不足道。",
      "example_en": "The new skyscraper dwarfs all the surrounding buildings in the city.",
      "example_cn": "这座新的摩天大楼使城市中周围的所有建筑都相形见绌。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "giants",
      "analysis": "“Giants”（巨人）是“dwarfs”的直接反义词，指体型巨大、力量超常的生物或人物。在神话和文学中，两者常作为对立意象出现，象征力量与渺小、宏大与微末的对比。而 “dwarfs” 不仅指体型，还可引申为在比较中被压倒的弱势一方。"
    },
    {
      "word_to_compare": "midget",
      "analysis": "“Midget” 曾用于描述身材矮小的人，但如今被视为冒犯性用语，已被“person with dwarfism”等更尊重的术语取代。而 “dwarf” 在医学和文化语境中仍具中性或正式用法，尤其在指神话生物时无贬义。"
    },
    {
      "word_to_compare": "minimize",
      "analysis": "“Minimize”（最小化）是主动降低某物的重要性或影响，强调人为干预；而 “dwarf” 作为动词，是客观描述一种因对比而产生的视觉或感知上的渺小感，不涉及主观意图。例如：‘The scandal was dwarfed by the larger corruption case.’（丑闻被更大的腐败案所掩盖）是自然对比，而非刻意淡化。"
    }
  ]
}