{
  "word": "dyed",
  "pronunciation": "dīd",
  "concise_definition": "adj. 染色的, 着色的; v. 染色（die 的过去式和过去分词）",
  "forms": {
    "base_form": "die",
    "past_tense": "dyed",
    "past_participle": "dyed",
    "present_participle": "dyeing",
    "third_person_singular": "dyes"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having been colored by applying a dye or pigment, typically to fabric, hair, or other materials; often implies a deliberate and lasting change in color.",
      "explanation_cn": "通过施加染料或颜料而被着色的，通常用于织物、头发或其他材料；暗示一种有意识且持久的颜色改变。",
      "example_en": "She wore a beautiful dyed silk scarf that shimmered in the sunlight.",
      "example_cn": "她戴着一条美丽的染色丝绸围巾，在阳光下闪闪发光。"
    },
    {
      "pos": "verb",
      "explanation_en": "To change the color of a material, especially fabric, hair, or wood, by immersing it in a dye solution; the process may be temporary or permanent depending on the dye used.",
      "explanation_cn": "通过将材料（尤其是织物、头发或木材）浸入染料溶液中来改变其颜色；根据所用染料的不同，这一过程可能是暂时的或永久的。",
      "example_en": "He dyed his hair blue to match his band's aesthetic.",
      "example_cn": "他把头发染成蓝色，以配合乐队的整体风格。"
    },
    {
      "pos": "verb",
      "explanation_en": "To imbue something with a particular quality or characteristic metaphorically, as if stained or colored by an influence.",
      "explanation_cn": "比喻性地使某物带有某种特质或特征，仿佛被某种影响所染色。",
      "example_en": "The entire debate was dyed with political bias.",
      "example_cn": "整个辩论都带有政治偏见的色彩。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "colored",
      "analysis": "“Colored”（着色的）是一个更通用的词，泛指任何赋予颜色的行为或状态，可以是天然的、绘画的或染色的，不特指使用染料。而 “dyed” 特指通过化学染料进行的渗透性着色，常用于纺织品或头发，强调工艺过程和持久性。"
    },
    {
      "word_to_compare": "tinted",
      "analysis": "“Tinted”（略带颜色的）通常指轻微、浅淡的颜色添加，常用于玻璃、纸张或化妆品，强调柔和、透明的效果。而 “dyed” 指的是深度、全面的颜色渗透，颜色更浓烈、更牢固，常用于需要持久效果的材料。"
    },
    {
      "word_to_compare": "stained",
      "analysis": "“Stained”（染污的）通常带有负面含义，指意外或不希望出现的颜色附着，如咖啡渍、墨水渍。而 “dyed” 是有意为之的、可控的着色行为，通常具有审美或功能目的，不带贬义。"
    }
  ]
}