{
  "word": "dysfunctional",
  "pronunciation": "dis·fʌŋk·ʃə·nəl",
  "concise_definition": "adj. 功能失常的, 不正常的, 无法正常运作的",
  "forms": {
    "comparative": "more dysfunctional",
    "superlative": "most dysfunctional"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Not functioning properly or normally, especially in the context of systems, relationships, or organizations; characterized by abnormal or unhealthy patterns of behavior or operation.",
      "explanation_cn": "指系统、关系或组织未能正常运作，常表现为异常或不健康的行为模式或运作方式。",
      "example_en": "The family was described as dysfunctional due to constant arguments and lack of communication.",
      "example_cn": "由于持续的争吵和缺乏沟通，这个家庭被描述为功能失常。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Referring to a device, mechanism, or process that fails to perform its intended function, often due to damage, design flaws, or misuse.",
      "explanation_cn": "指设备、机制或过程因损坏、设计缺陷或误用而无法实现其预期功能。",
      "example_en": "The dysfunctional printer kept jamming, so we had to replace it.",
      "example_cn": "这台故障的打印机总是卡纸，所以我们不得不更换它。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used metaphorically to describe social, cultural, or institutional structures that hinder progress or well-being due to entrenched inefficiencies or harmful norms.",
      "explanation_cn": "隐喻性地用于描述因根深蒂固的低效或有害规范而阻碍进步或福祉的社会、文化或制度结构。",
      "example_en": "The school system is seen as dysfunctional, failing to meet the needs of diverse learners.",
      "example_cn": "这个教育体系被视为功能失常，无法满足多样化学习者的需求。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "malfunctioning",
      "analysis": "“Malfunctioning”（故障的）更侧重于技术性或机械性故障，强调设备或系统因物理原因无法运作，通常可修复。而 “dysfunctional” 范围更广，可指非物理性的、系统性或行为性的失常，如人际关系或组织结构的问题，不一定有明显物理损坏。"
    },
    {
      "word_to_compare": "abnormal",
      "analysis": "“Abnormal”（异常的）仅表示偏离常态，但不必然意味着功能受损。例如，异常的天气或行为可能只是罕见但无害。而 “dysfunctional” 隐含负面后果，即这种偏离导致了运作失败或有害影响。"
    },
    {
      "word_to_compare": "broken",
      "analysis": "“Broken”（损坏的）通常指完全失效或物理性毁坏，语气更直接、口语化。而 “dysfunctional” 更中性、学术化，可用于描述部分失效或隐性失常，例如一个‘功能失常但仍在运转’的组织，未必是‘坏了’，但已无法有效运作。"
    }
  ]
}