{
  "word": "ear",
  "pronunciation": "ir",
  "concise_definition": "n. 耳朵, 听力, 聆听",
  "forms": {
    "plural": "ears"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The organ of hearing and balance in humans and many animals, consisting of the outer ear, middle ear, and inner ear, which captures sound waves and converts them into neural signals.",
      "explanation_cn": "人类和许多动物的听觉与平衡器官，由外耳、中耳和内耳组成，负责接收声波并将其转化为神经信号。",
      "example_en": "She had a piercing in her left ear.",
      "example_cn": "她的左耳戴了一个耳钉。"
    },
    {
      "pos": "noun",
      "explanation_en": "The ability to perceive and appreciate sound, especially music; a sensitive or discerning auditory sense.",
      "explanation_cn": "感知和欣赏声音（尤其是音乐）的能力；敏锐或有鉴赏力的听觉。",
      "example_en": "He has a good ear for music and can identify any note by sound alone.",
      "example_cn": "他对音乐有敏锐的听觉，仅凭声音就能辨认出任何音符。"
    },
    {
      "pos": "noun",
      "explanation_en": "A part of a plant or object that resembles the shape of an ear, such as the edible part of corn or the handle of a teacup.",
      "explanation_cn": "指形状类似耳朵的植物或物体部分，如玉米的穗或茶杯的柄。",
      "example_en": "The farmer harvested a large crop of corn ears this season.",
      "example_cn": "今年这个季节，农夫收获了大量玉米穗。"
    },
    {
      "pos": "noun",
      "explanation_en": "Attention or willingness to listen, especially in the phrase 'to give someone an ear'.",
      "explanation_cn": "指倾听的意愿或注意力，尤用于短语 'give someone an ear'（愿意听某人倾诉）。",
      "example_en": "If you need to talk, I'll give you an ear.",
      "example_cn": "如果你需要倾诉，我会认真听。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hearing",
      "analysis": "“Hearing”（听觉）是生理上接收声音的能力，强调感官功能本身，是抽象名词；而 “ear” 是具体的器官或身体部位，也可引申为听觉能力，但更常用于指实体结构或比喻性倾听。"
    },
    {
      "word_to_compare": "auditory",
      "analysis": "“Auditory”（听觉的）是形容词，用于描述与听觉相关的特性或系统（如 auditory cortex），不能作名词使用；而 “ear” 是可数名词，可指具体器官、听觉能力或比喻性倾听，语义更丰富、更具体。"
    },
    {
      "word_to_compare": "listen",
      "analysis": "“Listen”（倾听）是动词，强调主动注意和理解声音；而 “ear” 作为名词，是倾听的器官或能力，本身不包含动作含义。两者词性不同，但可构成搭配，如 'have an ear for listening'，此时 'ear' 指听觉敏感性。"
    }
  ]
}