{
  "word": "eastern",
  "pronunciation": "es·tər·n",
  "concise_definition": "adj. 东方的, 东部的, 东方式的",
  "forms": {
    "comparative": "eastern",
    "superlative": "eastern"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Located in or relating to the east, especially in reference to a specific region, country, or direction within a larger geographical context.",
      "explanation_cn": "位于东方或与东方相关的，通常指在更大地理背景下某一区域、国家或方向的东部位置。",
      "example_en": "The eastern coast of the United States is home to many major cities like New York and Boston.",
      "example_cn": "美国的东海岸拥有纽约和波士顿等许多大城市。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to the cultures, traditions, or aesthetics of Asia or the Far East, often contrasted with Western culture.",
      "explanation_cn": "与亚洲或远东地区的文化、传统或美学相关的，常与西方文化相对比。",
      "example_en": "Eastern philosophy emphasizes harmony with nature and inner balance.",
      "example_cn": "东方哲学强调与自然的和谐及内在的平衡。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characteristic of or influenced by the customs, styles, or values associated with the East, especially in art, fashion, or cuisine.",
      "explanation_cn": "具有或受东方习俗、风格或价值观影响的，尤其在艺术、时尚或饮食方面。",
      "example_en": "The restaurant offers an authentic eastern dining experience with chopsticks and tea ceremonies.",
      "example_cn": "这家餐厅提供正宗的东方用餐体验，配有筷子和茶道。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "oriental",
      "analysis": "“Oriental”（东方的）曾是“eastern”的同义词，但如今在英语中常被视为过时或带有殖民主义色彩的术语，尤其在指代亚洲人或亚洲文化时可能被认为不敏感。现代英语更倾向使用 “eastern” 或具体国家名称（如 Chinese, Japanese）以避免刻板印象。"
    },
    {
      "word_to_compare": "eastward",
      "analysis": "“Eastward”（向东的）是副词或形容词，强调方向或移动趋势，如 “an eastward journey”（向东的旅程）。“Eastern” 是纯粹的方位形容词，描述位置或属性，不涉及运动。两者语义范畴不同：一个是方向，一个是状态。"
    },
    {
      "word_to_compare": "continental",
      "analysis": "“Continental”（大陆的）通常指欧洲大陆或与岛屿相对的陆地部分，如 “continental Europe”（欧洲大陆）。“Eastern” 则明确指向地理方位的东方，两者在语义上无重叠，仅在某些语境中（如 “continental eastern Europe”）可能共同出现，但功能完全不同。"
    }
  ]
}