{
  "word": "eclipse",
  "pronunciation": "ih·klaips",
  "concise_definition": "n. 日食, 月食; v. 使黯然失色, 超越",
  "forms": {
    "third_person_singular": "eclipses",
    "past_tense": "eclipsed",
    "past_participle": "eclipsed",
    "present_participle": "eclipsing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An astronomical event in which one celestial body moves into the shadow of another, blocking its light; most commonly refers to a solar eclipse (when the Moon passes between the Earth and the Sun) or a lunar eclipse (when the Earth passes between the Sun and the Moon).",
      "explanation_cn": "一种天体现象，指一个天体进入另一个天体的阴影中而遮蔽其光线；最常见的是日食（月球运行至地球与太阳之间）或月食（地球运行至太阳与月球之间）。",
      "example_en": "The total solar eclipse was visible across the entire region, drawing thousands of spectators.",
      "example_cn": "这次日全食在整个地区可见，吸引了成千上万的观众。"
    },
    {
      "pos": "verb",
      "explanation_en": "To surpass or overshadow something in importance, brilliance, or prominence, often causing it to seem insignificant by comparison.",
      "explanation_cn": "指在重要性、光辉或显赫程度上超越或掩盖某事物，使其相比之下显得微不足道。",
      "example_en": "Her groundbreaking research has eclipsed all previous work in the field.",
      "example_cn": "她的开创性研究使该领域此前的所有工作都黯然失色。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a celestial body to be obscured by another, as in the natural phenomenon of an eclipse.",
      "explanation_cn": "指使一个天体被另一个天体遮蔽，如同自然发生的日食或月食现象。",
      "example_en": "The Moon eclipsed the Sun for a few minutes during the peak of the event.",
      "example_cn": "在事件高峰期，月球遮蔽了太阳几分钟。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "obscure",
      "analysis": "“Obscure” (使模糊/遮蔽) 强调使某物变得难以看清、理解或察觉，通常因光线不足、信息缺失或混乱所致，不涉及超越或比较。而 “eclipse” 不仅遮蔽，还隐含了‘在重要性上压倒’的含义，带有强烈的对比和等级关系。"
    },
    {
      "word_to_compare": "outshine",
      "analysis": "“Outshine” (胜过/更耀眼) 与 “eclipse” 在比喻义上非常接近，都表示在光彩或成就上超越他人。但 “outshine” 更强调‘光辉’和‘吸引力’，常用于艺术、外貌或表现力；而 “eclipse” 更正式、更广泛，可用于成就、影响力、地位等抽象层面，语气更强烈。"
    },
    {
      "word_to_compare": "overshadow",
      "analysis": "“Overshadow” (遮蔽/使黯然失色) 与 “eclipse” 在比喻义上几乎可互换，但 “overshadow” 更中性，常用于描述负面或令人不安的压制（如阴影、创伤），而 “eclipse” 更常用于正面或中性的卓越超越，语气更庄重、更具文学性。"
    }
  ]
}