{
  "word": "economics",
  "pronunciation": "ee·kuh·nom·iks",
  "concise_definition": "n. 经济学, 经济状况, 经济利益",
  "forms": {
    "plural": "economies"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The social science that studies the production, distribution, and consumption of goods and services, and how individuals, businesses, governments, and societies allocate scarce resources to satisfy unlimited wants.",
      "explanation_cn": "一门研究商品与服务的生产、分配和消费的社会科学，探讨个人、企业、政府和社会如何在资源有限的情况下分配资源以满足无限的需求。",
      "example_en": "Economics helps us understand why prices rise during shortages and fall when there is a surplus.",
      "example_cn": "经济学帮助我们理解为什么在短缺时价格上涨，而在过剩时价格下跌。"
    },
    {
      "pos": "noun",
      "explanation_en": "The economic system or condition of a particular country, region, or group, often referring to its financial health, growth, and structure.",
      "explanation_cn": "指某个国家、地区或群体的经济体系或经济状况，通常指其财政健康、增长趋势和结构特征。",
      "example_en": "The country's economics have improved significantly since the implementation of market reforms.",
      "example_cn": "自实施市场改革以来，该国的经济状况已显著改善。"
    },
    {
      "pos": "noun",
      "explanation_en": "Practical considerations of cost, efficiency, and financial gain in a particular context, often used in phrases like 'the economics of the project'.",
      "explanation_cn": "在特定语境下对成本、效率和经济收益的实际考量，常用于如‘项目的经济性’这类表达。",
      "example_en": "The economics of switching to renewable energy are becoming more favorable as technology advances.",
      "example_cn": "随着技术进步，转向可再生能源的经济性正变得越来越有利。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "economy",
      "analysis": "“Economy”（经济）通常指一个国家或地区的实际经济体系或运行状态，是一个具体实体；而 “economics” 是研究这个体系的学科或理论框架。例如，我们说 ‘China’s economy is growing’（中国经济正在增长），但说 ‘I study economics’（我学习经济学）。"
    },
    {
      "word_to_compare": "finance",
      "analysis": "“Finance”（金融）侧重于资金的管理、投资、借贷和资本流动，是经济学的一个子领域。经济学涵盖更广泛的资源分配问题，包括生产、消费、市场结构等；而金融更关注货币、资产和机构的运作。"
    },
    {
      "word_to_compare": "politics",
      "analysis": "“Politics”（政治）涉及权力分配、政府决策和公共政策的制定，常与经济政策交织，但其核心是权力与治理，而非资源分配的科学分析。经济学试图用模型和数据解释行为，而政治学更关注制度、利益和意识形态的影响。"
    }
  ]
}