{
  "word": "edged",
  "pronunciation": "ejd",
  "concise_definition": "adj. 有边缘的, 带有锋利边界的; v. 边缘化, 缓慢推进 (edge 的过去式和过去分词)",
  "forms": {
    "base_form": "edge",
    "third_person_singular": "edges",
    "past_tense": "edged",
    "past_participle": "edged",
    "present_participle": "edging"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having a distinct, often sharp or defined boundary or margin; describing something that is bordered or outlined sharply.",
      "explanation_cn": "具有清晰、通常是锋利或明确的边缘或边界；描述某物被鲜明地勾勒或围边。",
      "example_en": "The painting had an edged, geometric style that stood out in the gallery.",
      "example_cn": "这幅画具有鲜明的几何风格，边缘锐利，在画廊中格外突出。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move slowly or cautiously in a particular direction, often by making small incremental movements; to advance gradually.",
      "explanation_cn": "指以缓慢或谨慎的方式朝某个方向移动，通常通过微小的逐步动作；逐渐推进。",
      "example_en": "She edged closer to the edge of the cliff, peering down at the waves below.",
      "example_cn": "她小心翼翼地向悬崖边靠近，俯视着下方的海浪。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provide something with an edge or border, often to enhance its appearance or function; to surround or frame with a distinct boundary.",
      "explanation_cn": "指为某物添加边缘或边界，通常是为了增强其外观或功能；用明确的边界包围或框定。",
      "example_en": "The tailor edged the coat with black silk to give it a more elegant finish.",
      "example_cn": "裁缝用黑色丝绸为外套镶边，使其更具优雅的质感。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bordered",
      "analysis": "“Bordered” 强调某物被一个明确的边界所环绕，通常用于地理、设计或视觉语境，如“bordered by trees”。而 “edged” 更强调边缘本身的形态——可能是锋利、细窄或装饰性的，常用于描述物体的轮廓或加工细节。"
    },
    {
      "word_to_compare": "framed",
      "analysis": "“Framed” 指将某物置于一个完整的框架内，如画框、相框，强调结构上的包围和保护。“Edged” 则更轻、更局部，仅指在边缘处添加一条线或材料，不构成完整框架，常用于织物、金属或建筑细节。"
    },
    {
      "word_to_compare": "nudged",
      "analysis": "“Nudged” (轻推) 指用轻微的力量推动某物或某人，常用于比喻性语境，如“nudged toward a decision”。而 “edged” 描述的是缓慢、谨慎的移动，强调的是动作的渐进性和空间上的接近，而非外力作用。两者都表示微小动作，但 “edged” 更侧重位置变化，而 “nudged” 更侧重施加影响。"
    }
  ]
}