{
  "word": "edge",
  "pronunciation": "ej",
  "concise_definition": "n. 边缘, 刀刃, 优势, 尖锐感 v. 使成边缘, 缓慢移动",
  "forms": {
    "plural": "edges",
    "third_person_singular": "edges",
    "past_tense": "edged",
    "past_participle": "edged",
    "present_participle": "edging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The outer boundary or limit of a surface, object, or area, often where it meets something else.",
      "explanation_cn": "指一个表面、物体或区域的最外缘或边界，通常是在其与他物相接之处。",
      "example_en": "She stood at the edge of the cliff, staring down at the ocean.",
      "example_cn": "她站在悬崖边缘，凝视着下方的大海。"
    },
    {
      "pos": "noun",
      "explanation_en": "The sharp side of a blade or cutting instrument, designed for slicing or cutting.",
      "explanation_cn": "指刀具或切割工具的锋利一侧，用于切割或削切。",
      "example_en": "Be careful — the knife’s edge is extremely sharp.",
      "example_cn": "小心——这把刀的刀刃非常锋利。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slight advantage over others, especially in competition or performance.",
      "explanation_cn": "指在竞争或表现中相对于他人所拥有的微小优势。",
      "example_en": "Her years of experience gave her the edge in the job interview.",
      "example_cn": "她多年的经验使她在面试中占据了优势。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sharp or intense quality, often referring to a tone, flavor, or emotion that is piercing or biting.",
      "explanation_cn": "指一种尖锐、强烈的感觉，常用于形容语气、味道或情绪中的刺痛感或锋利感。",
      "example_en": "There was an edge of bitterness in her voice when she spoke about the past.",
      "example_cn": "她谈到过去时，声音中带着一丝苦涩。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form or shape a border or margin on something, often by cutting or trimming.",
      "explanation_cn": "指通过切割或修剪等方式为某物形成边缘。",
      "example_en": "The tailor edged the fabric with lace to give it a decorative finish.",
      "example_cn": "裁缝在布料边缘缝上蕾丝，使其更具装饰性。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move slowly or cautiously in a particular direction, often by small increments.",
      "explanation_cn": "指缓慢而谨慎地朝某个方向移动，通常以微小的步幅进行。",
      "example_en": "The cat edged closer to the food bowl, watching the owner carefully.",
      "example_cn": "猫小心翼翼地慢慢靠近食碗，仔细观察着主人。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "border",
      "analysis": "“Border”（边界）通常指两个国家、地区或区域之间的分界线，具有政治、地理或行政含义，强调界限的明确性。而 “edge” 更侧重于物理或视觉上的最外缘，常用于描述物体的轮廓或末端，范围更广、更具体。"
    },
    {
      "word_to_compare": "rim",
      "analysis": "“Rim”（边缘）特指圆形或环状物体的外缘，如车轮、杯子的边沿，具有明确的几何形状。而 “edge” 可用于任何形状的物体，包括不规则边缘，适用范围更广，且可引申为抽象优势。"
    },
    {
      "word_to_compare": "advantage",
      "analysis": "“Advantage”（优势）是泛指任何有利条件，可以是资源、地位、技能等，语义更宽泛。而 “edge” 作为优势时，强调的是微小但关键的领先，常用于竞争语境，带有“毫厘之差决定胜负”的意味，更具动态感和紧迫感。"
    },
    {
      "word_to_compare": "point",
      "analysis": "“Point”（尖端）指物体最尖锐或最突出的末端，如针尖、箭头，强调集中和穿透力。而 “edge” 是一个线性或面状的锋利部分，用于切割或划分，更强调接触面而非点状集中。"
    }
  ]
}