{
  "word": "educating",
  "pronunciation": "eh·dew·kay·tihng",
  "concise_definition": "v. 教育, 培养, 启发",
  "forms": {
    "base_form": "educate",
    "third_person_singular": "educates",
    "past_tense": "educated",
    "past_participle": "educated",
    "present_participle": "educating"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To provide instruction or training to someone, especially in academic subjects, skills, or moral values, with the goal of developing knowledge, understanding, or character.",
      "explanation_cn": "指为某人提供教学或培训，尤其在学术科目、技能或道德价值观方面，旨在发展其知识、理解力或品格。",
      "example_en": "The school is dedicated to educating students not just in math and science, but also in critical thinking and ethics.",
      "example_cn": "这所学校致力于不仅教授学生数学和科学，还培养他们的批判性思维和伦理观念。"
    },
    {
      "pos": "verb",
      "explanation_en": "To raise awareness or inform someone about a topic, often to change behavior or attitudes, even without formal instruction.",
      "explanation_cn": "指通过信息传递提高某人对某一主题的认识，即使没有正式教学，也旨在改变其行为或态度。",
      "example_en": "The public health campaign is educating people about the dangers of smoking.",
      "example_cn": "这项公共卫生运动正在向人们宣传吸烟的危害。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cultivate or refine someone’s tastes, sensibilities, or intellectual capacities through exposure to culture, art, or ideas.",
      "explanation_cn": "指通过接触文化、艺术或思想来培养或提升某人的品味、感知力或智力能力。",
      "example_en": "Traveling through Europe was educating her appreciation of classical music and Renaissance art.",
      "example_cn": "游历欧洲提升了她对古典音乐和文艺复兴艺术的鉴赏力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "teaching",
      "analysis": "“Teaching” (教学) 更侧重于传授具体知识或技能的过程，通常发生在课堂或正式环境中，强调方法和内容的传递。而 “educating” 范围更广，不仅包括知识传授，还涵盖品格塑造、价值观培养和整体发展，是更全面的育人过程。"
    },
    {
      "word_to_compare": "training",
      "analysis": "“Training” (训练) 通常针对特定技能或行为模式进行重复性练习，目标是提高效率或熟练度，常用于职业或技术领域（如员工培训）。而 “educating” 更注重理解力、批判性思维和长期成长，强调认知与人格的深化，而非单纯技能习得。"
    },
    {
      "word_to_compare": "instructing",
      "analysis": "“Instructing” (指导) 与 “teaching” 接近，多用于明确、直接地告知如何做某事，语气较正式或命令式，如“请按此步骤操作”。而 “educating” 更具人文关怀，强调启发、引导和长期影响，常伴随情感与价值观的渗透。"
    }
  ]
}