{
  "word": "egg",
  "pronunciation": "eɡ",
  "concise_definition": "n. 鸡蛋, 卵; v. 鼓动, 挑唆",
  "forms": {
    "plural": "eggs"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The oval or round reproductive body laid by female birds, reptiles, fish, and some other animals, typically containing a yolk and surrounded by a protective shell.",
      "explanation_cn": "雌性鸟类、爬行动物、鱼类及其他某些动物产下的卵形或圆形生殖体，通常含有蛋黄，并被一层保护性外壳包裹。",
      "example_en": "She boiled an egg for breakfast.",
      "example_cn": "她为早餐煮了一个鸡蛋。"
    },
    {
      "pos": "noun",
      "explanation_en": "A similar structure in other organisms, such as the egg of a frog or a fish, often used metaphorically to describe something fragile or in an early stage of development.",
      "explanation_cn": "指其他生物体中类似的结构，如青蛙或鱼的卵，也常被隐喻为脆弱或处于早期发展阶段的事物。",
      "example_en": "The artist's new project is still in its embryonic stage — just an egg at this point.",
      "example_cn": "这位艺术家的新项目仍处于初期阶段——目前还只是一个雏形。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slang term for the human head, especially in phrases like 'egghead' (an intellectual).",
      "explanation_cn": "俚语中指人的头部，尤其在如 'egghead'（知识分子）这样的短语中使用。",
      "example_en": "He's an egghead who spends all day reading philosophy.",
      "example_cn": "他是个整天埋头读哲学的知识分子。"
    },
    {
      "pos": "verb",
      "explanation_en": "To urge or incite someone to do something, especially something risky or foolish, often used in the phrase 'egg on'.",
      "explanation_cn": "鼓动或挑唆某人做某事，尤指危险或愚蠢的事，常用于短语 'egg on'（怂恿）。",
      "example_en": "The crowd egged him on to jump off the bridge.",
      "example_cn": "人群怂恿他从桥上跳下去。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ovum",
      "analysis": "“Ovum”（卵细胞）是生物学中的专业术语，特指雌性生殖细胞，强调其细胞层面的结构和功能，常用于科学语境。而 “egg” 是日常用语，泛指所有动物产下的卵，包括未受精的蛋，语义更宽泛、更通俗。"
    },
    {
      "word_to_compare": "shell",
      "analysis": "“Shell”（壳）是蛋的外部保护结构，是蛋的组成部分，但本身不包含内部内容物。而 “egg” 指的是包含蛋黄、蛋白和外壳的整体结构。两者是部分与整体的关系，不能互换。"
    },
    {
      "word_to_compare": "incite",
      "analysis": "“Incite”（煽动）是正式用语，指通过言语或行为激起他人采取激烈或非法行动，常用于政治或法律语境。而 “egg” 作为动词时，仅用于口语化的短语 'egg on'，语气较轻，常用于非正式场合，强调的是持续的鼓励而非恶意煽动。"
    }
  ]
}