{
  "word": "eggs",
  "pronunciation": "eɡz",
  "concise_definition": "n. 鸡蛋, 卵, 精子（复数形式）",
  "forms": {
    "singular": "egg"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The oval or round reproductive body produced by female birds, reptiles, fish, and some other animals, typically enclosed in a hard shell and containing a yolk and albumen.",
      "explanation_cn": "雌性鸟类、爬行动物、鱼类及其他一些动物产生的卵形或圆形生殖体，通常包裹在硬壳中，内含蛋黄和蛋清。",
      "example_en": "She boiled three eggs for breakfast.",
      "example_cn": "她为早餐煮了三个鸡蛋。"
    },
    {
      "pos": "noun",
      "explanation_en": "The male reproductive cell (sperm) in humans and other animals, often used informally in plural form to refer to sperm count or fertility.",
      "explanation_cn": "人类及其他动物的雄性生殖细胞（精子），口语中常用复数形式指代精子数量或生育能力。",
      "example_en": "His doctor advised him to improve his lifestyle to boost his eggs.",
      "example_cn": "他的医生建议他改善生活方式以提高精子质量。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slang term for testicles, often used in informal or humorous contexts.",
      "explanation_cn": "俚语，指睾丸，常用于非正式或幽默语境中。",
      "example_en": "He took a hard hit to the eggs during the game.",
      "example_cn": "他在比赛中被重重击中了睾丸。"
    },
    {
      "pos": "noun",
      "explanation_en": "A metaphorical or idiomatic reference to potential or future possibilities, especially in phrases like 'put all your eggs in one basket'.",
      "explanation_cn": "比喻性或习语性用法，指潜在或未来的可能性，尤见于短语如 '把所有鸡蛋放在一个篮子里'。",
      "example_en": "Don't put all your eggs in one basket—invest in multiple markets.",
      "example_cn": "别把所有鸡蛋放在一个篮子里——要分散投资多个市场。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ovum",
      "analysis": "“Ovum”（卵细胞）是生物学中的专业术语，特指雌性动物的单个生殖细胞，强调其细胞结构和生理功能。而 “egg” 是日常用语，泛指整个卵（包括外壳、蛋清、蛋黄等），更常用于非科学语境。"
    },
    {
      "word_to_compare": "sperm",
      "analysis": "“Sperm”（精子）是男性生殖细胞的科学术语，专指雄性配子。虽然口语中有时用 “eggs” 借代精子，但这是不准确的误用。在正式语境中，应使用 “sperm” 以避免混淆。"
    },
    {
      "word_to_compare": "seed",
      "analysis": "“Seed”（种子）是植物的繁殖体，包含胚胎和营养组织，用于植物生长。虽然在比喻意义上可与 “egg” 类比（如 ‘the seed of an idea’），但 “seed” 不用于动物或人类生殖，且无蛋壳或蛋清结构。"
    }
  ]
}