{
  "word": "egyptian",
  "pronunciation": "i·jip·shən",
  "concise_definition": "adj. 埃及的, 埃及人的; n. 埃及人, 埃及语",
  "forms": {
    "plural": "egyptians"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or originating from Egypt, its people, culture, language, or history, especially in the context of ancient civilization.",
      "explanation_cn": "与埃及及其人民、文化、语言或历史相关的，尤指与古文明有关的。",
      "example_en": "The Egyptian pyramids are among the most iconic structures in human history.",
      "example_cn": "埃及金字塔是人类历史上最具标志性的建筑之一。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characteristic of the ancient Egyptian civilization, such as its art, writing system, or religious practices.",
      "explanation_cn": "具有古埃及文明特征的，如其艺术、文字系统或宗教习俗。",
      "example_en": "Hieroglyphics are a classic example of Egyptian writing.",
      "example_cn": "象形文字是古埃及文字的典型代表。"
    },
    {
      "pos": "noun",
      "explanation_en": "A native or inhabitant of Egypt, especially one of modern Egypt.",
      "explanation_cn": "埃及的原住民或居民，尤指现代埃及人。",
      "example_en": "Many Egyptians work in tourism, which is a major part of their economy.",
      "example_cn": "许多埃及人从事旅游业，这是其经济的重要组成部分。"
    },
    {
      "pos": "noun",
      "explanation_en": "The Semitic language spoken in Egypt, historically written in hieroglyphs and now largely replaced by Arabic.",
      "explanation_cn": "历史上在埃及使用的闪米特语，曾用象形文字书写，现基本被阿拉伯语取代。",
      "example_en": "The Rosetta Stone helped scholars decipher Egyptian hieroglyphs and understand the ancient language.",
      "example_cn": "罗塞塔石碑帮助学者破译了埃及象形文字，从而理解了这种古代语言。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "egyptian",
      "analysis": "“Egyptian” 特指与埃及国家、民族或古文明直接相关的，具有明确地理和文化边界。它不同于泛指北非或中东的词汇，如 “Arab”（阿拉伯的）或 “African”（非洲的），后者范围更广，不特指埃及。"
    },
    {
      "word_to_compare": "ancient",
      "analysis": "“Ancient”（古代的）是一个时间维度的形容词，泛指所有古代文明（如古希腊、古罗马），而 “Egyptian” 是一个文化-地理维度的词，即使在现代语境中仍可指代埃及的当代事物。两者可叠加使用，如 “ancient Egyptian civilization”，但单独使用时，“ancient” 不具地域指向性。"
    },
    {
      "word_to_compare": "nubian",
      "analysis": "“Nubian”（努比亚的）指代尼罗河上游地区（今苏丹北部与埃及南部）的民族与文化，与埃及文明相邻但独立。虽然两者在历史上有密切交流，但 “Nubian” 强调的是非埃及本土的黑非洲文化传统，而 “Egyptian” 则代表尼罗河下游的主流文明体系。"
    }
  ]
}