{
  "word": "elbow",
  "pronunciation": "el·bou",
  "concise_definition": "n. 肘, 肘部; v. 用肘推挤, 挤开",
  "forms": {
    "plural": "elbows",
    "third_person_singular": "elbows",
    "past_tense": "elbowed",
    "past_participle": "elbowed",
    "present_participle": "elbowing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The joint between the upper and lower parts of the arm, where the humerus, radius, and ulna bones meet, allowing for bending and rotation of the forearm.",
      "explanation_cn": "上臂与前臂之间的关节，由肱骨、桡骨和尺骨交汇形成，使前臂能够弯曲和旋转。",
      "example_en": "She rested her chin on her elbow while reading the book.",
      "example_cn": "她读书时把下巴搁在肘部上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sharp bend or corner in a road, river, or other linear structure, resembling the shape of a human elbow.",
      "explanation_cn": "道路、河流或其他线性结构中的一个锐角弯折处，形状类似人的肘部。",
      "example_en": "The car took the elbow at high speed and lost control.",
      "example_cn": "汽车以高速通过这个弯道时失去了控制。"
    },
    {
      "pos": "verb",
      "explanation_en": "To push or nudge someone gently or forcefully with the elbow, often to get attention, make space, or express impatience.",
      "explanation_cn": "用肘部轻轻或用力推挤某人，通常是为了引起注意、腾出空间或表达不耐烦。",
      "example_en": "He elbowed his way through the crowd to reach the front.",
      "example_cn": "他用肘部在人群中挤出一条路，走到前面。"
    },
    {
      "pos": "verb",
      "explanation_en": "To use one's elbow as a tool or weapon in a physical interaction, often in a competitive or aggressive context.",
      "explanation_cn": "在身体互动中将肘部作为工具或武器使用，常用于竞争或对抗情境中。",
      "example_en": "The basketball player elbowed his opponent to gain position under the basket.",
      "example_cn": "这位篮球运动员用肘部顶开对手，以在篮下占据有利位置。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "joint",
      "analysis": "“Joint” (关节) 是一个更广泛的解剖学术语，泛指身体中两块骨头相连接的任何部位，如膝关节、肩关节等。而 “elbow” 是特指上臂与前臂之间的那个具体关节，属于 “joint” 的一种。"
    },
    {
      "word_to_compare": "corner",
      "analysis": "“Corner” (角落) 指两个平面或线条相交形成的角，常用于描述房间、街道或图形的转角。虽然 “elbow” 在比喻义上可指弯曲处，但 “corner” 更强调几何形状，而 “elbow” 带有生物形态的联想，更具体、更形象。"
    },
    {
      "word_to_compare": "shove",
      "analysis": "“Shove” (猛推) 是一个通用动词，指用全身力量向前推，通常用手或身体。而 “elbow” 作为动词时，特指用肘部推挤，动作范围更小、更局部，且常带有不礼貌或竞争性的语义色彩。"
    }
  ]
}