{
  "word": "elective",
  "pronunciation": "ih·lek·tiv",
  "concise_definition": "n. 选修课, 任选科目; adj. 选修的, 任选的, 选举产生的",
  "forms": {
    "plural": "electives"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A course or subject that a student may choose to take, rather than being required by a curriculum; often used in educational contexts to allow flexibility in learning.",
      "explanation_cn": "指学生可以根据个人兴趣或学术目标自主选择修读的课程，而非课程体系强制要求的必修课，常用于教育环境中以增加学习的灵活性。",
      "example_en": "She took an elective in ancient philosophy to broaden her humanities knowledge.",
      "example_cn": "她选修了一门古希腊哲学课程，以拓宽自己的人文知识。"
    },
    {
      "pos": "noun",
      "explanation_en": "A position or office that is filled by election, especially in political or organizational contexts.",
      "explanation_cn": "指通过选举产生的职位或职务，尤其用于政治或组织环境中。",
      "example_en": "He is running for an elective office in the city council.",
      "example_cn": "他正在竞选市议会的一个民选职位。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or chosen by election or personal choice, rather than being mandatory or assigned.",
      "explanation_cn": "指与选举或个人选择相关，而非强制性或被指派的。",
      "example_en": "The program offers several elective modules in digital media.",
      "example_cn": "该课程提供多个数字媒体方向的选修模块。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Not compulsory; optional, allowing freedom of selection.",
      "explanation_cn": "非强制性的；可选择的，允许自由挑选。",
      "example_en": "Attendance at the workshop is elective, not required.",
      "example_cn": "参加研讨会是选修的，不是必须的。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "optional",
      "analysis": "“Optional” (可选的) 是一个更通用的词，泛指任何非强制性的选择，适用于各种情境（如活动、任务、物品）。“Elective” 则更常用于教育或政治语境，特指通过选择机制（如选课或选举）确定的内容，语义更具体、专业。"
    },
    {
      "word_to_compare": "compulsory",
      "analysis": "“Compulsory” (强制的) 是 “elective” 的反义词，强调必须遵守或完成，无选择余地。例如，数学是必修课（compulsory），而艺术是选修课（elective）。两者在教育体系中形成明确对比。"
    },
    {
      "word_to_compare": "chosen",
      "analysis": "“Chosen” (被选择的) 是动词 choose 的过去分词，强调动作的结果，但不隐含制度性或结构性的选择机制。而 “elective” 暗示一种制度化、系统化的选择权利，如学校课程设置或民主选举制度。"
    }
  ]
}