{
  "word": "elevate",
  "pronunciation": "el·uh·veyt",
  "concise_definition": "v. 提升, 提高, 举起, 升华",
  "forms": {
    "third_person_singular": "elevates",
    "past_tense": "elevated",
    "past_participle": "elevated",
    "present_participle": "elevating"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To raise something physically to a higher position or level, often using force or mechanical means.",
      "explanation_cn": "指通过外力或机械手段将某物在物理空间中提升到更高的位置。",
      "example_en": "The crane was used to elevate the heavy steel beams to the top floor.",
      "example_cn": "起重机被用来将沉重的钢梁提升到顶层。"
    },
    {
      "pos": "verb",
      "explanation_en": "To improve or enhance the quality, status, or value of something, especially in an abstract or social context.",
      "explanation_cn": "指在抽象或社会语境中提升某物的质量、地位或价值，使其更优秀或更受尊重。",
      "example_en": "Her thoughtful leadership elevated the entire team's morale.",
      "example_cn": "她富有洞察力的领导提升了整个团队的士气。"
    },
    {
      "pos": "verb",
      "explanation_en": "To raise someone's rank, status, or dignity, often in a formal or ceremonial way.",
      "explanation_cn": "指以正式或仪式性的方式提升某人的等级、地位或尊严。",
      "example_en": "The king elevated him to the title of Duke for his loyal service.",
      "example_cn": "国王因其忠诚服务而将他册封为公爵。"
    },
    {
      "pos": "verb",
      "explanation_en": "To lift the spirit or mind to a higher, more noble or refined state; to inspire or uplift emotionally or intellectually.",
      "explanation_cn": "指使精神或思想升华到更高尚、更精致的境界；在情感或智力上给予激励或提升。",
      "example_en": "The symphony elevated the audience to a state of profound awe.",
      "example_cn": "这首交响乐使听众陷入深深的敬畏之中。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "raise",
      "analysis": "“Raise” (提高) 是最通用的词，可用于物理提升、数量增加或地位提升，语义范围广但较中性。而 “elevate” 更强调提升的庄严性、价值性或精神性，常用于正式或文学语境，带有更强烈的积极评价色彩。"
    },
    {
      "word_to_compare": "boost",
      "analysis": "“Boost” (促进/增强) 通常指快速、短期的提升，常用于情绪、销量、信心等，语气更口语化、非正式。而 “elevate” 更强调持久、结构性的提升，常用于地位、品质或精神层面，语义更庄重。"
    },
    {
      "word_to_compare": "upgrade",
      "analysis": "“Upgrade” (升级) 侧重于技术性或系统性的改进，如软件、设备或服务的版本更新，强调功能增强。而 “elevate” 更广泛，可涵盖非技术性的精神、道德或社会层面的提升，不局限于系统或工具。"
    },
    {
      "word_to_compare": "exalt",
      "analysis": "“Exalt” (颂扬/抬高) 与 “elevate” 在提升地位或尊严方面相近，但 “exalt” 更常用于宗教、神话或极端赞美语境，带有崇拜或神化的意味，语气更强、更夸张。而 “elevate” 更中性、理性，适用于日常正式语境。"
    }
  ]
}