{
  "word": "elgin",
  "pronunciation": "el·jin",
  "concise_definition": "n. 埃尔金（专有名词，地名/人名）",
  "forms": {
    "plural": "Elgins"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to Elgin, a city in Scotland or several towns in the United States (e.g., Elgin, Illinois; Elgin, Texas), often associated with historical, cultural, or geographical context.",
      "explanation_cn": "专有名词，指苏格兰的埃尔金市，或美国多个同名城镇（如伊利诺伊州埃尔金、德克萨斯州埃尔金），常与历史、文化或地理背景相关。",
      "example_en": "The Elgin Marbles were originally from the Parthenon in Athens and are now housed in the British Museum.",
      "example_cn": "埃尔金大理石雕原位于雅典帕特农神庙，现藏于大英博物馆。"
    },
    {
      "pos": "noun",
      "explanation_en": "A surname or family name, historically associated with Scottish nobility or descendants of the town of Elgin in Moray, Scotland.",
      "explanation_cn": "作为姓氏，历史上与苏格兰莫雷地区的埃尔金镇贵族或后裔相关。",
      "example_en": "Lord Elgin, the 7th Earl of Elgin, was the British diplomat who removed the Parthenon sculptures in the early 19th century.",
      "example_cn": "埃尔金勋爵，第七代埃尔金伯爵，是19世纪初将帕特农神庙雕塑运走的英国外交官。"
    },
    {
      "pos": "noun",
      "explanation_en": "A brand name or trademark, notably used for Elgin watches, a historic American watch manufacturer founded in Elgin, Illinois, known for precision timepieces in the late 19th and early 20th centuries.",
      "explanation_cn": "品牌名称，尤指由位于伊利诺伊州埃尔金的美国老牌手表制造商生产的埃尔金手表，以19世纪末至20世纪初的精密计时器闻名。",
      "example_en": "My grandfather wore an Elgin pocket watch that he inherited from his father.",
      "example_cn": "我祖父戴的是一块从他父亲那里继承来的埃尔金怀表。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "edinburgh",
      "analysis": "“Edinburgh”（爱丁堡）是苏格兰的首府和重要文化中心，而“Elgin”是苏格兰的一个较小的历史城镇，两者均为地名，但“Edinburgh”具有国家级政治与文化地位，而“Elgin”更多与地方历史、贵族头衔和工业品牌相关。"
    },
    {
      "word_to_compare": "marbles",
      "analysis": "“Marbles”（大理石）是普通名词，指一种石材或儿童游戏用球，而“Elgin”在“Elgin Marbles”中作为专有名词修饰“marbles”，特指从帕特农神庙移走的雕塑群，其意义完全依赖于历史语境和专有名称的绑定。"
    },
    {
      "word_to_compare": "brand",
      "analysis": "“Brand”（品牌）是泛指商业标识，而“Elgin”作为品牌名，是具体的历史实体，其价值源于特定地理起源（伊利诺伊州埃尔金）和制表工艺传统，不同于通用品牌如“Casio”或“Rolex”，它承载着地方工业遗产的特殊意义。"
    }
  ]
}