{
  "word": "embodied",
  "pronunciation": "em·bod·id",
  "concise_definition": "v. 体现, 具体化, 肉身化",
  "forms": {
    "base_form": "embody",
    "third_person_singular": "embodies",
    "past_tense": "embodied",
    "past_participle": "embodied",
    "present_participle": "embodying"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To represent or express an abstract idea, quality, or concept in a tangible, physical, or concrete form, making it perceptible or real.",
      "explanation_cn": "指将某种抽象的理念、品质或概念以具体、有形或实际的形式表现出来，使其可被感知或成为现实。",
      "example_en": "The statue embodies the spirit of freedom and resilience.",
      "example_cn": "这座雕像体现了自由与坚韧的精神。"
    },
    {
      "pos": "verb",
      "explanation_en": "To incorporate or integrate something (such as a principle, value, or system) into a person, organization, or structure so that it becomes an essential part of its nature or function.",
      "explanation_cn": "指将某种原则、价值观或体系融入某人、组织或结构中，使其成为其本质或功能中不可或缺的一部分。",
      "example_en": "The new policy embodies the company’s commitment to sustainability.",
      "example_cn": "这项新政策体现了公司对可持续发展的承诺。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give a physical form or human presence to something that is otherwise non-material, such as a deity, idea, or emotion.",
      "explanation_cn": "指为原本非物质的事物（如神灵、理念或情感）赋予物理形态或人身体现。",
      "example_en": "In ancient myths, the goddess of wisdom was embodied in the form of an owl.",
      "example_cn": "在古代神话中，智慧女神以猫头鹰的形象体现。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "represent",
      "analysis": "“Represent” (代表) 强调以符号、图像或代理人的方式指代某物，不必然要求该事物具有真实或物理的存在。例如，旗帜代表国家。而 “embodied” 强调抽象概念被真实地、实质地融入或成为具体存在，具有更强的“内在化”和“物质化”含义。"
    },
    {
      "word_to_compare": "manifest",
      "analysis": "“Manifest” (显现) 指某种隐藏或潜在的事物变得可见或可察觉，常用于情绪、症状或力量的外露。它更侧重于“显露”，而非“成为实体”。而 “embodied” 强调抽象事物被完全转化为具体形式，是本质的转化，而非表面的呈现。"
    },
    {
      "word_to_compare": "incarnate",
      "analysis": "“Incarnate” (化身) 与 “embodied” 非常接近，尤其在宗教或哲学语境中常互换使用，指神灵或抽象理念化身为肉身。但 “incarnate” 更具宗教或超自然色彩，常用于神圣实体（如基督是神的化身），而 “embodied” 用法更广泛，适用于理念、价值观、文化等非神圣语境。"
    }
  ]
}