{
  "word": "emissions",
  "pronunciation": "ih·mish·uhnz",
  "concise_definition": "n. 排放物, 排放, 释放",
  "forms": {
    "singular": "emission"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The discharge or release of substances, especially gases or radiation, into the environment, often as a byproduct of human activity such as industrial processes, transportation, or energy production.",
      "explanation_cn": "指物质（尤其是气体或辐射）被排放或释放到环境中，通常作为工业过程、交通运输或能源生产等人造活动的副产品。",
      "example_en": "Carbon dioxide emissions from vehicles are a major contributor to global warming.",
      "example_cn": "车辆排放的二氧化碳是导致全球变暖的主要因素之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or process of releasing such substances, often regulated by environmental policies to reduce pollution and climate impact.",
      "explanation_cn": "指释放此类物质的行为或过程，通常受到环境政策的监管，以减少污染和对气候的影响。",
      "example_en": "The new law aims to reduce greenhouse gas emissions by 40% within ten years.",
      "example_cn": "新法律旨在十年内将温室气体排放量减少40%。"
    },
    {
      "pos": "noun",
      "explanation_en": "In physics or engineering, the release of energy in the form of electromagnetic waves, particles, or other radiation from a source.",
      "explanation_cn": "在物理或工程领域，指从某一源头释放出的电磁波、粒子或其他形式的辐射能量。",
      "example_en": "The reactor's emissions were carefully monitored to ensure safety standards were met.",
      "example_cn": "对反应堆的辐射排放进行了严密监控，以确保符合安全标准。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pollution",
      "analysis": "“Pollution”（污染）是一个更广泛的概念，泛指环境中任何有害物质的引入，包括水污染、土壤污染、噪音污染等。而 “emissions” 特指通过空气释放的物质，是污染的一种主要来源，但不等于污染本身。"
    },
    {
      "word_to_compare": "discharge",
      "analysis": "“Discharge”（排放/排出）是一个更通用的术语，可指液体、气体或固体的释放，常用于法律或技术语境中（如废水排放）。而 “emissions” 几乎专指气体或辐射的释放，尤其在环境科学中具有特定含义。"
    },
    {
      "word_to_compare": "release",
      "analysis": "“Release”（释放）是一个更宽泛、更中性的动词，可指任何形式的释放（如释放囚犯、释放情绪、释放能量）。而 “emissions” 是名词，特指环境中有害物质的释放，具有明确的科学和政策语境。"
    }
  ]
}