{
  "word": "emo",
  "pronunciation": "ee·moh",
  "concise_definition": "adj. 情绪化的, 情感丰富的; n. 情绪核音乐风格",
  "forms": {
    "comparative": "emo-er",
    "superlative": "emo-est"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Characterized by intense, often melancholic or self-reflective emotions, especially in music, fashion, or personal expression; typically associated with heightened sensitivity and vulnerability.",
      "explanation_cn": "以强烈、常带忧郁或自我反思的情绪为特征，尤其用于描述音乐、时尚或个人表达；通常与高度敏感和脆弱性相关联。",
      "example_en": "She wore a black hoodie with band patches and wrote emo poetry about heartbreak.",
      "example_cn": "她穿着一件带有乐队贴纸的黑色连帽衫，写关于心碎的情绪核诗歌。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who identifies with or is associated with the emo subculture, often characterized by expressive clothing, emotional lyrics, and a focus on personal pain or alienation.",
      "explanation_cn": "指认同或属于情绪核亚文化的人，通常以富有表现力的着装、情感充沛的歌词以及对个人痛苦或疏离感的关注为特征。",
      "example_en": "He was labeled an emo in high school because he listened to My Chemical Romance and wore eyeliner.",
      "example_cn": "他在高中时因为听My Chemical Romance的歌并画眼线而被贴上‘情绪核’的标签。"
    },
    {
      "pos": "noun",
      "explanation_en": "A subgenre of punk and indie rock music that emphasizes emotional, confessional lyrics and dynamic shifts between quiet and loud passages.",
      "explanation_cn": "一种朋克和独立摇滚的子流派，强调情感真挚、自白式的歌词，以及在安静与激烈段落之间的强烈动态变化。",
      "example_en": "The 2000s saw the rise of emo bands like Fall Out Boy and Paramore.",
      "example_cn": "2000年代见证了Fall Out Boy和Paramore等情绪核乐队的兴起。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "goth",
      "analysis": "“Goth”（哥特）风格更强调黑暗美学、神秘主义和死亡主题，服装常为黑色长袍、皮革和银饰，音乐偏向工业或后朋克；而 “emo” 更注重个人情感宣泄、青春焦虑和内省，视觉风格更偏向紧身裤、锥形发和鲜艳发色，音乐更具旋律性和情绪起伏。"
    },
    {
      "word_to_compare": "alternative",
      "analysis": "“Alternative”（另类）是一个更宽泛的音乐和文化类别，涵盖多种非主流风格，包括另类摇滚、独立音乐等；而 “emo” 是另类音乐中的一个具体子流派，具有明确的情感表达模式和文化符号，范围更窄、更具体。"
    },
    {
      "word_to_compare": "sensitive",
      "analysis": "“Sensitive”（敏感的）是一个通用形容词，描述一个人对情绪或环境反应强烈，不带有文化或风格含义；而 “emo” 不仅描述情绪状态，还承载特定的亚文化身份、审美和音乐传统，具有社会标签属性。"
    }
  ]
}