{
  "word": "empower",
  "pronunciation": "em·pow·er",
  "concise_definition": "v. 授权, 赋予权力, 使有能力",
  "forms": {
    "third_person_singular": "empowers",
    "past_tense": "empowered",
    "past_participle": "empowered",
    "present_participle": "empowering"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To give someone the authority, confidence, or resources needed to take control of their own life or make decisions, especially in contexts where they were previously disempowered.",
      "explanation_cn": "指给予某人必要的权力、信心或资源，使其能够掌控自己的生活或做出决定，尤其适用于原本处于无权状态的情境。",
      "example_en": "The nonprofit organization empowers women in rural communities by providing education and microloans.",
      "example_cn": "这家非营利组织通过提供教育和小额贷款，赋予农村女性自主权。"
    },
    {
      "pos": "verb",
      "explanation_en": "To enable or equip someone with the skills, tools, or opportunities to achieve a specific goal or perform a task effectively.",
      "explanation_cn": "指通过提供技能、工具或机会，使某人能够有效达成特定目标或完成某项任务。",
      "example_en": "Training programs empower employees to solve problems independently and innovate in their roles.",
      "example_cn": "培训项目使员工能够独立解决问题并在工作中创新。"
    },
    {
      "pos": "verb",
      "explanation_en": "To legally or formally grant power or jurisdiction to an individual or group to act on behalf of another.",
      "explanation_cn": "指依法或正式授予个人或团体代表他人行事的权力或管辖权。",
      "example_en": "The contract empowers the agent to sign legal documents on behalf of the client.",
      "example_cn": "该合同授权代理人代表客户签署法律文件。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "authorize",
      "analysis": "“Authorize” (授权) 强调正式赋予某种权限或批准某人做某事，通常具有法律或制度依据，但不一定包含能力提升或信心增强的含义。而 “empower” 不仅包含授权，更强调通过支持使对方获得内在力量和主动性。"
    },
    {
      "word_to_compare": "enable",
      "analysis": "“Enable” (使能够) 侧重于消除障碍或提供条件，使某事成为可能，常用于技术或物理层面（如软件启用功能）。而 “empower” 更强调社会、心理或政治层面的赋权，带有更强的自主性和能动性内涵。"
    },
    {
      "word_to_compare": "motivate",
      "analysis": "“Motivate” (激励) 指通过外部刺激（如奖励、压力）激发人的行动意愿，但不必然赋予实际权力或能力。“Empower” 则是通过提供资源和自主权，使人真正拥有行动的能力和控制感，是更深层次的赋能。"
    }
  ]
}