{
  "word": "encounter",
  "pronunciation": "en·koun·tər",
  "concise_definition": "v. 遭遇, 遇到; n. 遭遇, 偶遇",
  "forms": {
    "third_person_singular": "encounters",
    "past_tense": "encountered",
    "past_participle": "encountered",
    "present_participle": "encountering"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To come across or meet someone or something unexpectedly or during a journey or process, often implying a significant or challenging interaction.",
      "explanation_cn": "指在旅程或过程中意外或偶然地遇到某人或某物，常暗示一种重要或具有挑战性的互动。",
      "example_en": "The explorers encountered harsh weather conditions during their expedition.",
      "example_cn": "探险家们在远征途中遭遇了恶劣的天气。"
    },
    {
      "pos": "verb",
      "explanation_en": "To face or confront a problem, difficulty, or obstacle, especially one that requires effort to overcome.",
      "explanation_cn": "指面对或应对一个问题、困难或障碍，尤其是需要努力克服的情况。",
      "example_en": "Many students encounter difficulties when learning advanced mathematics.",
      "example_cn": "许多学生在学习高等数学时会遇到困难。"
    },
    {
      "pos": "noun",
      "explanation_en": "An instance of meeting someone or something, especially unexpectedly or briefly, often with emotional or practical significance.",
      "explanation_cn": "指与某人或某物相遇的一次经历，尤其是意外或短暂的相遇，通常具有情感或实际意义。",
      "example_en": "Their chance encounter at the café led to a lifelong friendship.",
      "example_cn": "他们在咖啡馆的偶然相遇促成了终生的友谊。"
    },
    {
      "pos": "noun",
      "explanation_en": "A confrontation or clash, especially in a military, competitive, or conflict-related context.",
      "explanation_cn": "指在军事、竞争或冲突背景下的一次对抗或交锋。",
      "example_en": "The two armies had a fierce encounter near the river.",
      "example_cn": "两军在河边发生了一场激烈的交战。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "meet",
      "analysis": "“Meet” (遇见) 是最通用的词，通常指计划中或中性的见面，如会面、相识，情感色彩较中性。而 “encounter” 更强调意外性、挑战性或非预期性，常用于负面或紧张情境，如遭遇危险或困难。"
    },
    {
      "word_to_compare": "face",
      "analysis": "“Face” (面对) 更侧重于心理或态度上的应对，常用于抽象问题，如“face a challenge”。“Encounter” 则更强调实际的、具体的接触或发生，既可以是人、物，也可以是事件，更具场景感。"
    },
    {
      "word_to_compare": "run into",
      "analysis": "“Run into” 是口语化表达，与 “encounter” 在“偶然遇见”义项上接近，但语气更随意、非正式，且多用于人或小规模事件，如“我昨天在街上遇到了老朋友”。而 “encounter” 更正式，可用于学术、军事或文学语境，涵盖范围更广。"
    }
  ]
}