{
  "word": "enforcing",
  "pronunciation": "in·fors·ing",
  "concise_definition": "v. 强制执行, 实施, 强迫遵守",
  "forms": {
    "base_form": "enforce",
    "third_person_singular": "enforces",
    "past_tense": "enforced",
    "past_participle": "enforced",
    "present_participle": "enforcing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To ensure that a law, rule, or decision is obeyed by using authority or force, often through penalties or consequences for non-compliance.",
      "explanation_cn": "指利用权威或强制力确保法律、规则或决定得到遵守，通常通过施加处罚或后果来实现。",
      "example_en": "The police are enforcing a new curfew to reduce nighttime crime.",
      "example_cn": "警方正在强制执行新的宵禁令，以减少夜间犯罪。"
    },
    {
      "pos": "verb",
      "explanation_en": "To compel someone to adhere to a standard, obligation, or requirement, especially when resistance or neglect is present.",
      "explanation_cn": "指在存在抵触或忽视的情况下，强迫某人遵守某项标准、义务或要求。",
      "example_en": "The school is enforcing a strict dress code to promote discipline.",
      "example_cn": "学校正在强制执行严格的着装规范，以培养纪律性。"
    },
    {
      "pos": "verb",
      "explanation_en": "To actively apply or implement a policy, agreement, or system in practice, making it effective rather than theoretical.",
      "explanation_cn": "指在实践中积极实施某项政策、协议或制度，使其真正生效，而非仅停留在理论层面。",
      "example_en": "The government is enforcing environmental regulations more rigorously this year.",
      "example_cn": "今年政府正在更严格地实施环境保护法规。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "implement",
      "analysis": "“Implement” (实施) 指将计划、政策或系统付诸实践，强调从无到有的执行过程，但不一定包含强制或惩罚机制。而 “enforcing” 更侧重于确保执行到位，通常涉及监督、纠正或制裁，带有更强的权威性和约束力。"
    },
    {
      "word_to_compare": "compel",
      "analysis": "“Compel” (迫使) 强调通过压力、道德或法律手段使某人做某事，常用于个体行为层面，不一定涉及系统性规则的执行。而 “enforcing” 更常用于制度、法律或规则的宏观层面，强调系统性、持续性的监督与执行。"
    },
    {
      "word_to_compare": "uphold",
      "analysis": "“Uphold” (维护/坚持) 指支持或维持某项原则、法律或决定的正当性与权威性，常带有道德或司法层面的庄重感，但不一定包含主动干预或惩罚。而 “enforcing” 更强调实际的行动和强制手段，是使规则产生实效的动态过程。"
    }
  ]
}