{
  "word": "engagements",
  "pronunciation": "en·gaj·muhnts",
  "concise_definition": "n. 交往, 约会, 订婚, 参与, 任务",
  "forms": {
    "singular": "engagement"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A planned appointment or social obligation, such as a meeting, event, or activity to which one is committed.",
      "explanation_cn": "指已安排好的约会或社交义务，如会议、活动或其他个人必须参与的事务。",
      "example_en": "She had to cancel her evening engagements to attend the family reunion.",
      "example_cn": "她不得不取消晚上的约会，去参加家庭聚会。"
    },
    {
      "pos": "noun",
      "explanation_en": "A formal agreement to marry; a promise to wed, often marked by the exchange of rings.",
      "explanation_cn": "指正式的婚约，通常以交换戒指为标志，表示双方承诺结婚。",
      "example_en": "The couple announced their engagement last weekend.",
      "example_cn": "这对情侣上周末宣布了他们的订婚消息。"
    },
    {
      "pos": "noun",
      "explanation_en": "Active participation or involvement in an activity, cause, or relationship, often implying sustained attention or commitment.",
      "explanation_cn": "指对某项活动、事业或关系的积极参与或投入，通常暗示持续的关注或承诺。",
      "example_en": "The company is working to increase customer engagement through social media.",
      "example_cn": "该公司正通过社交媒体努力提升客户参与度。"
    },
    {
      "pos": "noun",
      "explanation_en": "A military confrontation or battle, especially a smaller-scale conflict within a larger war.",
      "explanation_cn": "指军事冲突或战斗，尤指大规模战争中规模较小的交战。",
      "example_en": "The battle of Gettysburg was one of the most significant engagements of the American Civil War.",
      "example_cn": "葛底斯堡战役是美国内战中最重大的一次交战。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "appointment",
      "analysis": "“Appointment”（预约）更侧重于时间安排上的正式约定，通常用于医疗、商务等正式场合，不包含情感或承诺成分。而 “engagement” 除了时间安排外，还常带有社交义务或情感投入的含义，范围更广。"
    },
    {
      "word_to_compare": "commitment",
      "analysis": "“Commitment”（承诺）强调责任、忠诚或长期投入，多用于抽象层面（如对事业、关系的承诺），而 “engagement” 更具体，常指实际发生的参与行为或事件，如约会、战斗或订婚。"
    },
    {
      "word_to_compare": "interaction",
      "analysis": "“Interaction”（互动）指双方或多方之间的交流行为，强调过程本身，不一定有预先安排或承诺。而 “engagement” 暗示了某种预定性或深度参与，如客户参与营销活动，或情侣订婚，具有更强的目的性和持续性。"
    }
  ]
}