{
  "word": "engineered",
  "pronunciation": "en·jih·NEERD",
  "concise_definition": "adj. 工程设计的, 有计划地制造的; v. 工程设计, 精心策划 (engineer 的过去式和过去分词)",
  "forms": {
    "base_form": "engineer",
    "third_person_singular": "engineers",
    "past_tense": "engineered",
    "past_participle": "engineered",
    "present_participle": "engineering",
    "noun_form": "engineer"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Designed or constructed with deliberate technical skill and precision, often implying human intervention to achieve a specific, optimized outcome.",
      "explanation_cn": "指经过有意识的技术性设计与精密制造，通常暗示人为干预以实现特定、优化的结果。",
      "example_en": "The engineered wood floor is more durable than natural hardwood.",
      "example_cn": "这种工程木地板比天然硬木更耐用。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Carefully planned or manipulated, especially in a way that is subtle or strategic, often to achieve a desired effect or outcome.",
      "explanation_cn": "指经过精心策划或操控，尤其以微妙或策略性的方式，旨在实现预期的效果或结果。",
      "example_en": "The political campaign was an engineered success, using targeted social media ads.",
      "example_cn": "这场政治运动是一场精心策划的成功，依靠的是精准的社交媒体广告。"
    },
    {
      "pos": "verb",
      "explanation_en": "To design, construct, or manage something using technical knowledge, especially in engineering or systems design.",
      "explanation_cn": "指运用技术知识设计、建造或管理某物，尤其在工程或系统设计领域。",
      "example_en": "Engineers engineered a new bridge that can withstand earthquakes.",
      "example_cn": "工程师们设计了一座能抵御地震的新桥梁。"
    },
    {
      "pos": "verb",
      "explanation_en": "To bring about or cause something to happen through deliberate and often complex planning or manipulation.",
      "explanation_cn": "指通过有意识的、通常是复杂的规划或操控，促成某事的发生。",
      "example_en": "They engineered a merger between the two rival companies.",
      "example_cn": "他们策划了两家竞争对手公司的合并。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "designed",
      "analysis": "“Designed” (设计) 是一个更通用的词，适用于任何有目的的规划，包括艺术、服装或界面设计，不强调技术性或工程背景。而 “engineered” 隐含了科学、技术或系统性方法的深度应用，常用于强调复杂性、精确性和功能性。"
    },
    {
      "word_to_compare": "constructed",
      "analysis": "“Constructed” (建造) 侧重于物理材料的组装或搭建过程，强调动作本身，不必然包含设计的复杂性或策略性。而 “engineered” 不仅包含建造，更强调设计过程中的技术优化、计算和系统整合。"
    },
    {
      "word_to_compare": "manipulated",
      "analysis": "“Manipulated” (操控) 常带有负面含义，暗示不正当或欺骗性的干预。而 “engineered” 在描述人为策划时，通常是中性或褒义的，强调专业性和目的性，而非道德贬义。例如，‘engineered a solution’ 是正面的，而 ‘manipulated the results’ 是负面的。"
    }
  ]
}