{
  "word": "engine",
  "pronunciation": "en·jihn",
  "concise_definition": "n. 发动机, 机车, 推动力; v. 驱动, 推动",
  "forms": {
    "plural": "engines"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A machine that converts energy, such as fuel or electricity, into mechanical force or motion, typically used to power vehicles or machinery.",
      "explanation_cn": "一种将能量（如燃料或电力）转化为机械力或运动的机器，通常用于驱动车辆或机械装置。",
      "example_en": "The car's engine roared to life as the driver turned the key.",
      "example_cn": "司机一拧钥匙，汽车的发动机便轰然启动。"
    },
    {
      "pos": "noun",
      "explanation_en": "A locomotive, especially a steam or diesel-powered train engine, used to pull or push railway cars.",
      "explanation_cn": "指火车头，尤其是蒸汽或柴油动力的机车，用于牵引或推动铁路车厢。",
      "example_en": "The historic steam engine was displayed at the railway museum.",
      "example_cn": "这台历史悠久的蒸汽机车在铁路博物馆展出。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person, thing, or system that drives or powers a process, movement, or change, often metaphorically.",
      "explanation_cn": "指推动某一过程、运动或变革的人、事物或系统，常用于比喻意义。",
      "example_en": "Innovation is the engine of economic growth.",
      "example_cn": "创新是经济增长的驱动力。"
    },
    {
      "pos": "verb",
      "explanation_en": "To drive or propel something forward, especially by providing the main source of energy or motivation.",
      "explanation_cn": "指通过提供主要能量或动力来推动某事物向前发展。",
      "example_en": "Social media engines the spread of viral content across platforms.",
      "example_cn": "社交媒体推动了病毒式内容在各平台上的传播。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "motor",
      "analysis": "“Motor”（马达）通常指将电能转化为机械能的小型动力装置，多用于电子设备或精密机械中，如电动机。而 “engine” 更常用于指燃烧燃料产生动力的大型机械，如汽车或飞机发动机，范围更广，语义更重。"
    },
    {
      "word_to_compare": "mechanism",
      "analysis": "“Mechanism”（机制）泛指任何实现特定功能的结构或系统，可以是机械的、生物的或抽象的（如社会机制）。它强调结构和运作方式，不一定是动力源。而 “engine” 特指提供动力的核心部件，是机制中的动力核心。"
    },
    {
      "word_to_compare": "driver",
      "analysis": "“Driver”（驱动者）常用于比喻义，指促使某事发生的人或因素，如“a driver of change”。它更抽象，强调主观能动性。而 “engine” 作为比喻时，更强调其作为“动力源”的客观、持续、系统性作用，常用于描述结构性推动力。"
    }
  ]
}