{
  "word": "english",
  "pronunciation": "ing·glish",
  "concise_definition": "n. 英语, 英国人; adj. 英格兰的, 英语的, 英国的",
  "forms": {
    "plural": "englishes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The West Germanic language that originated in England and is now the primary language of many countries, including the United States, the United Kingdom, Canada, Australia, and others.",
      "explanation_cn": "起源于英格兰的西日耳曼语，现为包括美国、英国、加拿大、澳大利亚等许多国家的主要语言。",
      "example_en": "She speaks fluent English and is studying Chinese as a second language.",
      "example_cn": "她能流利地说英语，并正在学习中文作为第二语言。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person from England or of English descent; sometimes used broadly to refer to people from the United Kingdom.",
      "explanation_cn": "来自英格兰的人或英格兰后裔；有时泛指来自英国的人。",
      "example_en": "The English are known for their love of tea and polite manners.",
      "example_cn": "英国人以爱喝茶和礼貌的举止而闻名。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to England, its people, language, or culture.",
      "explanation_cn": "与英格兰、其人民、语言或文化相关的。",
      "example_en": "English literature includes works by Shakespeare, Dickens, and Austen.",
      "example_cn": "英国文学包括莎士比亚、狄更斯和奥斯汀的作品。"
    },
    {
      "pos": "noun",
      "explanation_en": "In billiards or pool, a spin applied to the cue ball to alter its path after it strikes another ball or cushion.",
      "explanation_cn": "在台球或斯诺克中，为使母球在撞击其他球或台边后改变行进路线而施加的旋转。",
      "example_en": "He used a little english to make the cue ball curve around the obstacle.",
      "example_cn": "他加了一点侧旋，让母球绕过障碍物。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "british",
      "analysis": "“British”（英国的）指整个大不列颠及北爱尔兰联合王国的，包括英格兰、苏格兰、威尔士和北爱尔兰；而 “English” 仅指英格兰的。例如，苏格兰人是 British，但不是 English。在语言上两者常可互换，但民族或文化语境中不可混淆。"
    },
    {
      "word_to_compare": "anglo",
      "analysis": "“Anglo” 是一个缩略形式，常用于复合词如 “Anglo-American”，指与英格兰或英语文化相关的，多用于学术或正式语境，强调文化或语言联系，而非国籍。它比 “English” 更抽象，不直接指代语言或人民本身。"
    },
    {
      "word_to_compare": "native",
      "analysis": "“Native”（母语的/本地的）强调语言或文化的原生性，如 “native speaker”（母语者），但不特指英语或英格兰。而 “English” 是一个具体语言和民族的名称，具有明确的地理和历史来源。"
    }
  ]
}