{
  "word": "enriched",
  "pronunciation": "in·rich·id",
  "concise_definition": "adj. 丰富的, 提升质量的, 加强营养的",
  "forms": {
    "base_form": "enrich",
    "present_participle": "enriching",
    "past_tense": "enriched",
    "past_participle": "enriched"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Improved in quality, value, or nutritional content by adding beneficial elements or substances; made more desirable or effective through enhancement.",
      "explanation_cn": "通过添加有益成分或物质而提升了质量、价值或营养含量；通过增强变得更有吸引力或更有效。",
      "example_en": "The bread is enriched with vitamins and minerals to support healthy digestion.",
      "example_cn": "这种面包添加了维生素和矿物质，以促进健康消化。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Made more culturally, intellectually, or emotionally rewarding through exposure to additional experiences, knowledge, or influences.",
      "explanation_cn": "通过接触更多的经历、知识或影响，使文化、智力或情感层面更加丰富和有意义。",
      "example_en": "Her travels enriched her understanding of global traditions and art.",
      "example_cn": "她的旅行丰富了她对全球传统与艺术的理解。"
    },
    {
      "pos": "adjective",
      "explanation_en": "In nuclear science, referring to material (such as uranium) that has had its concentration of a specific isotope increased for use in reactors or weapons.",
      "explanation_cn": "在核科学中，指某种物质（如铀）中特定同位素的浓度被提高，用于反应堆或武器。",
      "example_en": "Enriched uranium is used as fuel in nuclear power plants.",
      "example_cn": "浓缩铀被用作核电站的燃料。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "enhanced",
      "analysis": "“Enhanced”（增强的）强调通过技术或人为手段提升性能、功能或外观，常用于科技或产品语境，如“enhanced graphics”。而 “enriched” 更侧重于内容的充实与质量的内在提升，尤其在营养、文化或情感层面更常用。"
    },
    {
      "word_to_compare": "fortified",
      "analysis": "“Fortified”（强化的）多用于食品或建筑领域，指通过添加特定成分（如维生素、矿物质或钢筋）来增强其结构或抵御能力，具有更强的“防护性”含义。而 “enriched” 更中性，强调“增加价值”而非“加固防御”。"
    },
    {
      "word_to_compare": "elaborated",
      "analysis": "“Elaborated”（详尽阐述的）指对内容进行更详细、复杂的扩展，常用于语言、理论或计划的深化。它强调的是信息量的增加和结构的复杂化，而 “enriched” 更关注质量的提升和内涵的深化，不一定增加复杂性。"
    }
  ]
}