{
  "word": "entangled",
  "pronunciation": "en·tang·gld",
  "concise_definition": "adj. 缠绕的, 交织的, 纠缠不清的",
  "forms": {
    "base_form": "entangle",
    "present_participle": "entangling",
    "past_tense": "entangled",
    "past_participle": "entangled"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Physically twisted or caught together in a complicated way, making it difficult to separate or free oneself.",
      "explanation_cn": "物理上以复杂的方式缠绕或交织在一起，难以分离或脱身。",
      "example_en": "The fishing net was entangled with seaweed and plastic debris.",
      "example_cn": "渔网被海藻和塑料碎片缠绕在一起。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Involved in a complicated or confusing situation, often one that is difficult to escape from, such as a legal, emotional, or political dilemma.",
      "explanation_cn": "陷入复杂或令人困惑的境地，通常指难以摆脱的法律、情感或政治困境。",
      "example_en": "She became entangled in a bitter custody battle after the divorce.",
      "example_cn": "离婚后，她陷入了一场激烈的监护权争夺战。"
    },
    {
      "pos": "adjective",
      "explanation_en": "In physics, describing two or more particles whose states are so interconnected that the state of one instantly influences the state of the other, regardless of distance.",
      "explanation_cn": "在物理学中，描述两个或多个粒子的状态彼此高度关联，以至于其中一个粒子的状态会瞬间影响另一个粒子的状态，无论它们相距多远。",
      "example_en": "Quantum entanglement is a phenomenon that Einstein famously called 'spooky action at a distance.'",
      "example_cn": "量子纠缠是一种爱因斯坦曾称之为‘鬼魅般的超距作用’的现象。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tangled",
      "analysis": "“Tangled”（缠结的）更常用于描述物理上的杂乱纠缠，如头发、线缆等，语气较口语化，不强调复杂性或后果。而 “entangled” 不仅可用于物理缠绕，更常用于抽象情境（如法律、情感），暗示陷入困境且难以脱身，语义更重、更正式。"
    },
    {
      "word_to_compare": "involved",
      "analysis": "“Involved”（卷入的）泛指参与某事，可能是中性或自愿的，如“involved in a project”。而 “entangled” 暗示被动、非自愿地陷入复杂或麻烦的境地，带有负面或困扰的语义色彩。"
    },
    {
      "word_to_compare": "interwoven",
      "analysis": "“Interwoven”（交织的）强调两种或多种元素以和谐、有结构的方式融合在一起，常用于正面或中性语境，如文化、传统交织。而 “entangled” 强调混乱、束缚或难以解开的关联，常含负面或困扰的意味。"
    }
  ]
}