{
  "word": "epic",
  "pronunciation": "ep·ik",
  "concise_definition": "adj. 史诗的, 宏大的, 伟大的; n. 史诗",
  "forms": {
    "comparative": "epic",
    "superlative": "epic"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Of or relating to an epic, especially in style or scope; characterized by heroic deeds, grandeur, and a sense of awe-inspiring scale.",
      "explanation_cn": "与史诗相关的，尤其在风格或规模上；以英雄事迹、宏伟气魄和令人敬畏的规模为特征。",
      "example_en": "The film's epic battle scenes left the audience in stunned silence.",
      "example_cn": "这部电影中史诗般的战斗场景让观众屏息静默。"
    },
    {
      "pos": "adjective",
      "explanation_en": "So extraordinary or impressive in scale, duration, or intensity that it seems larger than life; used informally to describe something remarkable or monumental.",
      "explanation_cn": "在规模、持续时间或强度上如此非凡或令人印象深刻，以至于显得超乎寻常；非正式用法中形容某事物非凡或宏伟。",
      "example_en": "It was an epic fail when the entire presentation crashed during the live demo.",
      "example_cn": "在现场演示时整个演示崩溃了，这真是个史诗级的失败。"
    },
    {
      "pos": "noun",
      "explanation_en": "A long narrative poem, typically derived from ancient oral tradition, that recounts the deeds of legendary or historical heroes and often involves supernatural forces.",
      "explanation_cn": "一种源自古代口头传统的长篇叙事诗，讲述传奇或历史英雄的事迹，常涉及超自然力量。",
      "example_en": "The Iliad and the Odyssey are two of the most famous epics in Western literature.",
      "example_cn": "《伊利亚特》和《奥德赛》是西方文学中最著名的两部史诗。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "grand",
      "analysis": "“Grand”（宏伟的）强调规模、庄严或奢华，常用于描述建筑、仪式或风格上的壮丽，但不一定包含英雄主义或叙事性。而 “epic” 不仅指规模宏大，更蕴含英雄主义、历史深度和情感震撼，常带有叙事或文化传承的内涵。"
    },
    {
      "word_to_compare": "heroic",
      "analysis": "“Heroic”（英雄的）侧重于个人行为的勇气、牺牲或非凡成就，通常用于描述个体的壮举。而 “epic” 描述的是整体事件或作品的规模与气魄，可能包含多个英雄和复杂情节，是更宏观的叙事范畴。"
    },
    {
      "word_to_compare": "legendary",
      "analysis": "“Legendary”（传奇的）强调某事物因久远流传而具有神话色彩或极高声誉，常用于形容人物、事件或物品的名声。而 “epic” 更强调其形式（如史诗体裁）或体验的恢弘感，不一定需要流传已久，但必须具有史诗般的结构或气势。"
    }
  ]
}