{
  "word": "eroded",
  "pronunciation": "ih·roh·dud",
  "concise_definition": "v. 侵蚀, 逐渐削弱, 侵蚀",
  "forms": {
    "base_form": "erode",
    "third_person_singular": "erodes",
    "past_tense": "eroded",
    "past_participle": "eroded",
    "present_participle": "eroding"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To gradually wear away or remove material from a surface through natural forces such as wind, water, or ice, often leading to physical degradation of land or structures.",
      "explanation_cn": "指通过风、水、冰等自然力量逐渐磨损或剥离表面物质，常导致土地或结构的物理性退化。",
      "example_en": "The river has eroded the bank over decades, creating a deep canyon.",
      "example_cn": "数十年来，这条河不断侵蚀河岸，形成了一个深谷。"
    },
    {
      "pos": "verb",
      "explanation_en": "To gradually diminish or weaken something abstract, such as trust, power, or value, often through persistent negative influences.",
      "explanation_cn": "指通过持续的负面影响，逐渐削弱抽象事物，如信任、权力或价值。",
      "example_en": "Years of corruption have eroded public confidence in the government.",
      "example_cn": "多年的腐败已严重削弱了公众对政府的信任。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause the gradual loss or deterioration of a resource, boundary, or condition through continuous pressure or use.",
      "explanation_cn": "指因持续的压力或使用而导致资源、边界或状况的逐渐丧失或退化。",
      "example_en": "Constant noise from the construction site eroded her ability to concentrate.",
      "example_cn": "建筑工地持续的噪音削弱了她集中注意力的能力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "weather",
      "analysis": "“Weather” (风化/受风雨侵蚀) 通常指岩石或材料因长期暴露于自然环境中而发生的表面变化，包括风化、氧化、褪色等，范围更广，不一定涉及物质被带走。而 “erode” 更强调物质被水流、风力等力量搬运、剥离的过程，具有明显的移除性。"
    },
    {
      "word_to_compare": "deteriorate",
      "analysis": "“Deteriorate” (恶化) 是一个更广泛的词，泛指任何事物（健康、关系、设备等）质量或状态的下降，不特指物理磨损。而 “erode” 通常隐含一种渐进、持续的物理或抽象性损耗，常带有“被逐步蚕食”的意象。"
    },
    {
      "word_to_compare": "wear",
      "analysis": "“Wear” (磨损) 常用于描述因摩擦或使用导致的表面损耗，如鞋子磨损、机器零件磨损，多为人为或机械作用。而 “erode” 更常用于自然力作用，如海岸侵蚀、山体侵蚀，强调环境力量的长期作用。"
    }
  ]
}