{
  "word": "escalation",
  "pronunciation": "es·kuh·lay·shun",
  "concise_definition": "n. 升级, 激化, 逐步加剧",
  "forms": {
    "plural": "escalations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of increasing in intensity, scope, or seriousness, especially in conflict, dispute, or demand, often leading to more severe consequences.",
      "explanation_cn": "指冲突、争端或要求的强度、范围或严重性逐步增加的过程，通常会导致更严重的后果。",
      "example_en": "The escalation of violence in the region has prompted international intervention.",
      "example_cn": "该地区暴力事件的升级已促使国际社会进行干预。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of raising something to a higher level, such as a price, a complaint, or a responsibility, often through formal channels.",
      "explanation_cn": "指通过正式渠道将某事物（如价格、投诉或责任）提升到更高层级的行为。",
      "example_en": "She filed a formal complaint and requested escalation to the manager.",
      "example_cn": "她提交了正式投诉，并要求将问题升级至经理层面。"
    },
    {
      "pos": "noun",
      "explanation_en": "In military or strategic contexts, the deliberate intensification of actions or resources to gain advantage or force a resolution.",
      "explanation_cn": "在军事或战略语境中，指有意识地加强行动或资源投入，以获取优势或迫使问题解决。",
      "example_en": "The escalation of troop deployments signaled a shift from diplomacy to deterrence.",
      "example_cn": "军队部署的升级标志着从外交手段转向威慑策略。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "intensification",
      "analysis": "“Intensification”（强化）泛指任何事物在程度、力度或密度上的增强，适用范围广泛，包括情绪、光线、声音等。而 “escalation” 更特指在冲突、争端或层级系统中逐步升级，带有动态推进和后果累积的含义，常含负面或对抗性语境。"
    },
    {
      "word_to_compare": "increase",
      "analysis": "“Increase”（增加）是一个中性词，仅表示数量、规模或程度的上升，不隐含过程性或结构性变化。而 “escalation” 强调的是一种逐步、持续且往往不可逆的升级过程，常伴随质变或系统性反应，如冲突升级或投诉升级。"
    },
    {
      "word_to_compare": "exacerbation",
      "analysis": "“Exacerbation”（恶化）特指使已存在的负面状况变得更糟，多用于疾病、问题或情绪的加重，强调结果的负面性。而 “escalation” 更中性，可指任何层级或强度的提升，不一定源于原有问题，也可能是策略性推进，如商业谈判中的条件升级。"
    }
  ]
}