{
  "word": "escalated",
  "pronunciation": "es·kuh·leyt·id",
  "concise_definition": "v. 升级, 激化, 加剧",
  "forms": {
    "base_form": "escalate",
    "third_person_singular": "escalates",
    "past_tense": "escalated",
    "past_participle": "escalated",
    "present_participle": "escalating"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To increase in intensity, seriousness, or scale, especially in a conflict, dispute, or situation that was previously manageable or mild.",
      "explanation_cn": "指冲突、争端或情况的强度、严重性或规模升级，通常是从原本可控制或轻微的状态变得更为激烈或复杂。",
      "example_en": "The argument between the two departments escalated into a full-blown office feud.",
      "example_cn": "两个部门之间的争论升级为一场全面的办公室内斗。"
    },
    {
      "pos": "verb",
      "explanation_en": "To raise an issue or complaint to a higher level of authority or responsibility, often to seek resolution when lower-level efforts have failed.",
      "explanation_cn": "指将问题或投诉提交给更高层级的负责人或权威机构处理，通常是在低层级的解决尝试失败后采取的措施。",
      "example_en": "After the customer service rep couldn't resolve the issue, she escalated the complaint to the manager.",
      "example_cn": "在客服代表无法解决问题后，她将投诉升级给了经理。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to become more extreme or intense, often unintentionally, through actions or reactions.",
      "explanation_cn": "指通过行动或反应无意中使某事变得更极端或更激烈，常用于描述连锁反应或情绪升级。",
      "example_en": "His aggressive tone escalated the tension in the room.",
      "example_cn": "他咄咄逼人的语气加剧了房间里的紧张气氛。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "intensify",
      "analysis": "“Intensify” (加强/加剧) 强调某种情绪、力量或状态的增强，通常用于描述程度的加深，如疼痛、压力或色彩。它更侧重于内在强度的提升，而 “escalated” 更常用于描述事件、冲突或程序层级的升级，具有更明确的阶段性或结构性变化。"
    },
    {
      "word_to_compare": "exacerbate",
      "analysis": "“Exacerbate” (使恶化) 专指使已存在的负面状况变得更糟，常用于疾病、问题或矛盾，带有明显的负面评价。而 “escalated” 可用于中性或积极语境（如升级到更高管理层），不一定隐含恶化，仅表示层级或规模的提升。"
    },
    {
      "word_to_compare": "upgrade",
      "analysis": "“Upgrade” (升级) 通常指系统、设备或服务的改进或提升，常为正面或中性，如软件升级、座位升级。它强调功能或质量的提升，而 “escalated” 更强调冲突、紧张或责任层级的上升，常伴随风险或复杂性增加。"
    }
  ]
}