{
  "word": "escapes",
  "pronunciation": "ih·skeyps",
  "concise_definition": "v. 逃脱, 逃避; n. 逃脱, 逃避行为",
  "forms": {
    "base_form": "escape",
    "third_person_singular": "escapes",
    "past_tense": "escaped",
    "past_participle": "escaped",
    "present_participle": "escaping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To break free from confinement, control, or danger, often by cleverness or speed; to avoid being caught or held.",
      "explanation_cn": "通过机智或速度从拘禁、控制或危险中挣脱出来；避免被抓住或拘押。",
      "example_en": "The prisoner escaped from jail last night by climbing over the wall.",
      "example_cn": "昨晚，囚犯翻墙逃出了监狱。"
    },
    {
      "pos": "verb",
      "explanation_en": "To avoid or evade something unpleasant, such as responsibility, emotion, or reality, often unconsciously.",
      "explanation_cn": "有意识或无意识地回避不愉快的事物，如责任、情绪或现实。",
      "example_en": "She escapes into novels whenever she feels overwhelmed by work.",
      "example_cn": "每当她感到工作压力过大时，就会通过阅读小说来逃避现实。"
    },
    {
      "pos": "verb",
      "explanation_en": "To leak out or be released unintentionally, especially gases, liquids, or information.",
      "explanation_cn": "指气体、液体或信息等意外泄漏或释放。",
      "example_en": "A small amount of gas escaped from the faulty valve.",
      "example_cn": "少量气体从故障的阀门中泄漏了出来。"
    },
    {
      "pos": "noun",
      "explanation_en": "An act or instance of escaping, especially from a difficult, unpleasant, or restrictive situation.",
      "explanation_cn": "指从困难、不愉快或受限制的情境中逃脱的行为或事例。",
      "example_en": "His weekend hiking trips are his favorite escapes from city life.",
      "example_cn": "他的周末徒步旅行是他最喜爱的逃离城市生活的方式。"
    },
    {
      "pos": "noun",
      "explanation_en": "A means of diversion or relief from routine or stress, such as a hobby, activity, or fantasy.",
      "explanation_cn": "指一种摆脱日常琐事或压力的消遣方式或解脱途径，如爱好、活动或幻想。",
      "example_en": "For her, painting is a peaceful escape from the chaos of daily life.",
      "example_cn": "对她来说，绘画是逃离日常生活混乱的一片宁静天地。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "flee",
      "analysis": "“Flee” (逃离) 强调因恐惧或危险而仓促、急迫地逃跑，通常带有强烈的被动性和紧迫感，多用于生命威胁的语境。而 “escape” 更广泛，可包含主动策划、技巧性脱身，不一定伴随恐惧。"
    },
    {
      "word_to_compare": "avoid",
      "analysis": "“Avoid” (避免) 指有意识地避开某事，通常不涉及物理上的脱离，而是行为或态度上的回避，如避免冲突或责任。而 “escape” 更强调实际脱离某种束缚或状态，常涉及空间或物理层面的突破。"
    },
    {
      "word_to_compare": "leak",
      "analysis": "“Leak” (泄漏) 专指液体、气体或信息的意外或非自愿外泄，强调被动性和非意图性。而 “escape” 作为动词时虽可指泄漏，但更常用于主体主动挣脱的情境；作为名词时，“escape” 指的是整个逃脱事件，而 “leak” 仅指泄漏的内容本身。"
    }
  ]
}