{
  "word": "escalating",
  "pronunciation": "es·kuh·lay·ting",
  "concise_definition": "adj. 不断升级的, 激烈加剧的; v. (escalate 的现在分词) 加剧, 升级",
  "forms": {
    "base_form": "escalate",
    "third_person_singular": "escalates",
    "past_tense": "escalated",
    "past_participle": "escalated",
    "present_participle": "escalating"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing a situation, conflict, or process that is becoming increasingly intense, serious, or extreme over time.",
      "explanation_cn": "形容一种随着时间推移而变得越来越激烈、严重或极端的情况、冲突或过程。",
      "example_en": "The escalating tensions between the two nations have raised fears of war.",
      "example_cn": "两国之间不断升级的紧张局势引发了对战争的担忧。"
    },
    {
      "pos": "verb",
      "explanation_en": "To increase the intensity, seriousness, or scope of something, especially a conflict, problem, or dispute, often unintentionally or as a result of reactive actions.",
      "explanation_cn": "指使某事物（尤其是冲突、问题或争端）的强度、严重性或范围加剧，通常是非故意的，或由应对性行为引发。",
      "example_en": "His harsh response only escalated the argument into a full-blown fight.",
      "example_cn": "他严厉的回应反而将争论升级为一场全面的争吵。"
    },
    {
      "pos": "verb",
      "explanation_en": "To raise something to a higher level, especially in a hierarchical or procedural context (e.g., escalating a complaint to a manager).",
      "explanation_cn": "指将某事物提升到更高层级，尤其在等级或程序语境中（例如，将投诉升级上报给经理）。",
      "example_en": "If the issue isn't resolved, you can escalate it to the customer service supervisor.",
      "example_cn": "如果问题未得到解决，你可以将其升级上报给客户服务主管。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "intensifying",
      "analysis": "“Intensifying”（加强）强调某种情绪、力量或程度的增强，常用于描述感受、光线、声音等，偏重于内在强度的提升。而 “escalating” 更常用于描述事件、冲突或系统性问题的逐步升级，具有动态的、阶段性的特征，常涉及外部互动或层级推进。"
    },
    {
      "word_to_compare": "exacerbating",
      "analysis": "“Exacerbating”（恶化）特指使已存在的负面状况变得更糟，带有明显的负面评价色彩，常用于疾病、问题或矛盾。而 “escalating” 是中性词，可描述中性或正面的升级（如技术升级），不一定意味着恶化，但常用于负面语境。"
    },
    {
      "word_to_compare": "increasing",
      "analysis": "“Increasing”（增加）是最通用的词，仅表示数量、规模或程度的上升，不隐含过程的复杂性或连锁反应。而 “escalating” 暗示一种加速、连锁或不可控的升级趋势，常用于描述动态系统中的恶性循环或连锁反应。"
    }
  ]
}