{
  "word": "escorts",
  "pronunciation": "ih·skorts",
  "concise_definition": "n. 护卫, 陪同者; v. 护送, 陪同",
  "forms": {
    "singular": "escort",
    "third_person_singular": "escorts",
    "past_tense": "escorted",
    "past_participle": "escorted",
    "present_participle": "escorting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who accompanies another person, especially for protection, guidance, or social courtesy, often in a formal or official context.",
      "explanation_cn": "指陪同他人的人，尤其出于保护、引导或社交礼仪的目的，常用于正式或官方场合。",
      "example_en": "The diplomat was escorted by security personnel to the airport.",
      "example_cn": "这位外交官由安保人员护送至机场。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person, typically a woman, who is paid to accompany others socially or sexually, often in a commercial or illicit context.",
      "explanation_cn": "指以陪伴他人社交或发生性关系为职业的人（通常为女性），常带有商业或非法性质。",
      "example_en": "The tabloid reported on a celebrity seen with a high-profile escort.",
      "example_cn": "小报报道了一位名人与一名知名陪侍者一同出现的消息。"
    },
    {
      "pos": "verb",
      "explanation_en": "To accompany someone, especially to ensure their safety or to provide formal guidance during movement from one place to another.",
      "explanation_cn": "指陪同某人，尤其是为了确保其安全，或在移动过程中提供正式引导。",
      "example_en": "The police escorted the protest leaders to the city hall.",
      "example_cn": "警察护送抗议领袖前往市政厅。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provide companionship to someone, especially in a paid or professional capacity, often implying a social or romantic context.",
      "explanation_cn": "指以有偿或专业方式陪伴他人，常暗示社交或浪漫情境。",
      "example_en": "She works as an escort for wealthy clients who need company at events.",
      "example_cn": "她为需要在活动中有人陪伴的富裕客户担任陪侍。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "guard",
      "analysis": "“Guard”（守卫）强调保护和防御功能，通常指为防止危险或入侵而进行的警戒行为，具有强制性和军事/安全性质。而 “escort” 更侧重于陪同和引导，保护可能是其一部分，但并非唯一目的，且常带有礼仪性或服务性。"
    },
    {
      "word_to_compare": "companion",
      "analysis": "“Companion”（同伴）是一个中性词，泛指与人同行或共处的人，不涉及职业、报酬或权力关系。而 “escort” 可以是自愿的同伴，但更常指有明确角色（如保护、服务、商业）的陪同者，有时带有社会或法律上的特殊含义。"
    },
    {
      "word_to_compare": "chaperone",
      "analysis": "“Chaperone”（监护人）特指在社交场合中监督他人（尤其是年轻人或异性）行为、确保其符合道德规范的人，常用于传统或保守语境。而 “escort” 更中性或现代，不一定带有道德监督意图，甚至可能隐含亲密或商业关系。"
    }
  ]
}