{
  "word": "escort",
  "pronunciation": "ih·skort",
  "concise_definition": "n. 护送者, 陪同者; v. 护送, 陪同",
  "forms": {
    "third_person_singular": "escorts",
    "past_tense": "escorted",
    "past_participle": "escorted",
    "present_participle": "escorting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who accompanies another person, especially for protection, guidance, or social courtesy, often in a formal or official context.",
      "explanation_cn": "指陪同他人的人，尤其出于保护、引导或社交礼仪的目的，常用于正式或官方场合。",
      "example_en": "The celebrity was surrounded by bodyguards acting as her personal escort.",
      "example_cn": "这位名人身边围绕着保镖，担任她的私人护送者。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person assigned to accompany someone in a ceremonial or public role, such as a military escort or a diplomatic escort.",
      "explanation_cn": "指被指派在仪式性或公共场合陪同他人的人，如军方护送队或外交陪同人员。",
      "example_en": "The visiting dignitary was greeted by a military escort of honor.",
      "example_cn": "来访的贵宾受到一支荣誉军方护送队的迎接。"
    },
    {
      "pos": "verb",
      "explanation_en": "To accompany someone safely from one place to another, especially to ensure their security or to fulfill a formal obligation.",
      "explanation_cn": "指安全地陪同某人从一个地方到另一个地方，尤其为了保障其安全或履行正式义务。",
      "example_en": "The police escorted the witness to the courthouse under heavy guard.",
      "example_cn": "警察在严密戒备下护送证人前往法院。"
    },
    {
      "pos": "verb",
      "explanation_en": "To accompany someone in a social or ceremonial context, often to show respect or provide companionship.",
      "explanation_cn": "指在社交或仪式性场合陪同某人，通常表示尊重或提供陪伴。",
      "example_en": "He escorted his date to the gala dinner and introduced her to the guests.",
      "example_cn": "他陪同他的约会对象出席晚宴，并向宾客介绍了她。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "accompany",
      "analysis": "“Accompany”（陪伴）是一个更广泛、中性的词，泛指与某人同行，不强调目的或职责，可以是朋友同行、音乐伴奏等。而 “escort” 隐含了保护、引导或礼仪性的责任，通常带有正式或权威色彩。"
    },
    {
      "word_to_compare": "chaperone",
      "analysis": "“Chaperone”（监护人/陪同者）特指为监督或保护（尤其年轻或未婚者）而陪同，常带有道德或社会规范的意味，如父母陪同子女参加舞会。而 “escort” 更中性，可适用于任何性别和场合，不一定含监督意图。"
    },
    {
      "word_to_compare": "guide",
      "analysis": "“Guide”（向导）侧重于提供方向、信息或知识，帮助他人了解环境或完成任务，如旅游向导。而 “escort” 的核心是物理上的伴随与安全，不一定提供信息，重点在于‘护送’而非‘教导’。"
    }
  ]
}