{
  "word": "esquire",
  "pronunciation": "uh·skwaihr",
  "concise_definition": "n. 男爵, 乡绅, (英国) 律师的尊称, (美国) 用于姓名后的尊称",
  "forms": {
    "plural": "esquires"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A historical title of nobility in England, originally denoting a man of high social rank below a knight but above a gentleman; now largely archaic except in ceremonial or literary contexts.",
      "explanation_cn": "英国历史上的一种贵族头衔，原指地位低于骑士但高于乡绅的绅士阶层；如今已基本过时，仅用于仪式性或文学语境中。",
      "example_en": "In medieval times, an esquire served as a knight's attendant and was often the heir to a landed estate.",
      "example_cn": "在中世纪，男爵担任骑士的侍从，通常是土地贵族的继承人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A formal title used in Britain to denote a solicitor (a type of lawyer), especially in legal documents or formal correspondence.",
      "explanation_cn": "在英国，用于正式场合指代事务律师（一种律师），尤其见于法律文件或正式通信中。",
      "example_en": "Mr. James Wilson, Esquire, has been appointed as the lead solicitor for the case.",
      "example_cn": "詹姆斯·威尔逊先生，事务律师，已被任命为本案的主理律师。"
    },
    {
      "pos": "noun",
      "explanation_en": "In the United States, a courtesy title appended after a man's name in formal writing, especially in legal or official contexts, though its use is now rare and often considered outdated.",
      "explanation_cn": "在美国，用于正式书面语中置于男性姓名之后的礼节性尊称，尤其见于法律或官方场合，但如今使用已极为罕见，常被视为过时。",
      "example_en": "The invitation was addressed to 'Robert Chen, Esq.'",
      "example_cn": "请柬上写的是‘罗伯特·陈，先生’。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sir",
      "analysis": "“Sir” 是对男性（尤其是有头衔或地位者）的普遍尊称，语气更通用、更口语化，适用于骑士、军官、教师等。而 “esquire” 是特定历史或法律语境下的正式头衔，不用于日常称呼，且仅限于书面形式。"
    },
    {
      "word_to_compare": "mister",
      "analysis": "“Mister” (Mr.) 是现代英语中最常见的男性尊称，用于所有成年男性，无社会等级含义。而 “esquire” 带有历史等级或专业身份的暗示，仅用于特定正式场合，使用范围远窄于 “mister”。"
    },
    {
      "word_to_compare": "gentleman",
      "analysis": "“Gentleman” 指有教养、有礼貌的男子，强调行为举止，是社会文化概念；而 “esquire” 是一个法律或贵族头衔，强调身份地位。虽然历史上 “esquire” 曾属于 “gentleman” 阶层，但现代用法中两者已无重叠。"
    }
  ]
}