{
  "word": "ether",
  "pronunciation": "ee·thuhr",
  "concise_definition": "n. 以太, 天空, 无线电信号传输介质",
  "forms": {
    "plural": "ethers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "In ancient and medieval science, a hypothetical invisible substance thought to fill the upper regions of space and serve as the medium for the propagation of light and electromagnetic waves.",
      "explanation_cn": "在古代和中世纪科学中，一种假设的、不可见的物质，被认为充满太空的上层区域，是光和电磁波传播的介质。",
      "example_en": "Scientists once believed that light traveled through the ether, much like sound travels through air.",
      "example_cn": "科学家曾相信光像声音通过空气一样，通过以太传播。"
    },
    {
      "pos": "noun",
      "explanation_en": "A colorless, volatile, highly flammable liquid (C2H5OC2H5) used historically as an anesthetic and now primarily as a solvent in laboratories.",
      "explanation_cn": "一种无色、易挥发、高度易燃的液体（化学式 C2H5OC2H5），历史上曾用作麻醉剂，现主要用作实验室溶剂。",
      "example_en": "The surgeon administered ether to the patient before the operation.",
      "example_cn": "外科医生在手术前给病人施用了乙醚。"
    },
    {
      "pos": "noun",
      "explanation_en": "Figuratively, the medium through which radio, television, or other signals are transmitted; the airwaves.",
      "explanation_cn": "比喻意义上，指无线电、电视或其他信号传输的媒介；即‘电波’或‘空中通道’。",
      "example_en": "The broadcast was picked up by millions of listeners across the ether.",
      "example_cn": "数百万听众通过电波收听了这次广播。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "aether",
      "analysis": "“Aether” 是 “ether” 的古希腊语拼写形式，常用于古典文献或哲学语境中，强调其宇宙学和神秘主义含义。现代科学和日常用语中普遍使用 “ether”，而 “aether” 多用于文学或历史语境中，以唤起古典意象。"
    },
    {
      "word_to_compare": "vacuum",
      "analysis": "“Vacuum” (真空) 指完全没有物质的空间，与 “ether” 的假设性介质概念完全相反。现代物理学已摒弃以太理论，认为电磁波可在真空中传播，因此 “vacuum” 是科学上对空间本质的正确描述，而 “ether” 是已被证伪的旧理论概念。"
    },
    {
      "word_to_compare": "radio waves",
      "analysis": "“Radio waves” (无线电波) 是一种具体的电磁波形式，是实际存在的物理现象；而 “ether” 是过去用来解释这类波如何传播的理论媒介。前者是实体，后者是抽象假设。现代语境中，人们说 ‘broadcast over the airwaves’，而非 ‘through the ether’，尽管后者仍具诗意或隐喻价值。"
    }
  ]
}