{
  "word": "evangelical",
  "pronunciation": "ee·vanj·uh·lik",
  "concise_definition": "adj. 福音派的, 传福音的; n. 福音派信徒",
  "forms": {
    "comparative": "more evangelical",
    "superlative": "most evangelical"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characterized by the belief in the necessity of personal conversion, the authority of the Bible, and active sharing of the Christian gospel, especially within Protestant Christianity.",
      "explanation_cn": "指与个人悔改归信的必要性、圣经权威以及积极传播基督教福音相关的信仰或特征，尤指新教基督教中的传统。",
      "example_en": "Evangelical churches often emphasize personal testimony and Bible study in their services.",
      "example_cn": "福音派教会通常在礼拜中强调个人见证和圣经研读。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Having or showing great enthusiasm or zeal for promoting a cause or belief, often with a sense of moral urgency.",
      "explanation_cn": "对推广某种事业或信念表现出极大的热情或热忱，常带有道德紧迫感。",
      "example_en": "She was an evangelical advocate for environmental reform, speaking at rallies across the country.",
      "example_cn": "她是一位充满热忱的环保改革倡导者，在全国各地的集会上发表演讲。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who adheres to evangelical beliefs, especially within Protestant Christianity, and actively promotes the gospel.",
      "explanation_cn": "指信奉福音派信仰、尤其在新教基督教中并积极传播福音的人。",
      "example_en": "Many evangelicals in the United States are politically active on issues like abortion and religious freedom.",
      "example_cn": "美国许多福音派信徒在堕胎和宗教自由等问题上积极参与政治。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fundamentalist",
      "analysis": "“Fundamentalist”（原教旨主义者）强调对宗教教义字面意义的绝对坚持，常带有保守、抵制现代性的倾向，有时带有负面含义；而 “evangelical” 更侧重于传播福音和强调个人信仰体验，虽有重叠，但并非所有福音派信徒都是原教旨主义者。"
    },
    {
      "word_to_compare": "missionary",
      "analysis": "“Missionary”（传教士）特指被派往外地或异国传播宗教的人，是一个职业或角色身份；而 “evangelical” 是一种信仰立场或神学取向，可以是任何信徒，不一定从事海外传教工作。"
    },
    {
      "word_to_compare": "zealous",
      "analysis": "“Zealous”（热忱的）是泛指对任何事业或信念充满热情，不局限于宗教语境；而 “evangelical” 在形容人时，特指以传播基督教福音为使命的热忱，具有明确的神学内涵，语义更具体。"
    }
  ]
}