{
  "word": "evil",
  "pronunciation": "ee·vuhl",
  "concise_definition": "n. 邪恶, 罪恶; adj. 邪恶的, 有害的",
  "forms": {
    "comparative": "more evil",
    "superlative": "most evil"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Moral wrongness or wickedness; the quality or state of being morally corrupt, harmful, or destructive, often associated with deliberate intent to cause suffering or violate ethical principles.",
      "explanation_cn": "指道德上的邪恶或罪恶，即具有道德败坏、有害或破坏性的特质，通常与故意造成痛苦或违背伦理原则的意图相关。",
      "example_en": "The novel explores the nature of evil and how it can take root in ordinary people.",
      "example_cn": "这部小说探讨了邪恶的本质，以及它如何在普通人身上生根发芽。"
    },
    {
      "pos": "noun",
      "explanation_en": "A source or cause of great harm, suffering, or misfortune; often used to refer to abstract or systemic forces that bring about destruction.",
      "explanation_cn": "指造成巨大伤害、痛苦或不幸的根源或原因，常用于指代带来毁灭的抽象或系统性力量。",
      "example_en": "Poverty and ignorance are often seen as the greatest evils in society.",
      "example_cn": "贫困和无知常被视为社会最大的祸害。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Morally wrong or wicked; characterized by malice, cruelty, or a deliberate intention to cause harm.",
      "explanation_cn": "道德上错误或邪恶的；以恶意、残忍或故意造成伤害为特征。",
      "example_en": "He was accused of committing an evil act that shocked the entire community.",
      "example_cn": "他被指控犯下了一件震惊整个社区的恶行。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Causing or intended to cause harm, suffering, or damage; not merely bad, but actively destructive or malevolent.",
      "explanation_cn": "造成或意图造成伤害、痛苦或破坏的；不仅仅是‘坏’，而是具有主动的破坏性或恶意。",
      "example_en": "The evil spell cast by the witch turned the prince into a frog.",
      "example_cn": "女巫施下的邪恶咒语把王子变成了一只青蛙。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "wicked",
      "analysis": "“Wicked” (邪恶的) 通常带有更强烈的道德谴责意味，常用于描述故意违反道德或法律的行为，有时也用于口语中表示‘淘气’或‘调皮’，语义较轻。而 “evil” 更强调本质上的道德败坏和破坏性，语义更重、更严肃，常用于宗教、哲学或文学语境中。"
    },
    {
      "word_to_compare": "bad",
      "analysis": "“Bad” (坏的) 是最通用的词，可指质量差、不道德、令人不快等，语义范围广泛但程度较轻。而 “evil” 专指道德层面的极端邪恶，具有强烈的负面价值判断，通常涉及恶意和伤害意图，比 “bad” 更深刻、更严重。"
    },
    {
      "word_to_compare": "malevolent",
      "analysis": "“Malevolent” (怀有恶意的) 强调一种有意识的、持续的伤害意图，常用于描述人的动机或心态，偏重心理层面。而 “evil” 不仅包含恶意，还涵盖行为、本质、结果等多维度的道德堕落，范围更广，更具整体性和终极性。"
    }
  ]
}