{
  "word": "exchange",
  "pronunciation": "ik·schej",
  "concise_definition": "n. 交换, 互换; v. 交换, 互换, 交易",
  "forms": {
    "third_person_singular": "exchanges",
    "past_tense": "exchanged",
    "past_participle": "exchanged",
    "present_participle": "exchanging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of giving one thing and receiving another in return, often of similar value or type, such as goods, services, ideas, or information.",
      "explanation_cn": "指给予某物并同时获得另一物作为回报的行为，通常涉及价值或类型相似的物品、服务、想法或信息。",
      "example_en": "The exchange of gifts is a traditional part of holiday celebrations.",
      "example_cn": "互赠礼物是节日庆祝的传统组成部分。"
    },
    {
      "pos": "noun",
      "explanation_en": "A place or system where goods, services, or financial instruments are bought and sold, such as a stock exchange or currency exchange.",
      "explanation_cn": "指商品、服务或金融工具进行买卖的场所或系统，如证券交易所或货币兑换处。",
      "example_en": "The New York Stock Exchange is one of the largest financial markets in the world.",
      "example_cn": "纽约证券交易所是全球最大的金融市场之一。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give something to someone and receive something else in return, often as a mutual or reciprocal action.",
      "explanation_cn": "指给予某人某物，并从对方那里获得另一物作为回报，通常是一种相互或对等的行为。",
      "example_en": "They exchanged phone numbers after the meeting.",
      "example_cn": "会议结束后，他们交换了电话号码。"
    },
    {
      "pos": "verb",
      "explanation_en": "To replace one thing with another, especially in a context of substitution or trade.",
      "explanation_cn": "指用一物替换另一物，尤其在替代或交易的语境中。",
      "example_en": "She exchanged her old car for a newer model.",
      "example_cn": "她把旧车换成了新款。"
    },
    {
      "pos": "verb",
      "explanation_en": "To communicate or share ideas, opinions, or information with others through dialogue or interaction.",
      "explanation_cn": "指通过对话或互动与他人交流、分享想法、意见或信息。",
      "example_en": "The students exchanged views on climate change during the seminar.",
      "example_cn": "学生们在研讨会上就气候变化交换了看法。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "trade",
      "analysis": "“Trade” (交易) 更侧重于商业或经济活动中商品或服务的买卖，常涉及货币和市场机制，语义范围较窄，多用于经济语境。而 “exchange” 更广泛，可涵盖非经济性的互换，如信息、情感或物品的互换，且不一定涉及金钱。"
    },
    {
      "word_to_compare": "swap",
      "analysis": "“Swap” (交换) 是 “exchange” 的非正式同义词，常用于口语，强调直接、一对一的物品互换，通常不涉及复杂系统或中介。而 “exchange” 更正式，可用于抽象概念（如思想、文化）和制度性场景（如交易所）。"
    },
    {
      "word_to_compare": "interchange",
      "analysis": "“Interchange” (互换) 与 “exchange” 非常接近，但更强调双向性、对等性和可替换性，常用于技术或语言语境，如词语的互换使用。它比 “exchange” 更强调“可互换性”而非“交易行为”，且较少用于金融或制度性场所。"
    }
  ]
}