{
  "word": "excise",
  "pronunciation": "ek·sīs",
  "concise_definition": "v. 削除, 删去; n. 消费税",
  "forms": {
    "third_person_singular": "excises",
    "past_tense": "excised",
    "past_participle": "excised",
    "present_participle": "excising"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To remove or cut out something, especially something considered undesirable, harmful, or unnecessary, often by deliberate and forceful action.",
      "explanation_cn": "指有意识地、果断地将某物（尤指被认为不良、有害或不必要的部分）切除或删除。",
      "example_en": "The editor excised several controversial paragraphs from the article before publication.",
      "example_cn": "编辑在发表前删去了文章中几段有争议的段落。"
    },
    {
      "pos": "verb",
      "explanation_en": "To impose or collect an excise tax on goods, especially domestically produced items such as alcohol, tobacco, or fuel.",
      "explanation_cn": "指对特定商品（如酒精、烟草或燃料）征收消费税。",
      "example_en": "The government plans to excise higher taxes on sugary drinks to combat obesity.",
      "example_cn": "政府计划对含糖饮料征收更高的消费税，以应对肥胖问题。"
    },
    {
      "pos": "noun",
      "explanation_en": "A tax levied on the production, sale, or consumption of specific goods within a country, typically on items like alcohol, tobacco, gasoline, or gambling.",
      "explanation_cn": "指对国内生产、销售或消费的特定商品所征收的税，通常针对酒精、烟草、汽油或赌博等商品。",
      "example_en": "The excise on cigarettes has increased by 15% this year.",
      "example_cn": "今年香烟的消费税提高了15%。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "delete",
      "analysis": "“Delete” (删除) 是一个通用词，常用于数字或文字内容的移除，语气中性，不强调动机或后果。而 “excise” 更具正式性和目的性，常暗示被移除的部分是不受欢迎或有害的，带有裁剪、净化的意味，多用于书面语或政策语境。"
    },
    {
      "word_to_compare": "tax",
      "analysis": "“Tax” (税收) 是总称，涵盖所有类型的政府征税，如所得税、增值税等。而 “excise” 是一种特定类型的税，专指对特定商品在生产或销售环节征收的间接税，范围更窄、更专业。"
    },
    {
      "word_to_compare": "remove",
      "analysis": "“Remove” (移除) 是最宽泛的动词，可指物理或抽象的移除，无情感或意图色彩。而 “excise” 隐含一种主动的、有选择性的切除行为，常用于医学、编辑或财政语境，带有更强的规范性和技术性。"
    }
  ]
}