{
  "word": "excuse",
  "pronunciation": "ik·skyoos",
  "concise_definition": "n. 借口, 理由; v. 原谅, 宽恕, 为...辩解",
  "forms": {
    "plural": "excuses",
    "third_person_singular": "excuses",
    "past_tense": "excused",
    "past_participle": "excused",
    "present_participle": "excusing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A reason given to justify or explain a mistake, failure, or inappropriate behavior, often with the implication that the reason is weak or insincere.",
      "explanation_cn": "为错误、失败或不当行为所给出的理由，通常暗示该理由薄弱或不真诚，带有辩解或推卸责任的意味。",
      "example_en": "He offered a lame excuse for being late — his alarm didn't go off.",
      "example_cn": "他为迟到找了个蹩脚的借口——闹钟没响。"
    },
    {
      "pos": "noun",
      "explanation_en": "A formal permission to be absent or to be exempt from a duty or obligation.",
      "explanation_cn": "正式允许缺席或免除某项责任或义务的许可。",
      "example_en": "She submitted a doctor's note as an excuse for missing the meeting.",
      "example_cn": "她提交了一张医生证明，作为缺席会议的正当理由。"
    },
    {
      "pos": "verb",
      "explanation_en": "To forgive or pardon someone for a mistake or offense, often by accepting their explanation.",
      "explanation_cn": "因接受某人的解释而原谅其错误或过失。",
      "example_en": "I excuse you for being late today — the traffic was terrible.",
      "example_cn": "我原谅你今天迟到了——交通太糟糕了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To allow someone to avoid a responsibility or obligation, often by granting permission or making an exception.",
      "explanation_cn": "通过给予许可或破例，允许某人免除某项责任或义务。",
      "example_en": "The teacher excused him from the homework because he was ill.",
      "example_cn": "老师因为他生病而免除了他的家庭作业。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "apology",
      "analysis": "“Apology” (道歉) 强调承认错误并表达悔意，是一种情感上的认错行为；而 “excuse” 更侧重于提供理由来减轻责任，不一定包含悔意，甚至可能带有推诿的意味。"
    },
    {
      "word_to_compare": "justification",
      "analysis": "“Justification” (正当化) 是一种更正式、更理性的解释，通常基于逻辑、规则或道德原则，旨在证明行为的合理性；而 “excuse” 常带有主观性、情绪性，甚至可能缺乏充分依据，常用于非正式语境。"
    },
    {
      "word_to_compare": "forgive",
      "analysis": "“Forgive” (宽恕) 是一种更深层的情感行为，意味着放下怨恨，恢复关系；而 “excuse” 仅表示接受理由、免除责任，不一定涉及情感上的原谅。一个人可以被原谅，但不被原谅的错误也可能被‘excused’。"
    }
  ]
}