{
  "word": "exec",
  "pronunciation": "ek·sik",
  "concise_definition": "n. 执行者, 高管; v. 执行, 处决",
  "forms": {
    "plural": "execs"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A shortened form of 'executive'; refers to a person in a high-level management position responsible for making strategic decisions and overseeing operations.",
      "explanation_cn": "‘executive’（高管）的缩写，指担任高级管理职位、负责制定战略决策并监督运营的人。",
      "example_en": "The execs approved the merger after months of negotiations.",
      "example_cn": "经过数月的谈判，高管们批准了这项合并。"
    },
    {
      "pos": "noun",
      "explanation_en": "In computing, a shorthand term for 'executable file' — a program or application that can be run directly by the operating system.",
      "explanation_cn": "在计算机领域，指‘可执行文件’的缩写，即可以直接由操作系统运行的程序或应用程序。",
      "example_en": "Make sure the .exe file is not corrupted before you run the exec.",
      "example_cn": "在运行可执行文件之前，请确保 .exe 文件没有损坏。"
    },
    {
      "pos": "verb",
      "explanation_en": "To carry out or put into effect a plan, order, or decision; to implement something formally.",
      "explanation_cn": "指执行、实施一项计划、命令或决定；正式地落实某事。",
      "example_en": "The court ordered that the sentence be executed immediately.",
      "example_cn": "法院下令立即执行判决。"
    },
    {
      "pos": "verb",
      "explanation_en": "To put someone to death, especially as a legal punishment; a formal and often public act of capital punishment.",
      "explanation_cn": "指依法处决某人，尤指作为法律惩罚的正式且通常是公开的死刑执行行为。",
      "example_en": "The convicted murderer was executed by lethal injection.",
      "example_cn": "这名被定罪的杀人犯被注射死刑。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "executive",
      "analysis": "‘Executive’ 是正式术语，指公司或组织中的高级管理人员，涵盖范围更广，包括职位、职责和权力；而 ‘exec’ 是其口语化或缩略形式，常用于非正式语境或行业内部交流，语义更简洁、更口语化。"
    },
    {
      "word_to_compare": "implement",
      "analysis": "‘Implement’（实施）强调将计划、政策或系统付诸实践的过程，通常用于抽象事务，如政策、制度；而 ‘exec’ 作为动词时，更常用于具体行动，尤其是带有强制性或终结性的行为，如执行命令或处决。"
    },
    {
      "word_to_compare": "carry out",
      "analysis": "‘Carry out’ 是一个通用短语动词，表示完成或执行某项任务，语气中性，适用于日常或正式语境；而 ‘exec’ 作为动词时，带有更强的正式性、权威性，甚至带有法律或暴力色彩，语义更集中于权威性执行或死刑。"
    }
  ]
}