{
  "word": "execution",
  "pronunciation": "ek·suh·kyoo·shuhn",
  "concise_definition": "n. 执行, 实施, 处决, 演奏",
  "forms": {
    "plural": "executions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of carrying out or putting into effect a plan, order, or task, especially in a systematic or decisive manner.",
      "explanation_cn": "指有系统或果断地实施、执行一项计划、命令或任务的行为。",
      "example_en": "The execution of the marketing strategy led to a 30% increase in sales.",
      "example_cn": "该营销策略的成功执行使销售额增长了30%。"
    },
    {
      "pos": "noun",
      "explanation_en": "The legal process of putting a convicted person to death as a punishment, typically by state authority.",
      "explanation_cn": "指国家依法对被定罪者执行死刑的法律程序。",
      "example_en": "The country abolished capital punishment, ending all executions.",
      "example_cn": "该国废除了死刑，终止了所有处决。"
    },
    {
      "pos": "noun",
      "explanation_en": "The performance or interpretation of a piece of music, drama, or other artistic work, reflecting skill and expression.",
      "explanation_cn": "指对音乐、戏剧或其他艺术作品的演奏或演绎，体现技巧与表现力。",
      "example_en": "Her execution of the piano sonata was both technically flawless and emotionally powerful.",
      "example_cn": "她对这首钢琴奏鸣曲的演奏在技术上无懈可击，情感上极具感染力。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process of completing a computational task or running a program in computing contexts.",
      "explanation_cn": "在计算语境中，指完成某项计算任务或运行程序的过程。",
      "example_en": "The program's execution failed due to a memory overflow error.",
      "example_cn": "由于内存溢出错误，该程序的执行失败了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "implementation",
      "analysis": "“Implementation” (实施) 更强调将计划、设计或政策转化为现实的具体步骤和操作过程，常用于管理、技术或政策领域，偏重系统性安排。而 “execution” 更侧重于行动的完成本身，强调效率、果断和结果导向，有时带有更强的即时性和决断性。"
    },
    {
      "word_to_compare": "performance",
      "analysis": "“Performance” (表演/表现) 通常用于艺术、体育或行为表现领域，强调外在展示的质量和观众的感知。虽然在音乐语境中可与 “execution” 互换，但 “performance” 更广义，包含情感、风格和互动；而 “execution” 更聚焦于技术层面的精准完成。"
    },
    {
      "word_to_compare": "carrying out",
      "analysis": "“Carrying out” 是一个口语化短语动词，含义与 “execution” 的第一义项接近，但语法上是动词短语，不具备名词的抽象性和正式性。在正式文本中，“execution” 更简洁、权威，常用于法律、军事或商业语境，而 “carrying out” 更日常、口语。"
    },
    {
      "word_to_compare": "death penalty",
      "analysis": "“Death penalty” (死刑) 是指一种刑罚制度或法律概念，而 “execution” 是该制度下的具体实施行为。前者是名词性制度，后者是动词性行为。例如：The death penalty is controversial; the execution was carried out at dawn. 二者不可互换。"
    }
  ]
}