{
  "word": "execute",
  "pronunciation": "ek·sik·yoo·t",
  "concise_definition": "v. 执行, 实施, 处决, 烹饪",
  "forms": {
    "third_person_singular": "executes",
    "past_tense": "executed",
    "past_participle": "executed",
    "present_participle": "executing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To carry out or perform a task, plan, order, or command fully and effectively, often with precision and authority.",
      "explanation_cn": "指完整而有效地实施、执行一项任务、计划、命令或指令，通常带有精确性和权威性。",
      "example_en": "The general ordered the troops to execute the surprise attack at dawn.",
      "example_cn": "将军命令部队在黎明时分执行突袭行动。"
    },
    {
      "pos": "verb",
      "explanation_en": "To put a person to death, especially as a legal punishment by the state.",
      "explanation_cn": "指依法对人执行死刑，通常由国家作为法律惩罚实施。",
      "example_en": "The convicted murderer was executed by lethal injection.",
      "example_cn": "这名被定罪的杀人犯被注射死刑。"
    },
    {
      "pos": "verb",
      "explanation_en": "To carry out a piece of computer code or a program so that it runs and produces results.",
      "explanation_cn": "指运行计算机代码或程序，使其执行并产生结果。",
      "example_en": "The script will execute automatically when the system boots up.",
      "example_cn": "当系统启动时，该脚本将自动执行。"
    },
    {
      "pos": "verb",
      "explanation_en": "To prepare and serve food, especially in a professional or artistic manner (used primarily in culinary contexts).",
      "explanation_cn": "指以专业或艺术化的方式准备和上菜（主要用于烹饪语境）。",
      "example_en": "The chef executed the dish with flawless technique and elegant presentation.",
      "example_cn": "主厨以无懈可击的技艺和优雅的摆盘完成了这道菜。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "perform",
      "analysis": "“Perform” (执行/表演) 强调完成某项动作或任务，常用于艺术表演、职责履行或技能展示，语气较中性或积极。而 “execute” 更强调精确性、权威性和结果导向，常用于命令、计划或技术操作，带有更强的强制性和完成感。"
    },
    {
      "word_to_compare": "implement",
      "analysis": "“Implement” (实施) 侧重于将计划、政策或系统付诸实践，强调从设计到落地的全过程，常用于管理或制度层面。而 “execute” 更关注于具体行动的完成，是实施过程中的最终操作步骤，更偏向于即时性和动作性。"
    },
    {
      "word_to_compare": "carry out",
      "analysis": "“Carry out” 是 “execute” 的口语化近义表达，两者在多数语境中可互换，但 “carry out” 更通用、更口语，适用于日常任务；而 “execute” 更正式、更精准，常用于军事、法律、技术等专业领域，语义更凝练有力。"
    }
  ]
}