{
  "word": "exercise",
  "pronunciation": "ek·suh·sahyz",
  "concise_definition": "n. 锻炼, 练习, 训练; v. 锻炼, 练习, 行使",
  "forms": {
    "third_person_singular": "exercises",
    "past_tense": "exercised",
    "past_participle": "exercised",
    "present_participle": "exercising"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Physical activity performed to improve or maintain health, fitness, or strength, often through structured routines such as running, lifting weights, or yoga.",
      "explanation_cn": "为改善或维持健康、体能或力量而进行的有组织的身体活动，如跑步、举重或瑜伽。",
      "example_en": "She does 30 minutes of exercise every morning to stay fit.",
      "example_cn": "她每天早上锻炼30分钟以保持健康。"
    },
    {
      "pos": "noun",
      "explanation_en": "A task or set of tasks designed to practice or reinforce a skill, often used in education, music, or language learning.",
      "explanation_cn": "为练习或巩固某项技能而设计的任务，常用于教育、音乐或语言学习中。",
      "example_en": "The students completed a grammar exercise before the test.",
      "example_cn": "学生们在考试前完成了一项语法练习。"
    },
    {
      "pos": "noun",
      "explanation_en": "The use or application of a right, power, or ability, often in a formal or official context.",
      "explanation_cn": "在正式或官方语境中对某项权利、权力或能力的行使或运用。",
      "example_en": "The president exercised his constitutional right to veto the bill.",
      "example_cn": "总统行使了他否决该法案的宪法权利。"
    },
    {
      "pos": "verb",
      "explanation_en": "To engage in physical activity to maintain or improve health and fitness.",
      "explanation_cn": "通过身体活动来维持或改善健康与体能。",
      "example_en": "He exercises regularly to reduce stress and improve his heart health.",
      "example_cn": "他定期锻炼以减轻压力并改善心脏健康。"
    },
    {
      "pos": "verb",
      "explanation_en": "To practice or repeatedly perform a skill to gain proficiency or mastery.",
      "explanation_cn": "通过反复练习以获得熟练或精通某项技能。",
      "example_en": "The pianist exercises her fingers with scales every day.",
      "example_cn": "这位钢琴家每天用音阶练习手指。"
    },
    {
      "pos": "verb",
      "explanation_en": "To put into effect or make use of a right, power, or influence.",
      "explanation_cn": "实施或运用某项权利、权力或影响力。",
      "example_en": "The manager exercised his authority to reassign the team.",
      "example_cn": "经理行使了他的权力重新分配了团队。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "workout",
      "analysis": "“Workout” (锻炼) 是 “exercise” 的一个具体子集，通常指一次有计划的、高强度的健身活动，如健身房训练或团体课程。它更强调形式和时间长度，而 “exercise” 是更广泛的术语，可包括散步、爬楼梯等日常活动。"
    },
    {
      "word_to_compare": "practice",
      "analysis": "“Practice” (练习) 侧重于通过重复来提高技能，尤其在学习、艺术或专业领域，如练习钢琴或练习演讲。而 “exercise” 在技能训练语境中更强调结构化、有明确目标的训练任务，常用于教育或语言学习中。"
    },
    {
      "word_to_compare": "drill",
      "analysis": "“Drill” (操练) 指高度重复、机械性的训练，常用于军事、体育或语言学习中，目的是形成肌肉记忆或自动化反应。它比 “exercise” 更强调单调性和纪律性，而 “exercise” 的范围更广，可包含创造性或探索性活动。"
    }
  ]
}