{
  "word": "exercises",
  "pronunciation": "ek·ser·siz·iz",
  "concise_definition": "n. 练习, 训练, 体操, 作业",
  "forms": {
    "singular": "exercise"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A structured activity or set of tasks designed to improve a specific skill, physical ability, or understanding, often through repetition and practice.",
      "explanation_cn": "指为提高特定技能、身体能力或理解力而设计的有组织的活动或任务，通常通过重复练习来实现。",
      "example_en": "The students completed their math exercises before the test.",
      "example_cn": "学生们在考试前完成了数学练习题。"
    },
    {
      "pos": "noun",
      "explanation_en": "Physical activities performed to maintain or improve health, fitness, or strength, often following a routine or regimen.",
      "explanation_cn": "指为保持或增强健康、体能或力量而进行的体力活动，通常遵循固定模式或计划。",
      "example_en": "She does morning exercises every day to stay fit.",
      "example_cn": "她每天早晨做体操以保持健康。"
    },
    {
      "pos": "noun",
      "explanation_en": "An action or task carried out to test, demonstrate, or apply a principle, rule, or ability, especially in a formal or controlled setting.",
      "explanation_cn": "指在正式或受控环境中为检验、展示或应用某一原则、规则或能力而进行的活动或任务。",
      "example_en": "The military conducted emergency response exercises to prepare for natural disasters.",
      "example_cn": "军队进行了应急响应演习，以应对自然灾害。"
    },
    {
      "pos": "noun",
      "explanation_en": "A mental or intellectual activity aimed at sharpening reasoning, memory, or problem-solving skills.",
      "explanation_cn": "指旨在提升推理、记忆或解决问题能力的心理或智力活动。",
      "example_en": "Logic puzzles are excellent exercises for training the brain.",
      "example_cn": "逻辑谜题是训练大脑的绝佳练习。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "practice",
      "analysis": "“Practice” (练习) 更强调持续、重复的行为以达到熟练，常用于技能习得的长期过程，如练习钢琴或语言。而 “exercises” 更侧重于具体的、有结构的、有时是短暂的任务或活动，常作为“practice”的组成部分。"
    },
    {
      "word_to_compare": "drill",
      "analysis": "“Drill” (操练) 通常指高度重复、机械性的训练，强调精确性和反应速度，常用于军事、体育或语言学习中的基础技能强化。相比之下，”exercises“ 更广泛，可包含创造性、思考性或综合性任务，不局限于机械重复。"
    },
    {
      "word_to_compare": "workout",
      "analysis": "“Workout” (锻炼) 专指身体上的高强度训练，通常在健身语境中使用，强调心肺功能和肌肉锻炼。而 “exercises” 可涵盖身体、智力、语言等多方面，范围更广，且不一定具有高强度特征。"
    }
  ]
}