{
  "word": "expanded",
  "pronunciation": "ik·spand·id",
  "concise_definition": "adj. 扩大的, 扩展的; v. 扩大, 扩展（expand 的过去式和过去分词）",
  "forms": {
    "base_form": "expand",
    "third_person_singular": "expands",
    "past_tense": "expanded",
    "past_participle": "expanded",
    "present_participle": "expanding",
    "noun_form": "expansion"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing something that has been made larger in size, scope, scale, or range, often through deliberate action or growth.",
      "explanation_cn": "形容某事物在尺寸、范围、规模或程度上已被主动扩大或延伸。",
      "example_en": "The expanded edition of the book includes ten new chapters.",
      "example_cn": "这本书的扩展版增加了十章新内容。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Referring to a detailed or elaborated version of something originally more concise or limited.",
      "explanation_cn": "指原本更简洁或有限的内容被详细阐述或丰富后的版本。",
      "example_en": "She gave an expanded explanation of the theory during the lecture.",
      "example_cn": "她在讲座中对这一理论做了更详尽的解释。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make something larger in extent, size, or scope; to increase the range or capacity of something.",
      "explanation_cn": "使某事物在范围、尺寸或规模上变大；增加其容量或覆盖范围。",
      "example_en": "The company expanded its operations into Southeast Asia last year.",
      "example_cn": "该公司去年将其业务扩展到了东南亚。"
    },
    {
      "pos": "verb",
      "explanation_en": "To broaden or diversify one's knowledge, experience, or horizons.",
      "explanation_cn": "拓宽或丰富某人的知识、经验或视野。",
      "example_en": "Traveling helps expand your understanding of different cultures.",
      "example_cn": "旅行有助于拓宽你对不同文化的理解。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "extended",
      "analysis": "“Extended”（延长的）强调时间或长度上的延续，常用于时间、距离或服务的延长，如“extended deadline”（延长的截止日期）。“Expanded”更侧重于范围、规模或内容的横向扩展，强调空间或复杂性的增加。"
    },
    {
      "word_to_compare": "broadened",
      "analysis": "“Broadened”（拓宽的）多用于抽象概念，如视野、理解、兴趣的扩展，强调多样性或包容性的增加，语气更温和。“Expanded”则更中性，可用于物理空间、组织规模或信息量的扩大，适用范围更广。"
    },
    {
      "word_to_compare": "enlarged",
      "analysis": "“Enlarged”（放大的）通常指物理尺寸或图像的放大，如照片或物体的尺寸变大，常用于视觉或机械语境。“Expanded”则更常用于抽象或系统性扩展，如业务、计划或思想，强调功能或结构的丰富而非单纯尺寸变化。"
    }
  ]
}