{
  "word": "experience",
  "pronunciation": "ik·spir·ee·uhns",
  "concise_definition": "n. 经历, 经验; v. 经历, 体验",
  "forms": {
    "plural": "experiences",
    "third_person_singular": "experiences",
    "past_tense": "experienced",
    "past_participle": "experienced",
    "present_participle": "experiencing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The direct observation of or participation in events as a basis of knowledge; the practical contact with and observation of facts or events.",
      "explanation_cn": "指通过亲身参与或观察事件而获得的知识或认识，强调实际接触和感知事实或事件的过程。",
      "example_en": "Her years of experience in marketing made her the ideal candidate for the job.",
      "example_cn": "她在市场营销方面的多年经验使她成为这份工作的理想人选。"
    },
    {
      "pos": "noun",
      "explanation_en": "A specific event or occurrence that leaves a lasting impression, often emotional or significant.",
      "explanation_cn": "指某一具体事件或经历，通常具有情感色彩或重要意义，能给人留下深刻印象。",
      "example_en": "Traveling alone through Southeast Asia was a life-changing experience.",
      "example_cn": "独自穿越东南亚是一次改变人生的经历。"
    },
    {
      "pos": "verb",
      "explanation_en": "To undergo or live through an event, situation, or feeling, especially one that is intense or significant.",
      "explanation_cn": "指亲身经历或遭遇某种事件、情境或情感，尤指强烈或重要的感受。",
      "example_en": "Many people experienced anxiety during the pandemic.",
      "example_cn": "许多人在疫情期间经历了焦虑。"
    },
    {
      "pos": "verb",
      "explanation_en": "To feel or perceive something through the senses or emotions, often in a deep or meaningful way.",
      "explanation_cn": "指通过感官或情感深刻地感知或体会某种事物。",
      "example_en": "She experienced a profound sense of peace while meditating.",
      "example_cn": "她在冥想时感受到了一种深刻的宁静。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "experience",
      "analysis": "“Experience” 作为名词时，既可指长期积累的技能或知识（如 work experience），也可指一次具体的事件（如 a memorable experience）。而 “incident” 仅指偶然发生的事件，通常不包含主观感受或学习成分，更偏向客观描述。"
    },
    {
      "word_to_compare": "knowledge",
      "analysis": "“Knowledge” (知识) 是通过学习、阅读或教学获得的理论性信息，是抽象的、可传递的。而 “experience” 强调通过亲身实践获得的、不可完全言传的感性认知，是知识的来源之一，但更注重实践与感受。"
    },
    {
      "word_to_compare": "encounter",
      "analysis": "“Encounter” (遭遇) 通常指偶然或意外地遇到某人或某事，强调事件的突发性和短暂性，不一定带来深刻影响。而 “experience” 更强调参与的深度和后续的影响，常包含情感或认知层面的转化。"
    }
  ]
}