{
  "word": "exploding",
  "pronunciation": "ik·sploh·ding",
  "concise_definition": "adj. 爆炸的, 激增的, 爆发式的",
  "forms": {
    "base_form": "explode",
    "past_tense": "exploded",
    "past_participle": "exploded",
    "present_participle": "exploding",
    "noun_form": "explosion"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing something that is undergoing or characterized by a sudden, violent release of energy, often accompanied by a loud noise and destruction.",
      "explanation_cn": "形容某物正在发生或具有突然、剧烈的能量释放特征，通常伴随巨大声响和破坏。",
      "example_en": "The fireworks display included several exploding stars that lit up the night sky.",
      "example_cn": "焰火表演中包含了几颗爆炸的星形火花，照亮了夜空。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used to describe a rapid, dramatic, and often uncontrollable increase in quantity, scale, or intensity, especially in economic, social, or technological contexts.",
      "explanation_cn": "用于形容数量、规模或强度的迅速、显著且常常失控的增长，尤其用于经济、社会或技术语境中。",
      "example_en": "The city is experiencing an exploding population due to migration and high birth rates.",
      "example_cn": "由于移民和高出生率，这座城市正经历人口的激增。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Informally, describing something that is extremely popular, energetic, or overwhelming in impact — often used in marketing or media to convey excitement.",
      "explanation_cn": "非正式用法，形容某事物极其受欢迎、充满活力或影响巨大，常用于营销或媒体中以传达兴奋感。",
      "example_en": "Her new album is an exploding hit, topping charts worldwide within days.",
      "example_cn": "她的新专辑成为爆红热单，几天内登顶全球排行榜。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bursting",
      "analysis": "“Bursting”（爆裂的）强调物理上的突然破裂或充满到极限的状态，如“bursting with energy”或“bursting at the seams”。它更侧重于容器或结构的承受极限，而 “exploding” 更强调能量释放的暴力性和破坏性，常伴随声响和碎片。"
    },
    {
      "word_to_compare": "rapid",
      "analysis": "“Rapid”（迅速的）仅描述速度，是中性词，不包含情绪或破坏性含义。而 “exploding” 不仅表示速度快，还隐含剧烈、不可控、震撼性的增长或变化，带有更强的视觉和情感冲击力。"
    },
    {
      "word_to_compare": "escalating",
      "analysis": "“Escalating”（升级的）指某种趋势或问题逐步加剧，通常是线性或渐进的，如“escalating tensions”。而 “exploding” 暗示的是非线性的、指数级的、突然的爆发，更强调转折点和质变，而非持续上升。"
    }
  ]
}