{
  "word": "exploration",
  "pronunciation": "ek·spuh·lɔr·ay·shuhn",
  "concise_definition": "n. 探索, 考察, 探险",
  "forms": {
    "plural": "explorations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of traveling through or examining an unfamiliar area or subject in order to discover new information, resources, or knowledge.",
      "explanation_cn": "指为了发现新信息、资源或知识而对不熟悉的地区或领域进行的旅行或考察。",
      "example_en": "The exploration of the Amazon rainforest revealed hundreds of previously unknown plant species.",
      "example_cn": "对亚马逊雨林的探索发现了数百种此前未知的植物物种。"
    },
    {
      "pos": "noun",
      "explanation_en": "A systematic investigation or study aimed at understanding a complex issue, concept, or field, often in science, art, or philosophy.",
      "explanation_cn": "指为理解复杂问题、概念或领域而进行的系统性调查或研究，常用于科学、艺术或哲学领域。",
      "example_en": "Her exploration of human emotions through abstract painting challenged traditional artistic norms.",
      "example_cn": "她通过抽象绘画对人类情感的探索挑战了传统的艺术规范。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process of mentally or emotionally investigating one’s own thoughts, beliefs, or identity, often as part of personal growth.",
      "explanation_cn": "指在个人成长过程中，对自身思想、信念或身份进行心理或情感上的探索。",
      "example_en": "After the divorce, he embarked on a journey of self-exploration to rediscover his purpose.",
      "example_cn": "离婚后，他踏上了一段自我探索的旅程，以重新发现自己的人生目标。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "investigation",
      "analysis": "“Investigation” (调查) 更强调系统性地收集证据或信息以查明事实真相，常用于法律、科学或犯罪情境，具有明确的目标和方法论。而 “exploration” 更侧重于开放性、发现性的过程，不一定以解决问题为目的，更强调探索未知。"
    },
    {
      "word_to_compare": "adventure",
      "analysis": "“Adventure” (冒险) 强调刺激、危险和不确定性带来的体验，常带有情感色彩和娱乐性。虽然探险常伴随冒险，但 “exploration” 更注重目的性与知识获取，而非单纯的刺激或娱乐。"
    },
    {
      "word_to_compare": "survey",
      "analysis": "“Survey” (调查/勘测) 通常指对某一区域或主题进行快速、广泛的初步观察或数据收集，常用于地理、社会学或市场研究，具有标准化和量化特征。而 “exploration” 更深入、更开放，允许非结构化的发现和直觉性洞察。"
    }
  ]
}