{
  "word": "exposure",
  "pronunciation": "ik·spo·zhur",
  "concise_definition": "n. 暴露, 接触, 亮相, 曝光",
  "forms": {
    "plural": "exposures"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The state of being unprotected from something harmful or unpleasant, such as danger, weather, or negative influences.",
      "explanation_cn": "指处于缺乏保护、易受有害或不愉快事物影响的状态，如危险、恶劣天气或负面影响。",
      "example_en": "Prolonged exposure to the sun can cause skin damage.",
      "example_cn": "长时间暴露在阳光下会导致皮肤损伤。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of revealing or making something known to the public, especially something previously hidden or private.",
      "explanation_cn": "指将原本隐藏或私密的事物公之于众，尤指揭露丑闻、秘密或不为人知的事实。",
      "example_en": "The journalist's investigation led to the exposure of corruption in the government.",
      "example_cn": "记者的调查揭露了政府中的腐败行为。"
    },
    {
      "pos": "noun",
      "explanation_en": "The state of being seen or known by the public, especially in the context of media or fame.",
      "explanation_cn": "指在公众视野中被看见或知晓的状态，尤其在媒体或名人语境中。",
      "example_en": "The new actress gained widespread exposure after her appearance on the reality show.",
      "example_cn": "这位新女演员在参加真人秀后获得了广泛的曝光。"
    },
    {
      "pos": "noun",
      "explanation_en": "In photography, the amount of light that reaches the camera sensor or film, determined by shutter speed, aperture, and ISO.",
      "explanation_cn": "在摄影中，指到达相机传感器或胶片的光量，由快门速度、光圈和感光度决定。",
      "example_en": "The photographer adjusted the exposure to capture the details in the shadowy areas.",
      "example_cn": "摄影师调整了曝光，以捕捉阴影区域的细节。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "display",
      "analysis": "“Display”（展示）强调有意识地、主动地将某物呈现出来，通常是为了吸引注意或展示优点，带有积极或中性色彩。而 “exposure” 更侧重于被动或无意的暴露，有时带有负面含义，如隐私泄露或风险暴露。"
    },
    {
      "word_to_compare": "revelation",
      "analysis": "“Revelation”（揭示）通常指一种突然的、戏剧性的或神圣的真相揭露，常带有深刻或震撼的意味，多用于抽象概念或重大发现。而 “exposure” 更常用于实际的、具体的揭露行为，如丑闻曝光或物理暴露，语义更日常和实用。"
    },
    {
      "word_to_compare": "contact",
      "analysis": "“Contact”（接触）指物理或间接的接触关系，强调互动或连接，但不一定涉及危险或公开性。而 “exposure” 暗示接触后可能带来的后果，尤其是有害或不可控的影响，语义更强调风险与后果。"
    }
  ]
}