{
  "word": "exposition",
  "pronunciation": "ek·spuh·zish·uhn",
  "concise_definition": "n. 说明, 阐述, 展览, 展示",
  "forms": {
    "plural": "expositions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A clear and detailed explanation or presentation of ideas, concepts, or information, often used in literature, rhetoric, or education to provide background or context.",
      "explanation_cn": "指对思想、概念或信息进行清晰而详细的说明或陈述，常用于文学、修辞或教育中，以提供背景或上下文。",
      "example_en": "The first chapter of the novel serves as an exposition of the protagonist's troubled childhood.",
      "example_cn": "这部小说的第一章是对主人公坎坷童年的背景说明。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large public exhibition or fair, especially one showcasing industry, technology, culture, or art, often held in a dedicated venue.",
      "explanation_cn": "指大型的公共展览或博览会，尤其用于展示工业、科技、文化或艺术成就，通常在专门场馆举办。",
      "example_en": "The World Expo in Shanghai in 2010 attracted over 70 million visitors.",
      "example_cn": "2010年上海世博会吸引了超过七千万名参观者。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of displaying or presenting something, especially in a formal or public setting, such as art or artifacts.",
      "explanation_cn": "指以正式或公开的方式展示某物，尤指艺术品或文物的陈列。",
      "example_en": "The museum's new exposition of ancient Egyptian relics drew widespread acclaim.",
      "example_cn": "博物馆新推出的古埃及文物展览广受赞誉。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "explanation",
      "analysis": "“Explanation”（解释）更侧重于澄清某个具体问题或现象的原因或机制，通常具有针对性和逻辑性。而 “exposition” 更广泛，常用于系统性、结构性地呈现背景信息或整体框架，尤其在文学或学术语境中。"
    },
    {
      "word_to_compare": "presentation",
      "analysis": "“Presentation”（展示）强调表达方式和形式，如演讲、PPT或演示，注重观众体验和沟通技巧。而 “exposition” 更注重内容的完整性与信息的传递，不一定包含表演性或互动性，常用于书面或叙述性语境。"
    },
    {
      "word_to_compare": "exhibition",
      "analysis": "“Exhibition”（展览）与 “exposition” 在指代实物展示时高度重合，但 “exhibition” 更常用于艺术、博物馆或商业场景，语义更具体；而 “exposition” 除了展览外，还保留着‘阐述’的抽象含义，适用范围更广，且常用于大型国际博览会。"
    }
  ]
}