{
  "word": "extensions",
  "pronunciation": "ik·sten·zhuhnz",
  "concise_definition": "n. 扩展, 延长, 附加部分, 电话分机",
  "forms": {
    "singular": "extension"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An addition or increase that extends the scope, duration, or size of something, often to accommodate more needs or possibilities.",
      "explanation_cn": "指对某事物的范围、持续时间或规模进行的增加或延伸，通常是为了满足更多需求或可能性。",
      "example_en": "The university granted a two-week extension on the submission deadline for research papers.",
      "example_cn": "大学将研究论文的提交截止日期延长了两周。"
    },
    {
      "pos": "noun",
      "explanation_en": "A supplementary part added to something to enhance its function or reach, such as a hair extension or a building extension.",
      "explanation_cn": "指为增强功能或扩大范围而附加的部分，如假发延长段或建筑扩建部分。",
      "example_en": "She added hair extensions to give her look more volume and length.",
      "example_cn": "她佩戴了假发延长段，使发型看起来更丰盈、更长。"
    },
    {
      "pos": "noun",
      "explanation_en": "In telecommunications, a subordinate phone line connected to a main system, allowing internal calls within an organization.",
      "explanation_cn": "在电信领域，指连接到主系统上的分机号码，用于组织内部的通话。",
      "example_en": "Please dial extension 305 to reach the sales department.",
      "example_cn": "请拨打分机号305联系销售部。"
    },
    {
      "pos": "noun",
      "explanation_en": "In computing, a suffix added to a filename to indicate its format or type (e.g., .pdf, .jpg, .exe).",
      "explanation_cn": "在计算机领域，指附加在文件名末尾以表明其格式或类型的后缀（如 .pdf、.jpg、.exe）。",
      "example_en": "The file must have a .docx extension to be opened in Microsoft Word.",
      "example_cn": "文件必须具有 .docx 扩展名才能在 Microsoft Word 中打开。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "addition",
      "analysis": "“Addition”（添加）泛指任何增加的内容，不强调延伸或扩展的功能性，可以是临时或无关的补充。而 “extension” 更强调对原有结构的延续、扩展或功能增强，具有内在的逻辑延续性。"
    },
    {
      "word_to_compare": "expansion",
      "analysis": "“Expansion”（扩张）侧重于规模、空间或范围的扩大，常用于经济、地理或物理层面，如公司扩张、城市扩张。而 “extension” 更常用于时间、功能或结构上的延伸，如延期、分机、文件扩展名，更具体、更技术化。"
    },
    {
      "word_to_compare": "supplement",
      "analysis": "“Supplement”（补充）指为完善或增强主体而添加的额外内容，通常独立于主体，如营养补充剂。而 “extension” 是主体的直接延续，两者在结构上是连续的，如建筑扩建是原建筑的一部分，而非独立添加物。"
    }
  ]
}