{
  "word": "extending",
  "pronunciation": "ik·tend·iŋ",
  "concise_definition": "v. 延长, 扩展, 伸展, 提供",
  "forms": {
    "base_form": "extend",
    "third_person_singular": "extends",
    "past_tense": "extended",
    "past_participle": "extended",
    "present_participle": "extending"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To make something longer in time, space, or scope, often beyond its original limit or duration.",
      "explanation_cn": "指在时间、空间或范围上将某事物延长或扩大，通常超出其原始的限制或持续时间。",
      "example_en": "The company is extending its office hours to accommodate more customers.",
      "example_cn": "该公司正在延长办公时间，以服务更多客户。"
    },
    {
      "pos": "verb",
      "explanation_en": "To stretch out or reach out physically, especially a limb or object.",
      "explanation_cn": "指在身体上伸展或伸出某物，尤指肢体或工具。",
      "example_en": "She was extending her hand to greet the visitor.",
      "example_cn": "她正伸出手来迎接访客。"
    },
    {
      "pos": "verb",
      "explanation_en": "To offer or provide something, such as an offer, invitation, or help, often formally or generously.",
      "explanation_cn": "指正式或慷慨地提供某物，如提议、邀请或帮助。",
      "example_en": "The university is extending scholarships to international students this year.",
      "example_cn": "今年这所大学正在向国际学生提供奖学金。"
    },
    {
      "pos": "verb",
      "explanation_en": "To broaden the scope or application of something, such as a concept, system, or influence.",
      "explanation_cn": "指扩大某事物的范围或应用，如概念、系统或影响力。",
      "example_en": "The new policy is extending the reach of healthcare services to rural areas.",
      "example_cn": "这项新政策正在将医疗服务的覆盖范围扩展到农村地区。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "expand",
      "analysis": "“Expand” (扩大) 强调在体积、规模或范围上的向外扩张，通常指空间或数量的增加，如气球膨胀、市场扩大。而 “extend” 更侧重于在原有基础上延长或延伸，如延长截止日期、伸出手臂，强调线性或连续性的延伸。"
    },
    {
      "word_to_compare": "prolong",
      "analysis": "“Prolong” (延长) 专指时间上的延续，常带有负面含义，如延长痛苦或疾病。而 “extend” 在时间语境中更中性，可用于积极场景，如延长合同、延长服务期限。"
    },
    {
      "word_to_compare": "stretch",
      "analysis": "“Stretch” (拉伸) 强调物理上的拉长或紧绷，常用于身体动作或弹性材料，如拉伸肌肉、拉伸布料。而 “extend” 更广泛，可用于抽象概念（如扩展影响力），且不强调张力或变形。"
    },
    {
      "word_to_compare": "offer",
      "analysis": "“Offer” (提供) 是一个更通用的词，指主动给予或提出某物，如提议、礼物或服务，但不隐含“延伸”或“扩展”的空间/时间维度。而 “extend” 在表示“提供”时，常带有正式、礼节性或逐步递进的意味，如 extend an invitation（发出邀请），强调从一方到另一方的延伸动作。"
    }
  ]
}