{
  "word": "extract",
  "pronunciation": "ik·strakt",
  "concise_definition": "v. 提取, 汲取, 榨取; n. 提取物, 摘录",
  "forms": {
    "third_person_singular": "extracts",
    "past_tense": "extracted",
    "past_participle": "extracted",
    "present_participle": "extracting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To remove or obtain something, especially by force, effort, or a specific process, from a larger whole or source.",
      "explanation_cn": "指通过力量、努力或特定过程，从更大的整体或来源中移除或获取某物。",
      "example_en": "Scientists extracted DNA from the ancient bone sample.",
      "example_cn": "科学家从古代骨骼样本中提取了DNA。"
    },
    {
      "pos": "verb",
      "explanation_en": "To obtain information or a response from someone, often with difficulty or through persuasion or pressure.",
      "explanation_cn": "指通过困难、说服或施压，从某人那里获取信息或回应。",
      "example_en": "The journalist managed to extract a confession from the suspect.",
      "example_cn": "记者成功从嫌疑人那里套出了供词。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a concentrated substance by removing it from its original material, often through chemical or physical means.",
      "explanation_cn": "指通过化学或物理方法，从原始材料中分离出浓缩物质。",
      "example_en": "Vanilla extract is made by soaking vanilla beans in alcohol.",
      "example_cn": "香草精是通过将香草豆浸泡在酒精中制成的。"
    },
    {
      "pos": "noun",
      "explanation_en": "A concentrated substance obtained by extracting a component from a raw material, often used in food, medicine, or fragrance.",
      "explanation_cn": "指从原材料中提取出的浓缩物质，常用于食品、药品或香料中。",
      "example_en": "She added a few drops of lemon extract to the cake batter.",
      "example_cn": "她在蛋糕糊中加入了几滴柠檬提取物。"
    },
    {
      "pos": "noun",
      "explanation_en": "A passage or segment taken from a longer text, often used to illustrate or summarize the whole.",
      "explanation_cn": "指从较长文本中摘录出的一段内容，常用于说明或概括全文。",
      "example_en": "The book includes an extract from the author's original diary.",
      "example_cn": "这本书收录了作者原始日记中的一段摘录。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "remove",
      "analysis": "“Remove” (移除) 是一个通用词，指将某物从某处拿走或清除，不强调过程或目的。而 “extract” 更强调通过技术性、有目的的努力或特定方法来获取或分离，常涉及复杂过程或内在成分的提取。"
    },
    {
      "word_to_compare": "derive",
      "analysis": "“Derive” (推导/获得) 通常用于抽象概念，如从理论、公式或逻辑中推导出结论，强调推理过程。而 “extract” 更常用于物理或实际的获取，如从物质中提取成分，或从人那里获取信息，强调动作的直接性和手段性。"
    },
    {
      "word_to_compare": "extract",
      "analysis": "“Extract” 作为名词时，指被提取出的浓缩物或摘录内容，而 “sample” (样本) 是指用于分析或展示的代表性部分，通常未经过浓缩或加工。例如，‘tea extract’ 是浓缩液，而 ‘tea sample’ 只是少量原叶。"
    }
  ]
}