{
  "word": "extracts",
  "pronunciation": "ik·strakt·s",
  "concise_definition": "n. 提取物, 摘录, 摘要",
  "forms": {
    "singular": "extract"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A substance that has been removed or separated from a larger source, often through a chemical or physical process, and typically used for its concentrated properties (e.g., flavor, medicinal value).",
      "explanation_cn": "指通过化学或物理过程从较大来源中分离提取出的物质，通常因其浓缩的特性（如风味、药用价值）而被使用。",
      "example_en": "Vanilla extract is commonly used in baking to add rich flavor.",
      "example_cn": "香草提取物常用于烘焙，以增添浓郁风味。"
    },
    {
      "pos": "noun",
      "explanation_en": "A passage or portion taken from a longer written work, such as a book, article, or speech, often used to illustrate or summarize its content.",
      "explanation_cn": "指从较长的书面作品（如书籍、文章或演讲）中摘录出的一段文字，常用于说明或概括其内容。",
      "example_en": "The professor shared an extract from Shakespeare’s Hamlet to illustrate the theme of indecision.",
      "example_cn": "教授引用了莎士比亚《哈姆雷特》中的一段文字，以说明犹豫不决的主题。"
    },
    {
      "pos": "noun",
      "explanation_en": "A condensed summary or abstract of a longer text, often published separately for reference or distribution.",
      "explanation_cn": "指较长文本的浓缩摘要或提要，常被单独出版以便参考或分发。",
      "example_en": "The journal published an extract of the research paper for its newsletter subscribers.",
      "example_cn": "该期刊为通讯订阅者发布了这篇研究论文的摘要。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "excerpt",
      "analysis": "“Excerpt”（摘录）与 “extract” 在指代文本摘录时高度相似，但 “excerpt” 更常用于文学、学术或正式语境，强调从完整作品中选取的片段，通常保留原貌；而 “extract” 可用于更广泛的语境，包括物质提取和非正式摘录。"
    },
    {
      "word_to_compare": "summary",
      "analysis": "“Summary”（摘要）是对原文内容的概括性重述，通常经过重新组织和简化，不保留原文语句；而 “extract” 是直接从原文中截取的原句或段落，保持原始文字不变，更强调‘来源性’而非‘归纳性’。"
    },
    {
      "word_to_compare": "concentrate",
      "analysis": "“Concentrate”（浓缩物）与 “extract” 在物质提取语境中部分重叠，但 “concentrate” 更强调通过去除水分或杂质使成分密度增加，常用于食品或饮料工业（如橙汁浓缩液）；而 “extract” 更强调从原料中分离出特定活性成分，如香精、草药提取物，常含溶剂残留。"
    }
  ]
}