{
  "word": "extraction",
  "pronunciation": "ek·strak·shun",
  "concise_definition": "n. 提取, 汲取, 拔出, 摘录",
  "forms": {
    "plural": "extractions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of removing or taking out something, especially a substance or material, from a larger source or medium, often through physical or chemical means.",
      "explanation_cn": "指通过物理或化学手段从较大来源或介质中移除或取出某种物质或材料的过程。",
      "example_en": "The extraction of crude oil from underground reservoirs requires advanced drilling technology.",
      "example_cn": "从地下储层中提取原油需要先进的钻探技术。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of forcibly removing something, such as a tooth or a body part, often in a medical or surgical context.",
      "explanation_cn": "指在医疗或外科情境下强行移除某物（如牙齿或身体部位）的行为。",
      "example_en": "The dentist performed the extraction of his wisdom tooth under local anesthesia.",
      "example_cn": "牙医在局部麻醉下为他拔除了智齿。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process of obtaining information, data, or content from a larger set, often through analysis or filtering.",
      "explanation_cn": "指通过分析或筛选从大量信息中获取特定数据或内容的过程。",
      "example_en": "Data extraction from the survey responses revealed key trends in consumer preferences.",
      "example_cn": "对调查回复的数据提取揭示了消费者偏好的关键趋势。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of deriving or abstracting a passage, quote, or idea from a text or source, often for citation or emphasis.",
      "explanation_cn": "指从文本或来源中摘录、引述一段话、引语或观点，常用于引用或强调。",
      "example_en": "The book includes an extraction of the author’s most influential speeches.",
      "example_cn": "这本书收录了作者最具影响力的演讲摘录。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "removal",
      "analysis": "“Removal”（移除）泛指将某物从某处拿走，强调动作本身，不涉及方式或目的。而 “extraction” 更强调有技术性、系统性或强制性的取出过程，常用于科学、医学或数据领域，隐含复杂操作。"
    },
    {
      "word_to_compare": "retrieval",
      "analysis": "“Retrieval”（检索/取回）通常用于信息或物品的找回，强调从存储或记忆中重新获得已存在但被隐藏或存档的内容，如检索文件或记忆。而 “extraction” 更侧重于从混合物或整体中分离出原本不独立存在的部分，如从矿石中提取金属。"
    },
    {
      "word_to_compare": "derivation",
      "analysis": "“Derivation”（推导/派生）多用于语言学或数学中，指从一个词根、公式或原理逻辑推导出新形式，强调理论或规则的转化。而 “extraction” 更偏向实际操作或物理/化学分离，不必然涉及逻辑推理。"
    }
  ]
}