{
  "word": "extracting",
  "pronunciation": "ik·strak·ting",
  "concise_definition": "v. 提取, 汲取, 榨取, 摘录",
  "forms": {
    "base_form": "extract",
    "third_person_singular": "extracts",
    "past_tense": "extracted",
    "past_participle": "extracted",
    "present_participle": "extracting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To remove or take out something, especially by force, effort, or a specific process, from a larger whole or a confined source.",
      "explanation_cn": "指通过力量、努力或特定过程，从更大的整体或封闭来源中取出或移除某物。",
      "example_en": "Scientists are extracting DNA from ancient bones to study human evolution.",
      "example_cn": "科学家正在从古骨头中提取DNA，以研究人类进化。"
    },
    {
      "pos": "verb",
      "explanation_en": "To obtain information, data, or a response from someone, often with difficulty or through persuasion.",
      "explanation_cn": "指从某人那里艰难地获得信息、数据或回应，通常需要说服或施加压力。",
      "example_en": "The journalist spent weeks extracting the truth from reluctant witnesses.",
      "example_cn": "这位记者花了数周时间才从不愿配合的证人那里获取真相。"
    },
    {
      "pos": "verb",
      "explanation_en": "To derive or obtain a substance, especially a valuable or concentrated one, from a raw or mixed material through chemical or physical processes.",
      "explanation_cn": "指通过化学或物理过程，从原材料或混合物中提炼出某种物质，尤其是有价值的浓缩成分。",
      "example_en": "The factory is extracting essential oils from lavender flowers for perfumes.",
      "example_cn": "该工厂正从薰衣草花中提取精油用于香水制造。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove a tooth, object, or part from the body or a structure, typically by surgical or mechanical means.",
      "explanation_cn": "指通过外科或机械手段，从身体或结构中拔除牙齿、物体或部分。",
      "example_en": "The dentist spent 20 minutes extracting the impacted wisdom tooth.",
      "example_cn": "牙医花了20分钟拔除了阻生的智齿。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "remove",
      "analysis": "“Remove” (移除) 是一个更通用的词，指将某物从某处拿走，不强调方式或难度，可以是简单地移动或清理。而 “extract” 暗示了更费力、更复杂或需要专门技术的过程，常涉及从内部或紧密结构中取出。"
    },
    {
      "word_to_compare": "derive",
      "analysis": "“Derive” (推导/获得) 通常用于抽象概念，如从理论、公式或数据中逻辑推导出结论，强调推理过程。而 “extract” 更强调物理或实际的取出动作，即使对象是信息，也常带有‘艰难获取’的语义色彩。"
    },
    {
      "word_to_compare": "pull out",
      "analysis": "“Pull out” (拉出) 是一个口语化表达，常用于物理动作，如从口袋里拉出钥匙，语气较随意。而 “extract” 更正式、更精确，常用于科学、医学或技术语境，带有专业性和目的性。"
    }
  ]
}