{
  "word": "eye",
  "pronunciation": "ī",
  "concise_definition": "n. 眼睛, 视力, 观察力; v. 注视, 看",
  "forms": {
    "plural": "eyes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The organ of sight in humans and animals, responsible for perceiving light and forming visual images.",
      "explanation_cn": "人类和动物用于感知光线并形成视觉图像的视觉器官。",
      "example_en": "She has beautiful blue eyes.",
      "example_cn": "她有一双美丽的蓝眼睛。"
    },
    {
      "pos": "noun",
      "explanation_en": "The ability to see, perceive, or judge something with insight or discernment, often used metaphorically to mean aesthetic judgment or attention to detail.",
      "explanation_cn": "指以洞察力或辨别力观察或判断事物的能力，常用于比喻意义上，表示审美判断或对细节的关注。",
      "example_en": "He has an eye for design and always chooses the most elegant furniture.",
      "example_cn": "他有极佳的审美眼光，总是挑选最优雅的家具。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, round opening or loop, such as the hole in a needle or the loop at the end of a rope.",
      "explanation_cn": "指一个小的圆形开口或环状结构，如针眼或绳子末端的环。",
      "example_en": "Thread the needle through its eye.",
      "example_cn": "把线穿过针眼。"
    },
    {
      "pos": "noun",
      "explanation_en": "The center or focal point of something, especially in natural phenomena (e.g., the calm center of a storm).",
      "explanation_cn": "指某物的中心或焦点，尤指自然现象中的中心区域（如风暴的中心）。",
      "example_en": "The hurricane's eye was calm and clear, surrounded by violent winds.",
      "example_cn": "飓风的中心平静而清澈，四周却是狂风肆虐。"
    },
    {
      "pos": "verb",
      "explanation_en": "To look at something closely or carefully, often with interest, suspicion, or intent.",
      "explanation_cn": "仔细地、专注地注视某物，常带有兴趣、怀疑或意图。",
      "example_en": "The security guard eyed the stranger suspiciously.",
      "example_cn": "保安警惕地打量着那个陌生人。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "gaze",
      "analysis": "“Gaze” (凝视) 强调长时间、专注地看，通常带有情感色彩（如爱慕、惊讶或沉思），是一种持续性的视觉行为。而 “eye” 作为动词时更强调‘用眼睛观察’的动作本身，可能短暂且带有目的性，如监视或评估。"
    },
    {
      "word_to_compare": "sight",
      "analysis": "“Sight” (视觉/景象) 是指视觉能力或所看到的景象，是抽象名词，强调感知的结果或范围。而 “eye” 是具体的器官或观察的主体，也可引申为判断力，更强调主体的能动性。例如：‘the sight of the sunset’（日落的景象） vs. ‘an artist’s eye’（艺术家的眼光）。"
    },
    {
      "word_to_compare": "view",
      "analysis": "“View” (视野/观点) 既可以指物理上的视角或风景，也可以指主观的看法或意见。它更侧重于观察的角度或认知立场，而 “eye” 作为名词时更偏向于生理器官或审美能力，作为动词时则更直接地表示‘注视’的动作，不包含抽象观点的含义。"
    }
  ]
}