{
  "word": "eyes",
  "pronunciation": "īz",
  "concise_definition": "n. 眼睛, 视力, 注视, 关注",
  "forms": {
    "singular": "eye"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "One of the two organs in the face used for seeing; the physical organ that detects light and sends visual signals to the brain.",
      "explanation_cn": "面部中用于视觉的两个器官之一，能够感知光线并将视觉信号传递给大脑。",
      "example_en": "She has beautiful blue eyes that seem to sparkle in the sunlight.",
      "example_cn": "她有一双美丽的蓝眼睛，在阳光下仿佛闪闪发亮。"
    },
    {
      "pos": "noun",
      "explanation_en": "The ability to see or perceive something, often used metaphorically to describe discernment or aesthetic judgment.",
      "explanation_cn": "指视觉能力，常用于比喻，表示辨别力或审美判断力。",
      "example_en": "The curator has an eye for detail and selects only the finest pieces for the exhibition.",
      "example_cn": "策展人眼光独到，只挑选最精美的作品参展。"
    },
    {
      "pos": "noun",
      "explanation_en": "Attention or observation, especially when someone is watching or monitoring something closely.",
      "explanation_cn": "指关注或注视，尤指某人密切观察或监视某事。",
      "example_en": "The new policy is under the public's eye, and any misstep will be noticed immediately.",
      "example_cn": "这项新政策受到公众的关注，任何失误都会立即被发现。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, round, or eye-like part of an object, such as the center of a potato or the loop in a needle.",
      "explanation_cn": "指物体中类似眼睛的小圆形部分，如马铃薯的芽眼或针眼。",
      "example_en": "Be careful not to cut into the eyes of the potato when peeling it.",
      "example_cn": "削土豆时要小心不要切到芽眼。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "gaze",
      "analysis": "“Gaze”（凝视）是动词或名词，强调长时间、专注地看，常带有情感色彩（如爱慕、惊讶）。而 “eyes” 是视觉器官本身，或泛指视觉关注，不强调动作的持续性或情感深度。"
    },
    {
      "word_to_compare": "view",
      "analysis": "“View”（视野、观点）侧重于所看到的景象或对事物的看法，常用于抽象语境（如风景、观点）。而 “eyes” 更具体，指生理器官或直接的视觉行为，强调感知的主体而非内容。"
    },
    {
      "word_to_compare": "sight",
      "analysis": "“Sight”（视力、景象）可指视觉能力（如 lose one’s sight）或所见之物（如 a beautiful sight）。它更偏向于抽象的感知能力或结果，而 “eyes” 是具体的器官，是实现“sight”的工具。"
    }
  ]
}