{
  "word": "facebook",
  "pronunciation": "feyss·book",
  "concise_definition": "n. 脸书（社交网站）, n. （大学等机构的）学生名册, v. 在脸书上发布",
  "forms": {
    "third_person_singular": "faces",
    "past_tense": "faced",
    "past_participle": "faced",
    "present_participle": "facing",
    "plural": "facebooks"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A social media platform founded in 2004 by Mark Zuckerberg, allowing users to create profiles, connect with friends, share content, and interact through posts, messages, and groups.",
      "explanation_cn": "由马克·扎克伯格于2004年创立的社交媒体平台，用户可创建个人资料、与朋友建立联系、分享内容，并通过帖子、私信和群组进行互动。",
      "example_en": "She posted a photo of her vacation on Facebook and received over a thousand likes.",
      "example_cn": "她在脸书上发布了一张度假照片，获得了上千个赞。"
    },
    {
      "pos": "noun",
      "explanation_en": "A printed directory, typically used by universities or colleges, that lists students' names, photographs, and sometimes contact information, originally used for identification and social networking on campus.",
      "explanation_cn": "一种印刷版的名册，通常由大学或学院使用，列出学生的姓名、照片，有时还包括联系方式，最初用于校园内的身份识别与社交联络。",
      "example_en": "The freshman class was given a Facebook on orientation day to help them get to know each other.",
      "example_cn": "新生在迎新日收到了一份学生名册，以帮助他们相互认识。"
    },
    {
      "pos": "verb",
      "explanation_en": "To post information, photos, or updates on the Facebook social media platform.",
      "explanation_cn": "在脸书社交媒体平台上发布信息、照片或动态。",
      "example_en": "He Facebooked the concert footage right after the show ended.",
      "example_cn": "演出一结束，他就把现场视频发到了脸书上。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "social media",
      "analysis": "“Social media”（社交媒体）是一个总称，涵盖所有允许用户创建和分享内容的在线平台，如 Instagram、Twitter、TikTok 等。而 “Facebook” 是其中的一个具体平台，具有特定的功能和用户群体。前者是类别，后者是实例。"
    },
    {
      "word_to_compare": "directory",
      "analysis": "“Directory”（名册/目录）泛指任何按类别组织的联系信息列表，如电话簿或公司员工名录。而 “Facebook” 作为名词时特指大学或机构中带有照片的学生名册，具有更强的社交和身份识别功能，且如今已与数字平台深度绑定。"
    },
    {
      "word_to_compare": "post",
      "analysis": "“Post”（发布）是一个通用动词，指在任何平台（如微博、微信、Instagram）上发布内容。而 “Facebook” 作为动词时，特指在 Facebook 平台上发布，具有平台专属的语义和文化含义，使用时隐含了该平台特有的互动方式（如点赞、评论、分享）。"
    }
  ]
}