{
  "word": "faces",
  "pronunciation": "feyss",
  "concise_definition": "n. 脸, 面部; 面, 表面; 面对, 面临",
  "forms": {
    "singular": "face"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The front part of the head, from the forehead to the chin, including the eyes, nose, and mouth; the primary feature used to express emotion and identify individuals.",
      "explanation_cn": "头部的前部，从额头到下巴，包括眼睛、鼻子和嘴巴；用于表达情感和识别个体的主要特征。",
      "example_en": "She smiled warmly, her face lighting up with joy.",
      "example_cn": "她温暖地微笑着，脸上洋溢着喜悦。"
    },
    {
      "pos": "noun",
      "explanation_en": "The surface or side of an object that is visible or directed toward a particular direction; often used to describe the external appearance or orientation of something.",
      "explanation_cn": "物体可见或朝向某一方向的表面或侧面；常用于描述某物的外观或朝向。",
      "example_en": "The clock has a white face with black numbers.",
      "example_cn": "这座钟有一个白色表盘，上面是黑色数字。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be oriented or directed toward something, often implying confrontation, attention, or readiness to deal with a situation.",
      "explanation_cn": "朝向某物，常暗示面对、关注或准备应对某种情况。",
      "example_en": "The house faces the ocean, offering a breathtaking view.",
      "example_cn": "这所房子面朝大海，景色壮丽。"
    },
    {
      "pos": "verb",
      "explanation_en": "To confront or deal with a difficult situation, problem, or reality, often with courage or acceptance.",
      "explanation_cn": "面对或应对困难的情况、问题或现实，常带有勇气或接受的态度。",
      "example_en": "We must face the facts and make necessary changes.",
      "example_cn": "我们必须正视现实并做出必要的改变。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "countenance",
      "analysis": "“Countenance”（面容）是“face”的正式或文学性同义词，更强调面部表情所传达的情绪或态度，常用于描述一个人的神情，如“a stern countenance”。而 “face” 更通用，既可指生理结构，也可指抽象的面对行为。"
    },
    {
      "word_to_compare": "surface",
      "analysis": "“Surface”（表面）泛指任何物体的外层，强调物理层面的接触面，如“the surface of a table”。而 “face” 作为名词时，特指具有方向性或功能性的表面，如“the face of a mountain”或“clock face”，更具指向性和识别性。"
    },
    {
      "word_to_compare": "confront",
      "analysis": "“Confront”（面对）是动词，强调主动、直接地应对挑战或冲突，常带有对抗性，如“confront a problem”。而 “face” 作为动词时语气更中性，可指被动或客观地处于某种情境中，如“face the consequences”，不一定包含对抗意图。"
    }
  ]
}