{
  "word": "fair",
  "pronunciation": "fair",
  "concise_definition": "adj. 公平的, 公正的; 晴朗的; 金发的; n. 集市, 展览会",
  "forms": {
    "comparative": "fairer",
    "superlative": "fairest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Impartial and just, treating all parties equally without favoritism or discrimination.",
      "explanation_cn": "不偏不倚、公正无私，平等地对待所有各方，不偏袒或歧视任何人。",
      "example_en": "The judge made a fair decision based on the evidence presented.",
      "example_cn": "法官根据所呈交的证据作出了公正的裁决。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by good weather, especially clear skies and mild conditions.",
      "explanation_cn": "形容天气良好，尤指晴朗、温和。",
      "example_en": "We had a fair day for the picnic, with sunshine and a gentle breeze.",
      "example_cn": "我们野餐那天天气晴朗，阳光明媚，微风轻拂。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Having light-colored hair, typically pale blond or light brown.",
      "explanation_cn": "指头发颜色较浅，通常是淡金色或浅棕色。",
      "example_en": "She was a fair-skinned girl with long, flowing fair hair.",
      "example_cn": "她是一个皮肤白皙、长发飘逸的金发女孩。"
    },
    {
      "pos": "noun",
      "explanation_en": "A public event, often annual, featuring exhibitions, rides, games, and entertainment, usually held outdoors.",
      "explanation_cn": "一种公共活动，通常为年度性，包含展览、游乐设施、游戏和娱乐项目，多在户外举行。",
      "example_en": "The county fair attracted thousands of visitors with its livestock shows and cotton candy stalls.",
      "example_cn": "这个县集市以其牲畜展览和棉花糖摊位吸引了成千上万的游客。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "just",
      "analysis": "“Just” (正义的) 更强调符合道德或法律标准的正确性，常用于法律或伦理语境，侧重于“应得”或“合乎正义”。而 “fair” 更侧重于程序上的平等与无偏见，强调过程的中立性。例如，一个判决可以是 just（合法）但不够 fair（因程序不透明）。"
    },
    {
      "word_to_compare": "equitable",
      "analysis": "“Equitable” (公平合理的) 是一个更正式、法律化的词汇，强调在资源或待遇分配上考虑个体差异以实现真正的公平，常用于司法或经济语境。而 “fair” 更口语化，泛指一般意义上的公正，不必然涉及复杂权衡。"
    },
    {
      "word_to_compare": "clear",
      "analysis": "“Clear” (晴朗的) 与 “fair” 在描述天气时可互换，但 “clear” 更强调无云、无遮挡的视觉状态，而 “fair” 还隐含了气候宜人、适合户外活动的综合评价。例如，天气可能 clear（无云）但很冷，不能称为 fair。"
    }
  ]
}