{
  "word": "fallen",
  "pronunciation": "faw·lən",
  "concise_definition": "adj. 倒下的, 堕落的, 阵亡的",
  "forms": {
    "base_form": "fall",
    "past_participle": "fallen",
    "present_participle": "falling"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having dropped or been brought down from a higher position, often due to gravity, force, or collapse; commonly used to describe objects, trees, or structures that have lost their upright state.",
      "explanation_cn": "指因重力、外力或坍塌而从较高位置跌落或倒下的状态，常用于描述物体、树木或建筑失去直立姿态的情形。",
      "example_en": "The fallen tree blocked the entire road after the storm.",
      "example_cn": "风暴过后，倒下的树木堵住了整条道路。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Having lost moral integrity, status, or virtue; often used to describe someone who has strayed from accepted social, religious, or ethical standards.",
      "explanation_cn": "指丧失了道德操守、社会地位或美德；常用于形容背离了公认的社会、宗教或伦理标准的人。",
      "example_en": "She was once a respected teacher but became a fallen woman after her scandal.",
      "example_cn": "她曾是一位受人尊敬的教师，但在丑闻后沦为堕落之人。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Killed in battle or as a result of military action; used as a respectful term for those who died in war.",
      "explanation_cn": "指在战斗中或因军事行动而阵亡的人；用作对战死者表示敬意的术语。",
      "example_en": "The memorial honors the fallen soldiers who gave their lives for their country.",
      "example_cn": "这座纪念碑纪念为国捐躯的阵亡将士。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "falling",
      "analysis": "“Falling” 是动词 “fall” 的现在分词，强调正在进行的下落动作，具有动态性；而 “fallen” 是过去分词，描述的是已经完成的、静态的结果状态。例如：The leaves are falling（叶子正在落下） vs. The leaves are fallen（叶子已经落下了）。"
    },
    {
      "word_to_compare": "defeated",
      "analysis": "“Defeated”（被击败的）强调在竞争、战斗或对抗中被战胜，侧重于过程和对手的胜利；而 “fallen” 在军事语境中更侧重于结果——死亡或倒下，不一定涉及直接的对抗过程，有时甚至用于非战斗死亡（如事故）。"
    },
    {
      "word_to_compare": "lost",
      "analysis": "“Lost”（失去的）含义广泛，可指人、物、机会或方向的消失，不特指死亡或倒下；而 “fallen” 在指人时具有强烈的牺牲与崇敬色彩，多用于战争语境，具有仪式性和情感重量，比 “lost” 更庄重、更具体。"
    }
  ]
}