{
  "word": "families",
  "pronunciation": "fam·uh·leez",
  "concise_definition": "n. 家庭, 家族, 亲属群体; (生物)科; (事物)类, 系列",
  "forms": {
    "singular": "family"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A group of people related by blood, marriage, or adoption, typically living together or maintaining close emotional ties, and often including parents and their children.",
      "explanation_cn": "指通过血缘、婚姻或收养关系联系在一起的一群人，通常共同生活或保持紧密的情感联系，常包括父母及其子女。",
      "example_en": "She comes from a large, close-knit family that gathers every Sunday for dinner.",
      "example_cn": "她来自一个庞大而紧密的家庭，每周日都会聚在一起吃晚饭。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of organisms in biology that share common characteristics and are classified together under a single taxonomic category, ranked above genus and below order.",
      "explanation_cn": "在生物学中，指具有共同特征并被归入同一分类单元（介于属与目之间）的一类生物。",
      "example_en": "The cat belongs to the Felidae family, which includes lions, tigers, and cheetahs.",
      "example_cn": "猫属于猫科，该科还包括狮子、老虎和猎豹。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of related things, especially objects, concepts, or systems that share a common structure, function, or origin.",
      "explanation_cn": "指具有共同结构、功能或起源的一组相关事物，尤指物品、概念或系统。",
      "example_en": "This car model is part of the SUV family, designed for off-road driving and spacious interiors.",
      "example_cn": "这款车型属于SUV系列，专为越野驾驶和宽敞内部空间设计。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "household",
      "analysis": "“Household”（家庭住户）强调的是共同居住和生活管理的单位，可能包括非亲属成员（如室友、佣人），侧重物理居住和经济共担；而 “family” 更强调血缘、情感或法律纽带，不一定同住。"
    },
    {
      "word_to_compare": "clan",
      "analysis": "“Clan”（氏族）通常指一个庞大、有共同祖先的血缘群体，常带有传统、地域或文化认同，多用于部落或历史语境；而 “family” 更小、更核心，通常指直系或近亲核心单位。"
    },
    {
      "word_to_compare": "group",
      "analysis": "“Group”（群体）是最泛化的词，泛指任何聚集在一起的人或物，无血缘、结构或功能上的必然联系；而 “families” 在生物学或语义学中特指具有系统性、分类性关联的集合，具有明确的内在一致性。"
    }
  ]
}