{
  "word": "fan",
  "pronunciation": "fan",
  "concise_definition": "n. 粉丝, 迷；扇子；风扇 v. 使通风, 扇风",
  "forms": {
    "plural": "fans"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who is greatly enthusiastic about or admires a particular person, activity, or thing, especially in the context of entertainment, sports, or culture.",
      "explanation_cn": "指对某个人、活动或事物（尤指娱乐、体育或文化领域）极为热衷或崇拜的人。",
      "example_en": "She's a huge fan of classical music and attends every concert she can.",
      "example_cn": "她是古典音乐的狂热粉丝，能参加的音乐会都去。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device used to create a current of air, typically powered by electricity, for cooling or ventilation.",
      "explanation_cn": "一种用于产生气流以实现降温或通风的装置，通常由电力驱动。",
      "example_en": "The room was hot, so she turned on the ceiling fan.",
      "example_cn": "房间很热，于是她打开了吊扇。"
    },
    {
      "pos": "noun",
      "explanation_en": "A handheld device, often made of feathers, paper, or plastic, used to create a breeze by waving it.",
      "explanation_cn": "一种手持装置，通常由羽毛、纸或塑料制成，通过挥动来制造微风。",
      "example_en": "She held a delicate silk fan to her face during the formal dinner.",
      "example_cn": "在正式晚宴上，她手持一把精致的丝绸扇子轻掩面庞。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move air by waving something back and forth, especially to cool someone or something.",
      "explanation_cn": "通过前后挥动某物来制造气流，尤指为某人或某物降温。",
      "example_en": "He fanned himself with a newspaper to stay cool in the summer heat.",
      "example_cn": "他在夏日酷热中用报纸扇风来降温。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to spread or intensify, often used metaphorically (e.g., to fan the flames of controversy).",
      "explanation_cn": "比喻性地指使某事物扩散或加剧，常用于描述煽动情绪、争议等。",
      "example_en": "The politician's speech fanned the flames of public anger.",
      "example_cn": "这位政治家的演讲激化了公众的愤怒情绪。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "enthusiast",
      "analysis": "“Enthusiast”（爱好者）是更正式、更中性的词，泛指对某事物有强烈兴趣的人，不局限于流行文化或体育领域。而 “fan” 更口语化，常带有情感强烈甚至狂热的色彩，尤其在流行文化语境中使用广泛。"
    },
    {
      "word_to_compare": "blower",
      "analysis": "“Blower”（鼓风机）是技术性术语，通常指工业或机械中用于强制送风的设备，强调功能而非家用或日常用途。而 “fan” 更通用，涵盖从家用吊扇到手持扇子的各种形式。"
    },
    {
      "word_to_compare": "ventilate",
      "analysis": "“Ventilate”（通风）是正式动词，指通过空气流通来改善室内空气质量，强调目的和效果。而 “fan” 作为动词时，仅指通过物理挥动制造气流，不涉及系统性空气交换，语义更具体、动作性更强。"
    }
  ]
}