{
  "word": "fanatic",
  "pronunciation": "fuh·nat·ik",
  "concise_definition": "n. 狂热者, 极端信徒; adj. 狂热的, 极端的",
  "forms": {
    "plural": "fanatics",
    "adjective_form": "fanatical"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who is filled with excessive and uncritical enthusiasm or zeal, especially for a religion, political cause, or sport, often to the point of irrationality or intolerance.",
      "explanation_cn": "指对宗教、政治事业或体育等事物抱有过度且不加批判的狂热热情的人，常常达到非理性或不容异见的程度。",
      "example_en": "The stadium was filled with fanatics chanting their team's anthem at the top of their lungs.",
      "example_cn": "体育场里挤满了狂热的球迷，高声齐唱球队的队歌。"
    },
    {
      "pos": "noun",
      "explanation_en": "Someone who adheres rigidly to a belief or practice, often rejecting compromise or alternative viewpoints, and may act in extreme ways to promote it.",
      "explanation_cn": "指固守某种信仰或做法，拒绝妥协或接受其他观点，甚至可能采取极端行为来推动其主张的人。",
      "example_en": "He was labeled a fanatic by his critics for refusing to accept any scientific evidence contradicting his theory.",
      "example_cn": "由于拒绝接受任何与他理论相悖的科学证据，他被批评者称为狂热者。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by excessive, irrational enthusiasm or devotion; describing behavior or attitudes that are extreme and often unreasonable.",
      "explanation_cn": "形容充满过度、非理性热情或狂热 devotion 的；描述极端且常常不合理的言行或态度。",
      "example_en": "Her fanatical commitment to fitness left no room for rest or social life.",
      "example_cn": "她对健身的狂热投入使她没有余地休息或参与社交生活。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "enthusiast",
      "analysis": "“Enthusiast”（爱好者）指对某事物有强烈兴趣和热情的人，但通常保持理性与适度，不带有极端或偏执色彩。而 “fanatic” 则带有贬义，强调非理性、排他性和极端行为。"
    },
    {
      "word_to_compare": "zealot",
      "analysis": "“Zealot”（狂信者）与 “fanatic” 非常接近，常可互换，但 “zealot” 更强调宗教或意识形态上的极端忠诚，常带有历史或政治语境，如古代犹太教的狂热派别。而 “fanatic” 使用范围更广，可涵盖体育、时尚、科技等领域。"
    },
    {
      "word_to_compare": "devotee",
      "analysis": "“Devotee”（信徒/追随者）指对某人、某事物或某种信仰有深厚忠诚和奉献的人，通常为中性或褒义，如艺术的追随者、宗教的虔诚信徒。而 “fanatic” 则隐含过度、失控甚至危险的意味，带有明显负面评价。"
    }
  ]
}