{
  "word": "fantasy",
  "pronunciation": "fan·tuh·zee",
  "concise_definition": "n. 幻想, 想象, 虚构作品",
  "forms": {
    "plural": "fantasies"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An idea or image formed in the mind that is not based on reality, often involving wishful thinking, daydreaming, or imaginative scenarios.",
      "explanation_cn": "指在脑海中形成的、不基于现实的想法或意象，通常涉及愿望投射、白日梦或富有想象力的情景。",
      "example_en": "He spent the entire meeting lost in fantasy, imagining himself as a famous actor.",
      "example_cn": "他整个会议期间都沉浸在幻想中，想象自己是一位著名演员。"
    },
    {
      "pos": "noun",
      "explanation_en": "A genre of literature, film, or other media characterized by magical elements, mythical creatures, and imaginary worlds, often set in a fictional universe.",
      "explanation_cn": "指一种文学、电影或其他媒体体裁，以魔法元素、神话生物和虚构世界为特征，通常设定在一个虚构的宇宙中。",
      "example_en": "The Lord of the Rings is a classic example of high fantasy.",
      "example_cn": "《指环王》是奇幻文学的经典范例。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sexual fantasy: a mentally imagined scenario involving sexual activity, often used to enhance arousal or emotional connection.",
      "explanation_cn": "指一种性幻想：在脑海中想象的涉及性行为的情景，常用于增强性唤起或情感联系。",
      "example_en": "She admitted to having a fantasy about traveling the world with someone she loved.",
      "example_cn": "她承认自己曾幻想过与所爱之人周游世界。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "imagination",
      "analysis": "“Imagination”（想象力）是更广泛的心理能力，指创造或重组思想、图像和概念的能力，不一定是脱离现实的。而 “fantasy” 是想象力的一种具体表现形式，特指脱离现实、带有强烈情感或愿望色彩的虚构内容。"
    },
    {
      "word_to_compare": "dream",
      "analysis": "“Dream”（梦）可以指睡眠中的无意识心理活动，也可以指对未来的希望或抱负（如 ‘a dream come true’）。而 “fantasy” 更强调清醒状态下的主动想象，通常带有逃避现实或满足欲望的倾向，不必然与未来目标相关。"
    },
    {
      "word_to_compare": "fiction",
      "analysis": "“Fiction”（虚构作品）是文学或艺术的体裁类别，泛指非真实的故事，包括现实主义小说、科幻、奇幻等。而 “fantasy” 是 fiction 的一个子类，特指包含超自然或魔法元素的虚构类型。一个作品可以是 fiction 但不是 fantasy，但所有 fantasy 都属于 fiction。"
    }
  ]
}