{
  "word": "fat",
  "pronunciation": "fat",
  "concise_definition": "n. 脂肪, 油脂; adj. 肥胖的, 肥腻的, 丰厚的",
  "forms": {
    "comparative": "fatter",
    "superlative": "fattest"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A type of lipid found in animals and plants, used for energy storage and insulation, often associated with body weight and diet.",
      "explanation_cn": "动植物体内的一种脂质，用于能量储存和保温，常与体重和饮食相关。",
      "example_en": "The recipe calls for two tablespoons of butter fat.",
      "example_cn": "这个食谱需要两汤匙黄油脂肪。"
    },
    {
      "pos": "noun",
      "explanation_en": "Excess body tissue composed of adipose cells, typically resulting in overweight or obesity.",
      "explanation_cn": "由脂肪细胞组成的多余身体组织，通常导致超重或肥胖。",
      "example_en": "He lost twenty pounds of fat through regular exercise and a balanced diet.",
      "example_cn": "他通过规律锻炼和均衡饮食减掉了二十磅脂肪。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Having a large amount of body fat; overweight or plump.",
      "explanation_cn": "体内脂肪过多的；超重或丰满的。",
      "example_en": "The cat had become fat after months of indoor living and treats.",
      "example_cn": "这只猫在数月的室内生活和频繁喂食后变得肥胖了。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Rich in grease or oil; having a thick, creamy texture or flavor.",
      "explanation_cn": "富含油脂的；具有浓稠、奶油般的质地或风味。",
      "example_en": "She preferred the fat cuts of beef for their juiciness and flavor.",
      "example_cn": "她更喜欢脂肪含量高的牛肉部位，因为它们多汁且风味浓郁。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Abundant, prosperous, or lucrative; often used to describe financial or material gains.",
      "explanation_cn": "丰富的、繁荣的或有利可图的；常用于描述财务或物质收益。",
      "example_en": "He landed a fat contract with the multinational corporation.",
      "example_cn": "他与这家跨国公司签了一份丰厚的合同。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "oil",
      "analysis": "“Oil” (油) 通常指液态的脂类物质，如植物油或矿物油，多用于烹饪、润滑或工业用途。而 “fat” 通常指固态或半固态的脂质，尤其在生物体内或食物中。两者化学结构相似，但物理状态和常见语境不同。"
    },
    {
      "word_to_compare": "chubby",
      "analysis": "“Chubby” (圆润的) 是一个较温和、常带亲昵意味的词，用于形容人（尤其是儿童）轻微丰满的体态，不具贬义。而 “fat” 更直接、中性或带有负面评价，尤其在描述成人时可能被视为冒犯。"
    },
    {
      "word_to_compare": "plump",
      "analysis": "“Plump” (丰满的) 与 “fat” 都可形容体态，但 “plump” 更强调健康、圆润的美感，常用于描述脸颊、胸部或水果的饱满状态，语气较温和。而 “fat” 更强调脂肪堆积，可能隐含不健康或过度的含义。"
    }
  ]
}