{
  "word": "faults",
  "pronunciation": "fawltz",
  "concise_definition": "n. 缺点, 过错, 故障, 断层",
  "forms": {
    "singular": "fault"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A personal weakness or imperfection in character, behavior, or ability that detracts from overall quality or effectiveness.",
      "explanation_cn": "指在性格、行为或能力上的个人弱点或缺陷，会降低整体品质或效能。",
      "example_en": "One of his few faults is his tendency to be overly critical of others.",
      "example_cn": "他为数不多的缺点之一是倾向于过分批评他人。"
    },
    {
      "pos": "noun",
      "explanation_en": "An error, mistake, or failure to meet a standard or responsibility, often implying blame or accountability.",
      "explanation_cn": "指违反标准或未能履行责任的错误或过失，通常带有责备或问责的含义。",
      "example_en": "The accident was caused by human fault, not mechanical failure.",
      "example_cn": "这起事故是由人为过失造成的，而非机械故障。"
    },
    {
      "pos": "noun",
      "explanation_en": "A malfunction or breakdown in a machine, system, or electrical circuit that prevents it from operating correctly.",
      "explanation_cn": "指机器、系统或电路中发生的故障或失灵，导致其无法正常运行。",
      "example_en": "There was a power fault in the building, and all the lights went out.",
      "example_cn": "大楼发生了电路故障，所有灯都熄灭了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A fracture or break in the earth's crust along which movement has occurred, often causing earthquakes.",
      "explanation_cn": "指地壳中发生过位移的断裂带，常引发地震。",
      "example_en": "The city lies near a major geological fault line.",
      "example_cn": "这座城市位于一条主要的地质断层附近。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "defect",
      "analysis": "“Defect” (缺陷) 通常指产品、系统或设计中固有的、结构性的不足，多用于技术或制造语境，强调客观存在的瑕疵。而 “fault” 更广泛，可指人为错误、性格弱点或突发故障，带有更多主观或责任色彩。"
    },
    {
      "word_to_compare": "mistake",
      "analysis": "“Mistake” (错误) 通常指因疏忽、误解或判断失误而发生的偶然性错误，多用于行为或决策层面，不必然涉及责任或长期缺陷。而 “fault” 更强调应被归咎的过失，常含道德或制度性批评。"
    },
    {
      "word_to_compare": "flaw",
      "analysis": "“Flaw” (瑕疵) 多用于描述事物内在的、细微的不完美，常用于艺术、材料或性格分析，语气较温和，不具强烈责备意味。而 “fault” 更直接指向可归责的缺点或故障，语义更重。"
    },
    {
      "word_to_compare": "error",
      "analysis": "“Error” (错误) 是最中性的术语，广泛用于科学、数学、技术领域，指与正确标准的偏差，不隐含道德评判。而 “fault” 常带有责任归属和批评意味，尤其在人际关系或系统问责中使用更频繁。"
    }
  ]
}