{
  "word": "favour",
  "pronunciation": "fey·vur",
  "concise_definition": "n. 好感, 偏爱, 恩惠; v. 偏爱, 支持, 有利于",
  "forms": {
    "third_person_singular": "favours",
    "past_tense": "favoured",
    "past_participle": "favoured",
    "present_participle": "favouring",
    "plural": "favours"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A positive attitude or preference shown toward someone or something, often resulting in preferential treatment or support.",
      "explanation_cn": "对某人或某事物表现出的积极态度或偏好，常导致给予特别优待或支持。",
      "example_en": "She has always shown favour to her youngest son, giving him more attention and resources.",
      "example_cn": "她一直偏爱最小的儿子，给予他更多的关注和资源。"
    },
    {
      "pos": "noun",
      "explanation_en": "An act of kindness or help given voluntarily, often creating a sense of obligation in the recipient.",
      "explanation_cn": "自愿给予的善意或帮助行为，通常会使接受者产生一种欠人情的感觉。",
      "example_en": "Can you do me a favour and pick up my package from the post office?",
      "example_cn": "你能帮我个忙，去邮局取一下我的包裹吗？"
    },
    {
      "pos": "verb",
      "explanation_en": "To treat one person, group, or thing more favourably than others, often unfairly or due to personal bias.",
      "explanation_cn": "对某人、某群体或某事物给予比其他人或事物更优厚的待遇，常因个人偏见而显得不公平。",
      "example_en": "The hiring manager was accused of favouring candidates from his alma mater.",
      "example_cn": "这位招聘经理被指控偏袒自己母校的毕业生。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be advantageous to or promote the success or development of something.",
      "explanation_cn": "对某事物有利，促进其成功或发展。",
      "example_en": "Warm weather favours the growth of tropical plants.",
      "example_cn": "温暖的气候有利于热带植物的生长。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "preference",
      "analysis": "“Preference” (偏好) 指一种明确的选择倾向，通常是基于个人喜好或理性判断，不必然涉及行为上的优待。而 “favour” 不仅表示偏好，还常包含实际的行动支持或利益倾斜，语义更重、更具互动性。"
    },
    {
      "word_to_compare": "benefit",
      "analysis": "“Benefit” (利益/好处) 是一个中性词，指任何带来正面效果的事物，不包含主观偏爱的含义。而 “favour” 强调主观的偏袒或恩惠行为，带有情感或道德色彩，常隐含权力或关系的不对等。"
    },
    {
      "word_to_compare": "support",
      "analysis": "“Support” (支持) 是一个更广泛、更中性的词，可指情感、经济、逻辑或行动上的援助，不一定包含偏袒。而 “favour” 常带有不公平或选择性支持的意味，尤其在正式语境中可能带有贬义。"
    }
  ]
}