{
  "word": "favours",
  "pronunciation": "fay·vurz",
  "concise_definition": "n. 偏爱, 偏袒, 恩惠; v. 偏爱, 支持, 给予优惠",
  "forms": {
    "singular": "favour",
    "third_person_singular": "favours",
    "past_tense": "favoured",
    "past_participle": "favoured",
    "present_participle": "favouring"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A preference or partiality shown toward someone or something, often at the expense of fairness or equality.",
      "explanation_cn": "对某人或某事物表现出的偏爱或偏向，通常以牺牲公平或平等为代价。",
      "example_en": "The judge was accused of showing favours to the defendant's family.",
      "example_cn": "这位法官被指控对被告的家人有所偏袒。"
    },
    {
      "pos": "noun",
      "explanation_en": "A kind act or service done for someone, often as a personal courtesy or to build goodwill.",
      "explanation_cn": "为某人所做的一件善意行为或帮助，通常出于个人情面或为了建立良好关系。",
      "example_en": "Can you do me a favour and pick up my package from the post office?",
      "example_cn": "你能帮我个忙，去邮局取一下我的包裹吗？"
    },
    {
      "pos": "verb",
      "explanation_en": "To treat someone or something with preference or partiality, often giving them an advantage over others.",
      "explanation_cn": "对某人或某事物给予偏爱或偏向，通常使其获得相对于他人的优势。",
      "example_en": "The policy favours large corporations over small businesses.",
      "example_cn": "这项政策偏向大型企业，而非小型企业。"
    },
    {
      "pos": "verb",
      "explanation_en": "To support or promote someone or something, especially in a public or official context.",
      "explanation_cn": "支持或促进某人或某事物，尤其在公共或官方场合中。",
      "example_en": "The government favours renewable energy sources to reduce carbon emissions.",
      "example_cn": "政府支持可再生能源以减少碳排放。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "prefer",
      "analysis": "“Prefer” (更喜欢) 强调主观上的倾向或选择，通常用于表达个人喜好，不必然涉及权力或资源的倾斜。而 “favour” 不仅包含偏好，还常隐含实际的优待、特权或行动支持，具有更强的社会或制度性含义。"
    },
    {
      "word_to_compare": "support",
      "analysis": "“Support” (支持) 是一个更广泛、中性的词，可指情感、经济、逻辑或行动上的援助，不一定带有偏袒色彩。而 “favour” 常带有不公平或选择性支持的负面含义，尤其在涉及权力分配时。"
    },
    {
      "word_to_compare": "benefit",
      "analysis": "“Benefit” (受益) 是一个结果性词汇，指某人从某种行为或政策中获得好处，本身不包含主动偏爱的含义。而 “favour” 强调施动者主动给予好处，带有意图性和选择性。"
    }
  ]
}