{
  "word": "favored",
  "pronunciation": "fey·vurd",
  "concise_definition": "adj. 受偏爱的, 受优待的, 优先的",
  "forms": {
    "base_form": "favor",
    "comparative": "favored",
    "superlative": "most favored"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Given preferential treatment, advantage, or approval over others; chosen or preferred because of perceived superiority, loyalty, or benefit.",
      "explanation_cn": "相较于其他人或事物，获得优先待遇、优势或认可；因被认为更优秀、更值得信赖或更有益而被选中或偏爱。",
      "example_en": "She was the favored candidate for the promotion due to her outstanding performance.",
      "example_cn": "由于她出色的表现，她成为晋升的首选人选。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Designed, arranged, or adjusted to provide an advantage to a particular person, group, or option, often in a way that may seem unfair to others.",
      "explanation_cn": "为某个人、群体或选项提供优势而特别设计、安排或调整的，有时可能对其他人显得不公平。",
      "example_en": "The tax policy was criticized as being overly favored toward wealthy corporations.",
      "example_cn": "这项税收政策因过度偏向大型企业而受到批评。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Worn or used more often because of personal preference or habitual choice, especially in the context of clothing or equipment.",
      "explanation_cn": "因个人偏好或习惯性选择而更常穿着或使用的，尤其用于衣物或装备。",
      "example_en": "He always wore his favored pair of sneakers for long runs.",
      "example_cn": "他每次长跑都穿自己最钟爱的那双运动鞋。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "preferred",
      "analysis": "“Preferred” (更偏爱的) 与 “favored” 意义高度重叠，都表示选择倾向。但 “preferred” 更中性，常用于正式语境中表达理性选择（如偏好调查、选项对比），而 “favored” 常隐含情感或权力结构带来的偏袒，可能带有不公平的意味。"
    },
    {
      "word_to_compare": "privileged",
      "analysis": "“Privileged” (享有特权的) 强调因身份、地位或制度而获得的特殊权利或优势，通常与社会阶层、法律或系统性不平等相关。而 “favored” 更侧重于个体或群体在具体情境中被偏爱，不一定涉及结构性特权。"
    },
    {
      "word_to_compare": "biased",
      "analysis": "“Biased” (有偏见的) 是一个贬义词，指因偏见而做出不公正的判断或选择，强调主观性和非理性。而 “favored” 可以是中性或褒义（如被偏爱的员工），只有在语境中暗示不公时才接近 “biased” 的负面含义。"
    }
  ]
}