{
  "word": "fay",
  "pronunciation": "fay",
  "concise_definition": "n. 精灵, 仙女; v. (古语) 变成精灵",
  "forms": {
    "plural": "fays",
    "third_person_singular": "fays",
    "past_tense": "fayed",
    "past_participle": "fayed",
    "present_participle": "faying"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A mythical, often beautiful and magical being from European folklore, typically depicted as a small, winged female spirit with supernatural powers, associated with nature, enchantment, or fairy tales.",
      "explanation_cn": "源自欧洲民间传说中的一种神话生物，通常被描绘为拥有超自然力量、体型娇小、长有翅膀的女性精灵，与自然、魔法或童话故事密切相关。",
      "example_en": "The children believed the fay lived in the ancient oak tree and granted wishes to those who left her offerings.",
      "example_cn": "孩子们相信仙女住在那棵古橡树里，会给那些留下供品的人实现愿望。"
    },
    {
      "pos": "noun",
      "explanation_en": "A poetic or archaic term for a fairy, often used in literature to evoke a sense of wonder, mystery, or otherworldly beauty.",
      "explanation_cn": "文学中用于唤起惊奇、神秘或超凡美感的诗意或古语词汇，常作为 'fairy' 的同义词使用。",
      "example_en": "In the old ballad, the fay danced beneath the moonlight, her voice weaving spells into the wind.",
      "example_cn": "在那首古老的民谣中，仙女在月光下起舞，她的歌声将咒语编织进风中。"
    },
    {
      "pos": "verb",
      "explanation_en": "Archaic usage: To turn into a fairy or to be enchanted or transformed by fairy magic.",
      "explanation_cn": "古语用法：指变成精灵，或被精灵魔法施法而变形。",
      "example_en": "The knight, cursed by the sorceress, fayed into a silver stag at dawn.",
      "example_cn": "骑士被女巫诅咒，黎明时分化作了一头银色的雄鹿。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fairy",
      "analysis": "“Fairy” 是现代英语中最常用的词，泛指童话中的小精灵，语义更广泛、更口语化；而 “fay” 更具文学性、古雅色彩，常用于诗歌或古典文学中，带有更强的神秘感和历史厚重感。"
    },
    {
      "word_to_compare": "sprite",
      "analysis": "“Sprite” (小精灵/水精) 通常指更轻盈、更抽象的灵体，常与水、风或元素力量相关，不一定具有女性形象或魔法施法者身份；而 “fay” 更强调其作为童话中具有人格、情感和意志的智慧生物，常与人类互动。"
    },
    {
      "word_to_compare": "nymph",
      "analysis": "“Nymph” (宁芙) 源自希腊罗马神话，是自然界的女性神灵，如树精、水精，通常与特定自然元素绑定，具有神性而非纯粹的魔法生物；而 “fay” 属于凯尔特或中世纪欧洲民间传说体系，更接近魔法生物而非神祇，且常具人类形态。"
    }
  ]
}