{
  "word": "fear",
  "pronunciation": "feer",
  "concise_definition": "n. 恐惧, 害怕; v. 害怕, 担忧",
  "forms": {
    "third_person_singular": "fears",
    "past_tense": "feared",
    "past_participle": "feared",
    "present_participle": "fearing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An unpleasant emotion caused by the belief that someone or something is dangerous, likely to cause pain, or a threat.",
      "explanation_cn": "由认为某人或某物危险、可能造成痛苦或构成威胁而产生的不愉快情绪。",
      "example_en": "She felt a sudden fear when she heard the loud noise behind her.",
      "example_cn": "当她听到身后传来巨大的响声时，突然感到一阵恐惧。"
    },
    {
      "pos": "noun",
      "explanation_en": "A strong dislike or aversion to something, often used in compound expressions to describe reluctance or avoidance.",
      "explanation_cn": "对某事物的强烈反感或厌恶，常用于复合词中表达回避或不愿面对的态度。",
      "example_en": "He has a fear of public speaking and avoids any events where he must talk in front of others.",
      "example_cn": "他害怕公开演讲，因此避免参加任何需要在众人面前发言的活动。"
    },
    {
      "pos": "verb",
      "explanation_en": "To feel afraid of or anxious about something, especially something that might happen in the future.",
      "explanation_cn": "对某事感到害怕或焦虑，尤指可能在未来发生的事情。",
      "example_en": "I fear that we won't finish the project on time.",
      "example_cn": "我担心我们无法按时完成这个项目。"
    },
    {
      "pos": "verb",
      "explanation_en": "To have deep respect or reverence for someone, often due to their authority or power (archaic or formal usage).",
      "explanation_cn": "因某人的权威或权力而心怀深深的敬畏（古语或正式用法）。",
      "example_en": "The subjects feared their king as a just but formidable ruler.",
      "example_cn": "臣民们敬畏他们的国王，认为他是一位公正而威严的统治者。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "terror",
      "analysis": "“Terror”（恐怖）比 “fear” 程度更强，通常指极端、压倒性的恐惧，常伴随生理反应如颤抖或瘫痪。它多用于描述灾难、暴力或超自然情境下的极端情绪，而 “fear” 是更通用、程度较轻的词。"
    },
    {
      "word_to_compare": "anxiety",
      "analysis": "“Anxiety”（焦虑）侧重于对未来不确定性的持续担忧，常无明确对象，是一种心理紧张状态；而 “fear” 通常针对具体、可识别的威胁，情绪反应更直接、更强烈。"
    },
    {
      "word_to_compare": "dread",
      "analysis": "“Dread”（畏惧）强调对即将发生之事的预期性恐惧，带有沉重、压抑的心理负担，常用于描述明知某事可怕却无法避免的情形。它比 “fear” 更具持续性和心理深度，语气更文学化。"
    }
  ]
}