{
  "word": "fears",
  "pronunciation": "feers",
  "concise_definition": "n. 恐惧, 害怕, 担忧 (为 fear 的复数形式)",
  "forms": {
    "singular": "fear"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An unpleasant emotion caused by the belief that someone or something is dangerous, likely to cause pain, or a threat, often accompanied by physical symptoms such as increased heart rate or sweating.",
      "explanation_cn": "一种因相信某人或某物具有危险性、可能造成痛苦或构成威胁而产生的不愉快情绪，常伴随心跳加速、出汗等生理反应。",
      "example_en": "Her fears of public speaking kept her from applying for the promotion.",
      "example_cn": "她对公开演讲的恐惧使她不敢申请晋升。"
    },
    {
      "pos": "noun",
      "explanation_en": "Plural form used to refer to multiple distinct anxieties or phobias that a person experiences, often reflecting deep-seated concerns about different aspects of life.",
      "explanation_cn": "复数形式，用于指一个人所经历的多种不同焦虑或恐惧症，通常反映其对生活中不同方面的深层担忧。",
      "example_en": "His fears—of failure, rejection, and being alone—have shaped his cautious approach to relationships.",
      "example_cn": "他的种种恐惧——对失败、被拒绝和孤独的恐惧——塑造了他在人际关系中的谨慎态度。"
    },
    {
      "pos": "noun",
      "explanation_en": "A general term for collective anxieties shared by a group or society, often influencing behavior, policy, or cultural norms.",
      "explanation_cn": "泛指群体或社会共同持有的焦虑情绪，常影响行为、政策或文化规范。",
      "example_en": "In the aftermath of the attack, national fears about security surged.",
      "example_cn": "袭击发生后，全国上下对安全的担忧急剧上升。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "anxiety",
      "analysis": "“Anxiety” (焦虑) 更侧重于一种持续的、模糊的、对未来不确定性的担忧，常缺乏明确的对象；而 “fears” 通常指向具体、可识别的威胁或对象，情绪强度更高，更直接。"
    },
    {
      "word_to_compare": "apprehension",
      "analysis": "“Apprehension” (忧虑) 是一种较温和、较理性的预感或担心，常带有预期坏事即将发生的意味，但不一定伴随强烈的情绪反应；而 “fears” 更情绪化、更本能，常伴随生理反应和强烈的心理压力。"
    },
    {
      "word_to_compare": "terror",
      "analysis": "“Terror” (恐怖) 是恐惧的极端形式，通常指瞬间的、压倒性的、几乎令人瘫痪的强烈恐惧；而 “fears” 可涵盖从轻微担忧到重度恐惧的广泛程度，语义范围更广，语气更中性。"
    }
  ]
}