{
  "word": "feast",
  "pronunciation": "fest",
  "concise_definition": "n. 盛宴, 节日聚餐; v. 举办盛宴, 痛饮, 大快朵颐",
  "forms": {
    "third_person_singular": "feasts",
    "past_tense": "feasted",
    "past_participle": "feasted",
    "present_participle": "feasting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A large, elaborate, and often celebratory meal, typically involving an abundance of food and drink, held for special occasions such as holidays, weddings, or religious events.",
      "explanation_cn": "指为特殊场合（如节日、婚礼或宗教庆典）举办的丰盛、隆重的宴席，通常包含大量食物和饮品。",
      "example_en": "The royal family hosted a grand feast to celebrate the king's coronation.",
      "example_cn": "王室举办了一场盛大的宴会，以庆祝国王加冕。"
    },
    {
      "pos": "noun",
      "explanation_en": "A period of celebration or enjoyment, especially one marked by indulgence in food, drink, or other pleasures.",
      "explanation_cn": "指一段充满欢庆与享受的时期，尤指以饮食或其他享乐为标志的时光。",
      "example_en": "The festival was a feast of music, art, and local cuisine.",
      "example_cn": "这个节日是一场音乐、艺术与地方美食的盛宴。"
    },
    {
      "pos": "verb",
      "explanation_en": "To eat or drink to one's heart's content, especially in a lavish or indulgent manner.",
      "explanation_cn": "指尽情享用食物或饮品，尤指以奢侈或放纵的方式大快朵颐。",
      "example_en": "They feasted on roasted lamb, fresh bread, and sweet wine until late into the night.",
      "example_cn": "他们大快朵颐，享用烤羊肉、新鲜面包和甜酒，直到深夜。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provide or host a large, elaborate meal for guests.",
      "explanation_cn": "指为宾客举办一场盛大而隆重的宴席。",
      "example_en": "The host feasted his guests with a twelve-course dinner.",
      "example_cn": "主人为宾客准备了一顿十二道菜的晚餐。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "banquet",
      "analysis": "“Banquet”（宴会）与 “feast” 非常接近，都指正式的大型聚餐，但 “banquet” 更强调仪式性、组织性和社交目的，常用于官方或商业场合；而 “feast” 更具情感色彩，常与节日、宗教或民间庆祝相关，语气更热烈、更富生活气息。"
    },
    {
      "word_to_compare": "meal",
      "analysis": "“Meal”（一餐）是中性、通用词，泛指任何日常进食，如早餐、午餐，无规模或隆重程度的暗示。而 “feast” 则特指远超日常的丰盛、奢侈的饮食体验，具有强烈的夸张和庆祝意味。"
    },
    {
      "word_to_compare": "buffet",
      "analysis": "“Buffet”（自助餐）强调用餐形式——食物摆放在桌上，由客人自行取用。它是一种服务方式，不必然意味着丰盛或庆祝。而 “feast” 强调的是食物的丰富性与享受的深度，无论用餐形式如何，只要内容盛大即可称为 feast。"
    }
  ]
}