{
  "word": "feather",
  "pronunciation": "feth·er",
  "concise_definition": "n. 羽毛, 羽状物; v. 用羽毛装饰, 使轻如羽毛, 用羽毛填充",
  "forms": {
    "plural": "feathers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A lightweight, flat structure made of keratin that grows from the skin of birds, used primarily for flight, insulation, and display.",
      "explanation_cn": "由角蛋白构成的轻质、扁平结构，生长于鸟类皮肤上，主要用于飞行、保温和展示。",
      "example_en": "The peacock's iridescent feathers shimmer in the sunlight.",
      "example_cn": "孔雀绚丽的羽毛在阳光下闪闪发光。"
    },
    {
      "pos": "noun",
      "explanation_en": "A very light weight or a small amount of something, often used metaphorically to describe something insubstantial or delicate.",
      "explanation_cn": "指极轻的重量或极小的数量，常用于比喻某物轻盈、微不足道或纤细。",
      "example_en": "She has the weight of a feather, barely noticeable on the scale.",
      "example_cn": "她轻如鸿毛，秤上几乎感觉不到她的重量。"
    },
    {
      "pos": "noun",
      "explanation_en": "A thin, flat object resembling a feather in shape or texture, such as a feather duster or a feather-shaped decoration.",
      "explanation_cn": "指形状或质地类似羽毛的薄而扁平的物体，如羽毛掸子或羽毛形装饰品。",
      "example_en": "He used a feather to dust the antique books gently.",
      "example_cn": "他用羽毛掸子轻轻拂去古籍上的灰尘。"
    },
    {
      "pos": "verb",
      "explanation_en": "To decorate or line something with feathers, often for aesthetic or functional purposes.",
      "explanation_cn": "用羽毛装饰或衬里某物，通常出于审美或功能目的。",
      "example_en": "The hat was feathered with ostrich plumes for a dramatic effect.",
      "example_cn": "这顶帽子用鸵鸟羽毛装饰，以产生戏剧性的效果。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fill or line a container (such as a pillow or jacket) with feathers for softness and insulation.",
      "explanation_cn": "用羽毛填充或衬里容器（如枕头或夹克），以增加柔软性和保暖性。",
      "example_en": "They feathered the quilt with goose down for extra warmth.",
      "example_cn": "他们用鹅绒填充被子以增加保暖性。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make something lighter or smoother, especially by adding fine layers or reducing weight gradually.",
      "explanation_cn": "使某物变得更轻或更平滑，尤其通过添加细薄层或逐步减轻重量。",
      "example_en": "The pilot feathered the throttle to reduce speed smoothly.",
      "example_cn": "飞行员轻柔地调节油门以平稳减速。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "plume",
      "analysis": "“Plume”（羽饰）特指鸟类身上长而华丽的羽毛，尤其用于装饰，如鸵鸟或孔雀的尾羽。它比 “feather” 更强调装饰性、视觉冲击力和高贵感，常用于文学或时尚语境。而 “feather” 是通用词，涵盖所有鸟类的羽毛，包括普通、实用的类型。"
    },
    {
      "word_to_compare": "down",
      "analysis": "“Down”（绒毛）指鸟类胸腹部柔软、蓬松、无羽轴的细小绒毛，主要用于保温。它比 “feather” 更轻、更柔软，常用于填充物（如羽绒服）。而 “feather” 通常指有坚硬羽轴的结构，用于飞行或支撑。两者虽同属鸟类体表覆盖物，但结构和用途截然不同。"
    },
    {
      "word_to_compare": "hair",
      "analysis": "“Hair”（毛发）是哺乳动物皮肤上的角蛋白纤维，质地较硬、有弹性，用于保温或感知环境。而 “feather” 仅存在于鸟类，结构更扁平、轻盈，具有空气动力学功能。两者虽都属体表覆盖物，但生物来源、结构和功能完全不同，不可互换。"
    }
  ]
}