{
  "word": "fed",
  "pronunciation": "fed",
  "concise_definition": "adj. 被喂养的, 被供养的; v. (feed 的过去式和过去分词) 喂养, 供给",
  "forms": {
    "base_form": "feed",
    "third_person_singular": "feeds",
    "present_participle": "feeding",
    "past_tense": "fed",
    "past_participle": "fed"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To give food to a person or animal, especially regularly or in a caring manner.",
      "explanation_cn": "指给人或动物提供食物，通常指有规律地或以关怀的方式进行喂养。",
      "example_en": "She fed the baby a bottle of warm milk before bedtime.",
      "example_cn": "她睡前给婴儿喂了一瓶温热的牛奶。"
    },
    {
      "pos": "verb",
      "explanation_en": "To supply or provide something necessary for growth, operation, or continuation, often abstractly (e.g., information, energy, emotion).",
      "explanation_cn": "指为某事物的生长、运行或持续提供必要的支持，常用于抽象事物（如信息、能量、情感）。",
      "example_en": "The constant stream of news feeds his curiosity about world events.",
      "example_cn": "源源不断的消息满足了他对世界事件的好奇心。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to burn or continue burning by supplying fuel or oxygen.",
      "explanation_cn": "指通过提供燃料或氧气使某物燃烧或持续燃烧。",
      "example_en": "The wind fed the flames, making the fire spread rapidly.",
      "example_cn": "风助长了火势，使火焰迅速蔓延。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used informally to describe someone who is well-fed, well-nourished, or even overfed, often implying a state of comfort or satisfaction.",
      "explanation_cn": "非正式用法，形容人营养充足、吃得很好，有时隐含满足或安逸的状态。",
      "example_en": "The fed cat lay sprawled on the windowsill, purring contentedly.",
      "example_cn": "那只吃饱的猫懒洋洋地躺在窗台上，心满意足地呼噜着。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "feed",
      "analysis": "“Feed” 是动词原形，强调动作本身；而 “fed” 是其过去式和过去分词形式，用于描述已完成的喂养行为或作为形容词描述状态。例如：I feed the dog every morning（我每天早上喂狗） vs. The dog was fed at 7 a.m.（狗在早上七点被喂了）。"
    },
    {
      "word_to_compare": "nourish",
      "analysis": "“Nourish” 更强调提供营养以促进健康生长或发展，常用于生理或精神层面的深层滋养，语气更正式、更积极。而 “fed” 更中性，仅表示提供食物，不必然包含健康或成长的含义。"
    },
    {
      "word_to_compare": "supply",
      "analysis": "“Supply” 是更广泛的词，指提供任何所需物品或资源（如水、电力、信息），不限于食物或能量。“Fed” 专指通过食物或燃料进行供给，语义范围更窄、更具体。"
    }
  ]
}