{
  "word": "feeder",
  "pronunciation": "fed·er",
  "concise_definition": "n. 喂食器, 供料器, 供电源, 投资者",
  "forms": {
    "plural": "feeders"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A device or container designed to hold and dispense food or liquid, especially for animals or infants.",
      "explanation_cn": "一种用于存放并分配食物或液体的装置或容器，尤其用于动物或婴儿。",
      "example_en": "The bird feeder outside the window was filled with sunflower seeds.",
      "example_cn": "窗外的鸟食器里装满了葵花籽。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or entity that supplies something regularly, such as raw materials, power, or information to a system or process.",
      "explanation_cn": "指定期向系统或流程提供某种资源（如原材料、电力或信息）的人或实体。",
      "example_en": "The hydroelectric plant relies on the river as its main feeder.",
      "example_cn": "这座水力发电厂依赖这条河流作为主要的供水源。"
    },
    {
      "pos": "noun",
      "explanation_en": "In finance, a person who provides capital or funds to an investment, often with little expectation of direct control or involvement.",
      "explanation_cn": "在金融领域，指提供资本或资金给某项投资的人，通常不期望直接参与控制或管理。",
      "example_en": "The startup attracted several wealthy feeders who provided seed funding.",
      "example_cn": "这家初创公司吸引了几位富有的投资者提供种子资金。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who encourages or enables another’s bad behavior, often by providing resources or attention.",
      "explanation_cn": "指通过提供资源或关注来纵容或助长他人不良行为的人。",
      "example_en": "He’s not the real problem—he’s just a feeder for the gang’s reckless spending.",
      "example_cn": "他不是真正的问题所在，他只是在为帮派的挥霍无度提供资金支持。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "supplier",
      "analysis": "“Supplier”（供应商）泛指提供任何商品或服务的实体，语义更广泛，常用于商业供应链中，强调交易关系。而 “feeder” 更强调持续性、单向性地为某个系统或对象提供输入，常带有被动或依附的语义色彩，如电力系统、动物喂食器等。"
    },
    {
      "word_to_compare": "donor",
      "analysis": "“Donor”（捐赠者）特指无偿提供资源（如血液、器官、资金）的人，强调利他性和慈善性质。而 “feeder” 可以是无偿的，也可以是出于利益驱动，且更侧重于“持续供给”而非“一次性给予”。"
    },
    {
      "word_to_compare": "source",
      "analysis": "“Source”（来源）是一个更抽象、更通用的词，指任何事物的起源或起点，可以是自然的、抽象的或隐喻的（如信息来源、灵感来源）。而 “feeder” 更具体，通常指物理或功能性的输入通道，具有明确的输送机制。"
    }
  ]
}