{
  "word": "fellow",
  "pronunciation": "fel·oh",
  "concise_definition": "n. 同事, 同伴, 人士, 会员",
  "forms": {
    "plural": "fellows"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who is associated with another in the same group, activity, or situation, often implying camaraderie or shared experience.",
      "explanation_cn": "指与他人处于同一团体、活动或情境中的人，常暗示着友谊、共同经历或相互认同。",
      "example_en": "He's a fellow teacher at the same high school.",
      "example_cn": "他是同一所高中的另一位老师。"
    },
    {
      "pos": "noun",
      "explanation_en": "A man or person (often used in a somewhat old-fashioned or formal context), especially when referring to someone in a professional or academic role.",
      "explanation_cn": "指男性或泛指某人（常用于略显陈旧或正式的语境），尤其用于指从事专业或学术工作的人。",
      "example_en": "He was elected a fellow of the Royal Society.",
      "example_cn": "他被选为英国皇家学会会员。"
    },
    {
      "pos": "noun",
      "explanation_en": "A member of a scholarly or professional organization, especially one granted a title of distinction (e.g., in universities or research institutions).",
      "explanation_cn": "指学术或专业组织的成员，尤指被授予荣誉称号者（如大学或研究机构中的‘院士’或‘研究员’）。",
      "example_en": "As a fellow of the Institute for Advanced Study, she conducts groundbreaking research.",
      "example_cn": "作为高等研究院的研究员，她从事着开创性的研究。"
    },
    {
      "pos": "noun",
      "explanation_en": "An informal way to refer to a man, sometimes with a tone of familiarity or mild condescension.",
      "explanation_cn": "非正式地指代男性，有时带有亲切或轻微轻蔑的语气。",
      "example_en": "That fellow over there is always late for meetings.",
      "example_cn": "那边那个家伙总是开会迟到。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "companion",
      "analysis": "“Companion”（同伴）强调长期陪伴或共同经历的关系，常带有情感纽带，如旅行伴侣或生活伙伴。而 “fellow” 更侧重于身份或处境的共同性，不一定有亲密情感，如同事、同僚。"
    },
    {
      "word_to_compare": "colleague",
      "analysis": "“Colleague”（同事）专指在同一机构或职业环境中工作的人，语义更正式、专业，且仅限于职业关系。而 “fellow” 可用于更广泛的情境，包括非职业性的群体，甚至可泛指任何人。"
    },
    {
      "word_to_compare": "mate",
      "analysis": "“Mate”（伙伴）在英式英语中常用于非正式场合，指朋友或同伴，语气更随意、口语化，有时含性别中立性（如澳大利亚用法）。而 “fellow” 更中性或略带正式感，且在美式英语中更常见，有时带有轻微疏离或讽刺意味。"
    }
  ]
}