{
  "word": "fellowships",
  "pronunciation": "fel·oh·ships",
  "concise_definition": "n. 院士身份, 研究资助, 同仁关系",
  "forms": {
    "singular": "fellowship"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A grant or stipend awarded to support advanced study, research, or professional training, often given by academic institutions, foundations, or governments to outstanding individuals.",
      "explanation_cn": "指由学术机构、基金会或政府授予杰出个人的资助或津贴，用于支持高级学习、研究或专业培训。",
      "example_en": "She was awarded a prestigious fellowship to conduct postdoctoral research at Harvard.",
      "example_cn": "她获得了一项声望卓著的奖学金，前往哈佛大学从事博士后研究。"
    },
    {
      "pos": "noun",
      "explanation_en": "A position or status held by a member of a learned society or professional organization, often denoting expertise and recognition in a field.",
      "explanation_cn": "指某人在学术团体或专业组织中所拥有的成员身份或头衔，通常表示其在某一领域内的专业造诣和认可。",
      "example_en": "He is a fellow of the Royal Society, one of the highest honors in science.",
      "example_cn": "他是英国皇家学会的会士，这是科学界最高的荣誉之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sense of mutual understanding, camaraderie, or shared experience among people with similar interests or backgrounds.",
      "explanation_cn": "指具有相似兴趣或背景的人之间所形成的相互理解、友谊或共同经历的感觉。",
      "example_en": "There was a strong fellowship among the volunteers who worked together during the disaster relief effort.",
      "example_cn": "在灾难救援工作中并肩作战的志愿者们之间建立了深厚的同仁情谊。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "scholarship",
      "analysis": "“Scholarship”（奖学金）通常指为支持学生学业而提供的经济资助，尤其针对本科或研究生阶段的学习，强调经济援助和学术表现。而 “fellowship” 更侧重于支持高级研究或专业发展，常附带研究职责、学术地位或机构成员身份，更具专业性和声望。"
    },
    {
      "word_to_compare": "grant",
      "analysis": "“Grant”（拨款）是一个更广泛的术语，泛指任何为特定项目或目的提供的资金支持，可来自政府、企业或非营利组织，用途不限于学术研究。而 “fellowship” 是一种特定类型的资助，通常与个人发展、学术身份或研究职位绑定，具有更强的选拔性和荣誉性。"
    },
    {
      "word_to_compare": "membership",
      "analysis": "“Membership”（会员资格）仅指成为某个组织的成员，可能不伴随资金支持或研究义务。而 “fellowship” 不仅意味着成员身份，还常包含经济支持、研究资源、学术责任和专业认可，是一种更高层次的、综合性的荣誉性职位。"
    }
  ]
}