{
  "word": "fellowship",
  "pronunciation": "fel·ow·ship",
  "concise_definition": "n. 同仁关系, 伙伴关系, 奖学金, 修士身份",
  "forms": {
    "plural": "fellowships"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A close relationship or bond among people who share common interests, beliefs, or goals, often characterized by mutual support, camaraderie, and shared experience.",
      "explanation_cn": "指具有共同兴趣、信仰或目标的人们之间建立的亲密关系，通常以相互支持、友谊和共同经历为特征。",
      "example_en": "The alumni reunion rekindled a deep sense of fellowship among former classmates.",
      "example_cn": "校友重聚重新唤起了昔日同学之间深厚的同窗情谊。"
    },
    {
      "pos": "noun",
      "explanation_en": "A grant or financial aid awarded to support advanced study or research, typically given to students or scholars by universities or foundations.",
      "explanation_cn": "指由大学或基金会授予学生或学者，用于支持高级学习或研究的奖学金或资助。",
      "example_en": "She was awarded a prestigious fellowship to study neuroscience at Harvard.",
      "example_cn": "她获得了一项 prestigious 奖学金，前往哈佛大学研究神经科学。"
    },
    {
      "pos": "noun",
      "explanation_en": "The status or position of a fellow, especially in an academic or professional institution such as a college or learned society.",
      "explanation_cn": "指在学术或专业机构（如学院或学会）中担任‘院士’或‘研究员’的身份或职位。",
      "example_en": "He was elected a fellow of the Royal Society for his groundbreaking work in physics.",
      "example_cn": "他因在物理学领域的开创性研究当选为英国皇家学会院士。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "friendship",
      "analysis": "“Friendship”（友谊）强调个人之间基于情感、信任和喜爱的亲密关系，通常是非正式、非制度化的。而 “fellowship” 更强调因共同目标、信仰或身份（如学术、宗教、职业）而形成的群体性联结，范围更广，更具结构性。"
    },
    {
      "word_to_compare": "association",
      "analysis": "“Association”（协会/联系）侧重于组织或机构层面的正式联系，可能缺乏情感纽带。而 “fellowship” 不仅包含组织关系，更强调成员间的情感共鸣与精神共鸣，常带有温暖、归属感的色彩。"
    },
    {
      "word_to_compare": "scholarship",
      "analysis": "“Scholarship”（奖学金）作为名词时，仅指学术资助，是 “fellowship” 的一个子类。而 “fellowship” 除了指经济资助外，还包含身份、社群和学术共同体的含义，内涵更丰富。在某些语境中，fellowship 是比 scholarship 更高级、更全面的学术荣誉。"
    }
  ]
}