{
  "word": "fence",
  "pronunciation": "fens",
  "concise_definition": "n. 篱笆, 围栏; v. 围栏, 搭围栏, 模棱两可地说话",
  "forms": {
    "plural": "fences",
    "third_person_singular": "fences",
    "past_tense": "fenced",
    "past_participle": "fenced",
    "present_participle": "fencing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A structure made of wood, metal, or other materials, erected to mark boundaries, provide privacy, or prevent access to an area.",
      "explanation_cn": "由木材、金属或其他材料建造的结构，用于标记边界、提供隐私或阻止他人进入某一区域。",
      "example_en": "The children played safely inside the backyard, protected by a white wooden fence.",
      "example_cn": "孩子们在后院安全地玩耍，周围有白色木制围栏保护。"
    },
    {
      "pos": "verb",
      "explanation_en": "To surround or enclose an area with a fence or barrier.",
      "explanation_cn": "用篱笆或屏障围住或封闭某一区域。",
      "example_en": "They fenced the entire property to keep the dogs from running away.",
      "example_cn": "他们把整个地产围上了围栏，以防狗跑掉。"
    },
    {
      "pos": "verb",
      "explanation_en": "To avoid giving a direct answer or taking a clear position, often by speaking ambiguously or evasively; to hedge.",
      "explanation_cn": "通过模棱两可或回避的方式避免给出明确答复或表明立场；即‘打马虎眼’。",
      "example_en": "During the interview, the politician fenced with questions about tax reform, refusing to commit to any specific plan.",
      "example_cn": "在采访中，这位政客对有关税制改革的问题避而不答，拒绝承诺任何具体方案。"
    },
    {
      "pos": "noun",
      "explanation_en": "The sport of fighting with swords, especially foil, épée, or sabre, governed by specific rules and techniques.",
      "explanation_cn": "一种使用剑（如花剑、重剑或佩剑）进行的体育运动，遵循特定规则和技术。",
      "example_en": "She has been training in fencing since she was eight and now competes internationally.",
      "example_cn": "她八岁起就开始练习击剑，如今已参加国际比赛。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hedge",
      "analysis": "“Hedge” 作为动词时，与 “fence” 在‘回避立场’的含义上高度相似，但 “hedge” 更常用于抽象语境，强调用模糊语言规避责任或承诺，如 ‘hedge your bets’。而 “fence” 在此用法中更口语化，且常用于描述政治或谈判中的回避行为。"
    },
    {
      "word_to_compare": "barrier",
      "analysis": "“Barrier” (障碍) 是一个更广泛的术语，泛指任何阻止通行或接触的物体或抽象障碍（如语言、文化障碍），而 “fence” 特指一种物理的、通常为线性结构的围栏，具有明确的建造目的和边界功能。"
    },
    {
      "word_to_compare": "wall",
      "analysis": "“Wall” (墙) 通常指更高、更坚固、连续的实体结构，常用于建筑中分隔空间或提供防御，如砖墙或混凝土墙。而 “fence” 一般较矮、透光、结构较轻，主要用于界定范围而非完全隔绝。"
    }
  ]
}