{
  "word": "feng",
  "pronunciation": "feng",
  "concise_definition": "n. 风, 风格, 风俗",
  "forms": {
    "plural": "fengs"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A natural movement of air, often characterized by its speed, direction, and effect on the environment; a fundamental element in Chinese philosophy and traditional medicine.",
      "explanation_cn": "指空气的自然流动，常以其速度、方向及其对环境的影响为特征；在中国哲学和传统医学中，风是基本元素之一。",
      "example_en": "The feng blew through the valley, rustling the leaves and carrying the scent of pine.",
      "example_cn": "风穿过山谷，吹得树叶沙沙作响，带来了松树的香气。"
    },
    {
      "pos": "noun",
      "explanation_en": "A distinctive style, trend, or manner characteristic of a particular time, place, or group, especially in culture, fashion, or behavior.",
      "explanation_cn": "指某一特定时代、地域或群体所特有的风格、潮流或方式，尤指在文化、时尚或行为方面。",
      "example_en": "The feng of the Tang Dynasty was marked by openness and artistic flourishing.",
      "example_cn": "唐代的风尚以开放和艺术繁荣为特征。"
    },
    {
      "pos": "noun",
      "explanation_en": "In Chinese cosmology, feng refers to wind as one of the two components of 'feng shui' (wind and water), representing the invisible forces that influence harmony and energy flow in space.",
      "explanation_cn": "在中国宇宙观中，风是‘风水’（风与水）的两个组成部分之一，代表影响空间和谐与能量流动的无形力量。",
      "example_en": "According to feng shui principles, the placement of doors and windows must align with the flow of feng.",
      "example_cn": "根据风水原则，门窗的布局必须与风的流向相协调。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "wind",
      "analysis": "“Wind” 是英语中表示自然空气流动的标准词，强调物理现象，常用于科学或日常语境。而 “feng” 是汉语拼音转写，承载着深厚的文化、哲学和象征意义，尤其在“风水”等术语中具有不可替代的语义深度。"
    },
    {
      "word_to_compare": "style",
      "analysis": "“Style” 是英语中表示风格、方式的通用词，涵盖艺术、穿着、写作等广泛领域，但缺乏“feng”所蕴含的传统文化与自然力量的双重意涵。在描述中国语境下的社会风尚时，“feng”更具文化特异性。"
    },
    {
      "word_to_compare": "custom",
      "analysis": "“Custom” (风俗) 指长期形成的习惯或传统行为，偏重社会规范和仪式。“Feng” 在表示“风尚”时更强调流行趋势、时代气质和审美倾向，具有更强的动态性和文化氛围感，常与“俗”（su）并用为“风俗”（fēngsú）。"
    }
  ]
}