{
  "word": "fermentation",
  "pronunciation": "fur·men·tay·shun",
  "concise_definition": "n. 发酵, 发酵作用",
  "forms": {
    "plural": "fermentations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A metabolic process in which microorganisms such as yeast or bacteria convert sugars into alcohol, gases, or acids, often used in food and beverage production.",
      "explanation_cn": "一种代谢过程，其中酵母或细菌等微生物将糖类转化为酒精、气体或酸类，常用于食品和饮料的生产。",
      "example_en": "The fermentation of grapes produces wine, while the fermentation of barley creates beer.",
      "example_cn": "葡萄的发酵产生葡萄酒，而大麦的发酵则制成啤酒。"
    },
    {
      "pos": "noun",
      "explanation_en": "A process of chemical change in organic substances caused by the action of enzymes or microorganisms, leading to the production of new compounds and flavors.",
      "explanation_cn": "有机物质在酶或微生物作用下发生的化学变化过程，导致新化合物和风味的产生。",
      "example_en": "Fermentation of soybeans is essential in making traditional soy sauce and miso.",
      "example_cn": "大豆的发酵是制作传统酱油和味噌的关键步骤。"
    },
    {
      "pos": "noun",
      "explanation_en": "A state of vigorous activity or excitement, often used metaphorically to describe a period of intense social, political, or cultural change.",
      "explanation_cn": "一种充满活力或激动的状态，常用于比喻社会、政治或文化剧烈变革的时期。",
      "example_en": "The 1960s were a time of political fermentation in many countries.",
      "example_cn": "20世纪60年代，许多国家都处于政治变革的激荡之中。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "decay",
      "analysis": "“Decay” (腐烂/衰败) 指物质因微生物作用而分解、变质，通常带有负面含义，强调破坏和失去原有价值。而 “fermentation” 是一种受控的、有目的的生物化学过程，常用于生产有益产品，如酒、酸奶等，具有建设性。"
    },
    {
      "word_to_compare": "distillation",
      "analysis": "“Distillation” (蒸馏) 是一种物理分离过程，通过加热和冷凝来提纯液体（如酒精或水），不涉及微生物或化学转化。而 “fermentation” 是一种生物化学过程，依赖微生物代谢产生新物质，两者在机制和目的上完全不同。"
    },
    {
      "word_to_compare": "aging",
      "analysis": "“Aging” (陈化/熟成) 指物质在时间作用下缓慢发生物理或化学变化，以改善风味或质地（如奶酪、威士忌的陈酿），通常不依赖活跃的微生物活动。而 “fermentation” 是一个主动的、快速的生物反应过程，是陈化的前提阶段。"
    }
  ]
}