{
  "word": "festivals",
  "pronunciation": "fes·tuh·vuhls",
  "concise_definition": "n. 节日, 庆典, 节庆活动",
  "forms": {
    "singular": "festival"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A special event or period of celebration, often organized around a cultural, religious, seasonal, or artistic theme, featuring music, dance, food, rituals, or public gatherings.",
      "explanation_cn": "指围绕文化、宗教、季节或艺术主题而举办的特殊庆祝活动或时期，通常包括音乐、舞蹈、美食、仪式或公众集会。",
      "example_en": "The Cannes Film Festival attracts filmmakers and celebrities from around the world.",
      "example_cn": "戛纳电影节吸引了来自世界各地的电影人和名人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A recurring annual or seasonal event that brings communities together to honor traditions, mark important dates, or express collective joy and identity.",
      "explanation_cn": "指每年或每季定期举行、将社区凝聚在一起以纪念传统、标示重要日期或表达集体喜悦与身份认同的活动。",
      "example_en": "Diwali, the Festival of Lights, is celebrated by millions across India with lamps, fireworks, and sweets.",
      "example_cn": "排灯节，又称光明节，是印度数百万民众以灯盏、烟花和甜点庆祝的节日。"
    },
    {
      "pos": "noun",
      "explanation_en": "A gathering or series of events centered on a specific art form, such as film, music, literature, or theater, often featuring performances, exhibitions, and competitions.",
      "explanation_cn": "指围绕某一特定艺术形式（如电影、音乐、文学或戏剧）举办的集会或系列活动，通常包括演出、展览和比赛。",
      "example_en": "The Edinburgh International Festival showcases world-class theater, opera, and classical music.",
      "example_cn": "爱丁堡国际艺术节展出了世界级的戏剧、歌剧和古典音乐。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "celebration",
      "analysis": "“Celebration” (庆祝活动) 是一个更宽泛的词，泛指任何形式的欢庆行为，可以是私人或小规模的（如生日派对），而 “festival” 通常指公共的、有组织的、持续数日甚至更久的大型庆典，具有更强的文化或传统背景。"
    },
    {
      "word_to_compare": "holiday",
      "analysis": "“Holiday” (假日/假期) 主要指法定休息日或脱离工作的时间，重点在于休息和休假，不一定包含庆祝活动。而 “festival” 强调的是庆祝、仪式和集体参与，即使不放假，也可以是节日。例如，音乐节不是法定假日，但仍是 festival。"
    },
    {
      "word_to_compare": "ceremony",
      "analysis": "“Ceremony” (仪式) 指具有固定程序和象征意义的正式活动，通常庄重、严肃，如婚礼、授勋仪式。而 “festival” 更强调欢乐、开放和大众参与，虽然可能包含仪式环节，但整体氛围更轻松、多样和娱乐化。"
    }
  ]
}