{
  "word": "fibers",
  "pronunciation": "fahy·buhrz",
  "concise_definition": "n. 纤维, 纤维状物, 纤维素",
  "forms": {
    "singular": "fiber"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Thin, thread-like structures found in plants, animals, or synthetic materials, often used for making textiles, ropes, or dietary components.",
      "explanation_cn": "存在于植物、动物或合成材料中的细丝状结构，常用于制造纺织品、绳索或作为膳食纤维成分。",
      "example_en": "Cotton is a natural fiber widely used in clothing due to its softness and breathability.",
      "example_cn": "棉花是一种天然纤维，因其柔软和透气性而被广泛用于服装制造。"
    },
    {
      "pos": "noun",
      "explanation_en": "In nutrition, indigestible plant material that aids digestion and promotes bowel health, commonly found in fruits, vegetables, and whole grains.",
      "explanation_cn": "在营养学中，指人体无法消化的植物性物质，有助于消化和促进肠道健康，常见于水果、蔬菜和全谷物中。",
      "example_en": "Eating foods rich in dietary fibers can help reduce the risk of heart disease and diabetes.",
      "example_cn": "食用富含膳食纤维的食物有助于降低患心脏病和糖尿病的风险。"
    },
    {
      "pos": "noun",
      "explanation_en": "A structural component of a material that gives it strength or flexibility, especially in composites such as carbon fiber or fiberglass.",
      "explanation_cn": "指材料中赋予其强度或柔韧性的结构成分，尤其在复合材料中，如碳纤维或玻璃纤维。",
      "example_en": "The airplane's frame is reinforced with carbon fibers to reduce weight while maintaining durability.",
      "example_cn": "飞机的框架使用碳纤维加固，以在保持耐久性的同时减轻重量。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "filament",
      "analysis": "“Filament”（细丝）通常指更细、更均匀、常用于电子或光学设备中的单根线状结构，如灯泡中的钨丝或蚕丝。而 “fiber” 更广泛，可指天然或人造的、具有一定长度和强度的纤维状物质，用途更广，包括纺织、建筑和营养领域。"
    },
    {
      "word_to_compare": "strand",
      "analysis": "“Strand”（股、缕）强调由多个纤维或线组成的单股结构，常用于描述头发、绳索或DNA链。它通常是纤维的集合体，而 “fiber” 是构成 strand 的基本单元。例如，一根绳子由多个 strand 组成，每个 strand 又由许多 fiber 编织而成。"
    },
    {
      "word_to_compare": "thread",
      "analysis": "“Thread”（线）通常指用于缝纫或编织的细长线材，是经过加工、捻合后的纤维产物，具有明确的用途导向（如缝衣服）。而 “fiber” 是未加工的原始材料，是 thread 的原料。因此，fiber 是原材料，thread 是制成品。"
    }
  ]
}