{
  "word": "fight",
  "pronunciation": "fahyt",
  "concise_definition": "v. 战斗, 争斗, 抗争; n. 战斗, 争斗, 打架",
  "forms": {
    "third_person_singular": "fights",
    "past_tense": "fought",
    "past_participle": "fought",
    "present_participle": "fighting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To engage in physical combat or violent conflict with an opponent, typically with the intent to defeat or harm.",
      "explanation_cn": "与对手进行身体上的搏斗或暴力冲突，通常旨在击败或伤害对方。",
      "example_en": "The soldiers fought bravely to defend their homeland.",
      "example_cn": "士兵们英勇战斗，保卫自己的祖国。"
    },
    {
      "pos": "verb",
      "explanation_en": "To struggle or contend against an obstacle, injustice, or difficult condition, often with determination and perseverance.",
      "explanation_cn": "为对抗某种障碍、不公或困难处境而努力抗争，通常带有决心和毅力。",
      "example_en": "She has been fighting for equal rights for over two decades.",
      "example_cn": "她为争取平等权利已经奋斗了二十多年。"
    },
    {
      "pos": "verb",
      "explanation_en": "To argue or quarrel intensely with someone, often emotionally or verbally.",
      "explanation_cn": "与某人激烈争吵或争执，通常带有情绪或言语上的对抗。",
      "example_en": "They fought all night about where to go on vacation.",
      "example_cn": "他们为去哪里度假吵了一整晚。"
    },
    {
      "pos": "noun",
      "explanation_en": "A physical or violent confrontation between two or more parties, often involving force or aggression.",
      "explanation_cn": "两个或多个方之间发生的身体或暴力对抗，通常涉及武力或攻击性行为。",
      "example_en": "The bar fight broke out after a heated argument over a game of pool.",
      "example_cn": "在一场关于台球比赛的激烈争论后，酒吧里爆发了斗殴。"
    },
    {
      "pos": "noun",
      "explanation_en": "A prolonged struggle or campaign against a problem, system, or ideology, often used metaphorically.",
      "explanation_cn": "为对抗某个问题、制度或意识形态而进行的长期斗争，常用于比喻意义。",
      "example_en": "The fight against climate change requires global cooperation.",
      "example_cn": "应对气候变化的斗争需要全球合作。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "battle",
      "analysis": "“Battle” (战役/战斗) 通常指规模更大、更组织化、有明确目标的武装冲突，常用于军事语境；而 “fight” 更通用，可指任何形式的冲突，包括个人间的打斗或抽象的抗争。此外，“battle” 更强调过程的结构性，而 “fight” 更强调动作本身。"
    },
    {
      "word_to_compare": "quarrel",
      "analysis": "“Quarrel” (争吵) 专指言语上的争执，通常情绪化但不涉及身体暴力，程度较轻；而 “fight” 可包含身体冲突，语义范围更广。当用作动词时，“quarrel” 多与介词 “with” 搭配，而 “fight” 可直接接宾语。"
    },
    {
      "word_to_compare": "struggle",
      "analysis": "“Struggle” (挣扎/奋斗) 更强调在困难或阻力中付出巨大努力，常用于抽象语境（如生存、经济、心理斗争），语气更沉重、持久；而 “fight” 更具对抗性和主动性，常带有明确的敌人或目标，语义更直接有力。"
    }
  ]
}