{
  "word": "figure",
  "pronunciation": "fig·yoor",
  "concise_definition": "n. 数字, 人物, 图形, 轮廓; v. 认为, 计算, 体现",
  "forms": {
    "plural": "figures"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A numerical value or amount, especially one used in statistics, finance, or data representation.",
      "explanation_cn": "指用于统计、金融或数据表示中的数值或数量。",
      "example_en": "The company reported a 15% increase in its quarterly figures.",
      "example_cn": "该公司报告其季度数据增长了15%。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person of importance or prominence, especially in a particular field or society.",
      "explanation_cn": "指在特定领域或社会中具有重要性或知名度的人物。",
      "example_en": "She is a public figure known for her advocacy in climate change.",
      "example_cn": "她是一位因倡导气候变化问题而知名的公众人物。"
    },
    {
      "pos": "noun",
      "explanation_en": "A shape, diagram, or symbol, especially one used in mathematics, art, or design.",
      "explanation_cn": "指在数学、艺术或设计中使用的形状、图表或符号。",
      "example_en": "The figure of a circle is fundamental in geometry.",
      "example_cn": "圆形的图形是几何学中的基本元素。"
    },
    {
      "pos": "noun",
      "explanation_en": "The outline or form of a person or object, especially when seen from a distance or in a vague way.",
      "explanation_cn": "指人或物体的轮廓或外形，尤其在远处或模糊状态下可见的形态。",
      "example_en": "In the fog, we could just make out the figure of a man standing by the gate.",
      "example_cn": "在雾中，我们只能依稀看到门口站着一个人影。"
    },
    {
      "pos": "verb",
      "explanation_en": "To think, believe, or assume something, often based on incomplete information.",
      "explanation_cn": "指基于不完整的信息进行思考、相信或假设某事。",
      "example_en": "I figured he would be late, given how traffic always is on Fridays.",
      "example_cn": "我想他会迟到，毕竟周五的交通总是这样。"
    },
    {
      "pos": "verb",
      "explanation_en": "To calculate or determine a result using mathematical reasoning.",
      "explanation_cn": "指通过数学推理进行计算或得出结果。",
      "example_en": "We need to figure out how much the project will cost.",
      "example_cn": "我们需要算出这个项目会花多少钱。"
    },
    {
      "pos": "verb",
      "explanation_en": "To embody or represent a quality, idea, or concept in a visible or symbolic way.",
      "explanation_cn": "指以可见或象征的方式体现某种品质、思想或概念。",
      "example_en": "He figures the ideal of perseverance in everything he does.",
      "example_cn": "他在所做的每一件事中都体现了坚持不懈的精神。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "number",
      "analysis": "“Number” (数字) 仅指抽象的数学符号或计数单位，如 5、100，不包含形状、人物或象征意义。而 “figure” 除了数字含义外，还可指人物、图形或轮廓，语义范围更广。"
    },
    {
      "word_to_compare": "statue",
      "analysis": "“Statue” (雕像) 是指具体、实体化的三维人或动物形象，通常为艺术作品。而 “figure” 的轮廓或形象含义更抽象，可以是模糊的、非实体的，甚至仅指视觉印象。"
    },
    {
      "word_to_compare": "symbol",
      "analysis": "“Symbol” (符号) 是一种代表抽象概念的标记，如心形代表爱，十字代表基督教。而 “figure” 作为图形时，更偏向于可识别的形状（如三角形、人形），不一定承载深层象征意义，除非语境明确。"
    },
    {
      "word_to_compare": "calculate",
      "analysis": "“Calculate” (计算) 是一个更正式、技术性的动词，专指通过数学方法得出精确结果。而 “figure” 在表示计算时更口语化，常用于日常语境，且可包含估算或推理，不强调精确性。"
    }
  ]
}