{
  "word": "figures",
  "pronunciation": "fig·yoorz",
  "concise_definition": "n. 数字, 人物, 图形, 形象",
  "forms": {
    "singular": "figure"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A numerical value or symbol representing a quantity, especially in mathematical, financial, or statistical contexts.",
      "explanation_cn": "指数值或符号，用于表示数量，尤其在数学、金融或统计语境中。",
      "example_en": "The company's annual figures show a 15% increase in profits.",
      "example_cn": "该公司年度数据表明利润增长了15%。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person of importance or prominence, especially in a particular field or society; often used to describe public or historical personalities.",
      "explanation_cn": "指在特定领域或社会中具有重要性或知名度的人物，常用于描述公众人物或历史人物。",
      "example_en": "She is a leading figure in the environmental movement.",
      "example_cn": "她是环保运动中的重要人物。"
    },
    {
      "pos": "noun",
      "explanation_en": "A shape, diagram, or visual representation, especially in geometry, art, or data visualization.",
      "explanation_cn": "指形状、图表或视觉表现，尤其在几何、艺术或数据可视化中。",
      "example_en": "The textbook includes several figures to explain the theory of relativity.",
      "example_cn": "这本教科书包含多个图形以解释相对论。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person's physical appearance or silhouette, especially when referring to body shape or posture.",
      "explanation_cn": "指一个人的外形或轮廓，尤其用于描述体型或姿态。",
      "example_en": "She has a slender figure and carries herself with grace.",
      "example_cn": "她身材苗条，举止优雅。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "numbers",
      "analysis": "“Numbers” (数字) 是 “figures” 在数值含义上的近义词，但更通用、更口语化，常指单纯的计数或算术值。而 “figures” 更常用于正式或专业语境，如财务报告、统计数据，有时还隐含分析或解读的意味。"
    },
    {
      "word_to_compare": "personality",
      "analysis": "“Personality” (个性/人物) 强调一个人的性格特征和内在特质，而 “figure” 在指人时更侧重其社会地位、公众形象或影响力，不一定涉及性格细节。例如，一个政治家是 ‘a public figure’，但未必是 ‘a charismatic personality’。"
    },
    {
      "word_to_compare": "diagrams",
      "analysis": "“Diagrams” (图解) 是一种特定类型的图形，通常用于说明结构、流程或关系，具有标准化的符号和布局。而 “figures” 是更宽泛的术语，可包括图表、插图、照片、几何图形等，涵盖范围更广。"
    },
    {
      "word_to_compare": "silhouette",
      "analysis": "“Silhouette” (剪影) 专指物体或人形的外轮廓，通常为黑色或单色，强调外形而非细节。而 “figure” 在描述体型时，可包含比例、姿态、甚至穿着等更丰富的视觉信息，语义更全面。"
    }
  ]
}