{
  "word": "filing",
  "pronunciation": "fahy·ling",
  "concise_definition": "n. 归档, 文件提交, 磨光; v. 提交 (文件), 归档, 磨削",
  "forms": {
    "plural": "filings",
    "third_person_singular": "files",
    "past_tense": "filed",
    "past_participle": "filed",
    "present_participle": "filing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act or process of submitting official documents to a government office or legal authority, especially for record-keeping or legal compliance.",
      "explanation_cn": "指将官方文件提交给政府机构或法律部门以供存档或满足法律要求的行为或过程。",
      "example_en": "She completed the tax filing before the April deadline.",
      "example_cn": "她在四月截止日期前完成了报税申报。"
    },
    {
      "pos": "noun",
      "explanation_en": "A collection of documents that have been organized and stored systematically, often in a physical or digital archive.",
      "explanation_cn": "指经过系统整理并存储的文件集合，通常以实体或数字档案形式保存。",
      "example_en": "The lawyer requested access to the client's entire filing cabinet.",
      "example_cn": "律师要求查阅客户完整的档案柜。"
    },
    {
      "pos": "noun",
      "explanation_en": "The material removed by a file (a tool) during the process of smoothing or shaping a surface, especially metal or wood.",
      "explanation_cn": "指使用锉刀（工具）打磨或塑形表面（尤其是金属或木材）时所去除的碎屑。",
      "example_en": "The carpenter swept up the wood filings after finishing the table.",
      "example_cn": "木匠在完成桌子后清扫了木屑。"
    },
    {
      "pos": "verb",
      "explanation_en": "To submit or register official documents with an authority, such as a court, tax office, or registry.",
      "explanation_cn": "指向法院、税务机关或登记处等权威机构提交或注册官方文件。",
      "example_en": "He filed for divorce last week.",
      "example_cn": "他上周提交了离婚申请。"
    },
    {
      "pos": "verb",
      "explanation_en": "To organize and store documents systematically in a file or archive.",
      "explanation_cn": "指有条理地整理并存档文件。",
      "example_en": "Please file the contracts in numerical order.",
      "example_cn": "请按编号顺序归档合同。"
    },
    {
      "pos": "verb",
      "explanation_en": "To smooth or shape a surface by rubbing it with a file, typically to remove small amounts of material.",
      "explanation_cn": "指用锉刀摩擦表面以使其光滑或塑形，通常用于去除少量材料。",
      "example_en": "The mechanic filed down the rough edge of the metal plate.",
      "example_cn": "机械师用锉刀磨平了金属板的毛边。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "documentation",
      "analysis": "“Documentation” (文件记录) 指所有形式的书面或电子记录，强调信息的完整性和系统性，是一个广义术语。而 “filing” 更侧重于文件的提交、归档或整理行为，是文档管理中的一个具体操作环节。"
    },
    {
      "word_to_compare": "submission",
      "analysis": "“Submission” (提交) 是一个更通用的词，泛指任何形式的呈交行为，如提交论文、申请或报告，不一定涉及官方存档。而 “filing” 特指将文件正式提交给权威机构并纳入档案系统，具有法律或行政程序的含义。"
    },
    {
      "word_to_compare": "grinding",
      "analysis": "“Grinding” (研磨) 是一种更粗暴、更剧烈的材料去除方式，常用于工业加工，使用砂轮或研磨机。而 “filing” 是使用锉刀进行的精细、手工的表面修整，去除量小，精度更高，常用于金属加工或木工的最后修饰。"
    }
  ]
}