{
  "word": "find",
  "pronunciation": "fahynd",
  "concise_definition": "v. 找到, 发现, 觉得, 获得",
  "forms": {
    "third_person_singular": "finds",
    "past_tense": "found",
    "past_participle": "found",
    "present_participle": "finding"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To discover or locate something that was lost, hidden, or not previously known, often through effort or search.",
      "explanation_cn": "指通过努力或搜寻，发现或找到原本丢失、隐藏或未知的事物。",
      "example_en": "She found her keys under the sofa after searching for an hour.",
      "example_cn": "她在沙发底下找了整整一个小时，终于找到了钥匙。"
    },
    {
      "pos": "verb",
      "explanation_en": "To come upon or encounter something unexpectedly or by chance, especially information, a person, or a situation.",
      "explanation_cn": "指偶然或意外地遇到某物，尤指信息、人或某种情况。",
      "example_en": "While browsing the library, he found an old manuscript that changed his research direction.",
      "example_cn": "他在图书馆浏览时，偶然发现了一份旧手稿，彻底改变了他研究的方向。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form an opinion or judgment about something, often followed by an object complement (e.g., 'find it difficult').",
      "explanation_cn": "指对某事物形成看法或判断，常接宾语补足语（如 'find it difficult'）。",
      "example_en": "I find this movie incredibly boring, but my sister loves it.",
      "example_cn": "我觉得这部电影非常无聊，但我妹妹却很喜欢。"
    },
    {
      "pos": "verb",
      "explanation_en": "To obtain or acquire something, especially after effort or as a result of a process.",
      "explanation_cn": "指经过努力或某种过程后获得某物。",
      "example_en": "The team found enough funding to launch the project next year.",
      "example_cn": "团队成功获得了足够的资金，以便明年启动该项目。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "discover",
      "analysis": "“Discover” (发现) 强调首次认识到或揭示出之前未知的事物，常用于科学、地理或抽象概念的突破性认知，带有“揭示真相”的意味。而 “find” 更侧重于实际的寻找或定位，不一定涉及全新认知，可能是找回已知但丢失的东西。"
    },
    {
      "word_to_compare": "locate",
      "analysis": "“Locate” (定位) 更强调精确确定某物的空间位置，常用于地图、技术或地理语境，语气更客观、技术性更强。而 “find” 更通用，可包含情感、判断或偶然性，不一定涉及空间定位。"
    },
    {
      "word_to_compare": "realize",
      "analysis": "“Realize” (意识到) 指在心理或认知层面突然明白或领悟某个事实或道理，是内在思维过程的结果。而 “find” 可以是外在的发现或获取，也可以是主观判断，但不必然涉及认知顿悟。"
    }
  ]
}