{
  "word": "fingernails",
  "pronunciation": "fing·er·naylz",
  "concise_definition": "n. 指甲, 指端角质层",
  "forms": {
    "singular": "fingernail"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The hard, protective plate of keratin located at the tip of each finger and toe, serving to shield the sensitive fingertip and aid in fine motor tasks such as picking up small objects.",
      "explanation_cn": "位于每个手指和脚趾末端的坚硬角质板，由角蛋白构成，用于保护敏感的指尖，并协助完成精细动作，如拾取小物件。",
      "example_en": "She painted her fingernails bright red for the party.",
      "example_cn": "她为了参加派对，把指甲涂成了鲜红色。"
    },
    {
      "pos": "noun",
      "explanation_en": "A visible indicator of overall health; changes in color, texture, or shape of fingernails can signal nutritional deficiencies, infections, or systemic diseases.",
      "explanation_cn": "身体整体健康状况的可见指标；指甲的颜色、质地或形状变化可能提示营养不良、感染或系统性疾病。",
      "example_en": "His brittle, ridged fingernails were a sign of long-term iron deficiency.",
      "example_cn": "他的指甲脆弱且有纵纹，是长期缺铁的迹象。"
    },
    {
      "pos": "noun",
      "explanation_en": "A cultural or aesthetic symbol, often decorated or groomed to express personal style, social status, or adherence to trends.",
      "explanation_cn": "一种文化或审美象征，常通过装饰或修整来表达个人风格、社会地位或追随潮流。",
      "example_en": "The artist’s elaborate nail art attracted attention at the gallery opening.",
      "example_cn": "这位艺术家精致的美甲在画廊开幕时吸引了众人的目光。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "toenails",
      "analysis": "“Toenails”（脚趾甲）与 “fingernails” 在结构和成分上完全相同，均由角蛋白构成，但功能和文化意义不同。脚趾甲主要起保护作用，较少被装饰，且生长速度较慢；而手指甲因频繁使用和可见性，常被赋予审美和社交意义。"
    },
    {
      "word_to_compare": "claws",
      "analysis": "“Claws”（爪子）是动物（如猫、鹰）用于捕猎或攀爬的弯曲尖锐结构，通常更坚硬、更锋利，且与骨骼直接相连。而 “fingernails” 是人类退化的结构，主要用于保护和精细操作，不具备攻击性或抓握功能。"
    },
    {
      "word_to_compare": "cuticle",
      "analysis": "“Cuticle”（甲皮/甲周皮肤）是紧贴指甲根部的薄层皮肤，起到密封和保护指甲基质的作用，常被修剪或护理。而 “fingernails” 是指甲本身，即角质化的硬质部分。两者虽常被一同护理，但解剖位置和功能不同。"
    }
  ]
}