{
  "word": "finger",
  "pronunciation": "fing·gər",
  "concise_definition": "n. 手指, 指示, 指纹, 指责",
  "forms": {
    "plural": "fingers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "One of the five long, flexible parts extending from the hand, used for touching, grasping, and manipulating objects; typically includes the thumb, index, middle, ring, and little finger.",
      "explanation_cn": "从手部延伸出的五个细长、灵活的部位之一，用于触摸、抓握和操作物体；通常包括拇指、食指、中指、无名指和小指。",
      "example_en": "She tapped her fingers nervously on the table while waiting for the results.",
      "example_cn": "她在等待结果时，紧张地用手指敲打着桌子。"
    },
    {
      "pos": "noun",
      "explanation_en": "A narrow, elongated projection or part resembling a finger, such as a finger of land extending into water or a finger of smoke rising from a chimney.",
      "explanation_cn": "指形状像手指的细长突出部分，例如伸入水中的陆地狭条，或从烟囱中升起的烟柱。",
      "example_en": "A finger of mist crept over the lake at dawn.",
      "example_cn": "黎明时分，一缕薄雾悄然漫过湖面。"
    },
    {
      "pos": "noun",
      "explanation_en": "A unique pattern of ridges and valleys on the skin of a fingertip, used for identification in forensic science and security systems.",
      "explanation_cn": "指尖皮肤上独特的脊线与凹槽图案，常用于法医学和安全系统中的身份识别。",
      "example_en": "The police matched the fingerprint found at the scene to the suspect’s record.",
      "example_cn": "警方将现场发现的指纹与嫌疑人的记录进行了比对。"
    },
    {
      "pos": "noun",
      "explanation_en": "An act of blaming or accusing someone, often used in the phrase 'put the finger on'.",
      "explanation_cn": "指指责或指控某人，常用于短语 'put the finger on'（指认）。",
      "example_en": "The witness refused to put the finger on the man he saw that night.",
      "example_cn": "证人拒绝指认当晚他看到的那个人。"
    },
    {
      "pos": "verb",
      "explanation_en": "To touch or handle something with the fingers, often in a casual or fidgety manner.",
      "explanation_cn": "用手指触摸或摆弄某物，通常指随意或心神不宁地动作。",
      "example_en": "He was fingering the edge of his shirt as he spoke, clearly nervous.",
      "example_cn": "他说话时不停地摆弄衬衫的边缘，显然很紧张。"
    },
    {
      "pos": "verb",
      "explanation_en": "To play a musical instrument, especially a stringed one, using the fingers rather than a pick.",
      "explanation_cn": "用手指（而非拨片）弹奏乐器，尤指弦乐器。",
      "example_en": "She fingers the guitar strings with remarkable precision.",
      "example_cn": "她用手指弹奏吉他弦，精准得令人惊叹。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "toe",
      "analysis": "“Toe”（脚趾）与 “finger” 在解剖结构上对应，都是肢体末端的指状部分，但 “toe” 仅用于脚部，功能上主要用于平衡和行走，而 “finger” 主要用于精细操作和感知，功能更复杂多样。"
    },
    {
      "word_to_compare": "digit",
      "analysis": "“Digit”（指/趾）是解剖学上的正式术语，涵盖手指和脚趾，语义更广、更中性，常用于医学或科学语境；而 “finger” 是日常用语，特指手部的五个指头，不包括脚趾。"
    },
    {
      "word_to_compare": "point",
      "analysis": "“Point”（点、尖端）强调方向性或尖锐的末端，可指抽象概念（如论点）或物理尖端（如针尖）；而 “finger” 强调的是具象的、可触摸的指状结构，常用于比喻时也保留其物理形态特征（如‘手指般的半岛’）。"
    }
  ]
}