{
  "word": "finish",
  "pronunciation": "fih·nish",
  "concise_definition": "v. 完成, 结束; n. 表面处理, 终点, 外观",
  "forms": {
    "third_person_singular": "finishes",
    "past_tense": "finished",
    "past_participle": "finished",
    "present_participle": "finishing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To bring something to an end or completion, especially after a process or effort has been carried out.",
      "explanation_cn": "指完成某项工作、任务或过程，使其达到终点或结束状态，通常涉及努力或持续的行动。",
      "example_en": "She finished her thesis last week and graduated with honors.",
      "example_cn": "她上周完成了论文，并以优异成绩毕业。"
    },
    {
      "pos": "verb",
      "explanation_en": "To consume or use up the last part of something, especially food or drink.",
      "explanation_cn": "指吃掉或用完某物的最后部分，尤指食物或饮料。",
      "example_en": "He finished his coffee and stood up to leave.",
      "example_cn": "他喝完了咖啡，站起来准备离开。"
    },
    {
      "pos": "verb",
      "explanation_en": "To apply a final layer or treatment to a surface to improve its appearance or durability.",
      "explanation_cn": "指对表面施加最后一道处理，以改善其外观或增强耐久性，如涂漆、抛光等。",
      "example_en": "The carpenter finished the wooden table with a clear varnish.",
      "example_cn": "木匠用清漆为木桌做了表面处理。"
    },
    {
      "pos": "noun",
      "explanation_en": "The final appearance or texture of a surface, especially after being treated or polished.",
      "explanation_cn": "指经过处理或抛光后表面的最终外观或质地，常用于描述材料、家具或产品的外观效果。",
      "example_en": "The car has a matte finish that gives it a modern look.",
      "example_cn": "这辆车具有哑光表面处理，使其看起来更具现代感。"
    },
    {
      "pos": "noun",
      "explanation_en": "The end point or conclusion of a race, competition, or event.",
      "explanation_cn": "指比赛、竞赛或活动的终点或结束点。",
      "example_en": "The runners sprinted toward the finish line as the crowd cheered.",
      "example_cn": "选手们冲向终点线，观众欢呼雀跃。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "complete",
      "analysis": "“Complete” (完成) 强调使某事物达到完整、无缺失的状态，常用于任务、项目或形式上的完整性，语气更正式。而 “finish” 更侧重于动作的终结，常用于日常语境，强调‘做完’的过程。"
    },
    {
      "word_to_compare": "end",
      "analysis": "“End” (结束) 是一个更通用的词，指时间、过程或事件的终止，不强调是否完成或是否成功。而 “finish” 暗示了有意识地完成某事，通常带有成就感或目的性。例如：The movie ended at 10 p.m.（电影十点结束）vs. I finished the movie last night（我昨晚看完了这部电影）。"
    },
    {
      "word_to_compare": "polish",
      "analysis": "“Polish” (抛光) 是 “finish” 在表面处理义项下的一个具体手段，专指使表面光亮。而 “finish” 是一个更广泛的术语，包括抛光、喷涂、上漆、磨砂等多种最终处理方式。因此，polish 是 finish 的一种方式，但 finish 不一定是 polish。"
    }
  ]
}