{
  "word": "fires",
  "pronunciation": "fahy·erz",
  "concise_definition": "n. 火灾, 火焰, 火枪射击, 开除; v. 开除, 射击, 点燃",
  "forms": {
    "singular": "fire",
    "third_person_singular": "fires",
    "past_tense": "fired",
    "past_participle": "fired",
    "present_participle": "firing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A rapid oxidation process producing heat and light, often uncontrolled and destructive, especially when occurring in buildings or natural environments.",
      "explanation_cn": "指一种快速氧化反应，产生热量和光，通常为失控状态并具有破坏性，尤其指发生在建筑物或自然环境中的火灾。",
      "example_en": "The firefighters arrived quickly to put out the fires in the apartment building.",
      "example_cn": "消防员迅速赶到，扑灭了公寓大楼里的火灾。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of discharging a weapon, especially a gun or cannon; also refers to the sound or burst of such discharge.",
      "explanation_cn": "指发射武器（尤其是枪或大炮）的行为；也可指此类发射时发出的声音或火光。",
      "example_en": "The soldiers returned fire after being attacked by enemy snipers.",
      "example_cn": "士兵们在遭到敌方狙击手袭击后进行了还击。"
    },
    {
      "pos": "verb",
      "explanation_en": "To dismiss someone from a job or position, often abruptly or for cause.",
      "explanation_cn": "指突然或因故解雇某人，使其失去职位或工作。",
      "example_en": "The manager fired three employees for violating company policy.",
      "example_cn": "经理因员工违反公司规定而解雇了三人。"
    },
    {
      "pos": "verb",
      "explanation_en": "To ignite or set something on fire, especially a weapon, furnace, or engine.",
      "explanation_cn": "指点燃某物，尤指武器、炉子或引擎。",
      "example_en": "The artillery unit fired their cannons at dawn.",
      "example_cn": "炮兵部队在黎明时分开炮了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "blaze",
      "analysis": "“Blaze”（烈火）通常指强烈、明亮、迅猛燃烧的火焰，强调视觉上的壮观和热度，常用于文学或描述性语境。而 “fire” 更通用，可指任何形式的燃烧，包括可控的炉火或灾难性的火灾。"
    },
    {
      "word_to_compare": "dismiss",
      "analysis": "“Dismiss”（解雇）是更正式、中性的词汇，常用于法律或行政语境，强调程序性终止雇佣关系。而 “fire” 更口语化，带有情绪色彩，常暗示突然、严厉或惩罚性的解雇。"
    },
    {
      "word_to_compare": "shoot",
      "analysis": "“Shoot”（射击）是更广泛的动词，泛指任何投射物体的动作，包括用枪、弓箭或投掷物。而 “fire” 作为动词特指通过火药或压力装置发射弹药，具有技术性与武器语境的专属性。"
    }
  ]
}