{
  "word": "fire",
  "pronunciation": "fahy·er",
  "concise_definition": "n. 火, 火灾, 火力; v. 点火, 解雇, 开火",
  "forms": {
    "plural": "fires",
    "third_person_singular": "fires",
    "past_tense": "fired",
    "past_participle": "fired",
    "present_participle": "firing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The visible, glowing material produced by rapid oxidation, typically accompanied by heat and light, used for warmth, cooking, or as a destructive force.",
      "explanation_cn": "指通过快速氧化产生的可见发光物质，通常伴随热量和光，用于取暖、烹饪，或作为破坏性力量。",
      "example_en": "The campfire kept us warm throughout the night.",
      "example_cn": "篝火让我们整晚都感到温暖。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of discharging a weapon, especially a gun or artillery, to propel a projectile.",
      "explanation_cn": "指发射武器（尤其是枪支或火炮）以发射弹丸的行为。",
      "example_en": "The soldiers opened fire as soon as the enemy approached.",
      "example_cn": "敌人一靠近，士兵们就开火了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A destructive event caused by uncontrolled burning, often resulting in damage to property or life.",
      "explanation_cn": "指由失控燃烧引起的破坏性事件，常导致财产损失或人员伤亡。",
      "example_en": "The fire destroyed three buildings in the downtown area.",
      "example_cn": "这场大火摧毁了市中心的三栋建筑。"
    },
    {
      "pos": "verb",
      "explanation_en": "To dismiss someone from employment, typically abruptly or officially.",
      "explanation_cn": "指突然或正式地解雇某人。",
      "example_en": "He was fired for violating company policy.",
      "example_cn": "他因违反公司规定而被解雇了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To set something on fire or ignite it, often deliberately.",
      "explanation_cn": "指点燃某物，通常是有意为之。",
      "example_en": "They fired the old barn to clear the land.",
      "example_cn": "他们放火烧了那座旧谷仓以清理土地。"
    },
    {
      "pos": "verb",
      "explanation_en": "To discharge a weapon by releasing a projectile, especially in a military or combat context.",
      "explanation_cn": "指在军事或战斗背景下发射武器，释放弹丸。",
      "example_en": "The artillery unit fired over twenty rounds in the first minute.",
      "example_cn": "炮兵部队在第一分钟内发射了二十多发炮弹。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "burn",
      "analysis": "“Burn” (燃烧) 强调物质因高温而发生化学变化的过程，侧重于持续的氧化反应，不一定伴随火焰或爆炸。而 “fire” 更强调火焰本身、其作为实体或事件的存在，常指可观察的燃烧现象或其后果。"
    },
    {
      "word_to_compare": "dismiss",
      "analysis": "“Dismiss” (解雇) 是一个更正式、中性的词，泛指终止某人的职位或职责，可适用于多种情境（如学校、政府）。而 “fire” 更口语化，常带有突然性、惩罚性或情绪色彩，多用于商业或日常语境中。"
    },
    {
      "word_to_compare": "shoot",
      "analysis": "“Shoot” (射击) 是一个更广泛的动词，可指任何投射动作（如投篮、射箭），不一定涉及火药或武器系统。而 “fire” 在军事或武器语境中特指通过火药或高压气体发射弹丸，具有更强的技术性和暴力性。"
    }
  ]
}