{
  "word": "fit",
  "pronunciation": "fɪt",
  "concise_definition": "adj. 适合的, 健康的; v. 适合, 安装, 使配合; n. 发作, 突然的冲动",
  "forms": {
    "third_person_singular": "fits",
    "past_tense": "fit",
    "past_participle": "fit",
    "present_participle": "fitting"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "In good physical health; having a strong and healthy body, often as a result of regular exercise and proper diet.",
      "explanation_cn": "身体健康的；因规律锻炼和合理饮食而拥有强健体魄的状态。",
      "example_en": "She's been running every morning and is now really fit.",
      "example_cn": "她每天早上跑步，现在身体非常健康。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be the right size, shape, or amount for something; to match or suit perfectly.",
      "explanation_cn": "指某物在尺寸、形状或数量上与另一物完全匹配或合适。",
      "example_en": "These shoes don't fit me—they're too tight.",
      "example_cn": "这双鞋不合脚——太紧了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To install or put something in place so that it functions correctly, especially in mechanical or structural contexts.",
      "explanation_cn": "指将某物安装或安置到位，使其能正常运作，常用于机械或结构场景。",
      "example_en": "The mechanic fitted a new brake system to the car.",
      "example_cn": "修理工给这辆车安装了新的刹车系统。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden, brief episode of intense physical or emotional behavior, often uncontrollable, such as a seizure or a burst of anger.",
      "explanation_cn": "指突然发生的、短暂而强烈的生理或情绪行为，通常是无法控制的，如抽搐、暴怒或狂笑。",
      "example_en": "He had a fit of laughter when he heard the joke.",
      "example_cn": "他听到这个笑话时大笑起来。"
    },
    {
      "pos": "noun",
      "explanation_en": "A period of intense activity or enthusiasm, often temporary and uncontrolled.",
      "explanation_cn": "指一段短暂而强烈的活动或热情期，通常是无意识或不受控制的。",
      "example_en": "She went through a fit of cleaning and tidied the whole house in one day.",
      "example_cn": "她突然兴起一阵打扫热潮，一天之内把整个房子都收拾干净了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "suit",
      "analysis": "“Suit” (适合) 强调某物在风格、颜色、场合或偏好上与人或环境相协调，常用于抽象或审美层面，如衣服适合场合。而 “fit” 更侧重于物理尺寸、结构或功能上的精确匹配，如鞋子合脚、零件安装到位。"
    },
    {
      "word_to_compare": "match",
      "analysis": "“Match” (匹配) 强调两个或多个事物在外观、性质或特征上完全一致或成对，如颜色匹配、对手匹配。它更注重对称性或对应性，而 “fit” 更强调功能性契合，即使外观不同，只要能正常运作就算 fit。"
    },
    {
      "word_to_compare": "healthy",
      "analysis": "“Healthy” (健康的) 是一个描述身体或心理状态的形容词，侧重于无疾病、生理机能正常。而 “fit” 不仅包含健康，还强调体能、耐力和肌肉力量，是健康的一种积极表现形式。一个人可以健康但不 fit（如久坐不动的糖尿病患者），但 fit 通常意味着健康。"
    }
  ]
}