{
  "word": "fitness",
  "pronunciation": "fih·tnees",
  "concise_definition": "n. 健康, 体能, 适宜性",
  "forms": {
    "plural": "fitnesses"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The state of being physically healthy and capable, especially through regular exercise, proper nutrition, and adequate rest; often refers to cardiovascular endurance, muscular strength, flexibility, and body composition.",
      "explanation_cn": "指通过规律锻炼、合理饮食和充足休息所达到的身体健康与体能状态，通常包括心肺耐力、肌肉力量、柔韧性和体脂比例等方面。",
      "example_en": "Regular jogging and strength training have greatly improved her fitness over the past year.",
      "example_cn": "过去一年中，规律的慢跑和力量训练显著提升了她的体能。"
    },
    {
      "pos": "noun",
      "explanation_en": "The suitability or appropriateness of something for a particular purpose or context; the degree to which something is well-adapted to its function.",
      "explanation_cn": "指某事物对于特定目的或情境的适用性或恰当性，即其与功能的契合程度。",
      "example_en": "The fitness of the candidate for the role was evident in her years of relevant experience.",
      "example_cn": "这位候选人与该职位的契合度从她多年相关经验中显而易见。"
    },
    {
      "pos": "noun",
      "explanation_en": "In evolutionary biology, the ability of an organism to survive, reproduce, and pass on its genes to the next generation.",
      "explanation_cn": "在进化生物学中，指生物体生存、繁殖并将基因传递给下一代的能力。",
      "example_en": "Natural selection favors traits that increase an organism's fitness in its environment.",
      "example_cn": "自然选择倾向于保留那些能提高生物体在环境中适应力的性状。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "health",
      "analysis": "“Health”（健康）是一个更广泛的概念，涵盖生理、心理和社会福祉的全面状态，而 “fitness” 更侧重于身体机能和体能水平。一个人可以健康但不体能出众（如慢性病患者），也可以体能极佳但存在其他健康隐患（如饮食失调）。"
    },
    {
      "word_to_compare": "strength",
      "analysis": "“Strength”（力量）特指肌肉产生最大力量的能力，是体能的一个组成部分。而 “fitness” 是一个综合性概念，包含力量、耐力、柔韧性、协调性等多个维度。因此，strength 是 fitness 的子集，而非等同。"
    },
    {
      "word_to_compare": "suitability",
      "analysis": "“Suitability”（适宜性）与 “fitness” 在抽象语境中可互换，但 “suitability” 更常用于评价物品、方案或人选是否符合标准或要求，语气偏客观和制度化；而 “fitness” 在此语境下更具动态性和适应性含义，尤其在生物学或系统设计中更强调功能匹配的演化或优化过程。"
    }
  ]
}