{
  "word": "fitted",
  "pronunciation": "fit·id",
  "concise_definition": "adj. 适合的, 合身的, 安装好的; v. 适合, 安装 (fit 的过去式和过去分词)",
  "forms": {
    "base_form": "fit",
    "past_tense": "fitted",
    "past_participle": "fitted",
    "present_participle": "fitting",
    "third_person_singular": "fits"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Made or adjusted to suit a particular person, object, or purpose, especially in terms of size, shape, or function; often used to describe clothing or equipment that conforms precisely.",
      "explanation_cn": "指经过制作或调整以适应特定的人、物体或用途，尤其指在尺寸、形状或功能上高度贴合；常用于描述服装或设备与身体或环境的精准匹配。",
      "example_en": "She wore a fitted dress that accentuated her figure.",
      "example_cn": "她穿着一件修身连衣裙，突显了她的身材。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Installed or arranged in a way that is secure, functional, and properly aligned, often referring to machinery, fixtures, or systems.",
      "explanation_cn": "指以安全、功能良好且对齐准确的方式安装或布置，常用于描述机械、装置或系统。",
      "example_en": "The new kitchen cabinets were fitted with soft-close hinges.",
      "example_cn": "新厨房橱柜安装了缓冲闭合铰链。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make something suitable for a particular person or purpose by adjusting its size, shape, or position; often used in tailoring or engineering contexts.",
      "explanation_cn": "通过调整尺寸、形状或位置使某物适合特定的人或用途；常用于裁缝或工程语境。",
      "example_en": "The tailor fitted the suit to his measurements.",
      "example_cn": "裁缝根据他的尺寸为他量身定制了这套西装。"
    },
    {
      "pos": "verb",
      "explanation_en": "To install or set something in place, especially as part of a larger system or structure.",
      "explanation_cn": "指将某物安装或固定在适当位置，尤其是作为更大系统或结构的一部分。",
      "example_en": "Electricians fitted the new lighting system in the office.",
      "example_cn": "电工在办公室安装了新的照明系统。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "customized",
      "analysis": "“Customized” (定制的) 强调根据个人偏好或特殊需求进行个性化修改，范围更广，可涉及颜色、功能、风格等非物理贴合的调整。而 “fitted” 更侧重于物理上的精确匹配，如尺寸、轮廓或安装的契合度。"
    },
    {
      "word_to_compare": "adjusted",
      "analysis": "“Adjusted” (调整的) 指对某物进行微调以达到更好的状态，但不一定意味着完全贴合或专为某人/物设计。例如调整座椅高度。而 “fitted” 暗示了更彻底的改造或匹配，通常是为特定对象专门制作或安装的。"
    },
    {
      "word_to_compare": "installed",
      "analysis": "“Installed” (安装的) 与 “fitted” 在设备或系统语境中常可互换，但 “installed” 更强调安装动作本身，不必然包含贴合或适配的含义。而 “fitted” 除了安装，还隐含了‘精准匹配’的语义，如‘fitted with a new engine’ 比 ‘installed a new engine’ 更强调匹配性。"
    }
  ]
}