{
  "word": "fixation",
  "pronunciation": "fik·sey·shun",
  "concise_definition": "n. 固着, 痴迷, 注视, 定影",
  "forms": {
    "plural": "fixations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An intense and often unhealthy obsession with a particular person, idea, or object, typically to the exclusion of other interests or realities.",
      "explanation_cn": "指对某个人、想法或物体产生强烈且常常不健康的痴迷，通常导致其他兴趣或现实被忽视。",
      "example_en": "His fixation on perfection made it impossible for him to finish any project.",
      "example_cn": "他对完美的痴迷使他无法完成任何项目。"
    },
    {
      "pos": "noun",
      "explanation_en": "A psychological state in which an individual remains emotionally attached to an earlier stage of development, as described in Freudian theory.",
      "explanation_cn": "指个体在心理发展过程中，情感上持续滞留在某一早期阶段的状态，如弗洛伊德理论中所描述的。",
      "example_en": "According to Freud, unresolved childhood conflicts can lead to fixation at the oral or anal stage.",
      "example_cn": "根据弗洛伊德的观点，未解决的童年冲突可能导致在口欲期或肛欲期产生固着。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of focusing one's gaze steadily on a single point or object, often in a staring or trance-like manner.",
      "explanation_cn": "指持续凝视某一点或物体，常表现为凝视或类似出神的状态。",
      "example_en": "The cat's fixation on the moving shadow fascinated the children.",
      "example_cn": "猫对移动阴影的凝视让孩子们着迷。"
    },
    {
      "pos": "noun",
      "explanation_en": "In photography or imaging, the process of making a latent image permanent by removing unexposed silver halide crystals with chemical solutions.",
      "explanation_cn": "在摄影或成像中，通过化学溶液去除未曝光的卤化银晶体，使潜影永久固定的过程。",
      "example_en": "The final step in developing film is fixation, which ensures the image won't fade when exposed to light.",
      "example_cn": "胶片冲洗的最后一步是定影，以确保图像在曝光后不会褪色。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "obsession",
      "analysis": "“Obsession”（痴迷）与 “fixation” 在心理层面高度重叠，都指强烈而持续的专注。但 “obsession” 更强调思维上的侵入性与焦虑感，常用于临床语境；而 “fixation” 可以更中性，也用于描述非病理性的专注，如艺术创作中的专注，或弗洛伊德理论中的发展停滞。"
    },
    {
      "word_to_compare": "concentration",
      "analysis": "“Concentration”（专注）是中性词，指有意识地将注意力集中在某事物上，通常是积极、有目的的。而 “fixation” 常带有负面或病态色彩，暗示无法转移注意力，甚至失去理性控制。"
    },
    {
      "word_to_compare": "stare",
      "analysis": "“Stare”（凝视）是视觉行为的描述，仅指长时间盯着看，不涉及心理或情感层面。而 “fixation” 不仅包含凝视行为，还隐含深层的心理依附、情感投射或认知锁定，语义范围更广。"
    },
    {
      "word_to_compare": "developmental stage",
      "analysis": "“Developmental stage”（发展阶段）是描述心理成长过程中的一个时期，如口欲期、肛欲期。而 “fixation” 是指个体未能顺利过渡到下一阶段，从而在某一阶段停滞。前者是过程，后者是异常状态。"
    }
  ]
}