{
  "word": "fixing",
  "pronunciation": "fik·sing",
  "concise_definition": "n. 修理, 修补; v. 修理, 固定, 安装, 确定",
  "forms": {
    "base_form": "fix",
    "third_person_singular": "fixes",
    "past_tense": "fixed",
    "past_participle": "fixed",
    "present_participle": "fixing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of repairing or correcting something that is broken, damaged, or not functioning properly; often used in informal contexts to refer to a quick or temporary solution.",
      "explanation_cn": "指对损坏、故障或无法正常运作的事物进行修理或纠正的行为；常用于非正式语境，指快速或临时的解决方案。",
      "example_en": "The car needed a quick fixing before the road trip.",
      "example_cn": "这次长途旅行前，车子需要快速修理一下。"
    },
    {
      "pos": "verb",
      "explanation_en": "To repair or mend something by making physical adjustments or replacing parts.",
      "explanation_cn": "通过进行物理调整或更换部件来修理或修补某物。",
      "example_en": "He spent the afternoon fixing the leaky faucet.",
      "example_cn": "他整个下午都在修理漏水的水龙头。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make something firmly fixed in place, often by attaching, securing, or installing it.",
      "explanation_cn": "通过连接、固定或安装使某物牢固地处于指定位置。",
      "example_en": "They are fixing the shelves to the wall with brackets.",
      "example_cn": "他们正在用支架把架子固定在墙上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To establish or determine something definitively, especially a date, time, or outcome.",
      "explanation_cn": "明确地确定某事，尤其是日期、时间或结果。",
      "example_en": "We’ve fixed the meeting for next Tuesday at 3 p.m.",
      "example_cn": "我们已经把会议定在下周二下午三点。"
    },
    {
      "pos": "verb",
      "explanation_en": "To manipulate or alter something dishonestly to achieve a desired result, especially in elections or competitions.",
      "explanation_cn": "不正当地操纵或篡改某事以达成期望的结果，尤指在选举或比赛中作弊。",
      "example_en": "The game was fixed by the players to ensure a win for the favorite team.",
      "example_cn": "这场比赛被球员操纵，以确保热门球队获胜。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "repair",
      "analysis": "“Repair” (修理) 更侧重于恢复物品的原有功能，通常指系统性、较正式的维修过程，如修理电器或机械。“Fixing” 更口语化，可指快速、临时或简单的修补，范围更广，甚至包括非物理性的调整（如‘fix a meeting’）。"
    },
    {
      "word_to_compare": "mend",
      "analysis": "“Mend” (缝补/修补) 通常用于衣物、织物或关系的修复，带有轻微的细腻、手工感，常用于抽象语境（如 mend a friendship）。“Fixing” 则更通用，适用于机械、电子、结构等物理对象，较少用于抽象关系。"
    },
    {
      "word_to_compare": "install",
      "analysis": "“Install” (安装) 专指将设备、软件或系统设置并置于可运行状态，强调首次放置或配置。“Fixing” 在此语境下可能包含安装，但更侧重于解决故障或使某物正常运作，可能是安装后的问题处理。"
    },
    {
      "word_to_compare": "determine",
      "analysis": "“Determine” (确定) 是一个更正式、更抽象的词，用于指通过分析、决策或规则得出结论或设定结果，如 determine the cause。“Fixing” 在表示‘确定时间/日期’时是口语化用法，语义范围更窄，且常隐含‘敲定’的决断意味。"
    }
  ]
}