{
  "word": "flagship",
  "pronunciation": "flaj·ship",
  "concise_definition": "n. 旗舰, 旗舰产品, 最重要的项目",
  "forms": {
    "plural": "flagships"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The leading or most important ship in a fleet, historically carrying the admiral's flag and serving as the command vessel.",
      "explanation_cn": "指舰队中最重要的舰船，历史上通常悬挂舰队司令的旗帜，作为指挥中心。",
      "example_en": "The battleship was the flagship of the Pacific fleet during World War II.",
      "example_cn": "这艘战列舰是二战期间太平洋舰队的旗舰。"
    },
    {
      "pos": "noun",
      "explanation_en": "The most prominent, successful, or representative product, service, or project offered by a company or organization, often used to showcase its capabilities or brand identity.",
      "explanation_cn": "指一家公司或组织提供的最突出、最成功或最具代表性的产品、服务或项目，通常用于展示其技术实力或品牌形象。",
      "example_en": "The iPhone 15 Pro is Apple's flagship smartphone, featuring the latest technology and premium design.",
      "example_cn": "iPhone 15 Pro 是苹果公司的旗舰智能手机，搭载了最新技术和高端设计。"
    },
    {
      "pos": "noun",
      "explanation_en": "The principal or most notable entity in a group, such as a flagship university, station, or store, representing the highest standard or public face of the organization.",
      "explanation_cn": "指一组事物中最重要的实体，如旗舰大学、旗舰电台或旗舰门店，代表该组织的最高标准或公众形象。",
      "example_en": "Harvard University is considered the flagship institution of the American higher education system.",
      "example_cn": "哈佛大学被视为美国高等教育体系的旗舰院校。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "premium",
      "analysis": "“Premium”（高端的）强调质量、价格或地位上的优越性，常作为形容词修饰产品（如 premium product），但不直接指代某个具体实体。而 “flagship” 是一个名词，特指在系列或体系中处于核心地位的代表作，不仅代表高端，更代表引领性和象征意义。"
    },
    {
      "word_to_compare": "primary",
      "analysis": "“Primary”（主要的）仅表示重要性或优先级上的首位，是相对中性的描述，不带有代表性或象征性内涵。例如，primary goal（主要目标）。而 “flagship” 不仅表示最重要，还隐含了“典范”“门面”“标杆”的文化或品牌意义。"
    },
    {
      "word_to_compare": "top-tier",
      "analysis": "“Top-tier”（顶级的）是一个形容词短语，用于描述等级或质量处于最高层次的事物，但不具备名词属性，也无法承载“旗舰”所蕴含的组织代表性与象征功能。例如，top-tier performance（顶级表现），而 “flagship” 可以作为实体被命名和推广。"
    }
  ]
}