{
  "word": "flake",
  "pronunciation": "flayk",
  "concise_definition": "n. 雪花, 薄片, 可靠性差的人; v. 脱落, 逃避责任",
  "forms": {
    "plural": "flakes",
    "third_person_singular": "flakes",
    "past_tense": "flaked",
    "past_participle": "flaked",
    "present_participle": "flaking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small, thin piece that breaks off from a larger surface, often due to weathering, aging, or physical stress; commonly used to describe snow, paint, or metal.",
      "explanation_cn": "从较大表面因风化、老化或物理压力而脱落的小而薄的片状物；常用于描述雪花、油漆或金属碎片。",
      "example_en": "The old paint on the fence was peeling off in flakes.",
      "example_cn": "围栏上旧漆正一片片剥落。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is unreliable, eccentric, or fails to fulfill commitments, especially by not showing up for appointments or obligations.",
      "explanation_cn": "指不可靠、古怪或不履行承诺的人，尤指经常爽约或逃避责任的人。",
      "example_en": "Don't count on him—he's a total flake and never shows up on time.",
      "example_cn": "别指望他，他完全是个不守信用的人，从不按时出现。"
    },
    {
      "pos": "verb",
      "explanation_en": "To break off or come off in small pieces, especially due to deterioration or wear.",
      "explanation_cn": "指因劣化或磨损而以小片形式脱落。",
      "example_en": "The rusted metal flaked away when I touched it.",
      "example_cn": "我一碰，生锈的金属就片片剥落。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fail to show up for an appointment, event, or obligation, especially without notice; to stand someone up.",
      "explanation_cn": "指未提前通知就缺席约会、活动或责任，即爽约。",
      "example_en": "She flaked on our dinner plans last night and didn't even text to cancel.",
      "example_cn": "她昨晚爽了我们的晚餐约，连条取消的消息都没发。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "chip",
      "analysis": "“Chip”（碎屑）通常指因撞击或外力导致的较小、较硬的碎片，常用于描述陶瓷、石头或牙齿的破损，带有突然性和局部性；而 “flake” 更强调因老化、腐蚀或结构松散而缓慢、片状地脱落，常用于油漆、金属或雪花等较软或层状材料。"
    },
    {
      "word_to_compare": "fleck",
      "analysis": "“Fleck”（斑点）指微小的、分散的色块或颗粒，通常仍附着在原物表面，如毛发上的灰斑或木头上的色点；而 “flake” 是已完全脱离原物的独立薄片，强调分离和脱落，而非残留。"
    },
    {
      "word_to_compare": "stand-up",
      "analysis": "“Stand-up”（爽约行为）是动词短语，指故意不赴约，常用于口语，但本身不作名词；而 “flake” 既可作动词（flaked on me）也可作名词（he's a flake），且带有更强的贬义色彩，暗示此人一贯不可靠，而不仅仅是单次失约。"
    }
  ]
}