{
  "word": "flame",
  "pronunciation": "fleym",
  "concise_definition": "n. 火焰, 火光; v. 燃烧, 激起, 炫耀",
  "forms": {
    "plural": "flames"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The visible, gaseous part of a fire, characterized by heat, light, and often a flickering or rising form.",
      "explanation_cn": "火的可见气体部分，以热量、光亮和通常的摇曳或上升形态为特征。",
      "example_en": "The candle's flame danced gently in the breeze.",
      "example_cn": "蜡烛的火焰在微风中轻轻摇曳。"
    },
    {
      "pos": "noun",
      "explanation_en": "Intense passion or emotion, especially romantic or angry feelings, often used metaphorically to describe strong feelings that burn brightly.",
      "explanation_cn": "强烈的激情或情绪，尤指浪漫或愤怒的情感，常用于比喻那些如火焰般炽烈的情感。",
      "example_en": "Their love was a flame that refused to be extinguished by time.",
      "example_cn": "他们的爱是一团不为时间熄灭的火焰。"
    },
    {
      "pos": "noun",
      "explanation_en": "A symbol of anger, conflict, or rebellion, often used in phrases like 'to fan the flames' to mean intensifying dispute.",
      "explanation_cn": "愤怒、冲突或反抗的象征，常用于短语如 '煽动火焰'，意为加剧争端。",
      "example_en": "The politician's speech only fanned the flames of public outrage.",
      "example_cn": "这位政治家的演讲只会加剧公众的愤怒。"
    },
    {
      "pos": "verb",
      "explanation_en": "To burn with a flame or flames; to be engulfed in fire.",
      "explanation_cn": "以火焰燃烧；被火吞噬。",
      "example_en": "The old barn flamed after the lightning strike.",
      "example_cn": "那座旧谷仓在遭到雷击后燃烧起来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To express something with fiery intensity, especially in speech or writing, often to provoke or impress.",
      "explanation_cn": "以炽烈的激情表达（尤指言语或写作），常为激起反应或给人留下深刻印象。",
      "example_en": "She flamed back at her critic with a sharp retort.",
      "example_cn": "她用一句尖锐的反驳回击了批评者。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fire",
      "analysis": "“Fire” (火) 是一个更广泛、更基础的术语，指燃烧现象的整体，包括热、光、烟和火焰本身；而 “flame” 仅指火的可见气体部分，是火的外在表现形式。因此，所有火焰都属于火，但并非所有火都有明显火焰（如闷烧）。"
    },
    {
      "word_to_compare": "blaze",
      "analysis": "“Blaze” (烈火) 强调猛烈、强烈、大规模的燃烧，常带有破坏性或壮观的视觉效果，比 “flame” 更具冲击力和规模感。例如，森林大火是 a blaze，而蜡烛的火苗是 a flame。"
    },
    {
      "word_to_compare": "spark",
      "analysis": "“Spark” (火花) 是火焰的微小起始点，通常是短暂、微弱的发光颗粒，是火焰的前身而非火焰本身。它强调起源和瞬间性，而 “flame” 是持续燃烧的可见形态。"
    }
  ]
}