{
  "word": "flank",
  "pronunciation": "flangk",
  "concise_definition": "n. 侧翼, 侧面; v. 位于...的侧面, 从侧面攻击",
  "forms": {
    "third_person_singular": "flanks",
    "past_tense": "flanked",
    "past_participle": "flanked",
    "present_participle": "flanking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The side of a person, animal, or military formation, especially when considered as a vulnerable or exposed area during combat or movement.",
      "explanation_cn": "指人、动物或军事阵型的侧面，尤指在战斗或移动中容易受到攻击的薄弱部位。",
      "example_en": "The enemy launched a surprise attack on our left flank.",
      "example_cn": "敌人对我们左翼发动了突然袭击。"
    },
    {
      "pos": "noun",
      "explanation_en": "A part of the body of an animal, especially the area between the ribs and the hip, often used as a cut of meat.",
      "explanation_cn": "指动物身体的一部分，尤指肋骨与臀部之间的区域，常作为肉品的切块。",
      "example_en": "We roasted a delicious pork flank for Sunday dinner.",
      "example_cn": "我们为周日晚餐烤了一块美味的猪肋肉。"
    },
    {
      "pos": "verb",
      "explanation_en": "To position oneself or something on the side of another person or thing, often for protection, observation, or tactical advantage.",
      "explanation_cn": "指位于某人或某物的侧面，通常出于保护、观察或战术优势的目的。",
      "example_en": "Two guards flanked the president as he walked to the podium.",
      "example_cn": "总统走向讲台时，两名警卫一左一右护卫着他。"
    },
    {
      "pos": "verb",
      "explanation_en": "To attack or threaten an enemy from the side, especially to weaken their position or force them to divert resources.",
      "explanation_cn": "指从侧面攻击或威胁敌人，以削弱其阵地或迫使其转移资源。",
      "example_en": "The cavalry was ordered to flank the enemy lines and cut off their retreat.",
      "example_cn": "骑兵被命令从侧翼包抄敌军阵线，切断其退路。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "side",
      "analysis": "“Side” (侧面) 是一个通用词，泛指任何物体的侧面，不带军事或战术含义。而 “flank” 更具专业性，常用于军事语境，强调可被攻击的脆弱侧翼，或用于描述动物身体特定部位，语义更具体、更精确。"
    },
    {
      "word_to_compare": "wing",
      "analysis": "“Wing” (翼/侧翼) 在军事中常与 “flank” 互换，但 “wing” 更强调组织结构中的一个独立部分（如左翼、右翼部队），而 “flank” 更侧重于空间位置和攻击方向。此外，“wing” 也可用于鸟类或飞机，而 “flank” 几乎不用于航空领域。"
    },
    {
      "word_to_compare": "border",
      "analysis": "“Border” (边界) 指两个区域之间的分界线，强调地理或政治界限，如国界。而 “flank” 指的是一个实体的侧面，不一定是边界，而是其结构的一部分，常用于动态情境（如战斗、移动）中，语义更偏向功能性和战术性。"
    }
  ]
}