{
  "word": "flaps",
  "pronunciation": "flaps",
  "concise_definition": "n. 襟翼, 翻 flap, 翻动部分; v. 拍打, 翻动",
  "forms": {
    "singular": "flap",
    "plural": "flaps"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A flat, flexible piece of material attached at one edge, designed to move or be moved, often to cover, protect, or control the flow of air, liquid, or light.",
      "explanation_cn": "指一端固定、可活动的扁平柔性材料部分，常用于覆盖、保护或控制空气、液体或光线的流动。",
      "example_en": "The airplane's wing flaps were extended to increase lift during takeoff.",
      "example_cn": "飞机起飞时，机翼的襟翼被展开以增加升力。"
    },
    {
      "pos": "noun",
      "explanation_en": "A loose, hanging part of clothing, a container, or an object that can be flipped open or closed, such as the flap of a pocket or envelope.",
      "explanation_cn": "指衣物、容器或物体上可翻折开合的松垂部分，如口袋或信封的翻盖。",
      "example_en": "She reached into her purse and pulled out her keys from under the leather flap.",
      "example_cn": "她伸手进钱包，从皮革翻盖下取出钥匙。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move up and down or back and forth with a loose, swinging motion, often producing a sound.",
      "explanation_cn": "指以松散、摆动的方式上下或前后移动，常伴有声响。",
      "example_en": "The bird flapped its wings vigorously as it tried to escape.",
      "example_cn": "这只鸟拼命拍打翅膀试图逃脱。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be in a state of agitated or frantic movement, often due to anxiety or excitement.",
      "explanation_cn": "指因焦虑或兴奋而处于慌乱、躁动不安的状态。",
      "example_en": "The children were flapping around the room, excited about the surprise party.",
      "example_cn": "孩子们在房间里兴奋地跑来跑去，为惊喜派对而激动不已。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "wings",
      "analysis": "“Wings” (翅膀) 是鸟类、昆虫或飞机上用于飞行的固定结构，强调其功能性和整体性；而 “flaps” 是翅膀或物体上可活动的局部部件，用于调节飞行姿态或控制气流，是功能性的可动组件，而非整体结构。"
    },
    {
      "word_to_compare": "flaps",
      "analysis": "“Lid” (盖子) 通常是刚性、可完全移除或旋转闭合的覆盖物，如箱子或罐子的盖；而 “flap” 是铰接或柔性的部分，仅在一端固定，可翻动但不能完全分离，更强调连续性和摆动性。"
    },
    {
      "word_to_compare": "flutter",
      "analysis": "“Flutter” (轻拍/飘动) 描述的是轻柔、快速、不规则的摆动，常用于描述羽毛、旗帜或蝴蝶翅膀的优雅运动；而 “flap” 强调更有力、更沉重、更明显的拍打动作，常伴随声音，如鸟翼拍打或布料在风中猛烈翻动。"
    }
  ]
}