{
  "word": "flares",
  "pronunciation": "flairz",
  "concise_definition": "n. 火焰喷射, 爆发, 裙摆张开; v. 爆发, 张开, 燃烧",
  "forms": {
    "singular": "flare",
    "third_person_singular": "flares",
    "past_tense": "flared",
    "past_participle": "flared",
    "present_participle": "flaring"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sudden, bright burst of light or flame, often used in emergencies to signal for help or attract attention.",
      "explanation_cn": "指突然爆发的明亮光焰，常用于紧急情况中发出求救信号或吸引注意。",
      "example_en": "The sailors fired flares to signal their distress to nearby ships.",
      "example_cn": "水手们发射了信号弹，向附近船只发出求救信号。"
    },
    {
      "pos": "noun",
      "explanation_en": "A widening part of a garment, especially at the bottom of pants or a skirt, creating a bell-like shape.",
      "explanation_cn": "指服装的扩大部分，尤指裤子或裙子下摆呈钟形张开的设计。",
      "example_en": "She wore bell-bottom jeans with wide flares that swished as she walked.",
      "example_cn": "她穿着喇叭裤，裤腿宽大，走路时随步伐摆动。"
    },
    {
      "pos": "verb",
      "explanation_en": "To burn or shine with a sudden, unsteady, or flickering light; to burst into flame briefly.",
      "explanation_cn": "指突然不稳定地燃烧或发光，短暂地迸发出火焰。",
      "example_en": "The candle flared up as the wind blew through the window.",
      "example_cn": "一阵风吹进窗户，蜡烛突然闪出火光。"
    },
    {
      "pos": "verb",
      "explanation_en": "To spread outward, especially at the bottom, as in clothing or a structure; to widen gradually.",
      "explanation_cn": "指向外张开，尤指衣物或结构的底部逐渐变宽。",
      "example_en": "The road flared out into a wide plaza near the city center.",
      "example_cn": "道路在市中心附近逐渐拓宽成一个宽阔的广场。"
    },
    {
      "pos": "verb",
      "explanation_en": "To lose control or become unsteady, especially in emotion or performance; to erupt suddenly.",
      "explanation_cn": "指情绪或表现突然失控或不稳定，或突然爆发。",
      "example_en": "His temper flared when he heard the unfair accusation.",
      "example_cn": "当他听到不公的指控时，怒火瞬间爆发。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "blaze",
      "analysis": "“Blaze”（烈焰）强调持续、强烈、大规模的燃烧，通常指火势旺盛的火焰，带有破坏性或壮观感。而 “flare” 更强调短暂、突然、不稳定的闪光或火苗爆发，常用于信号或情绪的瞬间迸发。"
    },
    {
      "word_to_compare": "burst",
      "analysis": "“Burst”（爆发）泛指任何突然的、猛烈的释放，可以是声音、情绪、液体等，不特指光或火焰。而 “flare” 专指光或火焰的突然闪现，或结构的张开，具有视觉上的明确指向性。"
    },
    {
      "word_to_compare": "flare-up",
      "analysis": "“Flare-up” 是 “flare” 的名词化形式，特指情绪、疾病或冲突的突然复发或加剧，如 ‘a flare-up of arthritis’。而 ‘flare’ 作为独立词可作名词或动词，涵盖更广的物理和比喻用法，如信号弹、裙摆等。"
    },
    {
      "word_to_compare": "bell-bottom",
      "analysis": "“Bell-bottom” 是一种具体服装款式，特指裤腿从膝盖向下逐渐扩大的牛仔裤，是 ‘flare’ 在服装语境中的一个子类。而 ‘flare’ 作为动词或名词，可描述任何向外张开的形态，不限于衣物，如道路、烟雾、光束等。"
    }
  ]
}