{
  "word": "flared",
  "pronunciation": "flerd",
  "concise_definition": "adj. 张开的, 扩展的; v. 突然爆发, 燃烧; v.i. (衣服、管口等) 呈喇叭状张开",
  "forms": {
    "base_form": "flare",
    "third_person_singular": "flares",
    "past_tense": "flared",
    "past_participle": "flared",
    "present_participle": "flaring"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing something that widens outward from a narrow point, especially referring to clothing, architectural elements, or physical shapes.",
      "explanation_cn": "指从一个狭窄点向外逐渐变宽的，常用于描述服装、建筑构件或物理形状。",
      "example_en": "She wore a flared skirt that swished as she walked.",
      "example_cn": "她穿着一条喇叭裙，走路时裙摆摇曳。"
    },
    {
      "pos": "verb",
      "explanation_en": "To burn or shine suddenly and brightly, often with a burst of flame or light.",
      "explanation_cn": "指突然猛烈地燃烧或发光，常伴有火焰或光线的迸发。",
      "example_en": "The match flared brightly as she struck it.",
      "example_cn": "她划火柴时，火苗突然明亮地燃起。"
    },
    {
      "pos": "verb",
      "explanation_en": "To suddenly become angry or violent, often used to describe emotions or conflicts intensifying rapidly.",
      "explanation_cn": "指情绪或冲突突然加剧、爆发，常用于描述愤怒或争执的突然升级。",
      "example_en": "Tensions flared between the two teams after the controversial goal.",
      "example_cn": "在那个有争议的进球后，两队之间的紧张关系迅速激化。"
    },
    {
      "pos": "verb",
      "explanation_en": "To spread outward, especially referring to the shape of a garment, pipe, or other object that widens at the end.",
      "explanation_cn": "指（衣物、管道或其他物体）末端向外张开，呈喇叭状。",
      "example_en": "The trumpet's bell flares dramatically to amplify the sound.",
      "example_cn": "小号的喇叭口大幅张开以放大声音。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "widened",
      "analysis": "“Widened” (变宽) 是一个中性、通用的描述，仅表示宽度增加，不强调形状变化或动态过程。而 “flared” 特指从狭窄处向外呈弧形或喇叭状扩展，带有视觉上的动态感和形态特征，常用于描述服装、乐器或火焰等具有特定轮廓的物体。"
    },
    {
      "word_to_compare": "blazed",
      "analysis": "“Blazed” (燃烧/闪耀) 强调火焰或光亮的强烈、持续和耀眼，常用于描述大火或耀眼光芒，带有更强烈的能量感和破坏性。而 “flared” 描述的是短暂、突发的光或火的迸发，更强调瞬间性而非持续性。"
    },
    {
      "word_to_compare": "burst",
      "analysis": "“Burst” (爆发) 指突然破裂或释放，常伴随物理性爆炸或情绪失控，强调破坏性和不可控性。而 “flared” 虽也表示突然性，但更侧重于形态扩展或情绪的短暂激化，不一定伴随破裂或毁灭，语义更温和、更具形态描述性。"
    }
  ]
}