{
  "word": "flare",
  "pronunciation": "flair",
  "concise_definition": "n. 闪光, 火焰, 突发; v. 闪光, 突然燃烧, 暴发",
  "forms": {
    "third_person_singular": "flares",
    "past_tense": "flared",
    "past_participle": "flared",
    "present_participle": "flaring"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sudden, bright burst of light or flame, often used for signaling or as a result of uncontrolled combustion.",
      "explanation_cn": "指突然爆发的强烈光亮或火焰，常用于信号传递，或由失控燃烧引起。",
      "example_en": "The sailors launched a flare to signal for help in the dark ocean.",
      "example_cn": "水手们在漆黑的海洋中发射了一枚信号弹以求救。"
    },
    {
      "pos": "noun",
      "explanation_en": "A widening part of a garment, especially at the bottom of a skirt or pants, creating a bell-like shape.",
      "explanation_cn": "指服装的扩大部分，尤指裙子或裤子下摆呈钟形展开的部分。",
      "example_en": "She wore a dress with a dramatic flare at the hem that swished as she walked.",
      "example_cn": "她穿了一条裙摆大幅外扩的连衣裙，走路时裙摆摇曳生姿。"
    },
    {
      "pos": "verb",
      "explanation_en": "To burn or shine suddenly and brightly, often with an uncontrolled or intense burst.",
      "explanation_cn": "指突然猛烈地燃烧或发光，常带有失控或强烈爆发的特征。",
      "example_en": "The old furnace flared up when the gas was turned on.",
      "example_cn": "当煤气打开时，旧炉子突然猛烈燃烧起来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To become suddenly angry or intense, especially in the context of emotions, conflicts, or conditions.",
      "explanation_cn": "指情绪、冲突或状况突然变得激烈或爆发。",
      "example_en": "Tensions flared between the two nations after the border incident.",
      "example_cn": "边境事件后，两国之间的紧张局势突然加剧。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "glow",
      "analysis": "“Glow”（发光）指持续、柔和、稳定的光亮，通常不具爆发性或强烈性，如炭火余温或皮肤泛红。而 “flare” 强调突然、短暂、强烈的光或火，具有爆发性和不稳定性。"
    },
    {
      "word_to_compare": "flash",
      "analysis": "“Flash”（闪现）指极短暂、瞬间的光亮或动作，常用于描述闪电或相机闪光，强调速度而非持续性。而 “flare” 的光或火持续时间稍长，且常伴随热量或能量的释放，更具物理存在感。"
    },
    {
      "word_to_compare": "burst",
      "analysis": "“Burst”（爆发）是一个更通用的词，可指任何突然的破裂或释放（如笑声、水压、情绪），不特指光或火。而 “flare” 专指光、火或情绪以明亮、炽热的方式突然爆发，具有视觉和温度上的具体意象。"
    }
  ]
}