{
  "word": "flashes",
  "pronunciation": "flash·iz",
  "concise_definition": "n. 闪光, 瞬间, 闪现; v. 闪烁, 闪现, 突然出现",
  "forms": {
    "singular": "flash",
    "base_form": "flash"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sudden, brief burst of light, often intense and transient, such as from a camera, lightning, or a reflective surface.",
      "explanation_cn": "指突然而短暂的强光爆发，例如来自相机、闪电或反光表面的光。",
      "example_en": "A flash of lightning illuminated the entire sky for a moment.",
      "example_cn": "一道闪电瞬间照亮了整个天空。"
    },
    {
      "pos": "noun",
      "explanation_en": "A very short period of time; a momentary glimpse or occurrence of something, often used metaphorically.",
      "explanation_cn": "指极短的时间；某事物的瞬间出现或一闪而过的印象，常用于比喻。",
      "example_en": "She had a flash of insight that solved the mystery.",
      "example_cn": "她灵光一现，解开了这个谜团。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden display or display of something, such as emotion, wealth, or color, often in a showy or attention-grabbing way.",
      "explanation_cn": "指某种事物（如情绪、财富或色彩）的突然展现，常带有炫耀或引人注目的意味。",
      "example_en": "The parade was full of flashes of color and music.",
      "example_cn": "游行中充满了五彩缤纷的景象和音乐。"
    },
    {
      "pos": "verb",
      "explanation_en": "To emit light in brief, rapid bursts, often intermittently or unpredictably.",
      "explanation_cn": "指以短暂、快速的 bursts 发出光，通常是间歇性或不可预测的。",
      "example_en": "The signal light flashed red as the train approached.",
      "example_cn": "火车接近时，信号灯闪烁着红光。"
    },
    {
      "pos": "verb",
      "explanation_en": "To appear suddenly and briefly, especially in the mind or in visual perception.",
      "explanation_cn": "指突然且短暂地出现，尤指在脑海中或视觉感知中。",
      "example_en": "A memory of her childhood flashed through his mind.",
      "example_cn": "他脑海中突然闪现出童年的回忆。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "glow",
      "analysis": "“Glow”（发光）指持续、柔和、均匀的光，通常不闪烁或中断，强调温暖或内在的光亮，如炉火或晚霞。而 “flash” 是瞬间、强烈、断续的光，强调突然性和短暂性。"
    },
    {
      "word_to_compare": "spark",
      "analysis": "“Spark”（火花）指微小、细碎、常呈颗粒状的光点，多由摩擦或电击产生，具有物理性、可触性，如打火机的火花。而 “flash” 更广泛，可指大范围、视觉上更显著的光爆发，不一定是颗粒状。"
    },
    {
      "word_to_compare": "glimmer",
      "analysis": "“Glimmer”（微光）指微弱、模糊、几乎难以察觉的光，常带有希望或神秘的意味，如远处的烛光。而 “flash” 是明亮、强烈、引人注意的瞬间光亮，两者在强度和感知上形成鲜明对比。"
    }
  ]
}