{
  "word": "flashing",
  "pronunciation": "flash·ing",
  "concise_definition": "adj. 闪烁的, 闪现的; n. 闪光, 闪烁",
  "forms": {
    "base_form": "flash",
    "comparative": "flashier",
    "superlative": "flashiest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Characterized by rapid, intermittent bursts of light; moving or appearing in quick, bright bursts.",
      "explanation_cn": "以快速、间歇性的光亮为特征；以迅速、明亮的闪烁方式出现或移动。",
      "example_en": "The flashing neon signs lit up the entire street.",
      "example_cn": "闪烁的霓虹灯照亮了整条街道。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used to describe something that is showy, gaudy, or superficially impressive but lacking in substance.",
      "explanation_cn": "形容某物华丽、俗艳或表面上令人印象深刻，但缺乏实质内容。",
      "example_en": "He wore a flashing suit that drew attention but said nothing about his taste.",
      "example_cn": "他穿着一件闪亮的西装，吸引了目光，却丝毫体现不出他的品味。"
    },
    {
      "pos": "noun",
      "explanation_en": "A brief, sudden burst of light or a momentary visual display.",
      "explanation_cn": "短暂而突然的光亮或瞬间的视觉展示。",
      "example_en": "A flashing of lightning revealed the dark silhouette of the trees.",
      "example_cn": "一道闪电闪过，映出了树木的黑色剪影。"
    },
    {
      "pos": "noun",
      "explanation_en": "In photography or film, a rapid sequence of images or light signals used for emphasis or effect.",
      "explanation_cn": "在摄影或电影中，为强调或制造效果而使用的快速图像序列或光信号。",
      "example_en": "The director used a flashing effect to convey the character's disorientation.",
      "example_cn": "导演使用了闪烁效果来表现角色的迷失感。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "glowing",
      "analysis": "“Glowing”（发光的）指持续、柔和、均匀的光亮，通常带有温暖或内在的特质，如火焰或晚霞。而 “flashing” 强调的是短暂、断续、突然的光亮，具有动态和刺激性，常用于警示或吸引注意。"
    },
    {
      "word_to_compare": "sparkling",
      "analysis": "“Sparkling”（闪烁的）通常形容细小、密集、晶莹的光点，如钻石或水面反光，带有优雅、精致的意味。而 “flashing” 更粗犷、强烈，常用于警示灯、广告牌等具有冲击力的视觉场景。"
    },
    {
      "word_to_compare": "flickering",
      "analysis": "“Flickering”（摇曳的）指不稳定、微弱、断断续续的光，常因能源不足或风力影响，如烛光。它带有脆弱、即将熄灭的暗示。而 “flashing” 是有规律或故意的强光爆发，通常具有目的性，如交通信号或警报。"
    }
  ]
}