{
  "word": "flash",
  "pronunciation": "flash",
  "concise_definition": "n. 闪光, 瞬间; v. 闪烁, 闪现, 快速展示",
  "forms": {
    "third_person_singular": "flashes",
    "past_tense": "flashed",
    "past_participle": "flashed",
    "present_participle": "flashing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sudden, brief burst of light, often intense and startling, such as from a camera, lightning, or a signal.",
      "explanation_cn": "指突然而短暂的强光爆发，通常令人惊讶，例如来自相机、闪电或信号灯的光。",
      "example_en": "A flash of lightning illuminated the entire sky for a moment.",
      "example_cn": "一道闪电瞬间照亮了整个天空。"
    },
    {
      "pos": "noun",
      "explanation_en": "A very short period of time; a momentary occurrence or glimpse.",
      "explanation_cn": "指极短的时间；一次短暂的出现或一瞥。",
      "example_en": "She had a flash of insight that solved the mystery.",
      "example_cn": "她灵光一现，解开了这个谜题。"
    },
    {
      "pos": "verb",
      "explanation_en": "To emit or reflect light in quick, intermittent bursts, often brightly or conspicuously.",
      "explanation_cn": "指以快速、间歇的方式发出或反射光线，通常明亮而显眼。",
      "example_en": "The traffic light flashed red as the car approached.",
      "example_cn": "汽车接近时，交通灯闪烁红光。"
    },
    {
      "pos": "verb",
      "explanation_en": "To display something quickly or briefly, especially to attract attention or convey information suddenly.",
      "explanation_cn": "指快速或短暂地展示某物，尤其是为了吸引注意或突然传达信息。",
      "example_en": "He flashed his ID to the security guard and walked through the gate.",
      "example_cn": "他向保安快速出示了身份证，然后走过了大门。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or act with great speed or suddenness, often in a way that is startling or unexpected.",
      "explanation_cn": "指以极快或突然的方式移动或行动，常带有令人惊讶或意外的性质。",
      "example_en": "The car flashed past us on the highway.",
      "example_cn": "那辆车从我们身边疾驰而过。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "glow",
      "analysis": "“Glow”（发光）指持续、柔和、均匀的光，通常不刺眼，如萤火虫或暖灯的光。而 “flash” 强调瞬间、强烈、短暂的光亮，具有突发性和冲击力。"
    },
    {
      "word_to_compare": "spark",
      "analysis": "“Spark”（火花）通常指微小、细碎、跳跃性的光点，常伴随摩擦或电击产生，具有物理接触的起源。而 “flash” 更广泛，可指大范围、高亮度的瞬间光亮，不一定由接触产生，如闪电或相机闪光。"
    },
    {
      "word_to_compare": "flit",
      "analysis": "“Flit”（飞掠）强调快速移动的动作，常用于昆虫或轻盈物体的飘忽运动，侧重于轨迹而非视觉效果。而 “flash” 虽也可用于快速移动，但核心含义是光的瞬间显现或视觉上的突显，更强调感知而非动作本身。"
    }
  ]
}