{
  "word": "fleet",
  "pronunciation": "fleet",
  "concise_definition": "n. 舰队, 车队; adj. 快速的, 敏捷的; v. (使) 快速移动",
  "forms": {
    "plural": "fleets",
    "third_person_singular": "fleets",
    "past_tense": "fleeted",
    "past_participle": "fleeted",
    "present_participle": "fleeting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A group of ships or vehicles operating together under the same ownership or command, often for military, commercial, or transportation purposes.",
      "explanation_cn": "指在相同所有者或指挥下共同运作的一组船舶或车辆，常用于军事、商业或运输目的。",
      "example_en": "The navy deployed its entire fleet to patrol the disputed waters.",
      "example_cn": "海军出动了整个舰队巡逻争议水域。"
    },
    {
      "pos": "noun",
      "explanation_en": "A collection of vehicles owned or operated by a single organization, such as a company's delivery trucks or taxis.",
      "explanation_cn": "指由单一组织拥有或运营的车辆集合，如公司的送货卡车或出租车队。",
      "example_en": "The logistics company maintains a fleet of over 500 electric vans.",
      "example_cn": "这家物流公司拥有超过500辆电动货车的车队。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Moving or capable of moving with great speed; swift or agile.",
      "explanation_cn": "形容移动迅速或具有极快速度的；敏捷的。",
      "example_en": "The fleet-footed runner outpaced all his competitors in the final lap.",
      "example_cn": "这位脚步敏捷的跑步者在最后一圈中超过了所有对手。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or cause to move quickly, often in a fleeting or transient manner.",
      "explanation_cn": "指快速移动或使某物快速移动，常带有短暂、转瞬即逝的意味。",
      "example_en": "Time fleets when you're having fun.",
      "example_cn": "当你玩得开心时，时间飞逝。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fleet",
      "analysis": "“Fleet” 作为名词时，强调的是‘一组有组织的交通工具’，而 “convoy”（护航队）更强调在护送或保护下集体行进，常用于军事或危险环境。例如，商船队可能有军舰护航，这时是 convoy，但没有护航时仍是 fleet。"
    },
    {
      "word_to_compare": "group",
      "analysis": "“Group” (群体) 是一个泛指的集合词，适用于任何事物的集合，无特定组织或功能含义。而 “fleet” 特指交通工具的集合，具有明确的用途和管理结构，语义更专业、具体。"
    },
    {
      "word_to_compare": "swift",
      "analysis": "“Swift” (迅速的) 是一个通用形容词，描述任何动作或过程的速度快，而 “fleet” 作为形容词时更文学化、诗意，常用于描述人或动物的敏捷（如 fleet-footed），且多用于固定搭配，使用频率远低于 “swift”。"
    },
    {
      "word_to_compare": "hurry",
      "analysis": "“Hurry” (匆忙) 是一个动词或名词，强调因紧迫感而加快速度，常带有焦虑或仓促的语义色彩。而 “fleet” 作为动词时，描述的是时间或事物自然、无声地快速流逝，不带情绪，更具哲理性。"
    }
  ]
}