{
  "word": "fleece",
  "pronunciation": "flees",
  "concise_definition": "n. 羊毛, 羊毛织物; v. 欺骗, 剥削, 剪毛",
  "forms": {
    "third_person_singular": "fleeces",
    "past_tense": "fleeced",
    "past_participle": "fleeced",
    "present_participle": "fleecing",
    "plural": "fleeces"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The soft, curly wool of a sheep, especially when shorn and processed into a thick, warm fabric used for clothing or blankets.",
      "explanation_cn": "指绵羊身上柔软卷曲的羊毛，尤其指被剪下并加工成厚实保暖的织物，常用于制作衣物或毯子。",
      "example_en": "She wore a cozy fleece jacket to stay warm during the winter hike.",
      "example_cn": "她穿着一件舒适的羊毛夹克，以便在冬季徒步时保暖。"
    },
    {
      "pos": "noun",
      "explanation_en": "A synthetic fabric made to resemble sheep's wool, commonly used in outdoor apparel for its insulation properties.",
      "explanation_cn": "指一种模仿羊毛的合成织物，因其良好的保温性能而广泛用于户外服装。",
      "example_en": "Many hiking brands now use recycled polyester fleece for eco-friendly outerwear.",
      "example_cn": "许多户外品牌现在使用再生聚酯羊毛织物制作环保外套。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cheat or swindle someone, especially by charging them an unfairly high price or taking advantage of their trust.",
      "explanation_cn": "指通过收取过高价格或利用他人信任来欺骗或剥削某人。",
      "example_en": "The tourist was fleeced by a taxi driver who charged him triple the normal fare.",
      "example_cn": "这位游客被一名出租车司机敲诈，被收取了三倍于正常价格的车费。"
    },
    {
      "pos": "verb",
      "explanation_en": "To shear wool from sheep or other animals, typically as part of farming or animal husbandry.",
      "explanation_cn": "指从绵羊或其他动物身上剪下羊毛，通常是农业或畜牧业的一部分。",
      "example_en": "The shepherd fleeces the sheep every spring before the weather gets too hot.",
      "example_cn": "牧羊人每年春天天气变热前都会给绵羊剪毛。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cheat",
      "analysis": "“Cheat”（欺骗）是一个更通用的词，泛指任何形式的不诚实行为，如作弊、撒谎或伪造。而 “fleece” 特指通过经济手段（如高价欺诈）剥削他人，带有强烈的金钱掠夺色彩，语义更具体、更具社会批判性。"
    },
    {
      "word_to_compare": "rob",
      "analysis": "“Rob”（抢劫）强调使用暴力或威胁非法夺取财物，是物理性的犯罪行为；而 “fleece” 通常是通过心理操纵、信息不对称或价格欺诈实现的，不涉及直接暴力，属于非暴力的经济剥削。"
    },
    {
      "word_to_compare": "shear",
      "analysis": "“Shear”（剪）是中性词，仅指物理上剪下毛发或羊毛，不带任何负面含义；而 “fleece” 作为动词时，虽然也可指剪羊毛，但更常用于比喻义，强调剥削，因此在语义上更丰富、更具情感色彩。"
    }
  ]
}