{
  "word": "fling",
  "pronunciation": "fling",
  "concise_definition": "v. 扔, 掷; n. 短暂的放纵, 短暂的恋情",
  "forms": {
    "third_person_singular": "flings",
    "past_tense": "flung",
    "past_participle": "flung",
    "present_participle": "flinging"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To throw something with force or carelessness, often in a sudden or violent motion.",
      "explanation_cn": "指以大力或漫不经心的方式将某物抛出，通常带有突然或猛烈的动作。",
      "example_en": "He flung his coat onto the chair and rushed out the door.",
      "example_cn": "他把外套往椅子上一扔，就冲出了门。"
    },
    {
      "pos": "verb",
      "explanation_en": "To engage in a brief, often reckless or passionate romantic or sexual relationship, usually without long-term commitment.",
      "explanation_cn": "指进行一段短暂、常常是冲动或充满激情的浪漫或性关系，通常没有长期承诺。",
      "example_en": "They had a summer fling while studying abroad.",
      "example_cn": "他们在国外留学期间有过一段夏日恋情。"
    },
    {
      "pos": "noun",
      "explanation_en": "A short, casual romantic or sexual relationship, typically lasting only a brief period of time.",
      "explanation_cn": "指一段短暂、随意的浪漫或性关系，通常只持续很短的时间。",
      "example_en": "Their fling ended when she returned home after the semester.",
      "example_cn": "学期结束后她回家，这段短暂恋情也就结束了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A brief period of unrestrained behavior or indulgence, often involving fun, excess, or rebellion.",
      "explanation_cn": "指一段不受约束的行为或放纵时期，常涉及享乐、过度或反叛。",
      "example_en": "After years of strict discipline, she gave herself a fling at the music festival.",
      "example_cn": "在多年严格自律之后，她在音乐节上放纵了一回。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "throw",
      "analysis": "“Throw” (扔) 是最通用的动词，指任何将物体从手中释放并使其飞行的动作，中性且无情感色彩。而 “fling” 强调动作的突然性、力量感或情绪化，常带有轻蔑、愤怒或随意的语气。"
    },
    {
      "word_to_compare": "toss",
      "analysis": "“Toss” (抛) 通常指轻柔、随意或无意识的投掷，如 toss a ball 或 toss your hair。它比 “fling” 更温和、更不经意，缺乏后者所蕴含的强烈情绪或暴力感。"
    },
    {
      "word_to_compare": "affair",
      "analysis": "“Affair” (风流韵事) 与 “fling” 在指代短暂恋情时可互换，但 “affair” 更正式、更常用于书面语，且可能暗示更复杂或长期的隐秘关系；而 “fling” 更口语化，强调短暂、轻率和无负担的性质。"
    },
    {
      "word_to_compare": "spree",
      "analysis": "“Spree” (放纵狂欢) 指一段持续的、过度的享乐行为，如 shopping spree 或 drinking spree，强调行为的持续性和规模；而 “fling” 作为名词时更侧重于情感或关系的短暂性，而非行为的持续时间。"
    }
  ]
}