{
  "word": "flips",
  "pronunciation": "flips",
  "concise_definition": "n. 翻转, 翻筋斗; v. 翻转, 翻筋斗, 突然改变",
  "forms": {
    "base_form": "flip",
    "third_person_singular": "flips",
    "past_tense": "flipped",
    "past_participle": "flipped",
    "present_participle": "flipping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To turn something over suddenly or completely, especially so that the top becomes the bottom and vice versa.",
      "explanation_cn": "指突然或完全地将某物翻转，使上下颠倒。",
      "example_en": "She flipped the pancake with a spatula.",
      "example_cn": "她用锅铲把煎饼翻了个面。"
    },
    {
      "pos": "verb",
      "explanation_en": "To perform a gymnastic movement in which the body turns completely over in the air, typically head over heels.",
      "explanation_cn": "指在空中完成一个身体完全翻转的体操动作，通常是头朝下翻筋斗。",
      "example_en": "The athlete flipped backward off the springboard and landed perfectly.",
      "example_cn": "运动员从跳板后空翻，完美落地。"
    },
    {
      "pos": "verb",
      "explanation_en": "To change something suddenly and often unexpectedly, especially an opinion, attitude, or situation.",
      "explanation_cn": "指突然且常常出人意料地改变某事物，尤其是观点、态度或状况。",
      "example_en": "The public flipped on the issue after the scandal broke.",
      "example_cn": "丑闻曝光后，公众对这一问题的态度发生了逆转。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden turn or reversal, especially of position or attitude; often used in plural to refer to acrobatic flips.",
      "explanation_cn": "指位置或态度的突然翻转；复数形式常指体操中的翻筋斗动作。",
      "example_en": "The gymnast performed three flawless flips during her routine.",
      "example_cn": "体操运动员在她的表演中完成了三个完美的翻筋斗。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "turn",
      "analysis": "“Turn” (转动) 是一个更通用的词，指任何方向上的旋转，可以是部分或连续的，不一定涉及完全翻转。而 “flip” 强调的是快速、突然、彻底的上下或前后颠倒，动作更剧烈、更明确。"
    },
    {
      "word_to_compare": "tumble",
      "analysis": "“Tumble” (翻滚) 指不规则、失控的滚动或跌倒，常带有混乱或意外的意味，如孩子从楼梯上滚下。而 “flip” 是有控制的、有目的的翻转动作，尤其在体操或技巧动作中。"
    },
    {
      "word_to_compare": "reverse",
      "analysis": "“Reverse” (逆转) 更常用于抽象概念，如政策、方向或顺序的反转，强调逻辑或功能上的对立。而 “flip” 既可以用于物理动作，也可用于态度的突然转变，语气更口语化、生动，常带戏剧性。"
    }
  ]
}