{
  "word": "flipping",
  "pronunciation": "flip·ing",
  "concise_definition": "adj. 极度的, 非常的 (俚语); v. 翻转, 翻动, 翻页, 倒卖",
  "forms": {
    "base_form": "flip",
    "third_person_singular": "flips",
    "past_tense": "flipped",
    "past_participle": "flipped",
    "present_participle": "flipping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To turn something over or upside down with a quick motion, often using the hand or a sudden movement.",
      "explanation_cn": "指用手或突然的动作将某物翻转、倒置，通常指快速的物理动作。",
      "example_en": "She flipped the pancake with a spatula.",
      "example_cn": "她用锅铲把煎饼翻了个面。"
    },
    {
      "pos": "verb",
      "explanation_en": "To turn the pages of a book or document quickly, often in a casual or impatient manner.",
      "explanation_cn": "指快速翻动书本或文件的页面，常带有随意或不耐烦的意味。",
      "example_en": "He was flipping through the magazine while waiting for his coffee.",
      "example_cn": "他一边等咖啡，一边随意翻着杂志。"
    },
    {
      "pos": "verb",
      "explanation_en": "To buy something with the intention of selling it quickly for a profit, especially in real estate or goods.",
      "explanation_cn": "指以快速转售获利为目的购买物品，尤指房地产或商品的倒卖行为。",
      "example_en": "They bought the old house, renovated it, and flipped it for double the price.",
      "example_cn": "他们买下这栋老房子，翻新后以两倍的价格卖了出去。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used as an intensifier in informal or slang contexts, often expressing frustration, surprise, or emphasis (euphemism for 'f***ing').",
      "explanation_cn": "在非正式或俚语语境中用作强调词，常表达沮丧、惊讶或加强语气（为 'f***ing' 的委婉说法）。",
      "example_en": "This is flipping impossible to fix!",
      "example_cn": "这根本没法修啊！"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "turn",
      "analysis": "“Turn” (转动) 是一个更通用的词，指任何方向的旋转或改变朝向，不强调速度或动作的突然性。而 “flip” 特指快速、突然的翻转，常带有轻微的暴力或轻率感，如翻页、翻面。"
    },
    {
      "word_to_compare": "reverse",
      "analysis": "“Reverse” (反转) 强调方向或顺序的完全相反，常用于抽象概念（如政策、决定）或机械操作（如倒车），具有目的性和系统性。而 “flip” 更偏向于物理动作或口语化表达，不强调逻辑上的对立。"
    },
    {
      "word_to_compare": "resell",
      "analysis": "“Resell” (再售) 是一个中性、正式的商业术语，仅指再次出售商品，不隐含快速获利或投机意图。而 “flip” 在商业语境中特指短期投机性转卖，常带有赚快钱的负面或非正式色彩。"
    },
    {
      "word_to_compare": "damn",
      "analysis": "“Damn” (该死的) 是一个常见的语气加强词，用于表达愤怒或不满，但语义较温和。而 “flipping” 作为俚语强调词，语气更轻、更口语化，常用于避免使用更粗俗的词汇，适合在半正式场合使用。"
    }
  ]
}