{
  "word": "floating",
  "pronunciation": "floh·tihng",
  "concise_definition": "adj. 漂浮的, 浮动的, 浮动的; n. 漂浮物",
  "forms": {
    "base_form": "float",
    "present_participle": "floating",
    "past_tense": "floated",
    "past_participle": "floated"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Designed to remain on the surface of a liquid without sinking; not fixed or anchored in place.",
      "explanation_cn": "设计为停留在液体表面而不下沉；未被固定或锚定的位置。",
      "example_en": "The floating island in the lake was made of woven reeds and soil.",
      "example_cn": "湖中的浮岛由编织的芦苇和土壤构成。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Not firmly established or fixed; changing or variable, especially in value, position, or status.",
      "explanation_cn": "未牢固确立或固定；价值、位置或状态不稳定或变化的，尤指经济或金融领域中的浮动状态。",
      "example_en": "The company uses a floating interest rate that adjusts monthly based on market conditions.",
      "example_cn": "该公司采用根据市场状况每月调整的浮动利率。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used to describe a person or thing that lacks a fixed role, residence, or direction; transient or rootless.",
      "explanation_cn": "用于描述缺乏固定角色、居所或方向的人或事物；短暂的、无根的。",
      "example_en": "After graduating, she became a floating worker, moving between cities for short-term jobs.",
      "example_cn": "毕业后，她成为了一名流动工人，辗转于不同城市从事短期工作。"
    },
    {
      "pos": "noun",
      "explanation_en": "An object or person that floats on water or another liquid, especially one that is loose or unattached.",
      "explanation_cn": "漂浮在水或其他液体上的物体或人，尤指松散或未固定的漂浮物。",
      "example_en": "The river was littered with floating debris after the storm.",
      "example_cn": "风暴过后，河面上漂满了碎片。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "floating",
      "analysis": "“Floating” 作为形容词时，强调‘未固定’或‘可移动’的状态，常用于物理漂浮（如浮岛）或抽象概念（如浮动利率）。与之相比，‘adrift’ 更强调失去控制、无方向的漂浮，带有消极或无助的语义色彩，而 ‘floating’ 可以是中性或技术性的描述。"
    },
    {
      "word_to_compare": "hovering",
      "analysis": "“Hovering” (悬停) 指物体在空中保持相对静止的位置，通常在一定高度上，如直升机悬停或蜜蜂悬停在花前。它强调垂直方向的稳定，而 ‘floating’ 更强调在液体表面或介质中随流移动，方向性更弱。"
    },
    {
      "word_to_compare": "transient",
      "analysis": "“Transient” (短暂的) 强调时间上的短暂性，常用于描述人、现象或状态的临时性，如‘transient guest’（临时访客）。而 ‘floating’ 在描述人时（如 floating worker）虽也含临时性，但更侧重空间上的流动性与无固定居所，语义重心在‘移动’而非‘短暂’。"
    }
  ]
}