{
  "word": "float",
  "pronunciation": "flōt",
  "concise_definition": "v. 漂浮, 浮动; n. 漂浮物, 浮动, 游行花车",
  "forms": {
    "third_person_singular": "floats",
    "past_tense": "floated",
    "past_participle": "floated",
    "present_participle": "floating"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To rest or move on or near the surface of a liquid or gas without sinking, due to lower density or buoyancy.",
      "explanation_cn": "指由于密度较低或浮力作用，在液体或气体表面或附近停留或移动而不下沉。",
      "example_en": "The leaves floated gently on the surface of the pond.",
      "example_cn": "树叶轻轻漂浮在池塘的水面上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to move or remain suspended in a liquid or air, often temporarily or without fixed position.",
      "explanation_cn": "指使某物在液体或空气中悬浮或移动，通常为暂时性或无固定位置的状态。",
      "example_en": "The company plans to float its shares on the stock market next year.",
      "example_cn": "该公司计划明年将其股票在股市上市。"
    },
    {
      "pos": "verb",
      "explanation_en": "To propose or suggest an idea, plan, or proposal for consideration, especially informally.",
      "explanation_cn": "指非正式地提出一个想法、计划或建议供他人考虑。",
      "example_en": "They floated the idea of a new marketing campaign during the meeting.",
      "example_cn": "他们在会议上提出了一个新营销活动的想法。"
    },
    {
      "pos": "noun",
      "explanation_en": "A decorated vehicle, often on wheels, designed to move slowly in a parade, typically carrying performers or thematic displays.",
      "explanation_cn": "指一种装饰华丽的车辆，通常装有轮子，用于游行中缓慢行进，承载表演者或主题展示。",
      "example_en": "The children cheered as the giant balloon float passed by in the Thanksgiving Day parade.",
      "example_cn": "当巨大的气球花车在感恩节游行中经过时，孩子们欢呼起来。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small object or device designed to stay on the surface of water, used in fishing to indicate when a fish bites.",
      "explanation_cn": "指一种用于钓鱼的小型装置，设计为浮在水面上，用以指示鱼是否咬钩。",
      "example_en": "She adjusted the float on her fishing line to catch fish at a deeper level.",
      "example_cn": "她调整了鱼线上的浮标，以便在更深的水层钓鱼。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "drift",
      "analysis": "“Drift” (漂移) 强调被动地随水流、风或趋势缓慢移动，通常缺乏方向性或控制力，带有无目的性。而 “float” 更强调因浮力而自然停留在表面，可能包含一定程度的主动或可控状态（如船只漂浮）。"
    },
    {
      "word_to_compare": "hover",
      "analysis": "“Hover” (悬停) 指在空中保持相对固定位置，通常由动力维持（如直升机或无人机），强调静止或微动的悬浮状态。而 “float” 更常用于液体表面或轻质物体的自然漂浮，不依赖持续动力。"
    },
    {
      "word_to_compare": "rise",
      "analysis": "“Rise” (上升) 指从低处向高处移动，强调垂直方向的位移，常用于价格、温度、水位等抽象或物理量的增加。而 “float” 不强调方向，仅表示停留在表面或悬浮状态，可能水平移动，也可能静止。"
    }
  ]
}