{
  "word": "flock",
  "pronunciation": "flahk",
  "concise_definition": "n. 群, 一群；v. 聚集, 群聚",
  "forms": {
    "plural": "flocks",
    "third_person_singular": "flocks",
    "past_tense": "flocked",
    "past_participle": "flocked",
    "present_participle": "flocking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A large group of birds, especially when flying or feeding together, or a similar group of animals such as sheep or goats.",
      "explanation_cn": "指大量鸟类（尤其在飞行或觅食时）聚集在一起，也可用于描述羊、山羊等动物的群体。",
      "example_en": "A flock of geese flew south for the winter.",
      "example_cn": "一群大雁飞往南方过冬。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large group of people gathered together, often for a common purpose or attraction, such as tourists or worshippers.",
      "explanation_cn": "指大量人群因共同目的或吸引力而聚集在一起，如游客、朝圣者等。",
      "example_en": "A flock of tourists gathered around the ancient temple.",
      "example_cn": "一群游客聚集在古庙周围。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or gather in a large group, often in a hurried or excited manner, typically toward a place or event.",
      "explanation_cn": "指大量人或动物以匆忙或兴奋的方式聚集到某地或某事件周围。",
      "example_en": "Shoppers flocked to the mall on the opening day of the sale.",
      "example_cn": "购物者在促销活动首日蜂拥至商场。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or behave in a way that resembles a flock of birds, often implying conformity or lack of individual initiative.",
      "explanation_cn": "指像鸟群一样行动，常暗示从众行为或缺乏个人主动性。",
      "example_en": "Young people tend to flock to trendy new cafes without thinking for themselves.",
      "example_cn": "年轻人往往不加思考地涌向流行的新开咖啡馆。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "herd",
      "analysis": "“Herd”（畜群）通常用于指大型陆地哺乳动物（如牛、马、大象）的群体，强调的是牲畜或野生动物的集体行为，语义更偏向农业或野生动物语境。而 “flock” 更常用于鸟类或人类群体，带有更强的轻盈、聚集或追随的意象。"
    },
    {
      "word_to_compare": "crowd",
      "analysis": "“Crowd”（人群）强调的是在有限空间内密集聚集的人群，通常具有临时性、无组织性，且不强调共同目标或移动性。而 “flock” 不仅可指人，还常用于动物，且隐含一种有方向性或目的性的聚集行为，如追随潮流或迁徙。"
    },
    {
      "word_to_compare": "swarm",
      "analysis": "“Swarm”（蜂拥）多用于昆虫（如蜜蜂、蚂蚁）或大量密集移动的生物，常带有负面或混乱的意味，如“蜂拥而至的蚊子”。而 “flock” 通常中性或正面，如鸟群迁徙或游客聚集，较少暗示混乱或侵扰。"
    }
  ]
}