{
  "word": "flooding",
  "pronunciation": "floo·ding",
  "concise_definition": "n. 洪水, 淹没, 大量涌入",
  "forms": {
    "base_form": "flood",
    "present_participle": "flooding",
    "past_tense": "flooded",
    "past_participle": "flooded"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The overflow of water onto land that is normally dry, typically caused by heavy rain, melting snow, or a dam breach.",
      "explanation_cn": "指水溢出到通常干燥的土地上，通常由暴雨、积雪融化或堤坝溃决引起。",
      "example_en": "The town was devastated by severe flooding after the river burst its banks.",
      "example_cn": "河流决堤后，小镇遭受了严重洪水的破坏。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large and overwhelming amount of something arriving or appearing at the same time, often beyond capacity.",
      "explanation_cn": "指大量事物在同一时间涌来或出现，通常超出承受能力。",
      "example_en": "There was a flooding of applications after the job posting went live.",
      "example_cn": "职位发布后，申请表如潮水般涌来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fill or cover an area completely with water, especially unexpectedly or uncontrollably.",
      "explanation_cn": "指突然或无法控制地用大量水填满或覆盖某个区域。",
      "example_en": "The basement flooded during the storm when the drainage system failed.",
      "example_cn": "排水系统失效后，地下室在暴风雨中被淹没了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To overwhelm with an excessive amount of something, such as information, requests, or people.",
      "explanation_cn": "指因数量过多而使某人或某系统不堪重负，如信息、请求或人员。",
      "example_en": "The customer service team was flooded with complaints after the website crash.",
      "example_cn": "网站崩溃后，客服团队收到了大量投诉。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "inundation",
      "analysis": "“Inundation” (淹没) 与 “flooding” 意义高度重叠，但更正式、书面化，常用于法律、科学或新闻报道中，强调被水完全覆盖的状态，较少用于比喻义。而 “flooding” 更口语化，且广泛用于比喻性语境，如信息过载。"
    },
    {
      "word_to_compare": "overflow",
      "analysis": "“Overflow” (溢出) 指容器或空间因容量不足而导致内容物超出边界，强调物理或数量上的超限，但不一定涉及大面积破坏。而 “flooding” 通常暗示更严重、更广泛的水灾或系统性过载，具有更强的破坏性含义。"
    },
    {
      "word_to_compare": "deluge",
      "analysis": "“Deluge” (暴雨/洪流) 是一个文学性更强的词，常用于强调极端、猛烈的水量或数量，带有戏剧性色彩。它比 “flooding” 更具情感强度，常用于比喻如‘信息的洪流’，但较少用于日常技术描述。"
    }
  ]
}