{
  "word": "floor",
  "pronunciation": "flawr",
  "concise_definition": "n. 地板, 层, 地面; v. 使震惊, 彻底击败",
  "forms": {
    "plural": "floors"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The lower surface of a room on which people walk; a solid, flat structure covering the bottom of a building or room.",
      "explanation_cn": "指房间内供人行走的底部表面；覆盖建筑物或房间底部的坚固、平坦结构。",
      "example_en": "She dropped her keys and they clattered on the wooden floor.",
      "example_cn": "她把钥匙掉在地上，钥匙在木地板上叮当作响。"
    },
    {
      "pos": "noun",
      "explanation_en": "A level or story of a building, especially one that is occupied or used for a specific purpose.",
      "explanation_cn": "指建筑物中的一个楼层或层面，通常用于特定用途或被占用。",
      "example_en": "The conference room is on the fifth floor of the office building.",
      "example_cn": "会议室位于办公楼的第五层。"
    },
    {
      "pos": "noun",
      "explanation_en": "The lowest limit or minimum level of something, especially in economic or political contexts.",
      "explanation_cn": "指某事物的最低限度或下限，尤其在经济或政治语境中。",
      "example_en": "The government set a price floor to protect farmers from market crashes.",
      "example_cn": "政府设定了价格下限，以保护农民免受市场崩盘的影响。"
    },
    {
      "pos": "verb",
      "explanation_en": "To shock or astonish someone completely; to render someone speechless or unable to react.",
      "explanation_cn": "指使某人完全震惊或惊讶，使其哑口无言或无法反应。",
      "example_en": "The news of his sudden resignation floored everyone in the company.",
      "example_cn": "他突然辞职的消息让公司所有人都大为震惊。"
    },
    {
      "pos": "verb",
      "explanation_en": "To defeat someone decisively or overwhelmingly, often in a competition or argument.",
      "explanation_cn": "指在竞争或辩论中彻底击败某人，使其毫无还手之力。",
      "example_en": "The champion floored his opponent with a single punch in the first round.",
      "example_cn": "冠军在第一回合一拳将对手击倒。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ground",
      "analysis": "“Ground”（地面）通常指自然的、未铺设的表面，如土地、泥土或户外的地面，强调与自然环境的联系；而 “floor” 专指人造的、室内建筑中的水平承重表面，具有明确的结构和功能。"
    },
    {
      "word_to_compare": "level",
      "analysis": "“Level”（层面）是一个更抽象的术语，可指任何层次或等级，如社会阶层、技能水平等；而 “floor” 在指建筑物的层时，是具体的空间单位，具有物理位置和可数性。"
    },
    {
      "word_to_compare": "base",
      "analysis": "“Base”（基础/底部）强调支撑性或起源性，常用于比喻意义，如‘政策的基础’；而 ‘floor’ 更强调作为承载表面的物理存在，即使在比喻用法中（如‘价格下限’），也保留了‘水平面’的意象。"
    }
  ]
}