{
  "word": "flops",
  "pronunciation": "flahps",
  "concise_definition": "n. 彻底失败, 失败的作品; v. 彻底失败, 崩溃",
  "forms": {
    "singular": "flop",
    "past_tense": "flopped",
    "past_participle": "flopped",
    "present_participle": "flopping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A complete and often public failure, especially of a performance, product, or venture that was expected to succeed.",
      "explanation_cn": "指一项本应成功却彻底失败的表演、产品或事业，通常伴随着公众的失望或嘲笑。",
      "example_en": "The new Broadway musical was a flop, closing after only three performances.",
      "example_cn": "这部新百老汇音乐剧惨遭失败，仅上演三场便被迫停演。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that fails to meet expectations or performs poorly, often in a humorous or ironic way.",
      "explanation_cn": "指一个未能达到预期或表现糟糕的人或事物，常带有幽默或讽刺意味。",
      "example_en": "He was considered a flop as a teacher but became a bestselling author later.",
      "example_cn": "他当老师时表现糟糕，但后来却成了畅销书作家。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fail completely, especially in a sudden or noticeable way, often after high expectations.",
      "explanation_cn": "指彻底失败，尤其在高期望之后突然或明显地崩溃。",
      "example_en": "The movie flopped at the box office despite its star-studded cast.",
      "example_cn": "尽管这部电影明星云集，票房却惨败。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fall or drop heavily and limply, often with a slapping sound.",
      "explanation_cn": "指沉重而无力地倒下或落下，常伴有拍打声。",
      "example_en": "The tired dog flopped down on the rug and fell asleep.",
      "example_cn": "那只疲惫的狗瘫倒在地毯上，睡着了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fail",
      "analysis": "“Fail” (失败) 是一个通用词，泛指未能达到目标，程度可轻可重。而 “flop” 特指彻底、戏剧性的失败，常带有公众关注和强烈反差，语气更强烈、更口语化。"
    },
    {
      "word_to_compare": "bomb",
      "analysis": "“Bomb” (惨败) 是俚语，常用于娱乐行业，指演出或电影彻底失败，与 “flop” 意义高度重叠，但 “bomb” 更具口语和非正式色彩，常用于美国英语。两者可互换，但 “flop” 更中性通用。"
    },
    {
      "word_to_compare": "collapse",
      "analysis": "“Collapse” (崩溃) 强调结构、系统或身体的突然瓦解，常用于物理或抽象系统（如经济、健康），带有严重后果的意味。而 “flop” 更多用于项目、表演或个人表现的失败，不必然涉及物理性崩塌。"
    }
  ]
}