{
  "word": "flotation",
  "pronunciation": "floh·shuh·n",
  "concise_definition": "n. 浮力, 浮选, 漂浮",
  "forms": {
    "plural": "flotations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The ability of an object to float on the surface of a liquid, due to the upward force exerted by the fluid that opposes the object's weight.",
      "explanation_cn": "指物体因液体对其施加的向上托力（浮力）而能够在液体表面漂浮的能力。",
      "example_en": "The design of the life jacket maximizes flotation to keep the wearer safe in water.",
      "example_cn": "救生衣的设计最大限度地增强了浮力，以确保穿戴者在水中安全。"
    },
    {
      "pos": "noun",
      "explanation_en": "A mineral processing technique in which air bubbles are introduced into a slurry to separate valuable minerals from waste material based on differences in surface properties.",
      "explanation_cn": "一种矿物加工技术，通过向矿浆中引入气泡，利用不同矿物表面性质的差异，将有价值的矿物与废料分离。",
      "example_en": "Flotation is widely used in mining to extract copper and gold from low-grade ores.",
      "example_cn": "浮选法广泛用于采矿业，从低品位矿石中提取铜和金。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or process of causing something to float, especially in a controlled or artificial manner (e.g., floating a balloon or a structure on water).",
      "explanation_cn": "指使某物漂浮的行为或过程，尤其指有控制或人为方式的漂浮（如让气球或结构物漂浮在水面上）。",
      "example_en": "The festival featured a spectacular flotation of lanterns on the river at night.",
      "example_cn": "节日当晚，河面上举行了壮观的灯笼漂浮活动。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "buoyancy",
      "analysis": "“Buoyancy”（浮力）是物理学中的专业术语，特指液体或气体对浸入其中的物体施加的向上托力，是一个精确的物理量。而 “flotation” 更侧重于描述物体漂浮的状态或实现漂浮的过程，常用于工程、工业或日常语境中，范围更广。"
    },
    {
      "word_to_compare": "floating",
      "analysis": "“Floating”（漂浮）是动词 “float” 的现在分词，强调动作本身或持续状态，常用于描述物体正在漂浮的过程。而 “flotation” 是名词，强调的是漂浮的机制、能力或技术性应用，如浮选法或浮力设计，更具抽象性和专业性。"
    },
    {
      "word_to_compare": "suspension",
      "analysis": "“Suspension”（悬浮）指固体颗粒均匀分散在液体或气体中但未沉降，颗粒仍受重力影响，整体不漂浮于表面。而 “flotation” 特指物体整体浮于液体表面，依靠的是密度差和浮力，而非分散状态。两者在物理机制和应用场景上截然不同。"
    }
  ]
}