{
  "word": "flow",
  "pronunciation": "flō",
  "concise_definition": "n. 流动, 流程, 趋势; v. 流动, 流淌, 连续进行",
  "forms": {
    "third_person_singular": "flows",
    "past_tense": "flowed",
    "past_participle": "flowed",
    "present_participle": "flowing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The continuous movement of a liquid, gas, or other substance in a particular direction, often through a channel or system.",
      "explanation_cn": "指液体、气体或其他物质沿特定方向持续移动的过程，通常通过某种通道或系统进行。",
      "example_en": "The flow of the river was strong after the heavy rain.",
      "example_cn": "大雨之后，河水的流速非常强劲。"
    },
    {
      "pos": "noun",
      "explanation_en": "A smooth, uninterrupted progression of events, ideas, or activities, often implying ease and natural rhythm.",
      "explanation_cn": "指事件、思想或活动的顺畅、不间断的进行，常暗示一种自然的节奏与轻松感。",
      "example_en": "The flow of the conversation was interrupted by a sudden phone call.",
      "example_cn": "对话的流畅性被一通突如其来的电话打断了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A general trend or direction of movement or change, especially in social, economic, or political contexts.",
      "explanation_cn": "指社会、经济或政治背景中的一种普遍趋势或发展方向。",
      "example_en": "The flow of migration toward urban areas has increased dramatically in recent decades.",
      "example_cn": "近年来，向城市迁移的人口趋势显著增加。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move continuously and smoothly in a particular direction, typically as a liquid, gas, or current.",
      "explanation_cn": "指像液体、气体或电流一样持续而顺畅地朝某个方向移动。",
      "example_en": "Tears flowed down her cheeks as she listened to the music.",
      "example_cn": "她听着音乐，泪水顺着脸颊流下。"
    },
    {
      "pos": "verb",
      "explanation_en": "To proceed smoothly and continuously without interruption, especially in thought, speech, or action.",
      "explanation_cn": "指思想、言语或行动顺畅连续地进行，无中断。",
      "example_en": "Her ideas flowed effortlessly during the brainstorming session.",
      "example_cn": "在头脑风暴会上，她的想法源源不断地涌现。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "stream",
      "analysis": "“Stream” (溪流/连续不断的事物) 通常指更细小、更集中的流动，常用于比喻思想、信息或数据的持续传递，如“信息流”。它比 “flow” 更具线性与定向性，且常用于科技语境。而 “flow” 更广泛，可指任何形态的连续运动，包括抽象概念。"
    },
    {
      "word_to_compare": "current",
      "analysis": "“Current” (水流/潮流) 强调一种在特定介质中（如水、空气、社会）的定向运动，常用于描述趋势或力量，如“社会潮流”或“电流”。它更侧重于“被推动”的状态，而 “flow” 更强调运动本身的过程与连续性。"
    },
    {
      "word_to_compare": "passage",
      "analysis": "“Passage” (通道/通过) 指的是一个空间或过程的“通过”行为，常用于描述时间的流逝（如“时间的流逝”）或物理通道（如“走廊”）。它强调的是“穿越”而非“流动”本身。而 “flow” 更关注物质或抽象事物的动态连续性，而非路径或边界。"
    }
  ]
}