{
  "word": "flows",
  "pronunciation": "flouz",
  "concise_definition": "n. 流动, 流程, 趋势; v. 流动, 流淌, 连续不断",
  "forms": {
    "base_form": "flow",
    "third_person_singular": "flows",
    "past_tense": "flowed",
    "past_participle": "flowed",
    "present_participle": "flowing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The continuous movement of a liquid, gas, or other substance through a channel or space, often in a smooth and steady manner.",
      "explanation_cn": "指液体、气体或其他物质通过通道或空间持续、平稳地移动。",
      "example_en": "The river flows gently through the valley, nourishing the surrounding ecosystem.",
      "example_cn": "河流缓缓流过山谷，滋养着周围的生态系统。"
    },
    {
      "pos": "noun",
      "explanation_en": "A smooth, uninterrupted progression or sequence of events, ideas, or processes, often implying efficiency or harmony.",
      "explanation_cn": "指事件、思想或过程的顺畅、不间断的进展或序列，常暗示效率或和谐。",
      "example_en": "The flow of traffic improved after the new signal system was installed.",
      "example_cn": "安装了新的信号系统后，交通流变得更加顺畅。"
    },
    {
      "pos": "noun",
      "explanation_en": "A dominant trend or direction in thought, culture, or activity, often reflecting widespread influence or momentum.",
      "explanation_cn": "指思想、文化或活动中占主导地位的趋势或方向，常反映广泛的影响或动力。",
      "example_en": "There is a growing flow of young people moving to urban centers for better opportunities.",
      "example_cn": "越来越多的年轻人流向城市中心以寻求更好的机会。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move continuously and smoothly in a particular direction, typically referring to liquids, gases, or abstract concepts like time or information.",
      "explanation_cn": "指以连续而平稳的方式朝特定方向移动，通常用于液体、气体，或时间、信息等抽象概念。",
      "example_en": "Tears flowed down her cheeks as she listened to the music.",
      "example_cn": "她听着音乐，泪水顺着脸颊流下。"
    },
    {
      "pos": "verb",
      "explanation_en": "To proceed or operate in a continuous, unimpeded manner, especially in systems, processes, or communication.",
      "explanation_cn": "指系统、流程或沟通以连续、无阻碍的方式运行或进行。",
      "example_en": "The negotiations are flowing smoothly despite the initial disagreements.",
      "example_cn": "尽管最初存在分歧，但谈判进展顺利。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "stream",
      "analysis": "“Stream” (溪流/连续流) 通常指更窄、更集中、更线性的流动，常用于比喻信息或人群的持续输送，如“信息流”或“人流”。而 “flow” 更广泛，可指任何形态的连续运动，包括非线性或大范围的流动，如“电流”或“情绪流动”。"
    },
    {
      "word_to_compare": "current",
      "analysis": "“Current” (水流/潮流) 强调在特定方向上具有动力和方向性的流动，常用于物理（如电流、水流）或抽象（如社会潮流）语境，带有“趋势”或“主流”的含义。而 “flow” 更中性，侧重于运动本身，不一定隐含方向性或主导性。"
    },
    {
      "word_to_compare": "movement",
      "analysis": "“Movement” (运动/移动) 是一个更宽泛的词，泛指任何位置或状态的变化，可以是间断的、不规则的，甚至静止中的变化（如思想运动）。而 “flow” 特指连续、顺畅、有节奏的运动，强调过程的连贯性与自然性。"
    }
  ]
}