{
  "word": "flower",
  "pronunciation": "flou·er",
  "concise_definition": "n. 花, 开花; v. 开花, 繁荣",
  "forms": {
    "plural": "flowers",
    "third_person_singular": "flowers",
    "past_tense": "flowered",
    "past_participle": "flowered",
    "present_participle": "flowering"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The reproductive structure found in flowering plants, typically characterized by colorful petals, sepals, stamens, and pistils, and often valued for its beauty and fragrance.",
      "explanation_cn": "被子植物中用于繁殖的结构，通常具有色彩鲜艳的花瓣、萼片、雄蕊和雌蕊，常因其美丽和芬芳而受到珍视。",
      "example_en": "She arranged a bouquet of roses and lilies for the wedding.",
      "example_cn": "她为婚礼准备了一束玫瑰和百合花。"
    },
    {
      "pos": "noun",
      "explanation_en": "The peak or most flourishing stage of something, often used metaphorically to describe a person's or thing's period of greatest success or beauty.",
      "explanation_cn": "指某事物最繁荣、最鼎盛的阶段，常用于比喻人或事物最成功或最美的时期。",
      "example_en": "The 1920s were the flower of jazz music in America.",
      "example_cn": "20世纪20年代是美国爵士乐的鼎盛时期。"
    },
    {
      "pos": "verb",
      "explanation_en": "To produce flowers; to reach the stage of blooming in a plant’s life cycle.",
      "explanation_cn": "指植物进入开花阶段，长出花朵。",
      "example_en": "The cherry trees flower every spring, painting the streets in pink.",
      "example_cn": "樱花树每年春天开花，将街道染成粉红色。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reach a state of prosperity, success, or full development; to thrive.",
      "explanation_cn": "指达到繁荣、成功或充分发展的状态；兴旺发达。",
      "example_en": "The small town flowered into a bustling cultural center after the new theater opened.",
      "example_cn": "新剧院开业后，这个小镇繁荣成为充满活力的文化中心。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "blossom",
      "analysis": "“Blossom” (开花) 与 “flower” 作为动词时意义相近，但 “blossom” 更常用于描述果树或树木的开花，带有更诗意、自然的意味，且常用于比喻人的成长或潜力的显现（如：She blossomed into a confident leader）。而 “flower” 更通用，可指任何植物开花，也更常用于名词形式。"
    },
    {
      "word_to_compare": "bud",
      "analysis": "“Bud” (花蕾) 指花朵尚未开放的初始阶段，是开花前的形态，强调未展开的潜力。而 “flower” 指已经完全开放、展现形态的花朵，是成熟阶段的体现。两者是植物生命周期中的前后关系。"
    },
    {
      "word_to_compare": "bloom",
      "analysis": "“Bloom” (盛开) 与 “flower” 作为动词时可互换，但 “bloom” 更强调花朵开放时的视觉效果和短暂的盛放状态，常用于描述群体性开花（如：The field is in full bloom）。作为名词时，“bloom” 也可泛指花朵，但更常用于文学语境，而 “flower” 是日常和科学语境中最标准的用词。"
    }
  ]
}