{
  "word": "flushing",
  "pronunciation": "fluh·shing",
  "concise_definition": "n. 涨红, 冲洗, 冲水; adj. 涨红的, 冲洗的",
  "forms": {
    "base_form": "flush",
    "present_participle": "flushing",
    "past_tense": "flushed",
    "past_participle": "flushed"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of washing or clearing something by forcing a liquid through it, especially to remove impurities or debris.",
      "explanation_cn": "指通过强制液体流过某物以清除杂质或碎屑的行为，常用于管道、设备或身体的清洁。",
      "example_en": "The plumber performed a flushing of the water pipes to remove sediment.",
      "example_cn": "水管工对水管进行了冲洗，以清除沉积物。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden reddening of the skin, especially on the face, often caused by embarrassment, heat, exercise, or illness.",
      "explanation_cn": "指皮肤（尤其是面部）突然发红，常由尴尬、发热、运动或疾病引起。",
      "example_en": "She felt a flushing of heat across her cheeks after the awkward comment.",
      "example_cn": "在那句尴尬的话之后，她的脸颊突然泛红。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process of emptying a toilet by releasing water to carry waste away.",
      "explanation_cn": "指通过释放水流将厕所中的污物冲走的过程。",
      "example_en": "The toilet has a powerful flushing mechanism that uses less water than older models.",
      "example_cn": "这种马桶的冲水机制非常强劲，比旧型号更节水。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by or exhibiting a sudden reddening of the skin; often used to describe a physical symptom.",
      "explanation_cn": "形容皮肤突然发红的状态，常用于描述某种身体症状。",
      "example_en": "He experienced a flushing sensation after taking the medication.",
      "example_cn": "他服药后感到一阵面部潮红。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "blushing",
      "analysis": "“Blushing”（脸红）特指因情绪（如羞愧、尴尬）引起的面部潮红，具有强烈的心理和社交含义，通常是短暂且被动的。而 “flushing” 更广泛，可由生理原因（如发热、药物、运动）引起，不限于面部，也不一定与情绪相关。"
    },
    {
      "word_to_compare": "rinsing",
      "analysis": "“Rinsing”（冲洗）指用少量液体简单漂洗，通常不强调压力或彻底清除，如 rinsing dishes 或 rinsing hair。而 “flushing” 暗示更强的水流、更高的压力和更彻底的清除目的，常用于管道、系统或医学场景。"
    },
    {
      "word_to_compare": "surge",
      "analysis": "“Surge”（激增/涌动）强调数量、力量或情绪的突然猛烈增加，如电流 surge 或情绪 surge。它不涉及液体流动或皮肤颜色变化，而 “flushing” 专指液体流动或皮肤发红的物理现象，语义范围更具体。"
    }
  ]
}