{
  "word": "flute",
  "pronunciation": "flooht",
  "concise_definition": "n. 长笛, 竖笛; v. 吹长笛, 用长笛演奏",
  "forms": {
    "plural": "flutes",
    "third_person_singular": "flutes",
    "past_tense": "fluted",
    "past_participle": "fluted",
    "present_participle": "fluting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A musical instrument made of metal or wood, played by blowing across a hole near one end, producing a clear, high-pitched tone; commonly used in orchestras and wind ensembles.",
      "explanation_cn": "一种由金属或木头制成的乐器，通过在靠近一端的孔边吹气发声，音色清澈高亢，常用于管弦乐队和管乐合奏中。",
      "example_en": "She played a haunting melody on the flute during the concert.",
      "example_cn": "她在音乐会上用长笛演奏了一段悠扬动人的旋律。"
    },
    {
      "pos": "noun",
      "explanation_en": "A narrow, grooved channel or ridge, especially one that is decorative and found on columns, fabrics, or glassware.",
      "explanation_cn": "指一种狭窄的凹槽或凸脊，尤其用于装饰性设计，常见于柱子、织物或玻璃器皿上。",
      "example_en": "The ancient column was adorned with vertical flutes carved into its surface.",
      "example_cn": "这座古柱表面刻有纵向的凹槽装饰。"
    },
    {
      "pos": "verb",
      "explanation_en": "To play music on a flute; to produce sound by blowing across the opening of a flute.",
      "explanation_cn": "用长笛演奏音乐；通过在长笛的吹口处吹气发出声音。",
      "example_en": "He fluted a lively folk tune as he walked through the park.",
      "example_cn": "他一边穿过公园，一边用长笛吹奏了一首欢快的民谣。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cut or shape a surface with narrow grooves or ridges, often for decorative purposes.",
      "explanation_cn": "将表面切割或塑造成狭窄的凹槽或凸脊，通常用于装饰目的。",
      "example_en": "The glassmaker fluted the stem of the wine glass to add elegance.",
      "example_cn": "玻璃工匠在酒杯的杯茎上刻出凹槽，以增添优雅感。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "piccolo",
      "analysis": "“Piccolo” (短笛) 是一种比长笛更小、音高更高（高八度）的木管乐器，音色尖锐明亮，常用于军乐或管弦乐中增强高音部分。而 “flute” 是标准的C调木管乐器，音域更广，音色更圆润，是管弦乐队中的主要高音旋律乐器。"
    },
    {
      "word_to_compare": "recorder",
      "analysis": "“Recorder” (竖笛) 是一种有哨嘴的木管乐器，通过吹嘴发声，音色柔和，常用于儿童音乐教育。而 “flute” 是无哨嘴的横吹乐器，靠气流在吹口边缘分裂发声，音色更明亮、表现力更强，专业性更高。"
    },
    {
      "word_to_compare": "groove",
      "analysis": "“Groove” (凹槽) 是一个更通用的词，泛指任何类型的凹陷或沟槽，可用于道路、唱片、机械零件等。而 “flute” 作为名词时特指具有装饰性、纵向排列的细长凹槽，多用于建筑或工艺品，具有美学意图，语义范围更窄、更专业。"
    }
  ]
}