{
  "word": "fly",
  "pronunciation": "flī",
  "concise_definition": "v. 飞行, 驾驶飞机, 飘扬; n. 苍蝇, 飞行, 门襟",
  "forms": {
    "third_person_singular": "flies",
    "past_tense": "flew",
    "past_participle": "flown",
    "present_participle": "flying"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move through the air under one's own power, typically referring to birds, insects, or aircraft, using wings or propulsion.",
      "explanation_cn": "指通过自身力量（通常借助翅膀或推进装置）在空中移动，常用于描述鸟类、昆虫或飞机的飞行。",
      "example_en": "The eagle soared high in the sky as it flew over the mountains.",
      "example_cn": "这只鹰在群山上空翱翔。"
    },
    {
      "pos": "verb",
      "explanation_en": "To operate or pilot an aircraft, especially as a professional or in a controlled environment.",
      "explanation_cn": "指驾驶或操控飞机，尤指作为职业或在受控环境中操作。",
      "example_en": "She has been flying commercial jets for over twenty years.",
      "example_cn": "她已驾驶商用喷气式飞机超过二十年。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or extend rapidly through the air, often in an uncontrolled or sudden manner; to wave or flutter in the wind.",
      "explanation_cn": "指快速或突然地在空中移动，或在风中飘扬、飘动。",
      "example_en": "The flag flew proudly above the building as the anthem played.",
      "example_cn": "国歌奏响时，旗帜在大楼上方骄傲地飘扬。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, common insect with two wings, often found around food or waste, known for its buzzing sound and rapid flight.",
      "explanation_cn": "一种常见的双翅目昆虫，常出现在食物或垃圾附近，以嗡嗡声和快速飞行为特征。",
      "example_en": "A fly landed on my sandwich at the picnic.",
      "example_cn": "一只苍蝇落在了我野餐时的三明治上。"
    },
    {
      "pos": "noun",
      "explanation_en": "The front opening of trousers or a skirt, typically fastened with a zipper or buttons.",
      "explanation_cn": "裤子或裙子前面的开口，通常用拉链或纽扣扣合。",
      "example_en": "He realized his fly was unzipped during the presentation.",
      "example_cn": "他在演讲时才发现裤子的门襟没拉上。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "soar",
      "analysis": "“Soar” (翱翔) 强调在高空平稳、优雅、持久地飞行，常带有积极或诗意的色彩，多用于描述鸟类或象征性的精神升华。而 “fly” 是更通用、中性的词，涵盖所有形式的飞行，包括低空、短促或机械驱动的飞行。"
    },
    {
      "word_to_compare": "hover",
      "analysis": "“Hover” (悬停) 指在空中保持相对静止的位置，不向前移动，常见于直升机、蜂鸟或无人机。它强调稳定性，而 “fly” 通常意味着有方向的位移。"
    },
    {
      "word_to_compare": "dart",
      "analysis": "“Dart” (疾飞) 描述快速、突然、短促的飞行，常带有方向变化或逃避的意味，如昆虫或鸟类的闪避动作。它强调速度和突发性，而 “fly” 是更广泛、无特定节奏的飞行描述。"
    }
  ]
}