{
  "word": "foam",
  "pronunciation": "fohm",
  "concise_definition": "n. 泡沫, 泡沫状物; v. 起泡沫, 泡沫般地涌出",
  "forms": {
    "third_person_singular": "foams",
    "past_tense": "foamed",
    "past_participle": "foamed",
    "present_participle": "foaming"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A mass of small bubbles formed on the surface of a liquid, typically by agitation or chemical reaction, often seen in beer, soap, or ocean waves.",
      "explanation_cn": "液体表面因搅动或化学反应形成的大量小气泡集合体，常见于啤酒、肥皂水或海浪中。",
      "example_en": "The latte had a thick, creamy foam on top.",
      "example_cn": "这杯拿铁顶部有一层浓稠的奶泡。"
    },
    {
      "pos": "noun",
      "explanation_en": "A lightweight, porous material made by trapping gas bubbles in a solid or liquid matrix, used for insulation, cushioning, or packaging.",
      "explanation_cn": "一种通过在固体或液体基质中包裹气泡制成的轻质多孔材料，常用于隔热、缓冲或包装。",
      "example_en": "The box was lined with polyurethane foam to protect the fragile items.",
      "example_cn": "盒子内衬了聚氨酯泡沫，以保护易碎物品。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form or produce bubbles on the surface, especially when a liquid is agitated or heated.",
      "explanation_cn": "指液体因搅动或加热而在表面形成气泡。",
      "example_en": "The detergent foamed vigorously when mixed with water.",
      "example_cn": "洗涤剂与水混合后剧烈起泡。"
    },
    {
      "pos": "verb",
      "explanation_en": "To speak or behave in an excited, irrational, or uncontrollable manner, often due to anger or emotion.",
      "explanation_cn": "指因愤怒或情绪激动而语无伦次、行为失控。",
      "example_en": "He was foaming at the mouth with rage after hearing the news.",
      "example_cn": "听到这个消息后，他气得怒发冲冠，口吐白沫。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bubbles",
      "analysis": "“Bubbles”（气泡）指单个或零散的气体空腔，通常强调个体形态，如水中的小气泡；而 “foam” 是大量气泡聚集形成的稳定结构，具有整体性和持续性，常用于描述宏观现象，如奶泡或浪花。"
    },
    {
      "word_to_compare": "lather",
      "analysis": "“Lather”（肥皂泡/泡沫）特指由肥皂或清洁剂与水混合后产生的泡沫，具有明确的化学来源和用途（如剃须）；而 “foam” 是更广泛的术语，可涵盖自然、工业或物理过程产生的所有泡沫类型，不限于清洁产品。"
    },
    {
      "word_to_compare": "froth",
      "analysis": "“Froth”（泡沫/浮沫）与 “foam” 非常接近，常可互换，但 “froth” 更常用于描述轻薄、不稳定、易消散的泡沫，如啤酒顶部的薄层或愤怒时口边的白沫，带有轻微贬义或文学色彩；而 “foam” 更中性，可指厚实、持久的泡沫结构。"
    }
  ]
}