{
  "word": "fob",
  "pronunciation": "fahb",
  "concise_definition": "n. 小饰物, 钥匙扣; v. 欺骗, 使分心",
  "forms": {
    "plural": "fobs",
    "third_person_singular": "fobs",
    "past_tense": "fobbed",
    "past_participle": "fobbed",
    "present_participle": "fobbing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small decorative or functional object, typically attached to a keychain or pocket watch chain, often used to carry keys, remote controls, or other small items.",
      "explanation_cn": "一种小型装饰性或功能性物件，通常附在钥匙圈或怀表链上，用于携带钥匙、遥控器或其他小物品。",
      "example_en": "She kept her car key fob in her purse, ready to unlock the door from a distance.",
      "example_cn": "她把车钥匙扣放在钱包里，随时可以远程解锁车门。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small metal or plastic device used to remotely operate a lock, such as a car door or garage door, often containing a built-in transmitter.",
      "explanation_cn": "一种用于远程控制锁具（如车门或车库门）的小型金属或塑料装置，通常内置发射器。",
      "example_en": "The new security system requires a programmable fob to grant access.",
      "example_cn": "新的安保系统需要一个可编程钥匙扣才能授权进入。"
    },
    {
      "pos": "verb",
      "explanation_en": "To deceive or mislead someone, especially by giving them a false sense of security or by distracting them with a trivial matter.",
      "explanation_cn": "欺骗或误导某人，尤其是通过给予其虚假的安全感，或用琐事分散其注意力。",
      "example_en": "He tried to fob off the broken laptop as a working one, but the customer noticed the scratches.",
      "example_cn": "他试图把这台坏掉的笔记本电脑当成好用的卖出去，但顾客注意到了上面的划痕。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "keychain",
      "analysis": "“Keychain”（钥匙圈）泛指用于悬挂钥匙的环状或带状物，强调其功能性，不包含电子元件；而 “fob” 通常指带有电子功能（如遥控）或装饰性的小部件，可能附着在钥匙圈上，但本身具有独立用途。"
    },
    {
      "word_to_compare": "distraction",
      "analysis": "“Distraction”（分心的事物）是泛指任何使注意力偏离的事物，是中性或负面的抽象名词；而 “fob” 作为动词时，特指通过欺骗性手段故意制造分心，带有主观恶意或操纵意图，语义更具体、更具欺骗性。"
    },
    {
      "word_to_compare": "token",
      "analysis": "“Token”（代币/象征物）通常指代表某种权利、身份或价值的物品（如门禁卡、纪念币），强调象征意义；而 “fob” 更侧重于实用功能（如遥控）或装饰性，且在动词用法中具有欺骗性，这是 “token” 所不具备的语义维度。"
    }
  ]
}