{
  "word": "focus",
  "pronunciation": "foh·kuhs",
  "concise_definition": "n. 焦点, 集中, 重点; v. 集中, 聚焦",
  "forms": {
    "third_person_singular": "focuses",
    "past_tense": "focused",
    "past_participle": "focused",
    "present_participle": "focusing",
    "plural": "foci"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The central point of attention, interest, or activity; the main subject or issue being emphasized.",
      "explanation_cn": "指注意力、兴趣或活动的中心点；被强调的主要主题或问题。",
      "example_en": "The focus of the meeting was on improving customer satisfaction.",
      "example_cn": "会议的重点是提高客户满意度。"
    },
    {
      "pos": "noun",
      "explanation_en": "The clarity or sharpness of an image, especially in photography or optics; the point at which light rays converge to form a clear picture.",
      "explanation_cn": "指图像的清晰度或锐度，尤其在摄影或光学中；光线汇聚形成清晰图像的点。",
      "example_en": "The photographer adjusted the focus to make the subject stand out.",
      "example_cn": "摄影师调整了焦距，使主体更加突出。"
    },
    {
      "pos": "verb",
      "explanation_en": "To direct one's attention, effort, or resources toward a particular goal, subject, or activity.",
      "explanation_cn": "指将注意力、努力或资源集中于某个特定目标、主题或活动上。",
      "example_en": "She focused all her energy on finishing the project before the deadline.",
      "example_cn": "她把全部精力都集中在截止日期前完成项目上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To adjust a lens or optical device to produce a clear image of an object.",
      "explanation_cn": "指调整镜头或光学设备，使物体形成清晰的图像。",
      "example_en": "He focused the camera on the distant mountain range.",
      "example_cn": "他将相机对准了远处的山脉。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "concentrate",
      "analysis": "“Concentrate” (集中) 与 “focus” 非常接近，但更强调将精神或物理力量集中于一个狭窄的范围，常用于心理或体力的投入。而 “focus” 更广泛，既可用于注意力，也可用于视觉、目标或系统层面的中心化，语义范围更广。"
    },
    {
      "word_to_compare": "center",
      "analysis": "“Center” (中心) 通常指物理或抽象空间中的核心位置，是一个静态的名词或动词，强调位置而非动作。而 “focus” 强调的是动态的注意力或功能的汇聚，具有目的性和主动性。例如，我们说 ‘the center of the city’，但说 ‘focus on the problem’。"
    },
    {
      "word_to_compare": "emphasize",
      "analysis": "“Emphasize” (强调) 指通过语言、语气或行为突出某事物的重要性，常用于表达观点或立场。而 “focus” 更侧重于将资源、注意力或功能导向某一点，是行为上的集中，而非单纯的语言表达。例如，你可以强调一个观点，但必须聚焦于一个任务。"
    }
  ]
}