{
  "word": "foil",
  "pronunciation": "fɔɪl",
  "concise_definition": "n. 金属箔, 烘托者, 阻碍者; v. 阻止, 烘托",
  "forms": {
    "third_person_singular": "foils",
    "past_tense": "foiled",
    "past_participle": "foiled",
    "present_participle": "foiling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A very thin sheet of metal, often aluminum or gold, used for wrapping food, packaging, or decorative purposes.",
      "explanation_cn": "指非常薄的金属片，通常为铝或金箔，用于包裹食物、包装或装饰用途。",
      "example_en": "She wrapped the cheese in aluminum foil to keep it fresh.",
      "example_cn": "她用铝箔纸包裹奶酪以保持其新鲜。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that contrasts with another in order to highlight particular qualities, especially in literature or drama.",
      "explanation_cn": "指在文学或戏剧中，通过与另一人物或事物形成鲜明对比，从而突出其特质的角色或元素。",
      "example_en": "In the novel, the calm and rational detective serves as a foil to the impulsive and emotional suspect.",
      "example_cn": "在这部小说中，冷静理智的侦探与冲动情绪化的嫌疑人形成鲜明对比，突显了后者的特点。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of slender, flexible sword used in the sport of fencing, characterized by a light blade and a small guard.",
      "explanation_cn": "指击剑运动中使用的一种细长、柔韧的剑，特点是剑身轻巧、护手小。",
      "example_en": "She trained for years to master the foil in competitive fencing.",
      "example_cn": "她经过多年训练，才在竞技击剑中精通了花剑。"
    },
    {
      "pos": "verb",
      "explanation_en": "To prevent someone from succeeding in their plan or goal, often by clever or unexpected action.",
      "explanation_cn": "指通过巧妙或出人意料的行动阻止某人实现其计划或目标。",
      "example_en": "The police foiled the robbery attempt just before midnight.",
      "example_cn": "警方在午夜前成功阻止了这次抢劫企图。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "wrapper",
      "analysis": "“Wrapper”（包装纸）泛指任何用于包裹物品的材料，如纸、塑料膜等，强调功能性和保护性，但不特指金属材质。而 “foil” 特指金属薄片，具有导热、防潮等特殊物理属性，语义更具体。"
    },
    {
      "word_to_compare": "contrast",
      "analysis": "“Contrast”（对比）是抽象名词，泛指两个事物之间的差异，可用于任何语境。而 “foil” 作为名词时，特指在文学或艺术中被刻意设计用来衬托主角的配角或元素，具有叙事功能，语义更专业、更结构化。"
    },
    {
      "word_to_compare": "thwart",
      "analysis": "“Thwart”（挫败）与 “foil” 在动词义项上相近，都表示阻止某事发生。但 “thwart” 更强调主观意志上的阻碍，常用于政治、军事或道德语境；而 “foil” 更常用于描述通过策略、计谋或意外事件达成的阻止，语气较轻，有时带有戏剧性或偶然性。"
    }
  ]
}