{
  "word": "folds",
  "pronunciation": "fohldz",
  "concise_definition": "n. 折痕, 折叠处; v. 折叠, 折起, 崩溃",
  "forms": {
    "singular": "fold",
    "third_person_singular": "folds",
    "past_tense": "folded",
    "past_participle": "folded",
    "present_participle": "folding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A crease or line formed when a flexible material such as paper, fabric, or skin is bent or doubled over on itself.",
      "explanation_cn": "指当纸张、布料或皮肤等柔性材料被折叠或对折时形成的折痕或线条。",
      "example_en": "She carefully smoothed out the folds in her dress before the interview.",
      "example_cn": "她在面试前仔细抚平了裙子上的褶皱。"
    },
    {
      "pos": "noun",
      "explanation_en": "A layer or section created by folding, especially in geological formations or in pastry dough, contributing to texture or structure.",
      "explanation_cn": "指通过折叠形成的层或部分，尤用于地质构造或面团中，以增强质地或结构。",
      "example_en": "The croissant has dozens of delicate folds that give it its flaky texture.",
      "example_cn": "牛角面包有数十层细腻的折叠，使其具有酥脆的口感。"
    },
    {
      "pos": "verb",
      "explanation_en": "To bend something, especially a flat object, so that one part covers another, often to save space or prepare for storage.",
      "explanation_cn": "指将某物（尤其是扁平物体）折叠，使一部分覆盖另一部分，通常为了节省空间或便于存放。",
      "example_en": "He folded the map neatly and put it in his pocket.",
      "example_cn": "他把地图整齐地折好，放进了口袋。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fail or collapse under pressure, often used in the context of businesses, systems, or physical structures.",
      "explanation_cn": "指在压力下失败或崩溃，常用于企业、系统或物理结构。",
      "example_en": "The company folded after losing its major clients.",
      "example_cn": "这家公司失去主要客户后倒闭了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To incorporate something by gently mixing it into another substance, especially in cooking, to preserve airiness or texture.",
      "explanation_cn": "指在烹饪中轻柔地将一种物质混入另一种物质中，以保持其蓬松或质地，如将蛋白霜拌入面糊。",
      "example_en": "Gently fold the whipped cream into the batter to keep it light.",
      "example_cn": "轻轻将打发的奶油拌入面糊中，以保持其轻盈的口感。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "crease",
      "analysis": "“Crease” (折痕) 通常指因折叠或压迫而形成的永久性或半永久性线条，强调痕迹本身，常用于描述衣物、纸张上的印记。而 “fold” 更强调折叠的动作或形成的层次结构，不一定留下永久痕迹。"
    },
    {
      "word_to_compare": "bend",
      "analysis": "“Bend” (弯曲) 指使物体发生弧形或非直角的变形，不一定形成清晰的折线，常用于描述柔软或可塑材料的形态变化。而 “fold” 通常指沿一条明确的线对折，形成锐角或直角的转折，更具结构性。"
    },
    {
      "word_to_compare": "collapse",
      "analysis": "“Collapse” (坍塌) 指结构突然完全失去支撑而崩塌，常带有灾难性或不可逆的含义。而 “fold” 作为动词表示崩溃时，语气较轻，常用于商业或组织语境，暗示逐步或被动的失败，而非物理性崩塌。"
    }
  ]
}