{
  "word": "folded",
  "pronunciation": "fohld",
  "concise_definition": "adj. 折叠的, 对折的; v. 折叠（fold 的过去式和过去分词）",
  "forms": {
    "base_form": "fold",
    "third_person_singular": "folds",
    "present_participle": "folding",
    "past_tense": "folded",
    "past_participle": "folded"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing something that has been bent or creased along a line, typically to make it smaller or more compact, often in a neat or deliberate manner.",
      "explanation_cn": "指某物被沿一条线弯曲或折痕，通常是为了使其更小或更紧凑，常带有整齐或有意为之的意味。",
      "example_en": "She placed the folded letter into the envelope.",
      "example_cn": "她把折叠好的信纸放进信封里。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Referring to a surface or structure that has multiple layers created by bending, often used in textiles, paper, or geometry.",
      "explanation_cn": "指由弯曲形成的多层结构，常用于描述织物、纸张或几何形状。",
      "example_en": "The folded fabric created a beautiful pattern when hung in the window.",
      "example_cn": "这块折叠的布料挂在窗边时形成了优美的图案。"
    },
    {
      "pos": "verb",
      "explanation_en": "To bend something, especially a flat object like paper or cloth, so that one part covers another, usually to reduce size or for storage.",
      "explanation_cn": "指将某物（尤其是纸张或布料等扁平物体）弯曲，使一部分覆盖另一部分，通常是为了缩小体积或便于存放。",
      "example_en": "He folded his arms and waited silently.",
      "example_cn": "他双臂交叉，静静地等待着。"
    },
    {
      "pos": "verb",
      "explanation_en": "To collapse or close by bending, often used for objects like chairs, maps, or umbrellas.",
      "explanation_cn": "指通过弯曲而收拢或关闭，常用于椅子、地图或雨伞等物品。",
      "example_en": "The folding chair collapsed under his weight.",
      "example_cn": "这把折叠椅承受不住他的重量，塌了下来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "creased",
      "analysis": "“Creased”（有折痕的）强调的是表面因折叠或压迫而留下的痕迹，不一定表示物体被完全折叠，可能只是轻微压出线条。而 “folded” 强调的是动作完成后的完整形态，即物体已被明确地对折或折成多层。"
    },
    {
      "word_to_compare": "bent",
      "analysis": "“Bent”（弯曲的）泛指任何形状的弯曲，可以是任意角度或不规则的变形，不一定有明确的折线，也不一定是为了紧凑或收纳。而 “folded” 通常指沿明确直线进行的、有目的的对折或折合，具有结构性和规范性。"
    },
    {
      "word_to_compare": "crumpled",
      "analysis": "“Crumpled”（揉皱的）指因粗暴处理而产生的不规则、杂乱的褶皱，带有负面或随意的意味。而 “folded” 通常暗示整洁、有序和有意为之的动作，两者在外观和意图上形成鲜明对比。"
    }
  ]
}