{
  "word": "folding",
  "pronunciation": "fohld·ing",
  "concise_definition": "n. 折叠, 折痕; adj. 可折叠的",
  "forms": {
    "base_form": "fold",
    "third_person_singular": "folds",
    "past_tense": "folded",
    "past_participle": "folded",
    "present_participle": "folding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act or process of bending something, especially a flat object like paper or fabric, so that one part lies over another; also refers to the crease or line formed by such bending.",
      "explanation_cn": "指将某物（尤其是纸张或布料等扁平物体）弯曲，使一部分覆盖在另一部分之上的动作或过程；也指由此形成的折痕或折线。",
      "example_en": "The origami artist mastered the art of precise folding to create intricate animal shapes.",
      "example_cn": "这位折纸艺术家掌握了精确折叠的技巧，以制作出复杂的动物造型。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of structure or design that can be collapsed or compacted by folding, often used in furniture, containers, or clothing.",
      "explanation_cn": "指一种可通过折叠而收拢或压缩的结构或设计，常用于家具、容器或服装中。",
      "example_en": "He bought a folding chair for the picnic because it was easy to carry.",
      "example_cn": "他为野餐买了一把折叠椅，因为它便于携带。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Designed to be folded, typically to save space or for portability; describes objects that can be collapsed into a smaller form.",
      "explanation_cn": "设计为可折叠的，通常为了节省空间或便于携带；描述可收拢成更小形态的物品。",
      "example_en": "The folding table fits neatly into the closet when not in use.",
      "example_cn": "这张折叠桌在不使用时可以整齐地收进壁橱里。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fold",
      "analysis": "“Fold” 是动词或名词的基本形式，强调动作本身或单一的折痕；而 “folding” 作为名词时更侧重于折叠的过程、技术或整体行为，作为形容词时则专门描述具有可折叠特性的物品。例如，可以说 “a fold in the paper”（纸上的一个折痕），但 “folding mechanism”（折叠机构）强调的是系统性功能。"
    },
    {
      "word_to_compare": "creasing",
      "analysis": "“Creasing”（压痕）强调在材料上形成一条明显的线或凹痕，常是折叠的结果，但不一定伴随完全的重叠。而 “folding” 必然包含两部分重叠或覆盖的动作。例如，纸张可能被压出 crease 但未真正 fold，而 folding 总是包含 creasing。"
    },
    {
      "word_to_compare": "collapsing",
      "analysis": "“Collapsing”（坍塌/收拢）指结构因失去支撑而突然或被动地变小，常含负面含义（如建筑物倒塌）；而 “folding” 是主动、可控、有目的的折叠行为，通常用于设计良好的可收纳物品，如折叠椅或地图。两者虽都涉及体积减小，但机制和意图不同。"
    }
  ]
}