{
  "word": "fold",
  "pronunciation": "fohld",
  "concise_definition": "v. 折叠, 折起, 崩溃; n. 折痕, 折叠处, 羊群",
  "forms": {
    "third_person_singular": "folds",
    "past_tense": "folded",
    "past_participle": "folded",
    "present_participle": "folding"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To bend something, especially a flat object like paper or fabric, so that one part lies over another, often to save space or prepare for storage.",
      "explanation_cn": "指将某物（尤其是纸张、布料等扁平物体）对折或多次折叠，使一部分覆盖在另一部分上，通常为了节省空间或便于存放。",
      "example_en": "She folded the letter carefully before putting it in the envelope.",
      "example_cn": "她把信仔细折好后放进信封里。"
    },
    {
      "pos": "verb",
      "explanation_en": "To collapse or give way under pressure, often used to describe businesses, organizations, or physical structures failing suddenly.",
      "explanation_cn": "指在压力下崩溃或垮塌，常用于描述企业、组织或物理结构突然失败。",
      "example_en": "The small bookstore couldn't compete with online retailers and finally folded last year.",
      "example_cn": "这家小型书店无法与在线零售商竞争，去年终于倒闭了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To incorporate one ingredient into another gently, especially in cooking, by using a cutting and lifting motion to preserve airiness (e.g., folding egg whites into batter).",
      "explanation_cn": "指在烹饪中用轻柔的切拌和翻动动作将一种成分（如打发的蛋清）混入另一种成分中，以保持其蓬松的质地。",
      "example_en": "Gently fold the whipped cream into the chocolate mixture to avoid deflating it.",
      "example_cn": "轻轻将打发的奶油拌入巧克力混合物中，以免消泡。"
    },
    {
      "pos": "noun",
      "explanation_en": "A crease or line formed when something is folded, especially in fabric, paper, or metal.",
      "explanation_cn": "指物体被折叠后形成的折痕或线条，尤指布料、纸张或金属上的痕迹。",
      "example_en": "The suit had a sharp fold down the front of the trousers.",
      "example_cn": "这套西装的裤子前侧有一条笔直的折痕。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of people or animals under the care or guidance of a leader, especially a flock of sheep or a religious congregation.",
      "explanation_cn": "指在领导者照管或引导下的一群人或动物，尤指羊群或宗教会众。",
      "example_en": "The shepherd led his flock to the pasture, calling each sheep by name as if they were part of his fold.",
      "example_cn": "牧羊人把羊群赶往牧场，像对待自己羊群中的每一只羊一样呼唤它们的名字。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "crease",
      "analysis": "“Crease” (折痕) 仅指折叠后留下的痕迹，是一个名词，强调结果而非动作。而 “fold” 既可以是动词（折叠的动作），也可以是名词（折痕），涵盖动作与结果两个层面。"
    },
    {
      "word_to_compare": "crumple",
      "analysis": "“Crumple” (揉皱) 指无规则地挤压或揉捏，使物体变得皱巴巴、凌乱，通常带有破坏性。而 “fold” 是有目的、有秩序的弯曲，常为实用或美观目的，不造成损坏。"
    },
    {
      "word_to_compare": "collapse",
      "analysis": "“Collapse” (倒塌/崩溃) 强调因结构失效或压力过大而突然、彻底地垮塌，常用于建筑、系统或身体，语义更严重。而 “fold” 作为动词表示崩溃时，语气较轻，多用于商业或非物理情境，带有一定口语化色彩。"
    }
  ]
}