{
  "word": "folio",
  "pronunciation": "fuh·lee·oh",
  "concise_definition": "n. 对开本, 页码, 抄本, 一叠纸",
  "forms": {
    "plural": "folios"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sheet of paper folded once to form two leaves or four pages, especially in bookbinding; also refers to a book or manuscript made from such sheets.",
      "explanation_cn": "指将一张纸对折一次形成两叶（即四页）的纸张，尤用于书籍装订；也可指由这种纸张装订成的书籍或手稿。",
      "example_en": "The rare medieval manuscript was printed on large folios with intricate illuminations.",
      "example_cn": "这本稀有的中世纪手稿使用大幅对开纸印刷，并配有精美的彩饰。"
    },
    {
      "pos": "noun",
      "explanation_en": "A collection of documents or pages bound together, often used in publishing to refer to a portfolio or a set of works by an artist or writer.",
      "explanation_cn": "指装订在一起的一组文件或页面，常用于出版领域，指艺术家或作家的作品集。",
      "example_en": "She presented her portfolio of architectural designs as a professional folio to potential clients.",
      "example_cn": "她向潜在客户展示了作为专业作品集的建筑设计集。"
    },
    {
      "pos": "noun",
      "explanation_en": "The page number or leaf number in a book, especially in older or scholarly texts where pages are numbered by folio rather than by individual page.",
      "explanation_cn": "指书籍中的页码或叶码，尤其在古籍或学术文献中，页码按叶（而非单页）编号。",
      "example_en": "The citation refers to folio 23r, meaning the recto side of the 23rd leaf.",
      "example_cn": "该引文指向第23叶的正面，即第23叶的右页。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "book",
      "analysis": "“Book”（书）是通用词，泛指任何装订成册的印刷或手写作品，而 “folio” 特指一种特定开本形式（对开）或其装订方式，强调物理形态和出版传统。并非所有书都是 folio，但所有 folio 都是书的一种形式。"
    },
    {
      "word_to_compare": "portfolio",
      "analysis": "“Portfolio”（作品集）与 “folio” 在艺术或专业语境中常可互换，但 “portfolio” 更广泛用于现代语境，指个人作品的精选集合（如设计、摄影），而 “folio” 更具古典或出版专业色彩，有时特指纸质装订形式。"
    },
    {
      "word_to_compare": "page",
      "analysis": "“Page”（页）指单面印刷或书写的内容区域，是基本单位；而 “folio” 指一张纸对折后形成的两页（正反面），是装订单位。在古籍中，folios 用于编号，而非 individual pages，因此两者是结构层级上的区别。"
    }
  ]
}