{
  "word": "fool",
  "pronunciation": "fool",
  "concise_definition": "n. 傻瓜, 愚人; v. 欺骗, 愚弄",
  "forms": {
    "third_person_singular": "fools",
    "past_tense": "fooled",
    "past_participle": "fooled",
    "present_participle": "fooling",
    "plural": "fools"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who lacks good sense or judgment; someone who acts in a silly, irrational, or unwise way.",
      "explanation_cn": "指缺乏判断力或常识的人；行为愚蠢、非理性或不明智的人。",
      "example_en": "He quit his stable job to chase a get-rich-quick scheme — what a fool!",
      "example_cn": "他辞掉了稳定的工作去追求暴富捷径——真是个傻瓜！"
    },
    {
      "pos": "noun",
      "explanation_en": "A historical or theatrical character, often dressed in colorful motley, who was employed to entertain royalty by making witty or absurd remarks.",
      "explanation_cn": "指历史上或戏剧中穿着花哨服装、受雇于王室以幽默或荒诞言论取悦君主的小丑角色。",
      "example_en": "The jester and the fool were the only ones who could speak truth to the king without punishment.",
      "example_cn": "小丑和愚人是唯一能对国王说真话而不受惩罚的人。"
    },
    {
      "pos": "verb",
      "explanation_en": "To deceive or trick someone, often by making them believe something that is not true.",
      "explanation_cn": "指通过让人相信不真实的事情来欺骗或愚弄某人。",
      "example_en": "Don't let them fool you into thinking this deal is a bargain — it's a scam.",
      "example_cn": "别让他们骗你，以为这笔交易是便宜货——这是一场骗局。"
    },
    {
      "pos": "verb",
      "explanation_en": "To waste time or behave in a silly or pointless way.",
      "explanation_cn": "指浪费时间或做出愚蠢、无意义的行为。",
      "example_en": "Stop fooling around and get back to work!",
      "example_cn": "别再胡闹了，回去工作！"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "idiot",
      "analysis": "“Idiot” (白痴) 是一个更强烈、更具侮辱性的词，通常指智力严重低下的人，带有贬义和攻击性。而 “fool” 更侧重于行为上的愚蠢，而非智力缺陷，语气相对温和，有时甚至带有幽默或讽刺色彩。"
    },
    {
      "word_to_compare": "dupe",
      "analysis": "“Dupe” (受骗者) 专指被欺骗的人，强调被动受害的角色，通常不用于形容主动愚蠢的人。而 “fool” 既可以是被欺骗的人（动词用法），也可以是本身愚蠢的人（名词用法），语义范围更广。"
    },
    {
      "word_to_compare": "jester",
      "analysis": "“Jester” (宫廷小丑) 是一个历史角色，特指在王室中以幽默方式进谏的表演者，其‘愚蠢’是职业性的、有目的的表演。而 “fool” 作为名词时，可以泛指任何愚蠢的人，不一定有表演性质，且常含贬义。"
    }
  ]
}