{
  "word": "forage",
  "pronunciation": "fawr·ij",
  "concise_definition": "v. 搜寻食物, 采食; n. 饲料, 野食",
  "forms": {
    "third_person_singular": "forages",
    "past_tense": "foraged",
    "past_participle": "foraged",
    "present_participle": "foraging"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To search widely for food or provisions, especially in a natural environment, often by animals or people in survival situations.",
      "explanation_cn": "指在自然环境中广泛搜寻食物或补给，常用于描述动物或处于生存困境中的人类的行为。",
      "example_en": "The deer forage in the woods for leaves and berries during the winter.",
      "example_cn": "冬天时，鹿在树林里觅食树叶和浆果。"
    },
    {
      "pos": "verb",
      "explanation_en": "To gather food or supplies by collecting them from the surrounding environment, often in a casual or opportunistic manner.",
      "explanation_cn": "指通过从周围环境中收集物品来获取食物或补给，通常带有随意或随机拾取的性质。",
      "example_en": "After the storm, residents foraged through the rubble for canned goods and bottled water.",
      "example_cn": "风暴过后，居民们在废墟中翻找罐头和瓶装水。"
    },
    {
      "pos": "noun",
      "explanation_en": "Food gathered from the wild, especially plant material such as grasses, leaves, and branches, used to feed livestock or consumed by wildlife.",
      "explanation_cn": "指从野外采集的食物，尤指草、叶、枝条等植物性物质，用于喂养牲畜或供野生动物食用。",
      "example_en": "Farmers store hay and other forage for their cattle during the cold months.",
      "example_cn": "农民们在寒冷月份为牛储存干草和其他饲料。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "forage",
      "analysis": "“Forage” 强调主动在自然环境中搜寻和采集食物，常带有生存或资源匮乏的语境，适用于动物或人类。而 “hunt” 更侧重于追踪和捕杀动物，强调猎杀行为，不适用于采集植物性食物。"
    },
    {
      "word_to_compare": "scavenge",
      "analysis": "“Scavenge” (拾荒/捡食) 指从废弃、被遗弃或人类丢弃的环境中寻找可食用或可用的物品，常带有肮脏、低贱或绝望的意味，如捡垃圾。而 “forage” 更中性，甚至可带有积极的自然觅食含义，如鹿在森林中觅食。"
    },
    {
      "word_to_compare": "graze",
      "analysis": "“Graze” (放牧/啃食) 指动物缓慢地、持续地吃草或低矮植物，通常在固定区域进行，行为较为被动和规律。而 “forage” 更广泛，包括主动移动、探索、寻找各种类型的食物，不限于草类，也包括浆果、坚果、昆虫等。"
    }
  ]
}