{
  "word": "foraging",
  "pronunciation": "fuh·r ij",
  "concise_definition": "n. 寻找食物, 采食; v. 寻找食物, 采食",
  "forms": {
    "base_form": "forage",
    "third_person_singular": "forages",
    "past_tense": "foraged",
    "past_participle": "foraged",
    "present_participle": "foraging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of searching widely for food or provisions, especially in a natural environment, often by animals or humans in survival contexts.",
      "explanation_cn": "指在自然环境中广泛搜寻食物或补给的行为，常用于描述动物或人类在生存情境下的觅食活动。",
      "example_en": "The deer were seen foraging in the meadow at dawn.",
      "example_cn": "黎明时分，人们看到鹿群在草地上觅食。"
    },
    {
      "pos": "verb",
      "explanation_en": "To search for and gather food, especially wild plants, fungi, or small animals, often as a traditional or sustainable practice.",
      "explanation_cn": "指搜寻并采集食物，尤其是野生植物、真菌或小型动物，常作为一种传统或可持续的生活方式。",
      "example_en": "She spends her weekends foraging for wild mushrooms and edible herbs in the forest.",
      "example_cn": "她周末常去森林里采摘野生蘑菇和可食用草药。"
    },
    {
      "pos": "verb",
      "explanation_en": "To rummage or scavenge through places, such as bins or abandoned areas, in search of useful items or food, often out of necessity.",
      "explanation_cn": "指在垃圾桶或废弃区域等地方翻找，寻找有用物品或食物，通常出于生活所需。",
      "example_en": "After losing his job, he resorted to foraging through dumpsters for food.",
      "example_cn": "失业后，他不得不翻找垃圾桶寻找食物。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hunting",
      "analysis": "“Hunting”（狩猎）特指主动追捕和杀死动物以获取食物，通常涉及武器和策略，强调对活体猎物的捕杀。而 “foraging” 更广泛，包括采集植物、菌类、昆虫等非捕杀性食物来源，更偏向被动搜寻而非主动猎杀。"
    },
    {
      "word_to_compare": "gathering",
      "analysis": "“Gathering”（采集）与 “foraging” 在采集植物或自然物方面高度重叠，但 “gathering” 更中性、更通用，可指任何收集行为（如采花、捡贝壳），而 “foraging” 特指为获取食物或生存资源而进行的系统性搜寻，常带有生态或生存语境。"
    },
    {
      "word_to_compare": "scavenging",
      "analysis": "“Scavenging”（拾荒/捡食）强调从废弃物、残骸或他人丢弃物中寻找可利用的物品或食物，常带有负面或卑微的语义色彩，如动物吃腐肉、人类翻垃圾。而 “foraging” 更多用于自然环境中主动寻找未被污染的天然资源，语义更积极或中性。"
    }
  ]
}