{
  "word": "forcing",
  "pronunciation": "fɔr·sɪŋ",
  "concise_definition": "adj. 强迫的, 强制的; v. 强迫, 强行 (force 的现在分词)",
  "forms": {
    "base_form": "force",
    "third_person_singular": "forces",
    "past_tense": "forced",
    "past_participle": "forced",
    "present_participle": "forcing"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing an action, argument, or situation that is imposed in a way that feels unnatural, pressured, or lacking in sincerity or logical coherence.",
      "explanation_cn": "形容一种被强加的行为、论点或情境，感觉不自然、带有压力，或缺乏真诚与逻辑连贯性。",
      "example_en": "His apology seemed forcing and insincere, as if he was just trying to avoid punishment.",
      "example_cn": "他的道歉显得勉强而不真诚，仿佛只是为了逃避惩罚。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make someone do something against their will or better judgment, often through pressure, threats, or manipulation.",
      "explanation_cn": "通过压力、威胁或操纵，迫使某人做违背其意愿或判断的事情。",
      "example_en": "They were forcing the villagers to leave their homes for the new dam project.",
      "example_cn": "他们强迫村民为新建水坝工程离开家园。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to happen prematurely or unnaturally, often by applying external pressure or influence.",
      "explanation_cn": "通过施加外部压力或影响，使某事过早或不自然地发生。",
      "example_en": "The coach was forcing the young player to return to the game before he was fully recovered.",
      "example_cn": "教练强迫这位年轻球员在尚未完全康复前就重返赛场。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "compelling",
      "analysis": "“Compelling” (令人信服的/有说服力的) 指通过逻辑、情感或魅力使人自愿接受或行动，虽有压力感但不具强制性。而 “forcing” 强调的是外力施压、违背意愿，常带有负面色彩。"
    },
    {
      "word_to_compare": "coercing",
      "analysis": "“Coercing” (胁迫) 与 “forcing” 非常接近，都指通过威胁或暴力手段迫使他人行动。但 “coercing” 更常用于法律或政治语境，强调系统性或制度性的压迫，而 “forcing” 用法更广泛，可涵盖日常语境中的心理或情感压力。"
    },
    {
      "word_to_compare": "imposing",
      "analysis": "“Imposing” (强加的) 指将某种观点、规则或行为强加于人，但不一定涉及直接的胁迫或暴力，更多是权威或地位上的压制。而 “forcing” 更强调行动上的强制执行，常伴随抵抗或冲突。"
    }
  ]
}