{
  "word": "forged",
  "pronunciation": "fawrj",
  "concise_definition": "adj. 伪造的, 假造的; v. 伪造, 冶炼, 锻造",
  "forms": {
    "base_form": "forge",
    "third_person_singular": "forges",
    "past_tense": "forged",
    "past_participle": "forged",
    "present_participle": "forging"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Made or created fraudulently, especially to deceive by imitating something authentic, such as a signature, document, or artwork.",
      "explanation_cn": "指通过欺诈手段制造的，通常是为了模仿真实物品（如签名、文件或艺术品）而进行的伪造。",
      "example_en": "The bank detected a forged check and reported it to the authorities.",
      "example_cn": "银行发现了一张伪造的支票，并向当局报告了此事。"
    },
    {
      "pos": "verb",
      "explanation_en": "To create or shape metal by heating and hammering, often to produce a strong, durable object.",
      "explanation_cn": "指通过加热和锤打金属来制造或塑形，通常用于生产坚固耐用的物品。",
      "example_en": "The blacksmith forged a beautiful iron gate by hand.",
      "example_cn": "铁匠手工锻造了一扇精美的铁门。"
    },
    {
      "pos": "verb",
      "explanation_en": "To produce a false version of something with the intent to deceive, especially for financial or legal gain.",
      "explanation_cn": "指为了欺骗，尤其是为了获取经济或法律利益，而制造某物的虚假版本。",
      "example_en": "He was convicted of forging his boss's signature on official documents.",
      "example_cn": "他因伪造老板在官方文件上的签名而被定罪。"
    },
    {
      "pos": "verb",
      "explanation_en": "To develop or establish something gradually and with effort, often implying strength or authenticity through process.",
      "explanation_cn": "指通过努力逐步建立或形成某物，常暗示通过过程而获得的坚固性或真实性。",
      "example_en": "They forged a strong alliance during years of shared struggle.",
      "example_cn": "他们在多年的共同奋斗中建立了牢固的联盟。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "faked",
      "analysis": "“Faked” (伪造的) 通常指表面的、临时的或粗劣的模仿，强调欺骗的表象，常用于非物理性物品（如表情、数据、表演）。而 “forged” 更常用于具有物理形态或法律效力的伪造物（如签名、文件、金属制品），且隐含更复杂的制作过程和意图。"
    },
    {
      "word_to_compare": "counterfeit",
      "analysis": "“Counterfeit” (伪钞/仿制品) 专指非法复制货币、证件或品牌商品，具有高度的商业和法律针对性，通常指大规模、系统性的仿冒。而 “forged” 范围更广，可指单次、个体性的伪造行为，如伪造签名或文件，不一定涉及商品流通。"
    },
    {
      "word_to_compare": "crafted",
      "analysis": "“Crafted” (精心制作的) 强调技艺、用心和艺术性，通常是正面的，如“crafted wine”或“crafted furniture”。而 “forged” 在作为动词时，虽也指手工制作，但常带有强制、暴力或欺骗的语义色彩，尤其在形容文件或签名时，具有负面含义。"
    }
  ]
}