{
  "word": "forging",
  "pronunciation": "fawr·jing",
  "concise_definition": "n. 锻造, 锻造品; v. 锻造, 伪造, 虚假地制造",
  "forms": {
    "base_form": "forge",
    "third_person_singular": "forges",
    "past_tense": "forged",
    "past_participle": "forged",
    "present_participle": "forging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of shaping metal by heating it and hammering or pressing it into a desired form, typically using tools or machinery.",
      "explanation_cn": "通过加热金属并用锤击或压制将其塑造成特定形状的过程，通常使用工具或机械完成。",
      "example_en": "The blacksmith's forging of the sword took three days of meticulous work.",
      "example_cn": "铁匠锻造这把剑花了三天细致的工作。"
    },
    {
      "pos": "noun",
      "explanation_en": "A metal object that has been shaped through the process of forging, often used in construction, tools, or art.",
      "explanation_cn": "通过锻造工艺制成的金属制品，常用于建筑、工具或艺术品中。",
      "example_en": "The iron gate was a beautiful example of hand-forged steel.",
      "example_cn": "这扇铁门是手工锻造钢材的精美范例。"
    },
    {
      "pos": "verb",
      "explanation_en": "To create or produce something, especially a document, signature, or artifact, with the intent to deceive or falsify.",
      "explanation_cn": "故意伪造或虚假制造某物，尤指文件、签名或文物，以达到欺骗目的。",
      "example_en": "He was arrested for forging checks and stealing thousands of dollars.",
      "example_cn": "他因伪造支票并盗取数千美元而被捕。"
    },
    {
      "pos": "verb",
      "explanation_en": "To establish or develop something, especially a relationship, agreement, or connection, often through persistent effort.",
      "explanation_cn": "通过持续努力建立或发展某种关系、协议或联系。",
      "example_en": "The diplomat spent years forging alliances between the two nations.",
      "example_cn": "这位外交官花了数年时间在两国之间建立联盟。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fabrication",
      "analysis": "“Fabrication”（捏造）通常指完全虚构或编造出不存在的事物，尤其用于信息、故事或证据，强调其虚假性，但不一定涉及物理制造。而 “forging” 可以指物理上的锻造（如金属），也可以指伪造文件，更强调模仿真实物品以欺骗，具有更强的“仿制”意味。"
    },
    {
      "word_to_compare": "manufacturing",
      "analysis": "“Manufacturing”（制造）是中性词，指通过工业流程大规模生产商品，完全合法且无欺骗意图。而 “forging” 在作为动词时，常带有非法或欺诈的语义色彩，即使在金属锻造的语境中，也隐含手工、定制、非工业化的特点。"
    },
    {
      "word_to_compare": "shaping",
      "analysis": "“Shaping”（塑形）是一个广义的物理过程，指任何改变物体外形的行为，可以是切割、 molding、雕刻等，不涉及加热或锤击。而 “forging” 是一种特定的金属加工技术，必须通过高温和锻打，具有明确的技术定义和工业背景。"
    }
  ]
}