{
  "word": "fork",
  "pronunciation": "fawrk",
  "concise_definition": "n. 叉子, 分叉处, 分歧; v. 分叉, 分歧, 出钱",
  "forms": {
    "plural": "forks",
    "third_person_singular": "forks",
    "past_tense": "forked",
    "past_participle": "forked",
    "present_participle": "forking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A utensil with prongs, typically used for eating or lifting food, especially in Western dining.",
      "explanation_cn": "一种带有尖齿的餐具，常用于进食或夹取食物，尤指西方餐饮中使用的餐叉。",
      "example_en": "She picked up the salad with a fork.",
      "example_cn": "她用叉子挑起沙拉。"
    },
    {
      "pos": "noun",
      "explanation_en": "A point where a road, path, or other linear feature divides into two or more branches.",
      "explanation_cn": "道路、路径或其他线性通道分岔成两条或更多分支的地点。",
      "example_en": "Take the left fork at the intersection to reach the lake.",
      "example_cn": "在交叉路口左转，就能到达湖边。"
    },
    {
      "pos": "noun",
      "explanation_en": "A divergence or difference in opinion, direction, or development, especially in politics or technology.",
      "explanation_cn": "意见、方向或发展上的分歧，尤指在政治或技术领域中的分叉。",
      "example_en": "The party faced a major fork in its policy direction after the election.",
      "example_cn": "选举后，该政党在政策方向上面临重大分歧。"
    },
    {
      "pos": "verb",
      "explanation_en": "To divide into two or more branches or paths, especially in a physical or metaphorical sense.",
      "explanation_cn": "（尤指在物理或隐喻意义上）分成两条或更多分支或路径。",
      "example_en": "The river forks just before it reaches the valley.",
      "example_cn": "这条河在流入山谷前分成了两支。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pay for something, especially in informal contexts (often used in the phrase 'to fork out').",
      "explanation_cn": "（非正式用法）支付、掏出（钱），常用于短语 'fork out'，带有勉强或不情愿的语气。",
      "example_en": "We had to fork out a lot of money for the car repairs.",
      "example_cn": "我们不得不为修车花了一大笔钱。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "spoon",
      "analysis": "“Spoon”（勺子）是用于舀取或搅拌液体或软质食物的餐具，其特点是凹陷的头部；而 “fork” 有尖齿，主要用于刺穿或固定固体食物。两者功能互补，但结构和用途截然不同。"
    },
    {
      "word_to_compare": "branch",
      "analysis": "“Branch”（分支）是一个更通用的词，可指树木、组织、语言等的分叉部分，强调结构上的延伸；而 “fork” 更强调分岔点本身，常用于道路、河流或抽象分歧的语境，更具视觉和空间上的转折感。"
    },
    {
      "word_to_compare": "split",
      "analysis": "“Split”（分裂）强调一个整体被强行或自然地分开，常用于抽象概念（如意见分裂）或物理分离（如裂开）；而 “fork” 更中性，常用于描述自然或有序的分岔，不带有破坏性含义，且多用于路径或结构的分叉场景。"
    }
  ]
}