{
  "word": "formulas",
  "pronunciation": "fawr·myoo·luhz",
  "concise_definition": "n. 公式, 配方, 规则",
  "forms": {
    "singular": "formula"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A symbolic expression that represents a general rule, relationship, or principle, especially in mathematics, science, or logic, using numbers, letters, and operators.",
      "explanation_cn": "指用数字、字母和运算符表示的符号表达式，用于描述数学、科学或逻辑中的普遍规则、关系或原理。",
      "example_en": "E = mc² is one of the most famous formulas in physics.",
      "example_cn": "E = mc² 是物理学中最著名的公式之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A prescribed recipe or set of instructions for making something, especially in chemistry, cooking, or manufacturing.",
      "explanation_cn": "指制作某物的指定配方或操作步骤，尤其用于化学、烹饪或制造业。",
      "example_en": "The baby formula contains essential nutrients for infant development.",
      "example_cn": "婴儿配方奶粉含有婴儿发育所需的必需营养素。"
    },
    {
      "pos": "noun",
      "explanation_en": "A fixed or conventional way of doing something, often used in politics, literature, or entertainment to describe predictable patterns.",
      "explanation_cn": "指在政治、文学或娱乐中用于描述可预测模式的一种固定或常规做法。",
      "example_en": "The movie followed the same old formula: hero, villain, and a last-minute rescue.",
      "example_cn": "这部电影遵循了老套的模式：英雄、反派，以及最后一刻的营救。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "equation",
      "analysis": "“Equation”（方程）特指两个表达式之间用等号连接的数学关系，强调平衡与相等。而 “formula” 更广泛，可以是用于计算、推导或指导行动的任何规则表达式，不一定包含等号。例如，面积公式 A = l × w 是一个方程，但化学反应的公式如 H₂O 则不是方程。"
    },
    {
      "word_to_compare": "recipe",
      "analysis": "“Recipe”（食谱）专指烹饪或制作食物的详细步骤，强调操作顺序和具体材料比例。而 “formula” 在此语境下含义相近，但更常用于工业、科学或技术领域，语气更正式、更抽象。例如，婴儿奶粉的配方用 formula，而蛋糕的制作步骤用 recipe。"
    },
    {
      "word_to_compare": "pattern",
      "analysis": "“Pattern”（模式）泛指重复出现的结构、行为或趋势，可以是视觉的、行为的或抽象的，不一定具有精确的表达形式。而 “formula” 暗示一种可被明确写出、计算或复制的标准化方法，更具技术性和可操作性。例如，电影情节的公式是可复制的模板，而模式只是观察到的倾向。"
    }
  ]
}