{
  "word": "forms",
  "pronunciation": "fawrmz",
  "concise_definition": "n. 形式, 样式, 表格, 动词变位",
  "forms": {
    "singular": "form"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The shape, structure, or arrangement of something, especially when it is distinct or recognizable; the outward appearance or configuration of an object or concept.",
      "explanation_cn": "指某物的形状、结构或排列方式，尤其是当其具有明显可识别的特征时；物体或概念的外在形态或构造。",
      "example_en": "The sculpture takes the form of a human figure.",
      "example_cn": "这座雕塑呈人形。"
    },
    {
      "pos": "noun",
      "explanation_en": "A standardized document with blank spaces to be filled in, used for collecting information or making official requests.",
      "explanation_cn": "指用于收集信息或提出正式请求的标准化表格，包含需填写的空白处。",
      "example_en": "Please fill out this application form before submitting your resume.",
      "example_cn": "请在提交简历前填写这份申请表。"
    },
    {
      "pos": "noun",
      "explanation_en": "A particular way in which something is expressed or manifested, especially in language, art, or behavior.",
      "explanation_cn": "指某事物以某种特定方式表达或体现，尤其在语言、艺术或行为中。",
      "example_en": "Love can take many forms — romantic, platonic, or familial.",
      "example_cn": "爱可以有多种形式——浪漫的、友谊的或亲情的。"
    },
    {
      "pos": "noun",
      "explanation_en": "The inflected version of a verb, noun, or adjective according to grammatical rules (e.g., tense, number, case); the specific variant used in a particular context.",
      "explanation_cn": "指根据语法规则变化的动词、名词或形容词的形式（如时态、数、格）；在特定语境中使用的具体变体。",
      "example_en": "The past tense 'walked' is a form of the verb 'walk'.",
      "example_cn": "过去式 'walked' 是动词 'walk' 的一种形式。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "shape",
      "analysis": "“Shape”（形状）更侧重于物体的外部轮廓或几何结构，通常是物理的、可视的，如圆形、方形。而 “form” 的含义更广泛，可指抽象概念的结构或表现方式，如思想的形式、艺术的形式，不仅限于物理形态。"
    },
    {
      "word_to_compare": "type",
      "analysis": "“Type”（类型）强调分类上的差异，用于将事物划分为不同类别，如“狗的类型”或“数据类型”。而 “form” 更强调具体的表现方式或结构形态，即使属于同一类型，也可能有不同的形式。例如，诗歌是一种文学类型，但十四行诗、自由诗是其不同形式。"
    },
    {
      "word_to_compare": "structure",
      "analysis": "“Structure”（结构）通常指事物内部各部分的组织方式和相互关系，强调系统性和功能性，如建筑结构、组织结构。而 “form” 更关注外在表现或整体轮廓，有时结构相同但形式不同，如不同语言中相同的语法结构可能表现为不同的词序形式。"
    }
  ]
}