{
  "word": "formulate",
  "pronunciation": "fawr·myuh·leyt",
  "concise_definition": "v. 精确表述, 制定, 构思",
  "forms": {
    "third_person_singular": "formulates",
    "past_tense": "formulated",
    "past_participle": "formulated",
    "present_participle": "formulating"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To express an idea, plan, or theory clearly and precisely, often in a systematic or structured way, especially after careful thought or analysis.",
      "explanation_cn": "指经过仔细思考或分析后，以清晰、系统或结构化的方式表达一个想法、计划或理论。",
      "example_en": "The scientists formulated a new hypothesis to explain the unusual data.",
      "example_cn": "科学家们提出了一个新的假说来解释这些异常数据。"
    },
    {
      "pos": "verb",
      "explanation_en": "To create or devise a plan, policy, or system, especially by combining various elements in a deliberate and organized manner.",
      "explanation_cn": "指有意识地将各种要素组合起来，制定出一项计划、政策或体系。",
      "example_en": "The government formulated a comprehensive strategy to reduce carbon emissions.",
      "example_cn": "政府制定了一项全面的策略以减少碳排放。"
    },
    {
      "pos": "verb",
      "explanation_en": "To prepare a mixture or compound, especially in chemistry or pharmaceuticals, by combining ingredients according to a specific formula.",
      "explanation_cn": "指在化学或制药领域，根据特定配方将各种成分混合配制出某种物质。",
      "example_en": "The pharmacist formulated a custom medication for the patient's unique condition.",
      "example_cn": "药剂师为这位患者量身配制了一种药物。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "state",
      "analysis": "“State” (陈述) 指简单、直接地表达一个观点或事实，通常不强调结构或复杂性。而 “formulate” 暗示了更深入的思考过程，涉及组织、提炼和系统化，常用于复杂或抽象内容的表达。"
    },
    {
      "word_to_compare": "create",
      "analysis": "“Create” (创造) 范围更广，可指从无到有地生成任何事物，包括艺术、物品或概念，不必然要求逻辑结构或精确性。而 “formulate” 更强调以逻辑、系统或公式化的方式构建，尤其适用于思想、计划或配方的精密构建。"
    },
    {
      "word_to_compare": "draft",
      "analysis": "“Draft” (起草) 通常指初步的、非最终的文本或计划，常用于写作或政策的早期阶段，带有临时性。而 “formulate” 更侧重于完成一个经过深思熟虑、结构严谨的版本，不一定有草稿阶段，更强调内容的成熟与精确性。"
    }
  ]
}