{
  "word": "form",
  "pronunciation": "fawrm",
  "concise_definition": "n. 形式, 形状, 表格; v. 形成, 组成, 构成",
  "forms": {
    "third_person_singular": "forms",
    "past_tense": "formed",
    "past_participle": "formed",
    "present_participle": "forming",
    "plural": "forms"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The shape or configuration of something, especially as distinct from its material or content; the external appearance or structure.",
      "explanation_cn": "指某物的形状或结构，尤其区别于其材质或内容；外部的外观或构造。",
      "example_en": "The sculpture took the form of a human figure.",
      "example_cn": "这座雕塑呈一个人形。"
    },
    {
      "pos": "noun",
      "explanation_en": "A document with blank spaces to be filled in, used for collecting information or making official requests.",
      "explanation_cn": "指用于收集信息或提出正式请求的、带有空白栏的表格。",
      "example_en": "Please fill out this application form before the deadline.",
      "example_cn": "请在截止日期前填写这份申请表。"
    },
    {
      "pos": "noun",
      "explanation_en": "A particular way in which something exists or is expressed, especially in abstract contexts such as ideas, systems, or behaviors.",
      "explanation_cn": "指某事物存在或表达的特定方式，尤其用于抽象语境，如思想、制度或行为。",
      "example_en": "Democracy is one form of government.",
      "example_cn": "民主是一种政府形式。"
    },
    {
      "pos": "verb",
      "explanation_en": "To come into existence or be created, often through the combination or arrangement of parts.",
      "explanation_cn": "指通过部分的组合或排列而产生或形成。",
      "example_en": "Clouds formed over the horizon as the storm approached.",
      "example_cn": "随着暴风雨逼近，云层在地平线上形成。"
    },
    {
      "pos": "verb",
      "explanation_en": "To organize or constitute something by bringing elements together into a structured whole.",
      "explanation_cn": "指将各个要素组织起来，构成一个有结构的整体。",
      "example_en": "A committee was formed to review the policy changes.",
      "example_cn": "成立了一个委员会来审查政策变更。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "shape",
      "analysis": "“Shape” (形状) 更侧重于物体的外部轮廓或几何结构，通常是可触摸、可视的物理形态，如圆形、方形。而 “form” 含义更广，可指抽象结构、组织方式或存在形式，不仅限于物理外观。"
    },
    {
      "word_to_compare": "structure",
      "analysis": "“Structure” (结构) 强调内部组成部分之间的组织关系和系统性，常用于建筑、社会制度或语言体系。而 “form” 更强调外在表现或存在方式，有时可指结构的外在体现，但不一定涉及内部逻辑。"
    },
    {
      "word_to_compare": "type",
      "analysis": "“Type” (类型) 用于分类，强调事物所属的类别或种类，如“这个类型的人”。“Form” 则更强调该类别下的具体表现方式或形态，如“民主是一种政府形式”。前者是分类标签，后者是表现模式。"
    }
  ]
}