{
  "word": "forward",
  "pronunciation": "fawr·wurd",
  "concise_definition": "adv. 向前, 预先; adj. 前进的, 未来的; v. 转发, 促进; n. 前锋",
  "forms": {
    "comparative": "farther/further",
    "superlative": "farthest/furthest",
    "third_person_singular": "forwards",
    "past_tense": "forwarded",
    "past_participle": "forwarded",
    "present_participle": "forwarding"
  },
  "definitions": [
    {
      "pos": "adverb",
      "explanation_en": "In a direction toward the front or ahead, either physically or metaphorically.",
      "explanation_cn": "指在物理上或隐喻上朝前、向前的方向移动或推进。",
      "example_en": "The car moved forward slowly as the light turned green.",
      "example_cn": "灯变绿后，汽车缓慢向前移动。"
    },
    {
      "pos": "adverb",
      "explanation_en": "In advance of the present time; referring to a future point or event.",
      "explanation_cn": "指相对于当前时间的将来，用于表示提前或未来的某个时间点或事件。",
      "example_en": "We need to plan forward to anticipate market changes.",
      "example_cn": "我们需要提前规划，以应对市场变化。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to the future or ahead in time; describing something that is upcoming or progressive.",
      "explanation_cn": "指与未来相关或时间上靠前的；描述即将发生或具有前瞻性的事物。",
      "example_en": "The company released its forward-looking financial projections.",
      "example_cn": "该公司发布了其前瞻性的财务预测。"
    },
    {
      "pos": "verb",
      "explanation_en": "To send something on to another person or place, especially in the context of email or mail.",
      "explanation_cn": "指将某物（尤指邮件或信件）转送给另一个人或地方。",
      "example_en": "Please forward this email to the manager for review.",
      "example_cn": "请将这封邮件转发给经理审阅。"
    },
    {
      "pos": "verb",
      "explanation_en": "To promote or help the progress or development of something.",
      "explanation_cn": "指促进或推动某事物的发展或进步。",
      "example_en": "The new policy is designed to forward economic growth in rural areas.",
      "example_cn": "这项新政策旨在促进农村地区的经济增长。"
    },
    {
      "pos": "noun",
      "explanation_en": "A player in team sports (especially soccer or hockey) whose primary role is to score goals or attack.",
      "explanation_cn": "指团队运动（尤其是足球或冰球）中主要负责进球或进攻的球员。",
      "example_en": "The forward scored a brilliant goal in the final minute of the match.",
      "example_cn": "前锋在比赛最后一分钟攻入一记精彩进球。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ahead",
      "analysis": "“Ahead” (在前面) 通常用于描述位置或时间上的领先，强调相对于当前点的前方，常用于口语和非正式语境。而 “forward” 更强调动作的方向性或主动推进，可用于物理移动、时间推移和抽象发展等多种语境。"
    },
    {
      "word_to_compare": "advance",
      "analysis": "“Advance” (前进/推进) 更正式，常用于军事、科技或抽象概念中的显著进步，带有明确的目标性和战略性。而 “forward” 作为动词时更侧重于传递或转送，或作为副词表示一般性的向前方向，语义范围更广但强度较弱。"
    },
    {
      "word_to_compare": "send",
      "analysis": "“Send” (发送) 是一个更通用的动词，指将某物从一处传到另一处，不特指转交。而 “forward” 作为动词时特指将已接收的物品（如邮件）再转给第三方，隐含了中间传递的流程，具有明确的转递含义。"
    }
  ]
}