{
  "word": "fouls",
  "pronunciation": "fowlz",
  "concise_definition": "n. 犯规, 不正当行为; v. 犯规, 使污染",
  "forms": {
    "singular": "foul"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An illegal or unfair action in a sport that violates the rules, typically resulting in a penalty or loss of possession.",
      "explanation_cn": "指在体育比赛中违反规则的非法或不正当行为，通常会导致判罚或失去控球权。",
      "example_en": "The player was ejected after committing a flagrant foul in the final minute.",
      "example_cn": "这名球员在最后一分钟严重犯规后被罚出场。"
    },
    {
      "pos": "noun",
      "explanation_en": "A morally offensive or disgusting act or statement; something that is repulsive or offensive to good taste.",
      "explanation_cn": "指道德上令人反感或令人厌恶的行为或言论；任何违背良好品味、令人反感的事物。",
      "example_en": "The advertisement was considered a foul by many viewers for its offensive imagery.",
      "example_cn": "许多观众认为这则广告因其冒犯性的图像而是一次低俗之举。"
    },
    {
      "pos": "verb",
      "explanation_en": "To commit an illegal or unfair action during a game or competition, especially in sports.",
      "explanation_cn": "指在比赛或竞赛中实施非法或不正当的行为，尤指体育运动中的犯规。",
      "example_en": "He fouled the shooter just as he was about to take the three-point shot.",
      "example_cn": "就在他准备投三分球时，他犯规了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To contaminate or pollute something, especially by making it unclean or unfit for use.",
      "explanation_cn": "指使某物受到污染或玷污，尤指使其变得不洁或无法使用。",
      "example_en": "The factory's waste has fouled the river and killed the fish.",
      "example_cn": "工厂的废料污染了河流，导致鱼类死亡。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "violations",
      "analysis": "“Violations”（违规）是一个更广泛的术语，泛指任何对规则、法律或协议的违反，不限于体育场景。而 “fouls” 通常特指体育比赛中违反运动规则的行为，具有明确的竞技语境。"
    },
    {
      "word_to_compare": "penalties",
      "analysis": "“Penalties”（处罚）是犯规行为的后果，而非行为本身。犯规（foul）是动作，处罚是针对该动作的制裁，如罚球、黄牌等。二者是因果关系，不可互换。"
    },
    {
      "word_to_compare": "pollutes",
      "analysis": "“Pollutes”（污染）是 “foul” 在环境语境下的近义动词，但 “pollutes” 更强调对自然环境的化学或生态破坏，而 “foul” 更口语化，可泛指任何形式的玷污，包括道德或感官上的厌恶。"
    }
  ]
}