{
  "word": "fountain",
  "pronunciation": "fow·tn",
  "concise_definition": "n. 喷泉, 泉水, 源头; v. 喷出, 涌出",
  "forms": {
    "plural": "fountains"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A structure or device that ejects water into the air, often for decorative or public use, typically found in parks, plazas, or gardens.",
      "explanation_cn": "一种用于将水喷射到空中的结构或装置，常用于公园、广场或花园中，具有装饰或公共观赏功能。",
      "example_en": "The central fountain in the square sparkled under the evening lights.",
      "example_cn": "广场中央的喷泉在夜灯下熠熠生辉。"
    },
    {
      "pos": "noun",
      "explanation_en": "A natural source of water that flows from the ground, often forming a pool or stream.",
      "explanation_cn": "指从地下自然涌出的水源，常形成水池或溪流。",
      "example_en": "The hikers stopped to drink from a cool mountain fountain.",
      "example_cn": "徒步者们停下来饮用山间清凉的泉水。"
    },
    {
      "pos": "noun",
      "explanation_en": "A metaphorical source or origin of something abundant, such as ideas, emotions, or resources.",
      "explanation_cn": "比喻某种丰富事物的源泉或发源地，如思想、情感或资源。",
      "example_en": "She is a fountain of wisdom and kindness, always ready to help others.",
      "example_cn": "她是一位智慧与仁慈的源泉，总是乐于助人。"
    },
    {
      "pos": "verb",
      "explanation_en": "To flow or burst forth in a steady or forceful stream, often used to describe liquids or abstract quantities like tears or words.",
      "explanation_cn": "指液体或抽象事物（如泪水、话语）以持续或猛烈的势头喷涌而出。",
      "example_en": "Tears fountained from her eyes as she heard the news.",
      "example_cn": "听到这个消息时，她泪如泉涌。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "spring",
      "analysis": "“Spring” (泉) 通常指自然形成的、持续涌出的水源，强调其天然性和隐蔽性，常用于地理或生态语境。而 “fountain” 更多指人工建造的喷水装置，或用于比喻性表达，具有更强的象征性和装饰性。"
    },
    {
      "word_to_compare": "source",
      "analysis": "“Source” (源头) 是一个更抽象、更广泛的术语，泛指任何事物的起源，可以是物质的、抽象的或概念性的（如信息的来源）。而 “fountain” 作为比喻时，带有更强烈的动态意象——持续喷涌、丰沛不竭，情感色彩更浓。"
    },
    {
      "word_to_compare": "well",
      "analysis": "“Well” (井) 通常指人工挖掘的、用于汲取地下水的垂直结构，强调的是从地下抽取水的过程，而非喷涌。而 “fountain” 强调水主动向上喷射的动态过程，具有视觉冲击力和仪式感。"
    }
  ]
}