{
  "word": "foundation",
  "pronunciation": "fown·day·shun",
  "concise_definition": "n. 基础, 基地, 基金会, 建立",
  "forms": {
    "plural": "foundations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The base or underlying support on which something is built, whether physical (like a building) or abstract (like an idea or system); the essential starting point or principle.",
      "explanation_cn": "指某事物所依赖的物理基础（如建筑物的地基）或抽象基础（如理念或体系）；是事物得以建立的根本起点或原则。",
      "example_en": "The foundation of a strong democracy is the rule of law and civic participation.",
      "example_cn": "强大民主制度的基础是法治和公民参与。"
    },
    {
      "pos": "noun",
      "explanation_en": "An organization established to provide financial support for charitable, educational, scientific, or cultural purposes, typically funded by an endowment.",
      "explanation_cn": "指为慈善、教育、科学或文化目的提供资金支持的组织，通常由一笔永久性基金资助。",
      "example_en": "The Bill and Melinda Gates Foundation has donated billions to global health initiatives.",
      "example_cn": "比尔与梅琳达·盖茨基金会已向全球卫生项目捐赠了数十亿美元。"
    },
    {
      "pos": "noun",
      "explanation_en": "A layer of makeup applied to the face to create an even, smooth skin tone; also refers to the act of applying it.",
      "explanation_cn": "指涂抹于面部以打造均匀、平滑肤色的底妆，也可指涂抹底妆的行为。",
      "example_en": "She used a lightweight foundation to even out her skin tone before the photoshoot.",
      "example_cn": "她在拍摄前使用轻薄的粉底液来均匀肤色。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "base",
      "analysis": "“Base” (基础) 是一个更通用的词，可指任何事物的底部或支撑部分，物理或抽象均可，但语义较宽泛，不强调系统性或结构性。而 “foundation” 更强调作为整体结构或体系得以成立的根本性、稳定性基础，常用于正式或抽象语境中。"
    },
    {
      "word_to_compare": "groundwork",
      "analysis": "“Groundwork” ( groundwork) 指为某事做准备的前期工作或基础性努力，强调过程性与准备阶段，常用于比喻意义。而 “foundation” 更侧重于结果——即已经建立起来的、稳固的支撑结构，是准备工作的产物。"
    },
    {
      "word_to_compare": "establishment",
      "analysis": "“Establishment” (建立/机构) 指一个组织、制度或体系的创建或确立过程，或指已存在的权威机构。它强调“被建立”的动作或结果，但不必然包含“支撑性”含义。而 “foundation” 更强调作为支撑的底层结构，即使未形成正式机构，也可存在。"
    }
  ]
}