{
  "word": "foundations",
  "pronunciation": "fown·day·shuhnz",
  "concise_definition": "n. 基础, 地基, 基本原理, 基金会",
  "forms": {
    "singular": "foundation"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The physical base or underlying structure on which a building or other structure is built, providing stability and support.",
      "explanation_cn": "指建筑物或其他结构所依附的物理基础或底层结构，提供稳定性和支撑力。",
      "example_en": "The engineers inspected the foundations of the bridge to ensure it could withstand heavy loads.",
      "example_cn": "工程师检查了桥梁的地基，以确保其能够承受重载。"
    },
    {
      "pos": "noun",
      "explanation_en": "The fundamental principles, ideas, or elements upon which a system, theory, or organization is based and from which it develops.",
      "explanation_cn": "指一个体系、理论或组织所依据的基本原则、理念或要素，是其发展和运作的根基。",
      "example_en": "A strong education provides the foundations for lifelong learning and critical thinking.",
      "example_cn": "良好的教育为终身学习和批判性思维奠定了基础。"
    },
    {
      "pos": "noun",
      "explanation_en": "An organization established to provide financial support for charitable, educational, scientific, or cultural purposes, typically funded by an endowment.",
      "explanation_cn": "指为慈善、教育、科学或文化目的提供资金支持的组织，通常由一笔捐赠基金资助。",
      "example_en": "The Bill and Melinda Gates Foundation has donated billions to global health initiatives.",
      "example_cn": "比尔与梅琳达·盖茨基金会已向全球卫生项目捐赠了数十亿美元。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "base",
      "analysis": "“Base” (基础) 是一个更通用的词，可指任何事物的底部或支撑部分，既可以是物理的（如山脚），也可以是抽象的（如证据基础）。而 “foundation” 更强调结构性、根本性和支撑性，常用于建筑或理论体系的深层支撑，语义更正式、更稳固。"
    },
    {
      "word_to_compare": "groundwork",
      "analysis": "“Groundwork” (前期准备) 指为某项工作或计划所做的初步、基础性准备，强调过程性与准备阶段。它常用于比喻意义，如‘为谈判打下 groundwork’。而 ‘foundation’ 更侧重于最终形成的、稳定的结构性基础，是已完成的支撑体系。"
    },
    {
      "word_to_compare": "origin",
      "analysis": "“Origin” (起源) 指某事物的来源或起始点，强调时间上的开端，如‘the origin of language’。而 ‘foundation’ 强调的是支撑性结构或原则，即使在起源之后仍持续发挥作用。一个事物可以有‘origin’但不一定有‘foundation’，反之亦然。"
    }
  ]
}