{
  "word": "fowler",
  "pronunciation": "fow·ler",
  "concise_definition": "n. 猎鸟人, 鸟类学家, (姓氏)",
  "forms": {
    "plural": "fowlers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who hunts wild birds, especially for sport or food, using traps, nets, or guns; historically common in rural and coastal communities.",
      "explanation_cn": "指以捕猎野生鸟类为生或为娱乐的人，常使用陷阱、网具或枪械；历史上在乡村和沿海地区较为普遍。",
      "example_en": "In the 18th century, fowlers would rise before dawn to set nets along the marshes.",
      "example_cn": "在18世纪，猎鸟人会在黎明前起身，在沼泽地设置网具。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who studies or observes birds, especially in a traditional or amateur context; sometimes used as a synonym for 'birdwatcher' in older texts.",
      "explanation_cn": "指研究或观察鸟类的人，尤其在传统或业余语境下；在旧文献中有时作为‘观鸟者’的同义词使用。",
      "example_en": "The old fowler kept detailed journals of migratory patterns, decades before ornithology became a formal science.",
      "example_cn": "这位老猎鸟人几十年前就详细记录了候鸟的迁徙模式，早于鸟类学成为一门正式科学。"
    },
    {
      "pos": "noun",
      "explanation_en": "A surname, notably borne by John Fowler (1817–1898), a British engineer known for his work on agricultural machinery and railway systems.",
      "explanation_cn": "作为姓氏使用，著名人物如英国工程师约翰·福勒（1817–1898），以在农业机械和铁路系统方面的贡献而闻名。",
      "example_en": "Fowler's plow revolutionized farming in Victorian England.",
      "example_cn": "福勒犁彻底改变了维多利亚时代英格兰的农业。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "birdwatcher",
      "analysis": "“Birdwatcher”（观鸟者）是现代常用词，强调以非伤害性方式观察和记录鸟类，通常出于爱好或科学研究，带有生态保护意识。而 “fowler” 传统上指主动捕猎鸟类的人，语义上更偏向狩猎行为，甚至带有一定历史或文化上的负面含义。"
    },
    {
      "word_to_compare": "hunter",
      "analysis": "“Hunter”（猎人）是更广泛的术语，泛指捕猎任何野生动物的人，而 “fowler” 是其子类，特指猎鸟者。因此，“fowler” 语义更具体，常用于历史文献或文学语境中，而 “hunter” 更通用。"
    },
    {
      "word_to_compare": "ornithologist",
      "analysis": "“Ornithologist”（鸟类学家）是专业术语，指受过系统训练、从事鸟类科学研究的学者，强调学术性和科学方法。而 “fowler” 通常指非专业、经验性的鸟类观察者或捕猎者，两者在知识体系、方法和目的上存在本质区别。"
    }
  ]
}