{
  "word": "fp",
  "pronunciation": "efˈpiː",
  "concise_definition": "n. 金融凭证, 金融支付, 金融产品 (缩写)",
  "forms": {
    "plural": "fps"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An abbreviation for 'financial instrument' or 'financial product', commonly used in banking, investment, and accounting contexts to refer to any tradable asset representing monetary value, such as bonds, derivatives, or payment instruments.",
      "explanation_cn": "在银行、投资和会计语境中，作为 'financial instrument' 或 'financial product' 的缩写，指任何代表货币价值的可交易资产，如债券、衍生品或支付工具。",
      "example_en": "The bank's portfolio includes a wide range of fps, from government bonds to structured notes.",
      "example_cn": "该银行的投资组合包含多种金融凭证，从政府债券到结构性票据。"
    },
    {
      "pos": "noun",
      "explanation_en": "An abbreviation for 'funds transfer' or 'funds payment', referring to the electronic or physical movement of money between accounts or institutions.",
      "explanation_cn": "作为 'funds transfer' 或 'funds payment' 的缩写，指资金在账户或机构之间进行的电子或实体转移。",
      "example_en": "All fps must be verified by the central clearing system to prevent fraud.",
      "example_cn": "所有金融支付必须通过中央清算系统验证，以防止欺诈。"
    },
    {
      "pos": "noun",
      "explanation_en": "In some contexts, an abbreviation for 'fixed income product', a type of investment that provides regular, predictable returns such as interest payments.",
      "explanation_cn": "在某些语境中，作为 'fixed income product' 的缩写，指提供定期、可预测回报（如利息支付）的投资类型。",
      "example_en": "Retail investors often prefer fps for their stable returns and lower volatility.",
      "example_cn": "零售投资者通常偏好金融凭证，因其收益稳定且波动性较低。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fi",
      "analysis": "“FI” (Financial Instrument) 是更正式、更广泛的术语，涵盖所有金融工具，包括股票、债券、衍生品等。而 “fp” 通常是行业内部的非正式缩写，更侧重于支付、转账或固定收益产品，使用范围更窄，语境依赖性更强。"
    },
    {
      "word_to_compare": "payment",
      "analysis": "“Payment” (支付) 是一个通用词，指任何资金的转移行为，不特指金融工具。而 “fp” 作为缩写，通常指代的是具有标准化结构、可交易或可记录的金融产品或支付机制，具有更强的专业性和技术性。"
    },
    {
      "word_to_compare": "asset",
      "analysis": "“Asset” (资产) 是一个宏观会计术语，泛指任何具有经济价值的资源。而 “fp” 是资产的一个子集，特指金融类资产，且通常用于交易或结算场景，语义更具体、更专业。"
    }
  ]
}