{
  "word": "fracture",
  "pronunciation": "frak·chur",
  "concise_definition": "n. 骨折, 断裂; v. 折断, 破裂",
  "forms": {
    "third_person_singular": "fractures",
    "past_tense": "fractured",
    "past_participle": "fractured",
    "present_participle": "fracturing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A break or crack in a hard or rigid structure, especially in a bone, caused by trauma or stress.",
      "explanation_cn": "指坚硬或刚性结构（尤其是骨骼）因外伤或压力而产生的断裂或裂纹。",
      "example_en": "The athlete suffered a fracture in his left tibia after the fall.",
      "example_cn": "这名运动员在摔倒后左胫骨发生骨折。"
    },
    {
      "pos": "noun",
      "explanation_en": "A break or division in a continuous whole, such as a relationship, system, or geological layer, often indicating a sudden or severe disruption.",
      "explanation_cn": "指连续整体（如关系、系统或地质层）中的断裂或分裂，常表示突然或严重的中断。",
      "example_en": "There was a fracture in the alliance after the controversial decision.",
      "example_cn": "在做出有争议的决定后，联盟内部出现了裂痕。"
    },
    {
      "pos": "verb",
      "explanation_en": "To break or cause to break into pieces, especially a bone or a hard material, often due to force or pressure.",
      "explanation_cn": "指因外力或压力而使某物（尤其是骨骼或硬质材料）断裂或碎裂。",
      "example_en": "The impact fractured her wrist during the skiing accident.",
      "example_cn": "在滑雪事故中，撞击导致她的手腕骨折。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a division or breakdown in a relationship, system, or agreement, often leading to conflict or instability.",
      "explanation_cn": "指导致关系、系统或协议的分裂或崩溃，常引发冲突或不稳定。",
      "example_en": "The scandal fractured the political party into competing factions.",
      "example_cn": "这起丑闻使政党分裂成相互竞争的派系。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "break",
      "analysis": "“Break” (断裂) 是一个更通用的词，可用于任何类型的断裂，包括非物理性的（如打破规则、打破沉默），而 “fracture” 更常用于描述坚硬物体（如骨头、岩石）的裂开，或抽象结构（如关系）的严重裂痕，语气更正式、更具体。"
    },
    {
      "word_to_compare": "crack",
      "analysis": "“Crack” (裂纹) 指的是表面的细小裂口，通常未完全断裂，程度较轻；而 “fracture” 暗示更严重的断裂，可能完全分离。例如，玻璃上有一条 crack，但若完全断成两半，则是 fracture。"
    },
    {
      "word_to_compare": "split",
      "analysis": "“Split” (分裂) 强调从中间分开，常用于可延展或柔韧的物体（如木头、布料）或群体（如团队分裂），而 “fracture” 更强调因外力导致的突然、不规则的断裂，常带有破坏性和不可逆的意味。"
    }
  ]
}