{
  "word": "fragment",
  "pronunciation": "frag·muhnt",
  "concise_definition": "n. 碎片, 零 fragment, 片段 v. 碎裂, 分裂",
  "forms": {
    "plural": "fragments"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small part or piece broken off or separated from a larger whole, often implying incompleteness or damage.",
      "explanation_cn": "从较大整体中分离或断裂出来的小部分，通常暗示不完整或受损的状态。",
      "example_en": "Archaeologists found a fragment of ancient pottery at the excavation site.",
      "example_cn": "考古学家在发掘现场发现了一块古代陶器的碎片。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small section or portion of something abstract, such as a memory, idea, or piece of information, often incomplete or disconnected.",
      "explanation_cn": "指抽象事物（如记忆、想法或信息）中的一小部分，通常不完整或彼此脱节。",
      "example_en": "She remembered only fragments of the dream when she woke up.",
      "example_cn": "她醒来后只记得梦中的一些零碎片段。"
    },
    {
      "pos": "verb",
      "explanation_en": "To break or cause something to break into small pieces, often suddenly or violently.",
      "explanation_cn": "使某物突然或剧烈地碎裂成小片。",
      "example_en": "The explosion fragmented the building's walls into countless shards.",
      "example_cn": "爆炸使建筑物的墙壁碎裂成无数碎片。"
    },
    {
      "pos": "verb",
      "explanation_en": "To divide or split something into disconnected parts, especially in a way that weakens its coherence or unity.",
      "explanation_cn": "将某物分裂成彼此脱节的部分，尤指削弱其整体性或连贯性。",
      "example_en": "The political scandal fragmented the party into rival factions.",
      "example_cn": "政治丑闻使该政党分裂成多个对立派系。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "piece",
      "analysis": "“Piece”（部分）是一个中性词，泛指整体中的任一部分，不暗示破损或不完整，可以是完整且有意分离的（如一块蛋糕）。而 “fragment” 强调从整体中意外或暴力地断裂，通常带有残缺、零散的含义。"
    },
    {
      "word_to_compare": "shard",
      "analysis": "“Shard”（尖锐碎片）特指玻璃、陶瓷等硬脆材料碎裂后形成的尖锐小片，具有明确的物理形态和危险性。而 “fragment” 更广泛，可指任何材质的碎片，包括抽象事物（如记忆），且不一定尖锐。"
    },
    {
      "word_to_compare": "bit",
      "analysis": "“Bit”（一点）是口语化表达，指极小的部分，常用于非正式语境，如 “a bit of information”。“Fragment” 更正式，常用于学术、文学或科学语境，且更强调断裂或分离的过程，而 “bit” 仅强调数量少。"
    }
  ]
}