{
  "word": "fragile",
  "pronunciation": "fraj·uh·l",
  "concise_definition": "adj. 易碎的, 脆弱的, 精神脆弱的",
  "forms": {
    "comparative": "more fragile",
    "superlative": "most fragile"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Easily broken, damaged, or destroyed, especially due to delicate structure or material; often used for physical objects like glass, porcelain, or electronics.",
      "explanation_cn": "由于结构或材质精细而容易破碎、损坏或毁坏，常用于描述玻璃、瓷器或电子产品等物理物品。",
      "example_en": "The antique vase was so fragile that we had to transport it with special padding.",
      "example_cn": "这件古董花瓶非常易碎，我们必须用特殊衬垫运输。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Physically weak or delicate, often due to illness, age, or poor health; describing a person’s bodily condition.",
      "explanation_cn": "因疾病、年老或健康状况不佳而身体虚弱或纤弱，用于描述人的身体状态。",
      "example_en": "After the long hospital stay, the child was too fragile to travel.",
      "example_cn": "经过长时间住院后，孩子身体太虚弱，无法旅行。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Emotionally or psychologically vulnerable; easily upset, hurt, or influenced by external factors.",
      "explanation_cn": "情感或心理上脆弱，容易因外界因素而受挫、受伤或受影响。",
      "example_en": "She gave a fragile smile, trying to hide how deeply she was affected by the news.",
      "example_cn": "她勉强露出一丝脆弱的微笑，试图掩饰这条消息对她造成的巨大打击。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "delicate",
      "analysis": "“Delicate”（精致的/精细的）强调精致、微妙或需要小心处理，常用于正面或中性语境，如“delicate flavor”（精致的风味）或“delicate situation”（微妙的局面）。“Fragile”则更强调易损、易毁的特性，带有负面或风险含义，侧重于“容易破碎”这一物理或情感上的脆弱性。"
    },
    {
      "word_to_compare": "brittle",
      "analysis": "“Brittle”（脆的）通常用于描述坚硬但缺乏韧性、一碰即碎的材料，如塑料、陶瓷或金属，强调的是材料的刚性与缺乏延展性。“Fragile”适用范围更广，不仅用于材料，还可用于人、关系、系统等抽象概念，且不必然伴随坚硬的质地。"
    },
    {
      "word_to_compare": "vulnerable",
      "analysis": "“Vulnerable”（易受伤害的）强调暴露于风险、攻击或伤害之下，常用于心理、社会或安全语境，如“vulnerable populations”（弱势群体）。“Fragile”更侧重于内在结构或状态的不稳固，而“vulnerable”更强调外部威胁的存在。两者可重叠，但“vulnerable”更具主动性，而“fragile”更偏向被动状态。"
    }
  ]
}