{
  "word": "frame",
  "pronunciation": "frām",
  "concise_definition": "n. 框架, 框架结构, 身材; v. 构成, 设计, 陷害",
  "forms": {
    "third_person_singular": "frames",
    "past_tense": "framed",
    "past_participle": "framed",
    "present_participle": "framing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A structure that surrounds, supports, or contains something, typically made of wood, metal, or other rigid material, and used to hold or display objects such as pictures, windows, or doors.",
      "explanation_cn": "指由木材、金属或其他刚性材料制成的结构，用于包围、支撑或容纳某物，常用于固定或展示图片、窗户或门等。",
      "example_en": "She hung the painting in a golden frame above the fireplace.",
      "example_cn": "她把画挂在壁炉上方的一个金色画框里。"
    },
    {
      "pos": "noun",
      "explanation_en": "A mental or conceptual structure that shapes how people perceive, interpret, or understand a situation, issue, or piece of information.",
      "explanation_cn": "指一种心理或概念性结构，影响人们如何感知、解释或理解某种情境、问题或信息。",
      "example_en": "The media's framing of the election as a 'clash of ideologies' influenced public opinion.",
      "example_cn": "媒体将选举描述为‘意识形态的对抗’，这种框架影响了公众舆论。"
    },
    {
      "pos": "noun",
      "explanation_en": "The physical structure or build of a person's body, especially in terms of size and proportion.",
      "explanation_cn": "指一个人的身体结构或体型，尤其指其大小和比例。",
      "example_en": "He has a broad frame and looks strong even without muscles.",
      "example_cn": "他骨架宽大，即使没有肌肉也显得很强壮。"
    },
    {
      "pos": "verb",
      "explanation_en": "To create or construct something carefully, especially a statement, policy, or plan, often with a specific purpose or effect in mind.",
      "explanation_cn": "指精心构建或设计某事物（如陈述、政策或计划），通常带有特定目的或预期效果。",
      "example_en": "The lawyer framed her argument to emphasize the defendant's lack of intent.",
      "example_cn": "律师精心构建了她的论点，以强调被告没有犯罪意图。"
    },
    {
      "pos": "verb",
      "explanation_en": "To falsely incriminate someone by planting evidence or manipulating facts to make them appear guilty of a crime.",
      "explanation_cn": "指通过伪造证据或操纵事实，使某人被错误地指控为犯罪者。",
      "example_en": "The suspect claimed he was framed by the police after they found drugs in his car.",
      "example_cn": "嫌疑人声称，警方在他车里发现毒品后，故意陷害了他。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "structure",
      "analysis": "“Structure”（结构）泛指任何事物的组织方式或组成部分，适用范围极广，可指建筑、组织、语言等。而 “frame” 更强调支撑性、边界性或框架性的结构，常带有外在轮廓或承载功能，如画框、思维框架。"
    },
    {
      "word_to_compare": "outline",
      "analysis": "“Outline”（大纲/轮廓）指事物的简略轮廓或基本要点，通常缺乏细节和深度，用于初步规划。而 “frame” 不仅包含轮廓，还承载内容、赋予意义，尤其在抽象语境中（如‘思维框架’）具有更强的解释和引导功能。"
    },
    {
      "word_to_compare": "build",
      "analysis": "“Build”（构建）作为动词时，强调建造或组合的过程，常用于物理实体（如建房子）或抽象系统（如建立关系）。“Frame” 在动词用法中更侧重于‘设计’或‘塑造’表达方式，尤其在语言、法律或媒体语境中带有策略性意图，甚至隐含‘陷害’的负面含义，这是 ‘build’ 所不具备的。"
    }
  ]
}