{
  "word": "frames",
  "pronunciation": "frāmz",
  "concise_definition": "n. 框架, 画框, 身材, 结构",
  "forms": {
    "singular": "frame"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A structure that forms the outer boundary or support of something, such as a picture, window, or building, often made of wood, metal, or other rigid materials.",
      "explanation_cn": "指构成某物外部边界或支撑结构的框架，如画框、窗户或建筑的骨架，通常由木材、金属或其他刚性材料制成。",
      "example_en": "The artist carefully selected a gold frame to complement the painting.",
      "example_cn": "艺术家精心挑选了一个金色画框来衬托这幅画。"
    },
    {
      "pos": "noun",
      "explanation_en": "A single image in a sequence of moving pictures, such as in a film or video, representing one moment in time.",
      "explanation_cn": "指电影或视频中连续画面中的单个图像，代表某一特定时刻的画面。",
      "example_en": "The film runs at 24 frames per second to create smooth motion.",
      "example_cn": "这部电影以每秒24帧的速度播放，以产生流畅的动态效果。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person's physical build or body structure, especially in terms of size and shape.",
      "explanation_cn": "指一个人的体型或身体结构，尤其指其大小和形态。",
      "example_en": "She has a slender frame and looks elegant in any dress.",
      "example_cn": "她身材纤细，穿任何裙子都显得优雅。"
    },
    {
      "pos": "noun",
      "explanation_en": "A conceptual structure or system that organizes how something is perceived, understood, or interpreted, often used in social, political, or psychological contexts.",
      "explanation_cn": "指一种概念性结构或体系，用于组织人们对某事物的感知、理解或解释，常用于社会、政治或心理语境中。",
      "example_en": "The media's framing of the issue influenced public opinion significantly.",
      "example_cn": "媒体对这一问题的框架塑造显著影响了公众舆论。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "structure",
      "analysis": "“Structure”（结构）是一个更广泛、更抽象的术语，泛指任何事物的组织方式，包括系统、组织、建筑等。而 “frame” 更强调外部支撑或边界，常具有物理形态，或在隐喻中指一种特定的解释视角。"
    },
    {
      "word_to_compare": "border",
      "analysis": "“Border”（边界）仅指两个区域之间的分界线，强调界限而非支撑或容纳功能。而 “frame” 不仅界定范围，还提供支撑或承载作用，如画框承载画作，语境框架承载意义。"
    },
    {
      "word_to_compare": "shot",
      "analysis": "“Shot”（镜头）在影视语境中指从摄像机开始到停止拍摄的连续画面，通常包含多个帧（frames）。一个 shot 可能由几十甚至上百个 frames 组成，因此 “frame” 是构成 “shot” 的基本单位，二者是组成与整体的关系。"
    }
  ]
}