{
  "word": "framing",
  "pronunciation": "frey·ming",
  "concise_definition": "n. 框架构建, 陈述方式, 装框",
  "forms": {
    "base_form": "frame",
    "third_person_singular": "frames",
    "past_tense": "framed",
    "past_participle": "framed",
    "present_participle": "framing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The way in which information, events, or issues are presented or structured to influence perception, interpretation, or response, often by emphasizing certain aspects while downplaying others.",
      "explanation_cn": "指以特定方式呈现信息、事件或议题，以影响人们的感知、理解或反应，通常通过突出某些方面而弱化其他方面来实现。",
      "example_en": "The media's framing of the protest as violent shaped public opinion against the demonstrators.",
      "example_cn": "媒体将抗议活动描述为暴力事件，影响了公众对示威者的看法。"
    },
    {
      "pos": "noun",
      "explanation_en": "The structural system or arrangement of components that supports or defines the shape of a building, object, or image, especially in construction or photography.",
      "explanation_cn": "指用于支撑或界定建筑物、物体或图像形状的结构系统或组件排列，尤其在建筑或摄影中。",
      "example_en": "The wooden framing of the house was inspected for signs of termite damage.",
      "example_cn": "对房屋的木制框架进行了检查，以查看是否有白蚁损坏的迹象。"
    },
    {
      "pos": "noun",
      "explanation_en": "The border or edge surrounding a picture, photograph, or artwork, typically made of wood, metal, or plastic, used for decoration and protection.",
      "explanation_cn": "指围绕图片、照片或艺术品的边框，通常由木材、金属或塑料制成，用于装饰和保护。",
      "example_en": "She chose a gold frame to complement the vintage painting.",
      "example_cn": "她选择了一个金色画框来搭配这幅复古油画。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "perspective",
      "analysis": "“Perspective”（视角）强调观察者主观的立场或看待事物的角度，通常是认知层面的；而 “framing” 更侧重于外部如何主动构建和呈现信息，是一种有意识的表达策略，常用于传播、政治或媒体语境中。"
    },
    {
      "word_to_compare": "structure",
      "analysis": "“Structure”（结构）泛指事物内部的组织方式或系统性安排，中性且广泛；而 “framing” 特指为特定目的（如影响理解）而设计的结构化呈现方式，带有明显的意图性和修辞功能。"
    },
    {
      "word_to_compare": "context",
      "analysis": "“Context”（语境）指信息所处的背景环境，是理解意义的必要条件；而 “framing” 是主动选择和塑造语境的过程，通过筛选、强调或隐去某些元素来引导解读，是语境的建构行为而非被动存在。"
    }
  ]
}