{
  "word": "framed",
  "pronunciation": "fraymd",
  "concise_definition": "adj. 被装框的, 被构陷的; v. 设计, 构思, 陷害",
  "forms": {
    "base_form": "frame",
    "third_person_singular": "frames",
    "past_tense": "framed",
    "past_participle": "framed",
    "present_participle": "framing"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Placed within a frame, typically for display or protection; often used to describe artwork, photographs, or mirrors that have been mounted in a decorative border.",
      "explanation_cn": "被置于框架内，通常用于展示或保护；常用于描述被装入装饰性边框的艺术品、照片或镜子。",
      "example_en": "The antique painting was beautifully framed in gold wood.",
      "example_cn": "这幅古画被精美地装在金色木框中。"
    },
    {
      "pos": "verb",
      "explanation_en": "To deliberately construct or devise something, especially a statement, argument, or plan, often with careful attention to wording or structure.",
      "explanation_cn": "有意识地设计或构建某事物，尤指措辞或结构经过精心安排的陈述、论点或计划。",
      "example_en": "The lawyer framed her defense around the lack of eyewitness testimony.",
      "example_cn": "律师的辩护围绕缺乏目击证词展开。"
    },
    {
      "pos": "verb",
      "explanation_en": "To falsely accuse or incriminate someone by fabricating evidence or manipulating circumstances, often to shift blame or achieve a malicious goal.",
      "explanation_cn": "通过伪造证据或操纵情境，故意诬陷某人，使其承担并非其犯下的罪责，通常出于恶意目的。",
      "example_en": "He was framed for the robbery by a colleague who wanted to cover up his own theft.",
      "example_cn": "他被一位同事陷害，后者为了掩盖自己的盗窃行为而嫁祸于他。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mounted",
      "analysis": "“Mounted”（安装/装裱）强调物理上的固定或安置，如将画作装在墙上或相框中，但不包含“设计”或“诬陷”的含义。而 “framed” 在作为形容词时虽可与之互换，但作为动词时含义更广，包含人为构建或陷害的意图。"
    },
    {
      "word_to_compare": "constructed",
      "analysis": "“Constructed”（构建）泛指任何有意识地组织或建造事物，如建筑、理论或叙述，中性且广泛。而 “framed” 在用于语言或论证时，隐含了“策略性地塑造表达方式以影响理解”的意图，常带修辞或操纵色彩。"
    },
    {
      "word_to_compare": "incriminated",
      "analysis": "“Incriminated”（使陷于罪责）仅指使某人看起来有罪，是 “framed” 的结果之一，但不包含“伪造证据”或“设计情境”的主动行为。而 “framed” 强调整个陷害过程的策划性与欺骗性，语义更完整、更具恶意。"
    }
  ]
}