{
  "word": "franchise",
  "pronunciation": "fran·chīz",
  "concise_definition": "n. 特许经营权, 特许经营; v. 授予特许经营权",
  "forms": {
    "plural": "franchises",
    "third_person_singular": "franchises",
    "past_tense": "franchised",
    "past_participle": "franchised",
    "present_participle": "franchising"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A legal right granted by a company or government to an individual or group to operate a business under its brand name and according to its established rules, typically in exchange for fees or royalties.",
      "explanation_cn": "指公司或政府授予个人或团体的一项合法权利，允许其在特定品牌下按照既定规则经营业务，通常需支付费用或特许权使用费。",
      "example_en": "She opened a new franchise of the popular coffee chain in downtown.",
      "example_cn": "她在市中心开设了一家知名咖啡连锁品牌的特许经营店。"
    },
    {
      "pos": "noun",
      "explanation_en": "The right to vote in political elections, especially when referring to the extension of voting rights to previously excluded groups.",
      "explanation_cn": "指参与政治选举的投票权，尤其用于指将投票权扩展至此前被排除的群体。",
      "example_en": "The women's suffrage movement fought for the franchise for decades.",
      "example_cn": "妇女选举权运动为争取投票权奋斗了数十年。"
    },
    {
      "pos": "verb",
      "explanation_en": "To grant a franchise to someone, allowing them to operate a business under a recognized brand or system.",
      "explanation_cn": "指授予某人特许经营权，允许其在知名品牌或体系下经营业务。",
      "example_en": "The fast-food giant franchised its restaurants across Asia.",
      "example_cn": "这家快餐巨头将其餐厅的特许经营权扩展至亚洲各地。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "license",
      "analysis": "“License”（许可证）泛指政府或权威机构授予的从事某项活动的合法许可，范围广泛，如驾驶执照、药品销售许可，不一定涉及品牌运营或商业模式。而 “franchise” 特指商业特许经营，包含品牌使用、运营标准和持续费用，是一种更系统、更深入的授权关系。"
    },
    {
      "word_to_compare": "concession",
      "analysis": "“Concession”（特许权/特许经营）常用于公共领域，如政府授予企业经营机场商店、高速公路收费等公共服务的权利，强调公共利益与垄断性。而 “franchise” 更多用于商业零售或服务行业，以品牌复制和标准化运营为核心，商业属性更强。"
    },
    {
      "word_to_compare": "branding",
      "analysis": "“Branding”（品牌建设）是塑造和推广品牌形象的过程，属于营销范畴，不涉及法律授权或经营权转让。而 “franchise” 是一种法律和商业契约，包含品牌使用、运营规范和财务分成，是品牌授权的实体化实现方式。"
    }
  ]
}