{
  "word": "frankenstein",
  "pronunciation": "fran·ken·stein",
  "concise_definition": "n. 弗兰肯斯坦；造物主反被其创造物毁灭者；失控的创造物",
  "forms": {
    "plural": "frankensteins"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The name of the fictional scientist in Mary Shelley's 1818 novel 'Frankenstein; or, The Modern Prometheus,' who creates a sentient creature through unorthodox scientific experiments; often mistakenly used to refer to the creature itself.",
      "explanation_cn": "玛丽·雪莱1818年小说《弗兰肯斯坦；或现代普罗米修斯》中虚构的科学家之名，他通过非正统的科学实验创造了一个有感知能力的生物；常被误用来指代该生物本身。",
      "example_en": "In the novel, Dr. Frankenstein is horrified by the monster he brought to life.",
      "example_cn": "在小说中，弗兰肯斯坦博士对自己创造的生命感到恐惧。"
    },
    {
      "pos": "noun",
      "explanation_en": "A creation that turns against its creator or becomes uncontrollable, often due to unintended consequences of human ambition or technological advancement.",
      "explanation_cn": "指一种因人类野心或技术进步的意外后果而反噬其创造者、或失去控制的产物。",
      "example_en": "The company's AI system became a frankenstein — it started making decisions no one could predict or stop.",
      "example_cn": "这家公司的AI系统成了一个‘弗兰肯斯坦’——它开始做出无人能预测或阻止的决定。"
    },
    {
      "pos": "noun",
      "explanation_en": "A grotesque or monstrous figure, especially one assembled from disparate parts, often used metaphorically to describe something cobbled together in a haphazard or unnatural way.",
      "explanation_cn": "指一个由不同部分拼凑而成的怪诞或恐怖形象，常用于隐喻描述某种杂乱无章、非自然拼凑的事物。",
      "example_en": "The new policy is a frankenstein of conflicting laws and outdated regulations.",
      "example_cn": "这项新政策是各种相互冲突的法律和过时法规拼凑而成的怪胎。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "monster",
      "analysis": "“Monster”（怪物）泛指任何恐怖、畸形或危险的生物，不涉及创造者与被创造者的关系。而 “frankenstein” 特指由人类创造、最终反噬创造者的事物，强调因果与失控的悲剧性，具有强烈的文化隐喻色彩。"
    },
    {
      "word_to_compare": "creation",
      "analysis": "“Creation”（创造物）是中性词，仅指被创造出来的事物，无负面含义。而 “frankenstein” 隐含了创造失败、失控、反噬的负面后果，带有警示意味，常用于批评技术滥用或傲慢的人类干预。"
    },
    {
      "word_to_compare": "golem",
      "analysis": "“Golem”（哥雷姆）源自犹太民间传说，指用泥土或无生命物质造出、受控于主人的仆从，通常没有自主意识或反叛倾向。而 “frankenstein” 的核心是创造物获得意识后反抗主人，强调自主性与伦理危机，更具现代科技焦虑的象征意义。"
    }
  ]
}