{
  "word": "franchises",
  "pronunciation": "fran·chīz",
  "concise_definition": "n. 特许经营权, 特许经营店, 专营权",
  "forms": {
    "singular": "franchise"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A legal right granted by a company to an individual or group to operate a business under the company's brand name and business model, typically in exchange for fees and adherence to specific standards.",
      "explanation_cn": "指一家公司授予个人或团体的合法权利，允许其在公司品牌和商业模式下经营业务，通常需支付费用并遵守特定标准。",
      "example_en": "The fast-food chain has over 5,000 franchises worldwide.",
      "example_cn": "这家快餐连锁店在全球拥有超过5000家特许经营店。"
    },
    {
      "pos": "noun",
      "explanation_en": "A business or enterprise that operates under such a franchise agreement, often as part of a larger network or brand.",
      "explanation_cn": "指依据特许经营协议运营的企业或商业实体，通常是更大品牌网络中的一部分。",
      "example_en": "She opened a franchise of a well-known coffee brand in her hometown.",
      "example_cn": "她在家乡开了一家知名咖啡品牌的特许经营店。"
    },
    {
      "pos": "noun",
      "explanation_en": "A right or privilege granted by a government or authority, especially the right to vote or to engage in a particular commercial activity.",
      "explanation_cn": "指由政府或权威机构授予的权利或特权，尤指投票权或从事特定商业活动的许可。",
      "example_en": "In many countries, the franchise to vote was extended to women in the early 20th century.",
      "example_cn": "在许多国家，女性在20世纪初获得了投票权。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "license",
      "analysis": "“License”（许可证）泛指政府或机构授予的从事某项活动的法定许可，范围更广，可涉及驾驶、医疗、建筑等，不一定包含品牌或商业模式。而 “franchise” 特指商业特许经营，包含品牌使用、运营标准和持续费用，是一种更复杂的商业合作关系。"
    },
    {
      "word_to_compare": "subsidiary",
      "analysis": "“Subsidiary”（子公司）是母公司完全或部分拥有的独立法律实体，其运营由母公司直接控制。而 “franchise” 是独立所有者在授权下使用品牌，所有权和日常管理仍归加盟商，母公司仅提供支持和监督。两者在控制权和所有权结构上有本质区别。"
    },
    {
      "word_to_compare": "brand",
      "analysis": "“Brand”（品牌）指产品的名称、标志、形象等识别系统，是特许经营的核心资产之一，但本身不是一种经营权。而 “franchise” 是基于品牌建立的、可转让的商业运营权利。一个品牌可以没有特许经营，但一个特许经营必须依赖品牌。"
    }
  ]
}