{
  "word": "fraternity",
  "pronunciation": "fruh·tér·nuh·tee",
  "concise_definition": "n. 兄弟会, 互助团体, 兄弟情谊",
  "forms": {
    "plural": "fraternities"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A social organization, typically among male students at a college or university, bound together by shared values, rituals, and mutual support, often with a focus on networking, leadership, and lifelong membership.",
      "explanation_cn": "指大学或学院中男性学生组成的社交组织，成员基于共同的价值观、仪式和相互支持而凝聚，通常注重人际网络建设、领导力培养和终身会员关系。",
      "example_en": "He joined the fraternity during his freshman year and quickly became a leader in campus activities.",
      "example_cn": "他在大一加入了兄弟会，并迅速成为校园活动的领导者。"
    },
    {
      "pos": "noun",
      "explanation_en": "A close-knit group of people united by common interests, goals, or experiences, often implying a sense of brotherhood or solidarity beyond formal ties.",
      "explanation_cn": "指因共同兴趣、目标或经历而紧密团结的一群人，常暗示超越正式关系的兄弟情谊或团结精神。",
      "example_en": "The writers formed a fraternity of sorts, sharing manuscripts and offering honest feedback.",
      "example_cn": "这些作家形成了一种类似兄弟会的团体，彼此分享手稿并提供真诚的反馈。"
    },
    {
      "pos": "noun",
      "explanation_en": "The feeling of brotherhood or mutual affection among members of a group, especially one based on shared identity or purpose.",
      "explanation_cn": "指群体成员之间因共同身份或目标而产生的兄弟情谊或相互关爱之情。",
      "example_en": "There was a deep fraternity among the firefighters who had risked their lives together.",
      "example_cn": "那些曾并肩冒死救人的消防员之间有着深厚的兄弟情谊。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "society",
      "analysis": "“Society”（社会/社团）范围更广，可指国家、文化或大型组织体系，强调制度性与公共性；而 “fraternity” 更强调成员间的情感纽带、亲密性和排他性，通常规模较小且具有仪式感。"
    },
    {
      "word_to_compare": "brotherhood",
      "analysis": "“Brotherhood”（兄弟情谊）是抽象概念，侧重情感与精神联结，不必然构成正式组织；而 “fraternity” 通常指有组织架构、章程和活动的实体团体，是 “brotherhood” 的制度化体现。"
    },
    {
      "word_to_compare": "club",
      "analysis": "“Club”（俱乐部）泛指因共同爱好或目的而聚集的团体，形式自由、结构松散，不一定有仪式或长期承诺；而 “fraternity” 通常有严格的入会程序、象征符号（如徽章、口号）和终身归属感，更具传统性和仪式性。"
    }
  ]
}