{
  "word": "freeman",
  "pronunciation": "free·man",
  "concise_definition": "n. 自由民, 自由人, 公民",
  "forms": {
    "plural": "freemen"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who is not a slave or serf, and who enjoys personal liberty and legal rights within a society, especially in historical contexts such as medieval Europe or early American colonies.",
      "explanation_cn": "指非奴隶或农奴、在社会中享有个人自由和法律权利的人，尤其用于中世纪欧洲或早期美洲殖民地等历史语境中。",
      "example_en": "In medieval England, a freeman could own land and participate in local governance.",
      "example_cn": "在中世纪英格兰，自由民可以拥有土地并参与地方治理。"
    },
    {
      "pos": "noun",
      "explanation_en": "A citizen of a city or town who has been granted certain privileges, such as the right to trade or vote, often through membership in a guild or by birth.",
      "explanation_cn": "指被授予特定特权（如经商或投票权）的城市或城镇居民，这些特权通常通过行会 membership 或出身获得。",
      "example_en": "The ancient Roman freemen formed the backbone of the republic’s civic life.",
      "example_cn": "古罗马的自由民构成了共和国公民生活的中坚力量。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is not bound by obligation or constraint, especially in a metaphorical sense — free from oppression, dogma, or societal pressure.",
      "explanation_cn": "指在隐喻意义上不受义务或束缚的人，尤其指摆脱压迫、教条或社会压力的自由思想者。",
      "example_en": "She considered herself a freeman of thought, unafraid to challenge conventional wisdom.",
      "example_cn": "她自视为思想上的自由人，敢于挑战传统智慧。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "citizen",
      "analysis": "“Citizen”（公民）是一个现代法律术语，强调一个人在国家或政治共同体中的法律身份和权利义务，不必然包含历史意义上的“非奴隶”属性。而 “freeman” 更强调个人自由的原始状态，常带有历史或社会等级制度的背景，范围更窄但内涵更深刻。"
    },
    {
      "word_to_compare": "liberty",
      "analysis": "“Liberty”（自由）是抽象名词，指自由的状态或权利，而 “freeman” 是具体名词，指拥有这种状态的人。前者是概念，后者是主体。例如，我们说 “the pursuit of liberty”，但说 “a freeman of the city”。"
    },
    {
      "word_to_compare": "free person",
      "analysis": "“Free person” 是一个现代、中性的直译表达，泛指任何非被奴役者，语义宽泛但缺乏文化历史厚度。而 “freeman” 常带有特定历史、法律或社会身份的内涵，如中世纪行会成员或殖民地特许居民，具有更强的文化语境和象征意义。"
    }
  ]
}