{
  "word": "freedoms",
  "pronunciation": "free·duhmz",
  "concise_definition": "n. 自由, 自主权, 自由权利（复数形式）",
  "forms": {
    "singular": "freedom"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The state of being free from arbitrary or oppressive control, especially the right to act, speak, or think as one wishes without undue restriction.",
      "explanation_cn": "指不受任意或压迫性控制的状态，尤指在不受到不正当限制的情况下行动、言论或思考的权利。",
      "example_en": "The constitution guarantees fundamental freedoms such as speech, religion, and assembly.",
      "example_cn": "宪法保障了言论、宗教和集会等基本自由。"
    },
    {
      "pos": "noun",
      "explanation_en": "Plural form used to refer to multiple distinct rights or liberties enjoyed by individuals or groups within a society, often in political, social, or legal contexts.",
      "explanation_cn": "复数形式，用于指个人或群体在社会中享有的多种不同权利或自由，常用于政治、社会或法律语境中。",
      "example_en": "The protesters demanded greater freedoms: press freedom, academic freedom, and freedom from discrimination.",
      "example_cn": "抗议者要求更多的自由：新闻自由、学术自由和免受歧视的自由。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sense of personal autonomy or liberation from constraints, whether physical, emotional, or societal.",
      "explanation_cn": "指个人在身体、情感或社会层面摆脱束缚后所感受到的自主性或解放感。",
      "example_en": "After years of confinement, she felt a profound sense of freedoms—freedom to travel, to choose, to be herself.",
      "example_cn": "多年监禁之后，她感受到了深刻的自由感——旅行的自由、选择的自由、做自己的自由。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "liberty",
      "analysis": "“Liberty”（自由）与 “freedom” 非常接近，常可互换，但 “liberty” 更具法律和政治色彩，强调“免于专制或压迫的权利”，常用于正式或宪法性语境（如 “civil liberties”）。而 “freedom” 更通用，涵盖个人、情感和日常层面的自由。"
    },
    {
      "word_to_compare": "rights",
      "analysis": "“Rights”（权利）指法律或道德上被承认的正当主张或资格，如选举权、受教育权。它们是自由的法律基础，但本身不等同于自由。例如，你有“言论权”，但“言论自由”是你行使该权利的实际状态。"
    },
    {
      "word_to_compare": "autonomy",
      "analysis": "“Autonomy”（自主权）强调个体或群体自我管理、自我决定的能力，尤其在政治、医疗或伦理语境中（如“医疗自主权”）。它更侧重于“控制权”而非“无限制状态”，是自由的一种高级形式，但范围更窄。"
    }
  ]
}