{
  "word": "freeze",
  "pronunciation": "freez",
  "concise_definition": "v. 冻结, 冷冻, 凝固; n. 冻结, 冷冻",
  "forms": {
    "third_person_singular": "freezes",
    "past_tense": "froze",
    "past_participle": "frozen",
    "present_participle": "freezing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To change from a liquid to a solid state by lowering the temperature below the freezing point, typically of water.",
      "explanation_cn": "通过将温度降低到冰点以下，使液体转变为固态，通常指水结冰。",
      "example_en": "The lake froze over during the harsh winter.",
      "example_cn": "在严冬期间，湖面结了冰。"
    },
    {
      "pos": "verb",
      "explanation_en": "To stop moving or become motionless, often due to fear, surprise, or shock.",
      "explanation_cn": "因恐惧、惊讶或震惊而停止移动或变得僵住不动。",
      "example_en": "When the bear appeared, everyone froze in place.",
      "example_cn": "当熊出现时，所有人都吓得动弹不得。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a process, activity, or change to be temporarily halted or suspended, often by official action.",
      "explanation_cn": "通过官方行动使某个过程、活动或变化暂时停止或中止。",
      "example_en": "The government froze bank accounts to prevent money laundering.",
      "example_cn": "政府冻结了银行账户以防止洗钱。"
    },
    {
      "pos": "verb",
      "explanation_en": "To preserve food by storing it at very low temperatures to prevent spoilage.",
      "explanation_cn": "通过在极低温度下储存食物以防止腐败。",
      "example_en": "She freezes fresh berries every summer to enjoy them in winter.",
      "example_cn": "她每年夏天都会把新鲜浆果冷冻起来，以便冬天食用。"
    },
    {
      "pos": "noun",
      "explanation_en": "A period of time during which temperatures are so low that water freezes, or a state of being frozen.",
      "explanation_cn": "一段温度低到足以使水结冰的时间，或处于冻结状态的情况。",
      "example_en": "The region experienced a severe freeze last night.",
      "example_cn": "昨晚该地区经历了严重的霜冻。"
    },
    {
      "pos": "noun",
      "explanation_en": "A temporary suspension or halt in activity, especially in economic or political contexts (e.g., wage freeze, rent freeze).",
      "explanation_cn": "在经济或政治语境中对某项活动的暂时中止，例如工资冻结、租金冻结。",
      "example_en": "The city imposed a rent freeze to protect low-income tenants.",
      "example_cn": "该市实施了租金冻结以保护低收入租户。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "chill",
      "analysis": "“Chill”（使变冷）指温度降低，但不一定达到结冰点，强调的是凉爽或轻微降温，常用于食物或环境。而 “freeze” 明确指温度降至冰点以下，导致液体凝固，语义更强、更极端。"
    },
    {
      "word_to_compare": "solidify",
      "analysis": "“Solidify”（固化）泛指任何物质从液态或半液态变为固态的过程，不限于低温，也可通过化学反应或冷却实现。而 “freeze” 特指因低温导致的凝固，尤其与水或冰相关，具有明确的物理条件限制。"
    },
    {
      "word_to_compare": "halt",
      "analysis": "“Halt”（停止）是一个通用词，指任何活动或进程的中断，不涉及物理状态变化。而 “freeze” 在表示停止时，常带有突然性、被动性或强制性，常用于经济、政治或情绪语境，隐含‘暂时性’和‘不可动’的意象。"
    }
  ]
}