{
  "word": "fresh",
  "pronunciation": "frehsh",
  "concise_definition": "adj. 新鲜的, 清新的, 新近的, 无经验的",
  "forms": {
    "comparative": "fresher",
    "superlative": "freshest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Not spoiled, stale, or processed; recently produced or harvested, especially in reference to food or air.",
      "explanation_cn": "未变质、不陈旧或未加工的；尤指食物或空气为最近生产或采摘的，具有自然的纯净状态。",
      "example_en": "She bought fresh vegetables from the local farmers' market.",
      "example_cn": "她从当地农贸市场买了新鲜蔬菜。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Having a pleasant, clean, and invigorating quality, often used to describe air, water, or a sense of renewal.",
      "explanation_cn": "具有令人愉悦、洁净和振奋的特质，常用于形容空气、水或一种焕然一新的感觉。",
      "example_en": "After the rain, the fresh breeze made the whole park feel alive.",
      "example_cn": "雨后，清新的微风让整个公园都充满了生机。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Newly created, occurred, or introduced; not old or previously known.",
      "explanation_cn": "新近创造、发生或引入的；非陈旧或此前未知的。",
      "example_en": "He offered a fresh perspective on the ancient problem.",
      "example_cn": "他对这个古老问题提出了全新的见解。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Lacking experience or sophistication; sometimes implying boldness or impertinence.",
      "explanation_cn": "缺乏经验或世故；有时暗示大胆或无礼。",
      "example_en": "The new intern made a fresh remark that surprised everyone in the meeting.",
      "example_cn": "这位新实习生说了句大胆的话，让会议室里的所有人都感到惊讶。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "new",
      "analysis": "“New” (新的) 强调时间上的最近或首次出现，侧重于“未曾存在过”或“刚出现”。而 “fresh” 不仅指时间新，还隐含品质上的纯净、未受污染或充满活力，常用于感官体验（如气味、味道、空气）或态度（如想法、视角）。"
    },
    {
      "word_to_compare": "recent",
      "analysis": "“Recent” (最近的) 仅指时间上接近现在，是中性的时间描述，不带情感或品质色彩。而 “fresh” 除了时间意义外，常带有积极的情感评价，如“新鲜感”“清新感”，适用于描述记忆、印象或体验的生动性。"
    },
    {
      "word_to_compare": "crisp",
      "analysis": "“Crisp” (清脆的/爽脆的) 通常用于描述质地，如苹果、树叶或天气，强调坚硬、清脆、干脆的物理特性。而 “fresh” 更广泛，涵盖气味、味道、状态和态度，其“清新”含义更抽象和综合。"
    }
  ]
}