{
  "word": "fret",
  "pronunciation": "fret",
  "concise_definition": "v. 烦恼, 焦虑; n. 烦恼, 焦虑; (吉他等乐器上的) 品丝",
  "forms": {
    "third_person_singular": "frets",
    "past_tense": "fretted",
    "past_participle": "fretted",
    "present_participle": "fretting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To worry or be anxious about something, often in a persistent or obsessive way, causing emotional distress.",
      "explanation_cn": "指对某事持续或过度地担忧、焦虑，导致情绪上的困扰。",
      "example_en": "She fretted over her son's grades, even though he was doing fine.",
      "example_cn": "尽管儿子成绩不错，她还是为他的分数忧心忡忡。"
    },
    {
      "pos": "verb",
      "explanation_en": "To wear away or erode something through constant rubbing or friction, often used literally for physical surfaces.",
      "explanation_cn": "指因持续摩擦而磨损或侵蚀某物表面，常用于描述物理对象的损耗。",
      "example_en": "The constant wind and sand have fretted the rock face over centuries.",
      "example_cn": "几个世纪以来，持续的风沙已侵蚀了岩壁表面。"
    },
    {
      "pos": "noun",
      "explanation_en": "A state of persistent worry, anxiety, or agitation; often used in the phrase 'in a fret'.",
      "explanation_cn": "指一种持续的担忧、焦虑或烦躁状态，常用于短语 'in a fret'（处于焦虑中）。",
      "example_en": "He spent the whole evening in a fret, pacing the room and checking his phone.",
      "example_cn": "他整个晚上都坐立不安，在房间里来回踱步，不断查看手机。"
    },
    {
      "pos": "noun",
      "explanation_en": "A thin metal strip on the neck of a stringed instrument (like a guitar or violin) that divides the neck into fixed segments to produce specific pitches when the string is pressed against it.",
      "explanation_cn": "指弦乐器（如吉他或小提琴）琴颈上用于划分音高的细金属条，当琴弦按压在上面时可发出特定音高。",
      "example_en": "The guitarist adjusted his fingers to play cleanly between the frets.",
      "example_cn": "这位吉他手调整了手指位置，以便在品丝之间清晰地演奏。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "worry",
      "analysis": "“Worry” (担心) 是更通用的词，泛指对可能发生的负面结果感到不安，语气较轻、更日常。“Fret” 则带有更强烈的情绪色彩，常暗示反复、无休止的焦虑，甚至伴随身体动作（如踱步、搓手），语义更浓重。"
    },
    {
      "word_to_compare": "anxiety",
      "analysis": "“Anxiety” (焦虑) 是心理学上的正式术语，指一种持续的、病理性的紧张状态，常用于临床语境。“Fret” 更口语化，多用于描述日常生活中因琐事引发的短期焦虑，不具医学含义。"
    },
    {
      "word_to_compare": "gnaw",
      "analysis": "“Gnaw” (啃咬/折磨) 常用于比喻，指烦恼像老鼠啃咬一样持续侵蚀内心，与 “fret” 在情绪层面有重叠，但 “gnaw” 更强调痛苦的持久性和侵入性，常用于文学性表达，而 “fret” 更侧重外显的烦躁行为。"
    }
  ]
}