{
  "word": "fronted",
  "pronunciation": "frun·təd",
  "concise_definition": "v. 以…为前导, 主持, 出面担任",
  "forms": {
    "base_form": "front",
    "third_person_singular": "fronts",
    "past_tense": "fronted",
    "past_participle": "fronted",
    "present_participle": "fronting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To stand or act at the front of a group, organization, or activity, often as a public face or representative, sometimes to conceal the true leaders or sources of influence.",
      "explanation_cn": "指站在一个团体、组织或活动的最前面，作为公众代表或代言人，有时是为了掩盖真正的领导者或幕后操控者。",
      "example_en": "The criminal organization was fronted by a respected businessman who had no real involvement in its operations.",
      "example_cn": "这个犯罪组织由一位受人尊敬的商人出面代表，而他实际上并未参与其运营。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pay for or provide the initial cost or resources for something, often on behalf of others.",
      "explanation_cn": "指为某事垫付初始费用或提供资源，通常是代他人承担。",
      "example_en": "She fronted the money for the band’s first album, hoping they’d pay her back after they got famous.",
      "example_cn": "她垫付了乐队首张专辑的费用，希望他们成名后能还钱给她。"
    },
    {
      "pos": "verb",
      "explanation_en": "To lead or direct a performance, especially in music, by being the most visible or prominent member.",
      "explanation_cn": "指在表演中担任领头角色，尤其是在音乐领域，作为最显眼或最突出的成员。",
      "example_en": "The lead singer fronted the rock band with charismatic energy and powerful vocals.",
      "example_cn": "主唱以富有魅力的能量和强劲的嗓音带领着这支摇滚乐队。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "represent",
      "analysis": "“Represent” (代表) 强调正式地作为某人或某团体的代言人，通常具有法律或官方授权，语义中性或正面。而 “fronted” 常带有隐晦、伪装或非正式的色彩，尤其在涉及掩盖真相时。"
    },
    {
      "word_to_compare": "sponsor",
      "analysis": "“Sponsor” (赞助) 指提供资金或资源支持，通常不参与日常运作，也不一定出现在公众面前。而 “fronted” 不仅提供支持，还主动站在台前，承担公众形象或垫付成本，角色更直接、更显性。"
    },
    {
      "word_to_compare": "lead",
      "analysis": "“Lead” (领导) 指实际掌控方向、决策和管理，是真正的核心。而 “fronted” 可能只是表面上的领导者，真正的权力在幕后。因此，前者强调实质控制，后者强调表象呈现。"
    }
  ]
}