{
  "word": "fronts",
  "pronunciation": "fruhnts",
  "concise_definition": "n. 前线, 正面, 伪装, 前厅",
  "forms": {
    "singular": "front"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The forward or outer surface of something, especially the part that faces forward or is most visible; often used in military, architectural, or geographical contexts.",
      "explanation_cn": "指某物的前部或外表面，尤其是朝前或最显眼的部分；常用于军事、建筑或地理语境中。",
      "example_en": "The soldiers held their position on the front line during the battle.",
      "example_cn": "士兵们在战斗中坚守前线阵地。"
    },
    {
      "pos": "noun",
      "explanation_en": "A deceptive appearance or pretense adopted to conceal true intentions, feelings, or activities; often used to describe false facades in politics, business, or personal behavior.",
      "explanation_cn": "指为掩盖真实意图、情感或活动而采取的虚假外表或伪装；常用于描述政治、商业或个人行为中的假象。",
      "example_en": "The charity was just a front for money laundering operations.",
      "example_cn": "这家慈善机构只是洗钱活动的幌子。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of people or organizations that appear to act together for a common cause, often masking underlying differences or hidden agendas.",
      "explanation_cn": "指表面上为共同目标而联合的一群人或组织，通常掩盖了其内部的分歧或隐藏的动机。",
      "example_en": "The coalition presented a united front against the new policy, though members disagreed privately.",
      "example_cn": "该联盟对外对新政策表现出一致立场，尽管成员私下意见不一。"
    },
    {
      "pos": "noun",
      "explanation_en": "The entrance area or lobby of a building, especially a theater, hotel, or public facility.",
      "explanation_cn": "指建筑物的入口区域或门厅，尤指剧院、酒店或公共设施的前厅。",
      "example_en": "The hotel's front was elegantly decorated for the gala evening.",
      "example_cn": "酒店的前厅为晚宴精心装饰过。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "face",
      "analysis": "“Face”（表面）通常指物体最外层的可见部分，强调物理接触面，如“脸”或“墙面”，语义较中性。而 “front” 更强调功能性或象征性的“正面”，常带有目的性，如军事前线、政治伪装或公众形象，语义更丰富且常含策略性含义。"
    },
    {
      "word_to_compare": "appearance",
      "analysis": "“Appearance”（外表）泛指某物或某人呈现出来的样子，可以是真实的也可以是虚假的，但不特指有组织的伪装。而 “front” 更强调一种有意识、有组织的假象，常用于揭露虚伪或操纵行为，具有更强的负面或批判色彩。"
    },
    {
      "word_to_compare": "facade",
      "analysis": "“Facade”（立面/假象）与 “front” 在伪装义上高度相似，但 “facade” 更常用于建筑学中指建筑物的正面，引申义上更强调视觉上的虚假装饰，常带有美学或结构上的隐喻；而 “front” 更广泛用于社会、政治和组织语境，强调行为或立场的伪装，语义更动态、更具行动性。"
    }
  ]
}