{
  "word": "front",
  "pronunciation": "frunt",
  "concise_definition": "n. 前面, 前线, 面部; v. 面对, 朝向, 伪装",
  "forms": {
    "plural": "fronts",
    "third_person_singular": "fronts",
    "past_tense": "fronted",
    "past_participle": "fronted",
    "present_participle": "fronting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The forward or most prominent part of something, especially the part that is seen or presented to others; can refer to physical surfaces or abstract representations.",
      "explanation_cn": "指某物的前部或最突出的部分，尤其是被他人看到或呈现出来的部分；可指物理表面或抽象的表象。",
      "example_en": "The front of the building has large glass windows.",
      "example_cn": "这座建筑的正面有巨大的玻璃窗。"
    },
    {
      "pos": "noun",
      "explanation_en": "The line or area where opposing forces meet in a war or conflict; often used metaphorically to describe areas of active struggle or competition.",
      "explanation_cn": "指战争或冲突中对立双方交锋的战线或区域；常用于比喻性地描述活跃的斗争或竞争领域。",
      "example_en": "Soldiers on the front lines faced harsh conditions during the winter.",
      "example_cn": "前线的士兵在冬季面临着恶劣的条件。"
    },
    {
      "pos": "noun",
      "explanation_en": "A deceptive appearance or pretense adopted to conceal true intentions or identity, often used in political or social contexts.",
      "explanation_cn": "指为掩盖真实意图或身份而采取的虚假表象，常用于政治或社会语境中。",
      "example_en": "The organization was a front for illegal activities.",
      "example_cn": "这个组织是非法活动的幌子。"
    },
    {
      "pos": "noun",
      "explanation_en": "The face or facial expression of a person, especially as it reveals emotion or character.",
      "explanation_cn": "指人的面部或面部表情，尤其是反映情绪或性格的部分。",
      "example_en": "She put on a brave front despite her fear.",
      "example_cn": "尽管内心恐惧，她仍强装镇定。"
    },
    {
      "pos": "verb",
      "explanation_en": "To face or be positioned toward something, especially in a physical or directional sense.",
      "explanation_cn": "指朝向或面向某物，尤其在物理或方向意义上。",
      "example_en": "The house fronts onto a quiet street.",
      "example_cn": "这所房子面向一条安静的街道。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pretend to be or act as something one is not, especially to deceive others.",
      "explanation_cn": "指假装成自己并非真实的身份或角色，以欺骗他人。",
      "example_en": "He fronted as a lawyer while working as a con artist.",
      "example_cn": "他冒充律师，实则是一名骗子。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "face",
      "analysis": "“Face” (面部/表面) 更侧重于人或物体的正面外观，尤其强调视觉上的呈现，常用于描述表情或物理表面。而 “front” 不仅指物理前部，还可指策略性伪装或战线，语义范围更广，更具抽象和象征意义。"
    },
    {
      "word_to_compare": "side",
      "analysis": "“Side” (侧面) 指物体的任意一侧，是中性方位词，不强调正向或主导性。而 “front” 特指最显眼、最面向公众或敌人的那一面，具有方向性、优先性和功能性，常隐含主动展示或对抗的意味。"
    },
    {
      "word_to_compare": "surface",
      "analysis": "“Surface” (表面) 强调物体最外层的物理层，常用于科学或技术语境，强调可触摸的外层。而 “front” 更强调功能性和象征性，如政治前线、伪装姿态，不一定与物理接触相关，更偏向于社会或战略层面的‘表象’。"
    }
  ]
}