{
  "word": "frost",
  "pronunciation": "frawst",
  "concise_definition": "n. 霜, 霜冻; v. 结霜, 冰冻, 覆以糖霜",
  "forms": {
    "third_person_singular": "frosts",
    "past_tense": "frosted",
    "past_participle": "frosted",
    "present_participle": "frosting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A thin layer of ice crystals that forms on surfaces when the temperature drops below freezing, typically during clear, calm nights.",
      "explanation_cn": "当温度降至冰点以下时，在物体表面形成的薄层冰晶，通常出现在晴朗无风的夜晚。",
      "example_en": "The grass was covered in a delicate frost this morning.",
      "example_cn": "今天早上，草地上覆盖着一层薄薄的霜。"
    },
    {
      "pos": "noun",
      "explanation_en": "A cold period during which temperatures fall low enough to damage or kill plants, especially in spring or autumn.",
      "explanation_cn": "指气温低到足以损害或杀死植物的寒冷时期，尤其在春季或秋季。",
      "example_en": "The late frost destroyed the young apple blossoms.",
      "example_cn": "晚霜毁掉了幼嫩的苹果花。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form a layer of ice crystals on a surface due to cold temperatures.",
      "explanation_cn": "因低温而在表面形成一层冰晶。",
      "example_en": "The windows frosted over during the winter night.",
      "example_cn": "冬夜时，窗户上结了一层霜。"
    },
    {
      "pos": "verb",
      "explanation_en": "To coat or decorate something, especially food, with a thin layer of sugar or icing.",
      "explanation_cn": "在某物（尤指食物）表面覆盖一层糖霜或糖衣进行装饰。",
      "example_en": "She frosted the cake with vanilla buttercream.",
      "example_cn": "她用香草黄油糖霜装饰了蛋糕。"
    },
    {
      "pos": "verb",
      "explanation_en": "To apply a frosted or translucent finish to glass or other surfaces to reduce transparency.",
      "explanation_cn": "在玻璃或其他表面上施加磨砂或半透明效果，以降低透明度。",
      "example_en": "The bathroom windows were frosted for privacy.",
      "example_cn": "浴室的窗户做了磨砂处理以保护隐私。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ice",
      "analysis": "“Ice” (冰) 是指水完全冻结形成的固态物质，通常较厚、较坚硬，可存在于水面、冰川或冰块中。而 “frost” 是水蒸气在低温下直接凝华形成的微小冰晶，通常薄而脆弱，仅附着于物体表面。"
    },
    {
      "word_to_compare": "freeze",
      "analysis": "“Freeze” (冻结) 是一个动词，指液体转变为固体的过程，强调状态变化，可应用于水、血液、经济等广泛语境。而 “frost” 作为动词时，特指表面形成霜晶，作为名词时仅指霜层，语义范围更窄、更具体。"
    },
    {
      "word_to_compare": "glaze",
      "analysis": "“Glaze” (上釉/涂釉) 通常指在陶瓷、食物或玻璃表面涂覆一层光滑、有光泽的涂层，如糖釉或陶瓷釉。而 “frost” 作为动词用于食物时，指的是一种较粗糙、不透明的糖霜覆盖，质地更蓬松，光泽度较低。"
    }
  ]
}