{
  "word": "fry",
  "pronunciation": "frai",
  "concise_definition": "v. 油炸, 煎; n. 油炸食物, 煎物",
  "forms": {
    "third_person_singular": "fries",
    "past_tense": "fried",
    "past_participle": "fried",
    "present_participle": "frying"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To cook food in hot fat or oil, typically in a pan over direct heat, causing the surface to brown and become crispy while the interior remains moist.",
      "explanation_cn": "指在热油或脂肪中烹煮食物，通常在明火上的平底锅中进行，使食物表面变褐酥脆，而内部保持多汁。",
      "example_en": "She fried the fish in olive oil until it was golden brown.",
      "example_cn": "她用橄榄油把鱼煎至金黄色。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be exposed to excessive heat, causing damage, discomfort, or destruction; often used figuratively to describe extreme stress or pressure.",
      "explanation_cn": "指暴露在过热环境中，导致损坏、不适或毁灭；常用于比喻形容承受巨大压力或困境。",
      "example_en": "The soldiers were fried under the scorching desert sun.",
      "example_cn": "士兵们在灼热的沙漠阳光下被晒得苦不堪言。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause an electronic device to malfunction or burn out due to overheating or electrical overload.",
      "explanation_cn": "指因过热或电流过载而导致电子设备损坏或烧毁。",
      "example_en": "He fried the motherboard by plugging in the wrong power adapter.",
      "example_cn": "他插错了电源适配器，把主板烧坏了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A dish of food that has been fried, especially fish or potatoes; commonly used in compound terms like 'fish and chips'.",
      "explanation_cn": "指经过油炸的食物，尤指炸鱼或炸薯条；常用于复合词如 'fish and chips'（炸鱼配薯条）。",
      "example_en": "We ordered fries and chicken tenders for dinner.",
      "example_cn": "我们晚餐点了炸薯条和鸡块。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "saute",
      "analysis": "“Saute” (炒) 指用少量油在高温下快速翻炒食物，强调轻快、短时的烹饪方式，通常保留食材的脆嫩口感。而 “fry” 更广泛，可指深炸或大量用油的煎炸，时间更长，油脂渗透更多，口感更酥脆。"
    },
    {
      "word_to_compare": "grill",
      "analysis": "“Grill” (烧烤/烤) 是通过直接热源（如炭火或电热元件）从上方或下方加热食物，形成焦痕和烟熏风味，不依赖油脂。而 “fry” 必须使用油或脂肪作为传热介质，口感更油腻、更酥脆。"
    },
    {
      "word_to_compare": "roast",
      "analysis": "“Roast” (烘烤) 通常在烤箱中用干热缓慢烹制大块肉类或蔬菜，使外皮焦香、内部多汁，强调均匀受热和风味渗透。而 “fry” 是快速、局部加热，依赖油脂，适用于小块食材，且不涉及长时间慢烤过程。"
    }
  ]
}