{
  "word": "frying",
  "pronunciation": "fry·ing",
  "concise_definition": "n. 煎, 炸; v. 煎, 炸（fry 的现在分词和动名词形式）",
  "forms": {
    "base_form": "fry",
    "third_person_singular": "fries",
    "past_tense": "fried",
    "past_participle": "fried",
    "present_participle": "frying"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process or method of cooking food in hot fat or oil, typically in a pan over direct heat, resulting in a browned, crispy exterior.",
      "explanation_cn": "指在热油或脂肪中烹煮食物的过程或方法，通常在明火上的平底锅中进行，使食物外层呈现金黄酥脆的状态。",
      "example_en": "The smell of frying bacon filled the kitchen.",
      "example_cn": "煎培根的香味充满了整个厨房。"
    },
    {
      "pos": "noun",
      "explanation_en": "A dish or meal prepared by frying, often used informally to refer to a type of food or a cooking style.",
      "explanation_cn": "指通过煎炸方式制作的食物，常用于非正式语境中表示某种特定的油炸食品或烹饪风格。",
      "example_en": "We had a traditional English breakfast with fried eggs, fried tomatoes, and fried bread.",
      "example_cn": "我们吃了一顿传统的英式早餐，配有煎蛋、煎番茄和煎面包。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cook food in hot oil or fat, often until it becomes browned or crispy, either partially or fully.",
      "explanation_cn": "指在热油或脂肪中烹煮食物，通常直至其表面呈现金黄或酥脆状态，可以是部分或完全烹熟。",
      "example_en": "She was frying onions while waiting for the pasta to boil.",
      "example_cn": "她在等意大利面煮沸的同时，正在煎洋葱。"
    },
    {
      "pos": "verb",
      "explanation_en": "To overheat or malfunction due to excessive heat or electrical overload, often used figuratively to describe a person under extreme stress.",
      "explanation_cn": "指因过热或电力过载而损坏，也可比喻人因极度压力而精神崩溃或情绪失控。",
      "example_en": "The circuit fried when I plugged in too many devices.",
      "example_cn": "当我插上太多设备时，电路烧坏了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sauteing",
      "analysis": "“Sauteing”（炒）使用少量油，高温快速翻炒，强调保留食材的脆嫩和原味，通常用于蔬菜或薄片肉类；而 “frying” 可以使用更多油，时间更长，更注重外层酥脆，常用于较厚或需要完全熟透的食物，如炸鸡或煎鱼。"
    },
    {
      "word_to_compare": "deep-frying",
      "analysis": "“Deep-frying”（油炸）是“frying”的一种子类型，指将食物完全浸入大量热油中烹制，如炸薯条或炸鸡块；而一般 “frying” 多指在浅油中煎制（shallow frying），食物仅部分接触油面。两者虽都属油烹，但油量和烹饪方式不同。"
    },
    {
      "word_to_compare": "grilling",
      "analysis": "“Grilling”（烧烤）是通过直接热源（如炭火或电热元件）加热食物，形成焦痕和烟熏风味，不依赖油脂；而 “frying” 必须使用油脂作为传热介质，口感更油腻，色泽更金黄。两者在风味、健康性和烹饪机制上有本质区别。"
    }
  ]
}