{
  "word": "fuel",
  "pronunciation": "fyo͞ol",
  "concise_definition": "n. 燃料, 动力; v. 为...提供燃料, 激发",
  "forms": {
    "third_person_singular": "fuels",
    "past_tense": "fueled",
    "past_participle": "fueled",
    "present_participle": "fueling",
    "plural": "fuels"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A substance such as coal, oil, or gas that is burned to produce heat or power, especially in engines or heating systems.",
      "explanation_cn": "指用于燃烧以产生热能或动力的物质，如煤、石油或天然气，常用于发动机或供暖系统。",
      "example_en": "The plane ran out of fuel halfway through the journey.",
      "example_cn": "飞机在旅程中途耗尽了燃料。"
    },
    {
      "pos": "noun",
      "explanation_en": "Something that provides energy, motivation, or momentum to a process, system, or emotion, often metaphorically.",
      "explanation_cn": "比喻性地指为某个过程、系统或情绪提供能量、动力或推动力的事物。",
      "example_en": "Negative media coverage only fueled public anger.",
      "example_cn": "负面的媒体报道进一步激化了公众的愤怒。"
    },
    {
      "pos": "verb",
      "explanation_en": "To supply a machine, vehicle, or system with fuel in order to make it operate.",
      "explanation_cn": "指为机器、车辆或系统提供燃料以使其运行。",
      "example_en": "We fueled the car before setting off on the road trip.",
      "example_cn": "我们在开始公路旅行前给汽车加满了油。"
    },
    {
      "pos": "verb",
      "explanation_en": "To stimulate or intensify a feeling, process, or situation, often by providing the necessary energy or incentive.",
      "explanation_cn": "指通过提供必要的能量或刺激来增强或加剧某种情绪、过程或状况。",
      "example_en": "His harsh words fueled her determination to succeed.",
      "example_cn": "他刻薄的话语反而激发了她成功的决心。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "energy",
      "analysis": "“Energy” (能量) 是一个更广泛、更抽象的术语，泛指做功的能力，包括物理、生物或心理层面的能量。而 “fuel” 更具体，通常指可消耗的物质性资源，是能量的来源之一。例如，食物是人体的能量来源，但只有当它被代谢时才成为“fuel”。"
    },
    {
      "word_to_compare": "power",
      "analysis": "“Power” (动力/电力) 指执行工作的能力或输出的强度，可以是电能、机械能或影响力。它强调的是结果或效果，而 “fuel” 是实现这种效果的输入材料。例如，电力驱动机器，但电力本身不是燃料——煤或天然气才是燃料。"
    },
    {
      "word_to_compare": "catalyst",
      "analysis": "“Catalyst” (催化剂) 在化学中指加速反应但自身不被消耗的物质；比喻义中指引发变化但不提供持续能量的触发因素。而 “fuel” 是持续提供能量的物质，是变化得以维持的必要条件。例如，一场演讲可能是社会变革的催化剂，但公众的热情才是推动变革的燃料。"
    }
  ]
}