{
  "word": "fuller",
  "pronunciation": "fuhl·er",
  "concise_definition": "n. 全面的人, 使更丰满者; adj. 更丰满的, 更充实的",
  "forms": {
    "comparative": "fuller",
    "superlative": "fullest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "More full or complete in content, quantity, or extent; describing something that has a greater degree of fullness, richness, or depth.",
      "explanation_cn": "在内容、数量或程度上更饱满、更完整；描述某物具有更高的充实度、丰富性或深度。",
      "example_en": "Her voice sounded fuller and more resonant after the vocal training.",
      "example_cn": "经过声乐训练后，她的声音听起来更加饱满和洪亮。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that makes something fuller, especially in historical contexts: a worker who cleans and thickens cloth by beating and soaking it (also called a fuller's earth user).",
      "explanation_cn": "使某物变得更丰满的人或物，尤指历史上通过捶打和浸泡来清洁和加厚毛料的工人（也称使用‘漂白土’的人）。",
      "example_en": "In medieval England, fullers played a key role in preparing woolen cloth for sale.",
      "example_cn": "在中世纪的英格兰，漂布工在准备待售毛料方面起着关键作用。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used in comparative contexts to describe a more comprehensive, detailed, or satisfying version of something previously partial or inadequate.",
      "explanation_cn": "用于比较语境中，描述比先前不完整或不足的版本更全面、更详尽或更令人满意的事物。",
      "example_en": "This revised edition offers a fuller account of the historical events.",
      "example_cn": "这个修订版对历史事件提供了更详尽的叙述。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "complete",
      "analysis": "“Complete” (完整的) 强调没有缺失部分，达到最终或全部状态，是绝对概念；而 “fuller” 是相对比较级，表示比之前更充实，但未必达到完全状态。例如：一份报告可以是 fuller（更详尽）但还不是 complete（完整）。"
    },
    {
      "word_to_compare": "rich",
      "analysis": "“Rich” (丰富的) 侧重于内容的多样性、浓度或价值，常用于描述风味、资源或文化；而 “fuller” 更强调量或程度上的增加，如声音、体积、信息量的增强。一个汤可以是 rich（浓郁）但不一定 fuller（更满）。"
    },
    {
      "word_to_compare": "thicker",
      "analysis": "“Thicker” (更厚的) 主要用于物理维度，如液体、材料或声音的密度；而 “fuller” 可用于抽象概念（如解释、声音、生活），不仅指物理厚度，更强调充实感和完整性。声音可以 fuller（更饱满）而不一定 thicker（更厚重）。"
    }
  ]
}