{
  "word": "funk",
  "pronunciation": "fuhngk",
  "concise_definition": "n. 酸臭味, 放克音乐; v. 感到恐惧, 陷入沮丧",
  "forms": {
    "third_person_singular": "funks",
    "past_tense": "funked",
    "past_participle": "funked",
    "present_participle": "funking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A strong, unpleasant odor, especially one that is musty, stale, or sweaty; often associated with dampness or neglect.",
      "explanation_cn": "一种强烈而不愉快的气味，尤其指霉味、陈腐味或汗味，常与潮湿或疏于清洁相关。",
      "example_en": "The old basement had a persistent funk that no amount of cleaning could eliminate.",
      "example_cn": "那个老旧的地下室有一股持久的霉味，无论怎么打扫都消除不了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A genre of music that emerged in the mid-1960s, characterized by a strong rhythmic groove, syncopated bass lines, and emphasis on the first beat of the measure; influential in the development of disco, hip-hop, and modern R&B.",
      "explanation_cn": "一种20世纪60年代中期兴起的音乐流派，以强烈的节奏律动、切分低音线条和重拍强调为特征，对迪斯科、嘻哈和现代节奏布鲁斯的发展有深远影响。",
      "example_en": "James Brown is widely regarded as the godfather of funk music.",
      "example_cn": "詹姆斯·布朗被广泛誉为放克音乐之父。"
    },
    {
      "pos": "verb",
      "explanation_en": "To feel nervous, anxious, or intimidated, especially in a situation requiring courage or action; often used in the phrase 'to funk out'.",
      "explanation_cn": "感到紧张、焦虑或畏惧，尤其在需要勇气或采取行动的情境中；常用于短语 'to funk out'（退缩、怯场）。",
      "example_en": "He funkled at the thought of speaking in front of the whole class.",
      "example_cn": "一想到要在全班面前讲话，他就怯场了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To become depressed, discouraged, or mentally stuck; to lose motivation or momentum.",
      "explanation_cn": "陷入沮丧、消沉或思维停滞状态；失去动力或进展势头。",
      "example_en": "After the rejection, she just funkled for weeks, unable to start a new project.",
      "example_cn": "遭到拒绝后，她沮丧了几个星期，无法开始新项目。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "odor",
      "analysis": "“Odor”（气味）是中性词，泛指任何可嗅到的气味，无论好坏；而 “funk” 特指令人不快的、陈腐或汗臭的气味，带有强烈负面情感色彩，语义更具体、更口语化。"
    },
    {
      "word_to_compare": "disco",
      "analysis": "“Disco”（迪斯科）是一种以四拍子节奏、合成器和舞曲结构为主的流行音乐风格，强调舞池氛围；而 “funk” 更注重复杂的节奏层次、低音线条和即兴演奏，更具黑人音乐根源性，节奏更原始、更强调‘groove’（律动感）。"
    },
    {
      "word_to_compare": "panic",
      "analysis": "“Panic”（恐慌）指突然、强烈的恐惧反应，常伴随身体失控；而 “funk” 作为动词时，指的是一种更缓慢、持续的心理退缩或情绪低落，不一定是突发的，更接近‘怯场’或‘动力丧失’，情绪强度较弱但更持久。"
    }
  ]
}