{
  "word": "funnel",
  "pronunciation": "fuh·nel",
  "concise_definition": "n. 漏斗, 引导通道; v. 通过漏斗输送, 集中引导",
  "forms": {
    "plural": "funnels",
    "third_person_singular": "funnels",
    "past_tense": "funneled",
    "past_participle": "funneled",
    "present_participle": "funneling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A cone-shaped or tubular device, typically with a wide top and narrow bottom, used to channel liquids or granular materials into a container with a small opening.",
      "explanation_cn": "一种上宽下窄的锥形或管状器具，用于将液体或颗粒状物质导入小口容器中。",
      "example_en": "She used a funnel to pour oil into the car's engine without spilling.",
      "example_cn": "她用漏斗将油倒入汽车发动机中，避免了洒漏。"
    },
    {
      "pos": "noun",
      "explanation_en": "A process or system that gradually narrows down a large number of options, applicants, or participants into a smaller, more selective group, often used in marketing, sales, or recruitment.",
      "explanation_cn": "一种逐步将大量选项、申请者或参与者筛选为更小、更精选群体的过程或系统，常用于营销、销售或招聘领域。",
      "example_en": "The company's sales funnel starts with 10,000 website visitors and ends with 200 paying customers.",
      "example_cn": "该公司的销售漏斗从一万名网站访客开始，最终转化为两百名付费客户。"
    },
    {
      "pos": "verb",
      "explanation_en": "To direct or channel something, such as resources, people, or information, through a narrow path or process toward a specific goal or destination.",
      "explanation_cn": "将资源、人员或信息等通过狭窄的路径或流程集中引导至特定目标或目的地。",
      "example_en": "The government funneled emergency funds into the hardest-hit regions.",
      "example_cn": "政府将紧急资金集中拨付给了受灾最严重的地区。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "conduit",
      "analysis": "“Conduit”（通道/管道）指一个中性的传输通道，强调物理或抽象的连接功能，不隐含筛选或缩减的过程。而 “funnel” 不仅引导，还隐含了从宽到窄的过滤、筛选或集中过程，具有更强的目的性和选择性。"
    },
    {
      "word_to_compare": "pipeline",
      "analysis": "“Pipeline”（管道/流程）常用于描述一个连续、系统化的流程，如数据流或产品开发流程，强调稳定性和连续性。而 “funnel” 更强调入口宽、出口窄的结构，突出数量的急剧减少，常用于转化率分析，更具阶段性与淘汰性。"
    },
    {
      "word_to_compare": "filter",
      "analysis": "“Filter”（过滤器）侧重于通过某种标准去除不需要的部分，强调筛选机制本身。而 “funnel” 是一个更宏观的结构，包含过滤，但更强调引导、集中和流向终点的过程，常用于描述整体流程而非单一筛选动作。"
    }
  ]
}