{
  "word": "fuss",
  "pronunciation": "fuhss",
  "concise_definition": "n. 烦扰, 小题大做, 纠纷; v. 烦扰, 小题大做, 焦虑",
  "forms": {
    "plural": "fusses",
    "third_person_singular": "fusses",
    "past_tense": "fussed",
    "past_participle": "fussed",
    "present_participle": "fussing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An excessive or unnecessary display of concern, agitation, or activity over something trivial or unimportant.",
      "explanation_cn": "指对琐碎或不重要的事情表现出过度的担忧、焦虑或忙乱，通常带有不必要的夸张成分。",
      "example_en": "There's no need to make such a fuss about a little spill on the floor.",
      "example_cn": "地板上洒了一点东西，根本没必要大惊小怪。"
    },
    {
      "pos": "noun",
      "explanation_en": "A state of confused or agitated activity, often involving many people or unnecessary preparations.",
      "explanation_cn": "指一种混乱或激动的状态，常涉及多人参与或不必要的准备活动。",
      "example_en": "The wedding was surrounded by a lot of fuss over seating arrangements and floral decorations.",
      "example_cn": "这场婚礼因为座位安排和花艺装饰而闹得沸沸扬扬。"
    },
    {
      "pos": "verb",
      "explanation_en": "To show excessive concern or make a lot of unnecessary effort about something minor.",
      "explanation_cn": "指对琐事表现出过度的关注或付出不必要的努力。",
      "example_en": "She fusses over her children's clothes, making sure every button is perfectly aligned.",
      "example_cn": "她总为孩子们的衣服操心，确保每一颗纽扣都整齐对齐。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move about in a nervous or agitated manner, often without purpose.",
      "explanation_cn": "指因焦虑或不安而无目的地来回走动或忙乱。",
      "example_en": "He was fussing around the kitchen, unable to sit still before the guests arrived.",
      "example_cn": "客人到来前，他在厨房里坐立不安地忙来忙去。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hassle",
      "analysis": "“Hassle”（麻烦）强调的是因外部障碍或繁琐程序带来的困扰，通常是客观存在的不便，如排队、填表等。而 “fuss” 更侧重于主观的过度反应或情绪化的焦虑，即使事情本身并不困难。"
    },
    {
      "word_to_compare": "commotion",
      "analysis": "“Commotion”（骚动）指由多人参与的、公开的、喧闹的混乱场面，常带有声音和动作的外在表现。而 “fuss” 可以是安静的、个人的焦虑，不一定有喧闹，但同样显得多余和夸张。"
    },
    {
      "word_to_compare": "bother",
      "analysis": "“Bother”（打扰）指因某事或某人而感到轻微的不便或烦恼，语气较轻，常用于日常表达如 ‘Don’t bother.’。而 “fuss” 暗示了更强烈、更不合理的反应，常带有批评意味，指反应过度。"
    }
  ]
}