{
  "word": "gain",
  "pronunciation": "gayn",
  "concise_definition": "v. 获得, 增加, 赢得; n. 收益, 增加",
  "forms": {
    "third_person_singular": "gains",
    "past_tense": "gained",
    "past_participle": "gained",
    "present_participle": "gaining"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To obtain or acquire something desirable, especially through effort, skill, or strategy, such as knowledge, advantage, or a benefit.",
      "explanation_cn": "指通过努力、技能或策略获得某种有益的事物，如知识、优势或利益。",
      "example_en": "She gained valuable experience working abroad for three years.",
      "example_cn": "她在国外工作三年，获得了宝贵的经验。"
    },
    {
      "pos": "verb",
      "explanation_en": "To increase in amount, weight, size, or degree, often referring to physical weight or abstract quantities like power or popularity.",
      "explanation_cn": "指数量、重量、规模或程度上的增加，常用于指体重增加或权力、声望等抽象事物的增长。",
      "example_en": "He gained ten pounds after the holidays.",
      "example_cn": "假期过后，他长了十磅体重。"
    },
    {
      "pos": "verb",
      "explanation_en": "To win or secure something through competition or conflict, such as a position, vote, or victory.",
      "explanation_cn": "指在竞争或冲突中赢得或取得某物，如职位、选票或胜利。",
      "example_en": "The candidate gained enough votes to win the election.",
      "example_cn": "这位候选人赢得了足够的选票以当选。"
    },
    {
      "pos": "noun",
      "explanation_en": "An increase or profit in amount, value, or advantage, often used in economic, physical, or performance contexts.",
      "explanation_cn": "指数量、价值或优势上的增加或收益，常用于经济、身体或表现语境中。",
      "example_en": "The company reported a significant gain in quarterly profits.",
      "example_cn": "该公司报告了季度利润的显著增长。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "earn",
      "analysis": "“Earn” (赚取) 强调通过劳动、服务或努力获得报酬或奖励，通常与金钱、荣誉或应得之物相关，带有道德或公平的意味。而 “gain” 更广泛，可以是被动获得或非劳动所得，如获得经验、体重或优势。"
    },
    {
      "word_to_compare": "acquire",
      "analysis": "“Acquire” (获得) 更正式，强调通过长期过程或主动行为取得某物，常用于知识、技能、财产等抽象或具体事物，语气中性。而 “gain” 更常带有积极结果或利益的含义，隐含“得益”或“提升”的意味。"
    },
    {
      "word_to_compare": "increase",
      "analysis": "“Increase” (增加) 是一个纯粹描述数量或程度上升的中性词，不涉及获得的途径或结果的性质。而 “gain” 不仅指数量上升，还隐含了该上升是有益的、值得追求的，常用于表达正面收益。"
    }
  ]
}