{
  "word": "gains",
  "pronunciation": "gānz",
  "concise_definition": "n. 增加, 收益, 进步; v. 获得, 增加, 赢得",
  "forms": {
    "singular": "gain",
    "third_person_singular": "gains",
    "past_tense": "gained",
    "past_participle": "gained",
    "present_participle": "gaining"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An increase or improvement in something desirable, such as wealth, strength, knowledge, or advantage, often resulting from effort or investment.",
      "explanation_cn": "指在财富、力量、知识或优势等方面获得的增加或改善，通常源于努力或投入。",
      "example_en": "The company reported significant financial gains this quarter.",
      "example_cn": "该公司本季度报告了显著的财务收益。"
    },
    {
      "pos": "noun",
      "explanation_en": "A benefit or advantage gained, especially in a competitive or strategic context, such as in sports, politics, or personal development.",
      "explanation_cn": "指在竞争或战略情境中获得的益处或优势，例如在体育、政治或个人成长中。",
      "example_en": "Her recent promotion was a major professional gain.",
      "example_cn": "她最近的晋升是一项重大的职业进步。"
    },
    {
      "pos": "verb",
      "explanation_en": "To acquire or obtain something valuable, such as weight, skill, or profit, often through effort or over time.",
      "explanation_cn": "指通过努力或随着时间推移获得有价值的事物，如体重、技能或利润。",
      "example_en": "He gained valuable experience during his internship.",
      "example_cn": "他在实习期间获得了宝贵的经验。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make progress or move forward, especially in a physical or measurable way, such as gaining ground or speed.",
      "explanation_cn": "指在物理或可测量方面取得进展，例如赢得地盘或加速。",
      "example_en": "The runner gained speed as she approached the finish line.",
      "example_cn": "当这位跑步者接近终点线时，她加速了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "profit",
      "analysis": "“Profit” (利润) 专指经济或财务上的收益，通常以金钱衡量，强调收支差额的正向结果。而 “gain” 范围更广，可涵盖非金钱的收益，如知识、健康或优势，不局限于商业语境。"
    },
    {
      "word_to_compare": "benefit",
      "analysis": "“Benefit” (益处) 更侧重于对某人或某事物的积极影响，常带有主观价值判断，如健康益处、心理益处。“Gain” 更强调实际获得或增加的结果，更具客观性和可测量性，常用于量化成果。"
    },
    {
      "word_to_compare": "increase",
      "analysis": "“Increase” (增加) 是一个中性词，仅表示数量或程度的上升，不隐含价值判断。而 “gain” 暗示所增加的部分是有益的、值得追求的，具有积极语义色彩。例如，‘an increase in taxes’ 是中性，但 ‘a gain in strength’ 是正面的。"
    }
  ]
}