{
  "word": "galleries",
  "pronunciation": "gal·uh·reez",
  "concise_definition": "n. 美术馆, 画廊, 长廊, 座席楼座",
  "forms": {
    "singular": "gallery"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A building or room where works of art are exhibited for public viewing, often curated by institutions or private collectors.",
      "explanation_cn": "指用于公开展示艺术作品的建筑或房间，通常由机构或私人收藏家策划。",
      "example_en": "The Louvre is one of the world's most famous art galleries.",
      "example_cn": "卢浮宫是世界上最著名的美术馆之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A long, narrow space, often with shelves or displays, used for showing art, photographs, or products, especially in commercial or contemporary settings.",
      "explanation_cn": "指一种狭长的空间，常设有架子或展示台，用于陈列艺术作品、照片或商品，尤见于商业或当代艺术环境中。",
      "example_en": "She opened a small gallery in Brooklyn showcasing local street artists.",
      "example_cn": "她在布鲁克林开设了一家小型画廊，展示本地街头艺术家的作品。"
    },
    {
      "pos": "noun",
      "explanation_en": "A raised section of seating in a theater, church, or stadium, typically located above the main floor and offering a view over the audience.",
      "explanation_cn": "指剧院、教堂或体育场中位于主座席上方的高处座位区，通常可俯瞰观众席。",
      "example_en": "We had tickets in the upper galleries, but the view of the stage was still excellent.",
      "example_cn": "我们的票在上层座席，但观看舞台的视野依然极佳。"
    },
    {
      "pos": "noun",
      "explanation_en": "A collection or sequence of images, videos, or other media displayed together, especially on a website or digital platform.",
      "explanation_cn": "指在网站或数字平台上集中展示的一系列图像、视频或其他媒体内容。",
      "example_en": "The photographer posted a gallery of her travels across Southeast Asia.",
      "example_cn": "这位摄影师上传了一组她穿越东南亚旅行的照片集。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "museum",
      "analysis": "“Museum”（博物馆）通常规模更大、收藏更广泛，涵盖历史、科学、文化等多领域展品，具有教育和研究功能；而 “gallery” 更专注于视觉艺术，尤其是当代或现代艺术，常以展览为导向，更具商业或审美性质。"
    },
    {
      "word_to_compare": "exhibition",
      "analysis": "“Exhibition”（展览）指一次具体的、临时性的展品陈列活动，是事件性的；而 “gallery” 是一个物理或虚拟的空间，可以长期存在并举办多个展览。一个画廊可以举办多个展览，但展览本身不是场所。"
    },
    {
      "word_to_compare": "auditorium",
      "analysis": "“Auditorium”（礼堂/观众席）专指用于听觉表演（如音乐会、演讲）的大型座位区，强调声学设计；而 “gallery” 在剧院语境中仅指高处的座位区，不涉及音响功能，且在非剧院语境中完全不指座位。"
    }
  ]
}