{
  "word": "gambit",
  "pronunciation": "gam·bit",
  "concise_definition": "n. 策略, 开局妙着, 试探性举动",
  "forms": {
    "plural": "gambits"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "In chess, a strategic opening move in which a player sacrifices a pawn or piece to gain a positional advantage or to initiate an attack.",
      "explanation_cn": "在国际象棋中，一种策略性的开局走法，玩家通过牺牲一个兵或棋子来获得位置优势或发起进攻。",
      "example_en": "The player opened with the King's Gambit, sacrificing a pawn to control the center of the board.",
      "example_cn": "这位棋手以王翼弃兵开局，牺牲一个兵来控制棋盘中心。"
    },
    {
      "pos": "noun",
      "explanation_en": "A calculated move or remark intended to gain an advantage in a negotiation, argument, or social situation, often by appearing harmless or offering something of little value.",
      "explanation_cn": "在谈判、争论或社交场合中，为获得优势而精心设计的举动或言辞，通常以看似无害或提供无关紧要的东西为手段。",
      "example_en": "His comment about the weather was just a gambit to start a conversation with the CEO.",
      "example_cn": "他关于天气的评论只是为了与首席执行官搭话而使用的策略。"
    },
    {
      "pos": "noun",
      "explanation_en": "Any initial maneuver or tactic used to lure an opponent into a trap or to create an opportunity, often in politics, business, or personal interactions.",
      "explanation_cn": "在政治、商业或人际互动中，任何用于引诱对手落入陷阱或创造机会的初始策略或手段。",
      "example_en": "The politician's offer of tax cuts was a gambit to win over middle-class voters.",
      "example_cn": "这位政治家提出的减税方案是为了争取中产阶级选民的策略。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "strategy",
      "analysis": "“Strategy”（策略）是一个更广泛、更系统的长期计划，涵盖多个步骤和目标；而 “gambit” 通常指一个具体的、有时带有风险的开局动作，目的是快速获得优势或扰乱对手，更强调战术性而非全局性。"
    },
    {
      "word_to_compare": "ploy",
      "analysis": "“Ploy”（诡计）与 “gambit” 非常相似，都指为达到目的而设计的计谋，但 “ploy” 常带有贬义，暗示欺骗或不诚实；而 “gambit” 可以是中性甚至正面的，尤其在棋类或竞技语境中，被视为智慧的体现。"
    },
    {
      "word_to_compare": "opening",
      "analysis": "“Opening”（开局）是描述动作发生阶段的中性词，如棋局的开局、谈判的开场；而 “gambit” 特指开局中带有牺牲或诱敌意图的主动策略，是 “opening” 的一种特殊类型，具有明确的战术目的。"
    }
  ]
}