{
  "word": "gamble",
  "pronunciation": "gam·bl",
  "concise_definition": "v. 赌博, 冒险; n. 冒险行为, 赌注",
  "forms": {
    "third_person_singular": "gambles",
    "past_tense": "gambled",
    "past_participle": "gambled",
    "present_participle": "gambling"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To risk money or something valuable on the outcome of a game of chance, such as betting on cards, dice, or sports events.",
      "explanation_cn": "指在赌博游戏中冒险押注金钱或贵重物品，如赌纸牌、骰子或体育赛事的结果。",
      "example_en": "He gambled away his entire savings at the casino last weekend.",
      "example_cn": "上周末，他在赌场把全部积蓄都输光了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To take a risky action or make a decision with uncertain outcomes, hoping for a favorable result, often in business, politics, or personal life.",
      "explanation_cn": "指在商业、政治或个人生活中采取高风险行动或做出不确定结果的决定，期望获得有利的结果。",
      "example_en": "The CEO gambled on a new market strategy, which ultimately led to the company's breakthrough.",
      "example_cn": "首席执行官冒险采用了一项新市场策略，最终使公司实现了突破。"
    },
    {
      "pos": "noun",
      "explanation_en": "An act of taking a risky chance, especially one involving potential loss or gain; a bet or wager.",
      "explanation_cn": "指一种带有潜在损失或收益的冒险行为，尤指一次赌注或押注。",
      "example_en": "It was a big gamble to invest all their money in startup tech companies.",
      "example_cn": "把所有钱都投资于初创科技公司是一次巨大的冒险。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bet",
      "analysis": "“Bet” (赌注) 通常指在具体事件上下的明确赌注，如“我赌这支球队会赢”，强调的是一个具体的承诺或交易。而 “gamble” 更广泛，既可以指具体的赌博行为，也可以指抽象的高风险决策，语义范围更广，且常带有更强烈的不确定性或危险意味。"
    },
    {
      "word_to_compare": "risk",
      "analysis": "“Risk” (风险) 是一个中性词，泛指任何可能带来损失或不利后果的情况，不必然包含主动选择或期待回报的成分。而 “gamble” 暗示了主动选择承担风险，并期望获得回报，带有更强的主观意愿和投机色彩。"
    },
    {
      "word_to_compare": "venture",
      "analysis": "“Venture” (风险投资/冒险事业) 通常用于商业语境，指有计划、有目标的高风险投资或项目，常带有积极或进取的含义。而 “gamble” 更强调不可控性和运气成分，有时带有负面或轻率的意味，如‘一场愚蠢的赌博’。"
    }
  ]
}