{
  "word": "game",
  "pronunciation": "gaym",
  "concise_definition": "n. 游戏, 比赛, 猎物; v. 下注, 玩耍",
  "forms": {
    "plural": "games"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An activity engaged in for amusement or competition, typically governed by rules and involving skill, chance, or physical exertion.",
      "explanation_cn": "指为娱乐或竞争而进行的活动，通常有规则约束，涉及技巧、运气或体力消耗。",
      "example_en": "Chess is a strategic game that requires deep thinking and planning.",
      "example_cn": "国际象棋是一种需要深思熟虑和规划的策略性游戏。"
    },
    {
      "pos": "noun",
      "explanation_en": "A competitive sporting event or match, especially one organized as part of a league or tournament.",
      "explanation_cn": "指作为联赛或锦标赛一部分组织的竞技体育赛事或比赛。",
      "example_en": "The final game of the World Cup attracted millions of viewers worldwide.",
      "example_cn": "世界杯决赛吸引了全球数百万观众观看。"
    },
    {
      "pos": "noun",
      "explanation_en": "Wild animals hunted for food or sport, especially in rural or traditional contexts.",
      "explanation_cn": "指在乡村或传统语境中为食用或狩猎而捕杀的野生动物。",
      "example_en": "Hunters in the forest were tracking game such as deer and rabbits.",
      "example_cn": "森林中的猎人正在追踪鹿和兔子等猎物。"
    },
    {
      "pos": "noun",
      "explanation_en": "A hidden or manipulative strategy, often with deceptive or cunning intent, especially in social or political contexts.",
      "explanation_cn": "指在社交或政治语境中带有欺骗性或狡诈意图的隐秘策略或手段。",
      "example_en": "The politician was accused of playing games to avoid answering tough questions.",
      "example_cn": "这位政客被指控玩弄手段以回避棘手问题。"
    },
    {
      "pos": "verb",
      "explanation_en": "To bet or wager money on the outcome of a game or event.",
      "explanation_cn": "指对比赛或事件的结果下注或赌博。",
      "example_en": "He liked to game on horse races every weekend.",
      "example_cn": "他喜欢每个周末在赛马上下注。"
    },
    {
      "pos": "verb",
      "explanation_en": "To engage in playful or recreational activity, often implying a lighthearted or unserious approach.",
      "explanation_cn": "指进行娱乐或消遣活动，常暗示一种轻松或不严肃的态度。",
      "example_en": "The children were gaming in the backyard, chasing each other with water guns.",
      "example_cn": "孩子们在后院玩耍，用水枪互相追逐。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sport",
      "analysis": "“Sport”（体育运动）更强调身体竞技和规则体系，通常具有正式组织性和健康锻炼目的，如足球、篮球。而 “game” 范围更广，可包含非身体性的活动（如棋类、电子游戏）或非竞技性的娱乐行为。"
    },
    {
      "word_to_compare": "contest",
      "analysis": "“Contest”（竞赛）侧重于两个或多个参与者之间的直接对抗，以决出胜负，常用于比赛、选秀等正式场合。而 “game” 更强调规则框架下的互动过程，不一定以胜负为唯一目的，也可能纯粹为娱乐。"
    },
    {
      "word_to_compare": "play",
      "analysis": "“Play”（玩耍）是更基础、更泛化的动词，指任何轻松、无目的的活动，尤其用于儿童或非正式场合。而 “game” 作为名词时，通常包含结构、规则或目标，作为动词时则特指参与某种有规则的游戏活动，比 “play” 更具形式性。"
    }
  ]
}