{
  "word": "gaming",
  "pronunciation": "gay·ming",
  "concise_definition": "n. 游戏, 玩游戏, 赌博",
  "forms": {
    "noun": "gaming",
    "verb_base": "game",
    "verb_third_person_singular": "games",
    "verb_past_tense": "gamed",
    "verb_past_participle": "gamed",
    "verb_present_participle": "gaming"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The activity of playing video games or digital games, often for entertainment, competition, or social interaction, typically using consoles, computers, or mobile devices.",
      "explanation_cn": "指使用游戏机、电脑或移动设备进行电子游戏或数字游戏的活动，通常用于娱乐、竞技或社交互动。",
      "example_en": "Gaming has become a major global industry, with millions of players and professional esports tournaments.",
      "example_cn": "游戏已成为一个全球性产业，拥有数以百万计的玩家和专业的电子竞技赛事。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of engaging in gambling or betting, especially in casinos or through legal wagering systems, often involving chance or skill.",
      "explanation_cn": "指参与赌博或下注的行为，尤其在赌场或通过合法投注系统进行，通常涉及运气或技巧。",
      "example_en": "In some jurisdictions, online gaming is strictly regulated to prevent addiction and fraud.",
      "example_cn": "在某些司法管辖区，在线赌博受到严格监管，以防止成瘾和欺诈。"
    },
    {
      "pos": "noun",
      "explanation_en": "A strategic or manipulative action taken to exploit rules or systems for personal advantage, often in contexts outside of entertainment (e.g., 'gaming the system').",
      "explanation_cn": "指为获取个人利益而策略性地利用规则或系统漏洞的行为，常用于娱乐之外的语境（如‘操纵系统’）。",
      "example_en": "Some students were caught gaming the grading algorithm to boost their scores.",
      "example_cn": "一些学生因操纵评分算法以提高分数而被发现。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "play",
      "analysis": "“Play” (玩耍/玩) 是一个更广泛、更通用的词，涵盖所有形式的游戏活动，包括儿童的户外游戏、棋类游戏或角色扮演。而 “gaming” 通常特指电子游戏或有规则的系统性游戏，语义范围更窄、更现代。"
    },
    {
      "word_to_compare": "gambling",
      "analysis": "“Gambling” (赌博) 专指以金钱或财物为赌注、依赖运气的活动，如赌场、彩票或体育博彩。虽然 “gaming” 在某些语境下可指赌博（尤其在法律或行业术语中），但其主要含义是电子游戏，而 “gambling” 不包含娱乐性游戏的成分。"
    },
    {
      "word_to_compare": "gaming",
      "analysis": "“Gaming” 作为动名词，强调的是持续进行的行为或产业状态，而 “game” 作为名词时通常指单个游戏作品（如《英雄联盟》是一款 game）。因此，“gaming” 更侧重于活动、文化或产业层面，而 “game” 更侧重于具体对象。"
    }
  ]
}