{
  "word": "gangs",
  "pronunciation": "gangz",
  "concise_definition": "n. 一群（常指犯罪团伙）, 小团体, 乌合之众",
  "forms": {
    "singular": "gang"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A group of people, often young, who associate together for criminal or delinquent purposes, typically engaging in violence, drug trafficking, or other illegal activities.",
      "explanation_cn": "指一群通常为年轻人、为从事犯罪或违法活动而聚集在一起的团体，常涉及暴力、贩毒或其他非法行为。",
      "example_en": "The police have launched a crackdown on street gangs in the city's downtown area.",
      "example_cn": "警方已对城市中心区的街头帮派展开严厉打击。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of people united by a common interest, activity, or loyalty, often with a sense of exclusivity or informal organization, not necessarily criminal.",
      "explanation_cn": "指因共同兴趣、活动或忠诚而聚集的一群人，通常具有排他性或非正式的组织结构，不一定涉及犯罪。",
      "example_en": "The old men gather every morning at the park — they call themselves the 'Sunrise Gang'.",
      "example_cn": "这些老人每天早上在公园聚会，他们自称‘晨光帮’。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of workers or laborers operating together under a single supervisor or for a specific task, especially in historical or industrial contexts.",
      "explanation_cn": "指在历史或工业背景下，由一名主管领导、共同执行某项任务的一组工人或劳工。",
      "example_en": "In the 19th century, railroad construction was often done by immigrant gangs working under harsh conditions.",
      "example_cn": "19世纪，铁路建设常由在恶劣条件下工作的移民劳工团伙完成。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "clique",
      "analysis": "“Clique”（小圈子）通常指因社交、兴趣或地位而形成的封闭小团体，强调排他性和社交性，但一般不涉及暴力或犯罪。而 “gang” 更常带有负面含义，尤其指有组织的非法活动群体。"
    },
    {
      "word_to_compare": "crew",
      "analysis": "“Crew”（团队）多用于中性或正面语境，指为完成特定任务（如电影拍摄、航海、维修）而组织的协作小组，强调专业性和效率。而 “gang” 常隐含非正式、无纪律甚至危险的性质。"
    },
    {
      "word_to_compare": "mob",
      "analysis": "“Mob”（暴民）强调临时聚集、情绪激动、无组织的群体，通常因突发事件（如抗议、骚乱）而形成，缺乏长期结构。而 “gang” 是相对稳定、有内部规则和领导结构的组织，即使其行为非法。"
    }
  ]
}