{
  "word": "gardens",
  "pronunciation": "gahr·danz",
  "concise_definition": "n. 花园, 园子, 庭院",
  "forms": {
    "singular": "garden"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A plot of land, typically adjacent to a house or public building, where plants such as flowers, vegetables, herbs, or shrubs are cultivated for aesthetic, recreational, or practical purposes.",
      "explanation_cn": "指位于房屋或公共建筑旁的一块土地，用于种植花卉、蔬菜、香草或灌木等植物，以供观赏、休闲或实用目的。",
      "example_en": "She spends every morning tending to her rose garden.",
      "example_cn": "她每天早晨都花时间照料她的玫瑰园。"
    },
    {
      "pos": "noun",
      "explanation_en": "A designed and maintained outdoor space, often with pathways, water features, and decorative elements, intended to create a peaceful or beautiful environment.",
      "explanation_cn": "指经过设计和维护的户外空间，常包含小径、水景和装饰性元素，旨在营造宁静或优美的环境。",
      "example_en": "The Kyoto Botanical Gardens attract thousands of visitors each spring.",
      "example_cn": "京都植物园每年春天都会吸引成千上万的游客。"
    },
    {
      "pos": "noun",
      "explanation_en": "A collective term for cultivated green spaces in urban or institutional settings, such as public parks, monastery gardens, or rooftop gardens.",
      "explanation_cn": "泛指城市或机构环境中经过人工栽培的绿色空间，如公共公园、修道院花园或屋顶花园。",
      "example_en": "The city has invested in creating more community gardens to promote urban sustainability.",
      "example_cn": "该市已投资建设更多社区花园，以促进城市可持续发展。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "park",
      "analysis": "“Park” (公园) 通常指更大规模的公共开放空间，可能包含草坪、游乐设施、步道和运动场地，主要功能是供公众休闲娱乐，植物种植并非其核心。而 “garden” 更强调植物的精心栽培与美学设计，规模较小，常具私密性或主题性。"
    },
    {
      "word_to_compare": "yard",
      "analysis": "“Yard” (院子) 一般指房屋周围的空地，可能仅铺有草地或用于晾晒、停车，缺乏系统性的植物布局和设计意图。而 “garden” 是有意识规划、种植和维护的植物空间，强调园艺性和观赏性。"
    },
    {
      "word_to_compare": "landscape",
      "analysis": "“Landscape” (景观) 是一个更宽泛的术语，涵盖自然或人工改造的整个地貌，包括山丘、河流、建筑和植被等元素。而 “garden” 是景观中的一个子集，特指人类有目的、有组织地种植和管理植物的区域，更具人工控制和审美导向。"
    }
  ]
}