{
  "word": "gate",
  "pronunciation": "geyt",
  "concise_definition": "n. 门, 闸门, 出入口; v. 控制进入",
  "forms": {
    "plural": "gates",
    "third_person_singular": "gates",
    "past_tense": "gated",
    "past_participle": "gated",
    "present_participle": "gating"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A movable barrier, typically made of wood, metal, or other materials, used to close off an entrance or exit to a yard, road, or other enclosed area.",
      "explanation_cn": "一种可移动的屏障，通常由木材、金属或其他材料制成，用于封闭庭院、道路或其他封闭区域的入口或出口。",
      "example_en": "The children ran through the garden gate to play in the park.",
      "example_cn": "孩子们穿过花园的门，跑到公园里玩耍。"
    },
    {
      "pos": "noun",
      "explanation_en": "A controlled access point, especially in a building, airport, or stadium, where people must pass to enter or exit a restricted area.",
      "explanation_cn": "一个受控的出入口，尤其指在建筑物、机场或体育场中，人们必须通过此处才能进入或离开限制区域。",
      "example_en": "Please proceed to Gate 12 for your international flight.",
      "example_cn": "请前往12号登机口乘坐您的国际航班。"
    },
    {
      "pos": "noun",
      "explanation_en": "A suffix added to a noun to form a compound word indicating a scandal or controversy, especially one involving political or public figures (e.g., Watergate).",
      "explanation_cn": "作为后缀加在名词后构成复合词，表示涉及政治或公众人物的丑闻或争议事件（如‘水门事件’）。",
      "example_en": "The financial scandal became known as 'Bankgate' in the media.",
      "example_cn": "这场金融丑闻在媒体中被称为‘银行门’事件。"
    },
    {
      "pos": "verb",
      "explanation_en": "To control or restrict access to something, often by using a gate or similar barrier.",
      "explanation_cn": "通过使用门或类似屏障来控制或限制进入某物。",
      "example_en": "The security team gated the entrance to prevent unauthorized entry.",
      "example_cn": "安保团队封锁了入口，以防止未经授权的进入。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "door",
      "analysis": "“Door”（门）通常指建筑物内部或房间之间的固定或可开关的入口，强调结构和私密性；而 “gate” 更常用于户外、开放区域或大型设施的入口，如围墙、公园、机场等，具有更强的公共性和控制性。"
    },
    {
      "word_to_compare": "entrance",
      "analysis": "“Entrance”（入口）是一个泛指进入某地的通道或位置，不强调物理结构；而 “gate” 是具体的、可操作的物理装置，通常带有可开关的机制。例如，你可以走过一个入口，但必须通过一个门闸。"
    },
    {
      "word_to_compare": "barrier",
      "analysis": "“Barrier”（障碍物）是更广泛的术语，泛指任何阻止通行的物体或结构，包括墙、栅栏、路障等；而 “gate” 是一种特定类型的屏障，具有可开启和关闭的功能，专用于控制进出。"
    }
  ]
}