{
  "word": "gather",
  "pronunciation": "gath·er",
  "concise_definition": "v. 收集, 聚集, 采集, 推断",
  "forms": {
    "third_person_singular": "gathers",
    "past_tense": "gathered",
    "past_participle": "gathered",
    "present_participle": "gathering"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To bring together or collect things or people from different places or sources, often with a purpose.",
      "explanation_cn": "指从不同地点或来源将事物或人聚集在一起，通常带有特定目的。",
      "example_en": "She gathered all the necessary documents before the meeting.",
      "example_cn": "她在会议前收集了所有必要的文件。"
    },
    {
      "pos": "verb",
      "explanation_en": "To acquire or obtain information, opinions, or evidence through observation, inquiry, or experience.",
      "explanation_cn": "指通过观察、询问或经验来获取信息、意见或证据。",
      "example_en": "The journalist gathered firsthand accounts from eyewitnesses.",
      "example_cn": "记者从目击者那里收集了第一手的证词。"
    },
    {
      "pos": "verb",
      "explanation_en": "To come together in a group or crowd, often for a shared purpose or event.",
      "explanation_cn": "指人们聚集在一起，通常为了共同的目的或活动。",
      "example_en": "A large crowd gathered in the square to hear the speech.",
      "example_cn": "一大群人聚集在广场上听演讲。"
    },
    {
      "pos": "verb",
      "explanation_en": "To harvest or pick natural products such as fruits, flowers, or herbs from the wild or a garden.",
      "explanation_cn": "指从野外或花园中采摘水果、花朵或草药等天然产物。",
      "example_en": "They gather wild berries in the forest during summer.",
      "example_cn": "他们在夏天到森林里采摘野莓。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "collect",
      "analysis": "“Collect” (收集) 更强调系统性、有组织地积累物品或信息，常用于收藏、分类或长期积累，如集邮、收集数据。而 “gather” 更强调动作的即时性和自然性，可能不那么有条理，如随手捡起落叶或临时聚集人群。"
    },
    {
      "word_to_compare": "assemble",
      "analysis": "“Assemble” (组装/集合) 通常指将分散的部件或人员有目的地组合成一个整体，强调结构或功能上的整合，如组装机器或召集会议。而 “gather” 更侧重于物理或空间上的靠近，不一定形成结构化的整体。"
    },
    {
      "word_to_compare": "accumulate",
      "analysis": "“Accumulate” (积累) 强调随着时间推移逐渐增多，常用于数量或数量的缓慢增长，如积累财富、知识。它更注重结果的持续性，而 “gather” 更关注动作本身，可能是一次性或短期行为。"
    },
    {
      "word_to_compare": "convene",
      "analysis": "“Convene” (召集) 是正式用语，特指为正式目的（如会议、法庭）召集人员，具有制度性和权威性。而 “gather” 更中性、口语化，可用于任何非正式或正式的聚集场合。"
    }
  ]
}