{
  "word": "gathered",
  "pronunciation": "gath·urd",
  "concise_definition": "v. 收集, 聚集, 采集, 使聚集",
  "forms": {
    "base_form": "gather",
    "third_person_singular": "gathers",
    "present_participle": "gathering",
    "past_tense": "gathered",
    "past_participle": "gathered"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To bring together or collect things or people from different places or sources, often with purpose or intention.",
      "explanation_cn": "指有目的地从不同地点或来源将事物或人聚集在一起。",
      "example_en": "She gathered all the necessary documents before the meeting.",
      "example_cn": "她在会议前收集了所有必要的文件。"
    },
    {
      "pos": "verb",
      "explanation_en": "To acquire or accumulate information, opinions, or data through observation, inquiry, or research.",
      "explanation_cn": "指通过观察、询问或研究来获取、积累信息、意见或数据。",
      "example_en": "The researchers gathered data from hundreds of participants over five years.",
      "example_cn": "研究人员在五年内从数百名参与者那里收集了数据。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move toward a central point or assemble in one place, often spontaneously or in response to an event.",
      "explanation_cn": "指自发地或因某一事件而向一个中心地点聚集。",
      "example_en": "A crowd gathered outside the courthouse as the verdict was announced.",
      "example_cn": "判决宣布时，人群聚集在法院外。"
    },
    {
      "pos": "verb",
      "explanation_en": "To collect or harvest crops, fruits, or other natural products from the land.",
      "explanation_cn": "指从土地上采摘、收割农作物、果实或其他自然资源。",
      "example_en": "Farmers gathered the apples before the first frost.",
      "example_cn": "农民们在初霜来临前采摘了苹果。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "collect",
      "analysis": "“Collect” (收集) 更强调系统性、有组织地将分散的物品或信息归拢，常用于收藏、整理或分类的语境，如收集邮票或数据。“Gathered” 更广泛，可包含自发、非正式的聚集，如人群聚集或随手摘果子，动作感更强，范围更广。"
    },
    {
      "word_to_compare": "assemble",
      "analysis": "“Assemble” (组装/集合) 通常指将部件组合成整体，或有计划地将人召集到特定地点，强调结构或组织性，如组装机器或召开会议。“Gathered” 更侧重于自然或自发的聚集，不一定有明确的结构或目的，如人们在广场上聚集。"
    },
    {
      "word_to_compare": "accumulate",
      "analysis": "“Accumulate” (积累) 强调随着时间推移缓慢、持续地增加数量，常用于抽象事物如财富、债务或经验，带有渐进和累积的意味。“Gathered” 更强调动作的完成和集中，通常是较短时间内的行为，如一次采集或一次聚会。"
    }
  ]
}