{
  "word": "gauntlet",
  "pronunciation": "gawnth·lət",
  "concise_definition": "n. 手套, 严峻考验; v. 投下挑战",
  "forms": {
    "plural": "gauntlets"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A heavy, armored glove worn by medieval knights as part of their protective armor, often made of metal plates or chainmail.",
      "explanation_cn": "中世纪骑士穿戴的重型护甲手套，通常由金属板或锁子甲制成，用于保护手部。",
      "example_en": "The knight polished his steel gauntlet before the jousting tournament.",
      "example_cn": "骑士在比武大会前擦拭着他的钢制护手。"
    },
    {
      "pos": "noun",
      "explanation_en": "A form of punishment or trial in which a person must run between two rows of people who strike or attack them, symbolizing a severe test or ordeal.",
      "explanation_cn": "一种惩罚或考验形式，受试者必须在两排人之间奔跑，而这些人会殴打或攻击他，象征着严峻的考验或磨难。",
      "example_en": "The new CEO had to run the gauntlet of hostile questions from the board.",
      "example_cn": "这位新任首席执行官不得不面对董事会充满敌意的质询。"
    },
    {
      "pos": "verb",
      "explanation_en": "To issue or accept a challenge, especially in the context of a formal or dramatic confrontation; often used in the phrase 'to throw down the gauntlet'.",
      "explanation_cn": "发出或接受挑战，尤其在正式或戏剧性的对抗语境中；常用于短语 'throw down the gauntlet'（提出挑战）。",
      "example_en": "The opposition leader threw down the gauntlet by demanding immediate reforms.",
      "example_cn": "反对派领袖要求立即改革，正式向政府发出了挑战。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "challenge",
      "analysis": "“Challenge”（挑战）是更通用的词，泛指任何形式的对抗或质疑，可作名词或动词，语义范围广泛。而 “gauntlet” 作为动词时，特指以极具象征性的方式（如投下护手）提出挑战，带有强烈的历史和仪式感，语义更具体、更具文学色彩。"
    },
    {
      "word_to_compare": "ordeal",
      "analysis": "“Ordeal”（磨难）指任何艰难痛苦的经历，强调承受的痛苦和压力，但不包含“两排人之间通过”的具体意象。而 “gauntlet” 作为名词时，特指那种有明确形式（如两排人殴打）的考验，其意象更鲜明、更具视觉冲击力。"
    },
    {
      "word_to_compare": "mitt",
      "analysis": "“Mitt”（手套）是日常用语，指普通的手套，如棒球手套或滑雪手套，无任何象征意义或历史背景。而 “gauntlet” 专指古代盔甲手套或象征考验的“双重行刑”形式，语义承载着军事、历史和隐喻的多重维度，二者在语义深度和文化内涵上截然不同。"
    }
  ]
}