{
  "word": "gear",
  "pronunciation": "geer",
  "concise_definition": "n. 齿轮, 装备, 服装, 档位; v. 使适应, 装备",
  "forms": {
    "plural": "gears",
    "third_person_singular": "gears",
    "past_tense": "gears",
    "past_participle": "gears",
    "present_participle": "gearing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A mechanical component with teeth that mesh with another toothed part to transmit motion or power, commonly used in machines and vehicles.",
      "explanation_cn": "一种带有齿的机械部件，与另一个有齿部件啮合以传递运动或动力，常用于机器和车辆中。",
      "example_en": "The bicycle's gears allow the rider to adjust the resistance based on terrain.",
      "example_cn": "自行车的齿轮使骑手能够根据地形调整阻力。"
    },
    {
      "pos": "noun",
      "explanation_en": "Equipment or paraphernalia needed for a particular activity, especially clothing, tools, or devices.",
      "explanation_cn": "进行某项活动所需的装备或用品，尤指服装、工具或设备。",
      "example_en": "Hikers need proper gear, including waterproof boots and a backpack.",
      "example_cn": "徒步旅行者需要合适的装备，包括防水靴和背包。"
    },
    {
      "pos": "noun",
      "explanation_en": "A setting or position in a vehicle's transmission system that determines the ratio between engine speed and wheel speed.",
      "explanation_cn": "车辆传动系统中的一个档位，决定发动机转速与车轮转速之间的比例关系。",
      "example_en": "She shifted into first gear as the car began to climb the steep hill.",
      "example_cn": "当汽车开始爬陡坡时，她换到了一档。"
    },
    {
      "pos": "verb",
      "explanation_en": "To adapt or adjust something to suit a particular purpose, need, or audience.",
      "explanation_cn": "使某事物适应特定的目的、需求或受众。",
      "example_en": "The marketing campaign was geared toward young adults.",
      "example_cn": "这次营销活动针对的是年轻人。"
    },
    {
      "pos": "verb",
      "explanation_en": "To equip or provide with necessary tools or clothing for a specific task or activity.",
      "explanation_cn": "为特定任务或活动配备必要的工具或服装。",
      "example_en": "The team was geared up for the mountain expedition with ropes, helmets, and crampons.",
      "example_cn": "团队为登山远征配备了绳索、头盔和冰爪。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "apparatus",
      "analysis": "“Apparatus”（装置/设备）指一套复杂的系统或仪器，通常用于科学、技术或官方场合，强调结构和功能性。而 “gear” 更口语化，常用于日常活动（如运动、旅行）的装备，范围更广但更非正式。"
    },
    {
      "word_to_compare": "equipment",
      "analysis": "“Equipment”（设备）是更通用的术语，泛指完成某项任务所需的所有工具和器械，中性且正式。而 “gear” 常带有个人化、便携性或特定场景的色彩，如登山 gear、摄影 gear，语义更具体、更富情境感。"
    },
    {
      "word_to_compare": "cog",
      "analysis": "“Cog”（齿轮的单个齿）是 “gear” 的组成部分，常用于比喻（如 ‘a cog in the machine’），强调个体在系统中的微小角色。而 “gear” 指整个齿轮或整套传动系统，既可指物理部件，也可指装备，语义范围远大于 ‘cog’。"
    }
  ]
}