{
  "word": "geeks",
  "pronunciation": "jeeks",
  "concise_definition": "n. 极客, 书呆子, 痴迷者",
  "forms": {
    "singular": "geek"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who is intensely interested in and knowledgeable about a specific subject, especially technology, computers, or niche hobbies, often to the point of being socially awkward or obsessive.",
      "explanation_cn": "指对某一特定领域（尤其是科技、计算机或小众爱好）有强烈兴趣并具备深厚知识的人，有时因过于专注而显得社交笨拙或近乎痴迷。",
      "example_en": "The tech conference attracted hundreds of geeks passionate about artificial intelligence.",
      "example_cn": "这场科技大会吸引了数百名对人工智能充满热情的极客。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is considered socially unconventional or eccentric, often due to intense focus on intellectual or technical pursuits rather than social norms.",
      "explanation_cn": "指因专注于智力或技术活动而被视为行为古怪或不合常规的人，通常偏离了主流社交规范。",
      "example_en": "He was called a geek in high school for spending all his time reading science fiction novels.",
      "example_cn": "他上高中时因为整天读科幻小说而被叫做书呆子。"
    },
    {
      "pos": "noun",
      "explanation_en": "A performer in a sideshow or carnival who engages in bizarre or shocking acts, such as biting the heads off chickens (historical usage).",
      "explanation_cn": "（历史用法）指马戏团或嘉年华中表演怪异或惊悚节目（如咬鸡头）的表演者。",
      "example_en": "In the 1930s, carnival geeks were a common, though controversial, attraction.",
      "example_cn": "在20世纪30年代，马戏团中的怪人表演是一种常见但颇具争议的看点。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "nerd",
      "analysis": "“Nerd”（书呆子）与 “geek” 常互换使用，但 “nerd” 更强调学术上的死板、缺乏社交技巧，有时带有贬义；而 “geek” 近年来已逐渐中性化甚至褒义化，尤其在科技圈中，指对技术有深度热爱和专长的人，更强调热情与专业性。"
    },
    {
      "word_to_compare": "enthusiast",
      "analysis": "“Enthusiast”（爱好者）泛指对某事物有强烈兴趣的人，语气中性或积极，但不隐含社交孤立或技术专精的意味。而 “geek” 通常暗示着更深的投入、更专业的知识，甚至某种文化身份。"
    },
    {
      "word_to_compare": "expert",
      "analysis": "“Expert”（专家）强调的是在某一领域拥有权威性知识或技能，通常通过正式训练或认证获得，是客观能力的体现。而 “geek” 更侧重主观热情和自发性投入，不一定具备专业资质，但可能拥有远超常人的实践积累。"
    }
  ]
}