{
  "word": "gel",
  "pronunciation": "jel",
  "concise_definition": "n. 凝胶, 果冻; v. 凝固, 变成凝胶",
  "forms": {
    "third_person_singular": "gels",
    "past_tense": "gelled",
    "past_participle": "gelled",
    "present_participle": "gelling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A semi-solid substance that has a consistency between a liquid and a solid, often formed by the swelling of a polymer in a liquid; commonly used in cosmetics, pharmaceuticals, and food.",
      "explanation_cn": "一种介于液体与固体之间的半固态物质，通常由聚合物在液体中溶胀形成；常用于化妆品、药品和食品中。",
      "example_en": "She applied a hair gel to style her curls.",
      "example_cn": "她使用发胶来造型卷发。"
    },
    {
      "pos": "noun",
      "explanation_en": "A substance that has been transformed into a jelly-like state, such as fruit gel or medical gel used in imaging.",
      "explanation_cn": "指被转化为果冻状的物质，如水果凝胶或用于医学成像的凝胶。",
      "example_en": "The ultrasound technician spread a clear gel on her skin to improve contact with the probe.",
      "example_cn": "超声波技师在她皮肤上涂抹了一层透明凝胶，以增强探头与皮肤的接触。"
    },
    {
      "pos": "verb",
      "explanation_en": "To change from a liquid or soft state into a semi-solid, jelly-like consistency, often through cooling, chemical reaction, or concentration.",
      "explanation_cn": "指从液态或软态转变为半固态、果冻状的质地，通常通过冷却、化学反应或浓缩实现。",
      "example_en": "The soup began to gel as it cooled in the refrigerator.",
      "example_cn": "汤在冰箱里冷却后开始凝固。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form or cause to form a gel, especially in industrial or scientific contexts.",
      "explanation_cn": "指形成或促使形成凝胶，尤其在工业或科学语境中。",
      "example_en": "The researchers gelled the polymer solution to create a scaffold for tissue engineering.",
      "example_cn": "研究人员将聚合物溶液凝胶化，以制造用于组织工程的支架。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "jelly",
      "analysis": "“Jelly”（果冻）通常指由水果汁液和糖制成的、透明且柔软的食品凝胶，强调食用性和甜味；而 “gel” 是更广泛的科学术语，涵盖所有类型的半固态物质，包括非食用的工业或医用凝胶，语义范围更广。"
    },
    {
      "word_to_compare": "paste",
      "analysis": "“Paste”（糊状物）是一种粘稠、可塑性强的半固体，通常由固体颗粒悬浮在液体中形成，如牙膏或面糊；而 “gel” 的结构更均匀，由聚合物网络锁住液体，质地更透明、更稳定，流动性更低。"
    },
    {
      "word_to_compare": "solidify",
      "analysis": "“Solidify”（固化）指物质从液态完全转变为固态，强调状态的彻底转变；而 “gel” 描述的是部分凝固、仍保留一定流动性的中间状态，质地更柔软，不一定是完全坚硬的固体。"
    }
  ]
}