{
  "word": "generalized",
  "pronunciation": "jen·er·uh·layzd",
  "concise_definition": "adj. 概括的, 一般的, 非特异的",
  "forms": {
    "base_form": "generalize",
    "present_participle": "generalizing",
    "past_tense": "generalized",
    "past_participle": "generalized"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Applied broadly or broadly applicable, rather than to a specific case or individual; characterized by broad application or abstraction.",
      "explanation_cn": "指适用于广泛范围而非特定个案或个体的；具有普遍性或抽象性的特征。",
      "example_en": "The study made a generalized conclusion about human behavior based on a small sample.",
      "example_cn": "这项研究基于一个小样本得出了关于人类行为的概括性结论。"
    },
    {
      "pos": "adjective",
      "explanation_en": "In biology or medicine, referring to a trait, response, or condition that is not specific to a particular organ, tissue, or cause, but affects a wide area or system.",
      "explanation_cn": "在生物学或医学中，指一种非针对特定器官、组织或病因，而是影响广泛区域或系统的特征、反应或状况。",
      "example_en": "The patient showed generalized inflammation throughout the body.",
      "example_cn": "患者全身出现了广泛的炎症反应。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Simplified or reduced to a general form, often by omitting details or exceptions, especially in mathematics or logic.",
      "explanation_cn": "指通过省略细节或例外情况，将某事物简化为一般形式，尤其在数学或逻辑中。",
      "example_en": "The theorem was generalized to apply to all continuous functions, not just polynomials.",
      "example_cn": "该定理被推广为适用于所有连续函数，而不仅仅是多项式函数。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "general",
      "analysis": "“General” 是最常用的形容词，表示“普遍的、一般的”，语义较宽泛，可用于日常语境。而 “generalized” 更强调“从具体案例中抽象、归纳或推广而来”的过程，常用于学术、科学或技术语境，带有更强的逻辑或方法论色彩。"
    },
    {
      "word_to_compare": "broad",
      "analysis": "“Broad” 强调范围宽广、涵盖面大，但不必然涉及抽象或归纳过程。例如 “broad range” 指范围广，但不一定是从具体中提炼出的概括。而 “generalized” 暗示了从特殊到普遍的推理过程，具有认知上的转化含义。"
    },
    {
      "word_to_compare": "universal",
      "analysis": "“Universal” 指适用于所有情况、无一例外的绝对普遍性，具有更强的排他性和绝对性（如 universal law）。而 “generalized” 仅表示“广泛适用”，可能仍存在例外，是相对的、非绝对的概括。"
    }
  ]
}