{
  "word": "georgian",
  "pronunciation": "jee·or·jhee·uhn",
  "concise_definition": "adj. 乔治亚的, 乔治王朝的; n. 乔治亚人, 乔治王朝时期的人",
  "forms": {
    "plural": "georgians"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to the U.S. state of Georgia, its people, culture, or characteristics, especially in the context of American regional identity.",
      "explanation_cn": "与美国佐治亚州相关的事物，包括其人民、文化或特征，尤其在美式区域身份语境中使用。",
      "example_en": "The restaurant serves authentic Georgian cuisine with cornbread and peach cobbler.",
      "example_cn": "这家餐厅提供正宗的佐治亚州美食，如玉米面包和桃子派。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to the Kingdom of Georgia in the Caucasus region, its language, history, or culture, especially in contrast to Russian or Turkish influences.",
      "explanation_cn": "与高加索地区格鲁吉亚王国相关的事物，包括其语言、历史或文化，尤其用于区别于俄罗斯或土耳其的影响。",
      "example_en": "Georgian wine has been produced for over 8,000 years using traditional qvevri clay vessels.",
      "example_cn": "格鲁吉亚葡萄酒使用传统的克韦夫利陶罐已酿造了超过八千年。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to the reign of the British monarchs George I through George IV (1714–1830), especially in architecture, literature, and fashion.",
      "explanation_cn": "与英国国王乔治一世至乔治四世在位时期（1714–1830年）相关的事物，尤指建筑、文学和时尚风格。",
      "example_en": "The town center features elegant Georgian townhouses with symmetrical facades and sash windows.",
      "example_cn": "镇中心有优雅的乔治王朝风格联排别墅，立面对称，配有百叶窗。"
    },
    {
      "pos": "noun",
      "explanation_en": "A native or inhabitant of the U.S. state of Georgia.",
      "explanation_cn": "美国佐治亚州的本地人或居民。",
      "example_en": "Many Georgians take pride in their state’s rich Civil War history.",
      "example_cn": "许多佐治亚人对自己的州在内战中的丰富历史感到自豪。"
    },
    {
      "pos": "noun",
      "explanation_en": "A native or inhabitant of the country of Georgia in the Caucasus.",
      "explanation_cn": "高加索地区格鲁吉亚国家的本地人或居民。",
      "example_en": "Georgians are known for their warm hospitality and deep-rooted traditions of feasting and toasting.",
      "example_cn": "格鲁吉亚人以热情好客和根深蒂固的宴饮与祝酒传统而闻名。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person living in Britain during the reign of the Georges (1714–1830), especially one associated with the refined tastes of the era.",
      "explanation_cn": "指1714–1830年乔治王朝时期生活在英国的人，尤指与该时代精致品味相关的人。",
      "example_en": "The Georgian gentleman wore a powdered wig and carried a cane as a symbol of status.",
      "example_cn": "这位乔治王朝时期的绅士戴着假发，手持手杖，以彰显其社会地位。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "georgian",
      "analysis": "“Georgian” 作为形容词和名词具有多重含义，需根据语境区分：指美国佐治亚州、高加索国家格鲁吉亚，或英国乔治王朝时期。这与 “British”（英国的）或 “American”（美国的）不同，后者仅指国家归属，而 “Georgian” 还承载特定历史时期的文化内涵。"
    },
    {
      "word_to_compare": "victorian",
      "analysis": "“Victorian” 指英国维多利亚女王统治时期（1837–1901），强调道德保守、工业进步与繁复装饰风格；而 “Georgian” 指更早的乔治王朝时期（1714–1830），风格更偏向古典对称、优雅简洁。两者虽同为英国历史分期，但美学与社会氛围截然不同。"
    },
    {
      "word_to_compare": "caucasian",
      "analysis": "“Caucasian” 是地理/种族术语，泛指高加索地区或白种人，而 “Georgian” 是具体国家名称，仅指格鲁吉亚人。虽然格鲁吉亚位于高加索，但并非所有高加索人都是格鲁吉亚人，二者不可互换。"
    }
  ]
}