{
  "word": "georgia",
  "pronunciation": "jɔːrˈdʒiə",
  "concise_definition": "n. 美国佐治亚州；格鲁吉亚（国家）；（复数形式 Georgia）指一种流行于18世纪的轻薄棉布",
  "forms": {
    "plural": "Georgias"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A U.S. state located in the southeastern region of the country, known for its peaches, historic cities like Savannah, and as a major center of agriculture and logistics.",
      "explanation_cn": "美国东南部的一个州，以桃子、历史悠久的城市萨凡纳以及作为农业和物流中心而闻名。",
      "example_en": "She moved to Georgia after graduating from college to work in Atlanta's tech industry.",
      "example_cn": "她大学毕业后搬到佐治亚州，在亚特兰大的科技行业工作。"
    },
    {
      "pos": "noun",
      "explanation_en": "A country in the Caucasus region at the intersection of Eastern Europe and Western Asia, formerly part of the Soviet Union, with a rich history dating back to ancient times and known for its wine, mountain landscapes, and Orthodox Christian heritage.",
      "explanation_cn": "位于欧亚交界处高加索地区的一个国家，曾是苏联的一部分，拥有自古以来的丰富历史，以葡萄酒、山地景观和东正教传统著称。",
      "example_en": "Georgia declared independence from the Soviet Union in 1991 and has since pursued closer ties with the European Union.",
      "example_cn": "格鲁吉亚于1991年从苏联独立，并自此致力于与欧盟建立更紧密的关系。"
    },
    {
      "pos": "noun",
      "explanation_en": "A lightweight, plain-weave cotton fabric, originally produced in the U.S. state of Georgia, commonly used in the 18th and 19th centuries for dresses and summer clothing.",
      "explanation_cn": "一种轻薄的平纹棉布，最初产自美国佐治亚州，18至19世纪常用于制作连衣裙和夏季服装。",
      "example_en": "The museum displayed a beautiful Georgian dress made of authentic 18th-century georgia fabric.",
      "example_cn": "博物馆展出了一件用正宗18世纪佐治亚棉布制成的美丽长裙。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "Georgia (country) vs. Georgia (state)",
      "analysis": "作为国家名，'Georgia' 指位于高加索地区的主权国家，其官方语言为格鲁吉亚语，首都为第比利斯；作为美国州名，'Georgia' 是美国第41个州，首府为亚特兰大，英语为官方语言。两者地理、文化、历史完全无关，仅因历史命名巧合共享同一名称。"
    },
    {
      "word_to_compare": "fabric (georgia) vs. muslin",
      "analysis": "‘Georgia’（棉布）是一种轻薄、平纹、无图案的棉织物，常用于18世纪女性服装；而‘muslin’（麻纱布）更轻、更透明，常用于制作内衣、衬裙或作为服装样衣。两者相似但‘georgia’更厚实、更耐用，且与佐治亚州的产地直接相关。"
    },
    {
      "word_to_compare": "Georgia vs. Georgia (name origin)",
      "analysis": "美国佐治亚州得名于英国国王乔治二世（King George II），而格鲁吉亚国家的英文名 'Georgia' 源于波斯语对当地人的称呼 'Gurj'，后经欧洲语言演变而来。两者名称虽拼写相同，但词源不同，体现了语言传播中的偶然重合。"
    }
  ]
}