{
  "word": "ghetto",
  "pronunciation": "jet·oh",
  "concise_definition": "n. 像贫民区, 少数族裔聚居区, 隔离区",
  "forms": {
    "plural": "ghettos"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A part of a city, especially a densely populated urban area, where a minority group is concentrated, often due to social, economic, or legal pressures, and frequently characterized by poverty and limited opportunities.",
      "explanation_cn": "城市中一个人口密集的区域，通常因社会、经济或法律压力，使某一少数群体集中居住，常伴有贫困和有限的发展机会。",
      "example_en": "In the 1940s, Jews in Warsaw were forced to live in a sealed ghetto under Nazi occupation.",
      "example_cn": "20世纪40年代，华沙的犹太人在纳粹占领下被迫居住在封闭的犹太区。"
    },
    {
      "pos": "noun",
      "explanation_en": "A social or cultural environment in which a group is isolated or confined, often metaphorically, even without physical boundaries.",
      "explanation_cn": "指一个群体在社会或文化上被孤立或限制的环境，即使没有物理边界，也常以隐喻方式使用。",
      "example_en": "The artist felt trapped in a ghetto of commercial pop music, unable to explore experimental genres.",
      "example_cn": "这位艺术家感到自己被困在商业流行音乐的牢笼中，无法探索实验性音乐类型。"
    },
    {
      "pos": "noun",
      "explanation_en": "Historically, a legally mandated Jewish quarter in European cities, especially during the Middle Ages and early modern period.",
      "explanation_cn": "历史上指欧洲城市中法律强制划定的犹太人聚居区，尤其在中世纪和近代早期。",
      "example_en": "The Venetian ghetto, established in 1516, was the first area in Europe officially designated for Jewish residents.",
      "example_cn": "1516年建立的威尼斯犹太区是欧洲第一个官方指定的犹太居民聚居区。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "slum",
      "analysis": "“Slum”（贫民窟）强调的是居住环境的破败、卫生条件恶劣和经济贫困，是一个描述物理条件的词，不必然涉及族群隔离。而 “ghetto” 不仅包含贫困，更强调因社会、种族或宗教原因导致的系统性隔离和压迫。"
    },
    {
      "word_to_compare": "neighborhood",
      "analysis": "“Neighborhood”（社区）是一个中性词，仅指城市中的地理居住区域，无负面含义。而 “ghetto” 带有强烈的社会不公、边缘化和压迫的内涵，常用于批判性语境。"
    },
    {
      "word_to_compare": "enclave",
      "analysis": "“Enclave”（飞地/封闭社区）指一个被其他区域包围的、具有独特文化或政治特征的区域，通常是自愿形成的，如外交使馆区或移民文化社区。而 “ghetto” 是被迫形成的，带有压迫和排斥的性质，社会权力结构不平等。"
    }
  ]
}