{
  "word": "gigs",
  "pronunciation": "jiz",
  "concise_definition": "n. 临时工作, 音乐演出, 短期任务",
  "forms": {
    "singular": "gig"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A temporary or freelance job, especially one that is short-term and often in the creative, service, or tech industries, such as driving for a ride-sharing app or doing graphic design on a project basis.",
      "explanation_cn": "指短期的、非固定的临时工作，尤其常见于创意、服务或科技行业，例如担任网约车司机或以项目为基础从事平面设计。",
      "example_en": "She’s been taking on several gigs as a freelance writer to supplement her income.",
      "example_cn": "她接了几个自由撰稿的活儿来增加收入。"
    },
    {
      "pos": "noun",
      "explanation_en": "A live musical performance, typically by a band or solo artist, often at a club, festival, or other venue, usually for a specific audience and payment.",
      "explanation_cn": "指乐队或独奏音乐人进行的现场演出，通常在俱乐部、音乐节或其他场所举行，面向特定观众并获得报酬。",
      "example_en": "The jazz quartet played three gigs last weekend at downtown venues.",
      "example_cn": "这个爵士四重奏上周末在市中心的三个场地进行了演出。"
    },
    {
      "pos": "noun",
      "explanation_en": "A short-term contract or task performed through a digital platform, such as Uber, Fiverr, or TaskRabbit, where workers are paid per task rather than on a salary.",
      "explanation_cn": "指通过数字平台（如 Uber、Fiverr 或 TaskRabbit）承接的短期任务或合同，工作者按任务计酬，而非领取固定薪水。",
      "example_en": "He earns extra money by completing gigs on Fiverr, like designing logos or editing videos.",
      "example_cn": "他通过在 Fiverr 上接单（如设计标志或剪辑视频）赚取额外收入。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "job",
      "analysis": "“Job”（工作）通常指长期、稳定、有正式雇佣关系的职位，带有持续性和制度性；而 “gig” 强调临时性、灵活性和非传统雇佣关系，常用于零工经济中。"
    },
    {
      "word_to_compare": "performance",
      "analysis": "“Performance”（表演）是一个更广泛、中性的词，泛指任何形式的演出或展示，不必然涉及报酬或商业目的；而 “gig” 特指以盈利为目的的现场音乐演出，具有明确的商业属性。"
    },
    {
      "word_to_compare": "task",
      "analysis": "“Task”（任务）泛指任何需要完成的具体工作，可以是日常事务或项目的一部分，不强调时间长短或经济模式；而 “gig” 特指通过平台或市场交易获得的、按件计酬的短期工作，具有平台经济和零工特征。"
    }
  ]
}