{
  "word": "glass",
  "pronunciation": "glas",
  "concise_definition": "n. 玻璃, 玻璃杯, 眼镜; v. 用玻璃覆盖",
  "forms": {
    "plural": "glasses"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A hard, transparent, and brittle material made by melting sand with other substances, commonly used in windows, containers, and optical devices.",
      "explanation_cn": "一种由沙子与其他物质熔融制成的坚硬、透明且易碎的材料，常用于窗户、容器和光学设备。",
      "example_en": "The window was made of thick glass to withstand strong winds.",
      "example_cn": "这扇窗户使用厚玻璃制成，以抵御强风。"
    },
    {
      "pos": "noun",
      "explanation_en": "A container, typically made of glass, used for drinking liquids, often with a stem and base (e.g., wine glass) or a simple cylindrical shape (e.g., tumbler).",
      "explanation_cn": "一种通常由玻璃制成的容器，用于盛装饮品，可以是带柄和底座的（如葡萄酒杯），也可以是简单的圆柱形（如水杯）。",
      "example_en": "She sipped her orange juice from a tall glass.",
      "example_cn": "她从一个高玻璃杯中啜饮着橙汁。"
    },
    {
      "pos": "noun",
      "explanation_en": "A pair of lenses set in a frame, worn in front of the eyes to correct vision or protect them.",
      "explanation_cn": "一对安装在镜框中的镜片，佩戴在眼前以矫正视力或保护眼睛。",
      "example_en": "He put on his glasses to read the small print on the label.",
      "example_cn": "他戴上眼镜，以便看清标签上的小字。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover or line something with glass, especially to create a transparent surface or enclosure.",
      "explanation_cn": "用玻璃覆盖或衬里某物，尤其是为了创建透明表面或封闭空间。",
      "example_en": "The conservatory was glazed with large panes of glass to let in maximum sunlight.",
      "example_cn": "温室用大面积玻璃覆盖，以最大限度地引入阳光。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "crystal",
      "analysis": "“Crystal”（水晶）通常指天然或人造的透明矿物，具有更高的纯度、折射率和光泽，常用于高档器皿或装饰品。而 “glass” 是人工制造的，质地较普通，成本更低，用途更广泛。虽然两者外观相似，但 “crystal” 更强调其天然美感和物理特性。"
    },
    {
      "word_to_compare": "mirror",
      "analysis": "“Mirror”（镜子）是表面经过镀银或镀铝处理的玻璃，用于反射图像。它本质上是玻璃的一种特殊应用形式，但功能完全相反：玻璃是透光的，镜子是反光的。因此，所有镜子都含玻璃，但并非所有玻璃都是镜子。"
    },
    {
      "word_to_compare": "lens",
      "analysis": "“Lens”（透镜）是经过精确打磨的透明材料（通常是玻璃或塑料），用于聚焦或分散光线，常见于眼镜、相机和显微镜中。它是玻璃的一种功能性形态，但强调的是光学曲面设计，而非材料本身。玻璃是材料，透镜是形状与用途的结合体。"
    }
  ]
}