{
  "word": "glaze",
  "pronunciation": "glayz",
  "concise_definition": "n. 釉, 光泽; v. 上釉, 涂光泽, 掩盖",
  "forms": {
    "third_person_singular": "glazes",
    "past_tense": "glazed",
    "past_participle": "glazed",
    "present_participle": "glazing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A smooth, glossy coating applied to ceramics, glass, or other surfaces, typically made from a mixture of minerals and melted to form a glassy layer.",
      "explanation_cn": "涂在陶瓷、玻璃或其他表面上的光滑有光泽的涂层，通常由矿物质混合物熔融后形成玻璃质表层。",
      "example_en": "The pottery was finished with a vibrant blue glaze that shimmered in the light.",
      "example_cn": "这件陶器涂上了一层鲜艳的蓝色釉料，在光线下熠熠生辉。"
    },
    {
      "pos": "noun",
      "explanation_en": "A thin, shiny layer applied to food, especially pastries or meats, to enhance appearance and add sweetness or flavor.",
      "explanation_cn": "涂在食物（尤其是糕点或肉类）表面的一层薄而有光泽的物质，用于提升外观并增加甜味或风味。",
      "example_en": "The donuts were topped with a sweet sugar glaze that hardened into a crisp shell.",
      "example_cn": "甜甜圈上覆盖了一层甜糖釉，凝固后形成了一层脆壳。"
    },
    {
      "pos": "verb",
      "explanation_en": "To apply a glaze to a surface, especially pottery or food, to create a smooth, glossy finish.",
      "explanation_cn": "在表面（尤其是陶瓷或食物）上涂抹釉料，以形成光滑有光泽的表层。",
      "example_en": "The artist glazed the ceramic bowl to give it a deep, reflective sheen.",
      "example_cn": "这位艺术家给陶瓷碗上了釉，使其呈现出深邃而有反射性的光泽。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover or conceal something superficially, often to hide flaws or unpleasant realities; to appear emotionally detached or expressionless.",
      "explanation_cn": "表面上掩盖或掩饰某物，常用于隐藏缺陷或不愉快的现实；也可指表情冷漠、无动于衷。",
      "example_en": "She tried to glaze over the tension in the room with cheerful small talk.",
      "example_cn": "她试图用愉快的闲聊来掩盖房间里的紧张气氛。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "coating",
      "analysis": "“Coating”（涂层）是一个更广泛的术语，泛指任何覆盖在表面的材料层，可以是保护性、装饰性或功能性，不特指光泽或玻璃质。而 “glaze” 特指具有玻璃质光泽的涂层，多用于陶瓷或食品，强调视觉和质感效果。"
    },
    {
      "word_to_compare": "varnish",
      "analysis": "“Varnish”（清漆）是一种用于木材或画作的透明保护性涂层，主要功能是防潮和增亮，通常为化学合成物。而 “glaze” 更常用于陶器或食品，其成分和工艺（如高温烧制）更具传统和工艺性，且常含色素或糖分。"
    },
    {
      "word_to_compare": "veil",
      "analysis": "“Veil”（面纱/掩盖）作为动词时，强调用某种方式遮掩真相，常带有隐喻性，如“veil one’s true intentions”。而 “glaze over” 更强调用表面的光鲜或轻松行为来暂时掩盖问题，带有更具体的视觉和行为意象，常用于社交语境中的敷衍掩饰。"
    }
  ]
}