{
  "word": "glide",
  "pronunciation": "glahyd",
  "concise_definition": "v. 滑行, 滑翔, 平滑移动; n. 滑行, 滑翔",
  "forms": {
    "third_person_singular": "glides",
    "past_tense": "glided",
    "past_participle": "glided",
    "present_participle": "gliding"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move smoothly and effortlessly over a surface, often with little or no friction, as if floating.",
      "explanation_cn": "指在表面上平稳而轻松地移动，通常几乎没有摩擦，仿佛漂浮一般。",
      "example_en": "The ice skater glided across the rink with grace and precision.",
      "example_cn": "滑冰运动员优雅而精准地在冰场上滑行。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fly or move through the air without powered flight, typically using air currents, as birds or aircraft do.",
      "explanation_cn": "指在没有动力推进的情况下，利用气流在空中飞行，如鸟类或滑翔机。",
      "example_en": "The eagle glided silently on the thermal updrafts above the mountains.",
      "example_cn": "雄鹰在山巅的热气流上无声地滑翔。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pass or proceed smoothly and continuously, often used metaphorically to describe transitions or processes.",
      "explanation_cn": "指平稳而连续地进行或过渡，常用于比喻性地描述过程或转变。",
      "example_en": "The conversation glided effortlessly from politics to poetry.",
      "example_cn": "谈话从政治轻松自然地过渡到了诗歌。"
    },
    {
      "pos": "noun",
      "explanation_en": "A smooth, continuous movement, especially through air or over a surface.",
      "explanation_cn": "指一种平稳、连续的移动，尤指在空中或表面上的滑行。",
      "example_en": "The ballet dancer’s final glide left the audience breathless.",
      "example_cn": "芭蕾舞者最后的滑行动作令观众屏息。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "slip",
      "analysis": "“Slip”（滑动）强调因表面光滑或失去控制而发生的意外或不稳定的移动，常带有负面或偶然的含义，如“slip on ice”。而 “glide” 强调的是有控制的、优雅的、流畅的移动，通常是主动且优美的。"
    },
    {
      "word_to_compare": "slide",
      "analysis": "“Slide”（滑行）通常指在重力或外力作用下沿表面直线移动，常伴随接触和摩擦，如“slide down a slide”。而 “glide” 更强调轻盈、无摩擦、近乎悬浮的感觉，常用于空中或冰面等低阻力环境，更具诗意和流畅感。"
    },
    {
      "word_to_compare": "fly",
      "analysis": "“Fly”（飞行）泛指所有形式的空中运动，通常需要主动的动力（如鸟类拍翅或飞机引擎）。而 “glide” 是一种无动力的飞行方式，依赖气流和重力，强调静谧与节能，是“fly”的一种特定子类型。"
    }
  ]
}