{
  "word": "gloom",
  "pronunciation": "glum",
  "concise_definition": "n. 阴暗, 忧郁, 沮丧; v. 使阴暗, 使忧郁",
  "forms": {
    "plural": "glooms",
    "third_person_singular": "glooms",
    "past_tense": "gloomed",
    "past_participle": "gloomed",
    "present_participle": "glooming"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A state of darkness, dimness, or obscurity, often referring to physical surroundings that feel oppressive or cheerless.",
      "explanation_cn": "指一种阴暗、昏暗或朦胧的状态，常用于描述令人压抑或无精打采的物理环境。",
      "example_en": "The gloom of the abandoned house made everyone uneasy.",
      "example_cn": "那座废弃房屋的阴暗气氛让每个人都感到不安。"
    },
    {
      "pos": "noun",
      "explanation_en": "A feeling of deep sadness, despair, or depression, often without an obvious cause; a pervasive sense of hopelessness.",
      "explanation_cn": "指一种深刻的悲伤、绝望或抑郁情绪，常无明显诱因；一种弥漫性的无望感。",
      "example_en": "She was overcome by a sudden gloom after hearing the news.",
      "example_cn": "听到这个消息后，她突然陷入了一阵忧郁。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make something darker or more somber in appearance or atmosphere, often metaphorically.",
      "explanation_cn": "使某物在外观或氛围上变得更阴暗或更沉闷，常用于比喻意义。",
      "example_en": "The news gloomed the entire room, silencing all conversation.",
      "example_cn": "这个消息让整个房间陷入沉寂，气氛顿时阴郁起来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To become or appear dark, dull, or depressed in mood or expression.",
      "explanation_cn": "指情绪或表情变得阴暗、灰暗或沮丧。",
      "example_en": "His face gloomed as he realized the mistake he had made.",
      "example_cn": "当他意识到自己犯的错误时，脸色顿时阴沉下来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "darkness",
      "analysis": "“Darkness” (黑暗) 是一个纯粹的物理或视觉概念，指缺乏光线的状态，不带有情感色彩。而 “gloom” 不仅指光线昏暗，更强调由此引发的压抑、忧郁的情绪氛围，具有强烈的主观感受。"
    },
    {
      "word_to_compare": "melancholy",
      "analysis": "“Melancholy” (忧郁) 是一种更细腻、更持久、常带诗意的悲伤情绪，常与沉思、怀旧相关。而 “gloom” 更偏向于一种突然的、沉重的、甚至令人窒息的沮丧感，情绪强度更高，但持续时间可能较短。"
    },
    {
      "word_to_compare": "depression",
      "analysis": "“Depression” (抑郁) 是一个临床心理学术语，指一种持续性的精神疾病状态，具有明确的诊断标准。而 “gloom” 是日常语言中对短暂情绪低落的描述，程度较轻，不具备病理含义，更口语化、更形象。"
    }
  ]
}