{
  "word": "glory",
  "pronunciation": "glaw·ree",
  "concise_definition": "n. 荣耀, 光荣, 赞美; v. 以...为荣",
  "forms": {
    "plural": "glories",
    "third_person_singular": "glories",
    "past_tense": "gloried",
    "past_participle": "gloried",
    "present_participle": "glorifying"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "High praise, honor, or admiration earned through great achievements, especially in battle, sports, or public service; often associated with fame and noble deeds.",
      "explanation_cn": "通过伟大成就（尤其在战争、体育或公共服务中）赢得的极高赞誉、荣誉或钦佩，常与名声和高尚行为相关联。",
      "example_en": "The soldiers fought with courage and died in glory.",
      "example_cn": "士兵们英勇作战，光荣牺牲。"
    },
    {
      "pos": "noun",
      "explanation_en": "A state of brilliant, radiant light or splendor, often used to describe divine or celestial beauty.",
      "explanation_cn": "一种辉煌灿烂的光芒或壮丽景象，常用于形容神圣或天界的美。",
      "example_en": "The sun rose in glory over the mountains, painting the sky in gold and crimson.",
      "example_cn": "太阳在群山之上辉煌升起，将天空染成金红之色。"
    },
    {
      "pos": "noun",
      "explanation_en": "A thing or event that brings great honor or pride, such as a trophy, title, or memorable accomplishment.",
      "explanation_cn": "能带来极大荣誉或自豪感的事物或事件，如奖杯、头衔或难忘的成就。",
      "example_en": "Winning the championship was the crowning glory of her athletic career.",
      "example_cn": "赢得冠军是她运动生涯的巅峰荣耀。"
    },
    {
      "pos": "verb",
      "explanation_en": "To feel or express great pride or satisfaction, especially in one's own achievements or those of others.",
      "explanation_cn": "感到或表达极大的自豪或满足，尤其针对自己的成就或他人的成就。",
      "example_en": "She gloried in her son's academic success.",
      "example_cn": "她为儿子的学业成就感到无比自豪。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "honor",
      "analysis": "“Honor”（荣誉）更侧重于道德上的尊重和正直行为所获得的认可，常与责任、诚信和制度性认可相关（如勋章、头衔）；而 “glory” 更强调公众的热烈赞美和辉煌成就带来的光环，常带有情感色彩和戏剧性。"
    },
    {
      "word_to_compare": "fame",
      "analysis": "“Fame”（名声）指被广泛知晓的状态，无论正面或负面；而 “glory” 专指因卓越成就而获得的正面、崇高的名声，带有敬仰和神圣感。一个人可以有名声却没有荣耀，但荣耀必然伴随名声。"
    },
    {
      "word_to_compare": "splendor",
      "analysis": "“Splendor”（壮丽）主要描述视觉上的宏伟、华丽或辉煌，常用于自然景观或建筑；而 “glory” 可以是视觉的，但更常用于抽象层面——如精神、道德或成就上的辉煌，具有更深层的情感和象征意义。"
    }
  ]
}