{
  "word": "gloucester",
  "pronunciation": "glus·tər",
  "concise_definition": "n. 格洛斯特（英国地名，亦为姓氏）",
  "forms": {
    "plural": "Gloucesters"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A city in southwest England, known for its historic cathedral, medieval streets, and as the administrative center of Gloucestershire county.",
      "explanation_cn": "英国西南部的一座城市，以其历史悠久的大教堂、中世纪街道以及作为格洛斯特郡行政中心而闻名。",
      "example_en": "We visited Gloucester Cathedral, one of the finest examples of Gothic architecture in England.",
      "example_cn": "我们参观了格洛斯特大教堂，这是英格兰最杰出的哥特式建筑之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A surname of English origin, borne by notable individuals such as Prince William, Duke of Gloucester, a member of the British royal family.",
      "explanation_cn": "一个源自英国的姓氏，曾为多位知名人物所使用，例如英国王室成员格洛斯特公爵威廉王子。",
      "example_en": "The Duke of Gloucester attended the royal ceremony in full regalia.",
      "example_cn": "格洛斯特公爵身着全套礼服出席了王室仪式。"
    },
    {
      "pos": "noun",
      "explanation_en": "A breed of cattle originating in Gloucestershire, known for its distinctive white markings and dual-purpose use for milk and meat.",
      "explanation_cn": "一种起源于格洛斯特郡的牛品种，以其独特的白色斑纹和奶肉兼用特性而著称。",
      "example_en": "The rare Gloucester cattle are being preserved by local farmers to maintain agricultural heritage.",
      "example_cn": "当地农民正在努力保护这种稀有的格洛斯特牛，以维护农业传统。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "chester",
      "analysis": "“Chester” 是英语中常见的地名后缀，源自拉丁语“castra”（军营），常用于英国城镇名称（如 Chester, Manchester）。而 “Gloucester” 是一个完整专有名词，特指英格兰的某一具体城市或相关事物，不能单独使用 “chester” 来替代其含义。"
    },
    {
      "word_to_compare": "dorset",
      "analysis": "“Dorset” 是另一个英国郡名，与 “Gloucester” 同属地理名称，但两者分别代表不同地区，文化、历史和经济特征各异。Gloucester 以大教堂和牛种闻名，Dorset 则以农业和海岸景观著称，二者无直接语义关联，仅在作为地名类别上相似。"
    },
    {
      "word_to_compare": "duke",
      "analysis": "“Duke” 是贵族头衔，常与 “Gloucester” 连用构成头衔全称（如 Duke of Gloucester），但 “duke” 本身是身份称谓，而 “Gloucester” 是地理或姓氏来源。二者属于不同语义范畴，不可互换。"
    }
  ]
}