{
  "word": "glow",
  "pronunciation": "glow",
  "concise_definition": "v. 发光, 发出柔和的光; n. 光辉, 发光",
  "forms": {
    "third_person_singular": "glows",
    "past_tense": "glowed",
    "past_participle": "glowed",
    "present_participle": "glowing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To emit a steady, soft, and often warm light without flame, typically due to heat, chemical reaction, or biological processes.",
      "explanation_cn": "指不借助火焰，因受热、化学反应或生物过程而持续发出柔和、温暖的光。",
      "example_en": "The embers glowed faintly in the dying fire.",
      "example_cn": "余烬在渐熄的火焰中微弱地发光。"
    },
    {
      "pos": "verb",
      "explanation_en": "To have a healthy, radiant appearance, especially on the skin, often due to happiness, exertion, or good health.",
      "explanation_cn": "指（尤其是皮肤）呈现出健康、有光泽的外观，常因快乐、运动或良好的健康状况而产生。",
      "example_en": "After her morning run, her face had a natural glow.",
      "example_cn": "晨跑后，她的脸上泛着自然的光泽。"
    },
    {
      "pos": "noun",
      "explanation_en": "A soft, steady light emitted by something, especially when it is warm or glowing from within.",
      "explanation_cn": "指某物发出的柔和、持续的光，尤其当它仿佛从内部发热时。",
      "example_en": "The glow of the lantern guided them through the forest.",
      "example_cn": "灯笼的微光为他们照亮了穿过森林的路。"
    },
    {
      "pos": "noun",
      "explanation_en": "A healthy, radiant appearance, especially of the skin, often associated with vitality or beauty.",
      "explanation_cn": "指一种健康、有光泽的外观，尤其用于形容皮肤，常与活力或美感相关联。",
      "example_en": "Her skin had a radiant glow after the facial treatment.",
      "example_cn": "做完面部护理后，她的皮肤焕发出迷人的光泽。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "shine",
      "analysis": "“Shine”（闪耀）强调明亮、强烈甚至刺眼的光线，可以是反射光或直射光，常用于描述金属、太阳或灯光。而 “glow” 更侧重于柔和、温暖、非刺眼的自发光，通常带有内在能量的意味。"
    },
    {
      "word_to_compare": "radiate",
      "analysis": "“Radiate”（辐射）指从中心向四周扩散能量、光或情感，强调方向性和扩散性，可用于抽象概念（如爱、自信）。而 “glow” 更具体地指视觉上的柔和发光，多用于物理光或皮肤状态，语义范围更窄。"
    },
    {
      "word_to_compare": "illuminate",
      "analysis": "“Illuminate”（照亮）是主动使某物可见的行为，常用于灯光、解释或启发，具有功能性或比喻性。而 “glow” 是物体自身发出的光，是被动状态，不强调对其他事物的照明作用。"
    }
  ]
}