{
  "word": "godfather",
  "pronunciation": "gahd·fah·thər",
  "concise_definition": "n. 教父, 黑手党头目, 有影响力的人物",
  "forms": {
    "plural": "godfathers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A man who sponsors a child at baptism and assumes a spiritual responsibility for the child's religious upbringing, often acting as a mentor or protector.",
      "explanation_cn": "指在洗礼仪式中为婴儿担任教父的男子，承担宗教教育的责任，通常扮演导师或保护者的角色。",
      "example_en": "Her uncle was chosen as her godfather because of his deep faith and wisdom.",
      "example_cn": "她的叔叔因其深厚的信仰和智慧被选为她的教父。"
    },
    {
      "pos": "noun",
      "explanation_en": "A powerful and influential person, especially in organized crime, who controls a criminal organization and exercises authority over others through fear or loyalty.",
      "explanation_cn": "指在有组织犯罪中拥有巨大权力和影响力的人物，通常通过恐惧或忠诚控制犯罪组织，是黑手党家族的首领。",
      "example_en": "The film 'The Godfather' portrays the rise and fall of a powerful mafia family led by Vito Corleone.",
      "example_cn": "电影《教父》描绘了由维托·柯里昂领导的强大黑手党家族的兴衰。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who has a decisive influence in establishing, guiding, or shaping a movement, field, or idea, often regarded as its originator or primary architect.",
      "explanation_cn": "指在创立、指导或塑造某一运动、领域或理念中具有决定性影响的人物，常被视为其开创者或主要设计者。",
      "example_en": "Steve Jobs is often called the godfather of modern personal computing.",
      "example_cn": "史蒂夫·乔布斯常被称为现代个人计算之父。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mentor",
      "analysis": "“Mentor”（导师）强调在职业或个人成长中提供指导、建议和支持，通常是正面、非强制性的关系。而 “godfather” 在非宗教语境中常带有权力、控制甚至胁迫的色彩，尤其在黑手党语境中，其影响力远超普通导师。"
    },
    {
      "word_to_compare": "boss",
      "analysis": "“Boss”（老板）泛指任何层级的上级管理者，中性或日常用语，不必然涉及忠诚、家族或非法体系。而 “godfather” 特指在封闭、等级森严的组织（如黑手党）中拥有绝对权威的领袖，其权力基于血缘、忠诚和恐惧，具有强烈的文化象征意义。"
    },
    {
      "word_to_compare": "patron",
      "analysis": "“Patron”（赞助人）指通过资金或资源支持艺术、文化或个人的资助者，关系通常是经济性的、非控制性的。而 “godfather” 不仅提供支持，更要求服从与回报，其影响力渗透到人身、道德甚至生命层面，带有更深的义务与控制色彩。"
    }
  ]
}