{
  "word": "goku",
  "pronunciation": "goh·koo",
  "concise_definition": "n. 孙悟空（《龙珠》主角）",
  "forms": {
    "plural": "gokus"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The main protagonist of the Japanese manga and anime series Dragon Ball, created by Akira Toriyama. Goku is a Saiyan warrior with extraordinary strength, a pure heart, and an insatiable desire to train and fight stronger opponents. He is known for his iconic spiky black hair, orange gi, and signature moves like the Kamehameha.",
      "explanation_cn": "日本漫画及动画《龙珠》的主角，由鸟山明创作。孙悟空是一名赛亚人战士，拥有超凡的力量、纯真的心灵和对训练与挑战更强对手的无尽渴望。他以标志性的刺状黑发、橙色道服和招牌招式“龟派气功”而闻名。",
      "example_en": "Goku's determination to protect Earth and his friends has made him one of the most beloved characters in anime history.",
      "example_cn": "孙悟空保护地球和朋友的决心，使他成为动漫史上最受喜爱的角色之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A cultural icon representing perseverance, innocence, and the pursuit of self-improvement through hard work and battle. The name 'Goku' (悟空) literally means 'awakened to emptiness' in Chinese, reflecting Buddhist philosophical influences in the character's design.",
      "explanation_cn": "一个文化象征，代表坚持不懈、纯真无邪，以及通过努力与战斗追求自我提升的精神。'Goku'（悟空）在中文中意为‘悟得空性’，体现了角色设计中蕴含的佛教哲学影响。",
      "example_en": "Many fans see Goku not just as a fighter, but as a symbol of never giving up, no matter how impossible the odds.",
      "example_cn": "许多粉丝认为，孙悟空不仅是一个战士，更是一种永不放弃、无论处境多么艰难都坚持到底的象征。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "superman",
      "analysis": "“Superman”（超人）是西方漫画中的理想化英雄，代表正义、道德与神性力量，其力量源于外星血统和道德准则，性格相对严肃。而 “Goku” 更强调成长、战斗乐趣与纯真本性，他的力量来自不断突破极限，而非天生完美，更具人性与亲和力。"
    },
    {
      "word_to_compare": "naruto",
      "analysis": "“Naruto”（鸣人）同样是日本热血动漫主角，强调通过努力赢得认可，与 Goku 的‘为战斗而生’有相似之处。但 Naruto 的核心是‘被孤立后渴望归属’，而 Goku 的动机更单纯——享受战斗、保护所爱之人，缺乏社会认同的焦虑。"
    },
    {
      "word_to_compare": "saitama",
      "analysis": "“Saitama”（埼玉）是《一拳超人》中无敌的主角，其幽默在于‘强大到无聊’，与 Goku 不断追求更强对手、渴望突破极限的奋斗精神形成鲜明对比。Goku 的魅力在于成长过程，而 Saitama 的魅力在于对成长的彻底超越。"
    }
  ]
}