{
  "word": "gothic",
  "pronunciation": "goh·thik",
  "concise_definition": "adj. 哥特式的, 阴森的; n. 哥特人, 哥特语",
  "forms": {
    "comparative": "gothic",
    "superlative": "gothic"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to the architectural style of medieval Europe, characterized by pointed arches, ribbed vaults, flying buttresses, and large stained-glass windows, often evoking a sense of grandeur and mystery.",
      "explanation_cn": "指中世纪欧洲的建筑风格，以尖拱、肋状拱顶、飞扶壁和大型彩绘玻璃窗为特征，常营造出宏伟与神秘的氛围。",
      "example_en": "The cathedral's gothic spires pierced the clouds, a testament to medieval engineering.",
      "example_cn": "这座大教堂的哥特式尖塔直插云霄，是中世纪工程技艺的见证。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by dark, mysterious, and often macabre or supernatural elements, especially in literature, film, or fashion; associated with gloom, decay, and emotional intensity.",
      "explanation_cn": "指在文学、电影或时尚中具有黑暗、神秘，常带恐怖、超自然元素的风格；与阴郁、衰败和强烈情感相关。",
      "example_en": "Her gothic novel featured haunted castles, cursed families, and a brooding protagonist.",
      "example_cn": "她的哥特式小说描绘了闹鬼的城堡、被诅咒的家族和一个忧郁的主人公。"
    },
    {
      "pos": "noun",
      "explanation_en": "A member of a Germanic people who played a major role in the fall of the Western Roman Empire.",
      "explanation_cn": "指日耳曼民族的一支，在西罗马帝国的衰亡中扮演了重要角色。",
      "example_en": "The Visigoths sacked Rome in 410 AD, marking a turning point in ancient history.",
      "example_cn": "西哥特人在公元410年洗劫了罗马，标志着古代历史的一个转折点。"
    },
    {
      "pos": "noun",
      "explanation_en": "The language spoken by the Goths, an East Germanic language known primarily from the 4th-century Bible translation by Bishop Ulfilas.",
      "explanation_cn": "指哥特人所使用的语言，一种东日耳曼语，主要通过乌尔菲拉主教在公元4世纪翻译的《圣经》得以留存。",
      "example_en": "Scholars study gothic to understand the evolution of Germanic languages.",
      "example_cn": "学者研究哥特语以了解日耳曼语系的演变。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "medieval",
      "analysis": "“Medieval”（中世纪的）泛指欧洲中世纪时期（约5至15世纪）的历史、文化或艺术，是一个时间范畴；而 “gothic” 是中世纪晚期的一种特定艺术风格，特指建筑、文学或美学上的表现形式。所有哥特式风格都属于中世纪，但并非所有中世纪风格都是哥特式的。"
    },
    {
      "word_to_compare": "baroque",
      "analysis": "“Baroque”（巴洛克的）是17世纪兴起的艺术风格，强调动感、奢华、戏剧性和繁复装饰，与哥特式的垂直感和神秘感形成对比。哥特风格追求轻盈与神圣，巴洛克则追求力量与感官冲击。两者虽都具宏伟感，但美学理念截然不同。"
    },
    {
      "word_to_compare": "macabre",
      "analysis": "“Macabre”（恐怖的、令人毛骨悚然的）专指与死亡、尸体或暴力相关的令人不安的内容，是哥特风格中常见的元素，但不等同于哥特。哥特风格涵盖建筑、文学、音乐、时尚等多维度，包含美学、哲学与情感氛围，而 “macabre” 仅强调恐怖主题。"
    }
  ]
}