{
  "word": "goth",
  "pronunciation": "goth",
  "concise_definition": "n. 哥特人, 哥特风格爱好者; adj. 哥特的, 阴暗的",
  "forms": {
    "plural": "goths"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who identifies with or is associated with the goth subculture, characterized by dark clothing, makeup, and an interest in themes such as mortality, melancholy, and the supernatural.",
      "explanation_cn": "指认同或隶属于哥特亚文化的人，通常穿着黑色服饰、化浓重妆容，并对死亡、忧郁和超自然等主题表现出浓厚兴趣。",
      "example_en": "She's been part of the goth scene since high school, wearing lace and velvet while listening to post-punk bands.",
      "example_cn": "她从高中起就融入哥特圈，穿着蕾丝与天鹅绒服装，聆听后朋克乐队的音乐。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to the medieval architectural style of Europe, characterized by pointed arches, ribbed vaults, and flying buttresses, or to the aesthetic and cultural movement inspired by it.",
      "explanation_cn": "与欧洲中世纪建筑风格相关的，其特征包括尖拱、肋状拱顶和飞扶壁；或指受其启发的美学与文化运动。",
      "example_en": "The cathedral's gothic arches and stained-glass windows are breathtaking.",
      "example_cn": "这座大教堂的哥特式拱门与彩绘玻璃窗令人叹为观止。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by dark, mysterious, or macabre elements; often used to describe literature, film, or art with a somber, eerie, or romanticized atmosphere.",
      "explanation_cn": "具有阴暗、神秘或恐怖元素的；常用于描述具有忧郁、诡异或浪漫化氛围的文学、电影或艺术作品。",
      "example_en": "The novel has a gothic tone, filled with haunted mansions and forbidden secrets.",
      "example_cn": "这部小说带有哥特风格，充满了闹鬼的庄园与禁忌的秘密。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "gothic",
      "analysis": "“Gothic” 是更正式、更广泛的术语，涵盖建筑、文学、艺术等多个领域，强调历史与美学传统；而 “goth” 作为名词或形容词时，特指现代亚文化群体及其风格，更具当代性和身份认同色彩。两者常可互换，但语境不同。"
    },
    {
      "word_to_compare": "darkwave",
      "analysis": "“Darkwave” 是一种音乐流派，属于哥特音乐的分支，强调合成器与氛围感，通常不涉及视觉风格或生活方式。而 “goth” 不仅是音乐偏好，更是一种包含服饰、审美、哲学态度的完整亚文化体系。"
    },
    {
      "word_to_compare": "emo",
      "analysis": "“Emo”（情绪硬核）虽与哥特风格在服饰上相似（如黑色、瘦削造型），但其核心是表达青少年情感创伤与内省，音乐更偏向流行朋克；而哥特文化更关注死亡、宗教、神秘主义与历史美学，情感基调更冷峻、哲思而非情绪化宣泄。"
    }
  ]
}