{
  "word": "governance",
  "pronunciation": "guv·er·nuhns",
  "concise_definition": "n. 管理, 治理, 统治",
  "forms": {
    "plural": "governances"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The system or process by which an organization, institution, or country is directed, controlled, and held accountable, including the rules, practices, and processes involved in decision-making and implementation.",
      "explanation_cn": "指一个组织、机构或国家进行指导、控制和问责的体系或过程，包括决策与执行所涉及的规则、实践和程序。",
      "example_en": "Good corporate governance ensures transparency and accountability to shareholders.",
      "example_cn": "良好的公司治理确保对股东的透明度和问责制。"
    },
    {
      "pos": "noun",
      "explanation_en": "The manner in which power is exercised in the management of public affairs, especially in the context of political systems, public administration, or international organizations.",
      "explanation_cn": "指在公共事务管理中权力的行使方式，尤其在政治体制、公共行政或国际组织的语境下。",
      "example_en": "The country's governance has improved since the new constitution was adopted.",
      "example_cn": "自新宪法通过以来，该国的治理水平有所提升。"
    },
    {
      "pos": "noun",
      "explanation_en": "The framework of rules, relationships, and processes that guide how authority is exercised and how decisions are made in a community or group.",
      "explanation_cn": "指指导一个社区或群体如何行使权威和做出决策的规则、关系与程序框架。",
      "example_en": "Community governance relies on participatory decision-making and local leadership.",
      "example_cn": "社区治理依赖于参与式决策和地方领导。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "government",
      "analysis": "“Government” (政府) 指具体的执政机构或权力实体，如议会、总统、内阁等，是治理的执行主体；而 “governance” 是一个更广泛的概念，涵盖政府、非政府组织、公民社会和市场机制共同参与的管理过程，强调的是‘如何治理’而非‘谁在治理’。"
    },
    {
      "word_to_compare": "administration",
      "analysis": "“Administration” (行政管理) 侧重于日常事务的执行、操作和管理，如人事、预算、流程等，是治理中的技术性层面；而 “governance” 更关注宏观的制度设计、权力分配、责任机制和合法性基础，具有更强的结构性和规范性。"
    },
    {
      "word_to_compare": "rule",
      "analysis": "“Rule” (规则/统治) 通常指具体的法律、命令或控制行为，可以是单一条文或强制手段；而 “governance” 是一个系统性、动态性的过程，包含规则但不仅限于规则，还涉及协商、参与、透明度和适应性等要素。"
    }
  ]
}