{
  "word": "grace",
  "pronunciation": "grays",
  "concise_definition": "n. 优雅, 恩典, 恩惠; v. 使增色, 使优雅",
  "forms": {
    "plural": "graces",
    "third_person_singular": "graces",
    "past_tense": "graced",
    "past_participle": "graced",
    "present_participle": "gracing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A quality of elegance, poise, and beauty in movement, manner, or appearance, often suggesting effortless refinement and dignity.",
      "explanation_cn": "指在动作、举止或外表中展现出的优雅、从容与美感，常暗示一种自然流露的精致与尊严。",
      "example_en": "She moved across the stage with the grace of a dancer.",
      "example_cn": "她步履轻盈地走过舞台，宛如一位舞者。"
    },
    {
      "pos": "noun",
      "explanation_en": "Divine favor or unmerited kindness, especially in a religious context, given freely without regard to worthiness.",
      "explanation_cn": "指在宗教语境中，上帝所赐予的恩典或无条件的慈爱，不因人的功绩或配得而施予。",
      "example_en": "They believe salvation comes not by works, but by God's grace.",
      "example_cn": "他们相信救赎并非靠行为，而是靠上帝的恩典。"
    },
    {
      "pos": "noun",
      "explanation_en": "A period of extended time allowed for payment, compliance, or action before a penalty or consequence takes effect.",
      "explanation_cn": "指在处罚或后果生效前，被允许延长的宽限期或缓冲时间。",
      "example_en": "The bank granted a three-month grace period before charging late fees.",
      "example_cn": "银行在收取滞纳金前给予了三个月的宽限期。"
    },
    {
      "pos": "verb",
      "explanation_en": "To honor or adorn something by being present or participating, often implying a sense of dignity or prestige brought by the presence.",
      "explanation_cn": "指通过出席或参与来使某事物增色或显得尊贵，常暗示因某人的到来而赋予其荣耀或威望。",
      "example_en": "The president graced the ceremony with his presence.",
      "example_cn": "总统亲临仪式，为活动增添了光彩。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "elegance",
      "analysis": "“Elegance” (优雅) 专指外在形式上的精致与美感，强调审美层面的高雅，常用于服饰、设计或举止。而 “grace” 不仅包含外在的优美，更蕴含内在的从容、自然与精神层面的高贵，适用范围更广，可涵盖道德、宗教与时间维度。"
    },
    {
      "word_to_compare": "mercy",
      "analysis": "“Mercy” (仁慈) 指在有权惩罚或拒绝时选择宽恕，强调对他人过失的怜悯与克制，常与正义相对。而 “grace” 更强调给予本不配得的恩惠，不以对方的悔改或价值为前提，其内涵更具无偿性与超越性。"
    },
    {
      "word_to_compare": "favor",
      "analysis": "“Favor” (偏爱) 指因偏好、关系或利益而给予的特殊待遇，可能带有主观性甚至功利性。而 “grace” 通常不基于任何条件或关系，是纯粹的、无条件的恩赐，尤其在宗教语境中具有神圣性，比 “favor” 更具超越性和无偿性。"
    }
  ]
}