{
  "word": "graduates",
  "pronunciation": "graj·uh·weyts",
  "concise_definition": "n. 毕业生, 毕业生群体; v. 毕业, 授予学位",
  "forms": {
    "singular": "graduate",
    "third_person_singular": "graduates",
    "past_tense": "graduated",
    "past_participle": "graduated",
    "present_participle": "graduating"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who has successfully completed a course of study at a school, college, or university and has been awarded a degree or diploma.",
      "explanation_cn": "指已完成学校、学院或大学的课程学习，并获得学位或文凭的人。",
      "example_en": "The university celebrated its top graduates at the annual commencement ceremony.",
      "example_cn": "大学在年度毕业典礼上表彰了最优秀的毕业生。"
    },
    {
      "pos": "noun",
      "explanation_en": "A collective term referring to all individuals who have graduated from a particular institution or in a specific year.",
      "explanation_cn": "指来自某一特定机构或某一年份的所有毕业生的总称。",
      "example_en": "The alumni association is organizing a reunion for the class of 2020 graduates.",
      "example_cn": "校友协会正在为2020届的毕业生组织一次聚会。"
    },
    {
      "pos": "verb",
      "explanation_en": "To complete a course of study and receive an academic degree or diploma from an educational institution.",
      "explanation_cn": "指完成学业并从教育机构获得学位或文凭。",
      "example_en": "She graduated from Harvard with honors in economics.",
      "example_cn": "她以优异成绩从哈佛大学经济学专业毕业。"
    },
    {
      "pos": "verb",
      "explanation_en": "To formally confer a degree or diploma upon someone upon completion of their studies.",
      "explanation_cn": "指正式授予某人学位或文凭，以认可其完成学业。",
      "example_en": "The university will graduate over 5,000 students this spring.",
      "example_cn": "今年春天，这所大学将授予五千多名学生学位。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "alumni",
      "analysis": "“Alumni”（校友）是复数形式，泛指曾经就读于某校的所有人，无论是否已毕业，也可包括未完成学业者；而 “graduates” 严格限定为已完成学业并获得学位的人。因此，所有毕业生都是校友，但并非所有校友都是毕业生。"
    },
    {
      "word_to_compare": "students",
      "analysis": "“Students”（学生）指正在接受教育的任何人，无论年级或阶段；而 “graduates” 是已完成学业的人，两者处于教育过程的两端。前者强调学习中，后者强调学习完成。"
    },
    {
      "word_to_compare": "diplomates",
      "analysis": "“Diplomates” 并非标准英语词汇，常被误用。正确术语应为 “diploma holders”（持文凭者），它可能包括非学位课程的完成者（如职业培训证书），而 “graduates” 通常特指获得学术学位（学士、硕士、博士）的人。因此，graduates 的学术层级更高、更正式。"
    }
  ]
}