{
  "word": "graft",
  "pronunciation": "graft",
  "concise_definition": "n. 嫁接, 腐败; v. 嫁接, 剥削, 通过不正当手段获取利益",
  "forms": {
    "third_person_singular": "grafts",
    "past_tense": "grafted",
    "past_participle": "grafted",
    "present_participle": "grafting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The surgical procedure of transplanting tissue or an organ from one part of the body or one organism to another, especially in botany or medicine.",
      "explanation_cn": "指在医学或园艺中，将一种植物的枝或芽接到另一种植物的茎或根上，或将人体组织或器官移植到另一部位的外科手术。",
      "example_en": "The horticulturist successfully performed a graft between two varieties of apple trees.",
      "example_cn": "园艺师成功地在两种苹果树之间进行了嫁接。"
    },
    {
      "pos": "noun",
      "explanation_en": "The use of one's position of power or influence to obtain money, favors, or advantages through dishonest or illegal means, especially in politics or public office.",
      "explanation_cn": "指利用职权或影响力，通过不正当或非法手段获取金钱、好处或特权，尤指政治或公共职务中的腐败行为。",
      "example_en": "The mayor was accused of graft after accepting bribes from construction companies.",
      "example_cn": "市长因接受建筑公司的贿赂而被指控贪污腐败。"
    },
    {
      "pos": "verb",
      "explanation_en": "To join or attach one part to another, especially by surgical means or in horticulture, to promote growth or healing.",
      "explanation_cn": "指通过外科手术或园艺手段将一个部分连接到另一个部分，以促进生长或愈合。",
      "example_en": "Doctors grafted skin from the patient's thigh to cover the burn wounds.",
      "example_cn": "医生从患者的大腿取皮移植到烧伤部位。"
    },
    {
      "pos": "verb",
      "explanation_en": "To obtain money, power, or advantage through dishonest or corrupt means, especially by exploiting one's position.",
      "explanation_cn": "指通过不正当或腐败手段获取金钱、权力或利益，尤指利用职务之便进行剥削。",
      "example_en": "Some politicians graft by awarding contracts to friends in exchange for kickbacks.",
      "example_cn": "一些政客通过将合同授予朋友以换取回扣来贪污腐败。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "transplant",
      "analysis": "“Transplant” (移植) 通常指将整个器官、组织或植物从一个地方移到另一个地方，强调位置的转移，常用于医学语境。而 “graft” 更强调将一个部分与另一个部分结合以实现功能整合，尤其在园艺中特指嫁接，且在腐败语境中不可用 “transplant” 替代。"
    },
    {
      "word_to_compare": "corruption",
      "analysis": "“Corruption” (腐败) 是一个更广泛、更抽象的名词，泛指权力滥用、贿赂、贪污等不道德行为。而 “graft” 是 “corruption” 的一种具体形式，特指通过公职谋取私利，带有更强的口语化和政治语境色彩，常用于新闻报道中。"
    },
    {
      "word_to_compare": "bribery",
      "analysis": "“Bribery” (行贿/受贿) 指给予或接受金钱或礼物以影响他人行为，是 “graft” 的一种手段。但 “graft” 不仅包括贿赂，还涵盖合同操纵、裙带关系、挪用公款等系统性腐败行为，范围更广，语义更复杂。"
    }
  ]
}