{
  "word": "graham",
  "pronunciation": "gray·uhm",
  "concise_definition": "n. 格雷厄姆（姓氏/人名）；全麦面粉；全麦饼干",
  "forms": {
    "plural": "grahams"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A surname of English origin, notably associated with individuals such as Nathaniel Graham or the American financier and educator Sylvester Graham.",
      "explanation_cn": "一个源自英语的姓氏，著名人物包括纳撒尼尔·格雷厄姆，或美国金融家与教育家西尔维斯特·格雷厄姆。",
      "example_en": "Sylvester Graham invented the graham cracker in the 19th century to promote a healthy, vegetarian diet.",
      "example_cn": "西尔维斯特·格雷厄姆在19世纪发明了全麦饼干，以推广健康、素食的饮食方式。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of coarse whole-wheat flour, originally developed by Sylvester Graham, used in baking and known for its nutty flavor and high fiber content.",
      "explanation_cn": "一种由西尔维斯特·格雷厄姆开发的粗粒全麦面粉，用于烘焙，以其坚果风味和高纤维含量著称。",
      "example_en": "She substituted regular flour with graham flour to make her bread more nutritious.",
      "example_cn": "她用全麦面粉代替普通面粉，使她的面包更有营养。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sweet, crunchy biscuit made from graham flour, commonly used in making s'mores in North America.",
      "explanation_cn": "一种用全麦面粉制成的甜味酥脆饼干，常用于北美地区制作‘s'mores’（烤棉花糖三明治）。",
      "example_en": "The children toasted marshmallows and sandwiched them between two graham crackers for a classic campfire treat.",
      "example_cn": "孩子们把棉花糖烤热，夹在两片全麦饼干之间，做成经典的露营甜点。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "whole wheat",
      "analysis": "“Whole wheat”（全麦）是一个通用术语，泛指未经精制的整粒小麦及其制品，强调保留麸皮和胚芽的营养成分。而 “graham” 特指由西尔维斯特·格雷厄姆推广的、颗粒较粗、未经碾磨的全麦面粉或其制品，具有特定的历史和文化背景。"
    },
    {
      "word_to_compare": "cracker",
      "analysis": "“Cracker”（饼干）是泛指任何一种薄而脆的烘焙谷物食品，种类繁多，口味多样。而 “graham cracker” 是特指用全麦面粉制成、略带甜味、质地较软的饼干，常用于特定食谱（如s'mores），具有明确的原料和用途限定。"
    },
    {
      "word_to_compare": "surname",
      "analysis": "“Surname”（姓氏）是所有家族姓氏的总称，而 “Graham” 是一个具体的英语姓氏，具有历史渊源和文化认同。作为专有名词，它在语义上不具有普通名词的泛指性，仅在指代人名时使用，与其他含义（如面粉、饼干）无语义关联，需依赖上下文区分。"
    }
  ]
}