{
  "word": "grain",
  "pronunciation": "grān",
  "concise_definition": "n. 谷物, 粒子, 纹理, 木纹; v. 使成颗粒状",
  "forms": {
    "plural": "grains"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small, hard particle or seed, especially of a cereal plant such as wheat, rice, or corn, used as food or animal feed.",
      "explanation_cn": "指一种细小、坚硬的颗粒或种子，尤指小麦、大米或玉米等谷物植物的种子，用作食物或动物饲料。",
      "example_en": "She added a handful of quinoa grains to her salad for extra nutrition.",
      "example_cn": "她往沙拉里加了一把藜麦粒以增加营养。"
    },
    {
      "pos": "noun",
      "explanation_en": "The natural pattern or texture of a material, especially wood, formed by the arrangement of fibers or cells, which affects its appearance and strength.",
      "explanation_cn": "指材料（尤其是木材）因纤维或细胞排列而形成的自然纹理或图案，影响其外观和强度。",
      "example_en": "The antique table had a beautiful mahogany grain that caught the light beautifully.",
      "example_cn": "这张古董桌子有着漂亮的红木纹理，在光线下格外迷人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small amount or trace of something, often used in the phrase 'a grain of' to indicate a minimal quantity.",
      "explanation_cn": "指某物的一点点或微量，常用于短语 'a grain of' 表示极小的数量。",
      "example_en": "There's a grain of truth in what he said, even if the rest is exaggerated.",
      "example_cn": "他说的话中有一点道理，尽管其余部分被夸大了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form or cause to form into small granular particles or to have a granular texture.",
      "explanation_cn": "使形成或导致形成细小颗粒状，或具有颗粒状质地。",
      "example_en": "The salt began to grain after being exposed to moisture for too long.",
      "example_cn": "盐在长时间暴露于湿气后开始结成颗粒。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "seed",
      "analysis": "“Seed” (种子) 专指植物繁殖的器官，具有发芽和生长成新植株的潜力，强调生物学功能。而 “grain” 虽然常指谷物种子，但更侧重于其作为食物或物质颗粒的物理形态，不一定具有繁殖意图。"
    },
    {
      "word_to_compare": "particle",
      "analysis": "“Particle” (微粒) 是一个更广泛的科学术语，泛指任何微小的物质单位，可指尘埃、原子或分子，不具特定形态或来源。而 “grain” 通常指可见的、天然形成的固体颗粒，如谷物或砂粒，具有更具体的物质背景和日常语境。"
    },
    {
      "word_to_compare": "texture",
      "analysis": "“Texture” (质地/纹理) 是一个抽象名词，泛指物体表面的触感或视觉结构，包括光滑、粗糙、颗粒感等。而 “grain” 是一种具体的纹理类型，特指由纤维或颗粒排列形成的线性或条纹状结构，尤其用于木材、石材或金属。"
    }
  ]
}