{
  "word": "grande",
  "pronunciation": "grahn·deh",
  "concise_definition": "adj. 大的, 巨大的; n. (咖啡) 大杯",
  "forms": {
    "comparative": "grander",
    "superlative": "grandest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Of large size, extent, or degree; often used to convey impressiveness, magnificence, or grandeur, especially in artistic, architectural, or descriptive contexts.",
      "explanation_cn": "指尺寸、范围或程度上的巨大，常用于表达宏伟、壮丽或庄严的特质，尤其在艺术、建筑或描述性语境中。",
      "example_en": "The palace features a grand staircase adorned with gold leaf and crystal chandeliers.",
      "example_cn": "这座宫殿拥有宏伟的楼梯，饰以金箔和水晶吊灯。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used in Italian and Spanish to mean 'large' or 'great', often adopted in English to describe size categories, especially in food and beverage contexts.",
      "explanation_cn": "源自意大利语和西班牙语，意为‘大的’或‘伟大的’，在英语中常用于食品和饮料的尺寸分类。",
      "example_en": "I'll have a grande latte with oat milk, please.",
      "example_cn": "请给我一杯大杯燕麦拿铁。"
    },
    {
      "pos": "noun",
      "explanation_en": "A size designation in coffee shops, particularly Starbucks, indicating a larger cup size (typically 16 oz in the U.S.).",
      "explanation_cn": "在咖啡店（尤其是星巴克）中用作尺寸标识，表示较大的杯型（在美国通常为16盎司）。",
      "example_en": "The grande size is the most popular choice among customers who want extra caffeine without upgrading to venti.",
      "example_cn": "大杯是那些想多喝点咖啡因但又不想升级到超大杯的顾客最常选择的尺寸。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "large",
      "analysis": "“Large” 是最通用的表示‘大’的词，适用于几乎所有语境，但缺乏情感色彩或庄严感。而 “grande” 常带有审美或文化上的优越感，尤其在餐饮和设计领域，暗示一种精致或高端的‘大’。"
    },
    {
      "word_to_compare": "gigantic",
      "analysis": "“Gigantic” 强调极端的巨大，常带有夸张或戏剧性色彩，多用于非正式语境或强调超常规模。而 “grande” 更温和、优雅，常用于标准化尺寸（如咖啡杯）或艺术描述，不强调夸张，而强调品质与规模的统一。"
    },
    {
      "word_to_compare": "magnificent",
      "analysis": "“Magnificent” 强调视觉或情感上的壮丽、辉煌，侧重于美感和震撼力，而 “grande” 更侧重于物理尺寸或标准化分类。一个建筑可以是 magnificent（壮丽的），但不一定被称作 grande；而一个咖啡杯是 grande，但未必是 magnificent。"
    }
  ]
}