{
  "word": "grant",
  "pronunciation": "grant",
  "concise_definition": "v. 授予, 同意, 许可; n. 拨款, 授予物",
  "forms": {
    "third_person_singular": "grants",
    "past_tense": "granted",
    "past_participle": "granted",
    "present_participle": "granting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To officially give or allow something, especially a right, privilege, or permission, often by an authority or institution.",
      "explanation_cn": "指由权威机构或个人正式给予某人某项权利、特权或许可。",
      "example_en": "The government granted the company a license to operate in the region.",
      "example_cn": "政府授予该公司在该地区运营的许可证。"
    },
    {
      "pos": "verb",
      "explanation_en": "To admit or acknowledge something, often reluctantly or as a concession, especially in an argument or discussion.",
      "explanation_cn": "指在争论或讨论中勉强承认或认可某事，通常作为让步。",
      "example_en": "I grant that your point is valid, but it doesn't change the overall outcome.",
      "example_cn": "我承认你的观点是合理的，但这并不会改变整体结果。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sum of money or other resources officially given by a government, organization, or individual to support a specific purpose, such as research, education, or community projects.",
      "explanation_cn": "指由政府、组织或个人正式拨付的一笔资金或其他资源，用于支持特定目的，如研究、教育或社区项目。",
      "example_en": "She received a research grant from the National Science Foundation to study climate change.",
      "example_cn": "她获得了国家科学基金会的一项研究拨款，用于研究气候变化。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "give",
      "analysis": "“Give” (给予) 是最通用的词，泛指任何形式的交付或转让，可以是物质的、情感的或抽象的，不带有正式性或权威性。而 “grant” 强调由权威方正式、有意识地赋予某种权利、许可或资源，通常具有制度性或法律性。"
    },
    {
      "word_to_compare": "award",
      "analysis": "“Award” (授予) 通常用于表彰成就或胜出者，如奖项、荣誉或奖金，带有奖励和认可的意味。而 “grant” 更侧重于提供资源或权限以支持某项活动或需求，不一定与成就相关，更多是基于申请或需求的分配。"
    },
    {
      "word_to_compare": "concede",
      "analysis": "“Concede” (让步) 与 “grant” 在‘承认’义项上部分重叠，但 “concede” 更强调在争论中被迫或不情愿地承认对方观点，常含妥协或失败的意味。而 “grant” 在此语境下语气更中性，甚至可表示理性认可，不一定带有被迫感。"
    }
  ]
}