{
  "word": "grappling",
  "pronunciation": "grap·ling",
  "concise_definition": "adj. 抓握的, 摔跤的; n. 摔跤, 抓斗, 挣扎",
  "forms": {
    "base_form": "grapple",
    "present_participle": "grappling",
    "past_tense": "grappled",
    "past_participle": "grappled"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or involving close physical struggle or wrestling, especially in combat sports like judo or wrestling.",
      "explanation_cn": "与近距离身体搏斗或摔跤相关的，尤其指柔道、摔跤等格斗运动中的对抗。",
      "example_en": "The grappling match between the two champions lasted over ten minutes.",
      "example_cn": "两位冠军之间的摔跤比赛持续了十分钟以上。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of struggling or fighting closely, often with hands or arms, to gain control or overcome resistance.",
      "explanation_cn": "指用手臂或双手进行近距离搏斗，以获得控制权或克服阻力的行为。",
      "example_en": "He was engaged in a fierce grappling with the intruder before the police arrived.",
      "example_cn": "警察到达前，他正与入侵者激烈搏斗。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device or tool used for grabbing or holding, especially in construction or maritime contexts (e.g., a grappling hook).",
      "explanation_cn": "一种用于抓取或固定的装置，尤其在建筑或航海语境中（如抓钩）。",
      "example_en": "The sailors threw a grappling hook to secure the boat to the dock.",
      "example_cn": "水手们抛出抓钩，将船固定在码头上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A mental or emotional struggle to understand, accept, or deal with a difficult issue or idea.",
      "explanation_cn": "指在心理或情感上为理解、接受或应对一个困难问题或观念而进行的挣扎。",
      "example_en": "Her book is a profound exploration of grappling with grief after loss.",
      "example_cn": "她的书深刻探讨了在失去亲人后如何与悲痛抗争。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "wrestling",
      "analysis": "“Wrestling” (摔跤) 是一种有规则的体育运动，强调技术性对抗和竞技性，通常在特定场地和规则下进行。而 “grappling” 更广泛，可指任何近距离的身体缠斗，包括无规则的搏斗或非竞技场景，如自卫或军事格斗。"
    },
    {
      "word_to_compare": "struggling",
      "analysis": "“Struggling” (挣扎) 是一个更通用的词，可指体力、情感或智力上的任何艰难努力，不一定涉及身体接触。而 “grappling” 特指通过直接接触或物理对抗来应对困难，常带有强烈的肢体互动意味。"
    },
    {
      "word_to_compare": "clutching",
      "analysis": "“Clutching” (紧握) 指用手紧紧抓住某物，通常是被动或恐惧下的反应，不包含对抗或控制意图。而 “grappling” 强调主动的、动态的、有目的的争夺或控制，常伴随力量对抗。"
    }
  ]
}