{
  "word": "grassroots",
  "pronunciation": "gras·rootz",
  "concise_definition": "adj. 基层的, 民间的; n. 基层民众, 基础运动",
  "forms": {
    "plural": "grassroots"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or originating from the ordinary people of a community, rather than from official or elite institutions; characterized by bottom-up participation and local engagement.",
      "explanation_cn": "指源于普通民众、而非来自官方或精英机构的；强调自下而上的参与和地方性互动。",
      "example_en": "The campaign relied on grassroots support to raise awareness about climate change.",
      "example_cn": "这场运动依靠基层支持来提高人们对气候变化的认识。"
    },
    {
      "pos": "noun",
      "explanation_en": "The ordinary members of a community or organization, especially those who form the foundation of a movement or political effort; the base level of social or political activity.",
      "explanation_cn": "指一个社区或组织中的普通成员，尤其是构成运动或政治努力基础的群体；社会或政治活动的底层基础。",
      "example_en": "The party is trying to strengthen its connection with the grassroots.",
      "example_cn": "该政党正努力加强与基层民众的联系。"
    },
    {
      "pos": "noun",
      "explanation_en": "A political or social movement that arises spontaneously from the local population, often without formal leadership or funding from large organizations.",
      "explanation_cn": "指由当地民众自发兴起的政治或社会运动，通常没有大型组织的正式领导或资金支持。",
      "example_en": "The environmental grassroots movement began with neighborhood clean-up efforts.",
      "example_cn": "这个环保基层运动始于社区的清洁行动。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "popular",
      "analysis": "“Popular”（流行的、受欢迎的）强调被多数人喜爱或接受，但不一定涉及组织性或自下而上的行动。它可以是商业营销的结果，而 “grassroots” 强调的是自发、本地、非官方的集体行动。"
    },
    {
      "word_to_compare": "local",
      "analysis": "“Local”（地方的）仅指地理范围上的邻近性，如本地商店、本地新闻。而 “grassroots” 不仅指地域性，更强调由该地区普通民众主动发起和参与的运动或力量，具有社会动员的内涵。"
    },
    {
      "word_to_compare": "bottom-up",
      "analysis": "“Bottom-up”（自下而上的）是描述一种组织或决策方式的形容词，常作为 “grassroots” 的同义表达。但 “grassroots” 是一个更丰富、更具文化内涵的名词，包含情感、身份和集体行动的维度，而 “bottom-up” 更偏向方法论描述。"
    }
  ]
}