{
  "word": "grasses",
  "pronunciation": "gras·iz",
  "concise_definition": "n. 草, 草本植物, 草地",
  "forms": {
    "singular": "grass"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Plants of the family Poaceae, characterized by narrow leaves, hollow stems, and small flowers arranged in spikes or panicles; commonly found in lawns, meadows, and pastures.",
      "explanation_cn": "属于禾本科的植物，特征为窄叶、中空茎干，花小且呈穗状或圆锥花序；常见于草坪、草地和牧场。",
      "example_en": "The cattle grazed peacefully on the green grasses of the open field.",
      "example_cn": "牛群在开阔田野的绿草上安静地吃草。"
    },
    {
      "pos": "noun",
      "explanation_en": "A collective term for various types of herbaceous plants that form the dominant vegetation in many ecosystems, including turf, cereal crops, and bamboo.",
      "explanation_cn": "泛指在许多生态系统中占主导地位的多种草本植物，包括草坪草、谷物作物和竹子。",
      "example_en": "Scientists study grasses to understand their role in carbon sequestration and soil stabilization.",
      "example_cn": "科学家研究草类植物，以了解它们在固碳和土壤稳定中的作用。"
    },
    {
      "pos": "noun",
      "explanation_en": "Used metaphorically to refer to something insignificant or easily overlooked, especially in plural form (e.g., 'the grasses of daily life').",
      "explanation_cn": "比喻用法，指微不足道或易被忽视的事物，尤其在复数形式中（如‘日常生活中的草芥’）。",
      "example_en": "He paid no attention to the grasses of minor details; he focused only on the big picture.",
      "example_cn": "他对那些琐碎的细节毫不在意，只关注大局。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "herbs",
      "analysis": "“Herbs”（草本植物）通常指具有药用、调味或芳香价值的植物，多为非木本，但不一定属于禾本科；而 “grasses” 专指禾本科植物，主要功能是覆盖地表、提供饲料或用于园艺，一般不用于烹饪或药用。"
    },
    {
      "word_to_compare": "weeds",
      "analysis": "“Weeds”（杂草）是贬义词，指在不希望出现的地方生长的植物，可能包括草类，但也包括阔叶植物；而 “grasses” 是中性术语，仅描述植物类别，不带有价值判断。一株草可能是草，也可能是杂草，取决于语境。"
    },
    {
      "word_to_compare": "sedges",
      "analysis": "“Sedges”（莎草）外形与草相似，但茎干为三棱形而非中空，属于莎草科，常生长在湿地；而 “grasses” 的茎为中空、节明显，属于禾本科。两者在植物学上是不同类群，常被混淆但结构有本质区别。"
    }
  ]
}