{
  "word": "grasping",
  "pronunciation": "gras·ping",
  "concise_definition": "adj. 贪婪的, 爱占便宜的; v. 抓住, 理解 (grasp 的现在分词)",
  "forms": {
    "base_form": "grasp",
    "third_person_singular": "grasps",
    "past_tense": "grasped",
    "past_participle": "grasped",
    "present_participle": "grasping"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Characterized by excessive greed or a strong desire to acquire wealth, possessions, or advantage, often at the expense of others.",
      "explanation_cn": "形容一个人贪婪成性，极度渴望获取财富、财物或利益，常常以牺牲他人为代价。",
      "example_en": "The grasping landlord raised the rent by 50% despite the tenants' financial struggles.",
      "example_cn": "这个贪婪的房东不顾租户的经济困难，将租金提高了50%。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing someone who is overly eager to seize opportunities, often in a selfish or unscrupulous way.",
      "explanation_cn": "形容某人过于急切地抓住机会，常带有自私或不择手段的意味。",
      "example_en": "His grasping nature made him unpopular among colleagues who valued fairness.",
      "example_cn": "他贪婪的本性使他在重视公平的同事中很不受欢迎。"
    },
    {
      "pos": "verb",
      "explanation_en": "To physically seize or hold something tightly with the hand.",
      "explanation_cn": "指用手紧紧抓住或握住某物。",
      "example_en": "She was grasping the railing as the bus lurched forward.",
      "example_cn": "公共汽车突然前冲时，她紧紧抓住扶手。"
    },
    {
      "pos": "verb",
      "explanation_en": "To understand or comprehend something mentally, especially something complex or abstract.",
      "explanation_cn": "指在心理上理解或领会某事物，尤指复杂或抽象的概念。",
      "example_en": "It took her a while to grasp the theoretical concepts in quantum physics.",
      "example_cn": "她花了一段时间才理解量子物理中的理论概念。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "greedy",
      "analysis": "“Greedy” (贪婪的) 是一个更通用的形容词，泛指对物质、权力或利益的强烈欲望，语气中性偏贬义。而 “grasping” 更强调一种主动、算计、甚至卑劣地攫取的行为，带有更强的道德谴责色彩，常用于描述性格缺陷。"
    },
    {
      "word_to_compare": "seizing",
      "analysis": "“Seizing” (抓住/夺取) 强调动作的突然性和强制性，常用于物理或政治层面的夺取（如 seizing power）。而 “grasping” 作为动词时，既可以指物理上的紧握，也可指心理上的理解，语义范围更广；作为形容词时，它特指性格上的贪婪，而 “seizing” 无此用法。"
    },
    {
      "word_to_compare": "comprehending",
      "analysis": "“Comprehending” (理解) 是一个更正式、中性的动词，专指心智上对复杂信息的掌握，强调认知过程的完整性。而 “grasping” 在此语境下更口语化，常暗示理解的过程是艰难的、突然的或不完全的，如 “just grasping the basics”。"
    }
  ]
}