{
  "word": "grated",
  "pronunciation": "gray·tɪd",
  "concise_definition": "adj. 磨碎的, 刨碎的; v. 磨碎, 刨碎 (grate 的过去式和过去分词)",
  "forms": {
    "base_form": "grate",
    "present_participle": "grating",
    "past_tense": "grated",
    "past_participle": "grated",
    "third_person_singular": "grates"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing food (especially cheese, vegetables, or chocolate) that has been reduced to small particles by rubbing it against a rough surface, such as a grater.",
      "explanation_cn": "指通过将食物（尤其是奶酪、蔬菜或巧克力）在粗糙表面（如擦丝器）上摩擦而变成细小颗粒的状态。",
      "example_en": "She sprinkled grated parmesan over the pasta.",
      "example_cn": "她在意大利面上撒了一些磨碎的帕玛森奶酪。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reduce something into small pieces by rubbing it against a rough, ridged surface, typically using a kitchen tool called a grater.",
      "explanation_cn": "指使用擦丝器等工具，通过在粗糙、有齿的表面上摩擦，将某物（如奶酪、胡萝卜）磨成细小碎屑。",
      "example_en": "He grated the carrot finely to add it to the cake batter.",
      "example_cn": "他把胡萝卜磨得很细，加入蛋糕糊中。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a harsh, scraping sound by rubbing rough surfaces together; often used metaphorically to describe an unpleasant or irritating noise.",
      "explanation_cn": "指粗糙表面相互摩擦时发出刺耳、刮擦的声响；常用于比喻令人不快或刺耳的声音。",
      "example_en": "The old door grated on its hinges as it opened.",
      "example_cn": "旧门在打开时，铰链发出刺耳的摩擦声。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "shredded",
      "analysis": "“Shredded”（撕碎的）通常指通过切割或拉扯将物体（如纸张、肉类或奶酪）变成细长条状，强调的是纵向的分离；而 “grated” 强调通过摩擦产生细小颗粒，形状更不规则、更微小，常用于硬质食材的处理。"
    },
    {
      "word_to_compare": "minced",
      "analysis": "“Minced”（剁碎的）指用刀反复切碎，形成细小但不均匀的碎块，常见于肉类或香料；而 “grated” 是通过物理摩擦实现的，颗粒更均匀、更细腻，通常用于较硬的食材，如奶酪或柠檬皮。"
    },
    {
      "word_to_compare": "scratched",
      "analysis": "“Scratched”（划伤的）指表面被尖锐物体划出痕迹，通常指损伤或标记，不涉及物质被去除或转化为颗粒；而 “grated” 涉及物质被主动去除并转化为可食用或可用的碎屑，具有功能性目的。"
    }
  ]
}