{
  "word": "grazing",
  "pronunciation": "gray·zing",
  "concise_definition": "v. 放牧, 啃食, 轻食; n. 放牧, 啃食行为",
  "forms": {
    "third_person_singular": "grazes",
    "past_tense": "grazed",
    "past_participle": "grazed",
    "present_participle": "grazing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To feed on grass or other low-growing vegetation, typically by animals such as cattle, sheep, or deer, moving slowly while eating.",
      "explanation_cn": "指动物（如牛、羊、鹿）缓慢移动，以草或其他低矮植被为食的行为。",
      "example_en": "The cows were grazing peacefully in the meadow as the sun set.",
      "example_cn": "夕阳西下时，奶牛们在草地上安静地吃草。"
    },
    {
      "pos": "verb",
      "explanation_en": "To eat small amounts of food intermittently throughout the day, rather than having full meals; often used to describe casual or light eating habits.",
      "explanation_cn": "指一天中不规律地吃少量食物，而不是吃正餐；常用于描述随意或轻食的饮食习惯。",
      "example_en": "She prefers grazing on fruits and nuts rather than sitting down for a big lunch.",
      "example_cn": "她更喜欢时不时吃点水果和坚果，而不是坐下来吃一顿大午餐。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or practice of animals feeding on pasture grasses or other vegetation; often refers to a designated area for this activity.",
      "explanation_cn": "指动物在牧场或草地进食的行为或习惯；也可指专用于放牧的区域。",
      "example_en": "The ranch relies on seasonal grazing to maintain its livestock without supplemental feed.",
      "example_cn": "这个牧场依靠季节性放牧来饲养牲畜，无需额外喂食。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "browsing",
      "analysis": "“Browsing”（觅食）通常指动物（如鹿、长颈鹿）吃高处的树叶、嫩枝或灌木，强调选择性地取食非草本植物；而 “grazing” 更侧重于吃地面附近的草本植物，动作更连续、范围更广。"
    },
    {
      "word_to_compare": "snacking",
      "analysis": "“Snacking”（吃零食）是人类在正餐之间吃少量食物的行为，强调非正式、随意的进食习惯；“grazing” 作为动词时虽可指人类轻食，但更常用于动物行为，且隐含持续、缓慢进食的生理特征，而 “snacking” 更具主观性和文化性。"
    },
    {
      "word_to_compare": "pasturing",
      "analysis": "“Pasturing”（放牧）是管理牲畜在草地上吃草的系统性行为，强调人为安排和土地使用；而 “grazing” 是牲畜自身的进食行为，是 “pasturing” 的核心组成部分，但不包含管理或规划的含义。"
    }
  ]
}