{
  "word": "grease",
  "pronunciation": "grees",
  "concise_definition": "n. 润滑油, 脂肪; v. 涂油, 贿赂",
  "forms": {
    "third_person_singular": "greases",
    "past_tense": "greased",
    "past_participle": "greased",
    "present_participle": "greasing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A thick, oily substance used to reduce friction between moving parts, especially in machinery or vehicles.",
      "explanation_cn": "一种用于减少机械或车辆中运动部件间摩擦的粘稠油性物质。",
      "example_en": "The mechanic applied grease to the bicycle chain to make it run smoothly.",
      "example_cn": "机械师在自行车链条上涂了润滑油，使其运转更顺畅。"
    },
    {
      "pos": "noun",
      "explanation_en": "Animal fat, especially when rendered and used in cooking or food preparation.",
      "explanation_cn": "动物脂肪，尤其是经过提炼后用于烹饪或食品制备的脂肪。",
      "example_en": "The recipe calls for a tablespoon of bacon grease to add flavor.",
      "example_cn": "这个食谱要求加入一汤匙培根油脂来增添风味。"
    },
    {
      "pos": "verb",
      "explanation_en": "To apply grease or oil to a surface or mechanism to reduce friction or ensure smooth operation.",
      "explanation_cn": "在表面或机械装置上涂抹油脂，以减少摩擦或确保顺畅运行。",
      "example_en": "They greased the hinges so the door would open without squeaking.",
      "example_cn": "他们给铰链上了油，使门开关时不再吱呀作响。"
    },
    {
      "pos": "verb",
      "explanation_en": "To bribe someone, especially by offering money or favors, to influence their actions or decisions.",
      "explanation_cn": "通过提供金钱或好处来贿赂某人，以影响其行为或决定（常用于非正式语境）。",
      "example_en": "The contractor was accused of greasing officials to win the public contract.",
      "example_cn": "该承包商被指控贿赂官员以赢得公共合同。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "oil",
      "analysis": "“Oil”（油）是更广泛的术语，泛指任何液态润滑剂，包括植物油、矿物油等，通常流动性强、质地较稀。而 “grease” 特指粘稠、半固态的润滑剂，常用于需要持久附着的机械部位。两者在物理形态和应用场景上有明显区别。"
    },
    {
      "word_to_compare": "lubricant",
      "analysis": "“Lubricant”（润滑剂）是技术性术语，涵盖所有减少摩擦的物质，包括油、油脂、固体润滑剂等，属于上位概念。而 “grease” 是润滑剂的一种具体类型，特指膏状或半固态的润滑剂，语义更具体、更口语化。"
    },
    {
      "word_to_compare": "bribe",
      "analysis": "“Bribe”（贿赂）是正式法律术语，指以金钱或利益换取不当行为，语义中性偏负面，常用于书面语和法律语境。而 “grease” 作为动词使用时，是俚语化表达，语气更轻、更口语化，常暗示小额贿赂或‘疏通关系’，带有非正式甚至黑色幽默色彩。"
    }
  ]
}