{
  "word": "greek",
  "pronunciation": "greek",
  "concise_definition": "n. 希腊人, 希腊语; adj. 希腊的, 希腊语的",
  "forms": {
    "plural": "Greeks"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A native or inhabitant of Greece, or a person of Greek descent; also refers collectively to the people of ancient Greece.",
      "explanation_cn": "指希腊的原住民或居民，或具有希腊血统的人；也可泛指古希腊人。",
      "example_en": "The ancient Greeks made groundbreaking contributions to philosophy, democracy, and art.",
      "example_cn": "古希腊人对哲学、民主和艺术作出了开创性的贡献。"
    },
    {
      "pos": "noun",
      "explanation_en": "The modern or ancient language spoken in Greece, known for its rich literary and historical tradition.",
      "explanation_cn": "指在希腊使用的现代或古代语言，以其丰富的文学和历史传统而著称。",
      "example_en": "She studied Greek in college to read Homer’s epics in the original.",
      "example_cn": "她大学时学习希腊语，以便阅读荷马史诗的原文。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to Greece, its people, language, or culture; often used to describe classical antiquity, architecture, or mythology.",
      "explanation_cn": "与希腊、其人民、语言或文化相关的；常用于描述古典时代、建筑或神话。",
      "example_en": "The temple features classic Greek columns with fluted shafts and ornate capitals.",
      "example_cn": "这座神庙具有典型的希腊柱式，柱身有凹槽，柱头装饰精美。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used figuratively to describe something that is incomprehensible or unintelligible, as in the phrase 'it's all Greek to me'.",
      "explanation_cn": "用于比喻意义上，形容某事物难以理解或无法明白，如短语 'it's all Greek to me'（对我来说全是天书）。",
      "example_en": "The technical manual was so complex that the instructions were just Greek to him.",
      "example_cn": "这份技术手册太复杂了，那些说明对他来说全是天书。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "latin",
      "analysis": "“Latin”（拉丁语/拉丁的）与 “Greek” 类似，都指古代文明的语言和文化，但拉丁语是罗马帝国的官方语言，影响了罗曼语族（如法语、西班牙语）和法律、科学术语体系；而希腊语则更深刻地影响了哲学、数学、医学和西方文学的根基。两者常并列出现，但文化侧重不同。"
    },
    {
      "word_to_compare": "ancient",
      "analysis": "“Ancient”（古代的）是一个泛指时间的形容词，可修饰任何古老文明（如埃及、美索不达米亚）；而 “Greek” 是一个具体的民族/语言标签，特指希腊文明。虽然 “ancient Greek” 是常见搭配，但 “ancient” 本身不具文化专属性。"
    },
    {
      "word_to_compare": "hellenic",
      "analysis": "“Hellenic”（希腊的，希腊语的）是 “Greek” 的更正式、学术化的同义词，常用于历史、考古和语言学语境中，特指古希腊文化与语言；而 “Greek” 更通用，可用于现代语境（如现代希腊语、希腊人）。两者在指代古代时可互换，但 “Hellenic” 不用于指现代国家或日常事物。"
    }
  ]
}