{
  "word": "grill",
  "pronunciation": "gril",
  "concise_definition": "v. 烧烤, 严加盘问; n. 烤架, 烧烤架",
  "forms": {
    "third_person_singular": "grills",
    "past_tense": "grilled",
    "past_participle": "grilled",
    "present_participle": "grilling"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To cook food, especially meat or vegetables, on a grill over direct heat, typically using charcoal, gas, or electricity.",
      "explanation_cn": "指将食物（尤其是肉类或蔬菜）放在烤架上，用明火（如木炭、煤气或电）直接加热烹制。",
      "example_en": "We grilled steaks and corn on the cob for our backyard barbecue.",
      "example_cn": "我们在后院烧烤时烤了牛排和玉米棒。"
    },
    {
      "pos": "verb",
      "explanation_en": "To question someone intensely and persistently, often in an aggressive or hostile manner, especially to extract information.",
      "explanation_cn": "指以强烈而持续的方式盘问某人，通常带有攻击性或敌意，目的是获取信息。",
      "example_en": "The detective grilled the suspect for hours until he confessed.",
      "example_cn": "侦探对嫌疑人进行了数小时的严词盘问，直到他招供。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device consisting of a metal frame or grid over which food is cooked by direct heat, commonly used outdoors for barbecuing.",
      "explanation_cn": "一种由金属框架或网格构成的器具，食物置于其上通过直接加热烹制，常用于户外烧烤。",
      "example_en": "He cleaned the grill after the party to prevent grease buildup.",
      "example_cn": "派对结束后，他清理了烤架，以防止油脂堆积。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of restaurant or counter where food is cooked and served on a grill, often with a casual, open-kitchen style.",
      "explanation_cn": "一种餐厅或柜台，食物在烤架上现做现卖，通常采用休闲、开放式厨房的风格。",
      "example_en": "We had dinner at a local grill that specializes in burgers and ribs.",
      "example_cn": "我们在一家专营汉堡和肋排的本地烤架餐厅吃了晚饭。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "barbecue",
      "analysis": "“Barbecue”（烧烤）通常指一种烹饪方式或社交活动，强调慢火熏烤和风味调味，常用于指代整个过程或聚会；而 “grill” 更侧重于使用烤架进行直接高温加热的烹饪动作，也可指具体的设备。两者常互换，但 “grill” 更技术性，而 “barbecue” 更文化性。"
    },
    {
      "word_to_compare": "interrogate",
      "analysis": "“Interrogate”（审问）是正式法律或调查语境中对嫌疑人进行系统性提问的术语，语气中性或专业；而 “grill” 在此义项下带有更强的情绪色彩，暗示压迫性、激烈甚至咄咄逼人的盘问，更具口语化和情感张力。"
    },
    {
      "word_to_compare": "broil",
      "analysis": "“Broil”（炙烤）指在烤箱中用上方的高温热源直接加热食物，通常用于室内烹饪；而 “grill” 强调从下方或外部的明火加热，多用于户外。两者都是直接加热，但热源方向和使用场景不同。"
    }
  ]
}