{
  "word": "grilling",
  "pronunciation": "gril·ing",
  "concise_definition": "n. 烧烤, 烤制; v. 烧烤, 严厉盘问",
  "forms": {
    "base_form": "grill",
    "third_person_singular": "grills",
    "past_tense": "grilled",
    "past_participle": "grilled",
    "present_participle": "grilling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The method of cooking food directly over high heat, typically on a metal grate, which imparts a charred flavor and distinct grill marks.",
      "explanation_cn": "指将食物直接放在金属网格上用高温烘烤的烹饪方法，能赋予食物焦香风味和明显的烧烤印记。",
      "example_en": "We spent the evening enjoying a backyard grilling with friends and fresh vegetables.",
      "example_cn": "我们整个晚上都在后院与朋友一起享受烧烤和新鲜蔬菜。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cook food on a grill over direct heat, often resulting in a seared exterior and juicy interior.",
      "explanation_cn": "指在烤架上用直接高温烹煮食物，通常使外皮焦香、内部多汁。",
      "example_en": "He grilled salmon for dinner, seasoning it with lemon and herbs.",
      "example_cn": "他为晚餐烤了三文鱼，用柠檬和香草调味。"
    },
    {
      "pos": "verb",
      "explanation_en": "To question someone intensely and persistently, often in an aggressive or confrontational manner, especially to extract information or force accountability.",
      "explanation_cn": "指以强烈而持续的方式盘问某人，通常带有攻击性或对抗性，旨在获取信息或迫使其承担责任。",
      "example_en": "The journalist grilled the politician for over an hour about the corruption scandal.",
      "example_cn": "记者就腐败丑闻对这位政客进行了长达一小时的严厉质询。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "barbecuing",
      "analysis": "“Barbecuing”（烧烤）通常指在较低温度下长时间慢烤，常使用烟熏风味，多用于肉类如猪肋排；而 “grilling” 强调高温快速烹制，适合牛排、鸡肉或蔬菜，时间短、火候猛。两者虽常被混用，但烹饪方式和风味有明显区别。"
    },
    {
      "word_to_compare": "roasting",
      "analysis": "“Roasting”（烘烤）一般在烤箱中进行，通过环绕热空气均匀加热食物，适合整只禽类或根茎类蔬菜；而 “grilling” 是直接接触热源，产生焦化反应和烟熏味，更强调外皮的脆感和风味集中。"
    },
    {
      "word_to_compare": "interrogating",
      "analysis": "“Interrogating”（审讯）是法律或正式语境中系统性、程序化的提问，常伴随记录和法律后果；而 “grilling” 在比喻义中更口语化、情绪化，强调压迫感和密集追问，不一定有正式程序，但更具情感张力。"
    }
  ]
}