{
  "word": "grinder",
  "pronunciation": "grin·duhr",
  "concise_definition": "n. 磨床, 磨碎机, 爱磨蹭的人, 拼命工作的人",
  "forms": {
    "plural": "grinders"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A machine or device that grinds, crushes, or pulverizes materials such as coffee beans, spices, or metal, using rotating abrasive surfaces or blades.",
      "explanation_cn": "一种使用旋转的研磨表面或刀片将咖啡豆、香料或金属等材料研磨、压碎或粉碎的机器或装置。",
      "example_en": "She uses a coffee grinder to freshly grind beans every morning.",
      "example_cn": "她每天早上都用咖啡磨豆机现磨咖啡豆。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who works hard, often at tedious or repetitive tasks, especially in a demanding or low-status job.",
      "explanation_cn": "指勤奋工作、尤其从事枯燥或重复性任务的人，常用于形容在繁重或低地位工作中拼命劳作的人。",
      "example_en": "He’s a real grinder—shows up early, stays late, and never complains.",
      "example_cn": "他真是个拼命三郎——早来晚走，从不抱怨。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is slow, persistent, or overly meticulous in doing something, often to the point of being tedious.",
      "explanation_cn": "指做事缓慢、执着或过于细致的人，有时达到令人厌烦的程度。",
      "example_en": "Don’t be such a grinder—just pick one option and move on.",
      "example_cn": "别这么磨蹭了，选一个选项然后继续吧。"
    },
    {
      "pos": "noun",
      "explanation_en": "In ice hockey, a player who focuses on physical play, forechecking, and disrupting opponents rather than scoring goals.",
      "explanation_cn": "在冰球运动中，指专注于身体对抗、前场压迫和干扰对手，而非主要得分的球员。",
      "example_en": "The team’s grinder was key in winning the puck battles along the boards.",
      "example_cn": "球队的这位拼抢型球员在边线争球中发挥了关键作用。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mill",
      "analysis": "“Mill”（磨坊/磨机）通常指用于研磨谷物或矿石的大型工业设备，语义更偏向传统或工业场景；而 “grinder” 更常用于小型家用或专业设备（如咖啡磨豆机），也更广泛用于比喻义，如形容人。"
    },
    {
      "word_to_compare": "worker",
      "analysis": "“Worker”（工作者）是泛指从事任何工作的人员，中性无褒贬；而 “grinder” 特指那些从事艰苦、重复或低回报工作的人，带有强烈的努力、耐力甚至牺牲的色彩，语义更具体且情感更浓。"
    },
    {
      "word_to_compare": "drudge",
      "analysis": "“Drudge”（苦工）与 “grinder” 非常接近，都形容做枯燥工作的人，但 “drudge” 更强调工作的单调、无趣和令人厌倦，常含贬义；而 “grinder” 可以是褒义（如敬佩其毅力）或中性，尤其在体育或职场语境中。"
    }
  ]
}