{
  "word": "grind",
  "pronunciation": "grahynd",
  "concise_definition": "v. 磨碎, 磨损, 苦干; n. 磨碎, 苦差事",
  "forms": {
    "third_person_singular": "grinds",
    "past_tense": "ground",
    "past_participle": "ground",
    "present_participle": "grinding"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To crush or reduce something to small particles by rubbing it against a hard surface, often using a machine or tool.",
      "explanation_cn": "指通过摩擦硬表面（通常使用机器或工具）将某物碾碎成细小颗粒。",
      "example_en": "She ground the coffee beans into a fine powder for the espresso.",
      "example_cn": "她把咖啡豆磨成细粉，用来制作意式浓缩咖啡。"
    },
    {
      "pos": "verb",
      "explanation_en": "To wear down or erode something gradually through continuous friction or pressure.",
      "explanation_cn": "指通过持续的摩擦或压力逐渐磨损或侵蚀某物。",
      "example_en": "The constant flow of water has ground the rocks smooth over centuries.",
      "example_cn": "几个世纪以来，持续的水流将岩石磨得光滑。"
    },
    {
      "pos": "verb",
      "explanation_en": "To work hard and persistently, often in a monotonous or exhausting way, especially to achieve a goal.",
      "explanation_cn": "指勤奋而持续地工作，常带有单调或疲惫的性质，尤其为了达成某个目标。",
      "example_en": "He’s been grinding away at his thesis for months, barely sleeping.",
      "example_cn": "他几个月来一直在埋头写论文，几乎没怎么睡觉。"
    },
    {
      "pos": "noun",
      "explanation_en": "A tedious, repetitive, and often exhausting task or routine, especially one requiring sustained effort.",
      "explanation_cn": "指一种乏味、重复且通常令人疲惫的任务或日常事务，尤其需要持续的努力。",
      "example_en": "The daily commute is a real grind—two hours each way in traffic.",
      "example_cn": "每天通勤真是个苦差事——来回各两小时堵在路上。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or process of grinding, especially the sound or motion produced.",
      "explanation_cn": "指研磨的行为或过程，尤指其产生的声音或动作。",
      "example_en": "The grind of the gears echoed through the old factory.",
      "example_cn": "齿轮的研磨声在旧工厂里回荡。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "crush",
      "analysis": "“Crush”（压碎）强调通过外力瞬间施加压力使物体破碎，常为一次性动作，不强调持续摩擦。而 “grind” 更侧重于通过反复摩擦或持续作用使物体逐渐变细或磨损，过程更缓慢、更持久。"
    },
    {
      "word_to_compare": "work",
      "analysis": "“Work”（工作）是泛指所有类型的劳动，中性且广泛。而 “grind” 作为动词时特指枯燥、重复、耗尽精力的苦干，带有负面情感色彩，强调过程的艰辛与单调。"
    },
    {
      "word_to_compare": "routine",
      "analysis": "“Routine”（常规）指日常固定的行为模式，本身不带有情感色彩，可以是轻松或高效的。而 “grind” 作为名词时特指令人厌倦、疲惫不堪的日常任务，隐含抱怨或无奈的情绪，比 “routine” 更具情感负荷。"
    }
  ]
}