{
  "word": "gritty",
  "pronunciation": "grit·ee",
  "concise_definition": "adj. 坚韧的, 坚持不懈的, 粗粝的, 真实粗犷的",
  "forms": {
    "comparative": "grittier",
    "superlative": "grittiest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Showing courage, determination, and resilience in the face of hardship or adversity; characterized by unwavering persistence and a tough, no-nonsense attitude.",
      "explanation_cn": "在面对困难或逆境时表现出勇气、决心和韧性；以坚定不移的毅力和务实强硬的态度为特征。",
      "example_en": "She gave a gritty performance, portraying a woman who refused to give up despite endless setbacks.",
      "example_cn": "她出演了一部坚韧不拔的角色，描绘了一位尽管遭遇无数挫折仍不放弃的女性。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Having a rough, abrasive, or coarse texture; often used to describe physical surfaces or sensory experiences.",
      "explanation_cn": "具有粗糙、磨砂或颗粒感的质地；常用于描述物理表面或感官体验。",
      "example_en": "The gritty sand felt unpleasant between her toes after a long day at the beach.",
      "example_cn": "在海滩度过漫长的一天后，细沙粗糙地夹在她的脚趾间，令人不适。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Depicting reality in a raw, unfiltered, and often harsh or unpleasant way, especially in art, film, or literature.",
      "explanation_cn": "以原始、未经修饰、常常严酷或不愉快的方式描绘现实，尤指在艺术、电影或文学中。",
      "example_en": "The film is known for its gritty realism, showing the brutal conditions of urban poverty.",
      "example_cn": "这部电影以其粗粝的现实主义风格著称，展现了城市贫困的残酷境况。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tough",
      "analysis": "“Tough”（坚强的/艰难的）更广泛地指身体或情感上的坚韧，或事物本身的困难程度，但不一定包含“坚持到底”的主动意志。而 “gritty” 更强调在逆境中持续奋斗的内在决心，带有道德或精神层面的敬意。"
    },
    {
      "word_to_compare": "rough",
      "analysis": "“Rough”（粗糙的/粗暴的）可描述质地、行为或环境的不平滑或不文雅，但缺乏 “gritty” 所蕴含的积极品质（如毅力）。例如，一条粗糙的路是物理性的，而一个 gritty 的故事是精神层面的。"
    },
    {
      "word_to_compare": "realistic",
      "analysis": "“Realistic”（现实的）强调对现实的忠实再现，但不必然包含粗粝、原始或令人不适的细节。而 “gritty” 是一种特定类型的现实主义，它刻意突出肮脏、残酷、未加修饰的真相，带有更强的情感冲击力。"
    }
  ]
}