{
  "word": "groan",
  "pronunciation": "grohn",
  "concise_definition": "v. 呻吟, 抱怨; n. 呻吟声, 抱怨声",
  "forms": {
    "third_person_singular": "groans",
    "past_tense": "groaned",
    "past_participle": "groaned",
    "present_participle": "groaning"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To make a low, prolonged sound, often due to physical pain, discomfort, or emotional distress.",
      "explanation_cn": "因身体疼痛、不适或情绪痛苦而发出低沉、拖长的声音。",
      "example_en": "He groaned as he tried to stand up after the accident.",
      "example_cn": "事故发生后，他试图站起来时发出了一声呻吟。"
    },
    {
      "pos": "verb",
      "explanation_en": "To complain or express dissatisfaction in a weary, resentful, or audible way, often about something tedious or unfair.",
      "explanation_cn": "以疲惫、不满或可听见的方式抱怨，通常针对令人厌烦或不公的事情。",
      "example_en": "The employees groaned about the new work schedule that started at 6 a.m.",
      "example_cn": "员工们对早上六点开始的新工作时间表怨声载道。"
    },
    {
      "pos": "noun",
      "explanation_en": "A low, mournful sound made by a person, often expressing pain, frustration, or disapproval.",
      "explanation_cn": "人发出的低沉、哀伤的声音，通常表达痛苦、沮丧或不满。",
      "example_en": "A loud groan rose from the crowd as the team missed the final shot.",
      "example_cn": "当球队错失最后一投时，人群中响起了一阵响亮的抱怨声。"
    },
    {
      "pos": "noun",
      "explanation_en": "An expression of weary or resentful complaint, often used metaphorically to describe collective dissatisfaction.",
      "explanation_cn": "一种疲惫或怨恨的抱怨表达，常用于比喻性地描述集体的不满情绪。",
      "example_en": "There was a collective groan when the announcement of more meetings was made.",
      "example_cn": "当宣布又要开更多会议时，大家齐声抱怨起来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "moan",
      "analysis": "“Moan” (呻吟) 与 “groan” 非常接近，都指因痛苦或不满而发出的声音，但 “moan” 通常音调更高、更持续，常用于表达轻微的不适或性快感；而 “groan” 更低沉、更沉重，常与强烈痛苦或强烈不满相关，语气更强烈。"
    },
    {
      "word_to_compare": "complain",
      "analysis": "“Complain” (抱怨) 是一个更通用的词，指用语言表达不满，不一定伴随声音；而 “groan” 作为动词时，强调的是通过声音（而非言语）表达抱怨，更具生理性和情绪性，常带有无奈或无力感。"
    },
    {
      "word_to_compare": "sigh",
      "analysis": "“Sigh” (叹气) 是一种较轻的、通常表示疲惫、失望或释然的呼气声，音量小且短暂；而 “groan” 更响亮、更持久，通常表达更强烈的负面情绪，如剧痛、愤怒或极度厌烦。"
    }
  ]
}