{
  "word": "groomed",
  "pronunciation": "grohmd",
  "concise_definition": "v. 修剪, 打扮, 培养, 训练",
  "forms": {
    "base_form": "groom",
    "third_person_singular": "grooms",
    "past_tense": "groomed",
    "past_participle": "groomed",
    "present_participle": "grooming"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To make someone or something neat, tidy, and well-presented, especially by cleaning, brushing, or styling hair, nails, or fur.",
      "explanation_cn": "通过清洁、梳理、修饰毛发、指甲或皮毛等方式，使某人或某物整洁、得体、外表良好。",
      "example_en": "She groomed her dog every morning before taking it for a walk.",
      "example_cn": "她每天早上带狗散步前都会给它梳理毛发。"
    },
    {
      "pos": "verb",
      "explanation_en": "To train or prepare someone, often over a long period, for a particular role, position, or responsibility, especially in a formal or strategic context.",
      "explanation_cn": "指经过长期训练或培养，使某人胜任某一特定角色、职位或责任，常用于正式或有策略性的语境中。",
      "example_en": "The executive was groomed for the CEO position by the board of directors.",
      "example_cn": "这位高管由董事会培养，准备接任首席执行官一职。"
    },
    {
      "pos": "verb",
      "explanation_en": "To manipulate or build a trusting relationship with someone, especially a child or vulnerable person, often with the intent of exploiting them later.",
      "explanation_cn": "指通过建立信任关系来操控某人（尤其是儿童或弱势群体），通常是为了日后实施剥削或侵害。",
      "example_en": "The predator groomed the child online over several months before meeting in person.",
      "example_cn": "这名施害者在数月内通过网络与这名儿童建立信任，之后才线下见面。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "prepared",
      "analysis": "“Prepared” (准备) 是一个更广泛、中性的词，泛指为某事做好了心理、物质或技能上的准备，不强调过程的长期性或操控性。而 “groomed” 在表示“培养”时，隐含了系统性、有目的性的长期训练，有时甚至带有操控或权力不对等的意味。"
    },
    {
      "word_to_compare": "polished",
      "analysis": "“Polished” (打磨/修饰) 侧重于外表、举止或技能的精致化，常用于形容言谈、礼仪或专业能力的提升，但不涉及内在角色的系统性培养或潜在的操纵意图。而 “groomed” 在培养语境中，往往包含更深层的权力结构和目标导向。"
    },
    {
      "word_to_compare": "trained",
      "analysis": "“Trained” (训练) 强调技能或行为的习得，通常是通过教学或练习实现，语义中性。而 “groomed” 在某些语境下（如政治、职场或犯罪）带有更强的意图性、隐蔽性和长期操控色彩，其目的不仅是技能提升，更是为特定角色或目的量身塑造个体。"
    }
  ]
}