{
  "word": "groom",
  "pronunciation": "groom",
  "concise_definition": "v. 梳理, 打扮, 照料; n. 马夫, 新郎",
  "forms": {
    "third_person_singular": "grooms",
    "past_tense": "groomed",
    "past_participle": "groomed",
    "present_participle": "grooming"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To clean, brush, and care for the hair, skin, or appearance of a person or animal, especially to make them look neat and presentable.",
      "explanation_cn": "指清洁、梳理并照料人或动物的毛发、皮肤或外表，使其整洁、得体。",
      "example_en": "She groomed her dog every morning before taking it for a walk.",
      "example_cn": "她每天早上带狗散步前都会为它梳理毛发。"
    },
    {
      "pos": "verb",
      "explanation_en": "To prepare someone, especially a person in a subordinate position, for a particular role or responsibility, often through mentoring or training, sometimes manipulatively.",
      "explanation_cn": "指通过指导或训练，为某人（尤其是地位较低者）准备担任特定角色或职责，有时带有操纵性质。",
      "example_en": "The senior executive groomed his protégé to take over the company.",
      "example_cn": "这位高管精心培养他的门生，以期其接掌公司。"
    },
    {
      "pos": "noun",
      "explanation_en": "A man employed to take care of horses, especially at a stable or racing facility.",
      "explanation_cn": "指受雇于马厩或赛马场、专门照料马匹的人。",
      "example_en": "The stable groom cleaned the horses' hooves and brushed their coats.",
      "example_cn": "马夫为马匹清理了马蹄并梳理了毛发。"
    },
    {
      "pos": "noun",
      "explanation_en": "A man who is about to be married or has just been married; the male partner in a wedding.",
      "explanation_cn": "指即将结婚或刚刚结婚的男性，婚礼中的新郎。",
      "example_en": "The groom wore a classic black tuxedo with a white rose boutonniere.",
      "example_cn": "新郎穿着经典的黑色燕尾服，胸前别着一朵白玫瑰。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "brush",
      "analysis": "“Brush”（刷）仅指用刷子进行物理清洁或梳理的动作，不包含整体照料或提升外表的意图。而 “groom” 不仅包括梳理，还隐含了使整体外观整洁、优雅的完整过程，常用于人或动物的全面护理。"
    },
    {
      "word_to_compare": "train",
      "analysis": "“Train”（训练）强调技能或行为的系统性培养，通常用于教育或职业领域，中性或积极。而 “groom” 在用于人时，常带有更强烈的个人化、长期性甚至操控性的意味，常用于权力结构中对潜在继任者的定向培养。"
    },
    {
      "word_to_compare": "grooming (as noun)",
      "analysis": "作为名词时，'grooming' 可指对动物或人的日常护理，但在现代语境中，它更常用于指‘性引诱’（child grooming），即成年人通过情感操控诱骗未成年人。这与动词 'groom' 的正面含义形成鲜明对比，需注意语境区分。"
    }
  ]
}