{
  "word": "groove",
  "pronunciation": "groov",
  "concise_definition": "n. 沟槽, 节奏, 状态; v. 沉浸, 随节奏律动",
  "forms": {
    "plural": "grooves",
    "third_person_singular": "grooves",
    "past_tense": "grooved",
    "past_participle": "grooved",
    "present_participle": "grooving"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long, narrow depression or channel, typically made in a surface for functional or decorative purposes, such as in a record, road, or woodwork.",
      "explanation_cn": "指在表面形成的狭长凹槽，通常用于功能性或装饰性目的，如唱片纹路、道路沟渠或木工雕刻。",
      "example_en": "The needle of the record player followed the groove on the vinyl.",
      "example_cn": "唱针沿着黑胶唱片上的纹路移动。"
    },
    {
      "pos": "noun",
      "explanation_en": "A steady, rhythmic pattern in music that creates a compelling, danceable feel, often associated with soul, funk, or jazz.",
      "explanation_cn": "指音乐中一种稳定而富有感染力的节奏模式，能让人产生律动感，常见于灵魂乐、放克或爵士乐中。",
      "example_en": "The bassline locked into a tight groove that made everyone want to dance.",
      "example_cn": "贝斯线陷入一个紧密的节奏律动中，让所有人都想跟着跳舞。"
    },
    {
      "pos": "noun",
      "explanation_en": "A state of effortless, focused, and highly productive performance, often described as being 'in the groove'.",
      "explanation_cn": "指一种轻松、专注且高效的表现状态，常被形容为‘进入状态’或‘找到节奏’。",
      "example_en": "After hours of practice, she finally got into the groove and played flawlessly.",
      "example_cn": "练习数小时后，她终于进入状态，演奏得完美无瑕。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move rhythmically to music, especially in a relaxed, enjoyable, and natural way.",
      "explanation_cn": "指随着音乐有节奏地律动，通常以放松、愉悦且自然的方式。",
      "example_en": "They were grooving to the funk beat all night long.",
      "example_cn": "他们整晚都随着放克节奏尽情律动。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form or cut a groove into a surface, often mechanically or intentionally.",
      "explanation_cn": "指在表面上形成或切割出一条凹槽，通常通过机械方式或有意为之。",
      "example_en": "The carpenter grooved the wooden board to fit the panel.",
      "example_cn": "木匠在木板上刻出凹槽以安装面板。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rhythm",
      "analysis": "“Rhythm” (节奏) 指音乐中重复出现的节拍模式，是音乐结构的基础元素；而 “groove” 更强调节奏带来的身体感受和情感共鸣，是一种让人想随之律动的‘流动感’。一个音乐可以有节奏但没有 groove，但有 groove 一定包含节奏。"
    },
    {
      "word_to_compare": "channel",
      "analysis": "“Channel” (渠道/通道) 通常指用于引导液体、气体或信息的路径，强调功能性和方向性；而 “groove” 作为名词时，更常指物理表面的凹陷，且常带有美学或文化含义（如唱片纹路），其用途更具体、更物质化。"
    },
    {
      "word_to_compare": "zone",
      "analysis": "“Zone” (状态/区域) 在口语中可指‘心流状态’，与 ‘in the groove’ 意义相近，但 ‘zone’ 更广泛用于任何高度专注的心理状态（如学习、运动），而 ‘groove’ 特别与音乐、节奏和身体律动相关联，更具感官和文化语境。"
    }
  ]
}