{
  "word": "grotesque",
  "pronunciation": "gruh·tesk",
  "concise_definition": "adj. 怪诞的, 奇形怪状的, 荒谬可笑的",
  "forms": {
    "comparative": "more grotesque",
    "superlative": "most grotesque"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Distorted in a bizarre, unnatural, or exaggerated way, often combining elements that are incongruous or repulsive, evoking discomfort or revulsion.",
      "explanation_cn": "以怪异、不自然或夸张的方式扭曲，常将不协调或令人反感的元素混合在一起，引发不适或厌恶感。",
      "example_en": "The sculpture featured a grotesque figure with multiple eyes and twisted limbs.",
      "example_cn": "这座雕塑刻画了一个长着多只眼睛和扭曲四肢的怪诞形象。"
    },
    {
      "pos": "adjective",
      "explanation_en": "So absurd or outrageous as to be ridiculous or shocking, especially in a way that violates norms of taste or decency.",
      "explanation_cn": "荒谬或极端到令人震惊或可笑的程度，尤其指违背了审美或道德规范。",
      "example_en": "It was a grotesque injustice that the innocent man was imprisoned for years.",
      "example_cn": "无辜者被监禁多年，这是一桩令人发指的不公。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characteristic of a style of art or decoration from the Renaissance that features fantastical, hybrid creatures and ornamental motifs.",
      "explanation_cn": "与文艺复兴时期的一种艺术或装饰风格相关，该风格以幻想的、混合的生物和装饰性图案为特征。",
      "example_en": "The palace walls were adorned with grotesque carvings of mermaids and dragons.",
      "example_cn": "宫殿的墙壁上装饰着美人鱼和龙的怪诞雕刻。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ugly",
      "analysis": "“Ugly” (丑陋的) 是一个通用词，仅描述视觉上不悦目或缺乏美感，情感色彩较弱。而 “grotesque” 不仅指丑，更强调一种扭曲、怪异、超现实的恐怖或荒谬感，带有强烈的心理冲击和文化象征意义。"
    },
    {
      "word_to_compare": "absurd",
      "analysis": "“Absurd” (荒谬的) 强调逻辑上的不合理或与现实严重脱节，常用于思想、行为或情境。而 “grotesque” 更侧重于形式、外观或感官上的极端变形，常引发身体上的反感，而不仅是认知上的困惑。"
    },
    {
      "word_to_compare": "macabre",
      "analysis": "“Macabre” (阴森恐怖的) 专指与死亡、尸体或暴力相关的令人毛骨悚然的景象，强调恐怖与死亡主题。而 “grotesque” 的范围更广，可包含非死亡主题的畸形、滑稽或荒诞的组合，不一定涉及血腥或死亡。"
    }
  ]
}