{
  "word": "grounds",
  "pronunciation": "grounz",
  "concise_definition": "n. 理由, 根据, 场地, 土地",
  "forms": {
    "singular": "ground"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A reason or basis for a belief, decision, or action, often used in plural form to refer to multiple justifications or supporting factors.",
      "explanation_cn": "指支持某种信念、决定或行动的理由或依据，常以复数形式出现，表示多个支持性因素。",
      "example_en": "There are no grounds for accusing him of theft.",
      "example_cn": "指控他盗窃是没有根据的。"
    },
    {
      "pos": "noun",
      "explanation_en": "A piece of land or an area used for a specific purpose, such as sports, construction, or agriculture.",
      "explanation_cn": "指用于特定目的的一块土地或区域，如运动场、建筑用地或农田。",
      "example_en": "The school has a large playing ground for soccer and track events.",
      "example_cn": "学校有一个大型运动场，用于足球和田径比赛。"
    },
    {
      "pos": "noun",
      "explanation_en": "The solid surface of the earth, especially when considered as a foundation or base for something.",
      "explanation_cn": "指地球的固体表面，尤指作为某物基础或支撑的地面。",
      "example_en": "The foundation was built deep into the grounds to ensure stability.",
      "example_cn": "地基被深埋于地下，以确保结构稳定。"
    },
    {
      "pos": "noun",
      "explanation_en": "In electrical engineering, a connection to the earth or to a conducting body that serves as a reference point for voltage, ensuring safety and circuit function.",
      "explanation_cn": "在电气工程中，指连接到大地或作为电压参考点的导体，用于确保安全和电路正常运行。",
      "example_en": "The appliance must be properly grounded to prevent electric shock.",
      "example_cn": "该电器必须正确接地，以防止触电。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "reason",
      "analysis": "“Reason” (理由) 是一个更通用的词，泛指任何解释行为或决定的动因，可以是主观的、情感的或逻辑的。而 “grounds” 更强调客观、可验证的依据，常用于法律、学术或正式语境中，语气更严谨。"
    },
    {
      "word_to_compare": "basis",
      "analysis": "“Basis” (基础) 与 “grounds” 在表示依据时非常接近，常可互换。但 “basis” 更侧重于构成某事物的根本原则或前提，常用于抽象概念（如理论基础）；而 “grounds” 更常用于支持具体主张或行动的证据或事实。"
    },
    {
      "word_to_compare": "land",
      "analysis": "“Land” (土地) 是一个更广泛、更自然的术语，泛指地球表面未被水覆盖的部分，不强调用途。而 “grounds” 通常指经过规划、使用或具有特定功能的土地，如校园、庄园或运动场地，带有更强的人为使用属性。"
    },
    {
      "word_to_compare": "foundation",
      "analysis": "“Foundation” (基础) 强调事物得以建立的底层结构或原理，常用于比喻意义（如制度的基础）。而 “grounds” 在表示依据时更侧重于支持性证据，而非结构性支撑；在表示物理土地时，它更接近地表，而 “foundation” 指埋在地下的建筑基座。"
    }
  ]
}