{
  "word": "growl",
  "pronunciation": "growl",
  "concise_definition": "v. 低吼, 咆哮; n. 低吼声, 咆哮声",
  "forms": {
    "third_person_singular": "growls",
    "past_tense": "growled",
    "past_participle": "growled",
    "present_participle": "growling"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To make a low, guttural, threatening sound, typically as a sign of anger, warning, or aggression, often associated with animals like dogs or bears.",
      "explanation_cn": "发出低沉、喉音明显的威胁性声音，通常表示愤怒、警告或攻击性，常用于描述狗、熊等动物。",
      "example_en": "The dog growled at the stranger who approached the fence.",
      "example_cn": "那只狗对着走近围栏的陌生人低吼。"
    },
    {
      "pos": "verb",
      "explanation_en": "To express dissatisfaction or anger in a low, rumbling voice, often used metaphorically to describe human behavior.",
      "explanation_cn": "以低沉、轰鸣的声音表达不满或愤怒，常用于比喻人类的行为。",
      "example_en": "He growled under his breath when he heard the bad news.",
      "example_cn": "听到这个坏消息时，他低声咕哝着表示不满。"
    },
    {
      "pos": "noun",
      "explanation_en": "A low, rumbling sound made by an animal or a person, typically indicating anger, threat, or discomfort.",
      "explanation_cn": "动物或人发出的低沉轰鸣声，通常表示愤怒、威胁或不适。",
      "example_en": "The growl of the tiger echoed through the jungle.",
      "example_cn": "老虎的低吼在丛林中回荡。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sound resembling a growl, such as the rumbling of a hungry stomach or an engine starting up.",
      "explanation_cn": "类似低吼的声音，如饥饿的胃部咕噜声或引擎启动时的轰鸣声。",
      "example_en": "I could hear a growl from my stomach — it was time to eat.",
      "example_cn": "我听到肚子咕噜作响——该吃饭了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "snarl",
      "analysis": "“Snarl”（龇牙咆哮）比 “growl” 更具攻击性和面部表情特征，常伴随露齿、皱鼻等动作，强调愤怒的外显表现；而 “growl” 更侧重于声音本身，可能不伴随明显面部动作，语气上更偏向低沉持续的威胁。"
    },
    {
      "word_to_compare": "roar",
      "analysis": "“Roar”（咆哮）音量更大、更响亮，常用于大型动物（如狮子）或强烈情绪爆发，具有震撼性和威慑力；而 “growl” 声音更低、更短促，多用于警告或轻微威胁，情绪强度较弱。"
    },
    {
      "word_to_compare": "mutter",
      "analysis": "“Mutter”（嘟囔）指低声、含糊地说话，通常表达不满但不具威胁性，多用于人类语言行为；而 “growl” 是非语言的、动物性的低吼声，带有明显的情绪张力和攻击性暗示。"
    }
  ]
}