{
  "word": "growing",
  "pronunciation": "grō·iŋ",
  "concise_definition": "adj. 增长的, 发展的; v. 生长, 种植, 逐渐变得",
  "forms": {
    "base_form": "grow",
    "third_person_singular": "grows",
    "past_tense": "grew",
    "past_participle": "grown",
    "present_participle": "growing"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Increasing in size, amount, or degree over time; describing something that is in the process of expansion or development.",
      "explanation_cn": "指在时间推移中规模、数量或程度不断增大的；描述正处于扩张或发展过程中的事物。",
      "example_en": "The company is experiencing growing demand for its products.",
      "example_cn": "该公司正经历对其产品日益增长的需求。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used to describe something that is becoming more significant, intense, or widespread, often with a sense of momentum or inevitability.",
      "explanation_cn": "用于描述某事物正变得越来越重要、强烈或普遍，常带有持续增强或不可避免的意味。",
      "example_en": "There is a growing concern about climate change among young people.",
      "example_cn": "年轻人对气候变化的担忧日益增加。"
    },
    {
      "pos": "verb",
      "explanation_en": "To increase in size, number, or amount through natural processes or gradual change, especially in living organisms.",
      "explanation_cn": "指通过自然过程或渐进变化而使尺寸、数量或数量增加，尤指生物体的生长。",
      "example_en": "Children grow quickly during their teenage years.",
      "example_cn": "孩子在青春期成长得很快。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cultivate or cause to develop, especially plants or crops.",
      "explanation_cn": "指种植或促使（植物或农作物）生长。",
      "example_en": "Farmers grow wheat and corn on this land.",
      "example_cn": "农民在这片土地上种植小麦和玉米。"
    },
    {
      "pos": "verb",
      "explanation_en": "To become gradually or progressively more of something, often referring to emotions, conditions, or states.",
      "explanation_cn": "指逐渐或逐步变得更某种状态，常用于描述情感、状况或性质的变化。",
      "example_en": "Her frustration was growing with each unanswered email.",
      "example_cn": "每一封未回复的邮件都让她更加沮丧。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "developing",
      "analysis": "“Developing” 强调从简单到复杂、从不成熟到成熟的结构性或功能性提升，常用于描述技术、经济或个人能力的系统性进步（如 developing country）。而 “growing” 更侧重于数量、规模或强度的增加，不一定涉及质的转变。"
    },
    {
      "word_to_compare": "expanding",
      "analysis": "“Expanding” 指在空间、范围或规模上的向外延展，如公司扩张市场、城市扩张边界，强调的是横向的扩展。“Growing” 可以包含扩展，但更常用于描述内在的、自然的或持续的增加，如人口增长、情绪增长。"
    },
    {
      "word_to_compare": "increasing",
      "analysis": "“Increasing” 是一个更中性、更量化的词，常用于数据、频率或数值的上升（如 increasing prices），强调变化的幅度。“Growing” 则带有更生动、有机或渐进的意味，常用于描述生命体、趋势或情感的自然演进，语义更丰富。"
    }
  ]
}