{
  "word": "grub",
  "pronunciation": "gruhb",
  "concise_definition": "n. 食物, 幼虫; v. 挖掘, 翻找食物",
  "forms": {
    "plural": "grubs",
    "third_person_singular": "grubs",
    "past_tense": "grubbed",
    "past_participle": "grubbed",
    "present_participle": "grubbing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A larva, especially one that is thick, soft-bodied, and lives in soil or decaying matter, often damaging plant roots.",
      "explanation_cn": "指一种幼虫，尤其是身体粗壮、柔软、生活在土壤或腐烂物质中、常破坏植物根系的幼虫。",
      "example_en": "The gardener found several grubs in the soil and removed them before they could harm the roses.",
      "example_cn": "园丁在土壤中发现了几条幼虫，并在它们伤害玫瑰之前将它们清除。"
    },
    {
      "pos": "noun",
      "explanation_en": "Informal term for food, especially simple or hearty meals; often used in phrases like 'get some grub'.",
      "explanation_cn": "非正式用语，指食物，尤指简单或丰盛的餐食；常用于短语如 'get some grub'（找点吃的）。",
      "example_en": "After the long hike, all we wanted was some grub and a hot shower.",
      "example_cn": "长途徒步后，我们只想要点吃的和一个热水澡。"
    },
    {
      "pos": "verb",
      "explanation_en": "To dig or scratch in the ground, especially in search of food or something buried.",
      "explanation_cn": "指在地面挖掘或刨挖，尤指寻找食物或埋藏之物。",
      "example_en": "The pig was grubbing in the mud, rooting for truffles.",
      "example_cn": "那头猪正在泥地里翻找松露。"
    },
    {
      "pos": "verb",
      "explanation_en": "To eat greedily or hungrily, often in a messy or hurried way.",
      "explanation_cn": "指狼吞虎咽地吃东西，常带有杂乱或匆忙的意味。",
      "example_en": "The kids were grubbing down on pizza as soon as it arrived.",
      "example_cn": "孩子们一拿到披萨就开始狼吞虎咽地吃起来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "larva",
      "analysis": "“Larva”（幼虫）是生物学上的正式术语，泛指昆虫发育的幼体阶段，中性且无感情色彩。而 “grub” 是口语化、形象化的说法，常带有贬义或拟人化色彩，特指那些外形笨拙、在土中翻掘的幼虫，如甲虫幼虫。"
    },
    {
      "word_to_compare": "food",
      "analysis": "“Food”（食物）是通用、正式的名词，涵盖所有可食用物质。而 “grub” 是俚语，语气随意甚至粗俗，多用于非正式场合，强调食物的实用性而非精致性，常用于表达饥饿时的迫切需求。"
    },
    {
      "word_to_compare": "dig",
      "analysis": "“Dig”（挖掘）是通用动词，指任何用工具或手在地面开凿的行为，用途广泛（如挖坑、挖井）。而 “grub” 作为动词时，特指用鼻子、爪子或工具在表层土壤中翻找食物，动作更贴近动物本能，带有“刨”“拱”的意味，范围更窄、更具体。"
    }
  ]
}