{
  "word": "grunt",
  "pronunciation": "gruhnt",
  "concise_definition": "n. 嘟囔声, 呻吟声; v. 嘟囔, 呻吟, 发牢骚",
  "forms": {
    "third_person_singular": "grunts",
    "past_tense": "grunted",
    "past_participle": "grunted",
    "present_participle": "grunting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A low, short, guttural sound made by a person or animal, often expressing dissatisfaction, effort, or pain.",
      "explanation_cn": "人或动物发出的低沉、短促的喉音，通常表达不满、努力或痛苦。",
      "example_en": "He gave a grunt of annoyance when he heard the bad news.",
      "example_cn": "听到这个坏消息时，他不满地哼了一声。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a low, short sound, especially when exerting physical effort or expressing displeasure without speaking.",
      "explanation_cn": "发出低沉短促的声音，尤其在用力时或不愿言语时表达不悦。",
      "example_en": "She grunted as she lifted the heavy box onto the shelf.",
      "example_cn": "她把沉重的箱子搬上架子时哼了一声。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slang term for a low-ranking soldier, especially in military contexts, implying someone who does hard, unglamorous work.",
      "explanation_cn": "军事语境中对低阶士兵的俚称，暗示其从事艰苦、不光彩的工作。",
      "example_en": "The grunts on the front line had to endure harsh conditions for months.",
      "example_cn": "前线的士兵们不得不在恶劣条件下坚持数月。"
    },
    {
      "pos": "verb",
      "explanation_en": "To complain or express reluctance in a murmured or non-verbal way, often implying passive resistance.",
      "explanation_cn": "以低语或非语言方式抱怨或表达不情愿，常暗示消极抵抗。",
      "example_en": "The employees grunted about the new policy but didn't openly protest.",
      "example_cn": "员工们对新政策颇有微词，但并未公开抗议。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mutter",
      "analysis": "“Mutter”（喃喃自语）指低声说出含糊不清的话语，通常带有抱怨或不满的情绪，但仍是语言性的表达；而 “grunt” 是非语言的喉音，不构成完整词语，更原始、更生理化。"
    },
    {
      "word_to_compare": "groan",
      "analysis": "“Groan”（呻吟）是更长、更深沉、更痛苦的声音，常与身体疼痛或极度疲惫相关；“grunt” 则更短促、更轻微，可能仅表示轻微不适或努力，情绪强度较低。"
    },
    {
      "word_to_compare": "complain",
      "analysis": "“Complain”（抱怨）是明确、有意识地表达不满，通常使用完整句子；而 “grunt” 是非语言、含蓄的抗议方式，常用于不愿直接表达情绪的场合，更具被动性和压抑感。"
    }
  ]
}