{
  "word": "guard",
  "pronunciation": "gahrd",
  "concise_definition": "n. 保护, 警卫, 守卫; v. 保护, 守卫, 防卫",
  "forms": {
    "third_person_singular": "guards",
    "past_tense": "guarded",
    "past_participle": "guarded",
    "present_participle": "guarding",
    "plural": "guards"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person or thing that protects or watches over someone or something, especially to prevent harm, intrusion, or theft.",
      "explanation_cn": "指保护或监视某人或某物的人或物，尤其用于防止伤害、侵入或盗窃。",
      "example_en": "The museum hired additional guards to protect the priceless artifacts.",
      "example_cn": "博物馆雇佣了额外的警卫来保护这些无价的文物。"
    },
    {
      "pos": "noun",
      "explanation_en": "A protective barrier or device designed to prevent access or injury, such as a safety guard on machinery.",
      "explanation_cn": "指用于防止进入或伤害的保护性屏障或装置，例如机械上的安全防护罩。",
      "example_en": "Never operate the machine without the guard in place.",
      "example_cn": "在防护罩未安装的情况下，切勿操作该机器。"
    },
    {
      "pos": "verb",
      "explanation_en": "To watch over or protect someone or something from danger, attack, or harm.",
      "explanation_cn": "指监视或保护某人或某物免受危险、攻击或伤害。",
      "example_en": "She guarded the entrance to the building all night.",
      "example_cn": "她整晚守卫着大楼的入口。"
    },
    {
      "pos": "verb",
      "explanation_en": "To maintain or defend something carefully, such as a position, right, or secret.",
      "explanation_cn": "指小心地维护或捍卫某种立场、权利或秘密。",
      "example_en": "He guarded his privacy fiercely and refused to give interviews.",
      "example_cn": "他极力保护自己的隐私，拒绝接受采访。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "protect",
      "analysis": "“Protect” (保护) 是一个更广泛、更通用的词，强调防止损害、伤害或损失，适用于抽象和具体对象（如保护环境、保护隐私）。而 “guard” 更强调主动的监视、警戒和物理性守卫，常用于有明确对象和位置的情境，如守卫大门或看护财物。"
    },
    {
      "word_to_compare": "defend",
      "analysis": "“Defend” (防御) 通常用于对抗攻击或反对意见，带有更强的对抗性和主动性，常用于军事、辩论或法律语境（如 defend a country, defend a theory）。而 “guard” 更侧重于持续性的看守和预防，不一定涉及直接对抗。"
    },
    {
      "word_to_compare": "watch",
      "analysis": "“Watch” (监视) 强调观察和注意，但不一定包含保护或干预的行动。例如，watch a movie 或 watch for danger。而 “guard” 不仅包含观察，还隐含了采取行动以确保安全的责任。"
    }
  ]
}