{
  "word": "guards",
  "pronunciation": "gahrdz",
  "concise_definition": "n. 保安, 警卫, 守卫者; v. 保卫, 守卫, 看守",
  "forms": {
    "singular": "guard",
    "third_person_singular": "guards",
    "past_tense": "guarded",
    "past_participle": "guarded",
    "present_participle": "guarding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person whose job is to protect people, property, or places by watching for and preventing danger, theft, or unauthorized access.",
      "explanation_cn": "指负责通过监视和防范危险、盗窃或未经授权的进入来保护人员、财产或场所的人。",
      "example_en": "The museum hired additional guards after a series of thefts.",
      "example_cn": "在发生一系列盗窃案后，博物馆雇佣了更多的保安。"
    },
    {
      "pos": "noun",
      "explanation_en": "A protective barrier or structure designed to prevent access or movement, often used in sports or transportation contexts.",
      "explanation_cn": "指用于阻止进入或移动的保护性屏障或结构，常用于体育或交通语境中。",
      "example_en": "The hockey player was penalized for high-sticking over the guard.",
      "example_cn": "这名冰球运动员因在守门员护板上方击球而被判罚。"
    },
    {
      "pos": "verb",
      "explanation_en": "To watch over or protect someone or something carefully, especially to prevent harm, theft, or escape.",
      "explanation_cn": "指仔细地看守或保护某人或某物，尤其是为了防止伤害、盗窃或逃脱。",
      "example_en": "Soldiers guarded the entrance to the base all night.",
      "example_cn": "士兵们整晚守卫着基地的入口。"
    },
    {
      "pos": "verb",
      "explanation_en": "To serve as a guard or protector in a formal or official capacity, often in a ceremonial or institutional setting.",
      "explanation_cn": "指在正式或官方场合中担任守卫或保护者，常用于仪式性或机构性环境中。",
      "example_en": "The royal guards guarded the palace during the coronation.",
      "example_cn": "皇家卫兵在加冕典礼期间守卫着宫殿。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "watchman",
      "analysis": "“Watchman”（看守人）通常指夜间或非正式场合下负责监视的人员，带有传统或文学色彩，职责范围较窄，常仅限于观察和报警，而不具备执法或武力干预权。而 “guard” 更正式、更广泛，可包括武装警卫、安保人员，职责涵盖预防、干预和强制。"
    },
    {
      "word_to_compare": "protector",
      "analysis": "“Protector”（保护者）是一个更抽象、更广义的词，可指任何提供保护的人或事物，包括法律、制度、自然力量等，不一定涉及物理守卫。而 “guard” 强调具体的、主动的、持续的看守行为，通常有明确的岗位和职责。"
    },
    {
      "word_to_compare": "sentinel",
      "analysis": "“Sentinel”（哨兵）多用于文学或军事语境，强调警觉、孤独和长期值守，常带有象征意义（如‘自由的哨兵’）。它比 “guard” 更具诗意和仪式感，但实际功能相似。现代语境中，“guard” 更常用且中性。"
    }
  ]
}