{
  "word": "guerrero",
  "pronunciation": "gweh·rrer·oh",
  "concise_definition": "n. 战士, 武士; (西班牙语) 战斗的, 好战的",
  "forms": {
    "feminine": "guerrera",
    "plural": "guerreros"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A fighter, especially one who engages in irregular warfare, such as a member of a small, independent group using hit-and-run tactics against a larger, more conventional force.",
      "explanation_cn": "指战士，尤指参与非正规战争的人，如隶属于小型独立团体、采用游击战术对抗更大规模正规军的战斗人员。",
      "example_en": "The guerreros fought bravely against the occupying army, using the mountain terrain to their advantage.",
      "example_cn": "这些游击战士利用山地地形，勇敢地对抗占领军。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is fierce, combative, or highly determined in pursuit of a cause, often used metaphorically in contexts like sports or activism.",
      "explanation_cn": "指在追求某种目标时表现出激烈、好斗或高度决心的人，常用于比喻语境，如体育或社会运动。",
      "example_en": "She is a guerrero for environmental justice, never backing down from a protest.",
      "example_cn": "她是环境正义的斗士，从不在抗议中退缩。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Of or relating to guerrilla warfare; characterized by unconventional, surprise attacks and mobility.",
      "explanation_cn": "与游击战相关的；以非正规、出其不意的袭击和高机动性为特征的。",
      "example_en": "The region has a long history of guerrero resistance movements.",
      "example_cn": "该地区有着悠久的游击式抵抗运动历史。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "warrior",
      "analysis": "“Warrior” (战士) 是一个更广泛、更通用的词，泛指任何勇敢作战的人，常带有荣誉和传统色彩，如古代武士或部落战士。而 “guerrero” 特指参与游击战或非正规战斗的人，强调战术的非对称性和隐蔽性。"
    },
    {
      "word_to_compare": "fighter",
      "analysis": "“Fighter” (斗士/战士) 是一个更通用的词，可用于任何类型的战斗，包括拳击、政治斗争或战争。而 “guerrero” 通常特指使用游击战术的武装人员，具有明确的军事和政治语境。"
    },
    {
      "word_to_compare": "rebel",
      "analysis": "“Rebel” (叛军/反抗者) 强调对权威或现有体制的反抗，但不一定使用游击战术；而 “guerrero” 更侧重于作战方式，即使其反抗对象不明确，只要采用游击战术即可称为 guerrero。两者常有重叠，但侧重点不同。"
    }
  ]
}