{
  "word": "guerrilla",
  "pronunciation": "gwer·uh·lee·uh",
  "concise_definition": "n. 游击队员, 游击战; adj. 游击的, 非正规的",
  "forms": {
    "plural": "guerrillas"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A member of a small, independent group that uses irregular military tactics, such as ambushes and sabotage, to fight against a larger, more conventional force, often in wartime or political conflict.",
      "explanation_cn": "指隶属于小型独立武装团体的成员，使用伏击、破坏等非正规军事战术对抗规模更大、更传统的军队，通常发生在战争或政治冲突中。",
      "example_en": "The guerrilla fighters controlled the mountainous regions, launching surprise attacks on supply convoys.",
      "example_cn": "游击队员控制了山区，对补给车队发动突袭。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or group that engages in unconventional, often covert, activities to achieve a goal, especially in politics, marketing, or social movements.",
      "explanation_cn": "指以非传统、常为隐蔽的方式从事活动以实现目标的人或团体，尤其用于政治、市场营销或社会运动中。",
      "example_en": "The campaign used guerrilla tactics to raise awareness about climate change through street art and flash mobs.",
      "example_cn": "该运动通过街头艺术和快闪活动等游击战术提高人们对气候变化的认识。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characteristic of guerrilla warfare or unconventional methods; marked by surprise, speed, and irregularity.",
      "explanation_cn": "与游击战或非传统方法相关的；以突然性、快速性和非正规性为特征的。",
      "example_en": "The city saw a surge in guerrilla art installations during the protest movement.",
      "example_cn": "在抗议运动期间，这座城市出现了大量游击艺术装置。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "insurgent",
      "analysis": "“Insurgent”（叛乱者）强调对现有政权或权威的武装反抗，通常具有明确的政治目标和组织结构，属于更广泛意义上的反叛者。而 “guerrilla” 更侧重于作战方式——非正规、灵活、小规模的战术，不一定有正式的政治纲领。"
    },
    {
      "word_to_compare": "rebel",
      "analysis": "“Rebel”（反叛者）是一个更宽泛的词，泛指任何反抗权威的人，可以是个人或群体，行为方式多样，包括和平抗议或暴力反抗。而 “guerrilla” 特指使用特定军事战术的武装反抗者，具有更强的战术和军事语境。"
    },
    {
      "word_to_compare": "irregular",
      "analysis": "“Irregular”（非正规军）是军事术语，泛指不属于国家正规军队的武装力量，包括民兵、志愿军等。而 “guerrilla” 是 “irregular” 的一种具体形式，特指采用游击战术的非正规战士，强调作战策略而非组织身份。"
    }
  ]
}