{
  "word": "guide",
  "pronunciation": "guyd",
  "concise_definition": "n. 指南, 向导, 导游; v. 指导, 引导, 带领",
  "forms": {
    "third_person_singular": "guides",
    "past_tense": "guided",
    "past_participle": "guided",
    "present_participle": "guiding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person or thing that shows the way or provides direction, especially in an unfamiliar place or situation; often refers to a professional who leads tourists or provides information.",
      "explanation_cn": "指在不熟悉的地方或情境中指引方向的人或物，常指专业导游或提供信息的向导。",
      "example_en": "Our guide led us through the ancient ruins with fascinating stories.",
      "example_cn": "我们的导游带着我们穿越了这些古老的遗迹，并讲述了引人入胜的故事。"
    },
    {
      "pos": "noun",
      "explanation_en": "A book, document, or resource that provides instructions, advice, or information on how to do something or understand a subject.",
      "explanation_cn": "指提供如何做某事或理解某一主题的说明、建议或信息的书籍、文件或资源。",
      "example_en": "This travel guide includes maps, restaurant recommendations, and cultural tips.",
      "example_cn": "这本旅行指南包含了地图、餐厅推荐和文化贴士。"
    },
    {
      "pos": "verb",
      "explanation_en": "To lead or direct someone or something, often by providing advice, support, or physical direction.",
      "explanation_cn": "指通过提供建议、支持或实际指引来带领或引导某人或某物。",
      "example_en": "The mentor guided the young artist through her first exhibition.",
      "example_cn": "这位导师指导这位年轻艺术家完成了她的首次展览。"
    },
    {
      "pos": "verb",
      "explanation_en": "To influence or determine the course of something, such as a process, decision, or development.",
      "explanation_cn": "指影响或决定某事物的进程、决策或发展方向。",
      "example_en": "Ethical principles should guide corporate behavior.",
      "example_cn": "道德原则应指导企业的行为。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "direct",
      "analysis": "“Direct” (直接指导) 强调明确地指示方向或命令，通常带有权威性或强制性，如“direct traffic”或“direct a film”。“Guide” 更强调温和、支持性的引导，注重过程中的陪伴与启发，而非单向命令。"
    },
    {
      "word_to_compare": "lead",
      "analysis": "“Lead” (领导/带领) 强调走在前面，带领他人前进，常用于组织、团队或群体的领导角色。“Guide” 可以是同行者，不一定在前方，更侧重于提供信息、建议或帮助理解，不一定具有权威地位。"
    },
    {
      "word_to_compare": "instruct",
      "analysis": "“Instruct” (教导/指示) 更正式，强调系统性地传授知识或步骤，常用于教学或技术性场景，如“instruct students in mathematics”。“Guide” 更宽泛，可包含非正式的建议、示范或陪伴式引导，不局限于知识传授。"
    }
  ]
}