{
  "word": "guild",
  "pronunciation": "gild",
  "concise_definition": "n. 行会, 同业公会, 专业协会",
  "forms": {
    "plural": "guilds"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A historical association of artisans or merchants who controlled the practice of their craft in a particular town, regulating quality, training, and trade practices.",
      "explanation_cn": "指中世纪时期由手工业者或商人组成的协会，负责在特定城镇内规范其行业的技艺实践、质量标准、学徒培训和贸易行为。",
      "example_en": "In medieval Europe, the guild of blacksmiths ensured that every horseshoe met strict standards of durability.",
      "example_cn": "在中世纪欧洲，铁匠行会确保每一只马蹄铁都符合严格的耐用性标准。"
    },
    {
      "pos": "noun",
      "explanation_en": "A modern organization of professionals with shared interests, often formed to promote standards, provide networking, or advocate for members' rights.",
      "explanation_cn": "指现代由具有共同职业兴趣的专业人士组成的组织，通常旨在促进行业标准、提供人脉网络或维护成员权益。",
      "example_en": "The Writers Guild of America negotiates contracts and protects the rights of screenwriters and television writers.",
      "example_cn": "美国编剧协会负责谈判合同并保护编剧和电视编剧的权利。"
    },
    {
      "pos": "noun",
      "explanation_en": "In fantasy literature and games, a group of adventurers or specialists who band together to undertake quests or missions, often with a hierarchical structure.",
      "explanation_cn": "在奇幻文学和游戏中，指一群为完成任务或冒险而结成的冒险者或专家团体，通常具有等级结构。",
      "example_en": "The party joined the Guild of Shadowwalkers to hunt down the rogue mage.",
      "example_cn": "这支队伍加入了影行者公会，以追捕那名叛逃的法师。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "union",
      "analysis": "“Union” (工会) 主要指工人为了争取更好的工资、工时和工作条件而组织的集体性劳工组织，强调经济权益和集体谈判。而 “guild” 更侧重于行业标准、技艺传承和专业身份，不一定以劳资对抗为目的。"
    },
    {
      "word_to_compare": "association",
      "analysis": "“Association” (协会) 是一个更宽泛的术语，泛指任何为共同目标而结成的团体，可以是慈善、学术或商业性质。而 “guild” 通常带有历史或专业技艺传承的色彩，结构更传统，成员身份更具排他性。"
    },
    {
      "word_to_compare": "clan",
      "analysis": "“Clan” (氏族) 指基于血缘或家族关系形成的紧密群体，强调血统和宗族纽带。而 “guild” 是基于职业或专业技能形成的组织，成员之间无血缘关系，其凝聚力来自共同的职业规范和利益。"
    }
  ]
}