{
  "word": "guinea",
  "pronunciation": "ɡɪˈni",
  "concise_definition": "n. 几内亚, 几尼（旧英国货币）, 豚鼠",
  "forms": {
    "plural": "guineas"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A country in West Africa, officially known as the Republic of Guinea, bordered by Guinea-Bissau, Senegal, Mali, Ivory Coast, Liberia, and Sierra Leone.",
      "explanation_cn": "西非国家，正式名称为几内亚共和国，与几内亚比绍、塞内加尔、马里、科特迪瓦、利比里亚和塞拉利昂接壤。",
      "example_en": "Many refugees from the civil conflict in Guinea have sought asylum in neighboring countries.",
      "example_cn": "许多来自几内亚内战的难民已前往邻国寻求庇护。"
    },
    {
      "pos": "noun",
      "explanation_en": "A former British gold coin worth 21 shillings (or £1.05), used primarily from the 17th to the 19th century, especially in professional fees and horse racing.",
      "explanation_cn": "一种曾流通于英国的金币，价值21先令（即1.05英镑），主要在17至19世纪使用，常用于专业服务费用和赛马交易。",
      "example_en": "The antique painting was sold for 500 guineas at the auction.",
      "example_cn": "这幅古画在拍卖会上以500几尼的价格售出。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small domestic rodent, also known as a cavy, commonly kept as a pet and used in scientific research; despite its name, it is not from Guinea nor related to pigs.",
      "explanation_cn": "一种小型家养啮齿动物，又称豚鼠，常作为宠物饲养，也用于科学研究；尽管名称中有“几内亚”，但它并非源自几内亚，也与猪无关。",
      "example_en": "The children were delighted to feed the guinea pigs with fresh vegetables.",
      "example_cn": "孩子们很高兴用新鲜蔬菜喂豚鼠。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cavy",
      "analysis": "“Cavy” 是豚鼠的学名，专指这种啮齿动物，属于科学术语，使用范围较窄；而 “guinea” 作为豚鼠的俗称更常见于日常口语和非正式语境，但可能因语境不同产生歧义（如指国家或货币）。"
    },
    {
      "word_to_compare": "pound",
      "analysis": "“Pound” 是英国现行货币单位，而 “guinea” 是其历史变体，价值略高（21先令 vs. 20先令）。虽然两者都用于金融语境，但 “guinea” 现已不再流通，仅保留于传统行业（如赛马、艺术品交易）中，带有历史或文化色彩。"
    },
    {
      "word_to_compare": "nation",
      "analysis": "“Nation” 是泛指国家的通用词，而 “Guinea” 是一个专有名词，特指西非国家。虽然在语义上 “Guinea” 属于 “nation” 的一种，但其使用具有地理和政治的唯一性，不能互换。此外，非洲还有几内亚比绍、赤道几内亚等名称相似的国家，需注意区分。"
    }
  ]
}