{
  "word": "gum",
  "pronunciation": "gum",
  "concise_definition": "n. 树胶, 口香糖; v. 用胶粘合",
  "forms": {
    "plural": "gums"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sticky, elastic substance secreted by certain trees and plants, often used in adhesives, medicines, or as a base for chewing gum.",
      "explanation_cn": "指某些树木和植物分泌的黏性、有弹性的物质，常用于胶水、药品或作为口香糖的基料。",
      "example_en": "The ancient Egyptians used gum from acacia trees to make incense and glue.",
      "example_cn": "古埃及人使用金合欢树的树胶制作香料和胶水。"
    },
    {
      "pos": "noun",
      "explanation_en": "The soft tissue surrounding and supporting the teeth in the jaw; also called the gingiva.",
      "explanation_cn": "指包裹并支撑牙齿的牙龈组织，也称为牙龈。",
      "example_en": "Brushing twice a day helps keep your gums healthy and prevents bleeding.",
      "example_cn": "每天刷牙两次有助于保持牙龈健康，防止出血。"
    },
    {
      "pos": "noun",
      "explanation_en": "A chewable, flavored substance designed for recreational chewing, typically made from synthetic rubber or natural gum base.",
      "explanation_cn": "指专为咀嚼而设计的有香味的物质，通常由合成橡胶或天然树胶基料制成，即口香糖。",
      "example_en": "He chewed gum to freshen his breath before the interview.",
      "example_cn": "他在面试前嚼口香糖来清新口气。"
    },
    {
      "pos": "verb",
      "explanation_en": "To join or seal two surfaces together using an adhesive, especially gum or glue.",
      "explanation_cn": "指使用胶水或树胶将两个表面粘合在一起。",
      "example_en": "The children gummed the paper cutouts onto the poster with glue.",
      "example_cn": "孩子们用胶水把纸片贴到了海报上。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "resin",
      "analysis": "“Resin”（树脂）是植物分泌的更坚硬、更透明的天然物质，常用于制造清漆、香料或工业原料，而 “gum” 更柔软、更黏稠，常用于食品或粘合剂。两者来源相似，但物理性质和用途不同。"
    },
    {
      "word_to_compare": "gingiva",
      "analysis": "“Gingiva” 是牙龈的医学术语，与 “gum” 在指代口腔组织时完全同义，但 “gingiva” 仅用于专业语境，而 “gum” 是日常通用词，更口语化。"
    },
    {
      "word_to_compare": "glue",
      "analysis": "“Glue”（胶水）是广义的粘合剂总称，可以是化学合成的液体或固体；而 “gum” 作为动词时特指用天然树胶或类似黏性物质粘合，语义更具体，常带有传统或手工操作的意味。"
    }
  ]
}