{
  "word": "gundam",
  "pronunciation": "guhn·dahm",
  "concise_definition": "n. 机动战士（高达），日本科幻动画系列中的巨型人形战斗机器人",
  "forms": {
    "plural": "gundams"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A fictional, piloted, humanoid mecha (mobile suit) featured in the Japanese science fiction anime franchise 'Mobile Suit Gundam,' typically characterized by its advanced technology, modular design, and role in interplanetary or inter-factional warfare.",
      "explanation_cn": "源自日本科幻动画《机动战士高达》系列中的虚构人形机动战士（Mobile Suit），通常具备先进科技、模块化设计，并在星际或派系战争中扮演核心战斗单位。",
      "example_en": "The RX-78-2 Gundam is the iconic prototype mobile suit piloted by Amuro Ray in the original series.",
      "example_cn": "RX-78-2高达是原版动画中阿姆罗·雷驾驶的标志性原型机动战士。"
    },
    {
      "pos": "noun",
      "explanation_en": "A cultural symbol in Japanese pop culture and global anime fandom, representing themes of war, human potential, and the ethics of technology; often used to describe the broader franchise including models, manga, video games, and merchandise.",
      "explanation_cn": "在日本流行文化及全球动漫粉丝群体中的一种文化象征，代表战争、人类潜能与科技伦理等主题；常用于泛指包括模型、漫画、电子游戏和周边商品在内的整个高达系列作品。",
      "example_en": "Collecting Gunpla model kits has become a worldwide hobby among fans of the Gundam franchise.",
      "example_cn": "收藏高达模型（Gunpla）已成为全球高达粉丝的热门爱好。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mecha",
      "analysis": "“Mecha”（机甲）是一个泛指巨型人形或非人形战斗机器的总称，涵盖所有类似作品，如《EVA》《变形金刚》等。而 “Gundam” 是特指由日升动画（Sunrise）制作的《机动战士高达》系列中的特定机甲类型，具有统一世界观、政治叙事和设计风格，是 mecha 类型中的一个子集。"
    },
    {
      "word_to_compare": "robot",
      "analysis": "“Robot”（机器人）是广义的自动化机器，可以是任何形态，如工业机器人、服务机器人，不一定有人形或战斗功能。而 “Gundam” 是高度拟人化、由人类驾驶员操控、专为战争设计的巨型战斗机器，具有情感叙事和角色成长，远超一般机器人概念。"
    },
    {
      "word_to_compare": "mobile suit",
      "analysis": "“Mobile suit” 是高达系列中对人形战斗机器的官方术语，与 “Gundam” 在语义上高度重叠。但 “mobile suit” 是类别名称（如 Zeta Gundam、Crossbone Gundam 都是 mobile suits），而 “Gundam” 通常特指系列中主角方的高性能、原型或旗舰机体，具有象征意义，是 mobile suit 中的精英类别。"
    }
  ]
}