{
  "word": "gunner",
  "pronunciation": "guhn·er",
  "concise_definition": "n. 炮手, 射手, 炮兵",
  "forms": {
    "plural": "gunners"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A military personnel trained to operate and fire artillery weapons, such as cannons, howitzers, or rocket launchers, often as part of an artillery unit.",
      "explanation_cn": "指受过训练、负责操作和发射火炮武器（如大炮、榴弹炮或火箭发射器）的军人，通常隶属于炮兵部队。",
      "example_en": "The gunner adjusted the elevation of the cannon before firing at the enemy position.",
      "example_cn": "炮手在向敌方阵地开火前调整了火炮的仰角。"
    },
    {
      "pos": "noun",
      "explanation_en": "In aviation, a crew member responsible for operating defensive machine guns or other weapons on an aircraft, especially in historical military aircraft.",
      "explanation_cn": "在航空领域，指在军用飞机（尤其是历史上的军用飞机）上负责操作防御性机枪或其他武器的机组人员。",
      "example_en": "During World War II, the bomber had a tail gunner to protect against enemy fighter attacks.",
      "example_cn": "在第二次世界大战期间，轰炸机上配备了一名尾部炮手以抵御敌方战斗机的攻击。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is highly skilled in shooting, especially in sports or competitive contexts such as shooting ranges or hunting.",
      "explanation_cn": "指在射击运动、竞技场合或狩猎中技艺高超的射手。",
      "example_en": "He's a talented gunner who won the national rifle championship last year.",
      "example_cn": "他是一位技艺高超的射手，去年赢得了全国步枪锦标赛冠军。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "soldier",
      "analysis": "“Soldier” (士兵) 是一个泛指所有陆军人员的通用词，涵盖步兵、工兵、后勤等各类军种。而 “gunner” 是一个专业性更强的术语，特指操作火炮或武器系统的军人，属于士兵中的一个专业类别。"
    },
    {
      "word_to_compare": "shooter",
      "analysis": "“Shooter” (射手) 是一个更宽泛的词，泛指任何开枪的人，包括猎人、警察、运动员或罪犯，不局限于军事背景。而 “gunner” 通常特指军事或专业射击环境中的武器操作者，带有职业或体制性含义。"
    },
    {
      "word_to_compare": "artilleryman",
      "analysis": "“Artilleryman” (炮兵) 与 “gunner” 几乎同义，常可互换，但 “artilleryman” 更正式、更侧重于整个炮兵兵种的身份，而 “gunner” 更常用于指具体操作火炮的个人，口语中更常见。在某些军队中，“gunner” 甚至是一个正式军衔或称号。"
    }
  ]
}