{
  "word": "gutted",
  "pronunciation": "guht",
  "concise_definition": "adj. 被掏空的, 极度失望的; v. 掏空, 洗劫",
  "forms": {
    "base_form": "gut",
    "present_participle": "gutting",
    "past_tense": "gutted",
    "past_participle": "gutted"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Feeling extremely disappointed, devastated, or emotionally hollow, especially after a sudden loss or setback.",
      "explanation_cn": "形容因突如其来的损失或挫折而感到极度失望、心碎或情感空虚。",
      "example_en": "She was gutted after her team lost the championship by one point.",
      "example_cn": "她的球队以一分之差输掉冠军赛，她感到心碎不已。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing a building or structure that has had its interior removed or destroyed, leaving only the outer shell.",
      "explanation_cn": "形容建筑物或结构的内部被完全拆除或毁坏，仅剩外部外壳。",
      "example_en": "The old theater was gutted by fire and now stands as a hollow shell.",
      "example_cn": "那座老剧院被大火烧毁，如今只剩下一个空壳。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove the internal organs or contents of something, especially from an animal or a building.",
      "explanation_cn": "指移除某物（尤指动物或建筑物）的内部器官或内容物。",
      "example_en": "Fishermen gutted the catch before selling it at the market.",
      "example_cn": "渔民在市场出售前将鱼内脏取出。"
    },
    {
      "pos": "verb",
      "explanation_en": "To destroy or strip away the essential parts of something, leaving it ineffective or empty.",
      "explanation_cn": "指摧毁或剥离某物的核心部分，使其失去功能或变得空洞。",
      "example_en": "The new regulations gutted the environmental protections that had been in place for decades.",
      "example_cn": "新法规废除了已实施数十年的环境保护措施。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "devastated",
      "analysis": "“Devastated”（ devastated）强调因重大打击而情绪崩溃，常用于心理层面，语气更强烈、更普遍用于情感描述。而 “gutted” 更具口语化和英式英语特色，常带有一种身体被掏空般的沉重感，情感更具体、更个人化。"
    },
    {
      "word_to_compare": "destroyed",
      "analysis": "“Destroyed”（摧毁）是通用词，指物理或功能上的彻底破坏，不带情感色彩。而 “gutted” 在描述建筑时，特指内部被掏空但外壳尚存，具有视觉和结构上的精确性；在描述情绪时，它隐含一种‘被掏空灵魂’的隐喻，比 ‘destroyed’ 更具文学性。"
    },
    {
      "word_to_compare": "looted",
      "analysis": "“Looted”（洗劫）强调财物被暴力掠夺，通常涉及盗窃行为，主语是掠夺者。而 “gutted” 可以是被动结果，不一定是人为盗窃所致，可能是火灾、政策或自然力量导致的内部空洞，语义范围更广。"
    }
  ]
}