{
  "word": "gymnasium",
  "pronunciation": "jim·nay·zee·uhm",
  "concise_definition": "n. 体育馆, 健身房, 古希腊的露天体育场",
  "forms": {
    "plural": "gymnasiums",
    "alternative_plural": "gymnasia"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A large indoor structure equipped for physical exercise, sports, and athletic training, often containing facilities such as basketball courts, weight rooms, and running tracks.",
      "explanation_cn": "一种配备有体育设施的大型室内建筑，用于体育锻炼、运动训练和竞技活动，通常包含篮球场、健身房和跑道等设施。",
      "example_en": "The school's new gymnasium opened last month with state-of-the-art equipment.",
      "example_cn": "这所学校的全新体育馆上个月启用，配备了最先进的设备。"
    },
    {
      "pos": "noun",
      "explanation_en": "In ancient Greece, a public place for physical exercise and intellectual discussion, often used as a training ground for athletes and philosophers alike.",
      "explanation_cn": "在古希腊，指用于体育锻炼和智力讨论的公共场所，常作为运动员和哲学家共同训练与交流的场所。",
      "example_en": "In classical Athens, the gymnasium was not just for athletics but also for philosophical debates.",
      "example_cn": "在古典时期的雅典，体育馆不仅是锻炼身体的地方，也是进行哲学辩论的场所。"
    },
    {
      "pos": "noun",
      "explanation_en": "In some European countries, a type of secondary school that prepares students for university, emphasizing academic rigor over physical education.",
      "explanation_cn": "在一些欧洲国家，指一种以学术训练为主、为升入大学做准备的中学，其重点在于学术严谨性而非体育教育。",
      "example_en": "She attended a German gymnasium and graduated with the Abitur, qualifying her for university admission.",
      "example_cn": "她就读于一所德国文理中学，以阿比图尔成绩毕业，获得了大学入学资格。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "stadium",
      "analysis": "“Stadium”（体育场）通常指大型露天或半露天的观赛设施，主要用于观众观看体育比赛，座位众多，容量大，如足球场或田径场。而 “gymnasium” 是封闭式室内场馆，主要用于训练、教学和小型比赛，强调功能性而非观演性。"
    },
    {
      "word_to_compare": "fitness center",
      "analysis": "“Fitness center”（健身中心）更侧重于个人健身和器械训练，通常不包含大型运动场地（如篮球场），设施以力量训练和有氧设备为主。而 “gymnasium” 是综合性体育场所，涵盖团队运动、体操、比赛等多种用途，规模和功能更全面。"
    },
    {
      "word_to_compare": "athletic field",
      "analysis": "“Athletic field”（运动场）指户外的草地或土质场地，用于足球、棒球、田径等户外运动，没有屋顶或围墙。而 “gymnasium” 是室内建筑，可全天候使用，不受天气影响，且通常包含多种运动和训练区域。"
    }
  ]
}