{
  "word": "gypsy",
  "pronunciation": "jip·see",
  "concise_definition": "n. 吉普赛人, 流浪者; adj. 吉普赛人的, 流浪的",
  "forms": {
    "plural": "gypsies"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A member of a traditionally nomadic ethnic group originating in northern India, with communities historically spread across Europe and the Americas, known for their distinct language, culture, and itinerant lifestyle.",
      "explanation_cn": "指起源于印度北部的一个传统游牧民族，其社群历史上遍布欧洲和美洲，以独特的语言、文化和游牧生活方式著称。该词常指罗姆人（Roma），但需注意其作为外称可能带有贬义。",
      "example_en": "Many gypsies have preserved their traditional music and crafts despite centuries of discrimination.",
      "example_cn": "尽管历经数世纪的歧视，许多吉普赛人仍保留了他们的传统音乐和手工艺。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who leads a wandering or unconventional lifestyle, often associated with freedom, spontaneity, or lack of permanent residence.",
      "explanation_cn": "指过着流浪或非传统生活方式的人，常与自由、自发性或无固定居所相关联，属比喻性用法。",
      "example_en": "She lived like a gypsy, moving from city to city with only a backpack and a guitar.",
      "example_cn": "她过着吉普赛式的生活，背着背包和一把吉他，从一个城市流浪到另一个城市。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characteristic of the lifestyle, culture, or aesthetics associated with the Romani people or wandering traditions.",
      "explanation_cn": "与吉普赛人（罗姆人）的生活方式、文化或美学特征相关的，或体现流浪传统风格的。",
      "example_en": "The festival featured gypsy music, colorful costumes, and impromptu dancing.",
      "example_cn": "这个节日展示了吉普赛音乐、鲜艳的服饰和即兴舞蹈。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "Romani",
      "analysis": "“Romani” 是对这一民族的正式、尊重的自称，强调其作为欧洲最大少数族裔之一的文化身份和历史。而 “gypsy” 是外部强加的他称，源于错误的起源认知（曾误以为他们来自埃及），在许多语境中被视为贬义或刻板化用语。学术和人权领域推荐使用 “Romani” 以避免冒犯。"
    },
    {
      "word_to_compare": "nomad",
      "analysis": "“Nomad” (游牧者) 是一个中性、描述性的术语，泛指任何因生计或传统而定期迁徙的人群，如蒙古牧民或贝都因人。它不特指某一民族，也不带有文化刻板印象。而 “gypsy” 通常特指罗姆人或其文化象征，且常被滥用为浪漫化或污名化的标签。"
    },
    {
      "word_to_compare": "vagabond",
      "analysis": "“Vagabond” (流浪汉) 强调无固定住所、无正当职业的游荡者，常带有负面或道德评判色彩，暗示懒惰或社会边缘化。而 “gypsy” 在比喻用法中可能带有浪漫、自由甚至神秘的正面联想，尽管其本义涉及系统性歧视。两者在语义色彩和文化语境上截然不同。"
    }
  ]
}