{
  "word": "hail",
  "pronunciation": "heyl",
  "concise_definition": "v. 招呼, 称颂, 降下（冰雹）; n. 冰雹, 大量的倾注",
  "forms": {
    "third_person_singular": "hails",
    "past_tense": "hailed",
    "past_participle": "hailed",
    "present_participle": "hailing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To greet or call out to someone loudly, especially to attract attention or request a ride or service.",
      "explanation_cn": "大声招呼或呼叫某人，尤其是为了引起注意或请求搭车、服务等。",
      "example_en": "She hailed a taxi as soon as she stepped out of the building.",
      "example_cn": "她一走出大楼就招手叫了一辆出租车。"
    },
    {
      "pos": "verb",
      "explanation_en": "To praise or acclaim someone or something enthusiastically and publicly, often with great admiration.",
      "explanation_cn": "热情而公开地称赞或颂扬某人或某事物，常带有极大的钦佩之情。",
      "example_en": "Critics hailed the new film as a masterpiece of modern cinema.",
      "example_cn": "评论家们称赞这部新片是现代电影的杰作。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fall from the sky in the form of small balls of ice, typically during a storm.",
      "explanation_cn": "指在风暴期间以小冰球的形式从天空降落。",
      "example_en": "Hail damaged the car’s windshield and left dents in the roof.",
      "example_cn": "冰雹砸坏了汽车的挡风玻璃，并在车顶留下了凹痕。"
    },
    {
      "pos": "noun",
      "explanation_en": "A fall of small balls of ice from the sky during a storm; also used metaphorically to describe a large quantity of something falling or arriving rapidly.",
      "explanation_cn": "风暴期间从天空降落的小冰球；也可比喻大量事物迅速落下或涌来。",
      "example_en": "The storm brought a sudden hail that shattered windows across the town.",
      "example_cn": "这场风暴带来了一场突如其来的冰雹，击碎了全镇的窗户。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large and rapid outpouring or influx of something, such as questions, complaints, or praise.",
      "explanation_cn": "指大量迅速涌来的事物，如问题、投诉或赞扬。",
      "example_en": "The mayor received a hail of criticism after the policy was announced.",
      "example_cn": "这项政策公布后，市长收到了铺天盖地的批评。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cheer",
      "analysis": "“Cheer” (欢呼) 通常指在特定场合（如体育赛事）中发出的有节奏的、积极的喊叫，强调集体性和情绪感染力。而 “hail” 更强调公开、热烈的颂扬，常用于书面或正式语境，且对象多为成就或人物，不局限于声音表达。"
    },
    {
      "word_to_compare": "shower",
      "analysis": "“Shower” (淋浴/倾注) 可以比喻大量事物的落下，如“a shower of praise”，但语气更中性或温和，常用于日常语境。“Hail” 则带有更强的冲击力和突然性，常暗示破坏性或密集性，如“a hail of bullets”，更具文学张力。"
    },
    {
      "word_to_compare": "call",
      "analysis": "“Call” (呼叫) 是一个通用词，泛指任何形式的呼唤，语气可轻可重，用途广泛（如打电话、叫名字）。“Hail” 作为动词特指大声、远距离、有明确目的的招呼，常用于召唤交通工具或吸引注意，语义更具体、更具动作感。"
    }
  ]
}