{
  "word": "hails",
  "pronunciation": "hālz",
  "concise_definition": "v. 招呼, 称赞, 招揽; n. 大雨, 冰雹",
  "forms": {
    "base_form": "hail",
    "third_person_singular": "hails",
    "past_tense": "hailed",
    "past_participle": "hailed",
    "present_participle": "hailing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To greet or summon someone, especially by waving or calling out loudly, often to attract attention.",
      "explanation_cn": "通过挥手或大声呼喊来打招呼或召唤某人，通常是为了引起注意。",
      "example_en": "She hailed a taxi from the curb.",
      "example_cn": "她从路边招了一辆出租车。"
    },
    {
      "pos": "verb",
      "explanation_en": "To praise or acclaim someone or something enthusiastically, often in public or formal terms.",
      "explanation_cn": "热情地称赞或颂扬某人或某事物，通常以公开或正式的方式表达。",
      "example_en": "Critics hailed the new film as a masterpiece of modern cinema.",
      "example_cn": "评论家们称赞这部新片是现代电影的杰作。"
    },
    {
      "pos": "verb",
      "explanation_en": "To call out to attract or request something, especially in a business or service context (e.g., to hail a ride or service).",
      "explanation_cn": "在商业或服务语境中，通过呼喊来吸引或请求某物，例如召唤交通工具或服务。",
      "example_en": "He hailed a delivery driver to bring the package to his door.",
      "example_cn": "他招呼了一名送货员把包裹送到他家门口。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden and heavy fall of precipitation, such as rain or hail, often accompanied by strong winds.",
      "explanation_cn": "突然而猛烈的降水，如大雨或冰雹，常伴有强风。",
      "example_en": "The storm brought a hail of rain that soaked everyone in minutes.",
      "example_cn": "这场风暴带来了一场倾盆大雨，几分钟内就把所有人都淋透了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "greet",
      "analysis": "“Greet” (问候) 是一个中性、普遍的社交行为，通常指礼貌性地打招呼，如点头、微笑或说‘你好’。而 “hail” 更具主动性、声音更大，常用于远距离或紧急情况下吸引注意，语气更强烈。"
    },
    {
      "word_to_compare": "praise",
      "analysis": "“Praise” (赞扬) 是一个通用词，指对成就、品质或行为表示肯定，语气较温和、正式。而 “hail” 作为动词时带有强烈的热情和公众性，常用于媒体或公众场合的极高赞誉，带有‘欢呼’的意味。"
    },
    {
      "word_to_compare": "downpour",
      "analysis": "“Downpour” (暴雨) 专指大量降雨，强调雨量大、持续时间短，是气象术语。而 “hail” 作为名词时，可指冰雹，也可比喻性地用于形容‘如冰雹般密集的雨’，其语义范围更广，且可引申为‘密集的攻击或批评’（如 a hail of criticism）。"
    }
  ]
}