{
  "word": "halal",
  "pronunciation": "huh·lal",
  "concise_definition": "adj. 合乎伊斯兰教法的, 允许的; n. 清真食品",
  "forms": {
    "comparative": "more halal",
    "superlative": "most halal"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Permitted or lawful according to Islamic law (Sharia), particularly in relation to food, drink, and other practices; the opposite of 'haram' (forbidden).",
      "explanation_cn": "根据伊斯兰教法（沙里亚法）所允许或合法的，尤其指食物、饮料及其他行为；与 'haram'（禁止的）相对。",
      "example_en": "This restaurant serves only halal meat, certified by an Islamic authority.",
      "example_cn": "这家餐厅只提供经伊斯兰机构认证的清真肉类。"
    },
    {
      "pos": "noun",
      "explanation_en": "Food or products that are prepared, processed, and handled in accordance with Islamic dietary laws, ensuring they are free from prohibited substances such as pork and alcohol.",
      "explanation_cn": "指按照伊斯兰饮食法规准备、加工和处理的食品或产品，确保不含猪肉、酒精等禁物。",
      "example_en": "The supermarket has a dedicated halal section for Muslim customers.",
      "example_cn": "这家超市设有专门的清真食品区，供穆斯林顾客选购。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used more broadly to describe any activity, practice, or business that is morally and ethically permissible under Islamic principles, extending beyond food to finance, fashion, and entertainment.",
      "explanation_cn": "更广泛地用于描述任何符合伊斯兰原则的道德与伦理上被允许的活动、实践或商业行为，不仅限于食品，还包括金融、时尚和娱乐等领域。",
      "example_en": "Halal finance avoids interest-based transactions and promotes ethical investment.",
      "example_cn": "清真金融避免基于利息的交易，倡导道德投资。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "kosher",
      "analysis": "“Kosher”（符合犹太教规的）与 “halal” 类似，都是宗教饮食规范的术语，但适用于犹太教而非伊斯兰教。两者都禁止某些动物（如猪肉）和特定屠宰方式，但具体规定不同，例如犹太教要求屠宰者必须是受过训练的犹太教士（shochet），而伊斯兰教要求由穆斯林在念诵真主之名后宰杀。"
    },
    {
      "word_to_compare": "organic",
      "analysis": "“Organic”（有机的）强调的是农业生产过程中不使用化学合成肥料、农药或转基因技术，属于环保与健康标准，与宗教信仰无关。而 “halal” 关注的是宗教合法性，即使有机食品若含酒精或未按伊斯兰方式屠宰，也不被视为 halal。"
    },
    {
      "word_to_compare": "ethical",
      "analysis": "“Ethical”（合乎道德的）是一个世俗的、广泛的概念，涵盖公平、环保、动物福利等，但不必然与宗教律法挂钩。虽然 halal 通常包含伦理维度（如人道屠宰），但其核心依据是伊斯兰教法，而非普遍的道德哲学。一个行为可以是 ethical 但非 halal，反之亦然。"
    }
  ]
}