{
  "word": "halifax",
  "pronunciation": "huh·lif·aks",
  "concise_definition": "n. 哈利法克斯（加拿大新斯科舍省省会；英国地名）",
  "forms": {
    "plural": "Halifaxes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The capital city of Nova Scotia, Canada, located on the Atlantic coast; known for its historic harbor, naval base, and vibrant cultural scene.",
      "explanation_cn": "加拿大新斯科舍省的首府，位于大西洋沿岸，以其历史悠久的港口、海军基地和充满活力的文化氛围而闻名。",
      "example_en": "Halifax is one of Canada's most important maritime cities and a major port on the east coast.",
      "example_cn": "哈利法克斯是加拿大最重要的港口城市之一，也是东海岸的主要港口。"
    },
    {
      "pos": "noun",
      "explanation_en": "A town in West Yorkshire, England, historically known for its textile industry and as the birthplace of the Halifax Building Society.",
      "explanation_cn": "英国西约克郡的一个城镇，历史上以纺织业闻名，并且是哈利法克斯建筑协会的发源地。",
      "example_en": "The Halifax building society, founded in 1853, became one of the UK’s largest mortgage lenders.",
      "example_cn": "成立于1853年的哈利法克斯建筑协会，成为英国最大的抵押贷款机构之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A title in the British peerage, historically held by prominent political figures such as Charles Wood, 1st Viscount Halifax, who played key roles in 19th-century British politics.",
      "explanation_cn": "英国贵族头衔，历史上由重要政治人物持有，如第一代哈利法克斯子爵查尔斯·伍德，他在19世纪英国政治中扮演了关键角色。",
      "example_en": "Lord Halifax was a leading figure in the appeasement policy toward Nazi Germany in the 1930s.",
      "example_cn": "哈利法克斯勋爵是20世纪30年代对纳粹德国推行绥靖政策的关键人物。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "city",
      "analysis": "“City”（城市）是一个通用名词，泛指任何人口密集、具有行政或经济中心功能的聚居地。而 “Halifax” 是一个专有名词，特指加拿大或英国的两个具体城市，不能互换使用。"
    },
    {
      "word_to_compare": "port",
      "analysis": "“Port”（港口）指具有船舶停靠、货物装卸功能的沿海或沿河地区。虽然哈利法克斯是一个重要港口，但“port”是功能性的通称，而“Halifax”是地名，包含城市的政治、文化、历史等多重属性。"
    },
    {
      "word_to_compare": "town",
      "analysis": "“Town”（城镇）通常指规模小于城市的居民区。虽然英国的Halifax被称作town，但加拿大Halifax是省会城市，规模和行政地位远超一般town。两者虽同名，但地理与行政层级完全不同。"
    }
  ]
}