{
  "word": "halls",
  "pronunciation": "hawls",
  "concise_definition": "n. 大厅, 厅堂, 学生宿舍, 长廊",
  "forms": {
    "singular": "hall"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A large, often grand room or space within a building, typically used for gatherings, ceremonies, or public events.",
      "explanation_cn": "指建筑物内用于集会、仪式或公共活动的大型、常为宏伟的房间或空间。",
      "example_en": "The graduation ceremony was held in the university's main hall.",
      "example_cn": "毕业典礼在大学的主大厅举行。"
    },
    {
      "pos": "noun",
      "explanation_en": "A long, narrow passage connecting rooms or areas in a building, often found in older or large structures.",
      "explanation_cn": "指建筑物中连接各个房间或区域的狭长通道，常见于古老或大型建筑中。",
      "example_en": "She walked down the dimly lit hall toward her bedroom.",
      "example_cn": "她沿着昏暗的走廊走向自己的卧室。"
    },
    {
      "pos": "noun",
      "explanation_en": "A residential building or room provided by a school or university for students to live in, especially in British English.",
      "explanation_cn": "指学校或大学为学生提供的住宿楼或房间，尤用于英式英语。",
      "example_en": "He moved into his dorm hall on the first day of term.",
      "example_cn": "他在开学第一天搬进了学生宿舍。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large public building or complex used for exhibitions, conferences, or trade shows.",
      "explanation_cn": "指用于展览、会议或贸易博览会的大型公共建筑或综合设施。",
      "example_en": "The annual tech fair is hosted at the city's exhibition halls.",
      "example_cn": "年度科技博览会将在市展览馆举行。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "room",
      "analysis": "“Room”（房间）泛指任何封闭的室内空间，尺寸和用途广泛，可以是卧室、浴室或办公室，通常较小且私密。而 “hall” 通常更大、更公共，常用于通行或集体活动，具有更强的公共性和仪式感。"
    },
    {
      "word_to_compare": "lobby",
      "analysis": "“Lobby”（门厅/大堂）特指建筑物入口处的接待或等候区域，功能上更偏向过渡性空间，常有服务台或座椅。而 “hall” 可以是主活动空间，用途更广泛，不一定位于入口处，且规模通常更大。"
    },
    {
      "word_to_compare": "corridor",
      "analysis": "“Corridor”（走廊）专指连接房间的狭长通道，功能单一，几乎不用于活动或集会。而 “hall” 虽然也可以是通道，但常具备活动、展示或仪式功能，空间更开阔，具有多重用途。"
    }
  ]
}