{
  "word": "halo",
  "pronunciation": "hā·lō",
  "concise_definition": "n. 光晕, 圣光, 圆形光环; v. 使形成光晕",
  "forms": {
    "plural": "halos",
    "third_person_singular": "halos",
    "past_tense": "haloed",
    "past_participle": "haloed",
    "present_participle": "haloing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A circular band of light, especially one appearing around the sun, moon, or other celestial body, caused by the refraction and reflection of light through ice crystals in the atmosphere.",
      "explanation_cn": "指围绕太阳、月亮或其他天体的圆形光带，由大气中冰晶对光线的折射和反射形成。",
      "example_en": "A halo around the moon often signals that rain is coming.",
      "example_cn": "月亮周围的光晕通常预示着即将下雨。"
    },
    {
      "pos": "noun",
      "explanation_en": "A radiant circle or disk, especially one depicted around the head of a holy person in religious art, symbolizing sanctity or divine presence.",
      "explanation_cn": "指在宗教艺术中描绘在圣人头部周围的光环或光盘，象征神圣性或神灵的存在。",
      "example_en": "The painting shows the saint with a golden halo behind her head.",
      "example_cn": "这幅画中，圣女头后有一个金色的光环。"
    },
    {
      "pos": "noun",
      "explanation_en": "A glowing aura or impression of excellence, admiration, or idealization surrounding a person, thing, or idea.",
      "explanation_cn": "指围绕某人、某物或某种理念的光辉形象或理想化印象，常带有崇拜或崇敬的意味。",
      "example_en": "Even after his scandal, he still had a halo of genius in the eyes of his fans.",
      "example_cn": "即使在丑闻之后，他仍被粉丝视为天才般的存在。"
    },
    {
      "pos": "verb",
      "explanation_en": "To surround or appear to surround something with a halo or glowing light, especially in photography or digital imaging.",
      "explanation_cn": "指在摄影或数字图像处理中，使某物周围呈现出光环或发光效果。",
      "example_en": "The photographer haloed the subject’s hair with backlighting to create a dreamy effect.",
      "example_cn": "摄影师用逆光为人物的头发营造出光晕效果，制造出梦幻感。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "aura",
      "analysis": "“Aura”（氛围/气场）指一种难以言喻的、弥漫性的感觉或能量，常用于描述人的气质或环境的氛围，不一定是视觉可见的。而 “halo” 更具体，通常指可见的圆形光圈，或强烈理想化的光环形象，更具象征性和视觉性。"
    },
    {
      "word_to_compare": "glow",
      "analysis": "“Glow”（发光/泛光）泛指物体自身发出柔和的光，或表面呈现温暖的光亮，可以是物理现象（如灯泡发光）或比喻（如脸红）。而 “halo” 特指围绕某物的环形光带，结构更明确，常用于宗教、艺术或摄影语境中。"
    },
    {
      "word_to_compare": "corona",
      "analysis": "“Corona”（日冕）在天文学中指太阳外层的稀薄大气层，也可指类似光环的结构，但更科学化、更专业，常用于天文或医学语境（如冠状病毒）。而 “halo” 更通俗，涵盖宗教、艺术、日常气象和视觉效果，语义范围更广。"
    }
  ]
}