{
  "word": "hammered",
  "pronunciation": "ham·urd",
  "concise_definition": "adj. 被猛烈击打的, 被彻底击败的; v. (过去式/过去分词) 敲打, 猛烈攻击, 反复强调; adv. (非正式) 醉得厉害的",
  "forms": {
    "base_form": "hammer",
    "present_participle": "hammering",
    "past_tense": "hammered",
    "past_participle": "hammered",
    "third_person_singular": "hammers"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To strike something repeatedly with a hammer or other heavy object, often with force or violence.",
      "explanation_cn": "用锤子或其他重物反复猛烈击打某物，通常带有力量或暴力性。",
      "example_en": "The carpenter hammered the nails into the wooden frame.",
      "example_cn": "木匠把钉子敲进了木框架里。"
    },
    {
      "pos": "verb",
      "explanation_en": "To attack or criticize someone or something relentlessly, often in speech or writing.",
      "explanation_cn": "以持续不断的方式攻击或批评某人或某事，常用于言语或文字中。",
      "example_en": "The opposition party hammered the government for its handling of the economy.",
      "example_cn": "反对党猛烈抨击政府对经济的管理不善。"
    },
    {
      "pos": "verb",
      "explanation_en": "To emphasize or repeat something persistently, often to make a point or drive home an idea.",
      "explanation_cn": "反复强调或重复某事，通常是为了阐明观点或加深印象。",
      "example_en": "The teacher hammered home the importance of studying regularly.",
      "example_cn": "老师反复强调了定期学习的重要性。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that has been severely damaged, defeated, or overwhelmed, often by force or pressure.",
      "explanation_cn": "形容某物被严重损坏、彻底击败或压垮，通常因外力或压力所致。",
      "example_en": "After the storm, the coastal town was hammered by flooding.",
      "example_cn": "风暴过后，沿海小镇被洪水彻底摧毁。"
    },
    {
      "pos": "adverb",
      "explanation_en": "(Informal) Extremely drunk or intoxicated, often to the point of being incapacitated.",
      "explanation_cn": "(非正式) 醉得非常厉害，通常达到无法行动的程度。",
      "example_en": "He was hammered after drinking six beers at the party.",
      "example_cn": "他在聚会上喝了六瓶啤酒，醉得不省人事。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "beat",
      "analysis": "“Beat” (击打/击败) 更泛指任何形式的打击或战胜，可以是物理的、比赛的或心理的，语气较轻或中性。而 “hammered” 强调反复、猛烈、持续的打击，带有更强的破坏性和情绪强度。"
    },
    {
      "word_to_compare": "criticize",
      "analysis": "“Criticize” (批评) 是中性或正式的词汇，指指出缺点或错误，不一定带有情绪。而 “hammered” 作为动词使用时，带有强烈的情感色彩，暗示攻击性、持续性和压倒性的批评，语气更激烈。"
    },
    {
      "word_to_compare": "drunk",
      "analysis": "“Drunk” (喝醉的) 是描述醉酒状态的标准中性词，可作形容词或名词。而 “hammered” 是非正式俚语，语气更强烈、口语化，常用于年轻人或非正式语境，暗示醉酒程度极深，甚至失去控制。"
    }
  ]
}