{
  "word": "hammering",
  "pronunciation": "ham·er·ing",
  "concise_definition": "n. 敲击, 锤打; v. 反复敲打, 猛烈抨击",
  "forms": {
    "base_form": "hammer",
    "third_person_singular": "hammers",
    "past_tense": "hammered",
    "past_participle": "hammered",
    "present_participle": "hammering"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The action or sound of repeatedly striking something with a hammer or similar tool, often producing a rhythmic or forceful noise.",
      "explanation_cn": "指用锤子或类似工具反复敲击某物的动作或声音，通常产生有节奏或猛烈的声响。",
      "example_en": "The hammering of nails echoed through the construction site.",
      "example_cn": "钉子的敲击声在建筑工地上回荡。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sustained and intense verbal attack or criticism, often repeated and forceful.",
      "explanation_cn": "指持续而强烈的言语攻击或批评，通常具有重复性和猛烈性。",
      "example_en": "The politician faced hammering from the media over the scandal.",
      "example_cn": "这位政客因丑闻遭到了媒体的猛烈抨击。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strike something repeatedly with a hammer or other heavy object, typically to shape, fix, or drive something in place.",
      "explanation_cn": "指用锤子或其他重物反复敲击某物，通常用于塑形、固定或将某物钉入位置。",
      "example_en": "He was hammering the metal into a new form.",
      "example_cn": "他正把金属敲打成新的形状。"
    },
    {
      "pos": "verb",
      "explanation_en": "To criticize or attack someone or something persistently and forcefully, especially in speech or writing.",
      "explanation_cn": "指以持续而猛烈的方式批评或攻击某人或某事，尤指在言语或文字中。",
      "example_en": "The editorial hammered home the need for urgent reform.",
      "example_cn": "这篇社论反复强调了迫切改革的必要性。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "beating",
      "analysis": "“Beating” (敲打/击打) 是一个更广泛的词，泛指任何形式的连续击打，可以是用手、棍棒或其他工具，不一定有工具或节奏。而 “hammering” 特指用锤子进行的、有明确工具和力度的重复敲击，更具机械性和冲击感。"
    },
    {
      "word_to_compare": "blasting",
      "analysis": "“Blasting” (爆炸性攻击/爆破) 强调爆炸性、破坏性的力量，常用于物理爆破或情绪激烈的语言攻击，带有瞬间爆发的特征。而 “hammering” 更强调持续、有节奏、重复的施压，虽猛烈但非瞬时。"
    },
    {
      "word_to_compare": "criticizing",
      "analysis": "“Criticizing” (批评) 是中性词，泛指指出缺点或错误，语气可温和可严厉。而 “hammering” 作为动词使用时，带有强烈的情感色彩和攻击性，暗示批评是密集、无情且持续的，语义强度远高于普通 ‘criticizing’。"
    }
  ]
}