{
  "word": "han",
  "pronunciation": "hahn",
  "concise_definition": "n. 韩（韩国人/朝鲜人）；韩语",
  "forms": {
    "plural": "hans"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person from Korea, used to refer to either a South Korean or North Korean individual; often used in compound terms such as 'Han Chinese' to denote ethnic identity in East Asian contexts.",
      "explanation_cn": "指来自朝鲜半岛的人，可泛指韩国人或朝鲜人；在东亚语境中，也用于复合词如 'Han Chinese'（汉族）以表示民族身份。",
      "example_en": "She is a Han student studying international relations at Seoul National University.",
      "example_cn": "她是一名在首尔国立大学学习国际关系的韩国学生。"
    },
    {
      "pos": "noun",
      "explanation_en": "The official language of Korea, also known as Korean; sometimes used in linguistic or cultural contexts to denote the language spoken by the Korean people.",
      "explanation_cn": "朝鲜半岛的官方语言，即韩语；在语言学或文化语境中，用于指代朝鲜民族所使用的语言。",
      "example_en": "He has been learning Han for three years and can now hold basic conversations.",
      "example_cn": "他学习韩语已经三年了，现在能进行基本对话。"
    },
    {
      "pos": "noun",
      "explanation_en": "An ethnic group in China, also known as the Han Chinese, comprising over 90% of China's population and historically dominant in Chinese civilization.",
      "explanation_cn": "中国的一个民族，又称汉族，占中国人口90%以上，历史上在中国文明中占据主导地位。",
      "example_en": "The Han dynasty laid the foundation for much of traditional Chinese culture and governance.",
      "example_cn": "汉朝奠定了中国传统文化和治理结构的基础。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "Korean",
      "analysis": "“Korean” 是更标准、更广泛使用的术语，专指朝鲜半岛的语言、人民或文化，无歧义。而 “han” 作为名词单独使用时，可能引起混淆，因其在中文语境中主要指“汉族”，在英语中非正式场合才用于指代韩国人，需依赖上下文判断。"
    },
    {
      "word_to_compare": "Chinese",
      "analysis": "“Chinese” 指中国国籍或汉族文化，但范围更广，涵盖所有中国民族和语言。而 “han” 在英语中特指“汉族”时，是 “Chinese” 的一个子集，强调民族而非国籍，使用范围更窄、更精确。"
    },
    {
      "word_to_compare": "Koreans",
      "analysis": "“Koreans” 是 “han” 在指代朝鲜半岛人民时的规范复数形式，语法更标准，语义更清晰。而 “hans” 作为复数形式在英语中极少使用，且易与“汉”（汉族）混淆，不推荐在正式语境中使用。"
    }
  ]
}