{
  "word": "hand",
  "pronunciation": "hænd",
  "concise_definition": "n. 手, 手部, 指针, 人手; v. 递给, 交付",
  "forms": {
    "plural": "hands"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The part of the human body at the end of the arm, consisting of the palm, fingers, and thumb, used for grasping, holding, and manipulating objects.",
      "explanation_cn": "人体手臂末端的部分，由手掌、手指和拇指组成，用于抓握、持物和操作物体。",
      "example_en": "She washed her hands before eating.",
      "example_cn": "她吃饭前洗了手。"
    },
    {
      "pos": "noun",
      "explanation_en": "A pointer on a clock or watch that indicates the time, such as the hour hand or minute hand.",
      "explanation_cn": "钟表上指示时间的指针，如时针或分针。",
      "example_en": "The hour hand was pointing to three.",
      "example_cn": "时针正指向三点。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person employed to perform a task, especially in manual labor or service roles; often used in the plural to refer to workers collectively.",
      "explanation_cn": "指从事某项工作的人，尤指体力劳动或服务行业中的员工；常用复数形式泛指工人或员工群体。",
      "example_en": "The farm employs over fifty hands during harvest season.",
      "example_cn": "收获季节，这个农场雇佣了五十多名工人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person's manner of doing something, especially in creative or skilled activities such as writing, painting, or playing music.",
      "explanation_cn": "指某人在创作或技艺活动中所表现出的独特风格或方式，如写作、绘画或演奏音乐。",
      "example_en": "The painting bears the unmistakable hand of Picasso.",
      "example_cn": "这幅画明显带有毕加索的独特风格。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give or pass something to someone, often with the hand or by physical transfer.",
      "explanation_cn": "用手将某物递给或交付给某人，强调通过身体动作进行传递。",
      "example_en": "He handed me the keys to the car.",
      "example_cn": "他把车钥匙递给了我。"
    },
    {
      "pos": "verb",
      "explanation_en": "To formally present or deliver something, especially in official or ceremonial contexts.",
      "explanation_cn": "在正式或仪式性场合中正式递交或呈交某物。",
      "example_en": "The ambassador handed the letter to the president.",
      "example_cn": "大使将信件递交给了总统。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "palm",
      "analysis": "“Palm”（手掌）特指手的内侧部分，即五指根部的肉垫区域，是“hand”的一个组成部分。而 “hand” 是一个整体概念，包括手掌、手指和拇指。因此，“palm” 是局部，而 “hand” 是整体。"
    },
    {
      "word_to_compare": "arm",
      "analysis": "“Arm”（手臂）指从肩膀到手腕的整个肢体部分，而 “hand” 仅指手臂最末端的部分。两者是身体结构上的上下位关系，不能互换使用。"
    },
    {
      "word_to_compare": "give",
      "analysis": "“Give”（给予）是一个更广泛、更抽象的动词，可指任何形式的交付，包括抽象事物（如给予建议、给予支持）。而 “hand” 作为动词时，强调通过手部动作进行的物理传递，更具动作性和具体性。"
    }
  ]
}