{
  "word": "handle",
  "pronunciation": "han·dul",
  "concise_definition": "v. 处理, 应对, 操纵; n. 把手, 柄",
  "forms": {
    "third_person_singular": "handles",
    "past_tense": "handled",
    "past_participle": "handled",
    "present_participle": "handling"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To manage, deal with, or cope with a situation, problem, or responsibility, often requiring skill or composure.",
      "explanation_cn": "指管理、应对或处理某种情况、问题或责任，通常需要技巧或冷静。",
      "example_en": "She handled the difficult client with patience and professionalism.",
      "example_cn": "她以耐心和专业精神应对了这位难缠的客户。"
    },
    {
      "pos": "verb",
      "explanation_en": "To physically grasp and control an object, especially by its handle, to move, use, or manipulate it.",
      "explanation_cn": "指用手抓住并控制某物（尤其是通过其把手）以移动、使用或操作它。",
      "example_en": "He handled the fragile vase with great care.",
      "example_cn": "他小心翼翼地拿着这个易碎的花瓶。"
    },
    {
      "pos": "verb",
      "explanation_en": "To manage or operate a machine, system, or process, especially in a technical or practical context.",
      "explanation_cn": "指在技术或实际情境中操作或管理一台机器、系统或流程。",
      "example_en": "The pilot handled the aircraft smoothly during the storm.",
      "example_cn": "飞行员在风暴中平稳地操控了飞机。"
    },
    {
      "pos": "noun",
      "explanation_en": "A part of an object designed to be held in the hand, used for carrying, opening, or operating it.",
      "explanation_cn": "指为便于用手抓握而设计的物体部分，用于搬运、开启或操作该物体。",
      "example_en": "The door has a brass handle on the right side.",
      "example_cn": "门的右侧有一个黄铜把手。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "manage",
      "analysis": "“Manage” (管理) 更侧重于组织、规划和控制资源或人员，常用于抽象事务（如管理时间、团队）。而 “handle” 更强调对具体情境或物体的直接应对或操作，语气更口语化、更注重即时反应。"
    },
    {
      "word_to_compare": "control",
      "analysis": "“Control” (控制) 强调对事物施加权威性或决定性的影响，常带有压制或主导的意味。而 “handle” 更中性，侧重于“操作”或“应付”，不一定意味着完全掌控，有时仅指“妥善处理”。"
    },
    {
      "word_to_compare": "grip",
      "analysis": "“Grip” (紧握) 仅指用手紧紧抓住某物，强调物理接触的力度，不包含“使用”或“处理”的含义。而 “handle” 不仅包含抓握，还隐含了使用、操作或应对的完整动作过程。"
    }
  ]
}