{
  "word": "hands",
  "pronunciation": "hændz",
  "concise_definition": "n. 手, 人手, 指针, 控制",
  "forms": {
    "singular": "hand"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The end part of the human arm beyond the wrist, used for grasping, holding, and manipulating objects; typically consisting of fingers and a thumb.",
      "explanation_cn": "人体手臂在腕部以外的末端部分，用于抓握、持物和操作物体，通常包括手指和拇指。",
      "example_en": "She washed her hands before eating.",
      "example_cn": "她吃饭前洗了手。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or group of people employed to perform a task, especially in manual or physical labor; often used collectively to refer to workers.",
      "explanation_cn": "指从事某项任务的人或一群人，尤指从事体力劳动的工人；常用于集体指代劳动者。",
      "example_en": "The factory employs over 500 hands to operate the machinery.",
      "example_cn": "这家工厂雇佣了五百多名工人来操作机器。"
    },
    {
      "pos": "noun",
      "explanation_en": "The pointers on a clock or watch that indicate the time; the hour hand and minute hand are the most common.",
      "explanation_cn": "钟表上指示时间的指针，最常见的是时针和分针。",
      "example_en": "The hands of the clock pointed to 3:15.",
      "example_cn": "钟表的指针指向三点十五分。"
    },
    {
      "pos": "noun",
      "explanation_en": "Control or management of something, often used in phrases like 'in the hands of' to indicate who is responsible or in charge.",
      "explanation_cn": "对某事物的控制或管理，常用于短语 'in the hands of' 表示谁负责或掌管。",
      "example_en": "The future of the company is in the hands of its new CEO.",
      "example_cn": "公司的未来掌握在新任首席执行官手中。"
    },
    {
      "pos": "noun",
      "explanation_en": "A player's cards in card games, or a set of cards dealt to a player at one time.",
      "explanation_cn": "纸牌游戏中玩家手中的牌，或一次发给玩家的一组牌。",
      "example_en": "He had a winning hand with three aces and a pair of kings.",
      "example_cn": "他手中有三张A和一对K，是赢牌。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "arm",
      "analysis": "“Arm”（手臂）指从肩膀到手腕的整个肢体部分，而 “hand” 仅指腕部以下的部分，是手臂的末端器官。两者是整体与部分的关系，不能互换。"
    },
    {
      "word_to_compare": "staff",
      "analysis": "“Staff”（员工/职员）是更正式、更广泛的术语，泛指组织中的所有工作人员，包括管理人员；而 “hands” 通常特指从事体力劳动的基层员工，语气更口语化、更侧重操作性工作。"
    },
    {
      "word_to_compare": "fingers",
      "analysis": "“Fingers”（手指）是手的组成部分，指五个指头（包括拇指），而 “hand” 是包含手掌、手指和拇指的整体结构。使用 “fingers” 时强调的是更精细的动作，如打字或弹琴；而 “hand” 强调的是整体动作，如握手或挥手。"
    }
  ]
}