{
  "word": "handsome",
  "pronunciation": "han·sum",
  "concise_definition": "adj. 英俊的, 漂亮的, 慷慨的, 不少的",
  "forms": {
    "comparative": "handsomer",
    "superlative": "handsomest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having a pleasing and attractive appearance, especially in a classic, well-proportioned, or dignified way; typically used to describe men or masculine features.",
      "explanation_cn": "指外貌令人愉悦且有吸引力，尤其具有经典、匀称或庄重的特质；通常用于形容男性或男性化的外貌。",
      "example_en": "He's a handsome man with sharp features and a confident smile.",
      "example_cn": "他是一位相貌英俊、五官分明、笑容自信的男子。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Of considerable size, amount, or value; generous or substantial, often used to describe money, rewards, or improvements.",
      "explanation_cn": "指数量、规模或价值相当大；表示慷慨或可观的，常用于描述金钱、报酬或改善程度。",
      "example_en": "She received a handsome salary for her work at the firm.",
      "example_cn": "她在这家公司工作获得了丰厚的薪水。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Attractive in a non-traditional or understated way; can be used to describe objects, designs, or even women in a more neutral or elegant sense.",
      "explanation_cn": "指以非传统或含蓄的方式具有吸引力；可用于描述物品、设计，甚至在更中性或优雅的语境下形容女性。",
      "example_en": "The room had a handsome simplicity, with clean lines and natural wood.",
      "example_cn": "这个房间有着简洁雅致的美感，线条干净，使用天然木材。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "beautiful",
      "analysis": "“Beautiful” (美丽的) 通常用于更广泛、更感性或更柔和的美感，常用于形容女性、自然景观或艺术作品，带有强烈的情感色彩。而 “handsome” 更强调庄重、匀称、有力量感的美，多用于男性或具有阳刚之美的事物，情感色彩更克制。"
    },
    {
      "word_to_compare": "attractive",
      "analysis": "“Attractive” (有吸引力的) 是一个更中性、更宽泛的词，涵盖外貌、性格、气质等多方面吸引力，不局限于视觉美感。而 “handsome” 更具体地指向视觉上的经典美感，尤其在男性身上使用时具有文化上的特定含义。"
    },
    {
      "word_to_compare": "good-looking",
      "analysis": "“Good-looking” (长相好看的) 是口语化表达，语气随意，仅指外貌好看，缺乏 “handsome” 所蕴含的庄重、优雅或体面的内涵。后者在正式语境中更显品位，而前者多用于日常闲谈。"
    }
  ]
}