{
  "word": "handicap",
  "pronunciation": "han·di·kap",
  "concise_definition": "n. 缺陷, 障碍, 让利; v. 使处于不利地位",
  "forms": {
    "third_person_singular": "handicaps",
    "past_tense": "handicapped",
    "past_participle": "handicapped",
    "present_participle": "handicapping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A physical or mental condition that limits a person's movements, senses, or activities, often used to describe a disability that affects daily functioning.",
      "explanation_cn": "指限制个人行动、感官或活动能力的生理或心理状况，常用于描述影响日常生活的残疾。",
      "example_en": "The new building includes ramps and elevators to accommodate people with handicaps.",
      "example_cn": "这座新建筑设有坡道和电梯，以方便有身体障碍的人士使用。"
    },
    {
      "pos": "noun",
      "explanation_en": "A disadvantage imposed in sports or games to level the playing field between competitors of unequal ability, such as giving a weaker player extra points or a head start.",
      "explanation_cn": "指在体育或游戏中为平衡能力不同者之间的竞争而施加的不利条件，例如给予较弱者额外分数或起跑优势。",
      "example_en": "In golf, the player with the higher handicap gets to subtract more strokes from their total score.",
      "example_cn": "在高尔夫球中，差点较高的球员可以从总成绩中扣除更多杆数。"
    },
    {
      "pos": "verb",
      "explanation_en": "To put someone or something at a disadvantage, especially by limiting their ability to succeed or function effectively.",
      "explanation_cn": "指使某人或某事物处于不利地位，尤其是通过限制其成功或有效运作的能力。",
      "example_en": "His lack of experience handicapped his chances of getting the promotion.",
      "example_cn": "他缺乏经验，使他晋升的机会大打折扣。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "disability",
      "analysis": "“Disability” (残疾) 是一个更中性、更正式的术语，专指因身体、感官、认知或精神状况导致的功能受限，常用于法律和医疗语境。而 “handicap” 有时带有贬义或过时色彩，尤其在指人时，现代用法更倾向使用 “person with a disability”。但在体育语境中，“handicap” 仍为标准术语。"
    },
    {
      "word_to_compare": "obstacle",
      "analysis": "“Obstacle” (障碍) 指任何阻碍进展的外部困难或障碍物，可以是物理的、制度的或抽象的（如政策、偏见），不一定是个人固有的缺陷。而 “handicap” 更强调内在或固有的限制，尤其在体育中是系统性设定的补偿机制。"
    },
    {
      "word_to_compare": "burden",
      "analysis": "“Burden” (负担) 指一种沉重的责任、压力或负担，通常是心理或情感上的，如经济负担、道德负担。而 “handicap” 更侧重于能力上的限制或结构性劣势，不必然伴随情感压力，但可能造成类似后果。"
    }
  ]
}