{
  "word": "hang",
  "pronunciation": "hang",
  "concise_definition": "v. 悬挂, 吊着, 绞死; n. 悬挂, 悬垂, 窘境",
  "forms": {
    "third_person_singular": "hangs",
    "past_tense": "hung",
    "past_participle": "hung",
    "present_participle": "hanging"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To suspend or attach something so that it hangs freely, typically from a higher point.",
      "explanation_cn": "指将某物从较高处悬挂或固定，使其自由垂下。",
      "example_en": "She hung the painting on the wall above the sofa.",
      "example_cn": "她把画挂在了沙发上方的墙上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To execute someone by suspending them by the neck with a rope, typically as a legal punishment.",
      "explanation_cn": "指用绳索将人吊起至颈部窒息而死，通常作为法律惩罚。",
      "example_en": "The criminal was hanged for his crimes in the 19th century.",
      "example_cn": "这名罪犯在19世纪因罪行被处以绞刑。"
    },
    {
      "pos": "verb",
      "explanation_en": "To spend time idly or loitering in a particular place, often in a relaxed or aimless way.",
      "explanation_cn": "指无所事事地逗留或闲逛于某地，常带有放松或漫无目的的意味。",
      "example_en": "The teenagers were hanging around the mall after school.",
      "example_cn": "放学后，那些青少年在商场周围闲逛。"
    },
    {
      "pos": "noun",
      "explanation_en": "A state of being suspended or hanging, often used to describe the way something is positioned or the feeling of instability.",
      "explanation_cn": "指处于悬挂或垂挂的状态，常用于描述某物的悬挂方式或一种不稳定的感受。",
      "example_en": "There was a tense hang in the air after the argument.",
      "example_cn": "争吵之后，空气中弥漫着紧张的气氛。"
    },
    {
      "pos": "noun",
      "explanation_en": "A difficult or awkward situation, especially one that is hard to escape from or resolve.",
      "explanation_cn": "指一种困难或尴尬的处境，尤指难以摆脱或解决的困境。",
      "example_en": "He found himself in a real hang after missing the deadline.",
      "example_cn": "他因错过截止日期而陷入了真正的窘境。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "suspend",
      "analysis": "“Suspend” (悬挂/暂停) 更正式，常用于技术或制度语境，强调暂时性或中止状态，如暂停账户、悬挂物体。而 “hang” 更口语化，强调自然垂挂的状态，常用于日常场景，如挂衣服、挂画。"
    },
    {
      "word_to_compare": "dangle",
      "analysis": "“Dangle” (摇晃悬挂) 强调物体被悬挂时轻微晃动或下垂的动态感，常带有一种不稳固或诱惑的意味，如项链 dangling 在胸前。而 “hang” 更中性，仅表示静态悬挂，无晃动含义。"
    },
    {
      "word_to_compare": "linger",
      "analysis": "“Linger” (逗留/徘徊) 与 “hang around” 意义相近，都表示不愿离开，但 “linger” 更强调因留恋、犹豫或缓慢而停留，常带情感色彩；而 “hang” 更随意、更口语化，常用于年轻人闲逛的语境，情感中性。"
    }
  ]
}