{
  "word": "harassment",
  "pronunciation": "huh·ras·muhnt",
  "concise_definition": "n. 骚扰, 侵扰, 持续纠缠",
  "forms": {
    "plural": "harassments"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Persistent and unwanted behavior directed at an individual or group, causing distress, fear, or humiliation, often involving threats, intimidation, or offensive remarks.",
      "explanation_cn": "针对个人或群体持续且不受欢迎的行为，造成困扰、恐惧或羞辱，通常包括威胁、恐吓或冒犯性言论。",
      "example_en": "The employee filed a formal complaint after experiencing verbal harassment from her supervisor.",
      "example_cn": "这名员工在遭受主管的语言骚扰后，提交了正式投诉。"
    },
    {
      "pos": "noun",
      "explanation_en": "Systematic and discriminatory behavior in workplaces, schools, or public spaces that targets individuals based on race, gender, religion, sexual orientation, or other protected characteristics.",
      "explanation_cn": "在工作场所、学校或公共场所中，基于种族、性别、宗教、性取向或其他受保护特征而对个人实施的系统性歧视行为。",
      "example_en": "Sexual harassment is illegal under federal law and must be addressed by employers.",
      "example_cn": "性骚扰违反联邦法律，雇主必须予以处理。"
    },
    {
      "pos": "noun",
      "explanation_en": "Repeated and intrusive actions, such as unwanted phone calls, messages, or physical presence, that disrupt a person’s peace or safety.",
      "explanation_cn": "重复且侵扰性的行为，如不受欢迎的电话、短信或身体出现，扰乱个人的安宁或安全。",
      "example_en": "The victim received dozens of threatening messages a day, constituting cyber harassment.",
      "example_cn": "受害者每天收到数十条威胁信息，构成网络骚扰。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bullying",
      "analysis": "“Bullying”（欺凌）通常指在权力不对等关系中，通过身体、语言或社交手段反复压迫他人，常见于儿童或青少年群体。而 “harassment” 更广泛，可发生在任何年龄和情境中，尤其强调法律意义上的非法行为，如职场或公共场所的歧视性骚扰。"
    },
    {
      "word_to_compare": "persecution",
      "analysis": "“Persecution”（迫害）指基于政治、宗教、种族等原因对个人或群体实施的系统性压迫，通常由国家或权威机构主导，后果更严重，常涉及人身自由剥夺。而 “harassment” 虽然也可能严重，但多为个体或小团体实施的持续性骚扰，尚未达到国家层面的系统性压迫。"
    },
    {
      "word_to_compare": "annoyance",
      "analysis": "“Annoyance”（烦扰）指轻微的、短暂的令人不快的感觉，如噪音或小摩擦，不具威胁性或持续性。而 “harassment” 是有目的、重复且具有压迫性的行为，会造成心理伤害，通常构成法律问题，远超一般意义上的“烦扰”。"
    }
  ]
}