{
  "word": "harassed",
  "pronunciation": "huh·rasd",
  "concise_definition": "v. 骚扰, 持续纠缠, 使烦恼",
  "forms": {
    "base_form": "harass",
    "third_person_singular": "harasses",
    "past_tense": "harassed",
    "past_participle": "harassed",
    "present_participle": "harassing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To subject someone to persistent and unwanted attention, pressure, or abuse, often causing distress, fear, or discomfort, especially in contexts such as workplace, school, or personal relationships.",
      "explanation_cn": "对某人进行持续且不受欢迎的注意、施压或虐待，通常导致其感到困扰、恐惧或不适，尤其常见于工作场所、学校或私人关系中。",
      "example_en": "She was harassed by her supervisor with inappropriate comments about her appearance.",
      "example_cn": "她因上司对她外貌的不当评论而遭受骚扰。"
    },
    {
      "pos": "verb",
      "explanation_en": "To repeatedly bother or pester someone, often in a way that is annoying or intimidating, even if not legally classified as abuse.",
      "explanation_cn": "反复打扰或纠缠某人，方式通常令人烦扰或具有恐吓性，即使尚未构成法律意义上的虐待。",
      "example_en": "The telemarketers harassed him with calls every evening until he blocked their number.",
      "example_cn": "这些电话推销员每天晚上都给他打电话，直到他拉黑了他们的号码。"
    },
    {
      "pos": "verb",
      "explanation_en": "To overwhelm or distress someone through persistent demands, criticism, or pressure, often leading to emotional exhaustion.",
      "explanation_cn": "通过持续的苛求、批评或压力使某人感到不堪重负或情绪耗竭。",
      "example_en": "He was harassed by his boss with unrealistic deadlines and constant micromanagement.",
      "example_cn": "他的上司给他设定不切实际的截止日期并事无巨细地监控，使他倍感压力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bully",
      "analysis": "“Bully”（欺凌）通常指利用权力、体格或地位对他人进行恐吓、威胁或羞辱，常带有明显的暴力或支配意图，多见于儿童或青少年群体。而 “harass” 更广泛，可包括言语、视觉、数字等多种形式的持续骚扰，不一定涉及直接暴力，但强调重复性和侵扰性。"
    },
    {
      "word_to_compare": "annoy",
      "analysis": "“Annoy”（使烦恼）指轻微的、短暂的令人不快，如噪音或小动作引起的烦躁，程度较轻，通常不构成心理伤害。而 “harass” 意味着长期、系统性的侵扰，可能造成严重心理影响，甚至构成法律问题。"
    },
    {
      "word_to_compare": "persecute",
      "analysis": "“Persecute”（迫害）通常指基于种族、宗教、政治等身份而进行的系统性压迫或暴力对待，具有强烈的政治或意识形态背景，常由国家或组织主导。而 “harass” 更多是个人或小群体层面的持续骚扰行为，虽也可能涉及歧视，但范围和规模较小。"
    }
  ]
}