{
  "word": "harassing",
  "pronunciation": "huh·ras·ing",
  "concise_definition": "v. 骚扰, 持续纠缠, 侵扰",
  "forms": {
    "base_form": "harass",
    "third_person_singular": "harasses",
    "past_tense": "harassed",
    "past_participle": "harassed",
    "present_participle": "harassing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To subject someone to persistent, unwanted, and aggressive behavior that causes distress, fear, or discomfort, often involving verbal abuse, threats, or physical intrusion.",
      "explanation_cn": "指对某人持续施加不受欢迎且具有攻击性的行为，导致其感到困扰、恐惧或不适，通常包括言语辱骂、威胁或身体侵扰。",
      "example_en": "The employee filed a complaint after being repeatedly harassed by a coworker.",
      "example_cn": "这名员工在持续遭到同事骚扰后提起了投诉。"
    },
    {
      "pos": "verb",
      "explanation_en": "To annoy or pressure someone continuously, especially through repeated actions such as phone calls, messages, or following someone.",
      "explanation_cn": "指通过重复的行为（如频繁打电话、发信息或跟踪）持续地烦扰或施压某人。",
      "example_en": "She received harassing text messages from an unknown number for weeks.",
      "example_cn": "她连续数周收到未知号码发来的骚扰短信。"
    },
    {
      "pos": "verb",
      "explanation_en": "To interfere with or obstruct someone’s rights or activities through persistent and intimidating conduct, especially in legal, workplace, or social contexts.",
      "explanation_cn": "指通过持续且具有恐吓性质的行为干扰或阻碍某人的权利或活动，尤其在法律、职场或社会环境中。",
      "example_en": "The protesters were accused of harassing the judges by picketing outside their homes.",
      "example_cn": "抗议者被指控通过在法官家外示威来骚扰法官。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bother",
      "analysis": "“Bother”（打扰）语气较轻，通常指轻微的、非恶意的干扰，如问问题或打断工作，不带有威胁或持续性。而 “harassing” 强调恶意、重复和压迫性，常涉及法律或道德上的严重违规。"
    },
    {
      "word_to_compare": "pester",
      "analysis": "“Pester”（纠缠）多用于日常语境，形容反复请求或抱怨，常带点烦人但不具威胁的意味，如孩子缠着要糖果。而 “harassing” 更严重，常涉及权力不对等、心理压迫或违法，如职场性骚扰。"
    },
    {
      "word_to_compare": "intimidate",
      "analysis": "“Intimidate”（恐吓）侧重于通过威胁或威吓使他人感到害怕而屈服，不一定包含持续行为。而 “harassing” 强调行为的重复性和侵扰性，即使没有直接威胁，也可能构成骚扰，如持续发送信息或跟踪。"
    }
  ]
}