{
  "word": "harbour",
  "pronunciation": "hahr·bər",
  "concise_definition": "n. 港口, 港湾; v. 庇护, 藏匿, 心怀（情感）",
  "forms": {
    "third_person_singular": "harbours",
    "past_tense": "harboured",
    "past_participle": "harboured",
    "present_participle": "harbouring",
    "us_spelling": "harbor"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sheltered area of water where ships can anchor safely, typically with facilities for loading, unloading, and repairing vessels.",
      "explanation_cn": "指供船只停泊、避风并进行装卸或维修的受保护水域，通常配有相应的港口设施。",
      "example_en": "The fishing boats returned to the harbour just before the storm hit.",
      "example_cn": "渔船在风暴来临前返回了港口。"
    },
    {
      "pos": "noun",
      "explanation_en": "A place or state of refuge or protection, often used metaphorically to describe emotional or psychological safety.",
      "explanation_cn": "指一种庇护所或保护状态，常用于比喻意义上，表示情感或心理上的安全港。",
      "example_en": "For her, the library was a harbour from the chaos of daily life.",
      "example_cn": "对她而言，图书馆是逃离日常纷扰的避风港。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provide shelter or protection to someone or something, especially someone who is wanted or in danger.",
      "explanation_cn": "指为某人或某物提供庇护，尤指为被通缉者或处于危险中的人提供藏身之处。",
      "example_en": "The villagers harboured the escaped prisoner for three weeks.",
      "example_cn": "村民们为这名逃犯庇护了三个星期。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hold or nurture a feeling, especially a negative one such as resentment, anger, or suspicion, over a long period.",
      "explanation_cn": "指长期心怀某种情感，尤指负面情绪，如怨恨、愤怒或猜疑。",
      "example_en": "He has been harbouring resentment toward his colleague since the promotion was given to someone else.",
      "example_cn": "自从晋升给了别人，他就一直对这位同事心怀怨恨。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "port",
      "analysis": "“Port”（港口）与 “harbour” 常可互换，但 “port” 更强调商业和运输功能，通常指大型、有组织的国际贸易港口；而 “harbour” 更侧重物理上的安全停泊环境，可以是自然形成的海湾，规模较小，不一定具备商业设施。"
    },
    {
      "word_to_compare": "shelter",
      "analysis": "“Shelter”（庇护所）泛指任何形式的保护性空间，如避难所、房屋等，用途广泛；而 “harbour” 作为动词时，特指隐秘地提供庇护或长期心怀情绪，带有更强烈的隐含意图或情感深度，语义更丰富。"
    },
    {
      "word_to_compare": "refuge",
      "analysis": "“Refuge”（避难所）多指为逃离危险或迫害而寻求的临时安全地点，常用于政治或人道语境；而 “harbour” 作为动词时，隐含主动提供藏身之处的行为，有时带有非法或道德争议的色彩，如庇护逃犯，语义更具主动性与潜在负面含义。"
    }
  ]
}