{
  "word": "hardcore",
  "pronunciation": "hahrd·kohr",
  "concise_definition": "adj. 极端的, 铁杆的, 硬核的; n. 铁杆粉丝, 核心群体",
  "forms": {
    "comparative": "hardcore",
    "superlative": "hardcore"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Characterized by extreme intensity, commitment, or severity; often used to describe people, attitudes, or activities that are uncompromising, radical, or deeply dedicated.",
      "explanation_cn": "形容具有极端强度、坚定承诺或严重性的特征；常用于描述那些毫不妥协、激进或极度投入的人、态度或活动。",
      "example_en": "He's a hardcore fan of heavy metal music and has attended over 100 concerts.",
      "example_cn": "他是重金属音乐的铁杆粉丝，已经参加过一百多场演唱会。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or denoting content that is explicit, violent, or sexually graphic, especially in media such as films, video games, or music.",
      "explanation_cn": "指在电影、电子游戏或音乐等媒体中内容露骨、暴力或具有性暗示的，通常用于描述超出常规尺度的作品。",
      "example_en": "The game features hardcore violence and was rated adults-only.",
      "example_cn": "这款游戏包含极端暴力内容，被评为仅限成人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A core group of people who are deeply committed to a particular activity, belief, or subculture, often forming the most dedicated or extreme segment of a larger group.",
      "explanation_cn": "指对某种活动、信仰或亚文化极度投入的核心群体，通常是更大群体中最忠实或最极端的部分。",
      "example_en": "The hardcore of the environmental movement continues to protest despite public apathy.",
      "example_cn": "尽管公众漠不关心，环保运动的核心群体仍在持续抗议。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "extreme",
      "analysis": "“Extreme” (极端的) 是一个通用形容词，泛指任何超出常规或正常范围的事物，适用于广泛语境（如天气、行为、观点）。而 “hardcore” 更具文化语境色彩，常特指对某种爱好、风格或信念的狂热、持久且不妥协的投入，带有亚文化或群体认同的意味。"
    },
    {
      "word_to_compare": "fanatic",
      "analysis": "“Fanatic” (狂热者) 常带有贬义，强调非理性、偏执甚至危险的狂热。而 “hardcore” 虽然也指极度投入，但中性或褒义色彩更强，尤其在音乐、游戏、运动等领域，是群体内部的自我认同标签，不必然包含负面评价。"
    },
    {
      "word_to_compare": "dedicated",
      "analysis": "“Dedicated” (专注的) 强调持续投入和责任感，通常是正面、理性的形容词，适用于职业、学习等常规语境。而 “hardcore” 暗示的不仅是专注，更是超越常规的强度、风格甚至挑衅性，常与反主流、高门槛或高风险行为相关联。"
    }
  ]
}