{
  "word": "harness",
  "pronunciation": "hahr·nus",
  "concise_definition": "v. 利用, 控制, 驯服; n. 马具, 装置",
  "forms": {
    "third_person_singular": "harnesses",
    "past_tense": "harnessed",
    "past_participle": "harnessed",
    "present_participle": "harnessing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To capture and use a natural force or resource, especially one that is powerful or difficult to control, for a practical purpose.",
      "explanation_cn": "指捕获并利用一种强大或难以控制的自然力量或资源，以实现实际用途。",
      "example_en": "Scientists are working to harness solar energy to power entire cities.",
      "example_cn": "科学家们正致力于利用太阳能为整个城市供电。"
    },
    {
      "pos": "verb",
      "explanation_en": "To control or direct something, especially energy, emotion, or potential, in a focused and productive way.",
      "explanation_cn": "指以集中且高效的方式控制或引导某种力量、情绪或潜力。",
      "example_en": "She harnessed her anger to fuel her determination to succeed.",
      "example_cn": "她将愤怒转化为实现成功的决心。"
    },
    {
      "pos": "noun",
      "explanation_en": "A set of straps or leather fittings used to attach an animal (such as a horse) to a vehicle or load, enabling it to pull.",
      "explanation_cn": "指用于将动物（如马）连接到车辆或负载上的一套皮带或皮革装置，使其能够拉动物体。",
      "example_en": "The farmer adjusted the horse's harness before hitching it to the plow.",
      "example_cn": "农夫在将马套上犁之前调整了马具。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device or system designed to capture, channel, or utilize a specific form of energy or force.",
      "explanation_cn": "指用于捕获、引导或利用某种特定能量或力量的装置或系统。",
      "example_en": "Wind turbines are part of a larger harness system for renewable energy.",
      "example_cn": "风力涡轮机是可再生能源利用系统的一部分。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "utilize",
      "analysis": "“Utilize” (利用) 是一个更通用的词，泛指使用某物以达到目的，不强调力量的控制或捕获过程。而 “harness” 隐含了对强大、原始或难以驾驭的能量的主动引导和转化，更具技术性和主动性。"
    },
    {
      "word_to_compare": "control",
      "analysis": "“Control” (控制) 侧重于限制、管理或约束某物的行为，常带有压制或主导的含义。而 “harness” 更强调将力量转化为有益用途，是积极的引导而非单纯压制。例如，控制情绪 ≠ 利用情绪。"
    },
    {
      "word_to_compare": "tame",
      "analysis": "“Tame” (驯服) 指使野性或危险的事物变得温顺、可预测，但不一定用于实际用途。而 “harness” 在驯服之后更进一步，强调将其转化为可利用的资源。例如，驯服一匹野马 ≠ 利用它拉车。"
    }
  ]
}