{
  "word": "harvesting",
  "pronunciation": "hahr·ves·ting",
  "concise_definition": "n. 收获, 采收, 收割",
  "forms": {
    "base_form": "harvest",
    "third_person_singular": "harvests",
    "past_tense": "harvested",
    "past_participle": "harvested",
    "present_participle": "harvesting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of gathering mature crops from the fields, or the yield obtained from such a process; often used to refer to the seasonal collection of agricultural produce.",
      "explanation_cn": "指从田地里收割成熟作物的过程，或指由此获得的收成；常用于指农业产品的季节性采集。",
      "example_en": "The harvesting of wheat began in early July this year.",
      "example_cn": "今年小麦的收割始于七月初。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of collecting or gathering something valuable from a natural or artificial source, not limited to agriculture (e.g., data, organs, fish).",
      "explanation_cn": "指从自然或人工来源中收集或获取有价值之物的行为，不仅限于农业（如数据、器官、鱼类等）。",
      "example_en": "The harvesting of personal data by tech companies has raised serious privacy concerns.",
      "example_cn": "科技公司对个人数据的采集引发了严重的隐私担忧。"
    },
    {
      "pos": "noun",
      "explanation_en": "The period or season during which crops are gathered, often associated with abundance and the culmination of agricultural labor.",
      "explanation_cn": "指作物被收割的时期或季节，常与丰收和农业劳动的成果相联系。",
      "example_en": "In many cultures, harvesting is celebrated with festivals and feasts.",
      "example_cn": "在许多文化中，收获季节会以节日和盛宴来庆祝。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "collection",
      "analysis": "“Collection”（收集）是一个更广泛、更中性的词，泛指从任何地方聚集物品或信息，不强调成熟、周期性或自然生长的过程。而 “harvesting” 特指在自然成熟或准备就绪时进行的系统性采集，常带有季节性、农业或资源再生的语境。"
    },
    {
      "word_to_compare": "gathering",
      "analysis": "“Gathering”（采集）强调的是聚集行为本身，通常用于非农业场景，如采集野果、蘑菇或信息，且不一定涉及成熟或周期性。而 “harvesting” 隐含了等待成熟、有计划、有节律的收获过程，常与农业生产或资源可持续利用相关。"
    },
    {
      "word_to_compare": "reaping",
      "analysis": "“Reaping”（收割）与 “harvesting” 几乎同义，常可互换，但 “reaping” 更具文学性或象征性，常用于比喻性语境（如 “reap what you sow”），而 “harvesting” 更偏向实际、技术性或现代语境，如数据收割、渔业收获等。"
    }
  ]
}