{
  "word": "harvest",
  "pronunciation": "hahr·vist",
  "concise_definition": "n. 收获, 收成; v. 收割, 采集, 利用",
  "forms": {
    "plural": "harvests",
    "third_person_singular": "harvests",
    "past_tense": "harvested",
    "past_participle": "harvested",
    "present_participle": "harvesting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of gathering mature crops from the fields, or the total amount of crops gathered in a single growing season.",
      "explanation_cn": "指从田地里收割成熟作物的过程，或指在一个生长季节内收获的全部作物总量。",
      "example_en": "This year's harvest was exceptionally bountiful due to favorable weather conditions.",
      "example_cn": "由于天气条件有利，今年的收成格外丰盛。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of collecting or gathering something valuable from a natural or human source, such as organs, data, or energy.",
      "explanation_cn": "指从自然或人为来源中收集或获取有价值的事物，如器官、数据或能源。",
      "example_en": "The hospital has a successful organ harvest program that saves many lives.",
      "example_cn": "这家医院有一个成功的器官采集项目，挽救了许多生命。"
    },
    {
      "pos": "verb",
      "explanation_en": "To gather or collect crops, fruits, or other agricultural products when they are ripe and ready for use.",
      "explanation_cn": "指在作物、水果或其他农产品成熟时进行收割或采集。",
      "example_en": "Farmers begin to harvest wheat in late summer.",
      "example_cn": "农民们在夏末开始收割小麦。"
    },
    {
      "pos": "verb",
      "explanation_en": "To obtain or extract something useful from a source, often through systematic effort or technology.",
      "explanation_cn": "指通过系统性努力或技术手段从某种来源中获取或提取有用之物。",
      "example_en": "Scientists are working to harvest energy from ocean waves.",
      "example_cn": "科学家们正在研究如何从海浪中获取能源。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "gather",
      "analysis": "“Gather” (收集) 是一个更广泛、更通用的词，指将分散的物品聚集在一起，不特指成熟或有季节性，可用于物品、人群、信息等。而 “harvest” 通常特指农业或自然资源的周期性采集，带有成熟、时机和产出的含义。"
    },
    {
      "word_to_compare": "reap",
      "analysis": "“Reap” (收获) 与 “harvest” 在农业语境中几乎可互换，但 “reap” 更具文学性或比喻性，常用于象征性表达（如 reap the rewards）。它更强调“获得回报”的结果，而 “harvest” 更侧重于实际的采集行为和过程。"
    },
    {
      "word_to_compare": "collect",
      "analysis": "“Collect” (收集) 强调有意识地、持续地积累某物，通常不涉及自然成熟过程，如收集邮票、数据或艺术品。而 “harvest” 隐含了等待自然成熟、顺应时节的含义，具有更强的生物或周期性特征。"
    }
  ]
}