{
  "word": "haunting",
  "pronunciation": "haw·nting",
  "concise_definition": "adj. 难以忘怀的, 令人萦绕心头的, 阴森的; n. (尤指鬼魂) 出现, 侵扰",
  "forms": {
    "comparative": "more haunting",
    "superlative": "most haunting"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing something (such as a memory, melody, image, or experience) that lingers in the mind with deep emotional resonance, often evoking sadness, nostalgia, or unease.",
      "explanation_cn": "形容某种事物（如记忆、旋律、图像或经历）在脑海中久久萦绕，常引发深切的悲伤、怀旧或不安情绪。",
      "example_en": "The haunting melody of the violin stayed with me long after the concert ended.",
      "example_cn": "小提琴那令人难以忘怀的旋律，在音乐会结束后仍久久萦绕在我心头。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing a place or atmosphere that feels eerie, mysterious, or as if inhabited by spirits or past events.",
      "explanation_cn": "形容一个地方或氛围显得阴森、神秘，仿佛有幽灵出没或残留着过去的痕迹。",
      "example_en": "We explored the haunting ruins of the abandoned castle, its windows like empty eye sockets.",
      "example_cn": "我们探索了那座被遗弃城堡的阴森废墟，它的窗户如同空洞的眼窝。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of appearing or intruding persistently, especially by a ghost or a memory; often used in plural form 'hauntings'.",
      "explanation_cn": "指（尤指鬼魂或记忆）持续出现或侵扰的行为，常以复数形式 'hauntings' 使用。",
      "example_en": "The family reported several hauntings in the house, including footsteps in the hallway at night.",
      "example_cn": "这家人报告说房子里发生过几次灵异现象，包括夜里走廊里传来脚步声。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "memorable",
      "analysis": "“Memorable”（令人难忘的）泛指任何值得记住的经历，通常是正面或中性的，如一次愉快的旅行或一场精彩的演出。而 “haunting” 强调的是一种挥之不去、带有情感负担的深刻印象，常与悲伤、恐惧或失落相关，情感色彩更强烈、更复杂。"
    },
    {
      "word_to_compare": "eerie",
      "analysis": "“Eerie”（阴森的、怪异的）侧重于环境或氛围带来的不安感，强调神秘和超自然的恐怖，但不一定引发持久的情感共鸣。而 “haunting” 不仅包含这种氛围，更强调其在心理上的持续影响，是记忆层面的残留，比 “eerie” 更具情感深度。"
    },
    {
      "word_to_compare": "evocative",
      "analysis": "“Evocative”（唤起记忆的）指能激发联想或情感反应的事物，可以是积极的（如一首歌唤起童年回忆）。而 “haunting” 是一种特定类型的 evocative，特指那些令人痛苦、挥之不去、带有沉重情绪的唤起，带有负面或忧郁的色彩。"
    }
  ]
}