{
  "word": "haunts",
  "pronunciation": "hawnts",
  "concise_definition": "v. 经常出没于, 使萦绕心头, 使难忘; n. 经常光顾的地方",
  "forms": {
    "third_person_singular": "haunts",
    "past_tense": "haunted",
    "past_participle": "haunted",
    "present_participle": "haunting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To visit or inhabit a place frequently, especially in a way that is persistent, mysterious, or unsettling; often used to describe ghosts or people who return regularly to a location.",
      "explanation_cn": "指频繁地造访或栖息于某地，尤其带有持续性、神秘性或令人不安的意味；常用于描述幽灵或经常返回某地的人。",
      "example_en": "The old mansion is haunted by the ghost of its former owner.",
      "example_cn": "这座旧宅邸常有前主人的幽灵出没。"
    },
    {
      "pos": "verb",
      "explanation_en": "To persistently occupy someone's thoughts or memories, often in a troubling or emotional way, as if a memory or feeling refuses to leave.",
      "explanation_cn": "指某种记忆、情感或想法反复萦绕在某人脑海中，通常带有困扰或情绪上的影响，仿佛无法摆脱。",
      "example_en": "The sound of her laughter still haunts me after all these years.",
      "example_cn": "多年后，她笑声的声音仍在我心头挥之不去。"
    },
    {
      "pos": "noun",
      "explanation_en": "A place that someone visits regularly, especially one that is favored or familiar; often used informally to describe a favorite hangout.",
      "explanation_cn": "指某人经常光顾的地方，尤指其偏爱或熟悉的场所；常用于非正式语境中描述常去的聚会地点。",
      "example_en": "That little café on the corner is my favorite haunt.",
      "example_cn": "街角那家小咖啡馆是我最爱的常去之地。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "haunt",
      "analysis": "“Haunt” 作为动词时，强调一种反复、挥之不去的出现或萦绕，常带有超自然或心理层面的沉重感；而 “visit” 或 “frequent” 虽也表示经常去某地，但缺乏情感或神秘色彩，语气中性。"
    },
    {
      "word_to_compare": "linger",
      "analysis": "“Linger” (逗留、徘徊) 指缓慢地离开或持续存在，常用于描述气味、感觉或人的停留，但不强调“反复性”或“侵扰性”。而 “haunt” 更具持续性、侵入性，甚至带有压迫感，尤其在心理层面。"
    },
    {
      "word_to_compare": "recalls",
      "analysis": "“Recall” (回忆) 是有意识地唤起记忆，通常是主动的、可控的；而 “haunt” 描述的是记忆或情感无意识地、反复地侵入思维，带有被动性和情感负担，更富文学性和情绪张力。"
    }
  ]
}