{
  "word": "haunt",
  "pronunciation": "hawnt",
  "concise_definition": "v. 骚扰, 出没, 萦绕; n. 常去的地方",
  "forms": {
    "third_person_singular": "haunts",
    "past_tense": "haunted",
    "past_participle": "haunted",
    "present_participle": "haunting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To visit or inhabit a place repeatedly, especially in a ghostly or supernatural manner, often causing fear or unease.",
      "explanation_cn": "指（鬼魂等）反复出没于某地，通常带有超自然性质，引发恐惧或不安。",
      "example_en": "The old mansion is said to be haunted by the spirit of its former owner.",
      "example_cn": "据说这座老宅子被前主人的幽灵所困扰。"
    },
    {
      "pos": "verb",
      "explanation_en": "To persistently trouble or disturb someone’s mind, often with memories, regrets, or fears that are difficult to shake off.",
      "explanation_cn": "指某种记忆、悔恨或恐惧反复萦绕心头，使人难以摆脱，造成心理困扰。",
      "example_en": "The memory of her lost child still haunts her every night.",
      "example_cn": "她失去孩子的记忆每晚都萦绕在心头。"
    },
    {
      "pos": "verb",
      "explanation_en": "To frequent a place regularly, often out of habit or preference, especially in a casual or informal context.",
      "explanation_cn": "指经常光顾某个地方，通常出于习惯或偏好，多用于非正式语境。",
      "example_en": "He haunts the local coffee shop every morning before work.",
      "example_cn": "他每天上班前都会去那家本地咖啡馆。"
    },
    {
      "pos": "noun",
      "explanation_en": "A place that someone visits frequently, especially one that is personally significant or favored.",
      "explanation_cn": "指某人经常光顾的地方，尤其是具有个人意义或偏爱的场所。",
      "example_en": "That little bookstore is my favorite haunt.",
      "example_cn": "那家小书店是我最爱的常去之地。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ghost",
      "analysis": "“Ghost” (幽灵) 是名词，指超自然的灵体本身，而 “haunt” 是动词，描述幽灵或某种力量对地点或人的持续影响。前者是主体，后者是行为。例如：The ghost appears — 与 — The house is haunted by a ghost. 后者强调影响而非实体。"
    },
    {
      "word_to_compare": "torment",
      "analysis": "“Torment” (折磨) 指主动施加剧烈的身心痛苦，通常带有恶意或压迫性，语义更强烈、更直接。而 “haunt” 更侧重于持续、挥之不去的困扰，常是无形的、心理层面的，不一定有恶意，如回忆的萦绕。"
    },
    {
      "word_to_compare": "frequent",
      "analysis": "“Frequent” (常去) 是中性动词，仅表示经常访问某地，无情感色彩。而 “haunt” 在用作动词时，除了表示常去，还隐含一种依恋、沉迷甚至阴郁的情绪，常用于文学语境，带有更丰富的语义层次。"
    }
  ]
}