{
  "word": "hawaiian",
  "pronunciation": "huh·wai·ee·uhn",
  "concise_definition": "adj. 夏威夷的, 夏威夷人的; n. 夏威夷人, 夏威夷语",
  "forms": {
    "comparative": "hawaiianer",
    "superlative": "hawaiianest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or originating from the Hawaiian Islands, including its culture, people, language, or natural features.",
      "explanation_cn": "与夏威夷群岛有关或源自该地的，包括其文化、人民、语言或自然特征。",
      "example_en": "She wore a colorful hawaiian shirt during her vacation in the tropics.",
      "example_cn": "她在热带度假时穿了一件色彩鲜艳的夏威夷衬衫。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characteristic of the traditional music, dance, or cuisine of Hawaii, often featuring ukulele, hula, or tropical flavors.",
      "explanation_cn": "具有夏威夷传统音乐、舞蹈或美食特征的，常以尤克里里琴、草裙舞或热带风味为标志。",
      "example_en": "The luau featured hawaiian music, hula dancing, and roasted pig.",
      "example_cn": "这场宴会展示了夏威夷音乐、草裙舞和烤乳猪。"
    },
    {
      "pos": "noun",
      "explanation_en": "A native or inhabitant of the Hawaiian Islands.",
      "explanation_cn": "夏威夷群岛的原住民或居民。",
      "example_en": "The hawaiian people have a rich oral tradition of storytelling and chants.",
      "example_cn": "夏威夷人拥有丰富的口头传说与吟唱传统。"
    },
    {
      "pos": "noun",
      "explanation_en": "The Polynesian language spoken by native Hawaiians, which is an official language of the state of Hawaii.",
      "explanation_cn": "夏威夷原住民所使用的波利尼西亚语，是夏威夷州的官方语言之一。",
      "example_en": "Many schools in Hawaii now teach hawaiian as part of their cultural curriculum.",
      "example_cn": "如今，夏威夷的许多学校将夏威夷语作为文化课程的一部分进行教授。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "polynesian",
      "analysis": "“Polynesian”（波利尼西亚的）是一个更广泛的地理文化术语，涵盖包括夏威夷、萨摩亚、汤加、塔希提等在内的整个波利尼西亚三角区域的民族与文化。而 “hawaiian” 仅特指夏威夷群岛及其独特传统，是 “polynesian” 的一个子集。"
    },
    {
      "word_to_compare": "tropical",
      "analysis": "“Tropical”（热带的）描述的是气候或地理特征，如高温、高湿、植被茂密，适用于全球所有热带地区（如东南亚、亚马逊）。而 “hawaiian” 不仅指气候，更强调夏威夷特有的文化、语言和身份，具有更强的民族与文化专属性。"
    },
    {
      "word_to_compare": "islander",
      "analysis": "“Islander”（岛民）泛指任何岛屿的居民，如加勒比岛民、太平洋岛民，是一个通用词，无特定文化指向。而 “hawaiian” 是一个具有明确民族、语言和历史背景的专有名词，承载着独特的身份认同，不能与泛指的 “islander” 混用。"
    }
  ]
}