{
  "word": "hazard",
  "pronunciation": "haz·uhrd",
  "concise_definition": "n. 危险, 风险; v. 冒险, 敢于",
  "forms": {
    "plural": "hazards",
    "third_person_singular": "hazards",
    "past_tense": "hazarded",
    "past_participle": "hazarded",
    "present_participle": "hazarding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A source of danger or a potential for harm, especially one that can cause injury, damage, or loss in a specific context such as workplace, environment, or health.",
      "explanation_cn": "指在特定情境下（如工作场所、环境或健康领域）可能造成伤害、损害或损失的危险源或潜在风险。",
      "example_en": "Working at heights without safety gear is a serious hazard.",
      "example_cn": "在没有安全装备的情况下高空作业是一个严重的危险。"
    },
    {
      "pos": "noun",
      "explanation_en": "A risk or chance of something undesirable happening, often used in contexts involving probability and uncertainty, such as gambling or investment.",
      "explanation_cn": "指可能发生不理想结果的风险或可能性，常用于涉及概率与不确定性的语境，如赌博或投资。",
      "example_en": "The hazard of investing in startups is high, but so is the potential reward.",
      "example_cn": "投资初创企业的风险很高，但潜在回报也同样巨大。"
    },
    {
      "pos": "verb",
      "explanation_en": "To risk or venture something, especially by making a bold or uncertain statement or action, often with the implication of taking a chance.",
      "explanation_cn": "指冒险做出某种行为或陈述，通常带有承担风险的意味，尤指在不确定情况下大胆表态或行动。",
      "example_en": "He hazarded a guess that the meeting would be postponed.",
      "example_cn": "他冒险猜测会议将会被推迟。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "danger",
      "analysis": "“Danger” (危险) 是一个更广泛、更通用的词，泛指任何可能造成伤害或威胁的状态，强调直接的、明显的威胁。而 “hazard” 更常用于正式或技术语境，特指可识别、可评估的潜在风险源，常用于安全规范和风险管理中。"
    },
    {
      "word_to_compare": "risk",
      "analysis": "“Risk” (风险) 强调的是发生不利后果的可能性及其后果的严重性，通常可量化（如概率×影响）。而 “hazard” 指的是导致风险的根源或条件本身。例如：‘滑倒的地板’是 hazard，‘因滑倒而受伤的可能性’是 risk。"
    },
    {
      "word_to_compare": "peril",
      "analysis": "“Peril” (危难) 是一个文学性更强、语气更强烈的词，常用于描述极端、紧迫或生死攸关的危险，带有情感色彩。而 “hazard” 更中性、客观，多用于日常或专业语境，不强调情绪强度。"
    }
  ]
}