{
  "word": "haze",
  "pronunciation": "hāz",
  "concise_definition": "n. 薄雾, 雾霾; v. 使模糊, 使昏暗",
  "forms": {
    "plural": "hazes",
    "third_person_singular": "hazes",
    "past_tense": "hazed",
    "past_participle": "hazed",
    "present_participle": "hazing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A slight obscuration of the atmosphere caused by fine particles such as dust, smoke, or moisture, reducing visibility and often giving the sky a milky or bluish tint.",
      "explanation_cn": "由细小颗粒（如灰尘、烟雾或湿气）引起的轻微大气浑浊，降低能见度，并常使天空呈现乳白色或蓝灰色。",
      "example_en": "The mountain peak was barely visible through the morning haze.",
      "example_cn": "清晨的薄雾使山峰几乎难以看清。"
    },
    {
      "pos": "noun",
      "explanation_en": "A state of mental confusion or lack of clarity, often due to fatigue, alcohol, or emotional distress.",
      "explanation_cn": "一种精神上的混乱或不清醒状态，通常由疲劳、酒精或情绪困扰引起。",
      "example_en": "After the long flight, she was in a haze and couldn't remember what she had eaten.",
      "example_cn": "长途飞行后，她头脑昏沉，记不起自己吃了什么。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make something unclear, indistinct, or obscured, often visually or mentally.",
      "explanation_cn": "使某物变得模糊、不清晰，通常指视觉上或精神上的模糊。",
      "example_en": "The bright lights hazed the camera lens, making the photo blurry.",
      "example_cn": "强光使镜头起雾，导致照片模糊不清。"
    },
    {
      "pos": "verb",
      "explanation_en": "To subject someone to a period of initiation or harassment, especially in a group setting such as a fraternity or sports team (often used in the form 'hazing').",
      "explanation_cn": "对某人进行强制性的入会仪式或欺凌，尤其在兄弟会或运动队等团体环境中（常以 'hazing' 形式出现）。",
      "example_en": "The freshmen were subjected to hazing rituals before joining the club.",
      "example_cn": "新生在加入社团前被迫接受了严酷的入会仪式。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fog",
      "analysis": "“Fog” (雾) 指由大量微小水滴悬浮在近地面空气中形成的浓密能见度障碍，通常比 “haze” 更浓、更湿润，能见度更低。而 “haze” 更轻、更干燥，常由污染物或尘埃引起，视觉上更朦胧而非完全遮蔽。"
    },
    {
      "word_to_compare": "smog",
      "analysis": "“Smog” (烟雾) 是 “smoke” 和 “fog” 的合成词，特指由工业污染和汽车尾气造成的严重空气污染，通常呈灰黑色，危害健康。而 “haze” 可以是自然或轻度人为因素造成，污染程度较轻，不必然有害。"
    },
    {
      "word_to_compare": "blur",
      "analysis": "“Blur” (模糊) 通常指图像、视觉或记忆的失真或不清晰，强调结果的模糊性，多用于具体对象（如照片、视线）。而 “haze” 既可以指大气现象，也可比喻精神状态，语义范围更广，且常带有环境或氛围的意味。"
    }
  ]
}