{
  "word": "head",
  "pronunciation": "hed",
  "concise_definition": "n. 头, 首脑, 顶部, 领导者; v. 头部朝向, 主持, 率领",
  "forms": {
    "plural": "heads",
    "third_person_singular": "heads",
    "past_tense": "headed",
    "past_participle": "headed",
    "present_participle": "heading"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The upper part of the human body that contains the brain, eyes, mouth, and other sensory organs; the part of an animal that corresponds to this.",
      "explanation_cn": "人体的上部，包含大脑、眼睛、嘴巴及其他感觉器官；动物身上相对应的部分。",
      "example_en": "She rubbed her head after the fall.",
      "example_cn": "她摔倒后揉了揉头。"
    },
    {
      "pos": "noun",
      "explanation_en": "The person who is in charge of an organization, group, or institution; a leader or chief.",
      "explanation_cn": "指一个组织、团体或机构的负责人或领导者。",
      "example_en": "The head of the department announced a new policy.",
      "example_cn": "部门主管宣布了一项新政策。"
    },
    {
      "pos": "noun",
      "explanation_en": "The top or forward part of something, especially the part that leads or is foremost.",
      "explanation_cn": "指某物的顶部或前端，尤指处于最前面或起主导作用的部分。",
      "example_en": "The head of the line was already at the ticket counter.",
      "example_cn": "队伍的前端已经排到了售票处。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or direct one's head in a particular direction; to be positioned at the front or top of something.",
      "explanation_cn": "指头部朝某个方向移动，或位于某物的前端或顶部。",
      "example_en": "The boat headed north toward the harbor.",
      "example_cn": "船朝着港口北方驶去。"
    },
    {
      "pos": "verb",
      "explanation_en": "To lead or be in charge of a group, project, or organization.",
      "explanation_cn": "指领导或主持一个团体、项目或组织。",
      "example_en": "She will head the new marketing team.",
      "example_cn": "她将主持新的市场团队。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "top",
      "analysis": "“Top”（顶部）强调物体的最高点或表面，常用于物理位置，如山的顶部、盒子的盖子。而 “head” 不仅指物理上的顶部，还可引申为领导地位或方向的前端，语义更丰富，常用于抽象或组织语境。"
    },
    {
      "word_to_compare": "leader",
      "analysis": "“Leader”（领导者）是专指带领他人的人，强调影响力和指导作用，通常是人。而 “head” 作为名词时，更偏向职位或头衔，如 “head of state”，语气更正式、结构化，有时不强调个人魅力，仅指职务。"
    },
    {
      "word_to_compare": "beginning",
      "analysis": "“Beginning”（开始）指时间或过程的起点，如故事的开头。而 “head” 在表示前端时，强调空间或序列上的最前位置，如队伍的头部、河流的源头，更侧重空间方位而非时间顺序。"
    }
  ]
}