{
  "word": "heads",
  "pronunciation": "hedz",
  "concise_definition": "n. 头, 人头, 正面（硬币）, 人数, 首领",
  "forms": {
    "singular": "head"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The upper part of the human body, containing the brain, eyes, mouth, and other sensory organs; also used to refer to the entire person in informal contexts.",
      "explanation_cn": "人体的上部，包含大脑、眼睛、嘴巴等感官器官；在非正式语境中也可指整个人。",
      "example_en": "She rubbed her head after the fall.",
      "example_cn": "她摔倒后揉了揉头。"
    },
    {
      "pos": "noun",
      "explanation_en": "The front side of a coin, typically featuring a portrait or emblem; opposite of 'tails'.",
      "explanation_cn": "硬币的正面，通常印有肖像或徽章；与反面（tails）相对。",
      "example_en": "He flipped a coin and called heads.",
      "example_cn": "他抛了一枚硬币，猜的是正面。"
    },
    {
      "pos": "noun",
      "explanation_en": "A unit of counting people or animals, often used in formal or economic contexts (e.g., 'heads of cattle').",
      "explanation_cn": "用于计数人或动物的单位，常用于正式或经济语境（如‘牛的数量’）。",
      "example_en": "The farm has 500 heads of livestock.",
      "example_cn": "这个农场有五百头牲畜。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person in a position of leadership or authority, especially in an organization or group.",
      "explanation_cn": "指在组织或团体中担任领导或权威职位的人。",
      "example_en": "The heads of the department met to discuss the new policy.",
      "example_cn": "各部门负责人开会讨论新政策。"
    },
    {
      "pos": "noun",
      "explanation_en": "The top or front part of something, such as the head of a river, a nail, or a list.",
      "explanation_cn": "某物的顶部或前端，如河流的源头、钉子的头部或名单的首位。",
      "example_en": "The head of the river is in the mountains.",
      "example_cn": "这条河的源头在山里。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "brain",
      "analysis": "“Brain”（大脑）特指头部内的器官，强调认知和神经功能，是生理结构的一部分。而 “head” 是包含大脑在内的整个头部结构，也可引申为人的整体或领导角色，语义范围更广。"
    },
    {
      "word_to_compare": "top",
      "analysis": "“Top”（顶部）泛指任何物体的最高部分，如桌子的顶部、山的顶部，强调空间位置。而 “head” 在指物体顶端时更常用于有方向性或功能性的结构，如船头、针头、名单首位，具有更强的语义指向性。"
    },
    {
      "word_to_compare": "person",
      "analysis": "“Person”（人）是中性、通用的个体称谓，不带角色或地位含义。而 “head” 作为人的代称时，常隐含领导、负责人或数量单位的语义（如 'ten heads'），具有更强的语用功能和语境依赖性。"
    }
  ]
}