{
  "word": "healer",
  "pronunciation": "hee·lur",
  "concise_definition": "n. 治疗者, 治愈者, 疗愈师",
  "forms": {
    "plural": "healers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who treats physical, emotional, or spiritual ailments, often using alternative, traditional, or holistic methods such as energy work, herbs, prayer, or touch.",
      "explanation_cn": "指通过替代疗法、传统方法或整体疗法（如能量疗愈、草药、祈祷或触疗）治疗身体、情绪或精神创伤的人。",
      "example_en": "The village healer used herbal remedies passed down through generations.",
      "example_cn": "村里的疗愈师使用代代相传的草药疗法。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who brings emotional or psychological healing to others, often through empathy, listening, or therapeutic presence, even without formal medical training.",
      "explanation_cn": "指通过同理心、倾听或治疗性的陪伴，为他人带来情感或心理疗愈的人，即使没有正式的医学训练。",
      "example_en": "After losing her brother, she became a healer for grieving families, offering quiet support and understanding.",
      "example_cn": "在失去哥哥后，她成为哀伤家庭的疗愈者，提供安静的支持与理解。"
    },
    {
      "pos": "noun",
      "explanation_en": "In fantasy or gaming contexts, a character whose primary role is to restore health or remove negative conditions from allies.",
      "explanation_cn": "在奇幻或游戏语境中，指主要职责是恢复队友生命值或消除负面状态的角色。",
      "example_en": "In the dungeon crawl, the healer kept the party alive with healing spells and potions.",
      "example_cn": "在地城探险中，疗愈者通过治疗法术和药水维持队伍的生命。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "doctor",
      "analysis": "“Doctor”（医生）指接受过正规医学训练、持有执业资格、依据科学和临床证据进行诊断与治疗的专业人士。而 “healer” 的范围更广，可能不依赖现代医学体系，更注重身心灵的整体性与灵性层面的疗愈。"
    },
    {
      "word_to_compare": "therapist",
      "analysis": "“Therapist”（治疗师）通常指接受过专业心理学或康复训练的从业者，如心理治疗师、物理治疗师，其方法有系统理论支持和行业规范。“Healer” 则更常与非主流、直觉性或灵性实践相关，缺乏标准化认证。"
    },
    {
      "word_to_compare": "cure",
      "analysis": "“Cure”（治愈）是动词或名词，指彻底消除疾病或症状的结果，强调医学上的“痊愈”。“Healer” 是执行疗愈行为的人，其目标可能是缓解、平衡或转化，而不一定追求完全的生理治愈。"
    }
  ]
}