{
  "word": "hearts",
  "pronunciation": "hɑːrts",
  "concise_definition": "n. 心脏, 心, 情感, 爱心",
  "forms": {
    "singular": "heart"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The muscular organ in the chest that pumps blood through the circulatory system; the physical center of life and circulation.",
      "explanation_cn": "位于胸腔内推动血液在循环系统中流动的肌肉器官；生命和血液循环的物理中心。",
      "example_en": "The surgeon repaired the damaged heart with a new valve.",
      "example_cn": "外科医生为受损的心脏植入了新的瓣膜。"
    },
    {
      "pos": "noun",
      "explanation_en": "The seat of emotions, especially love, courage, or compassion; used metaphorically to represent the core of one's feelings or character.",
      "explanation_cn": "情感的中心，尤指爱、勇气或同情；常用于比喻表示一个人情感或性格的核心。",
      "example_en": "She has a kind heart and always helps those in need.",
      "example_cn": "她心地善良，总是帮助有需要的人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A symbol representing love, affection, or emotional connection, often used in art, literature, and digital communication.",
      "explanation_cn": "代表爱、情感或情感联系的符号，常用于艺术、文学和数字交流中。",
      "example_en": "She sent him a text with a red heart emoji to show she was thinking of him.",
      "example_cn": "她发了一条带有红色爱心表情符号的信息，表示她在想他。"
    },
    {
      "pos": "noun",
      "explanation_en": "In card games, one of the four suits, represented by the symbol ♥, traditionally associated with love and emotion.",
      "explanation_cn": "在纸牌游戏中，四种花色之一，用符号 ♥ 表示，传统上与爱和情感相关联。",
      "example_en": "He played the ace of hearts and won the trick.",
      "example_cn": "他出了一张红桃A，赢了这一轮。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "heart",
      "analysis": "“Hearts” 是 “heart” 的复数形式，通常用于泛指多个心脏（如医学语境），或象征性地表示多种情感、爱意或精神核心。单数 “heart” 更常用于抽象意义（如 ‘with all my heart’），而复数形式 “hearts” 强调多样性、集体情感或多个个体的情感状态。"
    },
    {
      "word_to_compare": "soul",
      "analysis": "“Soul”（灵魂）指人的精神本质或内在生命，常带有宗教或哲学含义，强调永恒性与道德性；而 “hearts” 更侧重情感、爱与同情等感性层面，更具体、更贴近日常体验。两者虽都可指内在核心，但 “soul” 更抽象，”hearts“ 更具象和情感化。"
    },
    {
      "word_to_compare": "core",
      "analysis": "“Core”（核心）是一个通用词，可指任何事物的中心部分（如地球核心、组织核心），强调结构性和关键性；而 “hearts” 在比喻用法中特指情感或爱的中心，具有强烈的情感色彩和文化象征，不可随意替换为 “core”。"
    }
  ]
}