{
  "word": "hearings",
  "pronunciation": "hur·ningz",
  "concise_definition": "n. 听证会, 审讯, 听取陈述",
  "forms": {
    "singular": "hearing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A formal proceeding, typically conducted by a government body, court, or committee, in which evidence and testimony are presented and listened to in order to gather information, evaluate a case, or make a decision.",
      "explanation_cn": "指由政府机构、法院或委员会主持的正式程序，通过听取证词和证据来收集信息、评估案件或作出决定。",
      "example_en": "The Senate held hearings to investigate the causes of the financial crisis.",
      "example_cn": "参议院举行了听证会，以调查金融危机的原因。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of listening to or receiving information, especially in a legal or administrative context; the opportunity to present one's case before an authority.",
      "explanation_cn": "指在法律或行政背景下倾听或接收信息的行为，尤指向权威机构陈述自己立场的机会。",
      "example_en": "The applicant was granted a hearing to present his appeal.",
      "example_cn": "申请人获准参加听证会以提出上诉。"
    },
    {
      "pos": "noun",
      "explanation_en": "A session in which a judge or official listens to arguments or evidence before making a ruling, often preliminary or procedural in nature.",
      "explanation_cn": "指法官或官员在作出裁决前听取辩论或证据的会议，通常具有初步性或程序性。",
      "example_en": "The pretrial hearing determined whether there was enough evidence to proceed to trial.",
      "example_cn": "审前听证会决定了是否有足够证据进入正式审判。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "trial",
      "analysis": "“Trial”（审判）是正式的司法程序，通常包括陪审团、完整证据展示和最终判决，是案件的最终裁决阶段。而 “hearing” 通常是审判前的程序性会议，目的为收集信息、解决程序问题或决定是否进入审判，不必然导致最终裁决。"
    },
    {
      "word_to_compare": "meeting",
      "analysis": "“Meeting”（会议）是一个通用词，泛指任何人员聚集讨论事务的场合，不具法律效力或正式程序。而 “hearing” 是具有法律或行政权威性的正式程序，参与者有陈述权，结果可能影响法律权利或政策决定。"
    },
    {
      "word_to_compare": "consultation",
      "analysis": "“Consultation”（咨询）强调多方协商、征求意见，通常是非对抗性、非正式的，目的是收集反馈而非作出裁决。而 “hearing” 是由权威机构主导的程序，常涉及对立双方的陈述，最终可能产生具有约束力的决定。"
    }
  ]
}