{
  "word": "heart",
  "pronunciation": "hahrt",
  "concise_definition": "n. 心脏, 心, 中心, 勇气; v. 热爱",
  "forms": {
    "plural": "hearts"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The muscular organ in the chest that pumps blood through the circulatory system, essential for sustaining life.",
      "explanation_cn": "位于胸腔内、负责将血液泵入循环系统的肌肉器官，是维持生命所必需的。",
      "example_en": "The doctor listened to his heart with a stethoscope.",
      "example_cn": "医生用听诊器听他的心跳。"
    },
    {
      "pos": "noun",
      "explanation_en": "The seat of emotions, especially love, courage, or compassion; often used metaphorically to represent the core of one's feelings or character.",
      "explanation_cn": "情感的中心，尤指爱、勇气或同情心；常用于比喻，表示一个人情感或性格的核心。",
      "example_en": "She has a kind heart and always helps those in need.",
      "example_cn": "她心地善良，总是帮助有需要的人。"
    },
    {
      "pos": "noun",
      "explanation_en": "The central or most important part of something, such as a place, idea, or activity.",
      "explanation_cn": "某事物的中心或最重要部分，如地点、思想或活动。",
      "example_en": "Paris is the heart of French culture and history.",
      "example_cn": "巴黎是法国文化和历史的中心。"
    },
    {
      "pos": "noun",
      "explanation_en": "Courage or determination, especially in the face of difficulty or danger; often used in phrases like 'have the heart to do something'.",
      "explanation_cn": "勇气或决心，尤其在面对困难或危险时；常用于短语如 'have the heart to do something'（有勇气做某事）。",
      "example_en": "He didn't have the heart to tell her the bad news.",
      "example_cn": "他不忍心告诉她这个坏消息。"
    },
    {
      "pos": "verb",
      "explanation_en": "To love or cherish deeply; used informally, especially in modern digital communication.",
      "explanation_cn": "深切地爱或珍视；多用于非正式语境，尤其在现代数字交流中。",
      "example_en": "I heart this song—it's my favorite!",
      "example_cn": "我超爱这首歌——它是我最喜欢的！"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "core",
      "analysis": "“Core”（核心）强调事物最中心、最本质的部分，常用于物理结构（如地球核心）或抽象概念（如核心价值），偏重功能性与基础性。而 “heart” 更富情感色彩，常用于表达情感中心或象征性中心，如‘heart of the city’带有诗意和人文温度。"
    },
    {
      "word_to_compare": "mind",
      "analysis": "“Mind”（心智）指理性、思维、意识的所在，与理智、逻辑相关；而 “heart” 则代表情感、直觉与感性。两者常形成对比，如 ‘head vs. heart’（理智 vs. 感情），强调决策中理性与情感的冲突。"
    },
    {
      "word_to_compare": "soul",
      "analysis": "“Soul”（灵魂）比 “heart” 更具哲学和宗教色彩，指人的精神本质或永恒存在，常与生命、道德、信仰相连。而 “heart” 更贴近日常情感表达，如爱、悲伤、勇气，更具体、更可感知。"
    }
  ]
}