{
  "word": "heavyweight",
  "pronunciation": "he·vi·weight",
  "concise_definition": "n. 重量级（拳击）; 重量级人物; adj. 重量级的, 重要的, 有影响力的",
  "forms": {
    "plural": "heavyweights",
    "comparative": "heavierweight",
    "superlative": "heaviestweight"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "In boxing, a competitor in the heaviest weight class, typically weighing over 200 pounds (90.7 kg); also used metaphorically to describe a person of great importance, influence, or power in a particular field.",
      "explanation_cn": "在拳击中，指体重超过200磅（约90.7公斤）的最重级别选手；也常用于比喻，指在某一领域中具有重大影响力、权力或地位的重要人物。",
      "example_en": "Muhammad Ali was one of the greatest heavyweight champions in history.",
      "example_cn": "穆罕默德·阿里是历史上最伟大的重量级拳王之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or organization that holds significant authority, prestige, or clout, especially in business, politics, or culture.",
      "explanation_cn": "指在商业、政治或文化领域中拥有显著权威、声望或影响力的人或组织。",
      "example_en": "She’s a heavyweight in the tech industry, with multiple patents and a Fortune 500 company to her name.",
      "example_cn": "她是科技界的重量级人物，拥有多项专利，并以一家财富500强公司而闻名。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Of or relating to the heavyweight division in boxing; figuratively, describing something of great size, importance, or impact.",
      "explanation_cn": "与拳击重量级相关；引申义指规模巨大、重要性极高或影响力深远的。",
      "example_en": "The conference attracted heavyweight speakers from academia and government.",
      "example_cn": "这次会议吸引了来自学术界和政府的重量级演讲者。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "powerhouse",
      "analysis": "“Powerhouse”（ powerhouse）强调的是强大的能量、活力或生产能力，常用于形容机构、团队或个人具有极强的推动力或效率，如‘a powerhouse of innovation’。而 ‘heavyweight’ 更侧重于地位、声望和影响力，而非能量输出。"
    },
    {
      "word_to_compare": "big shot",
      "analysis": "“Big shot” 是一个非正式俚语，指有权势或地位的人，语气较随意甚至略带讽刺。而 ‘heavyweight’ 更正式、更尊重，常用于媒体和专业语境中，强调的是实质影响力而非头衔或炫耀。"
    },
    {
      "word_to_compare": "titans",
      "analysis": "“Titans”（巨人）源自神话，比喻在某一领域中具有传奇性、近乎神话般地位的巨擘，如‘business titans’。它带有更强的史诗感和历史厚重感。‘Heavyweight’ 则更贴近当代语境，强调当前的影响力和竞争地位，更具现实性和可比性。"
    }
  ]
}