{
  "word": "hebrew",
  "pronunciation": "hee·broo",
  "concise_definition": "n. 希伯来语, 希伯来人; adj. 希伯来的",
  "forms": {
    "plural": "hebrews"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The Semitic language of the ancient Israelites and modern Jews, written from right to left and using a distinct alphabet; it is the liturgical language of Judaism and the official language of Israel.",
      "explanation_cn": "古代以色列人和现代犹太人的闪米特语，从右向左书写，使用独特的字母系统；是犹太教的礼仪语言，也是以色列的官方语言。",
      "example_en": "She is learning Hebrew to read the Torah in its original form.",
      "example_cn": "她正在学习希伯来语，以便用原文阅读《托拉》。"
    },
    {
      "pos": "noun",
      "explanation_en": "A member of the ancient people of Israel, especially as described in the Bible; also used to refer to a Jewish person, particularly in historical or literary contexts.",
      "explanation_cn": "古代以色列民族的成员，尤其指《圣经》中所描述的人；也可用于指犹太人，多用于历史或文学语境。",
      "example_en": "The Hebrews wandered in the desert for forty years before reaching the Promised Land.",
      "example_cn": "希伯来人在进入应许之地前，在旷野中漂泊了四十年。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to the Hebrew language, people, or culture, especially in the context of ancient Israel or Judaism.",
      "explanation_cn": "与希伯来语、希伯来人或希伯来文化相关的，尤指古代以色列或犹太教的背景。",
      "example_en": "The Hebrew Bible contains the foundational texts of Jewish tradition.",
      "example_cn": "希伯来圣经包含了犹太传统的基础文本。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "jewish",
      "analysis": "“Jewish”（犹太的/犹太人的）是一个更广泛的文化和宗教术语，涵盖信仰、习俗、民族身份和现代国家认同，适用于所有犹太人，无论其语言背景。而 “Hebrew” 更侧重于语言、古代民族身份或圣经语境，现代日常使用中较少用于指代人，除非在历史或学术语境中。"
    },
    {
      "word_to_compare": "aramaic",
      "analysis": "“Aramaic”（亚兰语）是与希伯来语同属闪米特语系的另一种古代语言，在犹太历史中曾广泛使用，尤其在第二圣殿时期。它曾是中东的通用语，而希伯来语主要用于宗教文本。两者常在圣经文本中并存，但希伯来语是犹太民族的神圣语言，亚兰语则更多用于日常交流和部分经文（如《但以理书》部分章节）。"
    },
    {
      "word_to_compare": "yiddish",
      "analysis": "“Yiddish”（意第绪语）是中世纪欧洲阿什肯纳兹犹太人发展出的德语为基础的犹太语言，使用希伯来字母书写，但词汇和语法深受日耳曼语和斯拉夫语影响。它与希伯来语完全不同：希伯来语是闪米特语，是宗教和现代以色列的官方语言；而意第绪语是犹太 diaspora 的口语传统，现已式微。"
    }
  ]
}