{
  "word": "hebrews",
  "pronunciation": "hee·breez",
  "concise_definition": "n. 希伯来人, 希伯来语",
  "forms": {
    "singular": "hebrew"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A member of an ancient Semitic people who are the ancestors of the Jews, traditionally associated with the patriarchs Abraham, Isaac, and Jacob, and the early inhabitants of the land of Canaan.",
      "explanation_cn": "指一个古老的闪米特民族的成员，是犹太人的祖先，传统上与亚伯拉罕、以撒、雅各等族长以及迦南地的早期居民相关联。",
      "example_en": "The Hebrews migrated from Mesopotamia to Canaan under the leadership of Abraham.",
      "example_cn": "希伯来人在亚伯拉罕的领导下从美索不达米亚迁徙到迦南。"
    },
    {
      "pos": "noun",
      "explanation_en": "The ancient language of the Hebrew people, which is the original language of most of the Old Testament and is still used in Jewish religious rituals and modern Israel.",
      "explanation_cn": "希伯来人的古代语言，是《旧约》大部分内容的原始语言，至今仍用于犹太教宗教仪式和现代以色列的日常交流。",
      "example_en": "Many Jewish scholars study Hebrew to read the Torah in its original form.",
      "example_cn": "许多犹太学者学习希伯来语，以便以原文阅读《托拉》。"
    },
    {
      "pos": "noun",
      "explanation_en": "A book of the New Testament in the Christian Bible, addressed to Jewish Christians, emphasizing the superiority of Jesus Christ over the Old Testament figures and institutions.",
      "explanation_cn": "基督教《圣经·新约》中的一卷书，写给犹太裔基督徒，强调耶稣基督优于旧约中的人物和制度。",
      "example_en": "The Epistle to the Hebrews discusses the priesthood of Christ and the fulfillment of the Mosaic law.",
      "example_cn": "《希伯来书》讨论了基督的祭司职分以及摩西律法的成全。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "jews",
      "analysis": "“Jews”（犹太人）是现代民族和宗教身份的称呼，指信仰犹太教或具有犹太血统的现代群体；而 “Hebrews” 更侧重于古代历史语境中的民族称谓，常用于圣经和学术文献中，强调其祖先和语言传统。两者有历史延续性，但语境和时间范围不同。"
    },
    {
      "word_to_compare": "aramaic",
      "analysis": "“Aramaic”（亚兰语）是古代近东地区广泛使用的闪米特语言，曾是波斯帝国的官方语言，也是耶稣时代巴勒斯坦地区的日常用语。而 “Hebrew” 是犹太人的宗教和民族语言，虽在日常生活中一度被亚兰语取代，但始终保留于宗教文本和仪式中。两者同属闪米特语系，但用途和文化地位不同。"
    },
    {
      "word_to_compare": "israelites",
      "analysis": "“Israelites”（以色列人）特指雅各（后改名以色列）的十二个儿子所形成的十二支派组成的民族，是希伯来人进入迦南后建立王国时期的称呼；而 “Hebrews” 更早，常用于出埃及前的时期，强调其游牧和迁徙背景。两者在历史进程中常指同一族群，但 “Israelites” 更具政治和国家认同色彩。"
    }
  ]
}