{
  "word": "hector",
  "pronunciation": "hek·tər",
  "concise_definition": "v. 恐吓, 威胁; n. 好吹牛的人, 好欺负人的人",
  "forms": {
    "third_person_singular": "hectors",
    "past_tense": "hectored",
    "past_participle": "hectored",
    "present_participle": "hectoring"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To bully or intimidate someone in a loud, aggressive, or domineering manner, often to force them into compliance or submission.",
      "explanation_cn": "以大声、攻击性或专横的方式恐吓或欺凌某人，通常是为了迫使其顺从或屈服。",
      "example_en": "The manager was hectoring the new employee about his tardiness, making the whole office uncomfortable.",
      "example_cn": "经理大声责骂新员工迟到，让整个办公室都感到不安。"
    },
    {
      "pos": "verb",
      "explanation_en": "To behave in a boastful or overbearing way, especially when trying to impress others or assert dominance.",
      "explanation_cn": "以自吹自擂或盛气凌人的方式行事，尤其在试图给他人留下印象或显示权威时。",
      "example_en": "He hectoring about his achievements at every party, never letting anyone else speak.",
      "example_cn": "他在每个聚会上都夸耀自己的成就，从不让人插话。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is boastful, aggressive, and domineering, often using intimidation to control others; derived from the character Hector in Homer’s Iliad, a proud and brave warrior.",
      "explanation_cn": "指一个自吹自擂、咄咄逼人且专横的人，常通过恐吓来控制他人；词源来自荷马史诗《伊利亚特》中的英雄赫克托耳，一位骄傲而勇敢的战士，后引申为贬义的欺凌者。",
      "example_en": "He’s not a leader—he’s just a hector, trying to scare people into following him.",
      "example_cn": "他不是领导者——他只是一个欺凌者，试图吓唬别人来追随他。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "intimidate",
      "analysis": "“Intimidate” (恐吓) 是一个更中性的动词，泛指通过威胁或压力使某人感到恐惧而屈服，不强调语气或行为方式。而 “hector” 特指以喧闹、傲慢、持续的言语或态度进行恐吓，带有更强的贬义和人格特征。"
    },
    {
      "word_to_compare": "bully",
      "analysis": "“Bully” (欺凌) 与 “hector” 在行为上高度重叠，但 “bully” 更常用于描述长期、系统性的压迫行为，尤其在儿童或职场环境中；而 “hector” 更侧重于单次或反复的言语攻击和盛气凌人的态度，不一定伴随身体威胁。"
    },
    {
      "word_to_compare": "boast",
      "analysis": "“Boast” (吹嘘) 仅指夸耀自己的成就或能力，不包含威胁或压迫他人的成分。而 “hector” 作为动词时，不仅包含吹嘘，还隐含了通过这种吹嘘来压制他人、确立支配地位的意图。"
    }
  ]
}