{
  "word": "heel",
  "pronunciation": "heel",
  "concise_definition": "n. 脚后跟, 跟部; v. 跟随, 跟在后面",
  "forms": {
    "plural": "heels",
    "third_person_singular": "heels",
    "past_tense": "heeled",
    "past_participle": "heeled",
    "present_participle": "heeling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The back part of the human foot, below the ankle, which bears weight and provides balance during walking or standing.",
      "explanation_cn": "人体脚部的后部，位于踝关节下方，在行走或站立时承受重量并提供平衡。",
      "example_en": "She rubbed her sore heels after a long day of walking in high heels.",
      "example_cn": "走了一整天高跟鞋后，她揉了揉疼痛的脚后跟。"
    },
    {
      "pos": "noun",
      "explanation_en": "The rear part of a shoe that supports the heel of the foot; often raised to add height or style.",
      "explanation_cn": "鞋的后部，用于支撑脚后跟；常被加高以增加身高或时尚感。",
      "example_en": "The designer shoes had stiletto heels that made her look taller.",
      "example_cn": "这些设计师鞋子有细高跟，让她看起来更高了。"
    },
    {
      "pos": "noun",
      "explanation_en": "The rear or trailing part of something, such as the heel of a loaf of bread or the heel of a sock.",
      "explanation_cn": "某物的后部或末端，例如面包的尾部或袜子的脚跟部分。",
      "example_en": "He saved the heel of the bread to make croutons.",
      "example_cn": "他把面包的尾部留着做面包丁。"
    },
    {
      "pos": "verb",
      "explanation_en": "To follow closely behind someone, often in a persistent or obedient manner, as if walking at their heels.",
      "explanation_cn": "紧随某人之后，常带有执着或顺从的意味，如同跟在脚后跟后面。",
      "example_en": "The reporter heeled the politician everywhere she went.",
      "example_cn": "记者紧紧跟随这位政客，她走到哪儿记者就跟到哪儿。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fit or attach a heel to a shoe or boot.",
      "explanation_cn": "为鞋子或靴子安装或装上鞋跟。",
      "example_en": "The cobbler heeled the worn-out boots with new leather soles.",
      "example_cn": "修鞋匠给那双磨破的靴子换上了新的皮革鞋跟。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sole",
      "analysis": "“Sole”（鞋底）指鞋的底部，直接接触地面的部分，强调功能性和支撑性；而 “heel” 仅指鞋底的后部，是鞋底的一个组成部分，更侧重于高度、形状和美观。两者是部分与整体的关系。"
    },
    {
      "word_to_compare": "track",
      "analysis": "“Track”（追踪）强调系统性地跟随或监控某人或某物的行踪，常用于调查或技术手段；而 “heel” 作为动词时更口语化、形象化，强调物理上紧贴在身后跟随，常带有贬义或亲密感，不强调技术性。"
    },
    {
      "word_to_compare": "tail",
      "analysis": "“Tail”（尾巴）可指动物的尾部，也可比喻为跟随在后的事物（如‘the tail of a parade’），但多用于比喻性或自然物；而 “heel” 作为跟随义时，专指人类行为，且带有强烈的动作感和身体接触感，更具体、更直接。"
    }
  ]
}