{
  "word": "heels",
  "pronunciation": "heels",
  "concise_definition": "n. 脚后跟, 高跟鞋, (车辆或动物的) 后蹄, (船的) 尾部",
  "forms": {
    "singular": "heel"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The back part of the human foot, below the ankle, which bears weight and provides balance during walking or standing.",
      "explanation_cn": "人体脚部的后部，位于踝关节下方，在行走或站立时承受重量并提供平衡。",
      "example_en": "She rubbed her heels after a long day of walking in new shoes.",
      "example_cn": "走了一整天新鞋后，她揉了揉脚后跟。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of shoe with a raised back part, typically worn by women to add height and alter posture; often associated with fashion and elegance.",
      "explanation_cn": "一种后部有高跟的鞋子，通常由女性穿着以增加身高并改变体态；常与时尚和优雅联系在一起。",
      "example_en": "She stepped into her stilettos and clicked across the floor in her high heels.",
      "example_cn": "她穿上细高跟鞋，踩着清脆的响声走过地板。"
    },
    {
      "pos": "noun",
      "explanation_en": "The rear part of an animal's hoof or the rear wheels of a vehicle, especially when referring to movement or traction.",
      "explanation_cn": "动物蹄子的后部，或车辆的后轮，尤其在提及运动或牵引力时使用。",
      "example_en": "The horse reared up, kicking out with its heels.",
      "example_cn": "那匹马后蹄腾空踢起。"
    },
    {
      "pos": "noun",
      "explanation_en": "The stern or rear end of a ship, often used in nautical expressions to describe direction or motion.",
      "explanation_cn": "船的尾部，常用于航海表达中描述方向或运动。",
      "example_en": "The boat turned sharply, and the heels of the vessel caught the wave.",
      "example_cn": "船突然转向，船尾撞上了浪头。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sole",
      "analysis": "“Sole”（鞋底）指鞋的整个底部，包括前掌和后跟，是接触地面的主要部分，强调功能性和支撑结构。而 “heel” 仅指鞋底的后部，是鞋的特定组成部分，常用于描述高度、风格或步态影响。"
    },
    {
      "word_to_compare": "toe",
      "analysis": "“Toe”（脚趾）是脚的前部，与 “heel” 形成身体的两端，常用于对比（如 heel-to-toe gait）。两者在解剖学上相对，但在使用中，“heel” 更常与优雅、力量或动作（如踢、跺）相关，而 “toe” 更多与平衡、触感或方向（如 toe-in）相关。"
    },
    {
      "word_to_compare": "talon",
      "analysis": "“Talon”（爪）通常用于描述猛禽或某些动物的尖锐弯曲趾甲，强调攻击性或捕猎功能。虽然在比喻中可与 “heels” 类比（如 ‘raking with talons’），但 ‘heels’ 是人类或四足动物的解剖结构，不具备尖锐或捕猎特性，语义更偏向日常或时尚语境。"
    }
  ]
}