{
  "word": "heights",
  "pronunciation": "hāīts",
  "concise_definition": "n. 高度, 高地, 高峰, 高层",
  "forms": {
    "singular": "height"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The measurement of how high something is, especially when referring to a specific numerical value or level above a reference point such as sea level.",
      "explanation_cn": "指某物从基准点（如海平面）向上的垂直距离，通常用具体数值表示。",
      "example_en": "The plane flew at a height of 30,000 feet above sea level.",
      "example_cn": "飞机在海拔三万英尺的高度飞行。"
    },
    {
      "pos": "noun",
      "explanation_en": "Elevated areas of land, especially those that are noticeably high compared to the surrounding terrain; often used in plural to refer to mountainous or hilly regions.",
      "explanation_cn": "指显著高于周围地形的陆地区域，常以复数形式出现，指山脉或丘陵地带。",
      "example_en": "They hiked through the Scottish Highlands and camped among the rocky heights.",
      "example_cn": "他们徒步穿越苏格兰高地，在岩石嶙峋的高地扎营。"
    },
    {
      "pos": "noun",
      "explanation_en": "The highest point or peak of something, often used metaphorically to describe the pinnacle of achievement, emotion, or intensity.",
      "explanation_cn": "指某事物的最高点或巅峰，常用于比喻成就、情感或强度的顶峰。",
      "example_en": "The concert reached new heights of emotional power.",
      "example_cn": "这场音乐会达到了情感力量的新高度。"
    },
    {
      "pos": "noun",
      "explanation_en": "A level or rank in a social, professional, or hierarchical structure, often implying prestige or superiority.",
      "explanation_cn": "指社会、职业或等级结构中的某一层次，常暗示声望或优越性。",
      "example_en": "He rose to the heights of corporate leadership after decades of hard work.",
      "example_cn": "经过数十年的努力，他攀升到了企业领导层的巅峰。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "altitude",
      "analysis": "“Altitude”（海拔）专指相对于海平面的垂直高度，多用于航空、地理或气象领域，具有明确的科学测量含义。而 “heights” 更通用，可指任何物体的垂直距离，也可用于比喻或地理区域的泛称，不局限于海平面基准。"
    },
    {
      "word_to_compare": "elevation",
      "analysis": "“Elevation”（高程）与 “altitude” 类似，常用于地理学中描述地形的垂直高度，强调地表相对于基准面的位置，语气较正式、客观。而 “heights” 更口语化，且可引申为抽象的‘巅峰’或‘高层’，适用范围更广。"
    },
    {
      "word_to_compare": "peak",
      "analysis": "“Peak”（峰顶）特指山峰或事物的最高点，是单一、具体的顶点，常为名词或动词。而 “heights” 可以是多个高点的集合（如高地），也可以是抽象意义上的‘高度’，不一定是单一顶点，语义更宽泛。"
    }
  ]
}