{
  "word": "heightened",
  "pronunciation": "hīt·nəd",
  "concise_definition": "adj. 增强的, 加剧的, 更强烈的",
  "forms": {
    "base_form": "heighten",
    "comparative": "heightened",
    "superlative": "heightened"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Made more intense, acute, or pronounced; describing a state or condition that has been increased in degree, often in emotion, awareness, or sensitivity.",
      "explanation_cn": "指某种状态、情绪、意识或敏感度被增强、加剧或变得更加显著，常用于描述心理、感官或情境上的强化。",
      "example_en": "The heightened tension in the room made everyone uneasy.",
      "example_cn": "房间内加剧的紧张气氛让每个人都感到不安。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by increased alertness, perception, or responsiveness, often due to external stimuli or internal anticipation.",
      "explanation_cn": "指因外部刺激或内在预期而表现出更高的警觉性、感知力或反应能力。",
      "example_en": "She had a heightened sense of smell after her recovery from the cold.",
      "example_cn": "她在感冒康复后，嗅觉变得更加敏锐。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used to describe situations or environments that are more dramatic, urgent, or emotionally charged than usual.",
      "explanation_cn": "用于描述比平常更具戏剧性、紧迫性或情感张力的情境或环境。",
      "example_en": "The heightened security measures at the airport reflected the increased threat level.",
      "example_cn": "机场加强的安全措施反映了威胁等级的提升。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "intensified",
      "analysis": "“Intensified”（强化的）与 “heightened” 非常接近，都表示程度的增强，但 “intensified” 更常用于描述力量、压力或冲突的直接加剧，偏重物理或动态层面；而 “heightened” 更常用于抽象概念，如情绪、意识或敏感度的提升，语气更文雅、更常用于正式语境。"
    },
    {
      "word_to_compare": "increased",
      "analysis": "“Increased”（增加的）是一个通用词，泛指数量、规模或程度的上升，适用于任何可量化的对象（如收入、人数、速度）。而 “heightened” 专指质量或强度的提升，通常带有主观感受或感知层面的意味，不能用于数字或物理量的直接增加。"
    },
    {
      "word_to_compare": "elevated",
      "analysis": "“Elevated”（升高的）常用于物理高度或社会地位的提升，也可用于情绪或体温等抽象概念，但更强调从低到高的位置变化，带有中性或积极色彩。而 “heightened” 更强调内在感知或反应的增强，常用于负面或紧张情境，如焦虑、警觉，语义更侧重‘敏感度’而非‘位置’。"
    }
  ]
}