{
  "word": "hemorrhage",
  "pronunciation": "hem·uh·rij",
  "concise_definition": "n. 出血, 大出血; v. 大量出血, 严重流失",
  "forms": {
    "third_person_singular": "hemorrhages",
    "past_tense": "hemorrhaged",
    "past_participle": "hemorrhaged",
    "present_participle": "hemorrhaging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The sudden and excessive loss of blood from damaged blood vessels, often life-threatening and requiring immediate medical intervention.",
      "explanation_cn": "指因血管受损而突然大量失血，通常危及生命，需立即医疗干预。",
      "example_en": "The accident victim suffered a massive hemorrhage in the abdominal cavity.",
      "example_cn": "事故受害者腹部出现大量出血。"
    },
    {
      "pos": "noun",
      "explanation_en": "A rapid and uncontrolled loss or depletion of something valuable, such as money, resources, or personnel, often used metaphorically.",
      "explanation_cn": "指某种宝贵事物（如资金、资源或人员）的迅速且失控的流失，常用于比喻意义。",
      "example_en": "The company is hemorrhaging money due to poor management and rising costs.",
      "example_cn": "由于管理不善和成本上升，这家公司正在大量亏损。"
    },
    {
      "pos": "verb",
      "explanation_en": "To lose blood rapidly and excessively, typically as a result of injury or medical condition.",
      "explanation_cn": "指因外伤或疾病而迅速大量失血。",
      "example_en": "The patient hemorrhaged after the surgery and required an emergency blood transfusion.",
      "example_cn": "患者术后大出血，急需紧急输血。"
    },
    {
      "pos": "verb",
      "explanation_en": "To experience a rapid and continuous outflow or drain of something valuable, especially in economic or organizational contexts.",
      "explanation_cn": "指在经济或组织背景下，经历某种宝贵事物的持续快速流失。",
      "example_en": "The government is hemorrhaging public trust as scandals continue to emerge.",
      "example_cn": "随着丑闻不断曝光，政府正在持续丧失公众信任。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bleed",
      "analysis": "“Bleed” (流血) 是更通用、更口语化的词，可指任何形式的出血，程度可轻可重，也可用于比喻（如“bleed money”）。而 “hemorrhage” 专指严重、失控、危及生命的大量出血，语义更强，常用于医学或正式语境，比喻用法也更具冲击力。"
    },
    {
      "word_to_compare": "loss",
      "analysis": "“Loss” (损失) 是一个广泛而中性的词，可指任何类型的失去，如时间、机会、财产等，不强调速度或程度。而 “hemorrhage” 作为名词时特指“急剧、大量、不可控”的流失，带有强烈负面和紧急的语义色彩，比 “loss” 更具动态性和严重性。"
    },
    {
      "word_to_compare": "leak",
      "analysis": "“Leak” (泄漏) 通常指缓慢、小规模、非故意的流失，如水、气体或信息的渗漏，常带有隐秘性。而 “hemorrhage” 强调的是大规模、快速、灾难性的流失，具有爆发性和破坏性，语义强度远高于 “leak”。"
    }
  ]
}