{
  "word": "herds",
  "pronunciation": "hurds",
  "concise_definition": "n. 牛群, 群体, 大群; v. 驱赶, 集合",
  "forms": {
    "singular": "herd"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A large group of animals, especially hoofed mammals such as cattle, elephants, or zebras, that live, feed, or migrate together.",
      "explanation_cn": "指大量同类动物（尤其是有蹄类哺乳动物，如牛、象、斑马）共同生活、觅食或迁徙的群体。",
      "example_en": "A herd of elephants crossed the savanna in search of water.",
      "example_cn": "一群大象穿越草原寻找水源。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large group of people behaving in a similar, often unthinking or conformist way, especially under the influence of a trend or authority.",
      "explanation_cn": "指大量行为相似、常缺乏独立思考或盲目从众的人群，通常受潮流或权威影响。",
      "example_en": "She refused to join the herds of tourists flocking to the same popular destinations.",
      "example_cn": "她拒绝加入那些涌向相同热门景点的游客大军。"
    },
    {
      "pos": "verb",
      "explanation_en": "To gather or drive animals, especially livestock, into a group or enclosure.",
      "explanation_cn": "指将动物（尤其是家畜）聚集或驱赶成群或赶入围栏中。",
      "example_en": "The ranchers herded the cattle into the corral before sunset.",
      "example_cn": "牧民们在日落前将牛群赶进了围栏。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or direct a large group of people in a coordinated or forced manner.",
      "explanation_cn": "指以有组织或强制的方式引导或驱赶一大群人。",
      "example_en": "Security personnel herded the crowd toward the emergency exits.",
      "example_cn": "安保人员将人群引导至紧急出口。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "flock",
      "analysis": "“Flock”（鸟群/人群）通常用于鸟类或羊群，也用于比喻性地描述人群，但规模通常小于“herd”，且更常用于轻盈、分散或非大型动物的群体。而 “herd” 更强调大型、沉重、有蹄类动物的密集群体，语义上更具力量感和集体压迫感。"
    },
    {
      "word_to_compare": "pack",
      "analysis": "“Pack”（兽群/团伙）多用于狼、狗等群居掠食动物，或用于贬义地形容人类团伙，强调紧密协作、攻击性或非法性。而 “herd” 通常是食草动物的中性群体，强调数量和集体移动，不带有攻击性含义。"
    },
    {
      "word_to_compare": "mob",
      "analysis": "“Mob”（暴民/乌合之众）带有强烈负面色彩，指失控、暴力或情绪化的群体，常用于社会动荡或犯罪语境。而 “herd” 虽可比喻盲从的人群，但本身是中性词，不必然包含暴力或混乱的含义。"
    }
  ]
}