{
  "word": "herd",
  "pronunciation": "hurd",
  "concise_definition": "n. 群, 兽群; v. 牧放, 集合, 驱赶",
  "forms": {
    "plural": "herds",
    "third_person_singular": "herds",
    "past_tense": "herded",
    "past_participle": "herded",
    "present_participle": "herding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A large group of animals of the same kind, especially hoofed mammals such as cattle, elephants, or zebras, that live, feed, or move together.",
      "explanation_cn": "指同种动物（尤其是有蹄类动物，如牛、象、斑马）聚集在一起生活、觅食或迁徙的大群。",
      "example_en": "A herd of elephants crossed the savanna in search of water.",
      "example_cn": "一群大象穿越草原寻找水源。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large group of people who behave in a similar way, often without independent thought, especially when influenced by popular opinion or trends.",
      "explanation_cn": "指一群行为相似、常受流行观点或趋势影响而缺乏独立思考的人，常含贬义。",
      "example_en": "She refused to be part of the herd and made her own fashion choices.",
      "example_cn": "她拒绝随大流，坚持自己选择时尚风格。"
    },
    {
      "pos": "verb",
      "explanation_en": "To drive or move a group of animals together, typically by a herder or using vehicles or dogs.",
      "explanation_cn": "指由牧人或借助车辆、狗等将一群动物驱赶、聚集在一起。",
      "example_en": "The cowboys herded the cattle toward the corral at sunset.",
      "example_cn": "牛仔们在日落时将牛群赶向围栏。"
    },
    {
      "pos": "verb",
      "explanation_en": "To gather or move people in a group, often in a controlled or forced manner, especially in large numbers or under pressure.",
      "explanation_cn": "指将人群聚集或驱赶在一起，常带有控制性或强制性，尤其在人数众多或压力情境下。",
      "example_en": "Security personnel herded the protesters into a designated area.",
      "example_cn": "安保人员将抗议者驱赶到指定区域。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "flock",
      "analysis": "“Flock”（鸟群/人群）通常用于鸟类或羊群，也可引申指追随潮流的人群，但规模一般较小，语义更轻柔，常用于非正式语境。而 “herd” 多用于大型哺乳动物，语义更粗犷，且在比喻用法中更强调盲目跟从的负面含义。"
    },
    {
      "word_to_compare": "pack",
      "analysis": "“Pack”（兽群/团伙）多用于狼、狗等群居掠食动物，或指有组织的犯罪团伙，强调紧密协作和攻击性。而 “herd” 强调的是被动聚集、无组织的群体行为，通常为食草动物或顺从的人群，缺乏主动协同。"
    },
    {
      "word_to_compare": "crowd",
      "analysis": "“Crowd”（人群）指在特定地点聚集的大量人，强调空间上的密集，不强调行为一致性或被驱赶的动态。而 “herd” 不仅指聚集，更强调被引导、被控制的移动过程，常含被动或非自愿的意味。"
    }
  ]
}