{
  "word": "hero",
  "pronunciation": "heer·oh",
  "concise_definition": "n. 英雄, 英雄人物, 主角",
  "forms": {
    "plural": "heroes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who is admired for their courage, outstanding achievements, or noble qualities, especially someone who acts bravely in the face of danger or adversity.",
      "explanation_cn": "指因勇气、卓越成就或高尚品质而受到钦佩的人，尤指在危险或逆境中勇敢行动的人。",
      "example_en": "The firefighters were hailed as heroes after rescuing families from the burning building.",
      "example_cn": "消防员从着火的大楼中救出多个家庭后，被赞誉为英雄。"
    },
    {
      "pos": "noun",
      "explanation_en": "The main character in a story, play, film, or other narrative, often the central figure around whom the plot revolves and who embodies the values or struggles of the narrative.",
      "explanation_cn": "指故事、戏剧、电影或其他叙事作品中的主角，通常是情节围绕其展开的核心人物，体现作品的价值观或内在冲突。",
      "example_en": "In Greek mythology, Hercules is the hero who completes twelve impossible labors.",
      "example_cn": "在希腊神话中，赫拉克勒斯是完成十二项不可能任务的英雄。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is regarded as an ideal or role model in a particular field or context, even if not traditionally heroic.",
      "explanation_cn": "指在特定领域或情境中被视为理想或榜样的人，即使他们并不符合传统意义上的英雄形象。",
      "example_en": "Many young scientists see Marie Curie as a hero for her groundbreaking work in radioactivity.",
      "example_cn": "许多年轻科学家将玛丽·居里视为在放射性研究中取得突破性成就的英雄。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "heroine",
      "analysis": "“Heroine” 是 “hero” 的女性形式，专指女性英雄或女主角。两者在语义上完全对应，仅在性别上区分。现代英语中，有时用 “hero” 作为性别中立词泛指英雄，但 “heroine” 仍用于强调女性身份或文学传统语境。"
    },
    {
      "word_to_compare": "champion",
      "analysis": "“Champion” (冠军/捍卫者) 通常指在竞赛、辩论或斗争中获胜的人，或为某项事业积极辩护的人。它强调胜利或支持，但不一定包含牺牲或道德勇气。而 “hero” 更强调内在品质和行为的崇高性，即使未获胜也可能被称为英雄。"
    },
    {
      "word_to_compare": "legend",
      "analysis": "“Legend” (传奇人物) 指因非凡事迹而被广泛传颂、甚至被神化的人物，其形象往往超越现实，带有神话色彩。而 “hero” 更贴近现实，强调真实行为和可效仿的勇气。一个传奇人物可能是英雄，但英雄未必成为传奇。"
    }
  ]
}