{
  "word": "hezbollah",
  "pronunciation": "heh·zuh·buh·lah",
  "concise_definition": "n. 伊斯兰抵抗运动（真主党），黎巴嫩什叶派政治与军事组织",
  "forms": {
    "plural": "hezbollahs"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A Shiite Muslim political party and militant group based in Lebanon, founded in the early 1980s with support from Iran, dedicated to resisting Israeli occupation and promoting Islamic governance; it operates as a state-within-a-state with its own military, social services, and political representation.",
      "explanation_cn": "一个成立于20世纪80年代初、得到伊朗支持的黎巴嫩什叶派穆斯林政治组织与武装团体，致力于抵抗以色列占领并推动伊斯兰治理；该组织拥有自己的军事力量、社会服务体系和政治代表，实质上在黎巴嫩境内形成‘国中之国’。",
      "example_en": "Hezbollah has been designated a terrorist organization by the United States and several other countries due to its armed attacks and involvement in regional conflicts.",
      "example_cn": "由于其武装袭击和参与地区冲突，真主党已被美国和多个其他国家列为恐怖组织。"
    },
    {
      "pos": "noun",
      "explanation_en": "A symbol of Shiite resistance and religious nationalism in the Middle East, often portrayed as a defender of the oppressed against Western and Israeli influence, while also being criticized for undermining Lebanese sovereignty and fueling sectarian violence.",
      "explanation_cn": "中东什叶派抵抗运动与宗教民族主义的象征，常被描绘为对抗西方和以色列影响的受压迫者捍卫者，但也因削弱黎巴嫩主权和加剧教派暴力而受到批评。",
      "example_en": "During the 2006 Lebanon War, Hezbollah's rocket attacks on northern Israel triggered a major military response from the Israeli Defense Forces.",
      "example_cn": "在2006年黎巴嫩战争期间，真主党对以色列北部发动的火箭袭击引发了以色列国防军的大规模军事反击。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "militia",
      "analysis": "“Militia”（民兵）泛指非正规的、地方性的武装组织，通常由平民组成，缺乏国家正式军队的结构和资源。而 “Hezbollah” 是一个高度组织化、拥有正规军事装备、国际支持和政治体系的准国家实体，其影响力远超一般民兵组织。"
    },
    {
      "word_to_compare": "terrorist group",
      "analysis": "“Terrorist group”（恐怖组织）是一个法律和政治标签，强调使用暴力恐吓平民以达成政治目的。虽然许多国家将 Hezbollah 列为恐怖组织，但该组织自身及支持者将其定义为“抵抗运动”，强调其军事行动针对的是军事目标而非平民。这种标签的争议性反映了政治立场的分歧。"
    },
    {
      "word_to_compare": "political party",
      "analysis": "“Political party”（政党）通常指通过选举参与国家治理的合法组织。Hezbollah 虽然在黎巴嫩议会中拥有席位并提供社会服务，但其核心权力来源于武装力量和与伊朗的联盟，而非民主选举。因此，它是一个兼具政党形式与武装实体特征的混合体，不同于传统意义上的政党。"
    }
  ]
}