{
  "word": "higher",
  "pronunciation": "hahy·uh",
  "concise_definition": "adj. 更高的, 更高级的; adv. 更高地",
  "forms": {
    "comparative": "higher",
    "superlative": "highest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Of greater elevation, distance, or level above a reference point; used to describe physical position or rank.",
      "explanation_cn": "指相对于某个基准点具有更大高度、距离或层级的，用于描述物理位置或等级。",
      "example_en": "The plane flew at a higher altitude than usual.",
      "example_cn": "飞机飞行的高度比平常更高。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Of superior quality, importance, or status; indicating a more advanced or elevated level in a hierarchy or system.",
      "explanation_cn": "指质量、重要性或地位更优的，表示在等级或体系中处于更高级别的状态。",
      "example_en": "She was promoted to a higher position in the company.",
      "example_cn": "她被提升到了公司更高的职位。"
    },
    {
      "pos": "adverb",
      "explanation_en": "At a greater height or to a more elevated position; describing the manner in which something is raised or moved upward.",
      "explanation_cn": "指以更高的位置或更上升的状态进行，描述某物被抬升或向上移动的方式。",
      "example_en": "He jumped higher than anyone else in the competition.",
      "example_cn": "他在比赛中跳得比任何人都高。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used to describe abstract concepts such as emotions, standards, or goals that are more intense, refined, or ambitious.",
      "explanation_cn": "用于描述情感、标准或目标等抽象概念，表示更强烈、更精致或更有抱负的层面。",
      "example_en": "We strive for higher ideals in our personal and professional lives.",
      "example_cn": "我们在个人和职业生活中追求更高的理想。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "taller",
      "analysis": "“Taller” 专用于描述人或物体在垂直方向上的物理高度，通常仅限于有明确上下结构的实体（如人、树木、建筑）。而 “higher” 更广泛，可用于抽象概念（如等级、标准）或非生物物体（如海拔、温度），不限于生物体。"
    },
    {
      "word_to_compare": "superior",
      "analysis": "“Superior” 强调质量、价值或地位上的优越性，常用于评价性语境（如 superior quality），但不一定涉及空间或层级上的“上升”。“Higher” 更侧重于层级、位置或程度的递进，常用于等级制度或数值比较中，语义更中性。"
    },
    {
      "word_to_compare": "elevated",
      "analysis": "“Elevated” 是一个更正式、更书面化的词，常用于描述物理位置的提升（如 elevated platform）或抽象状态的提升（如 elevated mood），带有某种刻意或技术性提升的意味。“Higher” 更通用、口语化，适用范围更广，且不隐含人为干预。"
    }
  ]
}