{
  "word": "high",
  "pronunciation": "haɪ",
  "concise_definition": "adj. 高的, 高级的, 高度的; adv. 高地, 高度地; n. 高点, 高潮; interj. 喝彩",
  "forms": {
    "comparative": "higher",
    "superlative": "highest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Of great vertical extent; situated at a considerable distance above a reference point, such as the ground or sea level.",
      "explanation_cn": "在垂直方向上延伸很大，位于参考点（如地面或海平面）相当高的位置。",
      "example_en": "The mountain peak is so high that it's covered with snow year-round.",
      "example_cn": "这座山峰如此之高，以至于终年积雪。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Of a high degree, level, or intensity; not low or moderate, often used to describe abstract qualities like price, quality, or emotion.",
      "explanation_cn": "指程度、水平或强度很高，非低或中等，常用于描述价格、质量、情绪等抽象属性。",
      "example_en": "She has a high standard for accuracy in her work.",
      "example_cn": "她对工作中的准确性有着很高的标准。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Of elevated rank, status, or importance; denoting something official, prestigious, or superior.",
      "explanation_cn": "指等级、地位或重要性较高，表示某种官方的、有声望的或优越的事物。",
      "example_en": "The president held a high-level meeting with foreign dignitaries.",
      "example_cn": "总统与外国政要举行了高级别会议。"
    },
    {
      "pos": "adverb",
      "explanation_en": "At or to a great height; in an elevated position.",
      "explanation_cn": "在或达到很高的位置。",
      "example_en": "The bird flew high above the treetops.",
      "example_cn": "这只鸟在树顶上方高高飞翔。"
    },
    {
      "pos": "adverb",
      "explanation_en": "In an extravagant, unrestrained, or intoxicated manner; often used in phrases like 'live high' or 'get high'.",
      "explanation_cn": "以奢侈、放纵或醉酒的方式；常用于短语如 'live high' 或 'get high'。",
      "example_en": "After the concert, they partied high into the night.",
      "example_cn": "音乐会后，他们狂欢到深夜。"
    },
    {
      "pos": "noun",
      "explanation_en": "The highest point, level, or peak of something; the climax or zenith.",
      "explanation_cn": "某事物的最高点、水平或顶峰；高潮或巅峰。",
      "example_en": "The high of the festival was the fireworks display at midnight.",
      "example_cn": "节日的高潮是午夜的烟花表演。"
    },
    {
      "pos": "interjection",
      "explanation_en": "An exclamation used to express approval, celebration, or encouragement, often in group settings.",
      "explanation_cn": "用于表达赞许、庆祝或鼓励的感叹词，常用于群体场合。",
      "example_en": "High! High! High! The team cheered as the goal was scored.",
      "example_cn": "好！好！好！球队进球时，大家齐声欢呼。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tall",
      "analysis": "“Tall”（高的）通常用于描述人、动物或细长物体在垂直方向上的高度，强调从底部到顶部的长度，如“a tall man”或“a tall tree”。“High”则更广泛，可用于任何物体、位置或抽象概念的垂直高度，如“a high mountain”或“a high price”，且不局限于生物或细长物。"
    },
    {
      "word_to_compare": "elevated",
      "analysis": "“Elevated”（升高的）是更正式、更技术性的词，常用于描述物理位置的提升（如“elevated platform”）或抽象状态的提升（如“elevated status”）。它强调“被提升到更高位置”，而“high”更直接、更口语化，可描述自然状态或主观感受。"
    },
    {
      "word_to_compare": "up",
      "analysis": "“Up”（向上）是方向性副词或介词，表示移动或位置的朝向，如“look up”或“put it up”。“High”是描述状态或程度的形容词或副词，表示已达到的高度，而非动作方向。例如，“The plane flew high”（飞机飞得很高）与“The plane flew up”（飞机向上飞）含义不同。"
    }
  ]
}