{
  "word": "highlighted",
  "pronunciation": "hahy·lai·tuhnd",
  "concise_definition": "adj. 被突出的, 被强调的; v. (highlight 的过去式和过去分词) 突出, 强调",
  "forms": {
    "base_form": "highlight",
    "present_participle": "highlighting",
    "past_tense": "highlighted",
    "past_participle": "highlighted",
    "third_person_singular": "highlights"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Marked or presented in a way that draws special attention, often to emphasize importance, relevance, or visual distinction.",
      "explanation_cn": "以某种方式被标记或呈现，以引起特别注意，通常是为了强调其重要性、相关性或视觉上的突出性。",
      "example_en": "The highlighted sections of the report contain the most critical findings.",
      "example_cn": "报告中被突出显示的部分包含了最重要的发现。"
    },
    {
      "pos": "verb (past tense/past participle)",
      "explanation_en": "To emphasize or draw attention to something, either visually (e.g., with color or bold text) or through verbal or contextual emphasis.",
      "explanation_cn": "通过视觉手段（如使用颜色或加粗文字）或通过语言、语境等方式，强调或引起对某事物的注意。",
      "example_en": "The teacher highlighted key vocabulary words to help students remember them.",
      "example_cn": "老师强调了关键词汇，以帮助学生记住它们。"
    },
    {
      "pos": "verb (past tense/past participle)",
      "explanation_en": "To make something more noticeable or prominent, especially in a digital or printed medium, such as by using a fluorescent marker or digital highlighting tool.",
      "explanation_cn": "使某事物在数字或印刷媒介中更加显眼或突出，例如使用荧光笔或数字高亮工具。",
      "example_en": "She highlighted the important dates on her calendar so she wouldn't forget them.",
      "example_cn": "她在日历上标出了重要日期，以免忘记。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "emphasized",
      "analysis": "“Emphasized” (强调) 更侧重于通过语气、重复或逻辑结构来加强某内容的重要性，常用于抽象或语言层面；而 “highlighted” 更常指通过视觉手段（如颜色、加粗）使内容在视觉上脱颖而出，更偏向于物理或界面呈现。"
    },
    {
      "word_to_compare": "underscored",
      "analysis": "“Underscored” (加下划线强调) 与 “highlighted” 在视觉强调上有重叠，但 “underscored” 通常特指用下划线标记，语义较窄；而 “highlighted” 可涵盖多种视觉方式（如荧光色、背景色、边框等），适用范围更广，也更常用于现代数字界面。"
    },
    {
      "word_to_compare": "featured",
      "analysis": "“Featured” (作为重点展示) 指某事物被选中作为核心或主要展示对象，常用于媒体、产品或活动推广中，隐含“被优先呈现”的含义；而 “highlighted” 仅表示被突出，不一定代表核心地位，可能是多个被突出项之一。"
    }
  ]
}