{
  "word": "highlights",
  "pronunciation": "haɪˈlaɪts",
  "concise_definition": "n. 最精彩的部分, 重点, 精华; v. 突出, 强调",
  "forms": {
    "singular": "highlight",
    "third_person_singular": "highlights",
    "past_tense": "highlighted",
    "past_participle": "highlighted",
    "present_participle": "highlighting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The most important, interesting, or memorable parts of an event, experience, or period, often presented as a summary or condensed version.",
      "explanation_cn": "指某个事件、经历或时期中最重要、最有趣或最令人难忘的部分，常以摘要或浓缩形式呈现。",
      "example_en": "The highlights of the concert included a surprise duet by the two lead singers.",
      "example_cn": "这场音乐会的精彩片段包括两位主唱的惊喜合唱。"
    },
    {
      "pos": "noun",
      "explanation_en": "A feature or element that is emphasized or made more noticeable, especially in visual media or written content.",
      "explanation_cn": "指在视觉媒体或文字内容中被特别强调或突出显示的特征或元素。",
      "example_en": "The report uses color coding to highlight key statistics.",
      "example_cn": "这份报告使用颜色编码来突出关键数据。"
    },
    {
      "pos": "verb",
      "explanation_en": "To emphasize or draw attention to something important, often by using visual or verbal cues.",
      "explanation_cn": "通过视觉或语言提示来强调或引起对某重要事物的注意。",
      "example_en": "The documentary highlights the impact of climate change on coastal communities.",
      "example_cn": "这部纪录片突出了气候变化对沿海社区的影响。"
    },
    {
      "pos": "verb",
      "explanation_en": "To mark text or images with a bright color to make them stand out, especially for reference or study purposes.",
      "explanation_cn": "用鲜艳的颜色标记文字或图像，使其更醒目，常用于参考或学习目的。",
      "example_en": "She highlighted the most important passages in her textbook with a yellow marker.",
      "example_cn": "她用黄色荧光笔标出了教科书中最重要的段落。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "summary",
      "analysis": "“Summary”（摘要）是对整体内容的简要概括，通常省略细节，保留核心信息，强调完整性与压缩性。而 “highlight” 更侧重于挑选出最突出、最引人注目的部分，不一定覆盖全部重要内容，但更具选择性和表现力。"
    },
    {
      "word_to_compare": "emphasis",
      "analysis": "“Emphasis”（强调）是一个抽象名词，指对某事物给予更多关注或重要性，常用于语气、结构或逻辑层面。而 “highlight” 作为动词或名词时，常伴随具体手段（如颜色、加粗、剪辑）来实现强调，更具操作性和视觉化特征。"
    },
    {
      "word_to_compare": "features",
      "analysis": "“Features”（特点/特性）泛指某事物固有的属性或组成部分，可能是中性的或常规的。而 “highlights” 特指其中最出色、最值得被关注的部分，带有评价性和优选性，是“features”中的精华。"
    }
  ]
}