{
  "word": "hijacking",
  "pronunciation": "hahy·jak·ing",
  "concise_definition": "n. 劫持, 劫机, 强行夺取控制权",
  "forms": {
    "base_form": "hijack",
    "third_person_singular": "hijacks",
    "past_tense": "hijacked",
    "past_participle": "hijacked",
    "present_participle": "hijacking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The unlawful seizure or takeover of a vehicle, especially an aircraft, by force or threat of force, often for political or financial gain.",
      "explanation_cn": "指通过武力或暴力威胁非法劫持交通工具，尤其是飞机，通常出于政治或经济目的。",
      "example_en": "The 9/11 attacks were a series of coordinated hijackings that changed global security policies.",
      "example_cn": "9·11事件是一系列有组织的劫机行动，彻底改变了全球安全政策。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of taking control of a system, process, or communication channel without authorization, often for malicious purposes such as data theft or spreading malware.",
      "explanation_cn": "指在未经许可的情况下强行夺取对系统、流程或通信渠道的控制权，通常用于恶意目的，如窃取数据或传播恶意软件。",
      "example_en": "Cybercriminals used phishing emails to carry out a hijacking of the company's email server.",
      "example_cn": "网络罪犯通过钓鱼邮件对公司的邮件服务器实施了劫持。"
    },
    {
      "pos": "noun",
      "explanation_en": "The appropriation or distortion of an idea, movement, or message for unintended or opposing purposes, often by a minority group.",
      "explanation_cn": "指将某个理念、运动或信息强行据为己有或扭曲，用于原本未预期或相反的目的，通常由少数群体实施。",
      "example_en": "The original message of peace was hijacked by extremists to promote violence.",
      "example_cn": "原本倡导和平的信息被极端分子劫持，用来鼓吹暴力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "kidnapping",
      "analysis": "“Kidnapping”（绑架）指非法拘禁并带走一个人，通常是为了勒索或施压，对象是人；而 “hijacking” 的对象是交通工具、系统或信息，强调对控制权的夺取，而非人身拘禁。"
    },
    {
      "word_to_compare": "theft",
      "analysis": "“Theft”（盗窃）指未经许可拿走他人财物，通常不涉及暴力控制或持续支配；而 “hijacking” 强调对动态系统（如飞机、网络）的即时接管和操控，具有持续性和控制性，而不仅是占有。"
    },
    {
      "word_to_compare": "takeover",
      "analysis": "“Takeover”（接管）是一个中性词，常用于商业或政治语境，指合法或非暴力地获得控制权（如企业并购）；而 “hijacking” 带有强烈的非法、暴力或欺骗色彩，隐含对原有秩序的破坏和强制性。"
    }
  ]
}