{
  "word": "hikes",
  "pronunciation": "hahyks",
  "concise_definition": "n. 远足, 徒步旅行; v. 提高, 增加",
  "forms": {
    "singular": "hike",
    "third_person_singular": "hikes",
    "past_tense": "hiked",
    "past_participle": "hiked",
    "present_participle": "hiking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long, vigorous walk, especially in the countryside or on trails, undertaken for exercise or pleasure.",
      "explanation_cn": "指在乡村或小径上进行的长时间、有活力的步行，通常为了锻炼或娱乐。",
      "example_en": "We went on a hike through the mountains last weekend and saw breathtaking views.",
      "example_cn": "上周末我们去山里远足，看到了令人叹为观止的景色。"
    },
    {
      "pos": "noun",
      "explanation_en": "A significant increase in price, cost, or amount, often sudden or substantial.",
      "explanation_cn": "指价格、费用或数量的显著增加，通常是突然或大幅度的。",
      "example_en": "There was a hike in gasoline prices after the oil supply disruption.",
      "example_cn": "石油供应中断后，汽油价格大幅上涨。"
    },
    {
      "pos": "verb",
      "explanation_en": "To walk for long distances, especially in natural environments, for recreation or fitness.",
      "explanation_cn": "指在自然环境中长时间步行，以休闲或健身为目的。",
      "example_en": "They hike every Sunday to clear their minds and enjoy nature.",
      "example_cn": "他们每个星期天都去徒步，以放松心情、享受自然。"
    },
    {
      "pos": "verb",
      "explanation_en": "To raise or increase something, especially a price, rate, or level, often abruptly.",
      "explanation_cn": "指突然或显著地提高某物（如价格、费率或水平）。",
      "example_en": "The company hiked its subscription fees by 20% this year.",
      "example_cn": "今年该公司将其订阅费用提高了20%。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "walk",
      "analysis": "“Walk”（步行）是通用词，泛指任何步行行为，不强调距离、强度或环境。而 “hike” 特指较长、较艰苦、通常在户外自然环境中进行的步行，具有更强的体力消耗和探险性质。"
    },
    {
      "word_to_compare": "trek",
      "analysis": "“Trek”（跋涉）与 “hike” 相近，但更强调艰难、漫长、穿越偏远或地形复杂地区的长途行走，常带有冒险或生存色彩。而 “hike” 更常用于休闲性质的远足，强度相对较低。"
    },
    {
      "word_to_compare": "increase",
      "analysis": "“Increase”（增加）是通用动词，适用于任何数量、程度或规模的上升，中性且广泛。而 “hike” 作为动词时，特指幅度较大、常为突然或令人意外的上涨，多用于价格、费用等经济语境，带有更强的语义色彩。"
    }
  ]
}