{
  "word": "hits",
  "pronunciation": "hit-s",
  "concise_definition": "n. 热门作品, 成功之作, 打击, 碰撞; v. 击中, 碰撞, 突然发生",
  "forms": {
    "singular": "hit",
    "third_person_singular": "hits",
    "past_tense": "hit",
    "past_participle": "hit",
    "present_participle": "hitting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A popular and successful piece of music, film, or other entertainment that achieves widespread acclaim or high sales.",
      "explanation_cn": "指广受欢迎并取得巨大成功的音乐、电影或其他娱乐作品，通常销量或播放量极高。",
      "example_en": "That song was a global hit, topping charts in over 20 countries.",
      "example_cn": "那首歌是一首全球热门单曲，在二十多个国家的排行榜上登顶。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden and forceful impact or strike against something or someone.",
      "explanation_cn": "指对某物或某人突然而有力的撞击或打击。",
      "example_en": "The boxer landed a powerful hit to his opponent's jaw.",
      "example_cn": "拳击手一记重拳击中了对手的下巴。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden occurrence or surge of something, often negative or disruptive.",
      "explanation_cn": "指某种事物（常为负面或干扰性）突然发生或激增。",
      "example_en": "There was a hit of cold weather last week, bringing snow to the southern regions.",
      "example_cn": "上周突然迎来一股寒潮，使南方地区下起了雪。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strike or come into forceful contact with something or someone.",
      "explanation_cn": "指用力击中或与某物或某人发生碰撞。",
      "example_en": "The ball hit the window and shattered the glass.",
      "example_cn": "球击中了窗户，打碎了玻璃。"
    },
    {
      "pos": "verb",
      "explanation_en": "To achieve great success or popularity, especially in entertainment or business.",
      "explanation_cn": "指在娱乐或商业领域取得巨大成功或广泛流行。",
      "example_en": "Her new novel hit number one on the bestseller list.",
      "example_cn": "她的新小说登上了畅销书排行榜第一名。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reach or affect a target, goal, or point, often unexpectedly or suddenly.",
      "explanation_cn": "指达到或影响某个目标、地点或关键点，常带有突然或意外的意味。",
      "example_en": "The announcement hit the stock market hard, causing prices to drop.",
      "example_cn": "这一公告对股市造成重击，导致股价下跌。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "success",
      "analysis": "“Success” (成功) 是一个抽象名词，泛指达成目标或获得良好结果的状态，不特指具体作品或事件。而 “hit” 作为名词时，特指在流行文化或市场中取得显著商业成功的具体作品（如歌曲、电影），更具象、更口语化。"
    },
    {
      "word_to_compare": "strike",
      "analysis": "“Strike” (打击/罢工) 与 “hit” 在表示“打击”时可互换，但 “strike” 更常用于有计划的行动（如罢工、闪电战），或法律/体育术语（如棒球中的好球）；而 “hit” 更强调物理冲击或偶然性，语义更广泛、更日常。"
    },
    {
      "word_to_compare": "touch",
      "analysis": "“Touch” (接触) 指轻微或短暂的接触，通常不具破坏性或力量感；而 “hit” 强调有力、突然甚至暴力的接触。例如 “a touch on the shoulder”（轻拍肩膀）与 “a hit on the head”（头部重击）形成鲜明对比。"
    }
  ]
}