{
  "word": "hive",
  "pronunciation": "hīv",
  "concise_definition": "n. 蜂巢, 蜂群; v. 聚集, 群居",
  "forms": {
    "plural": "hives",
    "third_person_singular": "hives",
    "past_tense": "hived",
    "past_participle": "hived",
    "present_participle": "hiving"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A structure built by bees to house their colony, store honey, and raise their young; often used metaphorically to describe any densely organized or busy place.",
      "explanation_cn": "蜜蜂建造的用于栖息蜂群、储存蜂蜜和哺育幼虫的结构；常被隐喻为任何高度密集或繁忙的场所。",
      "example_en": "The beekeeper carefully opened the hive to check the health of the colony.",
      "example_cn": "养蜂人小心地打开蜂巢，检查蜂群的健康状况。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large group of people or things gathered closely together in a busy, active environment, often implying productivity or constant movement.",
      "explanation_cn": "指大量人或事物紧密聚集在一个繁忙、活跃的环境中，常暗示高产或持续不断的活动。",
      "example_en": "The startup office was a hive of activity, with everyone working on multiple projects at once.",
      "example_cn": "这家初创公司的办公室里一片繁忙景象，每个人都在同时处理多个项目。"
    },
    {
      "pos": "verb",
      "explanation_en": "To gather or cluster together in a dense, active group, often for mutual benefit or efficiency.",
      "explanation_cn": "指密集地聚集在一起，通常为了共同利益或提高效率。",
      "example_en": "Locals hived around the festival grounds, eager to enjoy the music and food.",
      "example_cn": "当地人纷纷聚集在节日场地周围，渴望享受音乐和美食。"
    },
    {
      "pos": "verb",
      "explanation_en": "To place or store something, especially bees, in a hive.",
      "explanation_cn": "指将某物（尤指蜜蜂）安置或储存在蜂巢中。",
      "example_en": "The beekeeper hived the new swarm before sunset.",
      "example_cn": "养蜂人在日落前将新来的蜂群安置进了蜂箱。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "nest",
      "analysis": "“Nest”（巢）通常指鸟类或小型动物为繁殖和栖息而建造的简单结构，强调私密性和保护性；而 “hive” 专指蜜蜂的复杂社会性结构，强调集体协作与高密度组织，常用于比喻人类的繁忙群体。"
    },
    {
      "word_to_compare": "colony",
      "analysis": "“Colony”（群体/殖民地）是一个更广泛的术语，可指任何生物群体（如蚂蚁、人类殖民地），强调社会结构和共同生活；“hive” 是 “colony” 的一种具体形式，特指蜜蜂群体及其物理居所，且更常用于比喻繁忙的活动场所。"
    },
    {
      "word_to_compare": "swarm",
      "analysis": "“Swarm”（蜂群）指一群蜜蜂或其他昆虫在飞行中聚集移动的状态，强调动态和迁移；而 “hive” 指的是它们定居后的稳定居所或组织结构，是静态的容器或系统。两者常相伴出现，但语义焦点不同。"
    }
  ]
}