{
  "word": "hoarding",
  "pronunciation": "hawr·ding",
  "concise_definition": "n. 收集囤积, 储藏; v. 收集囤积, 储藏",
  "forms": {
    "plural": "hoardings",
    "third_person_singular": "hoards",
    "past_tense": "hoarded",
    "past_participle": "hoarded",
    "present_participle": "hoarding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The excessive accumulation of objects, often of little value, to the point where it interferes with normal living spaces or functions, commonly associated with psychological disorders such as hoarding disorder.",
      "explanation_cn": "指过度积累物品（常为无价值之物），以致干扰正常生活空间或功能，常与囤积症等心理障碍相关。",
      "example_en": "The house was filled with hoarding: stacks of newspapers, broken appliances, and old clothing blocked every room.",
      "example_cn": "房子里堆满了囤积物：成堆的报纸、破损的电器和旧衣服堵住了每一个房间。"
    },
    {
      "pos": "noun",
      "explanation_en": "A structure or barrier, typically made of wooden panels, used to enclose a construction site or display advertisements.",
      "explanation_cn": "指用木板制成的围挡结构，常用于围住建筑工地或张贴广告。",
      "example_en": "The construction site was surrounded by colorful hoardings promoting the new shopping mall.",
      "example_cn": "建筑工地周围环绕着宣传新购物中心的彩色围挡。"
    },
    {
      "pos": "verb",
      "explanation_en": "To collect and store large quantities of something, especially in a secretive or excessive manner, often due to fear of scarcity or compulsive behavior.",
      "explanation_cn": "指秘密地或过度地收集并储存大量物品，常因害怕匮乏或强迫性行为所致。",
      "example_en": "During the pandemic, many people hoarded toilet paper and hand sanitizer.",
      "example_cn": "疫情期间，许多人囤积了厕纸和洗手液。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "stockpiling",
      "analysis": "“Stockpiling”（囤积）通常指为应对未来需求或紧急情况而有计划地大量储存物资，如粮食、燃料或医疗用品，具有一定的合理性或战略目的。而 “hoarding” 更强调非理性、过度甚至病态的积累，常伴随心理障碍或社会负面影响。"
    },
    {
      "word_to_compare": "storing",
      "analysis": "“Storing”（储存）是一个中性词，泛指将物品放置在某个地方以备后用，不带有数量或动机的负面含义。而 “hoarding” 暗示了数量异常、缺乏组织性以及可能造成危害的储存行为。"
    },
    {
      "word_to_compare": "accumulating",
      "analysis": "“Accumulating”（积累）是一个更广泛、更中性的术语，可用于描述财富、知识、经验等任何事物的逐渐增加，不必然带有负面或病理色彩。而 “hoarding” 特指对实物的病态或过度积累，常与心理疾病或社会问题相关联。"
    }
  ]
}