{
  "word": "hoax",
  "pronunciation": "hoaks",
  "concise_definition": "n. 骗局, 诡计, 欺骗; v. 欺骗, 误导",
  "forms": {
    "plural": "hoaxes",
    "third_person_singular": "hoaxes",
    "past_tense": "hoaxed",
    "past_participle": "hoaxed",
    "present_participle": "hoaxing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A deliberate deception intended to trick or mislead people into believing something false, often for amusement, profit, or to cause confusion.",
      "explanation_cn": "一种蓄意的欺骗行为，旨在诱使人们相信虚假的事物，通常出于娱乐、牟利或制造混乱的目的。",
      "example_en": "The so-called alien sighting was later revealed to be a hoax staged by local teenagers.",
      "example_cn": "所谓外星人目击事件后来被揭露是当地青少年策划的骗局。"
    },
    {
      "pos": "noun",
      "explanation_en": "A fabricated story or piece of evidence designed to appear authentic, often spread through media or public channels to gain attention or influence opinion.",
      "explanation_cn": "一种伪造的故事或证据，旨在伪装成真实信息，常通过媒体或公共渠道传播以吸引关注或影响舆论。",
      "example_en": "The viral video claiming to show a dinosaur in the Amazon turned out to be a digital hoax.",
      "example_cn": "那段声称在亚马逊发现恐龙的病毒式视频，最终被证实是数字伪造的骗局。"
    },
    {
      "pos": "verb",
      "explanation_en": "To deceive or trick someone by convincing them of something that is not true, often through elaborate or clever means.",
      "explanation_cn": "通过使某人相信虚假之事来欺骗或愚弄他们，通常借助精心设计或巧妙的手段。",
      "example_en": "He hoaxed his friends into believing he had won the lottery.",
      "example_cn": "他骗朋友们说他中了彩票。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fraud",
      "analysis": "“Fraud” (欺诈) 通常指以非法获利为目的的系统性欺骗行为，具有法律后果，常涉及金钱、财产或身份盗窃。而 “hoax” 更侧重于制造虚假事件或信息以误导公众，不一定以经济利益为动机，有时仅为恶作剧。"
    },
    {
      "word_to_compare": "deception",
      "analysis": "“Deception” (欺骗) 是一个更广泛的上位词，泛指任何形式的误导或隐瞒真相的行为，包括谎言、隐瞒、伪装等。而 “hoax” 是一种特定类型的 deception，通常具有公开性、表演性和传播性，常针对群体而非个人。"
    },
    {
      "word_to_compare": "prank",
      "analysis": "“Prank” (恶作剧) 通常指轻度的、非恶意的玩笑，目的是逗乐而非造成严重误导或伤害。而 “hoax” 可能引发严重后果（如恐慌、经济损失），其欺骗性更强，且常利用权威或媒体扩大影响，远超普通恶作剧的范围。"
    }
  ]
}