{
  "word": "hog",
  "pronunciation": "hawg",
  "concise_definition": "n. 猪, 贪心的人; v. 占有, 独占, 贪得无厌地使用",
  "forms": {
    "third_person_singular": "hogs",
    "past_tense": "hogged",
    "past_participle": "hogged",
    "present_participle": "hogging",
    "plural": "hogs"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A domestic pig, especially a mature male pig; sometimes used to refer to any pig regardless of gender.",
      "explanation_cn": "家猪，尤指成年公猪；有时泛指任何性别的猪。",
      "example_en": "The farmer raised several hogs on his land for meat production.",
      "example_cn": "这位农民在自己的土地上饲养了几头猪用于肉类生产。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is greedy, selfish, or takes more than their fair share of something, often in a vulgar or obnoxious way.",
      "explanation_cn": "指贪婪、自私的人，常以粗俗或令人反感的方式独占资源或利益。",
      "example_en": "He’s such a hog—he always grabs the biggest slice of pizza and never shares.",
      "example_cn": "他真是个贪心鬼——总是抢最大的那块披萨，从不分享。"
    },
    {
      "pos": "verb",
      "explanation_en": "To take or use more than one’s fair share of something, often selfishly or excessively.",
      "explanation_cn": "指自私地或过度地占有或使用超过自己应得份额的资源或物品。",
      "example_en": "Stop hogging the remote control—let someone else choose the show!",
      "example_cn": "别老霸着遥控器了，让别人也选个节目吧！"
    },
    {
      "pos": "verb",
      "explanation_en": "To ride or use a motorcycle, especially a large or heavy one, often with connotations of dominance or roughness.",
      "explanation_cn": "指骑乘摩托车，尤其是大型或重型摩托车，常带有支配或粗犷的意味。",
      "example_en": "He hogs the Harley through the open road, drawing stares from everyone.",
      "example_cn": "他骑着哈雷在公路上飞驰，引得路人侧目。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pig",
      "analysis": "“Pig”（猪）是中性词，泛指动物猪，也可用于比喻贪婪的人，但语气较轻、更口语化；而 “hog” 更强调贪婪、独占的负面行为，常带有道德谴责色彩，且在动词用法上是 “pig” 所不具备的。"
    },
    {
      "word_to_compare": "greedy",
      "analysis": "“Greedy”（贪婪的）是形容词，描述一种心理状态或性格特征；而 “hog” 作为名词或动词，强调的是具体的行为表现——实际占有或独占资源，更具动作性和可观察性。"
    },
    {
      "word_to_compare": "hoard",
      "analysis": "“Hoard”（囤积）指秘密地、长期地积累并保存物品，常出于恐惧或准备不足；而 “hog” 更强调当下、公开地独占资源，带有自私和不公的意味，不一定涉及保存，而是即时的占有行为。"
    }
  ]
}