{
  "word": "holding",
  "pronunciation": "hohld·ing",
  "concise_definition": "n. 持有, 持股, 保持; v. 持有, 保持, 举行; adj. 持有的",
  "forms": {
    "plural": "holdings",
    "third_person_singular": "holds",
    "past_tense": "held",
    "past_participle": "held",
    "present_participle": "holding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of owning or controlling something, especially assets such as stocks, property, or investments; often used in financial contexts to describe the total amount owned by an individual or organization.",
      "explanation_cn": "指拥有或控制某物的行为，尤指股票、房地产或投资等资产；常用于金融语境，表示个人或组织所持有的全部资产总额。",
      "example_en": "The fund's largest holding is in technology stocks.",
      "example_cn": "该基金最大的持股是科技股。"
    },
    {
      "pos": "noun",
      "explanation_en": "A building or structure used for a specific purpose, especially a large house or estate; often used in British English to refer to a country house or manor.",
      "explanation_cn": "指用于特定目的的建筑物或结构，尤指大型住宅或庄园；常用于英式英语中指乡村宅邸或庄园。",
      "example_en": "The family has lived in the same holding for over 200 years.",
      "example_cn": "这个家族已在这座庄园里居住了200多年。"
    },
    {
      "pos": "verb",
      "explanation_en": "To keep or maintain possession of something, whether physically, emotionally, or legally; to retain control or ownership.",
      "explanation_cn": "指在物理、情感或法律上保持对某物的占有或控制；保留所有权或掌控权。",
      "example_en": "She is holding onto the old photograph as a reminder of her childhood.",
      "example_cn": "她紧握着那张旧照片，作为对童年的纪念。"
    },
    {
      "pos": "verb",
      "explanation_en": "To organize or conduct an event, meeting, or activity; to host or carry out something formally.",
      "explanation_cn": "指组织或举行一场活动、会议或事务；正式地主办或开展某事。",
      "example_en": "The university is holding a conference on climate change next month.",
      "example_cn": "这所大学下个月将举办一场关于气候变化的会议。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that is currently being maintained or retained, especially in a legal or financial context.",
      "explanation_cn": "描述某物当前正被保持或保留的，尤指在法律或金融语境中。",
      "example_en": "The holding company owns several subsidiaries across Europe.",
      "example_cn": "这家控股公司拥有欧洲多家子公司。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ownership",
      "analysis": "“Ownership” (所有权) 强调法律上对财产的完全控制权和权利，是一个静态的法律概念。而 “holding” 更侧重于实际的占有或控制状态，可能不涉及完整所有权（如持股但不控股），且常用于金融或组织语境。"
    },
    {
      "word_to_compare": "retention",
      "analysis": "“Retention” (保留) 通常指主动维持某种状态、关系或物品，常用于心理、教育或商业领域（如客户保留率）。它更强调持续性的努力，而 “holding” 可以是被动或中性的保持，不必然包含主观意愿。"
    },
    {
      "word_to_compare": "meeting",
      "analysis": "“Meeting” (会议) 是一个具体的事件或场合，指人与人聚集交流。“Holding a meeting” 是指组织或举行会议这一动作，但 “meeting” 本身是名词，指事件本身，而 “holding” 是动词，强调动作的执行。两者词性与语义焦点不同。"
    }
  ]
}