{
  "word": "holes",
  "pronunciation": "hōlz",
  "concise_definition": "n. 洞, 孔, 缺口, 缺陷",
  "forms": {
    "singular": "hole"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An opening or hollow space through or within something, typically created by removal or penetration of material.",
      "explanation_cn": "指通过移除或穿透材料而在某物中形成的开口或中空空间。",
      "example_en": "The mouse chewed a hole in the corner of the wall.",
      "example_cn": "老鼠在墙角咬出了一个洞。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small depression or hollow in a surface, often natural or unintentional.",
      "explanation_cn": "指表面上的小凹陷或坑洞，通常是自然形成或非故意的。",
      "example_en": "He tripped over a hole in the sidewalk and fell.",
      "example_cn": "他在人行道的一个坑里绊了一跤。"
    },
    {
      "pos": "noun",
      "explanation_en": "A gap or deficiency in knowledge, evidence, or continuity, often implying something missing or unexplained.",
      "explanation_cn": "指知识、证据或连续性中的缺口或缺陷，常暗示某物缺失或未被解释。",
      "example_en": "There's a hole in your argument — you didn't address the counter-evidence.",
      "example_cn": "你的论点有个漏洞——你没有回应反证。"
    },
    {
      "pos": "noun",
      "explanation_en": "In golf, a designated area on the course where the ball must be hit into, typically consisting of a small cup in the ground.",
      "explanation_cn": "在高尔夫球运动中，指球必须被击入的指定区域，通常为地面上的一个小杯状凹坑。",
      "example_en": "She sank the putt on the 18th hole to win the tournament.",
      "example_cn": "她在第18洞推杆入洞，赢得了比赛。"
    },
    {
      "pos": "noun",
      "explanation_en": "A place or situation considered undesirable, dangerous, or socially marginalized, often used metaphorically.",
      "explanation_cn": "指被认为恶劣、危险或社会边缘化的地方或处境，常用于隐喻。",
      "example_en": "The old factory was a hole filled with rats and broken glass.",
      "example_cn": "那座旧工厂是个布满老鼠和碎玻璃的破地方。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "aperture",
      "analysis": "“Aperture”（孔洞/开口）是更正式、技术性的术语，常用于光学、摄影或工程领域，特指允许光线或物质通过的精确开口，强调功能性与尺寸控制。而 “hole” 更通用，可指任何大小、形状或成因的开口，常带随意或负面含义。"
    },
    {
      "word_to_compare": "gap",
      "analysis": "“Gap”（间隙/缺口）强调两个物体或状态之间的空缺，通常是连续性中断的体现，如时间差距、收入差距。它不一定是物理上的洞，而 “hole” 更常指实体中的穿孔或凹陷。两者在抽象语境中可互换，但 “gap” 更侧重对比与缺失，而 “hole” 更具空间性。"
    },
    {
      "word_to_compare": "crack",
      "analysis": "“Crack”（裂缝）指物体表面因应力或老化而产生的细长裂口，通常未完全穿透，且形状狭长。而 “hole” 是完全贯穿或深陷的开口，体积更大、更完整。例如，玻璃上的裂缝是 crack，而子弹打出的洞是 hole。"
    }
  ]
}