{
  "word": "hollywood",
  "pronunciation": "hohl·y·wood",
  "concise_definition": "n. 好莱坞, 美国电影工业的代称",
  "forms": {
    "plural": "Hollywoods"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A neighborhood in Los Angeles, California, historically known as the center of the American film industry and the birthplace of major movie studios such as Paramount, Warner Bros., and MGM.",
      "explanation_cn": "位于加利福尼亚州洛杉矶的一个地区，历史上是美国电影工业的中心，也是派拉蒙、华纳兄弟和米高梅等主要电影公司的发源地。",
      "example_en": "Many aspiring actors move to Hollywood hoping to become movie stars.",
      "example_cn": "许多有抱负的演员搬到好莱坞，希望成为电影明星。"
    },
    {
      "pos": "noun",
      "explanation_en": "A metonym for the American film industry as a whole, representing its culture, glamour, production values, and influence on global cinema.",
      "explanation_cn": "作为整个美国电影工业的代称，代表其文化、奢华风格、制作水准以及对全球电影业的影响。",
      "example_en": "Hollywood has shaped global perceptions of romance and heroism for over a century.",
      "example_cn": "一个多世纪以来，好莱坞塑造了全球对浪漫与英雄主义的认知。"
    },
    {
      "pos": "noun",
      "explanation_en": "A symbol of fame, fortune, and the pursuit of stardom, often associated with both glamour and the darker side of celebrity culture.",
      "explanation_cn": "象征着名望、财富与明星梦想，常与光彩夺目的光环和名人文化的阴暗面联系在一起。",
      "example_en": "The documentary exposed the dark side of Hollywood: pressure, exploitation, and broken dreams.",
      "example_cn": "这部纪录片揭露了好莱坞的阴暗面：压力、剥削与破碎的梦想。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bollywood",
      "analysis": "“Bollywood”（宝莱坞）是印度孟买印地语电影产业的代称，与“Hollywood”类似，但其电影风格更注重歌舞、情感和家庭主题，制作周期和叙事结构也更具本土文化特色。两者都是全球重要的电影中心，但“Hollywood”更强调商业大片与全球影响力，而“Bollywood”则以本土市场为主、产量巨大。"
    },
    {
      "word_to_compare": "cinema",
      "analysis": "“Cinema”（电影/电影艺术）是一个更广泛、更学术化的术语，泛指电影作为一种艺术形式或观影体验，不特指某个地区或产业。而“Hollywood”特指美国电影工业体系及其商业运作模式，是“cinema”的一个子集，带有强烈的文化和经济标签。"
    },
    {
      "word_to_compare": "tinseltown",
      "analysis": "“Tinseltown”（锡城）是“Hollywood”的一个非正式别称，带有讽刺意味，强调其表面光鲜亮丽（如锡箔般闪亮）但内在虚幻、浮华的本质。它更侧重于批评好莱坞的虚假与名利场文化，而“Hollywood”本身是中性或正面的地理与产业名称。"
    }
  ]
}