{
  "word": "hollow",
  "pronunciation": "hah·loh",
  "concise_definition": "adj. 空心的, 空洞的; v. 使成空心, 挖空",
  "forms": {
    "comparative": "hollower",
    "superlative": "hollowest",
    "third_person_singular": "hollows",
    "past_tense": "hollowed",
    "past_participle": "hollowed",
    "present_participle": "hollowing"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having an empty space inside; not solid or filled, often implying a physical cavity or depression.",
      "explanation_cn": "内部有空腔的；非实心的，通常指存在物理上的空洞或凹陷。",
      "example_en": "The tree had a hollow trunk that housed a family of owls.",
      "example_cn": "这棵树有一个空心的树干，里面住着一群猫头鹰。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Lacking sincerity, substance, or genuine feeling; insincere or empty in meaning.",
      "explanation_cn": "缺乏真诚、实质或真实情感的；意义空洞或虚伪的。",
      "example_en": "His hollow promises did nothing to calm the angry crowd.",
      "example_cn": "他空洞的承诺丝毫未能平息愤怒的人群。"
    },
    {
      "pos": "noun",
      "explanation_en": "A depression or cavity in a surface, especially one that is rounded or bowl-shaped; often used to describe a natural landform.",
      "explanation_cn": "表面的凹陷或空洞，尤指呈圆形或碗状的；常用于描述自然地形。",
      "example_en": "The hikers found a small hollow between the hills where they could camp safely.",
      "example_cn": "徒步者在两座山丘之间发现了一个小凹地，可以安全扎营。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove the inner part of something to create a cavity or empty space within.",
      "explanation_cn": "通过移除内部物质使某物成为空心的。",
      "example_en": "Artisans hollowed out the log to make a traditional drum.",
      "example_cn": "工匠们将原木挖空，制作了一面传统鼓。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "empty",
      "analysis": "“Empty” (空的) 是一个更通用的词，指没有任何东西存在，可适用于抽象或具体语境（如空房间、空想法）。“Hollow” 更强调内部有空间或结构上的空洞，常带有物理或隐喻的深度感，如空心的物体或空洞的承诺。"
    },
    {
      "word_to_compare": "vacant",
      "analysis": "“Vacant” (空置的) 通常指位置、职位或表情上的空缺，强调未被占据或缺乏内容，但不必然暗示内部结构的空洞。例如 vacant room（空房间）或 vacant stare（空洞的眼神）。“Hollow” 则更强调内在的缺失或虚无，常带有情感或实质上的贫瘠感。"
    },
    {
      "word_to_compare": "cavity",
      "analysis": "“Cavity” (空腔) 是一个名词，专指物理上的孔洞或凹陷，如牙齿蛀洞或地质凹陷。它是一个具体术语，而 “hollow” 既可以是形容词也可以是名词，语义更广泛，可涵盖自然地貌、抽象概念甚至比喻意义。"
    }
  ]
}