{
  "word": "holocaust",
  "pronunciation": "hoh·luh·kɔst",
  "concise_definition": "n. 大屠杀, 灾难, 焚烧",
  "forms": {
    "plural": "holocausts"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The systematic, state-sponsored persecution and murder of six million Jews by Nazi Germany and its collaborators during World War II; often used with the definite article 'the' to refer specifically to this historical event.",
      "explanation_cn": "指纳粹德国及其合作者在第二次世界大战期间有组织、有计划地迫害并屠杀六百万犹太人的历史事件；通常与定冠词 'the' 连用，特指这一事件。",
      "example_en": "The Holocaust remains one of the most horrific genocides in human history.",
      "example_cn": "大屠杀是人类历史上最骇人听闻的种族灭绝事件之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A massive destruction or slaughter, often caused by fire or war, resulting in widespread death and devastation.",
      "explanation_cn": "指由火灾、战争或其他原因造成的巨大破坏或屠杀，导致广泛死亡与毁灭。",
      "example_en": "The nuclear war would be a holocaust beyond imagination.",
      "example_cn": "核战争将是一场难以想象的大浩劫。"
    },
    {
      "pos": "noun",
      "explanation_en": "An ancient Jewish religious sacrifice in which an offering is completely burned on an altar.",
      "explanation_cn": "指古代犹太宗教仪式中，将祭品完全焚烧在祭坛上的献祭方式。",
      "example_en": "In the Old Testament, the holocaust was a burnt offering pleasing to God.",
      "example_cn": "在《旧约》中，燔祭是一种令上帝喜悦的全然焚烧的献祭。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "genocide",
      "analysis": "“Genocide” (种族灭绝) 是一个法律和学术术语，指蓄意全部或部分消灭某一民族、人种、宗教或族群的行为。它强调的是“意图”和“群体目标”，而 “holocaust” 更侧重于事件的规模、惨烈程度和毁灭性，尤其在特指纳粹对犹太人的屠杀时具有不可替代的历史语义。"
    },
    {
      "word_to_compare": "catastrophe",
      "analysis": "“Catastrophe” (灾难) 是一个更广泛的词，泛指任何造成巨大损失或破坏的事件，如地震、金融危机等，不必然涉及人为屠杀或种族仇恨。而 “holocaust” 通常带有强烈的人为暴行和道德谴责色彩，语义更沉重、更具体。"
    },
    {
      "word_to_compare": "massacre",
      "analysis": "“Massacre” (大屠杀) 指对大量无抵抗能力者进行的残忍杀戮，通常是一次性或短期事件，如一次战斗后的屠杀。而 “holocaust” 不仅规模更大，还包含系统性、长期性、制度化的迫害过程，常涉及国家机器和意识形态驱动，语义层次更深。"
    }
  ]
}