{
  "word": "homers",
  "pronunciation": "hoh·murs",
  "concise_definition": "n. 本垒打, 回家球; (复数形式) 指击出本垒打的球员或行为",
  "forms": {
    "singular": "homer"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "In baseball, a home run: a hit that allows the batter to circle all the bases and score a run without being put out, typically by hitting the ball out of the playing field.",
      "explanation_cn": "在棒球运动中，指本垒打：击球员击出球后，可安全绕过所有垒包并得分，且未被对方防守方淘汰，通常是因为球被击出球场外。",
      "example_en": "He hit two homers in the final inning, leading his team to victory.",
      "example_cn": "他在最后一局击出两记本垒打，带领球队取得胜利。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who consistently hits home runs; often used informally to refer to a powerful hitter.",
      "explanation_cn": "指经常击出本垒打的球员；非正式用法中常用来形容力量型击球手。",
      "example_en": "The team's homers are the main reason they lead the league in runs scored.",
      "example_cn": "球队的本垒打高手是他们得分领先联盟的主要原因。"
    },
    {
      "pos": "noun",
      "explanation_en": "In British slang, a biased or overly favorable report or opinion, especially in media or commentary, often favoring one's own team or country.",
      "explanation_cn": "在英式俚语中，指带有偏见或过度偏袒的报道或观点，尤其在媒体或评论中偏向自己的球队或国家。",
      "example_en": "The commentator's homer coverage of the home team was obvious to everyone watching.",
      "example_cn": "解说员对主队的偏袒性报道，所有观众都看得出来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "home run",
      "analysis": "“Home run” 是标准术语，指击出本垒打这一行为或事件本身，是名词短语；而 “homer” 是其口语化、简化的单数形式，常用于非正式语境，也可指击出本垒打的球员。两者在棒球语境中可互换，但 “homer” 更具口语和人物指向性。"
    },
    {
      "word_to_compare": "slam",
      "analysis": "“Slam” 是棒球俚语，常指“满垒本垒打”（grand slam），即垒上有三名跑垒员时击出的本垒打，得分更多。它强调的是本垒打的规模和威力，而 “homer” 是通用术语，不特指垒上人数。因此，“slam” 是 “homer” 的一种特殊类型。"
    },
    {
      "word_to_compare": "bias",
      "analysis": "“Bias” (偏见) 是一个通用词，泛指任何形式的不公正倾向；而 “homer” 在英式俚语中特指媒体或评论中对本方球队/国家的过度偏袒，具有语境限定性。因此，“homer” 是 “bias” 在体育评论领域的一种具体表现形式。"
    }
  ]
}