{
  "word": "home",
  "pronunciation": "hohm",
  "concise_definition": "n. 家, 家庭, 住所; v. 回家, 定位",
  "forms": {
    "plural": "homes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The place where one lives permanently, especially as a member of a family or household; a dwelling that provides shelter, comfort, and emotional belonging.",
      "explanation_cn": "指一个人永久居住的地方，尤其是作为家庭或住户成员的居所；一个提供庇护、舒适和情感归属的住所。",
      "example_en": "After years of traveling, she was eager to return home.",
      "example_cn": "多年旅行后，她渴望回到家中。"
    },
    {
      "pos": "noun",
      "explanation_en": "A place or environment in which someone feels a deep sense of belonging, identity, or emotional connection, even if not a physical dwelling.",
      "explanation_cn": "指一个人感到强烈归属感、认同感或情感联系的地方或环境，即使并非实际的居所。",
      "example_en": "For many immigrants, the local community center became their new home.",
      "example_cn": "对许多移民来说，当地的社区中心成了他们的新家。"
    },
    {
      "pos": "noun",
      "explanation_en": "The headquarters or base of an organization, team, or activity; the place where something originates or is primarily located.",
      "explanation_cn": "指一个组织、团队或活动的总部或基地；某事物起源或主要所在地。",
      "example_en": "The company's home office is in New York.",
      "example_cn": "这家公司的总部设在纽约。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or direct something toward its target or intended destination, especially with precision; often used in contexts of navigation or technology.",
      "explanation_cn": "指以精确的方式将某物移向其目标或预定位置，常用于导航或技术语境中。",
      "example_en": "The missile homed in on the enemy radar signal.",
      "example_cn": "导弹锁定并飞向敌方雷达信号。"
    },
    {
      "pos": "verb",
      "explanation_en": "To return to one's home or place of origin; to go back to a familiar or comfortable environment.",
      "explanation_cn": "指返回自己的家或起源地；回到一个熟悉或舒适的环境。",
      "example_en": "The birds homed after their long migration.",
      "example_cn": "这些鸟在长途迁徙后飞回了家园。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "house",
      "analysis": "“House” (房屋) 仅指物理结构，即砖瓦木石建造的居住建筑，强调建筑本身。而 “home” 不仅包含物理空间，更强调情感、归属和人际关系，是心理意义上的‘家’。一个房子可以没有家，但一个家一定有房子或类似的空间。"
    },
    {
      "word_to_compare": "residence",
      "analysis": "“Residence” (住所) 是一个正式、法律或官方用语，指一个人登记或合法居住的地方，强调事实性与规范性，不含情感色彩。而 “home” 是主观的、情感化的，即使一个人住在旅馆，也可能说‘这是我的家’。"
    },
    {
      "word_to_compare": "nest",
      "analysis": "“Nest” (巢穴) 常用于动物或比喻性语境，强调温馨、隐蔽和保护性，带有强烈的自然或童真意象。它常用于文学中形容家的温暖与安全，但使用范围较窄，不适用于正式或广义的人类居住环境。而 “home” 更通用、更包容。"
    }
  ]
}