{
  "word": "homestead",
  "pronunciation": "hohm·sted",
  "concise_definition": "n. 家园, 家庭农场; v. 在家园定居, 开垦土地",
  "forms": {
    "plural": "homesteads",
    "third_person_singular": "homesteads",
    "past_tense": "homesteaded",
    "past_participle": "homesteaded",
    "present_participle": "homesteading"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A house and the surrounding land owned and occupied by a family, especially in a rural setting, often including farmland and outbuildings.",
      "explanation_cn": "指一个家庭拥有并居住的住宅及其周边土地，通常位于乡村地区，包括农田和附属建筑。",
      "example_en": "They moved to a quiet homestead in the mountains, where they grew their own vegetables and raised chickens.",
      "example_cn": "他们搬到了山里一处宁静的家园，在那里种植蔬菜、饲养鸡群。"
    },
    {
      "pos": "noun",
      "explanation_en": "A piece of land granted by the government to settlers under homestead laws, especially in 19th-century America, in exchange for cultivating it.",
      "explanation_cn": "指根据宅地法（如19世纪美国）由政府授予拓荒者、条件为开垦耕种的土地。",
      "example_en": "Under the Homestead Act of 1862, families could claim 160 acres of public land for free if they improved it.",
      "example_cn": "根据1862年的《宅地法》，家庭只要开垦土地，便可免费获得160英亩的公共土地。"
    },
    {
      "pos": "verb",
      "explanation_en": "To settle on and cultivate land, especially under a homesteading law, to establish a permanent residence.",
      "explanation_cn": "指在某块土地上定居并开垦耕种，尤指依据宅地法建立永久居所。",
      "example_en": "Her ancestors homesteaded in Nebraska in the 1880s, building a log cabin and planting wheat.",
      "example_cn": "她的祖先于19世纪80年代在内布拉斯加定居，建造了木屋并种植小麦。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "farm",
      "analysis": "“Farm”（农场）泛指用于农业生产的土地和设施，不一定包含住宅或家庭生活。而 “homestead” 强调住宅与土地的结合，是家庭生活与农业生产一体化的单位，更具生活和情感色彩。"
    },
    {
      "word_to_compare": "residence",
      "analysis": "“Residence”（住所）仅指居住的房屋或地点，不涉及土地耕种或经济自给。而 “homestead” 不仅是居住地，还包含自给自足的生产功能，是生活与劳动的统一体。"
    },
    {
      "word_to_compare": "estate",
      "analysis": "“Estate”（地产/庄园）通常指规模较大、可能由贵族或富人拥有的土地，常带有社会等级和财富象征，而 “homestead” 多与普通家庭、拓荒者、自力更生相关，强调朴素、勤劳和独立。"
    }
  ]
}