{
  "word": "honourable",
  "pronunciation": "hon·uh·ruh·buhl",
  "concise_definition": "adj. 值得尊敬的, 体面的, 正直的",
  "forms": {
    "comparative": "more honourable",
    "superlative": "most honourable"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Deserving respect and admiration because of high moral principles, integrity, or noble conduct; characterized by honesty and fairness.",
      "explanation_cn": "因具有高尚的道德原则、正直或高贵的行为而值得尊敬和钦佩；以诚实和公正为特征。",
      "example_en": "He made an honourable decision to return the lost wallet to its owner.",
      "example_cn": "他做出了一个正直的决定，将捡到的钱包归还给失主。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used as a formal title for certain officials, especially in British and Commonwealth contexts, to denote status and respect (e.g., 'The Honourable John Smith').",
      "explanation_cn": "用作对某些官员的正式尊称，尤其在英国及英联邦国家中，以表示其地位与尊重（如 'The Honourable John Smith'）。",
      "example_en": "The Honourable Member for Cambridge addressed the house with great dignity.",
      "example_cn": "剑桥选区的议员以极大的尊严向议会发表了讲话。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Appearing respectable or morally upright, even if not entirely genuine; sometimes used ironically to describe actions that seem proper on the surface.",
      "explanation_cn": "表面上显得体面或道德高尚，即使未必真实；有时用于讽刺，指那些表面上看似正当的行为。",
      "example_en": "It was an honourable excuse, but everyone knew he was just trying to avoid blame.",
      "example_cn": "这是一个体面的借口，但人人都知道他只是想逃避责任。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "respectable",
      "analysis": "“Respectable”（体面的）强调符合社会常规和公众期望，通常指行为得体、不招致非议，但不一定包含道德上的崇高性。而 “honourable” 更强调内在的正直、勇气和道德原则，具有更强的伦理分量。"
    },
    {
      "word_to_compare": "noble",
      "analysis": "“Noble”（高贵的）常用于描述出身、气质或行为的崇高与优雅，常带有贵族或理想化的色彩，侧重于精神层面的卓越。“Honourable” 更贴近日常道德判断，强调诚实、公正和责任感，更实用和具体。"
    },
    {
      "word_to_compare": "upright",
      "analysis": "“Upright”（正直的）与 “honourable” 非常接近，都指道德上正确、不偏不倚。但 “upright” 更侧重于行为的端正和不妥协，常用于形容个人品格；而 “honourable” 还可扩展用于头衔、决定或整体行为的评价，语义范围更广。"
    }
  ]
}