{
  "word": "honor",
  "pronunciation": "on·er",
  "concise_definition": "n. 尊敬, 荣誉, 崇高; v. 尊重, 履行, 给予荣誉",
  "forms": {
    "third_person_singular": "honors",
    "past_tense": "honored",
    "past_participle": "honored",
    "present_participle": "honoring",
    "plural": "honors"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A high respect or admiration earned by someone for their integrity, achievements, or moral character; also refers to a privilege or distinction granted to someone.",
      "explanation_cn": "指因某人的正直、成就或道德品质而赢得的崇高尊重或钦佩；也可指授予某人的特殊荣誉或殊荣。",
      "example_en": "She received the Nobel Prize in honor of her groundbreaking work in physics.",
      "example_cn": "她因在物理学领域的开创性工作而荣获诺贝尔奖。"
    },
    {
      "pos": "noun",
      "explanation_en": "A moral principle or code of conduct that guides one’s behavior, especially regarding truth, fairness, and duty.",
      "explanation_cn": "指指导个人行为的道德准则或信条，尤其涉及诚实、公正与责任。",
      "example_en": "He lived by a personal honor that demanded honesty even when no one was watching.",
      "example_cn": "他恪守个人信条，即使无人注视也坚持诚实。"
    },
    {
      "pos": "verb",
      "explanation_en": "To show respect or admiration for someone or something, often through public recognition or ceremony.",
      "explanation_cn": "指通过公开认可或仪式等方式，对某人或某事表示尊重或钦佩。",
      "example_en": "The school honored its retiring teachers with a special banquet.",
      "example_cn": "学校为退休教师举办了一场特别晚宴以示敬意。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fulfill a promise, obligation, or agreement; to keep one’s word.",
      "explanation_cn": "指履行承诺、义务或协议；信守诺言。",
      "example_en": "The company honored its contract despite the financial losses.",
      "example_cn": "尽管遭受经济损失，该公司仍履行了合同。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "respect",
      "analysis": "“Respect” (尊重) 是一种普遍的、基于礼貌或认可的态度，可针对任何人或事物，不一定涉及道德高度或特殊成就。而 “honor” 更强调深层的敬仰、崇高的地位或仪式性的认可，通常与道德价值或重大贡献相关。"
    },
    {
      "word_to_compare": "prestige",
      "analysis": "“Prestige” (声望) 指因社会地位、财富或成就而获得的广泛认可和影响力，常带有外在性和社会性。而 “honor” 更侧重于内在的道德价值、个人操守或被授予的正式荣誉，不一定与社会地位直接相关。"
    },
    {
      "word_to_compare": "dignity",
      "analysis": "“Dignity” (尊严) 指一个人保持自尊、庄重和自我价值感的状态，是内在品质。而 “honor” 可以是他人授予的外部认可，也可以是个人坚守的道德准则，更强调行为与价值的外在体现。"
    }
  ]
}