{
  "word": "honour",
  "pronunciation": "hon·ur",
  "concise_definition": "n. 荣誉, 尊敬, 信誉; v. 尊重, 履行, 给予荣誉",
  "forms": {
    "third_person_singular": "honours",
    "past_tense": "honoured",
    "past_participle": "honoured",
    "present_participle": "honouring",
    "plural": "honours"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "High respect or great esteem shown toward someone or something, often due to their achievements, character, or status.",
      "explanation_cn": "因某人或某物的成就、品格或地位而表现出的极高尊重或敬意。",
      "example_en": "She was awarded the honour of Knight Commander for her service to medicine.",
      "example_cn": "她因对医学的贡献被授予骑士指挥官的荣誉。"
    },
    {
      "pos": "noun",
      "explanation_en": "A moral principle or code of conduct that guides one’s actions, especially regarding integrity, fairness, and keeping promises.",
      "explanation_cn": "指导个人行为的道德准则或行为规范，尤其涉及正直、公正和信守承诺。",
      "example_en": "He refused to lie, even under pressure, because it would violate his sense of honour.",
      "example_cn": "即使在压力下，他也拒绝撒谎，因为这会违背他的荣誉感。"
    },
    {
      "pos": "noun",
      "explanation_en": "A privilege or distinction granted to someone as a mark of recognition or favor.",
      "explanation_cn": "作为认可或恩宠的标志而授予某人的特权或殊荣。",
      "example_en": "It was an honour to be invited to speak at the Nobel ceremony.",
      "example_cn": "受邀在诺贝尔颁奖典礼上发言是一种殊荣。"
    },
    {
      "pos": "verb",
      "explanation_en": "To show respect or admiration for someone or something, especially by acknowledging their worth or achievements.",
      "explanation_cn": "通过承认某人或某物的价值或成就来表示尊重或钦佩。",
      "example_en": "The school honours its alumni who have made significant contributions to society.",
      "example_cn": "学校表彰那些为社会做出重大贡献的校友。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fulfill or carry out a promise, obligation, or agreement, especially one that is morally or socially binding.",
      "explanation_cn": "履行或执行一项承诺、义务或协议，尤其是具有道德或社会约束力的约定。",
      "example_en": "The government must honour its commitment to reduce carbon emissions by 2030.",
      "example_cn": "政府必须履行其在2030年前减少碳排放的承诺。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "respect",
      "analysis": "“Respect” (尊重) 是一种普遍的、基于礼貌或认可的态度，适用于日常人际互动，不一定涉及道德或崇高价值。而 “honour” 更强调深层的敬意、道德上的推崇，常与仪式、地位或重大成就相关，情感强度更高。"
    },
    {
      "word_to_compare": "prestige",
      "analysis": "“Prestige” (声望) 指因社会地位、成就或影响力而获得的广泛认可，通常是外在的、客观的评价。而 “honour” 更侧重于内在的道德价值、个人操守或被授予的正式荣誉，具有更强的主观性和伦理色彩。"
    },
    {
      "word_to_compare": "glory",
      "analysis": "“Glory” (荣耀) 常与胜利、辉煌或公众欢呼联系在一起，多用于宏大、戏剧性的场景（如战争、体育赛事）。而 “honour” 更庄重、内敛，强调正直、责任与承诺的履行，不一定伴随公众关注。"
    }
  ]
}