{
  "word": "hood",
  "pronunciation": "hood",
  "concise_definition": "n. 帽子, 帽兜, 车罩, 青少年群体; v. 给...加罩",
  "forms": {
    "plural": "hoods"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A covering for the head, especially one attached to a garment such as a coat or robe, designed to protect from weather or for ceremonial purposes.",
      "explanation_cn": "指附着在衣物（如外套或长袍）上、用于遮盖头部的覆盖物，通常用于防风挡雨或仪式用途。",
      "example_en": "She pulled the hood of her jacket over her head as the rain began to fall.",
      "example_cn": "当雨开始下时，她把夹克的帽兜拉到头上。"
    },
    {
      "pos": "noun",
      "explanation_en": "The front cover of a car that protects the engine, typically hinged at the front and lifting upward.",
      "explanation_cn": "汽车前部用于保护发动机的盖子，通常前端铰接，向上开启。",
      "example_en": "He opened the hood to check the engine oil level.",
      "example_cn": "他打开引擎盖检查机油液位。"
    },
    {
      "pos": "noun",
      "explanation_en": "A neighborhood or district, especially one associated with a particular social or cultural identity, often used in urban contexts to refer to a local community.",
      "explanation_cn": "指一个街区或地区，尤其在城市语境中，常用于指代具有特定社会或文化身份的本地社区。",
      "example_en": "He grew up in the projects on the south side of the city — that’s his hood.",
      "example_cn": "他在城市南区的公屋长大——那就是他的街区。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of young people, especially teenagers, often used in the phrase 'gangster hood' or 'street hood' to imply a subculture or lifestyle.",
      "explanation_cn": "指一群年轻人，尤其是青少年，常用于短语如 'gangster hood' 或 'street hood'，暗示一种亚文化或生活方式。",
      "example_en": "The movie portrays the struggles of life in the hood during the 1990s.",
      "example_cn": "这部电影描绘了20世纪90年代街区生活中的挣扎。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover or enclose something with a hood, especially to conceal or protect it.",
      "explanation_cn": "指用帽兜或罩子覆盖或包裹某物，通常是为了隐藏或保护。",
      "example_en": "The driver hooded the car’s engine to shield it from the dust.",
      "example_cn": "司机给汽车引擎加了罩子，以防灰尘进入。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cap",
      "analysis": "“Cap”（帽子）通常指独立的、不与衣物相连的头部覆盖物，如棒球帽或针织帽，强调装饰性或功能性遮阳。而 “hood” 是附着在衣物上的，更注重实用性（如防雨、保暖）和整体性，常与外套一体设计。"
    },
    {
      "word_to_compare": "neighborhood",
      "analysis": "“Neighborhood”（社区）是更正式、中性的地理术语，泛指一个居住区域，不带社会文化色彩。而 “hood” 作为其俚语用法，常带有强烈的社会标签，可能暗示贫困、犯罪或特定亚文化，语义更浓烈、更具情感色彩。"
    },
    {
      "word_to_compare": "cowl",
      "analysis": "“Cowl”（兜帽）是“hood”的一个更具体、更文学化的变体，常用于宗教服饰（如修士的长袍）或中世纪风格描述，强调宽大、垂坠的形态。而 “hood” 更通用，涵盖日常服装、汽车部件和城市俚语等多种语境。"
    }
  ]
}