{
  "word": "hoods",
  "pronunciation": "hoodz",
  "concise_definition": "n. 头巾, 披风, 车顶篷, 小区（复数形式）",
  "forms": {
    "singular": "hood"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A covering for the head and sometimes the neck, typically made of fabric, worn for warmth, protection, or religious purposes.",
      "explanation_cn": "一种覆盖头部和有时颈部的织物覆盖物，用于保暖、防护或宗教目的。",
      "example_en": "She pulled her hood up against the cold wind.",
      "example_cn": "她拉起头巾以抵御寒风。"
    },
    {
      "pos": "noun",
      "explanation_en": "The movable front cover over the engine of a vehicle, typically made of metal or composite material.",
      "explanation_cn": "车辆前部可移动的发动机盖，通常由金属或复合材料制成。",
      "example_en": "He opened the hood of the car to check the engine.",
      "example_cn": "他打开汽车引擎盖检查发动机。"
    },
    {
      "pos": "noun",
      "explanation_en": "A rear cover that folds down over the top of a convertible car to protect occupants from weather.",
      "explanation_cn": "敞篷车顶部可折叠的后盖，用于保护乘员免受天气影响。",
      "example_en": "The convertible’s hoods were damaged in the storm.",
      "example_cn": "这辆敞篷车的车顶篷在风暴中受损了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A neighborhood or district, especially one associated with a particular social or cultural identity (often used in plural form to refer to urban areas).",
      "explanation_cn": "一个街区或地区，尤其指具有特定社会或文化身份的区域（常以复数形式使用，指城市区域）。",
      "example_en": "The city’s hoods vary widely in culture, income, and safety.",
      "example_cn": "这座城市的不同街区在文化、收入和安全性方面差异巨大。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cap",
      "analysis": "“Cap”（帽子）通常指较小、较硬、仅覆盖头顶的帽子，如棒球帽或针织帽，不覆盖颈部。而 “hood”（头巾/披风）更大，常与衣物相连，可覆盖头颈甚至部分肩膀，更注重保暖或遮蔽功能。"
    },
    {
      "word_to_compare": "bonnet",
      "analysis": "“Bonnet”（引擎盖）是英式英语中对汽车前部发动机盖的称呼，与美式英语中的 “hood” 同义。但在其他语境中，“bonnet” 也可指女性的头饰，与 “hood” 的宗教或实用头巾含义部分重叠，但风格更传统。"
    },
    {
      "word_to_compare": "neighborhood",
      "analysis": "“Neighborhood”（社区）是更正式、中性的术语，泛指一个地理居住区域，不带社会评价色彩。而 “hoods” 作为俚语用法，常隐含对城市低收入或高犯罪率区域的指代，带有社会文化语境和潜在负面联想，语义更具体且情感色彩更强。"
    }
  ]
}