{
  "word": "hooker",
  "pronunciation": "hoo·kuhr",
  "concise_definition": "n. 卖淫妇, 钩子, 钓鱼钩, （美俚）足球中的后卫",
  "forms": {
    "plural": "hookers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A woman who engages in prostitution, often used as a derogatory term; historically derived from the term for someone who 'hooks' clients, especially in 19th-century urban slang.",
      "explanation_cn": "指从事卖淫的女性，常带有贬义；该词源于19世纪城市俚语，原指通过‘勾引’（hook）招揽顾客的人。",
      "example_en": "The novel portrays the harsh realities faced by street hookers in the 1980s.",
      "example_cn": "这部小说描绘了20世纪80年代街头卖淫女性所面临的严酷现实。"
    },
    {
      "pos": "noun",
      "explanation_en": "A curved or bent device used for catching, holding, or pulling something, typically made of metal or plastic; commonly used in fishing, climbing, or hanging objects.",
      "explanation_cn": "一种弯曲的装置，用于钩住、固定或拉拽物体，通常由金属或塑料制成，常用于钓鱼、攀岩或悬挂物品。",
      "example_en": "He used a fishing hooker to catch the large trout in the river.",
      "example_cn": "他用鱼钩在河里钓到了一条大鳟鱼。"
    },
    {
      "pos": "noun",
      "explanation_en": "In American football, a defensive player who lines up on the edge of the defensive line and is responsible for rushing the quarterback or containing outside runs; also called a 'defensive end' in some contexts.",
      "explanation_cn": "在美国橄榄球中，指位于防守线边缘、负责冲向四分卫或限制外侧跑动的防守球员；在某些语境中也称为‘防守端锋’。",
      "example_en": "The team's star hooker sacked the quarterback three times in the final quarter.",
      "example_cn": "球队的明星后卫在最后一节三次擒杀四分卫。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "prostitute",
      "analysis": "“Prostitute” 是更正式、中性的术语，用于法律、社会学或学术语境中，指以性交易为职业的人，不带有强烈情感色彩。而 “hooker” 是俚语，语气更粗俗、贬义，常用于口语或文学中以强化负面形象。"
    },
    {
      "word_to_compare": "hook",
      "analysis": "“Hook” 是 “hooker” 的词根，泛指任何弯曲的工具或动作，如鱼钩、挂钩、钩住等，是中性或技术性词汇。而 “hooker” 作为名词，特指具有钩状功能的物体或从事特定职业的人，语义范围更窄且常含社会文化含义。"
    },
    {
      "word_to_compare": "defender",
      "analysis": "“Defender” 是足球/橄榄球中对防守球员的通用术语，强调其防守职责，语义中性广泛。而 “hooker” 在美式橄榄球中是特定位置的俚语称呼，仅用于指代边线防守者，使用范围极有限，且在其他运动语境中不适用。"
    }
  ]
}