{
  "word": "hookup",
  "pronunciation": "hook·up",
  "concise_definition": "n. 临时性关系, 连接, 安装; v. 连接, 安装, 与人发生短暂性关系",
  "forms": {
    "third_person_singular": "hookups",
    "past_tense": "hooked up",
    "past_participle": "hooked up",
    "present_participle": "hooking up"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A casual sexual relationship or encounter between two people without a committed romantic relationship.",
      "explanation_cn": "指两个人之间没有正式恋爱关系的临时性性关系或性接触。",
      "example_en": "They had a hookup at the party last weekend, but they’re not dating.",
      "example_cn": "上周末他们在派对上发生了一夜情，但并没有在交往。"
    },
    {
      "pos": "noun",
      "explanation_en": "A physical connection or installation of a device, system, or component, especially for electrical, mechanical, or digital purposes.",
      "explanation_cn": "指设备、系统或组件之间的物理连接或安装，尤其用于电气、机械或数字用途。",
      "example_en": "The technician installed a new hookup for the internet router.",
      "example_cn": "技术人员为路由器安装了一个新的网络接口。"
    },
    {
      "pos": "verb",
      "explanation_en": "To connect or join two or more things together, especially mechanically, electrically, or digitally.",
      "explanation_cn": "指将两个或多个事物连接或接合在一起，尤指在机械、电气或数字层面。",
      "example_en": "Can you hook up the projector to the laptop?",
      "example_cn": "你能把投影仪连接到笔记本电脑上吗？"
    },
    {
      "pos": "verb",
      "explanation_en": "To arrange or facilitate a meeting or relationship, often casually or informally.",
      "explanation_cn": "指非正式地安排或促成一次会面或关系，常用于朋友之间介绍或撮合。",
      "example_en": "My friend hooked me up with a great mechanic who fixed my car for half the price.",
      "example_cn": "我的朋友给我介绍了一位很棒的修车师傅，修车费用只有一半。"
    },
    {
      "pos": "verb",
      "explanation_en": "To engage in a casual sexual encounter with someone.",
      "explanation_cn": "指与某人发生一次非正式的性接触。",
      "example_en": "They hooked up after the concert and haven’t seen each other since.",
      "example_cn": "他们在演唱会后发生了一夜情，之后就再没见面了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "relationship",
      "analysis": "“Relationship” (关系) 通常指具有情感投入、持续性和承诺的亲密关系，可以是恋爱、婚姻或友谊。而 “hookup” 强调的是短暂、无承诺的性接触，情感成分极少或没有。"
    },
    {
      "word_to_compare": "connect",
      "analysis": "“Connect” (连接) 是一个中性、通用的词，可用于物理、数字或情感层面的连接，不带有性或随意的含义。而 “hookup” 在口语中常特指性关系或临时性技术连接，语义更具体且带有非正式色彩。"
    },
    {
      "word_to_compare": "arrange",
      "analysis": "“Arrange” (安排) 指有计划地组织某事，通常带有目的性和正式性，如安排会议或约会。而 “hook up” 在表示撮合时更随意、非正式，常用于朋友间的临时介绍，缺乏正式规划。"
    }
  ]
}