{
  "word": "hop",
  "pronunciation": "hahp",
  "concise_definition": "v. 跳跃, 跳着走; n. 跳跃, 一跳, 啤酒花",
  "forms": {
    "third_person_singular": "hops",
    "past_tense": "hopped",
    "past_participle": "hopped",
    "present_participle": "hopping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To jump on one foot or move by short, springy leaps, often used to describe the movement of animals like rabbits or frogs, or people in a playful or energetic way.",
      "explanation_cn": "指用一只脚跳跃，或以短促、有弹性的跃动方式移动，常用于描述兔子、青蛙等动物的行动，或人活泼、轻快地跳跃。",
      "example_en": "The rabbit hopped quickly across the field.",
      "example_cn": "兔子迅速地在田野间跳跃着穿过。"
    },
    {
      "pos": "verb",
      "explanation_en": "To travel by making a series of short journeys or stops, especially in transportation contexts (e.g., hopping on a bus or hopping from city to city).",
      "explanation_cn": "指通过一系列短途行程或中途停留进行旅行，常用于交通语境，如搭公交车、从一个城市跳到另一个城市。",
      "example_en": "She hopped on a train to Chicago and then hopped another to Detroit.",
      "example_cn": "她搭上一列开往芝加哥的火车，然后又换乘另一列去底特律。"
    },
    {
      "pos": "noun",
      "explanation_en": "A single jump or leap, especially one made on one foot; can also refer to a small distance covered by such a movement.",
      "explanation_cn": "指一次单脚跳跃或跃动，也可指通过这种动作所移动的短距离。",
      "example_en": "He took a hop over the puddle and landed safely on the other side.",
      "example_cn": "他一跃跳过水坑，安全地落在了另一边。"
    },
    {
      "pos": "noun",
      "explanation_en": "The flower cluster of the hop plant, used primarily in brewing beer to add bitterness, flavor, and aroma.",
      "explanation_cn": "指啤酒花植物的花序，主要用于啤酒酿造，以增添苦味、风味和香气。",
      "example_en": "This craft beer uses a rare variety of hops from the Pacific Northwest.",
      "example_cn": "这款精酿啤酒使用了来自太平洋西北地区的一种稀有啤酒花。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "jump",
      "analysis": "“Jump” (跳跃) 是更通用的词，指从地面或其他表面用力蹬起，通常双脚离地，可涵盖各种高度和距离的跃动。而 “hop” 更强调单脚起跳、短促轻快的跳跃，动作更小、更轻盈，常带有一种随意或活泼的意味。"
    },
    {
      "word_to_compare": "skip",
      "analysis": "“Skip” (蹦跳) 指一种交替脚步、有节奏的跳跃动作，常用于儿童游戏或轻松行走，如边走边跳。它比 “hop” 更复杂，包含交替动作，而 “hop” 通常是连续单脚重复的跳跃。"
    },
    {
      "word_to_compare": "bounce",
      "analysis": "“Bounce” (弹跳) 强调物体因弹性撞击表面后反弹的物理特性，如球落地弹起。它通常是被动或受外力驱动的，而 “hop” 是主动、有意识的肢体动作，常用于人或动物的自主移动。"
    }
  ]
}