{
  "word": "hope",
  "pronunciation": "hohp",
  "concise_definition": "n. 希望, 期望; v. 希望, 期盼",
  "forms": {
    "third_person_singular": "hopes",
    "past_tense": "hoped",
    "past_participle": "hoped",
    "present_participle": "hoping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A feeling of expectation and desire for a certain thing to happen, often accompanied by optimism about its likelihood.",
      "explanation_cn": "对某事发生的一种期待与渴望之情，通常伴随着对其可能性的乐观态度。",
      "example_en": "Despite the challenges, she held on to the hope that things would improve.",
      "example_cn": "尽管面临挑战，她仍抱着事情会好转的希望。"
    },
    {
      "pos": "noun",
      "explanation_en": "Something that is hoped for; a person or thing that is a source of optimism or expectation.",
      "explanation_cn": "指被期望的事物；也可指带来乐观或期待的人或事物。",
      "example_en": "The new vaccine is our last hope for controlling the outbreak.",
      "example_cn": "这种新疫苗是我们控制疫情的最后希望。"
    },
    {
      "pos": "verb",
      "explanation_en": "To wish for something to happen with expectation or confidence, often implying a positive outcome.",
      "explanation_cn": "带着期待或信心希望某事发生，通常暗示积极的结果。",
      "example_en": "I hope you have a safe journey home.",
      "example_cn": "我希望你回家的旅途平安。"
    },
    {
      "pos": "verb",
      "explanation_en": "To believe or expect that something is likely to be true or will occur, often based on limited evidence.",
      "explanation_cn": "基于有限的证据相信或预期某事很可能为真或将发生。",
      "example_en": "We hope the meeting will be rescheduled soon.",
      "example_cn": "我们希望会议能尽快重新安排。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "wish",
      "analysis": "“Wish”（愿望）通常表达一种更主观、更不现实或更难以实现的愿望，常用于与现实相反的假设情境（如 I wish I were rich）。而 “hope” 更倾向于表达对现实可能性的积极期待，语气更乐观、更贴近实际。"
    },
    {
      "word_to_compare": "expect",
      "analysis": "“Expect”（期待）强调基于逻辑、经验或证据的合理预期，带有较强的确定性；而 “hope” 更强调情感上的渴望，不确定性更高。例如：I expect him to arrive at 5 p.m.（我预计他五点到） vs. I hope he arrives on time（我希望他准时到）。"
    },
    {
      "word_to_compare": "desire",
      "analysis": "“Desire”（渴望）是一种更强烈、更主动的追求，常带有意志力和行动倾向，可能伴随占有或实现的冲动；而 “hope” 更被动，侧重于内心对未来的期待，不一定伴随行动。例如：He desires power（他渴望权力） vs. He hopes for peace（他希望和平）。"
    }
  ]
}