{
  "word": "hopped",
  "pronunciation": "hahpt",
  "concise_definition": "v. 跳跃, 单脚跳, 短途搭乘",
  "forms": {
    "base_form": "hop",
    "third_person_singular": "hops",
    "past_tense": "hopped",
    "past_participle": "hopped",
    "present_participle": "hopping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To jump on one foot, typically in a light, quick, or playful manner, often used to describe the movement of animals like rabbits or birds.",
      "explanation_cn": "以单脚跳跃，通常轻快、迅速或带有玩耍的意味，常用于描述兔子、鸟类等动物的移动方式。",
      "example_en": "The bunny hopped across the meadow, disappearing into the tall grass.",
      "example_cn": "兔子蹦蹦跳跳地穿过草地，消失在高高的草丛中。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move quickly from one place to another, especially by making a short journey on public transport or by getting into a vehicle briefly.",
      "explanation_cn": "指快速从一个地方移动到另一个地方，尤指短途搭乘公共交通工具或临时上车。",
      "example_en": "She hopped on the bus to get to the city center before the meeting.",
      "example_cn": "她跳上公交车，赶在会议前到达市中心。"
    },
    {
      "pos": "verb",
      "explanation_en": "To visit a series of places in quick succession, especially bars or clubs, often for socializing or entertainment.",
      "explanation_cn": "指快速接连造访多个场所，尤指酒吧或俱乐部，常用于社交或娱乐目的。",
      "example_en": "After dinner, they hopped from one pub to another, laughing and singing all night.",
      "example_cn": "晚饭后，他们一家接一家地逛酒吧，整晚欢笑歌唱。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "jumped",
      "analysis": "“Jumped” (跳跃) 是更通用的词，指任何从地面腾空而起的动作，可以是双脚或单脚，幅度可大可小，常用于正式或中性语境。而 “hopped” 更强调轻快、短促、单脚的跳跃，带有轻松或活泼的语气，常用于描述小动物或儿童的动作。"
    },
    {
      "word_to_compare": "bounced",
      "analysis": "“Bounced” (弹跳) 指物体因撞击而弹起，强调弹性与回弹力，如球落地后弹起。它通常不涉及主动控制，而 “hopped” 是有意识的、有节奏的单脚跳跃动作，更强调动作的意图和方式。"
    },
    {
      "word_to_compare": "rode",
      "analysis": "“Rode” (乘坐) 指作为乘客在交通工具上移动，强调的是被运送的状态，而非主动的短途移动行为。而 “hopped on” 是一种非正式、随意的搭乘动作，隐含快速、临时、不正式的意味，如 ‘hopped on a taxi’ 与 ‘rode a taxi’ 相比更口语化、更生动。"
    }
  ]
}