{
  "word": "hopping",
  "pronunciation": "hahp·ing",
  "concise_definition": "adj. 跳跃的, 热闹的; n. 跳跃, 跳舞; v. 跳, 跳行",
  "forms": {
    "base_form": "hop",
    "third_person_singular": "hops",
    "past_tense": "hopped",
    "past_participle": "hopped",
    "present_participle": "hopping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move by jumping on one foot or by making short, springy leaps, often as a physical action or a form of locomotion.",
      "explanation_cn": "指用单脚跳跃或做出短促、有弹性的跃动，通常作为一种身体动作或移动方式。",
      "example_en": "The rabbit was hopping through the meadow, leaving tiny prints in the grass.",
      "example_cn": "兔子在草地上跳跃着，留下了一串串小小的脚印。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move quickly from one place to another, especially in a lively or energetic way, often used in the context of visiting multiple venues in succession (e.g., bars, clubs).",
      "explanation_cn": "指快速地从一个地方移动到另一个地方，尤其以活跃、充满活力的方式，常用于连续造访多个场所（如酒吧、俱乐部）的情境。",
      "example_en": "On Saturday night, we went hopping from one nightclub to another.",
      "example_cn": "周六晚上，我们从一家夜总会跳到另一家。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing a place or event that is lively, popular, and full of energetic activity, especially in social or entertainment contexts.",
      "explanation_cn": "形容某个地方或活动充满活力、受欢迎且热闹非凡，尤其用于社交或娱乐场合。",
      "example_en": "The downtown area is hopping on weekends with live music and crowds.",
      "example_cn": "市中心在周末因现场音乐和人群而热闹非凡。"
    },
    {
      "pos": "noun",
      "explanation_en": "A single act of hopping; a jump or leap, often used in playful or informal contexts.",
      "explanation_cn": "一次跳跃行为，常用于轻松或非正式语境中。",
      "example_en": "The child gave a little hop to reach the top step.",
      "example_cn": "孩子轻轻一跳，够到了最上面的台阶。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "jump",
      "analysis": "“Jump” (跳跃) 是更通用的词，指任何从地面或其他表面用力蹬起的动作，可以是双脚或单脚，高度和距离不限。而 “hop” 通常特指单脚连续或短促的跳跃，动作更轻、更小，常带有一种活泼或顽皮的意味。"
    },
    {
      "word_to_compare": "bouncing",
      "analysis": "“Bouncing” (弹跳) 强调物体因弹性而反复上下弹动，如球落地后弹起，常是被动或受外力影响的结果。而 “hopping” 是主动的、有意识的肢体动作，通常由人或动物发起，且不一定是弹性的。"
    },
    {
      "word_to_compare": "party",
      "analysis": "“Party” (派对) 是一个名词，指社交聚会，而 “hopping” 作为形容词时（如 a hopping scene）描述的是派对或场所的热闹氛围，它不是聚会本身，而是其活跃程度的特征。两者语义不同，但常在口语中搭配使用，如 “going hopping” 指去热闹的地方玩。"
    }
  ]
}