{
  "word": "horde",
  "pronunciation": "hawrd",
  "concise_definition": "n. 大群, 乌合之众; v. 聚集, 拥挤",
  "forms": {
    "plural": "hordes",
    "third_person_singular": "hordes",
    "past_tense": "horded",
    "past_participle": "horded",
    "present_participle": "hording"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A large, disorderly group of people or animals, often perceived as overwhelming, threatening, or migrating en masse, typically with connotations of savagery or lack of organization.",
      "explanation_cn": "指大量杂乱无章的人群或动物，常带有压迫性、威胁性或大规模迁徙的意味，隐含野蛮或无组织的负面色彩。",
      "example_en": "A horde of tourists flooded the ancient ruins during the summer holiday.",
      "example_cn": "暑假期间，一群群游客涌入了这些古迹。"
    },
    {
      "pos": "noun",
      "explanation_en": "A historical term referring to a nomadic tribal group, especially among the Mongols or other Central Asian peoples, known for their military mobility and conquests.",
      "explanation_cn": "历史术语，特指蒙古人或其他中亚民族的游牧部落群体，以其军事机动性和征服能力著称。",
      "example_en": "The Huns, led by Attila, were a fearsome horde that swept across Europe in the 5th century.",
      "example_cn": "由阿提拉率领的匈人是一支令人畏惧的游牧部落，在公元五世纪横扫欧洲。"
    },
    {
      "pos": "verb",
      "explanation_en": "To gather or move in large, crowded numbers, often in a chaotic or urgent manner.",
      "explanation_cn": "指大量人群或事物以混乱或急迫的方式聚集或移动。",
      "example_en": "Shoppers horded around the entrance as the store opened at midnight.",
      "example_cn": "商店午夜开门时，顾客们蜂拥而至，挤在入口处。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "crowd",
      "analysis": "“Crowd”（人群）泛指聚集在一起的人，中性词，无强烈情感色彩，可指有序的集会（如演唱会观众）。而 “horde” 强调混乱、庞大、具有压迫感甚至威胁性，常含贬义，暗示无组织和野蛮性。"
    },
    {
      "word_to_compare": "mob",
      "analysis": "“Mob”（暴民）特指具有暴力倾向或破坏行为的群体，强调情绪失控和非法行为。而 “horde” 更侧重数量庞大和移动的态势，不一定包含暴力，但常带有原始、不可控的意象。"
    },
    {
      "word_to_compare": "swarm",
      "analysis": "“Swarm”（蜂拥）多用于昆虫或动物群体（如蜜蜂、蝗虫），也可比喻人如虫群般密集移动，强调密集性和动态性，但较少用于描述人类社会的组织性或历史背景。而 “horde” 更常用于人类群体，且带有文化或历史语境（如游牧部落）。"
    }
  ]
}