{
  "word": "hormonal",
  "pronunciation": "hawr·moh·nuhl",
  "concise_definition": "adj. 激素的, 与激素有关的, 受激素影响的",
  "forms": {
    "comparative": "hormonal",
    "superlative": "hormonal"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to, produced by, or involving hormones — chemical messengers secreted by glands in the endocrine system that regulate bodily functions such as metabolism, growth, mood, and reproduction.",
      "explanation_cn": "与激素有关的、由激素产生的或受激素影响的；激素是由内分泌腺分泌的化学信使，用于调节新陈代谢、生长、情绪和生殖等生理功能。",
      "example_en": "Her mood swings are likely due to hormonal changes during her menstrual cycle.",
      "example_cn": "她的情绪波动很可能是因为月经周期中的激素变化所致。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by or caused by fluctuations in hormone levels, often used to describe physical or emotional symptoms in humans or animals.",
      "explanation_cn": "以激素水平波动为特征或由其引起的，常用于描述人类或动物的生理或情绪症状。",
      "example_en": "The dog's aggressive behavior may be hormonal, especially if it hasn't been neutered.",
      "example_cn": "这只狗的攻击性行为可能是激素引起的，尤其是如果它尚未绝育的话。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used in medical or scientific contexts to describe treatments, imbalances, or conditions that involve the endocrine system and its secretions.",
      "explanation_cn": "在医学或科学语境中，用于描述涉及内分泌系统及其分泌物的治疗、失衡或病症。",
      "example_en": "Hormonal therapy is often prescribed to manage symptoms of menopause.",
      "example_cn": "激素疗法常用于缓解更年期症状。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "endocrine",
      "analysis": "“Endocrine”（内分泌的）是解剖学或生理学术语，特指分泌激素的腺体系统本身（如甲状腺、肾上腺），强调结构和器官。“Hormonal”则更广泛地指由这些腺体分泌的激素所引发的作用或状态，侧重于功能和影响，而非解剖结构。"
    },
    {
      "word_to_compare": "chemical",
      "analysis": "“Chemical”（化学的）是一个更宽泛的术语，泛指任何由化学物质引起的现象，包括药物、毒素、营养素等。而 “hormonal” 是 “chemical” 的一个子集，特指由体内天然分泌的激素所引发的效应，具有高度特异性和生理调节性。"
    },
    {
      "word_to_compare": "physiological",
      "analysis": "“Physiological”（生理的）指任何与生物体正常功能相关的现象，涵盖神经、循环、消化等多个系统。而 “hormonal” 仅特指由激素介导的生理过程，是生理现象中的一种机制类型。所有激素作用都是生理的，但并非所有生理现象都是激素性的。"
    }
  ]
}