{
  "word": "horn",
  "pronunciation": "hawrn",
  "concise_definition": "n. 角, 喇叭, 喇叭声; v. 按喇叭",
  "forms": {
    "plural": "horns"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A hard, pointed growth on the heads of certain animals, such as cows, goats, or rhinoceroses, typically used for defense or dominance displays.",
      "explanation_cn": "某些动物（如牛、山羊或犀牛）头部生长的坚硬、尖锐的突起，通常用于防御或展示支配地位。",
      "example_en": "The bull lowered its head and charged with its horns raised.",
      "example_cn": "公牛低下头，高举犄角冲了过来。"
    },
    {
      "pos": "noun",
      "explanation_en": "A musical instrument that produces sound by blowing air through a tube, often made of metal, used in orchestras, bands, or as a vehicle warning device.",
      "explanation_cn": "一种通过吹气使空气在管中振动发声的乐器，通常由金属制成，用于管弦乐队、乐队中，或作为车辆的警示装置。",
      "example_en": "The car's horn blared loudly as the driver tried to warn the pedestrian.",
      "example_cn": "司机试图警告行人时，汽车喇叭响了起来。"
    },
    {
      "pos": "noun",
      "explanation_en": "The sound produced by such an instrument, especially when used as a warning signal.",
      "explanation_cn": "此类乐器发出的声音，尤指用作警示信号时的喇叭声。",
      "example_en": "We heard the horn of the train approaching in the distance.",
      "example_cn": "我们听到远处火车的汽笛声正逐渐逼近。"
    },
    {
      "pos": "verb",
      "explanation_en": "To sound a horn, especially to signal or attract attention, often in frustration or urgency.",
      "explanation_cn": "按响喇叭，尤指为发出信号、引起注意，常因沮丧或紧急情况而鸣笛。",
      "example_en": "The driver honked impatiently as the traffic remained stuck.",
      "example_cn": "交通堵塞时，司机不耐烦地按着喇叭。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "antler",
      "analysis": "“Antler”（鹿角）特指鹿科动物（如鹿、麋鹿）每年脱落并再生的分叉骨质结构，通常无角鞘，质地较轻且呈树枝状；而 “horn” 是由角蛋白构成的永久性结构，通常不分叉，且终生不脱落。两者在生物学结构和生长方式上完全不同。"
    },
    {
      "word_to_compare": "trumpet",
      "analysis": "“Trumpet”（小号）是一种特定类型的铜管乐器，音色明亮、结构精密，常用于古典和爵士乐；而 “horn” 在音乐语境中可泛指多种号类乐器（如法国号），也可指汽车喇叭，语义更广。在非专业语境中，“horn” 更常用于日常口语中的汽车喇叭，而 “trumpet” 几乎专指乐器。"
    },
    {
      "word_to_compare": "siren",
      "analysis": "“Siren”（警报器）是一种发出高音调、有节奏警示声的电子设备，常用于救护车、消防车或防空警报；而 “horn” 的声音通常是连续或短促的鸣响，音调较单一，多用于普通车辆或动物器官。Siren 更强调警戒功能和复杂声波模式，horn 则更基础、直接。"
    }
  ]
}