{
  "word": "horns",
  "pronunciation": "hawrns",
  "concise_definition": "n. 角, 喇叭, 独角兽角",
  "forms": {
    "singular": "horn"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A hard, pointed projection growing from the head of certain animals, such as cows, goats, or deer, typically made of keratin and used for defense or dominance displays.",
      "explanation_cn": "指某些动物（如牛、山羊或鹿）头部生长出的坚硬、尖锐的突起，通常由角蛋白构成，用于防御或展示支配地位。",
      "example_en": "The bull lowered its horns and charged at the matador.",
      "example_cn": "公牛低下角，向斗牛士冲去。"
    },
    {
      "pos": "noun",
      "explanation_en": "A musical instrument, typically made of metal, that produces sound by the player blowing into it and vibrating their lips, often used in orchestras and jazz bands.",
      "explanation_cn": "指一种通常由金属制成的乐器，演奏者通过吹气并振动嘴唇发声，常用于管弦乐队和爵士乐队中。",
      "example_en": "She played a haunting melody on the French horn during the concert.",
      "example_cn": "她在音乐会上用法国号吹奏了一段悠扬的旋律。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device on a vehicle that emits a loud sound to warn others, such as a car horn or train horn.",
      "explanation_cn": "指车辆上用于发出响亮声音以警示他人的装置，如汽车喇叭或火车汽笛。",
      "example_en": "The driver honked his horn to alert the pedestrian crossing the street.",
      "example_cn": "司机按响喇叭，提醒正在过马路的行人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A symbol or metaphor for something associated with betrayal, cuckoldry, or evil, often used in idioms or folklore (e.g., 'to wear horns' meaning to be cheated on by one's partner).",
      "explanation_cn": "指象征背叛、戴绿帽或邪恶的符号或隐喻，常用于习语或民间传说中（如 'to wear horns' 意为伴侣不忠）。",
      "example_en": "In medieval art, the devil was often depicted with horns to signify his malevolent nature.",
      "example_cn": "在中世纪艺术中，魔鬼常被描绘成长着角，以象征其邪恶本性。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "antlers",
      "analysis": "“Antlers”（鹿角）是鹿科动物（如鹿、麋鹿）每年脱落并再生的骨质分叉结构，而 “horns”（角）是永久性生长、不分叉、由角蛋白包裹骨核的结构，常见于牛科动物。两者在生物学结构和生长方式上完全不同。"
    },
    {
      "word_to_compare": "trumpet",
      "analysis": "“Trumpet”（小号）是一种具体的铜管乐器，形状直且喇叭口较大，而 “horn”（号角）泛指包括法国号、圆号在内的多种吹奏乐器，音色更圆润柔和。在日常语境中，'horn' 更口语化，'trumpet' 更具专业性。"
    },
    {
      "word_to_compare": "siren",
      "analysis": "“Siren”（警报器）是一种电子发声装置，用于紧急情况（如救护车、消防车），声音连续尖锐；而 “horn” 是通过气流振动发声的机械装置，声音较短促、响亮，常用于日常警示。两者功能相似，但技术原理和使用场景不同。"
    }
  ]
}