{
  "word": "hose",
  "pronunciation": "hohz",
  "concise_definition": "n. 软管, 水管; v. 用软管喷水",
  "forms": {
    "plural": "hoses",
    "third_person_singular": "hoses",
    "past_tense": "hosed",
    "past_participle": "hosed",
    "present_participle": "hosing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A flexible tube, typically made of rubber or plastic, used to convey water or other fluids from one place to another, especially for irrigation, firefighting, or cleaning.",
      "explanation_cn": "一种由橡胶或塑料制成的柔性管，用于将水或其他液体从一处输送到另一处，常用于灌溉、灭火或清洁。",
      "example_en": "He used a garden hose to water the lawn after sunset.",
      "example_cn": "他在日落后用花园水管给草坪浇水。"
    },
    {
      "pos": "noun",
      "explanation_en": "A long, tubular garment or covering, especially one worn on the legs (archaic or dialectal usage).",
      "explanation_cn": "一种长筒状的衣物或覆盖物，尤指穿在腿上的（古语或方言用法）。",
      "example_en": "In the 18th century, men often wore hose instead of modern trousers.",
      "example_cn": "在18世纪，男性常穿长筒袜而非现代长裤。"
    },
    {
      "pos": "verb",
      "explanation_en": "To spray or wash something with water or another liquid using a hose.",
      "explanation_cn": "使用软管用水或其他液体喷洒或冲洗某物。",
      "example_en": "The firefighters hosed down the burning building to prevent the fire from spreading.",
      "example_cn": "消防员用水管喷洒着火的大楼，以防止火势蔓延。"
    },
    {
      "pos": "verb",
      "explanation_en": "To forcibly remove or eject someone from a position or place, often in a harsh or abrupt manner (slang or figurative usage).",
      "explanation_cn": "以强硬或突然的方式将某人从职位或地点驱逐出去（俚语或比喻用法）。",
      "example_en": "The CEO was hosed out of the company after the scandal broke.",
      "example_cn": "丑闻曝光后，这位首席执行官被强行赶出了公司。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tube",
      "analysis": "“Tube”（管子）是一个更通用的词，指任何中空的圆柱形物体，可以是金属、塑料或纸制，不一定用于输送液体，也不一定柔韧。而 “hose” 特指柔韧、可弯曲、常用于输送流体的管子，具有明确的功能性用途。"
    },
    {
      "word_to_compare": "pipe",
      "analysis": "“Pipe”（管道）通常指刚性、固定安装的输送系统，如供水或天然气管道，多用于建筑或工业环境。而 “hose” 是可移动、可卷曲的，常用于临时或便携式用途，如浇水或洗车。"
    },
    {
      "word_to_compare": "spray",
      "analysis": "“Spray”（喷洒）是一个动作动词，指将液体以细雾状喷出，可以使用喷壶、喷雾器或软管实现。而 “hose” 作为动词时，特指使用软管进行喷洒，强调工具而非动作本身。因此，'hose' 是实现 'spray' 的一种方式。"
    }
  ]
}