{
  "word": "hound",
  "pronunciation": "haund",
  "concise_definition": "n. 猎犬, 追逐者; v. 追踪, 纠缠",
  "forms": {
    "plural": "hounds",
    "third_person_singular": "hounds",
    "past_tense": "hounded",
    "past_participle": "hounded",
    "present_participle": "hounding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A breed of dog specifically trained for hunting, especially by scent, known for its endurance, keen sense of smell, and persistent tracking ability.",
      "explanation_cn": "一种专门训练用于狩猎的犬种，尤其依靠嗅觉追踪猎物，以耐力强、嗅觉灵敏和执着追踪著称。",
      "example_en": "The pack of hounds chased the fox through the forest.",
      "example_cn": "一群猎犬在森林中追逐狐狸。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who persistently pursues or harasses someone, often in an annoying or relentless way, especially to obtain information or demand action.",
      "explanation_cn": "指坚持不懈地追踪、纠缠某人的人，常带有烦扰或逼迫的意味，尤指为获取信息或迫使对方采取行动。",
      "example_en": "The journalist was a hound for scandal, never giving up until she got the truth.",
      "example_cn": "这位记者是追逐丑闻的能手，不达目的誓不罢休。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pursue or harass someone persistently and relentlessly, often causing distress or pressure.",
      "explanation_cn": "指持续不断地追踪或纠缠某人，常造成困扰或施加压力。",
      "example_en": "The suspect was hounded by reporters for days after the arrest.",
      "example_cn": "这名嫌疑人被捕后连续数日被记者穷追不舍。"
    },
    {
      "pos": "verb",
      "explanation_en": "To chase or pursue an animal, especially with dogs, as in hunting.",
      "explanation_cn": "指用狗追逐动物，尤指在狩猎中。",
      "example_en": "They hounded the deer across the open field until it collapsed.",
      "example_cn": "他们驱赶着猎犬将鹿追过开阔的田野，直到它倒下。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "dog",
      "analysis": "“Dog” 是泛指所有犬类的通用词，中性且广泛，可指宠物、工作犬或野狗。而 “hound” 特指用于狩猎的犬种，带有功能性、专业性和历史语境，常隐含追踪、执着的意象。"
    },
    {
      "word_to_compare": "pursue",
      "analysis": "“Pursue” 是中性动词，泛指“追赶、追求”某人或某物，可为积极（追求梦想）或消极（追捕罪犯）。“Hound” 则带有强烈的负面情感色彩，强调骚扰、逼迫和不依不饶，常含贬义。"
    },
    {
      "word_to_compare": "harass",
      "analysis": "“Harass” 指反复的骚扰、烦扰，通常指言语或行为上的压迫，范围更广，可包括网络骚扰、职场骚扰等。“Hound” 更强调物理或心理上的持续追踪，常与“追逐”动作结合，更具画面感和动态性。"
    }
  ]
}