{
  "word": "housekeeping",
  "pronunciation": "hows·kee·ping",
  "concise_definition": "n. 家务管理, 清洁维护, 内务管理",
  "forms": {
    "plural": "housekeepings"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The routine tasks involved in maintaining a clean, orderly, and functional home or living environment, including cleaning, laundry, organizing, and general upkeep.",
      "explanation_cn": "指为保持家庭或居住环境整洁、有序和正常运作而进行的一系列日常事务，包括清洁、洗衣、整理和一般维护。",
      "example_en": "Good housekeeping is essential for a healthy and comfortable living space.",
      "example_cn": "良好的家务管理对于营造健康舒适的居住环境至关重要。"
    },
    {
      "pos": "noun",
      "explanation_en": "The administrative or operational management of a hotel, hospital, or other institution, particularly concerning cleanliness, maintenance, and supply logistics.",
      "explanation_cn": "指酒店、医院或其他机构中关于清洁、维护和物资供应的行政或运营管理。",
      "example_en": "The hotel's housekeeping department ensures that all rooms are serviced daily.",
      "example_cn": "酒店的客房服务部门确保所有房间每日都得到整理。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process of organizing and managing data, files, or systems to ensure efficiency, accuracy, and order, especially in computing or business contexts.",
      "explanation_cn": "指为确保效率、准确性和条理性而对数据、文件或系统进行整理和管理的过程，尤其在计算机或商业环境中。",
      "example_en": "Regular housekeeping of the database prevents errors and improves system performance.",
      "example_cn": "定期对数据库进行清理维护可防止错误并提升系统性能。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cleaning",
      "analysis": "“Cleaning”（清洁）仅指去除污垢和灰尘的物理行为，是“housekeeping”的一部分。而“housekeeping”涵盖更广，包括整理、维护、管理等系统性工作，不仅限于清洁。"
    },
    {
      "word_to_compare": "maintenance",
      "analysis": "“Maintenance”（维护）侧重于设备、设施或系统的修理与保养，以保持其功能正常。而“housekeeping”更强调日常的秩序、整洁和运行管理，尤其在生活或服务环境中，范围更广、更人性化。"
    },
    {
      "word_to_compare": "domestic work",
      "analysis": "“Domestic work”（家务劳动）是“housekeeping”的近义词，常用于社会学或劳动语境，强调个人或家庭成员承担的无偿劳动。而“housekeeping”更常用于机构或职业语境（如酒店），具有管理性和专业性含义。"
    }
  ]
}