{
  "word": "houses",
  "pronunciation": "haw·ziz",
  "concise_definition": "n. 房屋, 住宅, 建筑物; v. 为...提供住所",
  "forms": {
    "singular": "house",
    "third_person_singular": "houses",
    "past_tense": "housed",
    "past_participle": "housed",
    "present_participle": "housing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A building that serves as a residence for individuals or families, typically including rooms for living, sleeping, cooking, and bathing.",
      "explanation_cn": "指供个人或家庭居住的建筑物，通常包含用于生活、睡眠、烹饪和沐浴的房间。",
      "example_en": "They bought a cozy house near the lake with a large garden.",
      "example_cn": "他们在湖边买了一栋带大花园的舒适住宅。"
    },
    {
      "pos": "noun",
      "explanation_en": "A building or institution that functions as a center for a particular activity or organization, such as a legislative body or a publishing company.",
      "explanation_cn": "指作为特定活动或组织中心的建筑或机构，如立法机构或出版公司。",
      "example_en": "The House of Representatives passed the new bill yesterday.",
      "example_cn": "众议院昨天通过了这项新法案。"
    },
    {
      "pos": "noun",
      "explanation_en": "A royal or noble family, especially in historical or literary contexts, often referred to by the name of their ancestral seat.",
      "explanation_cn": "指王室或贵族家族，尤其在历史或文学语境中，常以其祖先的居所名称来称呼。",
      "example_en": "The House of Windsor has ruled Britain for over a century.",
      "example_cn": "温莎王朝已统治英国一个多世纪。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provide shelter or accommodation for people, animals, or objects.",
      "explanation_cn": "指为人员、动物或物品提供住所或安置空间。",
      "example_en": "The shelter houses over 200 stray cats each winter.",
      "example_cn": "这个收容所每年冬天为超过200只流浪猫提供住所。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "home",
      "analysis": "“Home”（家）强调情感归属和心理上的安顿感，是个人或家庭生活的核心，不一定是物理建筑；而 “house” 仅指物理结构，是可买卖、可建造的实体。一个人可以没有 house，但仍有 home。"
    },
    {
      "word_to_compare": "building",
      "analysis": "“Building”（建筑物）是更广泛的术语，泛指任何有屋顶和墙壁的结构，用途多样（如学校、商场、办公楼），而 “house” 特指用于居住的建筑物，功能单一且具有家庭属性。"
    },
    {
      "word_to_compare": "residence",
      "analysis": "“Residence”（住所）是正式用语，常用于法律、官方文件中，指一个人合法居住的地方，语气中性且抽象；而 “house” 更口语化、具体，常带有生活气息和视觉形象。"
    }
  ]
}