{
  "word": "house",
  "pronunciation": "hows",
  "concise_definition": "n. 房子, 家, 住宅; v. 容纳, 收容",
  "forms": {
    "plural": "houses"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A building that serves as a home or residence for individuals or families, typically including rooms for living, sleeping, cooking, and bathing.",
      "explanation_cn": "指供个人或家庭居住的建筑物，通常包括起居、睡眠、烹饪和沐浴等功能房间。",
      "example_en": "They bought a cozy house near the lake with a large garden.",
      "example_cn": "他们在湖边买了一栋带大花园的舒适房子。"
    },
    {
      "pos": "noun",
      "explanation_en": "A family or lineage regarded as a social or political unit, especially in historical or aristocratic contexts (e.g., the House of Windsor).",
      "explanation_cn": "指在历史或贵族语境中被视为社会或政治单位的家族或世系（如温莎王朝）。",
      "example_en": "The House of Tudor ruled England for over a century.",
      "example_cn": "都铎王朝统治英格兰长达一个多世纪。"
    },
    {
      "pos": "noun",
      "explanation_en": "A legislative body or chamber, especially in a parliamentary system (e.g., the House of Commons or the House of Representatives).",
      "explanation_cn": "指议会制度中的立法机构或议院，例如英国下议院或美国众议院。",
      "example_en": "The bill was passed by a majority vote in the House.",
      "example_cn": "该法案在众议院以多数票通过。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provide shelter or accommodation for someone or something; to contain or hold within a structure.",
      "explanation_cn": "指为某人或某物提供住所或容纳空间；在建筑物内收容或存放。",
      "example_en": "The new museum will house over 5,000 ancient artifacts.",
      "example_cn": "这座新博物馆将收藏五千多件古代文物。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "home",
      "analysis": "“Home”（家）强调情感归属和心理上的安顿感，是人与家庭、记忆和情感联系的象征，不一定是物理建筑；而 “house” 仅指物理结构，是可买卖、可建造的实体建筑。例如：I love my home, but I’m selling my house.（我爱我的家，但我要卖掉我的房子。）"
    },
    {
      "word_to_compare": "dwelling",
      "analysis": "“Dwelling”（住所）是更正式、更中性的术语，泛指任何用于居住的建筑或空间，包括公寓、小屋、帐篷等，常用于法律或学术语境；而 “house” 通常特指独立式住宅，带有更具体的文化和建筑含义。"
    },
    {
      "word_to_compare": "residence",
      "analysis": "“Residence”（住所/居所）强调法律或官方意义上的居住地，常用于正式文件或描述某人的常住地址，语气较正式；而 “house” 更口语化，侧重于建筑本身，不强调法律身份。例如：His official residence is in Washington, but he lives in a small house in the countryside.（他的官方居所在华盛顿，但他住在乡下的一栋小房子里。）"
    }
  ]
}