{
  "word": "hudson",
  "pronunciation": "huhd·suhn",
  "concise_definition": "n. 哈德逊（姓氏/地名）",
  "forms": {
    "plural": "Hudsons"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to Henry Hudson, an English explorer known for his voyages in the early 17th century, during which he explored parts of North America, including the river and bay that now bear his name.",
      "explanation_cn": "专有名词，指英国探险家亨利·哈德逊，他在17世纪初进行多次航行，探索了北美洲部分地区，包括如今以他命名的哈德逊河与哈德逊湾。",
      "example_en": "Henry Hudson sailed up the river that now bears his name, the Hudson River.",
      "example_cn": "亨利·哈德逊曾沿如今以他命名的哈德逊河逆流而上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A geographical name used for several places in the United States, most notably the Hudson River in New York and the Hudson Bay in Canada.",
      "explanation_cn": "用于美国和加拿大多个地名的专有名词，最著名的是纽约州的哈德逊河和加拿大的哈德逊湾。",
      "example_en": "The Hudson River flows from the Adirondack Mountains to the Atlantic Ocean.",
      "example_cn": "哈德逊河发源于阿迪朗达克山脉，最终注入大西洋。"
    },
    {
      "pos": "noun",
      "explanation_en": "A surname of English origin, borne by various notable individuals, including actors, athletes, and scientists.",
      "explanation_cn": "一个源自英语的姓氏，被多位知名人士使用，包括演员、运动员和科学家。",
      "example_en": "The actress Kate Hudson is the daughter of actor Goldie Hawn.",
      "example_cn": "女演员凯特·哈德逊是演员戈尔迪·霍恩的女儿。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "river",
      "analysis": "“River”（河流）是一个普通名词，泛指任何自然水流通道；而 “Hudson” 是专有名词，特指某一条具体的河流。虽然 “Hudson River” 中的 “Hudson” 修饰 “river”，但单独使用时 “Hudson” 不表示河流本身，而是指代命名来源或地名。"
    },
    {
      "word_to_compare": "bay",
      "analysis": "“Bay”（海湾）是地理学中的通用术语，指海洋或湖泊向陆地凹入的部分；而 “Hudson Bay” 是一个特定地理实体的名称，其中 “Hudson” 是命名者姓氏，不具备通用含义。单独使用 “Hudson” 时，它不等同于 “bay”，而是指代人名或地名。"
    },
    {
      "word_to_compare": "name",
      "analysis": "“Name”（名字）是泛指任何称呼或标识；而 “Hudson” 是一个具体的、历史传承下来的专有名称，承载着地理、历史和文化意义。它不是抽象的“名字”概念，而是具有明确指涉对象的实体名称。"
    }
  ]
}