{
  "word": "hull",
  "pronunciation": "hul",
  "concise_definition": "n. 船体, 果壳, 粮食外壳; v. 去壳, 剥皮",
  "forms": {
    "plural": "hulls"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The main body of a ship or boat, excluding its masts, sails, and superstructures; the watertight structure that provides buoyancy and supports the vessel's load.",
      "explanation_cn": "指船舶的主体结构，不包括桅杆、帆和上层建筑；提供浮力并承载船舶负载的水密结构。",
      "example_en": "The hull of the ancient ship was remarkably well-preserved after centuries underwater.",
      "example_cn": "这艘古船的船体在水下数百年后仍保存得异常完好。"
    },
    {
      "pos": "noun",
      "explanation_en": "The outer covering or shell of a seed, nut, or fruit, which is often removed before consumption or processing.",
      "explanation_cn": "指种子、坚果或水果的外层外壳，通常在食用或加工前被去除。",
      "example_en": "She cracked open the walnut to remove the hull and eat the kernel inside.",
      "example_cn": "她敲开核桃，去掉外壳，吃掉了里面的果仁。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove the outer shell or husk from a seed, grain, or fruit, especially for preparation or processing.",
      "explanation_cn": "指去除种子、谷物或水果的外层外壳，通常为准备或加工之用。",
      "example_en": "Farmers hull the strawberries before packaging them for sale.",
      "example_cn": "农民在包装草莓出售前会去掉它们的果蒂和外皮。"
    },
    {
      "pos": "verb",
      "explanation_en": "To damage or pierce the hull of a ship, typically by collision or gunfire, causing it to take on water.",
      "explanation_cn": "指通过碰撞或炮火击穿船体，导致其进水。",
      "example_en": "The torpedo struck the enemy vessel and hull it below the waterline.",
      "example_cn": "鱼雷击中了敌舰，在水线以下击穿了其船体。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "shell",
      "analysis": "“Shell”（外壳）是一个更通用的词，可指任何生物或物体的坚硬外层，如蛋壳、贝壳或核弹外壳。而 “hull” 专用于植物种子、谷物或船舶的主体结构，语义范围更窄、更具体。"
    },
    {
      "word_to_compare": "carcass",
      "analysis": "“Carcass”（尸体、骨架）通常指动物死亡后的躯体，强调生物组织的残骸，常用于肉类加工或生物学语境。而 “hull” 仅指无生命结构的外壳或船体，不包含内部组织，语义上更中性、更技术化。"
    },
    {
      "word_to_compare": "frame",
      "analysis": "“Frame”（框架）指支撑结构的骨架，如建筑框架或自行车车架，强调承重和支撑功能。而 “hull” 是一个封闭的、水密的外壳，不仅提供结构支撑，还承担防水和浮力功能，尤其在船舶语境中不可互换。"
    }
  ]
}