{
  "word": "hum",
  "pronunciation": "huhm",
  "concise_definition": "n. 嗡嗡声, 嗡鸣声; v. 嗡嗡作响, 嗡鸣",
  "forms": {
    "third_person_singular": "hums",
    "past_tense": "hummed",
    "past_participle": "hummed",
    "present_participle": "humming"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A low, continuous, steady sound, typically produced by machinery, electricity, or vibrating objects, often perceived as soothing or background noise.",
      "explanation_cn": "一种低沉、持续、稳定的声响，通常由机械、电力或振动物体产生，常被视为一种舒缓或背景性的噪音。",
      "example_en": "The hum of the refrigerator filled the quiet kitchen.",
      "example_cn": "冰箱的嗡嗡声充满了安静的厨房。"
    },
    {
      "pos": "noun",
      "explanation_en": "A low, continuous vocal sound made without forming words, often to express contentment, concentration, or to soothe oneself or others.",
      "explanation_cn": "一种不形成词语的低沉持续哼唱声，常用于表达满足感、专注，或自我安抚、安抚他人。",
      "example_en": "She sat by the window, humming a tune she learned as a child.",
      "example_cn": "她坐在窗边，哼着儿时学会的曲调。"
    },
    {
      "pos": "verb",
      "explanation_en": "To produce a low, continuous, resonant sound, especially from a machine, electrical device, or vibrating object.",
      "explanation_cn": "发出低沉、持续、共鸣的声响，尤指由机器、电器或振动物体发出。",
      "example_en": "The wires hummed with electricity as the storm approached.",
      "example_cn": "暴风雨来临前，电线因电流而嗡嗡作响。"
    },
    {
      "pos": "verb",
      "explanation_en": "To sing or make a low, continuous sound with the voice, typically without words.",
      "explanation_cn": "用声音低沉、持续地哼唱，通常不形成词语。",
      "example_en": "He hummed softly as he walked through the forest, lost in thought.",
      "example_cn": "他漫步穿过森林时轻声哼着，沉浸在思绪中。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "buzz",
      "analysis": "“Buzz” (嗡嗡声) 通常指高频、急促、略带刺耳的嗡鸣声，常与昆虫（如蜜蜂）或电子设备的干扰声相关，带有轻微的不悦感。而 “hum” 更低沉、平稳，常带有宁静或机械运转的中性甚至舒适感。"
    },
    {
      "word_to_compare": "murmur",
      "analysis": "“Murmur” (低语/细语) 指轻柔、断续、模糊的声音，常用于描述人低声说话或流水声，强调语义模糊和私密性。而 “hum” 是持续的、无词义的声波，不具语言性，更偏向物理性振动。"
    },
    {
      "word_to_compare": "drone",
      "analysis": "“Drone” (单调的嗡嗡声) 与 “hum” 非常相似，都表示持续低音，但 “drone” 更强调单调、乏味、令人厌烦的特性，常用于描述引擎或背景噪音的压迫感。而 “hum” 可以是中性甚至令人安心的，如冰箱的嗡鸣。"
    }
  ]
}