{
  "word": "humboldt",
  "pronunciation": "hoom·bohlht",
  "concise_definition": "n. 亨伯特（人名）；洪堡（地名/术语）",
  "forms": {
    "plural": "humboldts"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to Alexander von Humboldt (1769–1859), a renowned German naturalist, explorer, and geographer whose work laid the foundation for modern environmental science and biogeography.",
      "explanation_cn": "专有名词，指亚历山大·冯·洪堡（1769–1859），著名的德国自然学家、探险家和地理学家，其研究为现代环境科学和生物地理学奠定了基础。",
      "example_en": "Humboldt's travels across South America inspired generations of scientists to study the interconnectedness of nature.",
      "example_cn": "洪堡在南美洲的探险之旅激励了数代科学家研究自然界的相互联系。"
    },
    {
      "pos": "noun",
      "explanation_en": "A geographical or institutional name derived from Alexander von Humboldt, such as the Humboldt Current, Humboldt County, or Humboldt University, honoring his scientific legacy.",
      "explanation_cn": "以亚历山大·冯·洪堡命名的地理或机构名称，如洪堡寒流、洪堡县或洪堡大学，以纪念其科学遗产。",
      "example_en": "The Humboldt Current brings cold, nutrient-rich water up the west coast of South America, supporting one of the world’s most productive fisheries.",
      "example_cn": "洪堡寒流将寒冷而富含营养的海水沿南美洲西海岸上涌，支撑着世界上生产力最高的渔场之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A surname or given name used in various cultures, often chosen to honor the legacy of Alexander von Humboldt.",
      "explanation_cn": "在不同文化中用作姓氏或名字，通常是为了纪念亚历山大·冯·洪堡的贡献。",
      "example_en": "Dr. Humboldt presented her groundbreaking research on climate patterns at the international symposium.",
      "example_cn": "洪堡博士在国际研讨会上展示了她关于气候模式的开创性研究。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "darwin",
      "analysis": "“Darwin”（达尔文）通常指查尔斯·达尔文，进化论的奠基人，其影响主要集中在生物演化与自然选择；而 “Humboldt” 更侧重于生态系统的整体性、地理分布与环境相互作用，是现代生态学的先驱。两者常并列提及，但研究维度不同。"
    },
    {
      "word_to_compare": "linnaeus",
      "analysis": "“Linnaeus”（林奈）以生物分类系统闻名，强调命名与层级结构；而 “Humboldt” 的贡献在于跨学科的实地观察与自然整体观，他更关注动态关系而非静态分类。林奈是‘命名者’，洪堡是‘连接者’。"
    },
    {
      "word_to_compare": "gauss",
      "analysis": "“Gauss”（高斯）是数学与物理学巨匠，以抽象理论和公式著称；而 “Humboldt” 是经验主义的自然观察者，强调实地考察与数据收集。高斯塑造了数学语言，洪堡塑造了我们对自然世界的整体理解。"
    }
  ]
}