{
  "word": "humming",
  "pronunciation": "huhm·ing",
  "concise_definition": "n. 嗡嗡声, 哼唱; v. 嗡嗡作响, 哼唱",
  "forms": {
    "base_form": "hum",
    "third_person_singular": "hums",
    "past_tense": "hummed",
    "past_participle": "hummed",
    "present_participle": "humming"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To produce a continuous low sound, typically with the lips closed, as bees or machines do, or as a person does when singing softly without words.",
      "explanation_cn": "指以闭合的嘴唇发出持续的低沉声音，如蜜蜂或机器发出的声音，或人轻声哼唱而不开口唱歌。",
      "example_en": "The bees were humming lazily among the flowers.",
      "example_cn": "蜜蜂在花丛中慵懒地嗡嗡作响。"
    },
    {
      "pos": "verb",
      "explanation_en": "To sing or make a musical sound softly and continuously, often unconsciously, without using words.",
      "explanation_cn": "指轻柔而持续地哼唱旋律，通常无意识地，不使用歌词。",
      "example_en": "She was humming a tune while washing the dishes.",
      "example_cn": "她一边洗碗，一边轻声哼着曲子。"
    },
    {
      "pos": "noun",
      "explanation_en": "A continuous low, steady sound, especially one produced by machinery, insects, or electrical devices.",
      "explanation_cn": "指持续而稳定的低沉声音，尤指由机械、昆虫或电子设备发出的声音。",
      "example_en": "The humming of the refrigerator kept her awake at night.",
      "example_cn": "冰箱的嗡嗡声让她夜里睡不着。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or sound of humming, especially when done as a form of expression or distraction.",
      "explanation_cn": "指哼唱的行为或声音，尤其当其作为一种表达方式或分散注意力的举动时。",
      "example_en": "His humming during the meeting was annoying to everyone around him.",
      "example_cn": "他在会议中哼唱，让周围的人都感到烦躁。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "buzzing",
      "analysis": "“Buzzing” (嗡嗡声) 通常指高频、尖锐、断续的嗡鸣声，多用于描述昆虫（如蜜蜂、苍蝇）或电子设备（如荧光灯）发出的声音，带有轻微刺耳感。而 “humming” 更低沉、平稳、持续，常用于描述机器运转或人哼唱时的柔和声音。"
    },
    {
      "word_to_compare": "murmuring",
      "analysis": "“Murmuring” (低语/细语) 指人低声说话或发出模糊不清的声响，通常带有语言内容，如人群的窃窃私语。而 “humming” 不涉及语言，纯粹是无词的音调或机械声，更偏向于音乐性或物理性发声。"
    },
    {
      "word_to_compare": "whistling",
      "analysis": "“Whistling” (吹口哨) 是通过嘴唇或手指制造气流而发出的清晰、高音调的旋律性声音，通常有明确的音高和节奏。而 “humming” 是通过喉咙和鼻腔共鸣发出的柔和、连续的音，音调较模糊，常用于无意识地表达情绪，而非刻意演奏旋律。"
    }
  ]
}