{
  "word": "hump",
  "pronunciation": "huhmp",
  "concise_definition": "n. 驼峰, 凸起物; v. 驼背, 跳跃, 性行为",
  "forms": {
    "third_person_singular": "humps",
    "past_tense": "humped",
    "past_participle": "humped",
    "present_participle": "humping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A raised area or protuberance on a surface, especially the rounded back of a camel or a person's back when bent forward.",
      "explanation_cn": "指表面上隆起的部分，尤指骆驼的背部或人前倾时弯曲的背部。",
      "example_en": "The camel walked slowly across the desert, its hump swaying with each step.",
      "example_cn": "骆驼缓慢地穿越沙漠，它的驼峰随着每一步轻轻晃动。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small mound or ridge, especially one that is difficult to climb or that interrupts a smooth surface.",
      "explanation_cn": "指一个小土丘或隆起，尤指难以攀爬或破坏表面平滑性的凸起部分。",
      "example_en": "The road had a steep hump that made drivers slow down suddenly.",
      "example_cn": "这条路有一个陡峭的减速带，迫使司机突然减速。"
    },
    {
      "pos": "verb",
      "explanation_en": "To bend or arch the back, especially in a way that creates a hump or makes one appear stooped.",
      "explanation_cn": "指弯曲或拱起背部，尤其是使背部形成驼峰状或显得驼背。",
      "example_en": "She humped her shoulders as she walked into the cold wind.",
      "example_cn": "她迎着寒风走路时，耸起了肩膀。"
    },
    {
      "pos": "verb",
      "explanation_en": "To jump or leap with a sudden, forceful motion, often used in informal contexts to describe a quick movement.",
      "explanation_cn": "指以突然、有力的动作跳跃，常用于非正式语境中描述快速移动。",
      "example_en": "The dog humped over the fence and landed in the yard.",
      "example_cn": "狗一跃跳过篱笆，落在了院子里。"
    },
    {
      "pos": "verb",
      "explanation_en": "To engage in sexual intercourse, used as a vulgar or slang term.",
      "explanation_cn": "指进行性交，为粗俗或俚语用法。",
      "example_en": "They were caught humping in the back seat of the car.",
      "example_cn": "他们被发现坐在车后座上发生性行为。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bump",
      "analysis": "“Bump”（凸起/撞击）通常指小而突兀的隆起或碰撞，多用于描述意外的触碰或表面的小缺陷，如“车上的一个凹痕”或“头撞到门框”。而 “hump” 更强调自然或结构上的持续性隆起，如驼峰或道路减速带，具有更明显的形状和功能。"
    },
    {
      "word_to_compare": "knoll",
      "analysis": "“Knoll”（小山丘）是地理学中指自然形成的小型圆顶状高地，通常用于描述地貌，语义更正式、更中性。而 “hump” 更口语化，可指任何形状的隆起，包括人工的（如减速带）或身体的（如驼背），适用范围更广。"
    },
    {
      "word_to_compare": "copulate",
      "analysis": "“Copulate”（交配）是生物学或学术语境中用于描述动物性行为的正式术语，语气客观、科学。而 “hump” 作为其俚语替代词，带有粗俗、戏谑或贬义色彩，常用于非正式或幽默语境，语义强度和情感色彩截然不同。"
    }
  ]
}