{
  "word": "hunt",
  "pronunciation": "huhnt",
  "concise_definition": "v. 狩猎, 追寻, 搜寻; n. 狩猎, 追寻",
  "forms": {
    "third_person_singular": "hunts",
    "past_tense": "hunted",
    "past_participle": "hunted",
    "present_participle": "hunting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To pursue and attempt to kill wild animals for food, sport, or trade, typically using weapons, dogs, or traps.",
      "explanation_cn": "指为了获取食物、娱乐或贸易而追踪并试图猎杀野生动物，通常使用武器、猎犬或陷阱。",
      "example_en": "They went hunting in the forest for deer and boar.",
      "example_cn": "他们去森林里猎鹿和野猪。"
    },
    {
      "pos": "verb",
      "explanation_en": "To search for something persistently and diligently, often with great effort or urgency.",
      "explanation_cn": "指坚持不懈、认真地搜寻某物，常带有极大的努力或紧迫感。",
      "example_en": "She spent hours hunting for her lost wedding ring.",
      "example_cn": "她花了好几个小时寻找她丢失的婚戒。"
    },
    {
      "pos": "noun",
      "explanation_en": "An activity of pursuing and killing wild animals, often as a traditional or recreational pastime.",
      "explanation_cn": "指追踪并猎杀野生动物的活动，常作为一种传统或休闲消遣。",
      "example_en": "The annual fox hunt attracted dozens of riders and hounds.",
      "example_cn": "每年的狐狸狩猎吸引了数十名骑手和猎犬。"
    },
    {
      "pos": "noun",
      "explanation_en": "A persistent and determined search for something, often used in phrases like 'a hunt for answers' or 'a hunt for talent'.",
      "explanation_cn": "指对某物坚持不懈的搜寻，常用于如‘寻找答案’或‘搜寻人才’等短语中。",
      "example_en": "The company is on a hunt for the best software engineers in the region.",
      "example_cn": "这家公司正在积极寻找该地区最优秀的软件工程师。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "chase",
      "analysis": "“Chase” (追逐) 更强调快速、持续地在后面追赶，常用于人、车辆或抽象目标（如机会、梦想），不一定涉及捕杀或最终获取。而 “hunt” 更具目的性，常包含计划、耐心和最终捕获或获取的意图，尤其在猎杀动物或寻找稀缺物时更正式。"
    },
    {
      "word_to_compare": "search",
      "analysis": "“Search” (搜索) 是一个中性、广泛使用的词，指系统性地寻找某物，可适用于任何场景（如搜索文件、房间、信息），不带有情感色彩或暴力意味。而 “hunt” 暗示更强烈的动机、紧迫感甚至侵略性，常用于比喻中增强语义张力。"
    },
    {
      "word_to_compare": "track",
      "analysis": "“Track” (追踪) 强调根据线索、痕迹或路径持续跟进，常用于野生动物、罪犯或数据流等场景。它更侧重于‘跟随踪迹’的过程，而 “hunt” 包含追踪，但更完整地涵盖从追踪到捕获的全过程，语义范围更广。"
    }
  ]
}