{
  "word": "hunted",
  "pronunciation": "hun·tid",
  "concise_definition": "v. 追捕, 猎杀, 搜寻; (过去式和过去分词) 由 hunt 变化而来",
  "forms": {
    "base_form": "hunt",
    "third_person_singular": "hunts",
    "present_participle": "hunting",
    "past_tense": "hunted",
    "past_participle": "hunted"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To pursue and attempt to kill wild animals for food, sport, or trade, often using dogs, firearms, or traps.",
      "explanation_cn": "指为了获取食物、娱乐或贸易而追捕并试图杀死野生动物，通常使用狗、枪支或陷阱。",
      "example_en": "The wolves were hunted extensively in the 19th century, nearly driving them to extinction.",
      "example_cn": "19世纪时，狼被大量猎杀，几乎濒临灭绝。"
    },
    {
      "pos": "verb",
      "explanation_en": "To search for someone or something persistently and often aggressively, especially with the intent to catch, expose, or punish.",
      "explanation_cn": "指坚持不懈甚至带有攻击性地搜寻某人或某物，通常意图是抓捕、揭露或惩罚。",
      "example_en": "The journalist was hunted by paparazzi for days after the scandal broke.",
      "example_cn": "丑闻曝光后，这位记者连续数日被狗仔队穷追不舍。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be persistently pursued or harassed, often in a threatening or oppressive manner; used in passive constructions to describe being targeted.",
      "explanation_cn": "指被持续追捕或骚扰，常带有威胁或压迫性质；多用于被动语态，表示被针对。",
      "example_en": "After the leak, she felt hunted by the media and couldn't leave her house.",
      "example_cn": "泄露事件发生后，她感到被媒体围追堵截，不敢出门。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pursue",
      "analysis": "“Pursue” (追捕/追求) 是一个更广泛的词，可指追逐人、动物、目标或理想，不一定带有暴力或致命意图。它可以是中性或积极的（如追求梦想），而 “hunted” 通常隐含敌意、压迫或致命性，多用于被动语态，强调受害者的无助感。"
    },
    {
      "word_to_compare": "chase",
      "analysis": "“Chase” (追赶) 通常指短暂、快速的追逐，常用于游戏、运动或逃亡场景，语气较轻，不一定有伤害意图。而 “hunted” 暗示更持久、系统性、有预谋的追捕，常与死亡、威胁或社会性迫害相关。"
    },
    {
      "word_to_compare": "track",
      "analysis": "“Track” (追踪) 强调通过线索、痕迹或证据进行持续观察和定位，常用于侦查、科研或搜救，是技术性、非暴力的行为。而 “hunted” 更强调主动攻击和终结目标，带有强烈的主观恶意或生存竞争色彩。"
    }
  ]
}