{
  "word": "hunter",
  "pronunciation": "hun·tər",
  "concise_definition": "n. 猎人, 搜寻者, 追捕者",
  "forms": {
    "plural": "hunters"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who hunts animals for food, sport, or trade, typically using weapons or traps, and often operating in natural environments such as forests or wilderness.",
      "explanation_cn": "指为了获取食物、娱乐或贸易而猎杀动物的人，通常使用武器或陷阱，并在森林或荒野等自然环境中活动。",
      "example_en": "The hunter tracked the deer through the snowy forest for hours.",
      "example_cn": "猎人花了数小时在雪地森林中追踪那只鹿。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or entity that actively searches for or pursues something specific, such as a job, opportunity, or target, often with determination and persistence.",
      "explanation_cn": "指积极搜寻或追逐特定目标（如工作、机会或对象）的人或实体，通常表现出坚定和持久的意志。",
      "example_en": "She's a hunter of rare books, traveling across continents to find first editions.",
      "example_cn": "她是一位稀有书籍的搜寻者，为寻找初版书走遍各大洲。"
    },
    {
      "pos": "noun",
      "explanation_en": "In computing or cybersecurity, a person who identifies and exploits vulnerabilities in systems, often for defensive or offensive purposes.",
      "explanation_cn": "在计算机或网络安全领域，指识别并利用系统漏洞的人，通常用于防御或攻击目的。",
      "example_en": "The cybersecurity team hired a skilled hunter to find hidden backdoors in the network.",
      "example_cn": "网络安全团队聘请了一名技术娴熟的猎手来查找网络中的隐藏后门。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "trapper",
      "analysis": "“Trapper”（捕兽者）特指使用陷阱捕捉动物的人，强调工具和方法的特定性，常用于皮毛贸易。而 “hunter” 范围更广，可包括使用枪械、弓箭、猎犬等多种方式，且不一定以获取皮毛为目的，也可能为狩猎运动或生存。"
    },
    {
      "word_to_compare": "pursuer",
      "analysis": "“Pursuer”（追捕者）更侧重于持续追踪或紧追某人或某物，常用于法律、情感或抽象语境（如追债者、追求者），不必然包含“猎杀”或“获取”的意图。而 “hunter” 常隐含主动出击、目标明确、意图捕获或消灭的行动特征。"
    },
    {
      "word_to_compare": "forager",
      "analysis": "“Forager”（采集者）指寻找并收集野生食物或资源的人，如采摘浆果、蘑菇，通常不涉及杀死动物，强调被动获取而非主动猎杀。“Hunter” 则明确包含主动猎杀行为，具有更强的攻击性和目的性。"
    }
  ]
}