{
  "word": "hustle",
  "pronunciation": "huh·stl",
  "concise_definition": "v. 推销, 急忙行动, 拥挤; n. 忙乱, 拼命干, 骗局",
  "forms": {
    "third_person_singular": "hustles",
    "past_tense": "hustled",
    "past_participle": "hustled",
    "present_participle": "hustling"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To push or move someone or something forcefully, often in a crowded or hurried situation.",
      "explanation_cn": "在拥挤或匆忙的情况下，用力推挤或推动某人或某物。",
      "example_en": "The crowd hustled through the subway turnstiles during rush hour.",
      "example_cn": "高峰时段，人群匆忙挤过地铁闸机。"
    },
    {
      "pos": "verb",
      "explanation_en": "To actively and energetically promote or sell something, often with persistence or aggressive charm.",
      "explanation_cn": "以积极、充满活力的方式推销或售卖某物，通常带有坚持不懈或富有魅力的强势风格。",
      "example_en": "She hustled her handmade jewelry at local craft fairs and built a loyal customer base.",
      "example_cn": "她在本地手工艺市集上积极推销自己的手工首饰，建立了一群忠实客户。"
    },
    {
      "pos": "verb",
      "explanation_en": "To work hard and persistently, especially to earn money or achieve success through determined effort, often in informal or unconventional ways.",
      "explanation_cn": "勤奋努力地工作，尤其是通过坚定的努力来赚钱或取得成功，常指非正式或非传统的方式。",
      "example_en": "He hustled odd jobs all summer to save up for college.",
      "example_cn": "他整个夏天打零工，为上大学攒钱。"
    },
    {
      "pos": "verb",
      "explanation_en": "To deceive or swindle someone, typically for financial gain.",
      "explanation_cn": "通过欺骗手段获取他人财物，通常是为了经济利益。",
      "example_en": "The con artist hustled elderly people out of their savings with fake investment schemes.",
      "example_cn": "这个骗子用虚假的投资计划骗走了老年人的积蓄。"
    },
    {
      "pos": "noun",
      "explanation_en": "A state of energetic, often chaotic activity or movement, especially in a busy environment.",
      "explanation_cn": "一种充满活力、常常混乱的活动或移动状态，尤其出现在繁忙的环境中。",
      "example_en": "The hustle of the city never stops—even at midnight, there’s still traffic and noise.",
      "example_cn": "城市的喧嚣从不停歇——即使午夜，依然有车流和噪音。"
    },
    {
      "pos": "noun",
      "explanation_en": "A scheme or trick designed to deceive people for profit; a swindle.",
      "explanation_cn": "为牟利而设计的欺骗性计划或骗局。",
      "example_en": "He got caught in a classic hustle: paying for a fake lottery ticket that was never drawn.",
      "example_cn": "他陷入了一个经典骗局：为一张根本不会开奖的彩票付款。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rush",
      "analysis": "“Rush” (匆忙) 强调速度和紧迫感，通常指因时间压力而快速行动，但不一定包含努力或策略性。而 “hustle” 不仅包含速度，还隐含了主动、积极甚至狡猾的动机，尤其在推销或赚钱语境中。"
    },
    {
      "word_to_compare": "sell",
      "analysis": "“Sell” (销售) 是中性词，指将商品或服务提供给买家，不带情感色彩。而 “hustle” 在销售语境中带有强烈的主动性、说服力甚至操纵性，常暗示不择手段或过度推销。"
    },
    {
      "word_to_compare": "grind",
      "analysis": "“Grind” (苦干) 指长期、重复、枯燥的辛勤工作，强调耐力和坚持，常带负面情绪（如疲惫）。而 “hustle” 更强调短期、灵活、有策略的拼搏，常带有积极或励志色彩，尤其在创业文化中。"
    },
    {
      "word_to_compare": "swindle",
      "analysis": "“Swindle” (诈骗) 是纯粹的欺诈行为，专指非法获取财物，语义更窄、更负面。而 “hustle” 作为名词时虽可指骗局，但作为动词时含义更广，可包含合法的积极推销或努力，语义更丰富、语境更灵活。"
    }
  ]
}