{
  "word": "hysterical",
  "pronunciation": "hih·stuh·rik·l",
  "concise_definition": "adj. 疯狂的, 喜极而泣的, 情绪失控的",
  "forms": {
    "comparative": "hysterical",
    "superlative": "hysterical"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Overcome by uncontrollable emotion, especially laughter or fear, to the point of losing rational control; often used to describe exaggerated or irrational behavior.",
      "explanation_cn": "被无法控制的情绪（尤其是大笑或恐惧）所淹没，达到失去理性控制的程度；常用于形容夸张或非理性的行为。",
      "example_en": "She was hysterical with laughter after hearing the joke.",
      "example_cn": "听到这个笑话后，她笑得歇斯底里。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by excessive or irrational emotion, often in a way that is seen as dramatic or uncontrolled; can carry a negative or dismissive connotation.",
      "explanation_cn": "以过度或非理性的感情为特征，常表现为戏剧化或失控的状态；有时带有贬义或轻蔑的意味。",
      "example_en": "His hysterical reaction to the minor delay ruined the whole meeting.",
      "example_cn": "他对轻微延误的歇斯底里反应毁掉了整个会议。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Historically used to describe a supposed medical condition in women, characterized by emotional outbursts and physical symptoms, now considered outdated and sexist.",
      "explanation_cn": "历史上曾用于描述一种被认为仅存在于女性身上的医学状况，表现为情绪爆发和身体症状，如今已被视为过时且带有性别歧视色彩。",
      "example_en": "In the 19th century, women were often diagnosed as 'hysterical' for expressing normal emotions.",
      "example_cn": "在19世纪，女性因表达正常情绪而常被诊断为‘歇斯底里’。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "laughing",
      "analysis": "“Laughing”（大笑）仅描述一种行为或状态，是中性或积极的生理反应，不包含情绪失控或非理性的含义。而 “hysterical” 强调笑得失去控制，带有夸张、甚至病态的意味，常隐含情绪过载。"
    },
    {
      "word_to_compare": "manic",
      "analysis": "“Manic”（狂躁的）通常用于描述一种临床心理状态，如双相情感障碍中的躁狂发作，具有医学背景，强调能量亢奋、思维奔逸和冲动行为。而 “hysterical” 更偏向日常语言，描述情绪爆发，不一定有病理基础，且常用于形容笑声或恐惧反应。"
    },
    {
      "word_to_compare": "emotional",
      "analysis": "“Emotional”（情绪化的）是一个宽泛的中性词，指容易感受或表达情绪，可以是悲伤、喜悦或愤怒，不必然失控。而 “hysterical” 是 “emotional” 的极端形式，特指情绪表达过度、非理性、甚至破坏性，常带有负面评价。"
    }
  ]
}