{
  "word": "ice",
  "pronunciation": "aɪs",
  "concise_definition": "n. 冰, 冰块; v. 用冰冷却, 覆盖冰",
  "forms": {
    "plural": "ices"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The solid form of water, formed when water freezes at or below 0°C (32°F), commonly found in nature or used to cool drinks and preserve food.",
      "explanation_cn": "水在零摄氏度或以下冻结形成的固体状态，常见于自然界，也常用于冷却饮料或保存食物。",
      "example_en": "The lake was covered with a thick layer of ice after the cold night.",
      "example_cn": "经过寒冷的夜晚，湖面结了一层厚厚的冰。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, clear piece of frozen water, typically used in beverages to chill them without diluting flavor.",
      "explanation_cn": "一小块透明的冻结水，通常用于饮料中降温而不稀释风味。",
      "example_en": "She added two cubes of ice to her whiskey.",
      "example_cn": "她在威士忌里加了两块冰。"
    },
    {
      "pos": "noun",
      "explanation_en": "A smooth, slippery surface formed by frozen water, especially on roads or sidewalks, posing a hazard for walking or driving.",
      "explanation_cn": "由冻结水形成的光滑、滑溜的表面，尤其指道路或人行道上的冰层，对行走或驾驶构成危险。",
      "example_en": "The accident was caused by black ice on the highway.",
      "example_cn": "这起事故是由高速公路上的暗冰引起的。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slang term for diamonds or other valuable jewelry worn as a status symbol, especially in hip-hop culture.",
      "explanation_cn": "俚语，指作为身份象征佩戴的钻石或其他贵重珠宝，尤其在嘻哈文化中。",
      "example_en": "He was flashing his ice at the party — a massive diamond necklace and matching rings.",
      "example_cn": "他在派对上炫耀着他的冰钻——一条巨大的钻石项链和配套的戒指。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover something with ice, or to chill something by adding ice or placing it in a cold environment.",
      "explanation_cn": "用冰覆盖某物，或通过加冰或置于低温环境中使其变冷。",
      "example_en": "The bartender iced the glasses before serving the cocktails.",
      "example_cn": "调酒师在供应鸡尾酒前把酒杯冰镇过。"
    },
    {
      "pos": "verb",
      "explanation_en": "To freeze or coat something with a layer of ice, often used in contexts like sports or weather.",
      "explanation_cn": "使某物表面结冰或覆盖一层冰，常用于体育或天气语境。",
      "example_en": "The rink was iced overnight to prepare for the morning game.",
      "example_cn": "溜冰场在夜间被冰封，为早晨的比赛做准备。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "frost",
      "analysis": "“Frost”（霜）是空气中水蒸气在物体表面直接凝华形成的细小冰晶，通常呈白色、松散、薄层状，多出现在寒冷清晨；而 “ice” 是液态水冻结后形成的坚硬、透明或半透明固体，结构更致密，覆盖范围更广。"
    },
    {
      "word_to_compare": "snow",
      "analysis": "“Snow”（雪）是由大气中水蒸气凝结成的冰晶聚集而成的降水形式，呈絮状、轻盈、多孔；而 “ice” 是水在地面或物体表面冻结形成的固体层，质地坚硬、连续，不具松散结构。"
    },
    {
      "word_to_compare": "glaze",
      "analysis": "“Glaze”（冰衣/釉层）通常指一层薄而光滑的透明冰层，常用于描述道路或树枝上的覆冰现象，强调其光滑、反光的特性；而 “ice” 是更广义的术语，涵盖所有形式的冻结水，包括厚冰、碎冰、冰块等。"
    }
  ]
}