{
  "word": "iced",
  "pronunciation": "aɪst",
  "concise_definition": "adj. 冰冻的, 加冰的; v. 用冰冷却 (ice 的过去式和过去分词)",
  "forms": {
    "base_form": "ice",
    "past_tense": "iced",
    "past_participle": "iced",
    "present_participle": "icing",
    "plural": "ices"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Covered with or chilled by ice; typically used to describe beverages, desserts, or surfaces that have been cooled to a freezing temperature.",
      "explanation_cn": "被冰覆盖或用冰冷却的；常用于描述饮料、甜点或表面被冷却至冰点温度的状态。",
      "example_en": "She ordered a glass of iced tea with lemon.",
      "example_cn": "她点了一杯加了柠檬的冰茶。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Frozen solid, especially in the context of weather or surfaces, making them slippery or impassable.",
      "explanation_cn": "冻结成固体的，尤其用于描述天气或地表状况，使其变得湿滑或难以通行。",
      "example_en": "The roads were iced over after the snowstorm, causing multiple accidents.",
      "example_cn": "暴风雪后道路结冰，导致多起事故。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cool something by adding ice or placing it in a cold environment, especially to serve beverages or desserts at a low temperature.",
      "explanation_cn": "通过添加冰块或将某物置于低温环境中使其冷却，尤指将饮料或甜点冷藏后供应。",
      "example_en": "The bartender iced the champagne before serving it to the guests.",
      "example_cn": "调酒师在为客人上酒前将香槟冰镇了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover something with a layer of ice, often as a result of freezing rain or condensation.",
      "explanation_cn": "使某物表面覆盖一层冰，通常由冻雨或冷凝所致。",
      "example_en": "The trees were iced by the overnight freeze, creating a glittering winter landscape.",
      "example_cn": "夜间低温使树木表面结冰，形成了一幅闪闪发光的冬日景象。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "frozen",
      "analysis": "“Frozen” (冻结的) 指物质因低温而完全变为固态，强调物理状态的彻底转变，常用于食物、水体或生物组织。而 “iced” 更侧重于“人为添加冰”或“表面短暂结冰”，不一定完全固态，如冰镇饮料。"
    },
    {
      "word_to_compare": "chilled",
      "analysis": "“Chilled” (冷藏的) 指被冷却但未达到冰点，通常用于描述温度在0°C以上但仍低于室温的状态，如冷藏葡萄酒。而 “iced” 暗示温度更低，常接近或达到冰点，可能含有可见冰块或冰层。"
    },
    {
      "word_to_compare": "glazed",
      "analysis": "“Glazed” (上釉的/覆有光亮层的) 常用于描述食物表面覆盖一层糖浆或油脂形成的光滑涂层，如 glazed donut。虽然有时可与 “iced” 互换（如冰霜蛋糕），但 “glazed” 强调的是黏稠的糖衣，而 “iced” 强调的是冰或冰晶形成的冷感表面。"
    }
  ]
}