{
  "word": "iconic",
  "pronunciation": "eye·kon·ik",
  "concise_definition": "adj. 标志性的, 具有象征意义的, 极具代表性的",
  "forms": {
    "comparative": "more iconic",
    "superlative": "most iconic"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Widely recognized and strongly associated with a particular person, thing, or idea, often representing a cultural or historical symbol of great significance.",
      "explanation_cn": "被广泛认可并强烈关联于某个人、事物或理念，通常代表具有重大文化或历史意义的象征符号。",
      "example_en": "The Apple logo is an iconic symbol of modern design and innovation.",
      "example_cn": "苹果标志是现代设计与创新的标志性象征。"
    },
    {
      "pos": "adjective",
      "explanation_en": "So famous or influential that it has become a cultural reference point, often imitated or parodied in popular media.",
      "explanation_cn": "如此著名或具有影响力，以至于成为流行文化中的参照点，常被模仿或戏仿。",
      "example_en": "Marilyn Monroe’s white dress scene in The Seven Year Itch is an iconic moment in film history.",
      "example_cn": "玛丽莲·梦露在《七年之痒》中白色连衣裙的场景是电影史上的经典时刻。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Representing the quintessential or ideal form of something, often embodying its most recognizable or defining characteristics.",
      "explanation_cn": "代表某事物的典型或理想形态，通常体现其最易识别或最具定义性的特征。",
      "example_en": "The Eiffel Tower is an iconic representation of Paris and French culture.",
      "example_cn": "埃菲尔铁塔是巴黎和法国文化的典型代表。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "famous",
      "analysis": "“Famous”（著名的）仅表示广为人知，但不一定具有象征意义或文化深度。一个人或事物可以很出名却不是“iconic”。例如，一个网红可能很出名，但未必成为文化符号。而 “iconic” 强调的是持久的象征价值和代表性。"
    },
    {
      "word_to_compare": "symbolic",
      "analysis": "“Symbolic”（象征性的）侧重于某物代表抽象概念（如鸽子象征和平），但不一定广为人知或具有流行文化影响力。而 “iconic” 不仅具有象征意义，还必须是大众广泛认知并高度认同的视觉或文化标志。"
    },
    {
      "word_to_compare": "classic",
      "analysis": "“Classic”（经典的）强调时间检验后的卓越品质或传统价值，常用于艺术、文学或设计领域。而 “iconic” 更强调在当代文化中的广泛识别度和影响力，即使作品较新，只要迅速成为文化符号，也可称为 iconic。例如，一部新电影可能在上映后立即成为 iconic，但未必是 classic。"
    }
  ]
}