{
  "word": "ideal",
  "pronunciation": "ahy·dee·uhl",
  "concise_definition": "adj. 最理想的, 完美的; n. 理想, 完美标准",
  "forms": {
    "comparative": "idealer",
    "superlative": "idealdest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Perfect or most suitable for a particular purpose; representing the best possible standard or condition without flaws or compromises.",
      "explanation_cn": "指最适合某种特定目的的，或没有缺陷、无需妥协的最完美状态或标准。",
      "example_en": "She has an ideal climate for growing roses.",
      "example_cn": "她这里的气候非常适合种植玫瑰。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Existing only in the mind as a perfect standard, often unattainable in reality; used to describe abstract concepts of perfection.",
      "explanation_cn": "仅存在于思想中作为完美标准，现实中往往难以实现；用于描述抽象的完美概念。",
      "example_en": "His ideal of justice includes mercy and fairness for all.",
      "example_cn": "他对正义的理想包含了对所有人宽恕与公平。"
    },
    {
      "pos": "noun",
      "explanation_en": "A standard of perfection, beauty, or excellence that one strives to achieve, often guiding personal values or actions.",
      "explanation_cn": "指一个人努力追求的完美、美或卓越的标准，常指导个人的价值观或行为。",
      "example_en": "Honesty and integrity are her guiding ideals.",
      "example_cn": "诚实与正直是她奉行的准则。"
    },
    {
      "pos": "noun",
      "explanation_en": "A vision or principle that represents a desired future state, especially in politics, philosophy, or social reform.",
      "explanation_cn": "指代表所期望的未来状态的愿景或原则，尤指在政治、哲学或社会改革中。",
      "example_en": "The revolution was fought in the name of liberty and equality — their highest ideals.",
      "example_cn": "这场革命以自由与平等的名义而战——那是他们最高的理想。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "perfect",
      "analysis": "“Perfect” (完美的) 强调某物在形式、功能或质量上没有任何缺陷，是客观可衡量的极致状态。而 “ideal” 更侧重于主观期望或价值判断，可能并不实际存在，甚至无法实现。例如，一个完美的数学证明是逻辑无误的，但一个理想的社会是价值观驱动的愿景。"
    },
    {
      "word_to_compare": "optimal",
      "analysis": "“Optimal” (最佳的) 是在给定约束条件下最有效或最有利的选择，强调实用性和效率，常用于科学、工程或经济语境。而 “ideal” 不考虑现实限制，是纯粹的、无条件的完美标准。例如，最优解可能是成本最低的方案，而理想解可能是零成本、零风险、百分百高效。"
    },
    {
      "word_to_compare": "utopian",
      "analysis": "“Utopian” (乌托邦的) 通常带有贬义，指过于理想化、脱离现实、难以实现的设想，常暗示天真或不切实际。而 “ideal” 是中性词，可指崇高而值得追求的目标，不一定被视作荒谬。例如，乌托邦社会常被批判为空想，而理想人格则被广泛尊敬。"
    }
  ]
}