{
  "word": "identification",
  "pronunciation": "i·den·tuh·fih·key·shun",
  "concise_definition": "n. 识别, 鉴定, 身份证明",
  "forms": {
    "plural": "identifications"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of recognizing or establishing who or what someone or something is, often through physical, digital, or behavioral characteristics.",
      "explanation_cn": "指通过身体特征、数字信息或行为模式来识别或确认某人或某物身份的过程。",
      "example_en": "The security guard checked my identification before allowing me into the building.",
      "example_cn": "保安在让我进入大楼前查验了我的身份证件。"
    },
    {
      "pos": "noun",
      "explanation_en": "An official document or card that verifies a person's identity, such as a driver’s license, passport, or national ID card.",
      "explanation_cn": "指用于证明个人身份的官方文件或卡片，如驾照、护照或身份证。",
      "example_en": "You must present a valid form of identification to open a bank account.",
      "example_cn": "开设银行账户时，您必须出示有效的身份证明文件。"
    },
    {
      "pos": "noun",
      "explanation_en": "The psychological process of feeling closely connected to or sharing the characteristics of another person or group, often leading to empathy or shared values.",
      "explanation_cn": "指在心理上与他人或群体产生强烈联系，认同其特征、情感或价值观，常导致共情或归属感。",
      "example_en": "Her identification with the activist movement gave her the courage to speak out.",
      "example_cn": "她对这场社会运动的认同赋予了她发声的勇气。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "identity",
      "analysis": "“Identity”（身份）指一个人或事物本身固有的、独特的本质或特征，是静态的、内在的属性；而 “identification” 是一个动态过程，指识别、确认或认同这一身份的行为或结果。例如：你的身份证上写的是你的 identity（身份），而出示身份证进行验证的过程就是 identification（识别）。"
    },
    {
      "word_to_compare": "recognition",
      "analysis": "“Recognition”（认出）强调通过记忆或熟悉感来辨识某人或某物，常基于先前的经验；而 “identification” 更正式、更系统，常涉及官方程序或技术手段（如指纹、人脸识别），并可能包含法律效力。例如：你认出老朋友是 recognition，而警方通过数据库确认嫌疑人身份是 identification。"
    },
    {
      "word_to_compare": "verification",
      "analysis": "“Verification”（核实）侧重于通过检查证据或数据来确认某事的真实性或准确性，范围更广，不局限于身份；而 “identification” 特指确认‘是谁’或‘是什么’。例如：验证密码是 verification，但用护照证明你是张三则是 identification。"
    }
  ]
}