{
  "word": "idol",
  "pronunciation": "aɪ·dol",
  "concise_definition": "n. 偶像, 神像, 被盲目崇拜的人或物",
  "forms": {
    "plural": "idols"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who is greatly admired, often by a large group of fans, especially in the fields of entertainment, sports, or pop culture, and who may be idealized or worshipped without critical judgment.",
      "explanation_cn": "指被大量粉丝极度钦佩的人，尤其在娱乐、体育或流行文化领域，常被理想化甚至盲目崇拜，缺乏理性批判。",
      "example_en": "Many teenagers look up to pop stars as their idols.",
      "example_cn": "许多青少年将流行歌手视为自己的偶像。"
    },
    {
      "pos": "noun",
      "explanation_en": "A physical object, such as a statue or image, that is worshipped as a deity in certain religious traditions, often considered a false or inappropriate object of worship in monotheistic faiths.",
      "explanation_cn": "指在某些宗教传统中被当作神灵来崇拜的实物，如雕像或图像；在一神教信仰中常被视为虚假或不当的崇拜对象。",
      "example_en": "The ancient temple contained golden idols of gods from the old pantheon.",
      "example_cn": "这座古庙里供奉着来自旧神系的金制神像。"
    },
    {
      "pos": "noun",
      "explanation_en": "Something that is excessively valued or pursued to the point of obsession, often at the expense of more important values.",
      "explanation_cn": "指被过度推崇或追求到近乎痴迷的事物，往往以牺牲更重要的价值为代价。",
      "example_en": "For some, wealth and fame have become idols, replacing family and integrity.",
      "example_cn": "对一些人来说，财富和名望已沦为偶像，取代了家庭与诚信。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hero",
      "analysis": "“Hero” (英雄) 强调因勇敢、牺牲或高尚品德而赢得尊敬的人，其崇拜基于真实成就和道德力量，通常带有敬重和效仿的意味。而 “idol” 更侧重于情感投射和盲目追随，不一定有道德或功绩基础，常与流行文化中的形象相关。"
    },
    {
      "word_to_compare": "deity",
      "analysis": "“Deity” (神明) 是宗教体系中真正被信仰为超自然存在的神圣实体，具有创造或主宰宇宙的力量。而 “idol” 是对神明的物质象征或人为建构的崇拜对象，有时甚至被视作对真正神明的亵渎。"
    },
    {
      "word_to_compare": "role model",
      "analysis": "“Role model” (榜样) 指因正面行为、价值观或成就而被他人有意识学习和模仿的对象，强调理性认同与积极影响。而 “idol” 可能缺乏理性基础，崇拜常带有情绪化、非批判性甚至盲目性，不必然具备可效仿的品德。"
    }
  ]
}