{
  "word": "illustrating",
  "pronunciation": "il·uh·stray·ting",
  "concise_definition": "v. 说明, 图解, 举例, 配图",
  "forms": {
    "base_form": "illustrate",
    "third_person_singular": "illustrates",
    "past_tense": "illustrated",
    "past_participle": "illustrated",
    "gerund": "illustrating"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To make something clearer or more understandable by using examples, diagrams, pictures, or vivid descriptions, especially to support or clarify an abstract idea.",
      "explanation_cn": "通过使用例子、图表、图片或生动的描述，使某事物更清晰、更容易理解，尤其用于支持或阐明抽象概念。",
      "example_en": "The textbook is full of colorful diagrams illustrating how the human heart pumps blood.",
      "example_cn": "这本教科书充满了色彩丰富的图表，用以说明人类心脏如何泵血。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provide visual accompaniment to a text, such as in books, magazines, or advertisements, to enhance meaning or appeal.",
      "explanation_cn": "为文本（如书籍、杂志或广告）提供视觉配图，以增强其意义或吸引力。",
      "example_en": "The children's book was beautifully illustrating by a renowned artist.",
      "example_cn": "这本儿童读物由一位著名艺术家精心配图。"
    },
    {
      "pos": "verb",
      "explanation_en": "To serve as a clear example or instance that demonstrates a principle or concept, often in a compelling or memorable way.",
      "explanation_cn": "作为能有力展示某一原则或概念的鲜明例证，通常以令人印象深刻的方式呈现。",
      "example_en": "Her success story is illustrating how perseverance can overcome even the toughest obstacles.",
      "example_cn": "她的成功故事生动地说明了毅力如何克服最艰难的障碍。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "example",
      "analysis": "“Example”（例子）是用于说明规则或观点的具体事例，侧重于“实例本身”；而 “illustrating” 强调的是“通过某种方式（如图像、故事、类比）使抽象概念变得具体可感”的动作或过程。前者是内容，后者是方法。"
    },
    {
      "word_to_compare": "demonstrating",
      "analysis": "“Demonstrating”（演示/证明）通常指通过实验、操作或逻辑推理来证实某事的真实性，强调客观性和说服力；而 “illustrating” 更注重“使理解更容易”，不一定需要证明，只需让概念更形象、更易接受。"
    },
    {
      "word_to_compare": "clarifying",
      "analysis": "“Clarifying”（澄清）泛指消除模糊、使意思更明确，可以是语言上的解释；而 “illustrating” 特指借助视觉、比喻或具体案例来实现澄清，具有更强的具象化和感官辅助特征。"
    }
  ]
}