{
  "word": "imagery",
  "pronunciation": "im·uhj·er·ee",
  "concise_definition": "n. 意象, 图像, 画面, 描写",
  "forms": {
    "plural": "imagery"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The use of vivid and descriptive language to create mental images, often appealing to the senses, in literature, poetry, or art to evoke emotion or enhance meaning.",
      "explanation_cn": "在文学、诗歌或艺术中，通过生动、富有描述性的语言唤起读者的感官想象，以激发情感或增强表达意义。",
      "example_en": "The poet's imagery of 'golden fields swaying in the wind' brought the countryside to life.",
      "example_cn": "诗人用'金黄色的田野在风中摇曳'这一意象，让乡村景象栩栩如生。"
    },
    {
      "pos": "noun",
      "explanation_en": "Visual representations or symbolic pictures, especially in film, advertising, or political communication, used to convey ideas, emotions, or ideologies.",
      "explanation_cn": "视觉表现或象征性图像，尤其在电影、广告或政治传播中，用于传达思想、情感或意识形态。",
      "example_en": "The campaign used powerful imagery of families and flags to evoke patriotism.",
      "example_cn": "这场竞选活动运用了家庭与国旗的强烈图像，以唤起爱国情感。"
    },
    {
      "pos": "noun",
      "explanation_en": "The collective visual or sensory elements in a work of art, film, or media that contribute to its overall atmosphere or theme.",
      "explanation_cn": "艺术作品、电影或媒体中所有视觉或感官元素的总和，共同营造其整体氛围或主题。",
      "example_en": "The film's imagery of decaying buildings and foggy streets reinforced its theme of isolation.",
      "example_cn": "影片中破败的建筑与雾气弥漫的街道意象，强化了其孤独的主题。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "image",
      "analysis": "“Image” (图像/形象) 通常指单一的、具体的视觉画面或心理表象，可以是物理的（如照片）或抽象的（如公众形象）。而 “imagery” 是复数或集合概念，强调一组相互关联的意象，常用于文学或艺术的整体氛围营造，更具系统性和象征性。"
    },
    {
      "word_to_compare": "metaphor",
      "analysis": "“Metaphor” (隐喻) 是一种修辞手法，通过将一物比作另一物来表达深层含义，属于语言结构；而 “imagery” 是通过感官细节构建画面，属于感知体验。隐喻可能包含在 imagery 中，但 imagery 不一定依赖隐喻，它可以通过直接描写实现。"
    },
    {
      "word_to_compare": "symbolism",
      "analysis": "“Symbolism” (象征主义) 指用具体事物代表抽象概念（如白鸽象征和平），强调意义的指代关系；而 “imagery” 更注重感官体验和画面的营造，即使没有明确象征意义，只要能唤起感官联想，即构成 imagery。两者常共存，但目的不同：象征主义重意义，imagery 重感受。"
    }
  ]
}