{
  "word": "images",
  "pronunciation": "im·ij·iz",
  "concise_definition": "n. 图像, 图片, 印象, 形象",
  "forms": {
    "singular": "image"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A visual representation of a person, object, or scene, created by photography, painting, drawing, or digital means.",
      "explanation_cn": "通过摄影、绘画、素描或数字手段创建的对人物、物体或场景的视觉表现。",
      "example_en": "The photographer captured stunning images of the sunset over the ocean.",
      "example_cn": "摄影师拍摄了海洋上日落的精彩图像。"
    },
    {
      "pos": "noun",
      "explanation_en": "A mental picture or concept formed in the mind, often representing an idea, feeling, or perception.",
      "explanation_cn": "在脑海中形成的图像或概念，通常代表某种想法、情感或感知。",
      "example_en": "She has a clear image of her childhood home in her mind.",
      "example_cn": "她脑海中清晰地浮现出童年时的家。"
    },
    {
      "pos": "noun",
      "explanation_en": "The public perception or reputation of a person, organization, or brand, often shaped by media and communication.",
      "explanation_cn": "个人、组织或品牌在公众心目中的印象或声誉，通常由媒体和传播塑造。",
      "example_en": "The company is working to improve its image after the scandal.",
      "example_cn": "这起丑闻之后，该公司正努力改善其公众形象。"
    },
    {
      "pos": "noun",
      "explanation_en": "In computing, a file containing a digital representation of a visual scene or object, such as a JPEG or PNG file.",
      "explanation_cn": "在计算机领域，指包含视觉场景或物体数字表示的文件，如 JPEG 或 PNG 文件。",
      "example_en": "Please upload the images in PNG format for better quality.",
      "example_cn": "请以 PNG 格式上传图像以获得更佳质量。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "picture",
      "analysis": "“Picture”（图片）通常指更具体、更直观的视觉再现，常用于日常语境，如家庭照片或绘画。而 “image” 更广泛，可涵盖抽象的心理图像、品牌印象或数字文件，语义范围更广。"
    },
    {
      "word_to_compare": "illustration",
      "analysis": "“Illustration”（插图）特指为解释或装饰文本而设计的图示，通常具有明确的教育或叙事目的，如书籍中的插图。而 “image” 是中性术语，不必然带有解释性功能，仅表示视觉呈现。"
    },
    {
      "word_to_compare": "representation",
      "analysis": "“Representation”（表征）是更抽象的术语，指任何以符号、模型或形式替代真实事物的方式，包括语言、数学符号或艺术形式。而 “image” 通常特指视觉层面的表征，更具体、更感官化。"
    }
  ]
}