{
  "word": "image",
  "pronunciation": "im·ij",
  "concise_definition": "n. 图像, 形象, 印象, 镜像",
  "forms": {
    "plural": "images"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A visual representation of a person, object, or scene, created by photography, painting, drawing, or digital means.",
      "explanation_cn": "通过摄影、绘画、素描或数字手段创建的对人物、物体或场景的视觉表现。",
      "example_en": "The photograph captured a stunning image of the sunset over the ocean.",
      "example_cn": "这张照片捕捉到了海上日落的壮丽图像。"
    },
    {
      "pos": "noun",
      "explanation_en": "A mental picture or concept formed in the mind, often based on perception, memory, or imagination.",
      "explanation_cn": "在头脑中形成的视觉印象或概念，通常基于感知、记忆或想象。",
      "example_en": "She has a clear image of her childhood home in her mind.",
      "example_cn": "她脑海中清晰地浮现出童年时的家。"
    },
    {
      "pos": "noun",
      "explanation_en": "The public perception or reputation of a person, organization, or brand, especially as shaped by media or marketing.",
      "explanation_cn": "个人、组织或品牌在公众心目中的形象或声誉，尤其由媒体或营销塑造而成。",
      "example_en": "The company worked hard to improve its image after the scandal.",
      "example_cn": "丑闻发生后，该公司努力改善其公众形象。"
    },
    {
      "pos": "noun",
      "explanation_en": "A reflected or mirrored version of something, especially in optics or physics.",
      "explanation_cn": "某物的反射或镜像版本，尤其在光学或物理学中。",
      "example_en": "The mirror produced a perfect image of the candle flame.",
      "example_cn": "镜子呈现出蜡烛火焰的完美镜像。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "picture",
      "analysis": "“Picture” (图画/照片) 通常指具体的、有形的视觉作品，如绘画或照片，强调其物理存在和艺术性。而 “image” 更广泛，可指心理印象、抽象概念或数字生成的视觉内容，不一定有实体形式。"
    },
    {
      "word_to_compare": "picture",
      "analysis": "“Picture” (图画/照片) 通常指具体的、有形的视觉作品，如绘画或照片，强调其物理存在和艺术性。而 “image” 更广泛，可指心理印象、抽象概念或数字生成的视觉内容，不一定有实体形式。"
    },
    {
      "word_to_compare": "likeness",
      "analysis": "“Likeness” (相似性/肖像) 专指与原物在外观上的相似，尤其用于人像，强调逼真度。它常用于描述肖像画或雕塑是否“像”本人。而 “image” 不仅限于外貌相似，还可指象征性、抽象或公众认知层面的形象。"
    },
    {
      "word_to_compare": "reflection",
      "analysis": "“Reflection” (反射/反映) 强调物理或隐喻意义上的“映射”，如水面倒影或行为反映性格。它通常是被动的、直接的再现。而 “image” 可以是主动构建的，如品牌形象，包含主观塑造和传播的成分。"
    }
  ]
}