{
  "word": "immune",
  "pronunciation": "ih·myo͞o·ēn",
  "concise_definition": "adj. 免疫的, 有抵抗力的, 免于...的",
  "forms": {
    "comparative": "more immune",
    "superlative": "most immune"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Not affected by or susceptible to a particular disease or harmful agent due to the presence of antibodies or a strengthened biological defense system.",
      "explanation_cn": "由于体内存在抗体或免疫系统增强，而对某种疾病或有害物质不敏感或不具备易感性。",
      "example_en": "After receiving the vaccine, she became immune to measles.",
      "example_cn": "接种疫苗后，她对麻疹产生了免疫力。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Exempt or protected from the effects, obligations, or influences of something, often used in legal, social, or figurative contexts.",
      "explanation_cn": "在法律、社会或比喻意义上，免受某种影响、义务或约束的，常用于描述特权或豁免状态。",
      "example_en": "Diplomats are often immune from prosecution in the host country.",
      "example_cn": "外交官在驻在国通常享有豁免权，不受起诉。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Resistant to the influence or impact of a particular idea, emotion, or situation, often implying emotional or psychological detachment.",
      "explanation_cn": "对某种思想、情绪或情境具有抵抗力，常暗示情感或心理上的疏离或不为所动。",
      "example_en": "After years of criticism, he became immune to negative comments.",
      "example_cn": "经历了多年的批评后，他对负面评论已无动于衷。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "resistant",
      "analysis": "“Resistant” (有抵抗力的) 是一个更通用的词，可用于任何对抗外部影响的情况，如抗药性、抗腐蚀等，不一定涉及免疫系统。而 “immune” 通常特指生物体因免疫机制而完全不被感染，或在比喻意义上完全不受影响，语气更强、更绝对。"
    },
    {
      "word_to_compare": "impervious",
      "analysis": "“Impervious” (不受影响的) 强调完全无法被穿透、渗透或影响，常用于物理或抽象层面，如“impervious to water”或“impervious to logic”。它更强调外部力量无法作用，而 “immune” 更强调内在防御机制导致的无反应状态，尤其在医学和法律语境中更常用。"
    },
    {
      "word_to_compare": "protected",
      "analysis": "“Protected” (受保护的) 指通过外部措施（如法律、屏障、防护）而获得安全，是被动的、外力赋予的状态。而 “immune” 是一种内在的、系统性的能力或状态，通常是自身生理或心理机制的结果，不依赖外部干预。"
    }
  ]
}