{
  "word": "impaired",
  "pronunciation": "im·paird",
  "concise_definition": "adj. 受损的, 有缺陷的, 能力减弱的",
  "forms": {
    "comparative": "more impaired",
    "superlative": "most impaired"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having a physical, mental, or sensory function that is reduced or limited in ability, often due to injury, illness, or congenital condition.",
      "explanation_cn": "指因受伤、疾病或先天条件而导致身体、心理或感官功能减弱或受限的状态。",
      "example_en": "The driver was found to have impaired vision due to cataracts.",
      "example_cn": "经检查发现，该司机因白内障导致视力受损。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Diminished in quality, effectiveness, or normal function, especially in cognitive or decision-making abilities.",
      "explanation_cn": "指在质量、有效性或正常功能上有所降低，尤其指认知能力或决策能力的减弱。",
      "example_en": "His judgment was impaired by alcohol, leading to a serious accident.",
      "example_cn": "他的判断力因酒精影响而受损，导致了一场严重事故。"
    },
    {
      "pos": "adjective",
      "explanation_en": "In law or policy contexts, referring to individuals whose rights or access to services are restricted due to disability or functional limitation.",
      "explanation_cn": "在法律或政策语境中，指因残疾或功能限制而权利或服务获取受到限制的个体。",
      "example_en": "The building was renovated to be accessible for people with impaired mobility.",
      "example_cn": "该建筑经过翻新，以便行动不便者能够通行。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "disabled",
      "analysis": "“Disabled” (残疾的) 是一个更广泛、更正式的法律和社会术语，通常指符合法定标准的长期身体或精神障碍，强调身份和权利保障。“Impaired” 更侧重于功能层面的暂时性或程度性减弱，不一定达到“残疾”的法定标准，语义范围更窄、更中性。"
    },
    {
      "word_to_compare": "damaged",
      "analysis": "“Damaged” (受损的) 通常用于描述物体或结构因外力而遭受物理破坏，如“damaged car”或“damaged goods”。“Impaired” 更常用于描述功能、能力或系统的减弱，强调的是性能下降而非物理形态的破坏，多用于抽象或生物系统。"
    },
    {
      "word_to_compare": "defective",
      "analysis": "“Defective” (有缺陷的) 强调某物不符合设计标准或存在制造/设计上的瑕疵，常用于产品、设备或系统，如“a defective circuit”。而 “impaired” 更强调功能因外部或内部因素而退化，不一定是先天或制造缺陷，可能是后天或可逆的。"
    }
  ]
}