{
  "word": "impacts",
  "pronunciation": "im·pakt",
  "concise_definition": "n. 影响, 冲击, 碰撞; v. 冲击, 产生影响",
  "forms": {
    "singular": "impact"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A strong effect or influence on a person, thing, or situation, often with significant consequences, whether positive or negative.",
      "explanation_cn": "对某人、某物或某种情况产生的强烈影响或作用，通常具有显著的后果，可能是正面的，也可能是负面的。",
      "example_en": "The new policy had a major impact on the local economy.",
      "example_cn": "这项新政策对当地经济产生了重大影响。"
    },
    {
      "pos": "noun",
      "explanation_en": "A physical collision or forceful contact between two objects, often resulting in damage or change in motion.",
      "explanation_cn": "两个物体之间发生的物理性碰撞或强烈接触，通常导致损坏或运动状态的改变。",
      "example_en": "The asteroid impact created a massive crater on the planet's surface.",
      "example_cn": "小行星的撞击在星球表面形成了一个巨大的陨石坑。"
    },
    {
      "pos": "verb",
      "explanation_en": "To affect or influence something significantly, especially in a forceful or lasting way.",
      "explanation_cn": "以显著、有力或持久的方式对某事物产生影响或作用。",
      "example_en": "Climate change is impacting ecosystems around the world.",
      "example_cn": "气候变化正在影响全球的生态系统。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strike or collide with something forcefully.",
      "explanation_cn": "以强力撞击或碰撞某物。",
      "example_en": "The meteor impacted the Earth's atmosphere at high speed.",
      "example_cn": "流星以高速撞击地球大气层。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "effect",
      "analysis": "“Effect” (效果) 是一个更中性、更广泛的术语，泛指任何由原因引起的结果，不强调强度或方式。而 “impact” 更强调影响的力度、显著性或冲击性，常用于描述重大或深远的结果。"
    },
    {
      "word_to_compare": "influence",
      "analysis": "“Influence” (影响) 通常指潜移默化、间接或长期的作用，常带有温和、持续的意味，如人格、文化或价值观的影响。而 “impact” 更倾向于直接、强烈、有时是突发性的效果，常用于描述可测量或可观察的后果。"
    },
    {
      "word_to_compare": "consequence",
      "analysis": "“Consequence” (后果) 强调行为或事件之后自然产生的结果，常带有因果逻辑，且多用于负面结果。而 “impact” 更侧重于作用本身，可以是正面、负面或中性，且不一定需要明确的因果链条。"
    }
  ]
}