{
  "word": "implant",
  "pronunciation": "im·plant",
  "concise_definition": "v. 植入, 植入物; n. 植入物, 移植物",
  "forms": {
    "third_person_singular": "implants",
    "past_tense": "implanted",
    "past_participle": "implanted",
    "present_participle": "implanting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To surgically insert a device, substance, or tissue into a living body, typically to replace or support a missing or damaged part.",
      "explanation_cn": "指通过外科手术将装置、物质或组织植入活体中，通常用于替代或支持缺失或受损的部位。",
      "example_en": "The doctor implanted a pacemaker to regulate her heart rhythm.",
      "example_cn": "医生为她植入了起搏器以调节心跳节律。"
    },
    {
      "pos": "verb",
      "explanation_en": "To firmly establish an idea, belief, or memory in someone's mind, often subtly or over time.",
      "explanation_cn": "指在某人的脑海中牢固地建立某种想法、信念或记忆，通常通过潜移默化或长期影响的方式。",
      "example_en": "The advertisement campaign aimed to implant the idea that this brand is the most reliable.",
      "example_cn": "这则广告活动旨在潜移默化地让顾客相信这个品牌最可靠。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device or substance that has been surgically inserted into the body for medical purposes, such as a prosthetic joint, dental implant, or hormone pellet.",
      "explanation_cn": "指为医疗目的而通过外科手术植入体内的装置或物质，如人工关节、牙科种植体或激素缓释丸。",
      "example_en": "She received a cochlear implant to restore her hearing.",
      "example_cn": "她接受了人工耳蜗植入以恢复听力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "insert",
      "analysis": "“Insert” (插入) 是一个更通用的词，指将某物放入另一物中，不一定是外科手术，也不一定永久性。例如插入USB驱动器或插入一句话。而 “implant” 特指医学上永久或长期的体内植入，具有更强的专业性和生物医学语境。"
    },
    {
      "word_to_compare": "inoculate",
      "analysis": "“Inoculate” (接种) 通常指将疫苗或微生物引入体内以激发免疫反应，是一种预防性医疗手段。而 “implant” 更侧重于物理性替代或支撑功能，如植入心脏起搏器，不以激发免疫为目的。两者虽都涉及体内引入物质，但目的和机制不同。"
    },
    {
      "word_to_compare": "instill",
      "analysis": "“Instill” (灌输) 与 “implant” 在比喻义上相近，都指将思想或情感逐渐注入人心。但 “instill” 更强调通过教育、示范或反复影响来逐步建立，语气更温和；而 “implant” 在比喻用法中带有更强的强制性或隐蔽性，有时含贬义，如‘植入偏见’。"
    }
  ]
}