{
  "word": "implanted",
  "pronunciation": "im·plán·təd",
  "concise_definition": "adj. 植入的, 植入体内的; v. 植入（implant 的过去式和过去分词）",
  "forms": {
    "base_form": "implant",
    "third_person_singular": "implants",
    "past_tense": "implanted",
    "past_participle": "implanted",
    "present_participle": "implanting"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Inserted surgically or mechanically into a living organism, typically to replace or support a bodily function or to deliver a substance (e.g., a device, hormone, or chip).",
      "explanation_cn": "通过外科手术或机械方式植入生物体内的，通常用于替代或支持某种生理功能，或用于输送物质（如装置、激素或芯片）。",
      "example_en": "She has a pacemaker implanted in her chest to regulate her heartbeat.",
      "example_cn": "她胸部植入了起搏器，以调节心跳。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Fixed firmly in the mind or consciousness, often through persistent influence or suggestion, especially in a way that shapes behavior or belief.",
      "explanation_cn": "牢固地植入思想或意识中，通常通过持续的影响或暗示实现，尤其用于塑造行为或信念。",
      "example_en": "The advertisement successfully implanted the idea that this brand is the most reliable.",
      "example_cn": "这则广告成功地在消费者心中植入了‘这个品牌最可靠’的理念。"
    },
    {
      "pos": "verb",
      "explanation_en": "To insert a device, substance, or organ surgically into a living body.",
      "explanation_cn": "通过外科手术将装置、物质或器官插入生物体内。",
      "example_en": "Doctors implanted a synthetic valve to replace his damaged heart valve.",
      "example_cn": "医生植入了一个人工瓣膜，以替换他受损的心脏瓣膜。"
    },
    {
      "pos": "verb",
      "explanation_en": "To establish or fix an idea, belief, or feeling in someone's mind through repeated exposure or persuasion.",
      "explanation_cn": "通过反复接触或劝说，在某人脑海中确立或固定某种想法、信念或情感。",
      "example_en": "Parents often implant values like honesty and kindness in their children from an early age.",
      "example_cn": "父母通常从小就在孩子心中植入诚实与善良等价值观。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "inserted",
      "analysis": "“Inserted”（插入）是一个更通用的词，指将某物放入某处，不一定是生物体内，也不一定涉及长期固定或功能支持。而 “implanted” 特指在生物体内进行的、通常具有功能性或持久性的植入，带有医学或生物学语境。"
    },
    {
      "word_to_compare": "inoculated",
      "analysis": "“Inoculated”（接种）特指将疫苗或微生物引入体内以激发免疫反应，是一种特定类型的医学植入行为。而 “implanted” 范围更广，包括起搏器、芯片、激素等非生物性物质的植入，不涉及免疫机制。"
    },
    {
      "word_to_compare": "instilled",
      "analysis": "“Instilled”（灌输）与 “implanted” 在比喻义上接近，都指将思想或价值观逐渐植入人心。但 “instilled” 更强调通过教育、熏陶或长期影响的渐进过程，语气更温和；而 “implanted” 常带有更强的操控性或强制性色彩，有时暗示潜移默化甚至操纵。"
    }
  ]
}