{
  "word": "implants",
  "pronunciation": "im·plants",
  "concise_definition": "n. 植入物, 移植物; v. 植入, 移植",
  "forms": {
    "singular": "implant",
    "third_person_singular": "implants",
    "past_tense": "implanted",
    "past_participle": "implanted",
    "present_participle": "implanting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A medical device or tissue that is surgically inserted into the body to replace or support a missing or damaged part, such as a dental implant, breast implant, or pacemaker.",
      "explanation_cn": "指通过外科手术植入体内，用于替代或支撑缺失或受损身体部位的医疗装置或组织，如牙科种植体、乳房假体或心脏起搏器。",
      "example_en": "She received a cochlear implant to help her hear again after years of hearing loss.",
      "example_cn": "她在多年听力丧失后接受了人工耳蜗植入，以帮助恢复听力。"
    },
    {
      "pos": "noun",
      "explanation_en": "Something that is forcibly or subtly introduced into a person’s mind, especially an idea, belief, or memory, often without their awareness.",
      "explanation_cn": "指被强行或潜移默化地灌输到某人头脑中的事物，尤其是思想、信念或记忆，通常是在其无意识的情况下。",
      "example_en": "The advertisement was designed to implant a desire for luxury in young consumers.",
      "example_cn": "这则广告旨在在年轻消费者心中植入对奢侈品的渴望。"
    },
    {
      "pos": "verb",
      "explanation_en": "To surgically insert a medical device or tissue into the body to restore function or improve appearance.",
      "explanation_cn": "指通过外科手术将医疗装置或组织植入体内，以恢复功能或改善外观。",
      "example_en": "The surgeon implanted a synthetic joint to relieve his chronic knee pain.",
      "example_cn": "外科医生植入了一个人工关节，以缓解他长期的膝关节疼痛。"
    },
    {
      "pos": "verb",
      "explanation_en": "To introduce or establish an idea, feeling, or belief in someone’s mind, often gradually or subtly.",
      "explanation_cn": "指逐渐或潜移默化地在某人脑海中灌输某种思想、情感或信念。",
      "example_en": "The teacher implanted in her students a lifelong love of reading.",
      "example_cn": "这位老师在学生心中培养了终身热爱阅读的习惯。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "prosthesis",
      "analysis": "“Prosthesis”（假体）特指用于替代缺失身体部位的外部或内部装置，如假肢、假眼，通常强调功能替代，且多为体外可拆卸或部分植入。而 “implant” 更强调“永久性植入体内”，范围更广，包括假体、起搏器、药物缓释装置等。"
    },
    {
      "word_to_compare": "injection",
      "analysis": "“Injection”（注射）是通过针头将液体药物或物质注入体内，属于非手术、临时性或周期性的给药方式。而 “implant” 是通过手术植入固体或半固体装置，通常为长期或永久性，作用更持久，且不依赖频繁干预。"
    },
    {
      "word_to_compare": "indoctrinate",
      "analysis": "“Indoctrinate”（灌输）特指有意识地、往往带有意识形态色彩地向人灌输某种信仰或教条，常含贬义，强调强制性与思想控制。而 “implant” 在比喻义中更中性，可指潜移默化地建立某种观念，不一定带有操控意图，如广告或教育中的影响。"
    }
  ]
}