{
  "word": "import",
  "pronunciation": "im·port",
  "concise_definition": "v. 进口, 引入; n. 进口货, 输入",
  "forms": {
    "third_person_singular": "imports",
    "past_tense": "imported",
    "past_participle": "imported",
    "present_participle": "importing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To bring goods or services into a country from abroad for sale or use, typically involving international trade and customs regulations.",
      "explanation_cn": "指将商品或服务从国外运入本国用于销售或使用，通常涉及国际贸易和海关法规。",
      "example_en": "The country imports a large portion of its oil from the Middle East.",
      "example_cn": "该国大部分石油从中东进口。"
    },
    {
      "pos": "verb",
      "explanation_en": "To introduce or incorporate an idea, practice, or technology from one context or culture into another.",
      "explanation_cn": "指将某种思想、做法或技术从一个语境或文化引入到另一个语境或文化中。",
      "example_en": "The company imported a new management style from Japan.",
      "example_cn": "这家公司从日本引入了一种新的管理方式。"
    },
    {
      "pos": "noun",
      "explanation_en": "A product or service brought into a country from abroad; something that is imported.",
      "explanation_cn": "指从国外运入本国的商品或服务；被进口的东西。",
      "example_en": "Wine is one of the country's most popular imports.",
      "example_cn": "葡萄酒是该国最受欢迎的进口商品之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or process of importing; the significance or impact of something introduced from outside.",
      "explanation_cn": "指进口的行为或过程；也可指从外部引入的事物的重要性或影响。",
      "example_en": "The import of this new policy could reshape the entire industry.",
      "example_cn": "这项新政策的引入可能会重塑整个行业。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "export",
      "analysis": "“Export” (出口) 是 “import” 的反义词，指将本国的商品或服务运往国外销售。两者共同构成国际贸易的双向流动。在抽象意义上，export 指输出思想或文化，而 import 指输入。"
    },
    {
      "word_to_compare": "introduce",
      "analysis": "“Introduce” (介绍/引入) 是一个更广泛、更中性的词，可用于任何情境下的首次呈现，如介绍人、产品或概念，不涉及跨国界或商业交易。而 “import” 特指从外部系统或国家引入，常带有制度性、经济性或文化性的转移含义。"
    },
    {
      "word_to_compare": "bring in",
      "analysis": "“Bring in” 是一个口语化短语，含义接近 “import”，但更通用，可用于物理上带入某物（如带人进房间）或抽象意义上引入资源、收入等，缺乏 “import” 所具有的正式性与国际贸易的语境约束。"
    }
  ]
}