{
  "word": "imports",
  "pronunciation": "im·pawrts",
  "concise_definition": "n. 进口商品, 进口; v. 进口, 输入, 引入",
  "forms": {
    "singular": "import",
    "third_person_singular": "imports",
    "past_tense": "imported",
    "past_participle": "imported",
    "present_participle": "importing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Goods or services brought into one country from another for sale or use, typically as part of international trade.",
      "explanation_cn": "指从一个国家运入另一个国家用于销售或使用的商品或服务，通常是国际贸易的一部分。",
      "example_en": "The country's imports of electronics have increased significantly this year.",
      "example_cn": "今年该国的电子产品进口量显著增加。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or process of bringing goods or ideas from one country or culture into another, often with economic or cultural impact.",
      "explanation_cn": "指将商品或思想从一个国家或文化引入另一个国家或文化的行为或过程，常具有经济或文化影响。",
      "example_en": "The import of foreign fashion trends has changed local style preferences.",
      "example_cn": "外国时尚潮流的引入改变了本地的审美偏好。"
    },
    {
      "pos": "verb",
      "explanation_en": "To bring goods or services into a country from abroad, especially for commercial purposes.",
      "explanation_cn": "指从国外将商品或服务运入本国，尤其是出于商业目的。",
      "example_en": "The company imports high-quality coffee beans from Colombia.",
      "example_cn": "这家公司从哥伦比亚进口高品质的咖啡豆。"
    },
    {
      "pos": "verb",
      "explanation_en": "To introduce or incorporate an idea, practice, or technology from one context into another, often across cultural or systemic boundaries.",
      "explanation_cn": "指将某种思想、做法或技术从一个背景引入另一个背景，通常跨越文化或系统界限。",
      "example_en": "The school imported a new teaching method from Finland to improve student engagement.",
      "example_cn": "该校从芬兰引入了一种新的教学方法，以提高学生的参与度。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "exports",
      "analysis": "“Exports” (出口) 是 “imports” 的反义词，指将本国的商品或服务运往国外销售。两者共同构成国际贸易的双向流动。理解 “imports” 时，常需与 “exports” 对比，以分析贸易平衡和经济依赖关系。"
    },
    {
      "word_to_compare": "input",
      "analysis": "“Input” (输入) 是一个更广泛、更抽象的术语，可指任何形式的投入，如数据、资源、劳动力或信息，不限于跨国贸易。而 “imports” 特指跨境商品或服务的流入，具有明确的地理和经济边界。"
    },
    {
      "word_to_compare": "influx",
      "analysis": "“Influx” (涌入) 强调大量、快速或突然的进入，常用于描述人口、资金或信息的涌入，带有动态和数量上的紧迫感。而 “imports” 更中性、正式，侧重于合法贸易行为，不强调速度或规模。"
    }
  ]
}