{
  "word": "imprint",
  "pronunciation": "im·print",
  "concise_definition": "n. 印记, 印痕; v. 留下印记, 铭刻, 印刷",
  "forms": {
    "third_person_singular": "imprints",
    "past_tense": "imprinted",
    "past_participle": "imprinted",
    "present_participle": "imprinting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A mark or impression left by pressure or contact, often physical, such as a footprint, stamp, or pattern transferred onto a surface.",
      "explanation_cn": "指通过压力或接触在表面留下的痕迹或印记，通常是物理性的，如脚印、印章或转印的图案。",
      "example_en": "The shoe left a clear imprint in the wet sand.",
      "example_cn": "鞋子在湿沙上留下了一个清晰的脚印。"
    },
    {
      "pos": "noun",
      "explanation_en": "A distinctive influence or characteristic that is deeply and lastingly left on a person, culture, or system, often abstract.",
      "explanation_cn": "指对一个人、文化或系统所留下的深刻而持久的影响或特征，常为抽象意义。",
      "example_en": "Her childhood experiences left a lasting imprint on her worldview.",
      "example_cn": "她的童年经历对她的人生观留下了深远的影响。"
    },
    {
      "pos": "verb",
      "explanation_en": "To press or stamp a mark, pattern, or design onto a surface, often physically or mechanically.",
      "explanation_cn": "指通过按压或印刷将标记、图案或设计压印到表面上，通常为物理或机械方式。",
      "example_en": "The coin was imprinted with the king's face.",
      "example_cn": "这枚硬币上印有国王的头像。"
    },
    {
      "pos": "verb",
      "explanation_en": "To impress or inscribe something deeply and permanently on someone's mind, memory, or character, often emotionally or psychologically.",
      "explanation_cn": "指将某种印象、观念或影响深刻而持久地铭刻在某人的思想、记忆或性格中，常带有情感或心理层面的含义。",
      "example_en": "The teacher's words imprinted a sense of curiosity in her students.",
      "example_cn": "老师的话在学生心中铭刻下了求知的渴望。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mark",
      "analysis": "“Mark” (标记) 是一个更通用的词，泛指任何可见的痕迹、符号或记号，可以是无意的（如划痕）或有意的（如标签）。而 “imprint” 更强调通过压力或强烈影响留下的深刻、持久的痕迹，尤其在抽象意义上更具情感或文化深度。"
    },
    {
      "word_to_compare": "stamp",
      "analysis": "“Stamp” (盖章) 通常指用模具或印章施加的清晰、标准化的图案或文字，多用于官方或机械场景（如邮票、公章）。而 “imprint” 可以是自然形成的（如脚印）或抽象的（如影响），范围更广，且常带有持久性或象征性含义。"
    },
    {
      "word_to_compare": "engrave",
      "analysis": "“Engrave” (雕刻) 通常指在坚硬表面（如金属、石头）上用工具刻出文字或图案，强调物理上的深度和永久性。而 “imprint” 可以是浅层的（如压痕）或抽象的（如记忆），不一定需要工具或坚硬介质，适用范围更广。"
    }
  ]
}