{
  "word": "improving",
  "pronunciation": "im·pru·ving",
  "concise_definition": "v. 改进, 提高, 改善 (improve 的现在分词形式)",
  "forms": {
    "base_form": "improve",
    "third_person_singular": "improves",
    "past_tense": "improved",
    "past_participle": "improved",
    "gerund": "improving"
  },
  "definitions": [
    {
      "pos": "verb (gerund/participle)",
      "explanation_en": "The ongoing action of making something better by correcting flaws, adding value, or enhancing quality, performance, or condition.",
      "explanation_cn": "指持续进行的改进行为，通过纠正缺陷、增加价值或提升质量、表现或状态来使某事物变得更好。",
      "example_en": "She is improving her public speaking skills by taking weekly classes.",
      "example_cn": "她通过每周上课来不断提高自己的公众演讲能力。"
    },
    {
      "pos": "verb (gerund/participle)",
      "explanation_en": "The process of becoming better over time, especially in health, performance, or circumstances, often as a result of effort or natural progression.",
      "explanation_cn": "指随着时间推移逐渐变好，尤其在健康、表现或处境方面，通常是努力或自然发展的结果。",
      "example_en": "His physical condition is improving after months of rehabilitation.",
      "example_cn": "经过数月的康复，他的身体状况正在好转。"
    },
    {
      "pos": "verb (gerund/participle)",
      "explanation_en": "To make progress toward a more desirable or effective state, often used in contexts of personal development, technology, or systems.",
      "explanation_cn": "指朝着更理想或更高效的状态取得进展，常用于个人成长、技术或系统改进的语境中。",
      "example_en": "The software is improving with each new update, becoming faster and more user-friendly.",
      "example_cn": "随着每次更新，该软件都在不断改进，变得更快、更用户友好。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "enhancing",
      "analysis": "“Enhancing” (增强) 强调在原有基础上增加优势、价值或效果，通常用于提升美感、功能或体验，但不一定涉及纠正错误。而 “improving” 更广泛，包含修正缺陷和整体优化，适用范围更广。"
    },
    {
      "word_to_compare": "bettering",
      "analysis": "“Bettering” (改善) 与 “improving” 意义高度接近，但更口语化且使用频率较低，常用于表达个人进步（如 bettering oneself）。它带有更强的道德或自我提升色彩，而 “improving” 更中性、更常用于客观描述变化。"
    },
    {
      "word_to_compare": "refining",
      "analysis": "“Refining” (精炼) 指对已较完善的事物进行细微调整，使其更精致、更精确，如精炼语言、工艺或流程。它侧重于“优化细节”，而 “improving” 可以涵盖从基础到高级的全面改进，包括从糟糕到良好的质变。"
    }
  ]
}