{
  "word": "incarnation",
  "pronunciation": "in·kahr·nay·shun",
  "concise_definition": "n. 化身, 投胎, 具体体现",
  "forms": {
    "plural": "incarnations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The embodiment of a deity, spirit, or abstract concept in a physical form, especially in religious or mythological contexts.",
      "explanation_cn": "指神灵、精神或抽象概念以具体肉体形式显现，尤其用于宗教或神话语境中。",
      "example_en": "In Hinduism, Vishnu is believed to have taken several incarnations, such as Rama and Krishna, to restore cosmic order.",
      "example_cn": "在印度教中，人们相信毗湿奴曾多次化身，如罗摩和克里希那，以恢复宇宙秩序。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that is a perfect or typical example of a particular quality or idea.",
      "explanation_cn": "指某一种品质或理念的完美或典型体现者。",
      "example_en": "She is the incarnation of grace and elegance, moving through the room with effortless poise.",
      "example_cn": "她是优雅与风度的化身，举手投足间流露出自然的从容。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process of being born into a physical body, especially in the context of reincarnation or spiritual rebirth.",
      "explanation_cn": "指灵魂进入肉体、投胎转世的过程，常用于轮回信仰的语境中。",
      "example_en": "According to Buddhist teachings, the soul undergoes many incarnations before achieving enlightenment.",
      "example_cn": "根据佛教教义，灵魂在获得觉悟之前会经历多次投胎转世。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "embodiment",
      "analysis": "“Embodiment”（体现）与 “incarnation” 非常接近，都指抽象概念的具象化，但 “embodiment” 更广泛用于非宗教语境，强调某物是某种特质的集中体现，不涉及灵魂转世或神灵降世的宗教含义。而 “incarnation” 常带有神圣性或超自然色彩。"
    },
    {
      "word_to_compare": "manifestation",
      "analysis": "“Manifestation”（显现）强调某种无形力量或本质通过某种形式被感知或表现出来，可以是现象、征兆或结果，不一定需要肉体形式。而 “incarnation” 特指以人类或生物形态的具身化，更强调‘成为’而非‘显示’。"
    },
    {
      "word_to_compare": "avatar",
      "analysis": "“Avatar”（化身）源自印度教，特指神灵（如毗湿奴）下凡的化身，与 “incarnation” 在宗教语境中高度重合。但在现代语境中，尤其是数字世界，“avatar” 更常指用户在虚拟环境中的代表形象，语义范围更广、更世俗化，而 “incarnation” 仍保留较强的宗教与哲学深度。"
    }
  ]
}