{
  "word": "incapacitated",
  "pronunciation": "in·kuh·pas·uh·tay·tidd",
  "concise_definition": "adj. 丧失能力的, 无行为能力的, 无法正常运作的",
  "forms": {
    "base_form": "incapacitate",
    "present_participle": "incapacitating",
    "past_tense": "incapacitated",
    "past_participle": "incapacitated",
    "noun_form": "incapacitation"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Physically or mentally unable to perform normal functions or duties due to injury, illness, disability, or external restraint.",
      "explanation_cn": "因受伤、疾病、残疾或外部限制而无法正常履行身体或心理功能或职责的状态。",
      "example_en": "The driver was incapacitated by a sudden heart attack and lost control of the vehicle.",
      "example_cn": "司机因突发心脏病而丧失能力，导致车辆失控。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Legally deprived of the capacity to make decisions or manage one’s own affairs, often due to mental impairment or court order.",
      "explanation_cn": "因精神障碍或法院裁定而被法律剥夺了做出决定或管理自身事务的能力。",
      "example_en": "After the stroke, she was declared legally incapacitated and a guardian was appointed to manage her finances.",
      "example_cn": "中风后，她被宣告为法律上的无行为能力人，法院指定了监护人管理她的财务。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Rendered ineffective or non-functional, especially in the context of systems, organizations, or equipment.",
      "explanation_cn": "使失效或无法运作，尤其用于描述系统、组织或设备。",
      "example_en": "The cyberattack incapacitated the city’s traffic control system for over 24 hours.",
      "example_cn": "网络攻击使该市的交通控制系统瘫痪了超过24小时。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "disabled",
      "analysis": "“Disabled”（残疾的）通常指长期或永久性的身体或精神功能障碍，强调一种身份或状态，常用于社会福利和法律语境。而 “incapacitated” 更侧重于临时或情境性的丧失能力，可能是由急性事件（如事故、疾病）引发，且可能恢复。"
    },
    {
      "word_to_compare": "unconscious",
      "analysis": "“Unconscious”（无意识的）特指失去知觉的状态，是 “incapacitated” 的一种可能表现形式，但并非所有 incapacitated 的人都是无意识的。例如，一个人可能神志清醒但因瘫痪而无法行动，仍属 incapacitated。"
    },
    {
      "word_to_compare": "ineffective",
      "analysis": "“Ineffective”（无效的）泛指未能产生预期效果，可用于抽象事物（如政策、方法），不涉及主体的生理或法律能力。而 “incapacitated” 必须指向一个有行为能力的主体（人或系统）因内在或外在原因而丧失功能。"
    }
  ]
}