{
  "word": "incident",
  "pronunciation": "in·sidd·uhnt",
  "concise_definition": "n. 事件, 事变, (尤指) 不寻常或负面的事件",
  "forms": {
    "plural": "incidents"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An event or occurrence, especially one that is notable, unexpected, or significant, often in a negative or disruptive context.",
      "explanation_cn": "指一个事件或发生的情况，尤其指值得注意、出乎意料或具有重要意义的事件，常带有负面或干扰性的含义。",
      "example_en": "The protest turned into a violent incident when police intervened.",
      "example_cn": "当警察介入时，抗议活动演变成了一起暴力事件。"
    },
    {
      "pos": "noun",
      "explanation_en": "A minor or isolated occurrence, often used in formal or official reports to describe a specific happening without emotional connotation.",
      "explanation_cn": "指一个轻微或孤立的事件，常用于正式或官方报告中，以客观描述某一具体发生的情况，不带情感色彩。",
      "example_en": "There were three minor incidents reported during the festival, all resolved quickly.",
      "example_cn": "节日期间报告了三起轻微事件，均已迅速处理完毕。"
    },
    {
      "pos": "noun",
      "explanation_en": "A diplomatic or political event that may escalate tensions between nations or groups, often serving as a catalyst for larger conflict.",
      "explanation_cn": "指可能加剧国家或群体间紧张关系的外交或政治事件，常成为更大冲突的导火索。",
      "example_en": "The shooting of the ambassador was treated as a serious incident that threatened bilateral relations.",
      "example_cn": "大使遭枪击被视为一起严重事件，威胁到两国关系。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "event",
      "analysis": "“Event” (事件) 是一个中性词，泛指任何发生的事情，可以是正面、中性或负面的，如婚礼、会议、体育赛事。而 “incident” 更常用于指意外、不寻常或负面的事件，带有一定负面或异常的语义色彩。"
    },
    {
      "word_to_compare": "occurrence",
      "analysis": "“Occurrence” (发生) 与 “incident” 非常接近，都指某事的发生，但 “occurrence” 更中性、更广泛，常用于描述日常或自然发生的现象，如‘意外的发生’；而 ‘incident’ 更强调其重要性、突兀性或潜在后果，常用于正式或法律语境。"
    },
    {
      "word_to_compare": "accident",
      "analysis": "“Accident” (事故) 特指因疏忽或意外造成的伤害或损害，强调非故意性。而 “incident” 范围更广，可以包括事故，也可以包括故意行为（如袭击、抗议冲突），不一定涉及伤害。因此，所有事故都是事件，但并非所有事件都是事故。"
    }
  ]
}