{
  "word": "incorporate",
  "pronunciation": "in·kawr·puh·reyt",
  "concise_definition": "v. 合并, 包含, 组成公司",
  "forms": {
    "third_person_singular": "incorporates",
    "past_tense": "incorporated",
    "past_participle": "incorporated",
    "present_participle": "incorporating"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To include or integrate something as a part of a whole, especially to make it an essential or functional component.",
      "explanation_cn": "指将某事物作为组成部分纳入或整合到一个更大的整体中，使其成为其中不可或缺或功能性的部分。",
      "example_en": "The new design incorporates feedback from users to improve usability.",
      "example_cn": "新设计融入了用户的反馈，以提升可用性。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form a legal corporation by registering as a distinct legal entity, typically with shareholders and limited liability.",
      "explanation_cn": "指通过注册成为具有独立法人资格的公司，通常拥有股东并享有有限责任。",
      "example_en": "They decided to incorporate their startup to attract investors and limit personal risk.",
      "example_cn": "他们决定将初创公司注册为法人实体，以吸引投资者并降低个人风险。"
    },
    {
      "pos": "verb",
      "explanation_en": "To combine or blend different elements, ideas, or styles into a unified whole, often to enhance coherence or effectiveness.",
      "explanation_cn": "指将不同的元素、想法或风格融合成一个统一的整体，通常是为了增强一致性或有效性。",
      "example_en": "The chef incorporated Asian flavors into the traditional Italian recipe.",
      "example_cn": "这位厨师将亚洲风味融入了传统的意大利菜谱中。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "include",
      "analysis": "“Include” (包含) 是一个更通用的词，仅表示某事物是整体的一部分，但不强调整合的深度或结构性变化。而 “incorporate” 暗示更紧密、更系统的融合，常涉及功能或结构上的改变。例如，一份清单包含苹果，但一个食谱融合了苹果作为核心成分。"
    },
    {
      "word_to_compare": "integrate",
      "analysis": "“Integrate” (整合) 与 “incorporate” 非常接近，都强调将部分融入整体。但 “integrate” 更常用于系统、流程或人群的协调统一，强调和谐运作；而 “incorporate” 更侧重于物质或抽象元素的实质性加入，有时带有法律或组织层面的含义（如成立公司）。"
    },
    {
      "word_to_compare": "combine",
      "analysis": "“Combine” (合并) 指将两个或多个事物放在一起，但不一定形成一个有机整体，可能只是简单叠加。而 “incorporate” 强调融合后形成一个具有新功能或新身份的整体，如将技术融入产品，或把个人业务注册为公司。"
    }
  ]
}