{
  "word": "incorporating",
  "pronunciation": "in·kawr·puh·reyt·ing",
  "concise_definition": "v. 合并, 纳入, 包含",
  "forms": {
    "base_form": "incorporate",
    "third_person_singular": "incorporates",
    "past_tense": "incorporated",
    "past_participle": "incorporated",
    "present_participle": "incorporating"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To take in or include something as part of a whole, especially to integrate elements into an existing structure, system, or entity.",
      "explanation_cn": "指将某事物作为组成部分纳入或整合到一个更大的整体、结构、系统或实体中。",
      "example_en": "The new design is incorporating feedback from users to improve usability.",
      "example_cn": "新设计正在纳入用户的反馈以提升可用性。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form a legal corporation by registering as a distinct legal entity, typically with shareholders and limited liability.",
      "explanation_cn": "指通过注册成为具有独立法人资格的公司，通常拥有股东并享有有限责任。",
      "example_en": "They decided to incorporate their startup to protect personal assets from business liabilities.",
      "example_cn": "他们决定将初创公司注册为法人实体，以保护个人资产免受商业债务影响。"
    },
    {
      "pos": "verb",
      "explanation_en": "To combine or blend different elements, ideas, or styles into a unified whole, often to enhance coherence or functionality.",
      "explanation_cn": "指将不同的元素、想法或风格融合成一个统一的整体，通常为了增强一致性或功能性。",
      "example_en": "The chef is incorporating traditional spices into modern cuisine.",
      "example_cn": "这位厨师正在将传统香料融入现代菜肴中。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "include",
      "analysis": "“Include” (包含) 是一个更通用的词，仅表示某事物是整体的一部分，不强调整合或结构上的融合。而 “incorporating” 暗示更深层次的整合，常涉及结构、系统或体系的改变，具有更强的主动性和系统性。"
    },
    {
      "word_to_compare": "integrate",
      "analysis": "“Integrate” (整合) 与 “incorporating” 非常接近，都强调将不同部分融合为协调的整体。但 “integrate” 更侧重于使各部分和谐运作，常用于技术、社会或组织系统；而 “incorporating” 更常用于法律实体创建或内容吸收，语义范围更广。"
    },
    {
      "word_to_compare": "absorb",
      "analysis": "“Absorb” (吸收) 强调某事物被另一事物完全吞没或同化，原主体可能失去独立性。而 “incorporating” 保留了被纳入部分的独立特征，只是将其作为组成部分纳入更大体系，不意味着完全消失或改变本质。"
    }
  ]
}