{
  "word": "indecent",
  "pronunciation": "in·di·sint",
  "concise_definition": "adj. 不雅的, 无礼的, 有伤风化的",
  "forms": {
    "comparative": "indecenter",
    "superlative": "indecentest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Not in accordance with accepted standards of morality or propriety, especially in terms of sexual content or language; offensive to public sense of decency.",
      "explanation_cn": "不符合社会公认的道德或礼仪标准，尤其指涉及性内容或语言时，有伤风化、令人反感。",
      "example_en": "The movie was banned for containing indecent scenes that violated community standards.",
      "example_cn": "这部电影因包含违反社会公序良俗的不雅场景而被禁映。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Excessively low or revealing in dress or behavior, especially in a way that is considered inappropriate for the context or setting.",
      "explanation_cn": "衣着或行为过于暴露或轻浮，尤其在特定场合下被认为不合时宜。",
      "example_en": "She was reprimanded for wearing an indecent outfit to the formal dinner.",
      "example_cn": "她因穿着过于暴露的服装参加正式晚宴而受到训斥。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Unreasonably high or excessive, especially when referring to prices, demands, or amounts; shockingly disproportionate.",
      "explanation_cn": "（尤指价格、要求或数量）过分、不合理，达到令人震惊的失衡程度。",
      "example_en": "The company was accused of charging indecent prices for basic medical supplies.",
      "example_cn": "该公司因对基本医疗用品收取天价费用而遭到指控。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "improper",
      "analysis": "“Improper”（不恰当的）范围更广，泛指不符合规范、礼仪或情境的行为或事物，不一定涉及性或道德层面。而 “indecent” 更特指违反性道德或公共 decency（得体）标准，语义更强烈、更具道德谴责意味。"
    },
    {
      "word_to_compare": "obscene",
      "analysis": "“Obscene”（淫秽的）比 “indecent” 更严重，通常指极端露骨、煽动性或令人极度反感的性内容，常用于法律语境（如淫秽物品）。而 “indecent” 可用于较轻微的不当行为，如穿着或言语，不一定达到法律定义的‘淫秽’程度。"
    },
    {
      "word_to_compare": "vulgar",
      "analysis": "“Vulgar”（粗俗的）强调缺乏教养、品味低下，常用于描述语言、举止或审美上的庸俗，可能带有阶级偏见色彩。而 “indecent” 更侧重于违反社会道德或得体标准，尤其在性或身体暴露方面，语义更聚焦于‘不得体’而非‘低俗’。"
    }
  ]
}