{
  "word": "indie",
  "pronunciation": "in·dee",
  "concise_definition": "adj. 独立的, 非主流的; n. 独立音乐人, 独立电影制作人",
  "forms": {
    "comparative": "indier",
    "superlative": "indiest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Produced or created independently, especially without the financial or creative control of major commercial corporations or mainstream institutions.",
      "explanation_cn": "指在没有大型商业公司或主流机构的财务或创作控制下独立制作或创作的，常用于音乐、电影、出版等领域。",
      "example_en": "She released her first album as an indie artist, self-producing every track.",
      "example_cn": "她以独立音乐人的身份发行了首张专辑，亲自制作了每一首曲目。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by a distinctive, unconventional, or non-mainstream style, often associated with artistic authenticity and creative freedom.",
      "explanation_cn": "具有独特、非传统或非主流的风格，常与艺术真实性及创作自由相关联。",
      "example_en": "The film has an indie aesthetic—raw, intimate, and shot on a shoestring budget.",
      "example_cn": "这部电影具有独立电影的美学风格——真实、亲密，且预算极低。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who creates and distributes music, films, or other art independently, outside the traditional commercial system.",
      "explanation_cn": "指在传统商业体系之外独立创作并发行音乐、电影或其他艺术作品的人。",
      "example_en": "He's a beloved indie in the underground music scene, known for his poetic lyrics and lo-fi sound.",
      "example_cn": "他是地下音乐圈备受喜爱的独立音乐人，以诗意的歌词和低保真音效著称。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "independent",
      "analysis": "“Independent” (独立的) 是一个更广泛、更正式的术语，适用于任何不依赖外部控制的实体，如公司、国家或个人。而 “indie” 是其非正式、文化语境下的缩略形式，特指艺术创作领域中带有反主流、小众审美倾向的独立创作者或作品。"
    },
    {
      "word_to_compare": "alternative",
      "analysis": "“Alternative” (另类的) 强调与主流形式的对立或差异，但不一定意味着独立制作。例如，主流唱片公司也可以发行“另类摇滚”专辑。而 “indie” 更强调制作方式的自主性，而非仅仅风格的非主流。"
    },
    {
      "word_to_compare": "underground",
      "analysis": "“Underground” (地下) 指那些被主流文化排斥、处于边缘或秘密传播的作品或群体，常带有政治或反叛色彩。而 “indie” 不一定具有反叛性，更多是强调创作自主和小众美学，许多 indie 作品如今已被主流市场接纳。"
    }
  ]
}