{
  "word": "individual",
  "pronunciation": "in·duh·vid·yoo·uhl",
  "concise_definition": "n. 个人, 个体; adj. 单独的, 个别的, 个人的",
  "forms": {
    "plural": "individuals"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A single human being, considered separately from a group or society, emphasizing personal identity, autonomy, or uniqueness.",
      "explanation_cn": "指一个单独的人，与群体或社会相区分，强调其个人身份、自主性或独特性。",
      "example_en": "Each individual has the right to express their opinions freely.",
      "example_cn": "每个人都有权自由表达自己的观点。"
    },
    {
      "pos": "noun",
      "explanation_en": "A single organism or entity in biology, distinguished from others of its kind, often used in genetics or ecology.",
      "explanation_cn": "在生物学中指一个与同类相区别的单一生物体或实体，常用于遗传学或生态学语境。",
      "example_en": "The study tracked the behavior of 50 individual wolves in the wild.",
      "example_cn": "这项研究追踪了野外50只独立狼的行为。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Not shared or collective; belonging to or affecting one person or thing alone.",
      "explanation_cn": "非共享或集体的；属于或影响单独一个人或事物的。",
      "example_en": "She prefers to work on individual projects rather than in teams.",
      "example_cn": "她更喜欢独立完成项目，而不是团队合作。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Distinctive or unique in character, appearance, or behavior; not conforming to a general pattern.",
      "explanation_cn": "在性格、外貌或行为上具有独特性；不遵循一般模式的。",
      "example_en": "His individual style of painting made him famous in the art world.",
      "example_cn": "他独特的绘画风格使他在艺术界声名鹊起。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "person",
      "analysis": "“Person” (人) 是一个更通用、更中性的词，泛指人类个体，常用于法律、社会或日常语境，不强调独特性或独立性。而 “individual” 更突出个人与群体的分离，带有更强的哲学或社会学意味，常用于强调权利、自由或个性。"
    },
    {
      "word_to_compare": "single",
      "analysis": "“Single” (单一的) 主要强调数量上的“一个”，常用于描述状态（如单身、单件物品），不涉及人格或自主性。而 “individual” 不仅指数量，更强调作为独立实体的存在和特性，具有主观能动性。"
    },
    {
      "word_to_compare": "unique",
      "analysis": "“Unique” (独特的) 强调独一无二、无可比拟的特质，是绝对意义上的“唯一”。而 “individual” 可以指一个独立的个体，但不一定独一无二；它强调的是“个体性”而非“唯一性”。一个个体可以是独特的，但并非所有个体都是唯一的。"
    }
  ]
}