{
  "word": "indigenous",
  "pronunciation": "in·dij·uh·nuhs",
  "concise_definition": "adj. 原生的, 本土的, 土著的",
  "forms": {
    "comparative": "more indigenous",
    "superlative": "most indigenous"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Originating or occurring naturally in a particular place; not introduced from elsewhere; native to a specific region or environment.",
      "explanation_cn": "指在某一特定地区自然产生或存在的，非外来引入的；属于某地的原生物种或原住民。",
      "example_en": "The indigenous people of Australia are known as Aboriginal Australians.",
      "example_cn": "澳大利亚的原住民被称为澳大利亚原住民。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characteristic of or belonging to the original inhabitants of a land, especially in the context of cultural, linguistic, or social traditions that predate colonization or external influence.",
      "explanation_cn": "指属于某地原住民的特征，尤其在文化、语言或社会传统方面，早于殖民或外来影响而存在。",
      "example_en": "Indigenous knowledge systems often include sustainable practices passed down through generations.",
      "example_cn": "土著知识体系通常包含代代相传的可持续实践。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Naturally occurring in a particular area, especially referring to plants or animals that have evolved in that ecosystem without human introduction.",
      "explanation_cn": "指在某一地区自然出现的，尤指在该生态系统中未经人类引入而自然演化出的动植物。",
      "example_en": "This region is home to many indigenous plant species that cannot be found anywhere else in the world.",
      "example_cn": "这一地区拥有许多其他地方找不到的本土植物物种。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "native",
      "analysis": "“Native”（原生的）与 “indigenous” 非常接近，常可互换，但 “native” 用法更广泛，可用于人、动植物甚至语言，且语气较中性；而 “indigenous” 更强调与土地的历史性、文化性联系，尤其在涉及原住民权利和殖民历史时，具有更强的政治与社会语境。"
    },
    {
      "word_to_compare": "local",
      "analysis": "“Local”（当地的）仅指地理上靠近说话者或特定区域，不涉及历史渊源或自然演化。一个外来物种在本地生长仍可称为 “local”，但绝非 “indigenous”。例如，外来移民在本地生活是 “local resident”，但不是 “indigenous people”。"
    },
    {
      "word_to_compare": "autochthonous",
      "analysis": "“Autochthonous”（土生土长的）是 “indigenous” 的学术性同义词，多用于地质学、人类学或生物学文献，强调完全源于本地、非迁徙或非引入。它比 “indigenous” 更专业、更罕见，日常语境中极少使用。"
    }
  ]
}