{
  "word": "indonesian",
  "pronunciation": "in·duh·neezh·uhn",
  "concise_definition": "adj. 印度尼西亚的, n. 印度尼西亚人, 印度尼西亚语",
  "forms": {
    "plural": "indonesians"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or originating from Indonesia, the Southeast Asian country consisting of thousands of islands, including Java, Sumatra, and Bali.",
      "explanation_cn": "与印度尼西亚有关的或源自印度尼西亚的，印度尼西亚是位于东南亚、由数千个岛屿（包括爪哇岛、苏门答腊岛和巴厘岛）组成的国家。",
      "example_en": "Indonesian cuisine is known for its rich spices and diverse regional flavors.",
      "example_cn": "印度尼西亚菜以其丰富的香料和多样的地方风味而闻名。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is a native or citizen of Indonesia.",
      "explanation_cn": "印度尼西亚的原住民或公民。",
      "example_en": "Many Indonesian artists have gained international recognition for their traditional batik textiles.",
      "example_cn": "许多印度尼西亚艺术家因其传统的蜡染纺织品而获得国际认可。"
    },
    {
      "pos": "noun",
      "explanation_en": "The official language of Indonesia, a standardized form of Malay that uses the Latin alphabet and is spoken by over 270 million people.",
      "explanation_cn": "印度尼西亚的官方语言，是马来语的一种标准化形式，使用拉丁字母书写，使用者超过2.7亿人。",
      "example_en": "Although hundreds of local languages are spoken across the archipelago, Indonesian is used in government, education, and media.",
      "example_cn": "尽管群岛各地有数百种地方语言，但印度尼西亚语被用于政府、教育和媒体。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "malay",
      "analysis": "“Malay”（马来语）是印度尼西亚语的前身和语言基础，主要在马来西亚、文莱和新加坡使用。虽然两者高度相似，但印度尼西亚语在词汇上吸收了更多荷兰语和本地方言的影响，拼写和语法也经过官方标准化，而马来语保留了更多传统形式。"
    },
    {
      "word_to_compare": "javanese",
      "analysis": "“Javanese”（爪哇语）是印度尼西亚最大的民族语言，主要在爪哇岛使用，拥有复杂的敬语体系和丰富的文学传统。它与印度尼西亚语不同，不是官方语言，而是地方母语。印度尼西亚语作为国家通用语，旨在统一多民族的语言环境，而爪哇语则承载着特定族群的文化身份。"
    },
    {
      "word_to_compare": "filipino",
      "analysis": "“Filipino”（菲律宾语）是菲律宾的官方语言，以他加禄语为基础，融合了西班牙语、英语和本地语言元素。虽然印度尼西亚语和菲律宾语同属南岛语系，且历史上受马来语影响，但菲律宾语因殖民历史而大量借用西班牙语词汇，而印度尼西亚语则受荷兰语影响更深，两者在词汇和语音系统上差异显著。"
    }
  ]
}