{
  "word": "indulgence",
  "pronunciation": "in·dul·jəns",
  "concise_definition": "n. 放纵, 奢侈, 妥协, 赦罪",
  "forms": {
    "plural": "indulgences"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of allowing oneself or someone else to enjoy something pleasurable, often to an excessive or unrestrained degree, especially when it is considered a luxury or a minor moral failing.",
      "explanation_cn": "指允许自己或他人享受某种愉悦的事物，常达到过度或无节制的程度，尤其当这种享受被视为一种奢侈或轻微的道德过失时。",
      "example_en": "She allowed herself the indulgence of a weekend spa retreat after months of hard work.",
      "example_cn": "经过数月的辛勤工作，她允许自己享受一次周末水疗度假。"
    },
    {
      "pos": "noun",
      "explanation_en": "A lenient or permissive attitude toward someone's behavior, especially when it is undesirable or inappropriate.",
      "explanation_cn": "指对某人的行为采取宽容或放任的态度，尤其当这种行为是不理想或不恰当的时候。",
      "example_en": "His parents' indulgence of his bad habits made it difficult for him to develop discipline.",
      "example_cn": "他父母对他不良习惯的纵容使他难以培养自律。"
    },
    {
      "pos": "noun",
      "explanation_en": "In historical religious contexts, a pardon granted by the Catholic Church that reduces the temporal punishment for sins already forgiven.",
      "explanation_cn": "在历史宗教语境中，指天主教会颁发的赦免，用于减免已赦免之罪的暂时性惩罚（如炼狱中的刑罚）。",
      "example_en": "In the Middle Ages, the sale of indulgences became a major point of controversy in the Protestant Reformation.",
      "example_cn": "中世纪时，出售赎罪券成为宗教改革时期的主要争议点之一。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "luxury",
      "analysis": "“Luxury”（奢侈）强调的是昂贵、高品质或非必需的享受本身，是一个名词性事物（如豪华轿车、五星级酒店）；而 “indulgence” 强调的是对这种享受的“放纵行为”或“允许自己沉溺”的主观态度，更侧重于行为的过度性与道德上的妥协。"
    },
    {
      "word_to_compare": "permissiveness",
      "analysis": "“Permissiveness”（放任）是一个更广泛、更抽象的术语，指一种允许自由行为的总体态度或制度，常用于教育或社会规范语境；而 “indulgence” 更具体，通常指对某一次或某一类具体行为的纵容，带有情感色彩，常含贬义或自责意味。"
    },
    {
      "word_to_compare": "sin",
      "analysis": "“Sin”（罪过）指违反道德或宗教律法的行为本身，是客观的过失；而 “indulgence” 可以是导致罪过的行为（如放纵食欲），也可以是教会为减轻罪罚而给予的赦免，其语义范围更广，既可指行为，也可指制度性赦免。"
    }
  ]
}