{
  "word": "indulge",
  "pronunciation": "in·dulj",
  "concise_definition": "v. 纵容, 沉溺, 满足, 让步",
  "forms": {
    "third_person_singular": "indulges",
    "past_tense": "indulged",
    "past_participle": "indulged",
    "present_participle": "indulging"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To allow oneself or someone else to enjoy something pleasurable, often to an excessive or unrestrained degree, especially when it may be considered a luxury or a weakness.",
      "explanation_cn": "允许自己或他人享受某种令人愉悦的事物，常常达到过度或无节制的程度，尤其当这种享受被视为奢侈或弱点时。",
      "example_en": "She indulged in a chocolate cake after a long week of dieting.",
      "example_cn": "经过一周的节食，她纵容自己吃了一块巧克力蛋糕。"
    },
    {
      "pos": "verb",
      "explanation_en": "To yield to someone's wishes or demands, especially out of affection, pity, or weakness, often enabling undesirable behavior.",
      "explanation_cn": "出于喜爱、怜悯或软弱而顺从某人的愿望或要求，常常助长不良行为。",
      "example_en": "Her grandparents always indulged her with toys and sweets, making her spoiled.",
      "example_cn": "她的祖父母总是用玩具和糖果纵容她，使她变得骄纵。"
    },
    {
      "pos": "verb",
      "explanation_en": "To allow oneself to engage in a particular thought, feeling, or fantasy, often without restraint.",
      "explanation_cn": "允许自己沉溺于某种想法、情感或幻想中，通常毫无节制。",
      "example_en": "He indulged in daydreams about quitting his job and traveling the world.",
      "example_cn": "他沉溺于幻想中，想象着辞掉工作、环游世界。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pamper",
      "analysis": "“Pamper” (溺爱/娇惯) 通常用于对人（尤其是孩子或伴侣）提供过度的照顾和舒适，强调物质或身体上的优待，带有明显的关爱色彩。而 “indulge” 更广泛，可指满足欲望、放纵行为，不一定包含关爱意图，有时甚至带有负面评价。"
    },
    {
      "word_to_compare": "yield",
      "analysis": "“Yield” (让步/屈服) 指在压力、要求或权威下放弃立场或控制，常带有被迫或妥协的意味。而 “indulge” 更强调主动的、出于情感或软弱的让步，通常不涉及权力对抗，而是自愿满足他人或自己。"
    },
    {
      "word_to_compare": "surrender",
      "analysis": "“Surrender” (投降/屈从) 意味着完全放弃抵抗或控制，常用于战争、斗争或原则性立场，语义强烈且正式。而 “indulge” 是一种温和的、非对抗性的放任，通常不涉及原则的放弃，仅是对欲望或情绪的顺从。"
    }
  ]
}