{
  "word": "induction",
  "pronunciation": "in·duk·shun",
  "concise_definition": "n. 入职, 归纳, 电磁感应, 促成",
  "forms": {
    "plural": "inductions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of formally introducing someone to a new role, organization, or position, often involving orientation and training.",
      "explanation_cn": "指正式将某人引入新角色、组织或职位的过程，通常包括入职引导和培训。",
      "example_en": "The new employees attended a week-long induction program before starting their jobs.",
      "example_cn": "新员工在上岗前参加了为期一周的入职培训。"
    },
    {
      "pos": "noun",
      "explanation_en": "A method of reasoning in which general principles are derived from specific observations or instances; reasoning from the particular to the general.",
      "explanation_cn": "一种推理方法，通过具体观察或实例推导出一般性原则，即从特殊到一般的推理。",
      "example_en": "Scientists use induction to formulate theories based on repeated experimental results.",
      "example_cn": "科学家通过重复的实验结果，运用归纳法形成理论。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process by which an electric current is generated in a conductor by a changing magnetic field, as described by Faraday's law.",
      "explanation_cn": "指根据法拉第定律，通过变化的磁场在导体中产生电流的过程。",
      "example_en": "Wireless charging relies on electromagnetic induction to transfer energy without physical contact.",
      "example_cn": "无线充电依靠电磁感应实现无接触的能量传输。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of causing something to begin or come into existence, especially through influence or persuasion.",
      "explanation_cn": "指通过影响或劝说促使某事物开始或产生，尤指促成某种状态或行为的发生。",
      "example_en": "His speech was an induction into a new era of environmental awareness.",
      "example_cn": "他的演讲促成了一种新的环保意识时代的开启。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "introduction",
      "analysis": "“Introduction” (介绍/引入) 侧重于初次呈现或使某人/某物为人所知，通常不包含系统性培训或正式程序。而 “induction” 更强调正式、结构化的进入过程，尤其在组织或职业语境中，具有制度性含义。"
    },
    {
      "word_to_compare": "inference",
      "analysis": "“Inference” (推论) 是指从已知前提中逻辑推导出结论，通常是演绎推理的结果；而 “induction” 是从多个具体案例中总结出一般规律，属于归纳推理。两者是逻辑学中相反的推理方向。"
    },
    {
      "word_to_compare": "initiation",
      "analysis": "“Initiation” (启动/入会) 强调开始一个过程或加入一个团体，常带有仪式性或象征性，如宗教入教仪式。而 “induction” 更侧重于功能性、程序性的正式接纳，尤其在职场或学术环境中，更强调适应与培训。"
    }
  ]
}