{
  "word": "industrial",
  "pronunciation": "in·dus·tree·uhl",
  "concise_definition": "adj. 工业的, 工业化的, 工厂的",
  "forms": {
    "comparative": "more industrial",
    "superlative": "most industrial"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characterized by industry, especially large-scale manufacturing, production, or mechanical operations; involving factories, machinery, and mass production.",
      "explanation_cn": "与工业相关或以工业为特征的，尤指大规模制造、生产或机械操作；涉及工厂、机械和批量生产。",
      "example_en": "The region has become a major industrial center with hundreds of factories.",
      "example_cn": "该地区已成为拥有数百家工厂的重要工业中心。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Designed for or used in industrial settings, often implying heavy-duty, functional, and utilitarian qualities rather than aesthetic ones.",
      "explanation_cn": "专为工业环境设计或使用的，通常暗示其具有坚固、实用、功能性强的特点，而非注重美观。",
      "example_en": "She prefers industrial-style lighting with exposed bulbs and metal fixtures.",
      "example_cn": "她更喜欢带有裸露灯泡和金属配件的工业风格照明。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to the working class or labor force engaged in manufacturing and production, often used in sociopolitical contexts.",
      "explanation_cn": "与从事制造和生产的工人阶级或劳动力相关的，常用于社会政治语境中。",
      "example_en": "The union fought for better industrial conditions and fair wages for factory workers.",
      "example_cn": "工会为改善工厂工人的工作条件和公平工资而斗争。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "manufacturing",
      "analysis": "“Manufacturing” (制造) 是一个名词或动词，特指将原材料转化为成品的物理生产过程，是一个具体的行为或行业。而 “industrial” 是形容词，范围更广，涵盖整个工业体系，包括能源、运输、设备、管理等，不仅限于制造环节。"
    },
    {
      "word_to_compare": "mechanical",
      "analysis": "“Mechanical” (机械的) 强调与机器、物理装置或自动运作相关，侧重于技术原理和运动机制。而 “industrial” 强调的是规模、系统性和经济结构，可能包含非机械的元素（如化工、电力、物流）。一个工业过程可能涉及机械，但并非所有机械过程都是工业的。"
    },
    {
      "word_to_compare": "urban",
      "analysis": "“Urban” (城市的) 描述的是人口密集、基础设施发达的地区，强调地理和社会结构。虽然工业区常位于城市中，但 “industrial” 关注的是经济活动类型（生产制造），而 “urban” 关注的是居住形态和城市化程度。一个地区可以是工业的但非城市（如偏远工业园区），也可以是城市的但非工业的（如金融中心）。"
    }
  ]
}