{
  "word": "infiltrate",
  "pronunciation": "in·fih·luh·trayt",
  "concise_definition": "v. 渗透, 潜入, 侵入",
  "forms": {
    "third_person_singular": "infiltrates",
    "past_tense": "infiltrated",
    "past_participle": "infiltrated",
    "present_participle": "infiltrating"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To secretly enter or gain access to an organization, system, or group, typically to gather information or undermine it from within.",
      "explanation_cn": "指秘密进入某个组织、系统或团体，通常是为了收集情报或从内部破坏它。",
      "example_en": "The spy infiltrated the enemy's command center by posing as a maintenance worker.",
      "example_cn": "这名间谍伪装成维修工人，潜入了敌方指挥中心。"
    },
    {
      "pos": "verb",
      "explanation_en": "To gradually and stealthily spread into or become established within a place, system, or culture, often in an unwanted or harmful way.",
      "explanation_cn": "指缓慢而隐蔽地渗透进某个地方、系统或文化中，通常带有负面或有害的性质。",
      "example_en": "Corrupt practices have infiltrated the public administration over the years.",
      "example_cn": "多年来，腐败行为已渗透进公共行政体系。"
    },
    {
      "pos": "verb",
      "explanation_en": "To penetrate or pass through a barrier, such as a physical structure or defensive line, often unnoticed.",
      "explanation_cn": "指穿过某种屏障（如物理结构或防御线）而不被察觉。",
      "example_en": "Cold air infiltrated the poorly insulated house through cracks in the windows.",
      "example_cn": "冷空气通过窗户的裂缝悄悄渗入了隔热不良的房屋。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "invade",
      "analysis": "“Invade” (入侵) 通常指通过武力或大规模行动强行进入并占领某地，强调公开性和力量优势。而 “infiltrate” 强调隐蔽、低调、个体或小规模的渗透，往往不被察觉，更侧重于内部瓦解而非外部强攻。"
    },
    {
      "word_to_compare": "intrude",
      "analysis": "“Intrude” (闯入) 指未经允许进入某个私人空间或领域，常带有冒犯或打扰的意味，但不一定具有恶意目的或长期渗透意图。而 “infiltrate” 通常隐含长期潜伏、获取利益或破坏的意图，更具策略性和系统性。"
    },
    {
      "word_to_compare": "penetrate",
      "analysis": "“Penetrate” (穿透) 是一个更中性的词，可指物理上穿过障碍物（如光线穿透玻璃），也可用于抽象语境（如信息渗透）。它不必然包含秘密或敌对意图。而 “infiltrate” 特指有目的、有策略地潜入组织或系统，常用于政治、军事或社会语境，带有负面或操纵性含义。"
    }
  ]
}