{
  "word": "inject",
  "pronunciation": "in·jekt",
  "concise_definition": "v. 注射, 注入, 插入",
  "forms": {
    "third_person_singular": "injects",
    "past_tense": "injected",
    "past_participle": "injected",
    "present_participle": "injecting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To force a substance, especially a liquid or gas, into a body or system through a needle or tube, typically for medical or technical purposes.",
      "explanation_cn": "指通过针头或管道将液体、气体等物质强制注入体内或系统中，通常用于医疗或技术目的。",
      "example_en": "The nurse injected the vaccine into the patient's arm.",
      "example_cn": "护士将疫苗注射到病人的手臂中。"
    },
    {
      "pos": "verb",
      "explanation_en": "To introduce or insert something, especially an idea, element, or influence, into a situation, conversation, or system, often unexpectedly or deliberately.",
      "explanation_cn": "指将某种思想、元素或影响有意或意外地引入某种情境、对话或系统中。",
      "example_en": "The director injected humor into the serious drama to lighten the mood.",
      "example_cn": "导演在严肃的剧情中加入了幽默元素，以缓和气氛。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to be rapidly introduced or inserted into a process or context, often to achieve a specific effect or correction.",
      "explanation_cn": "指迅速将某物引入某一过程或语境中，通常是为了实现特定效果或进行修正。",
      "example_en": "The government injected billions of dollars into the economy to prevent a recession.",
      "example_cn": "政府向经济注入了数十亿美元，以防止经济衰退。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "infuse",
      "analysis": "“Infuse” (注入) 强调缓慢、渐进地将某种抽象品质（如精神、活力、风味）融入某物中，常用于比喻语境，如“infuse hope”（注入希望）。而 “inject” 更强调动作的突然性、强制性和物理性，常用于具体物质或紧急干预。"
    },
    {
      "word_to_compare": "introduce",
      "analysis": "“Introduce” (引入) 是一个更中性、通用的词，指使某物首次出现或进入某个环境，不带有强制或注入的意味。例如“introduce a new policy”（引入新政策）。而 “inject” 暗示了主动、有力甚至干预性的插入行为，常带有目的性或紧迫感。"
    },
    {
      "word_to_compare": "pump",
      "analysis": "“Pump” (泵送) 指通过机械装置持续输送液体或气体，强调过程的连续性和动力来源，如“pump water into a tank”。而 “inject” 更强调瞬间的、点对点的插入动作，通常是一次性或短时的，且常用于医疗或抽象语境。"
    }
  ]
}