{
  "word": "injuring",
  "pronunciation": "in·joo·ring",
  "concise_definition": "v. 伤害, 损害, 使受伤",
  "forms": {
    "base_form": "injure",
    "third_person_singular": "injures",
    "past_tense": "injured",
    "past_participle": "injured",
    "present_participle": "injuring"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To cause physical harm or damage to a person or animal, often resulting in pain, impairment, or injury to body parts or organs.",
      "explanation_cn": "指对人或动物造成身体上的伤害或损害，通常导致疼痛、功能障碍或器官受损。",
      "example_en": "The athlete was injured during the final match and had to withdraw from the competition.",
      "example_cn": "这位运动员在决赛中受伤，不得不退出比赛。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause harm or damage to something abstract, such as a reputation, relationship, or interest, often through careless or intentional actions.",
      "explanation_cn": "指通过疏忽或故意的行为，对抽象事物（如声誉、关系或利益）造成损害。",
      "example_en": "His reckless comments were injuring the company's public image.",
      "example_cn": "他轻率的言论正在损害公司的公众形象。"
    },
    {
      "pos": "verb",
      "explanation_en": "To impair or negatively affect the functioning, integrity, or value of something, whether tangible or intangible.",
      "explanation_cn": "指削弱、损害某物的功能、完整性或价值，无论该物是具体的还是抽象的。",
      "example_en": "The prolonged drought was injuring the crops and threatening food supplies.",
      "example_cn": "持续的干旱正在损害庄稼，威胁粮食供应。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "harming",
      "analysis": "“Harming” (伤害) 是一个更广泛、更抽象的词，可指任何形式的损害，包括心理、情感或环境层面，不一定涉及身体创伤。而 “injuring” 更常用于指具体的、尤其是身体上的伤害，语义范围较窄但更具体。"
    },
    {
      "word_to_compare": "wounding",
      "analysis": "“Wounding” (使受伤) 通常特指由外力（如刀、枪、撞击）造成的开放性或穿透性身体伤害，常带有暴力或战斗语境。而 “injuring” 是更中性的通用词，可涵盖骨折、扭伤、烧伤等非开放性损伤，适用范围更广。"
    },
    {
      "word_to_compare": "damaging",
      "analysis": "“Damaging” (损害) 主要用于物体、系统、环境或抽象概念（如声誉、信用），强调功能或价值的降低。而 “injuring” 更常用于生命体（人或动物）的生理伤害，虽然也可用于抽象事物，但其核心语义仍以身体伤害为主。"
    }
  ]
}