{
  "word": "injured",
  "pronunciation": "in·joo·rid",
  "concise_definition": "adj. 受伤的, 受损害的; v. 伤害 (injure 的过去式和过去分词)",
  "forms": {
    "base_form": "injure",
    "third_person_singular": "injures",
    "past_tense": "injured",
    "past_participle": "injured",
    "present_participle": "injuring",
    "adjective_form": "injured"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Suffering physical harm or damage to the body, typically as a result of an accident, violence, or illness; not in a healthy or functional state due to trauma.",
      "explanation_cn": "因事故、暴力或疾病而遭受身体伤害或损害，处于不健康或功能受损的状态。",
      "example_en": "The injured player was carried off the field on a stretcher.",
      "example_cn": "受伤的球员被担架抬下了球场。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Suffering harm or damage in a non-physical sense, such as reputation, feelings, or rights; emotionally or socially harmed.",
      "explanation_cn": "在非身体层面遭受损害，如名誉、情感或权利受损；情感上或社会性地受到伤害。",
      "example_en": "The scandal left his reputation seriously injured.",
      "example_cn": "这起丑闻严重损害了他的声誉。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause physical harm or damage to someone or something, often unexpectedly or through force.",
      "explanation_cn": "对某人或某物造成身体上的伤害或损害，通常是非预期的或通过外力造成的。",
      "example_en": "He injured his ankle during the basketball game.",
      "example_cn": "他在打篮球时扭伤了脚踝。"
    },
    {
      "pos": "verb",
      "explanation_en": "To harm someone’s feelings, rights, or interests, often unintentionally or through neglect.",
      "explanation_cn": "无意中或因疏忽而伤害他人的感情、权利或利益。",
      "example_en": "The policy injured the interests of small businesses.",
      "example_cn": "这项政策损害了小企业的利益。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "wounded",
      "analysis": "“Wounded” (负伤的) 通常特指因暴力、战争或武器造成的身体伤害，带有更强烈的军事或攻击性语境，如枪伤、刀伤。而 “injured” 适用范围更广，包括意外、运动、疾病等非暴力原因造成的伤害。"
    },
    {
      "word_to_compare": "hurt",
      "analysis": "“Hurt” (疼痛/受伤) 是更口语化、更通用的词，可指身体疼痛或情感伤害，但缺乏 “injured” 那种正式或结构性的损伤含义。例如，说 “I hurt my back” 更口语，而 “I was injured in a fall” 更正式且强调事件后果。"
    },
    {
      "word_to_compare": "damaged",
      "analysis": "“Damaged” (受损的) 主要用于物体、系统或抽象事物（如设备、声誉、关系），强调功能或完整性被破坏。而 “injured” 更常用于有生命体（人或动物）的身体或情感伤害，具有更强的生理或心理关联性。"
    }
  ]
}