{
  "word": "inorganic",
  "pronunciation": "in·or·gan·ik",
  "concise_definition": "adj. 无机的, 非有机的, 非生物的",
  "forms": {
    "comparative": "more inorganic",
    "superlative": "most inorganic"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Not derived from living organisms or containing carbon-hydrogen bonds; referring to substances such as minerals, metals, and salts that are not part of biological systems.",
      "explanation_cn": "非来源于生物体或不含碳氢键的；指矿物、金属、盐类等不属于生物系统的物质。",
      "example_en": "Inorganic compounds like sodium chloride and silicon dioxide are essential in industrial chemistry.",
      "example_cn": "氯化钠和二氧化硅等无机化合物在工业化学中至关重要。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Lacking the qualities associated with living things, such as warmth, emotion, or natural growth; describing something cold, mechanical, or unnatural.",
      "explanation_cn": "缺乏与生命相关的特质，如温暖、情感或自然生长；形容冷漠、机械或不自然的事物。",
      "example_en": "The room felt inorganic, with sterile white walls and no personal touches.",
      "example_cn": "房间显得毫无生气，墙壁是单调的白色，没有任何个人化的装饰。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Not involving or derived from biological processes; used in contexts such as agriculture or environmental science to distinguish synthetic from natural materials.",
      "explanation_cn": "不涉及或不来源于生物过程；常用于农业或环境科学中，以区分合成材料与天然材料。",
      "example_en": "Organic farmers avoid inorganic fertilizers that contain synthetic chemicals.",
      "example_cn": "有机农民避免使用含有合成化学物质的无机肥料。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "organic",
      "analysis": "“Organic”（有机的）指来源于生物体、含碳氢结构或与生命过程相关的物质，强调自然性与生物性；而 “inorganic” 则完全相反，指非生物来源、不含碳氢键的物质，常用于化学和农业语境中形成对立。"
    },
    {
      "word_to_compare": "synthetic",
      "analysis": "“Synthetic”（合成的）强调人为制造，与天然相对；虽然许多无机物是合成的，但并非所有无机物都是合成的（如天然矿物），也并非所有合成物都是无机的（如合成塑料是有机物）。两者有交叉但不等同。"
    },
    {
      "word_to_compare": "mineral",
      "analysis": "“Mineral”（矿物）是无机物的一个子集，特指自然界中形成的固体无机物，具有特定化学成分和晶体结构。而 “inorganic” 是更广泛的化学分类，包括气体、液体和非晶体无机物，如盐溶液或酸。"
    }
  ]
}