{
  "word": "inquisition",
  "pronunciation": "in·kwi·zish·uhn",
  "concise_definition": "n. 宗教裁判所, 严厉审问, 过度调查",
  "forms": {
    "plural": "inquisitions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A historical institution established by the Catholic Church to identify and punish heresy, often using harsh and coercive methods including torture and execution.",
      "explanation_cn": "指中世纪天主教会设立的机构，旨在识别和惩罚异端，常使用严酷且强制的手段，包括酷刑和处决。",
      "example_en": "The Spanish Inquisition was notorious for its brutal methods of extracting confessions.",
      "example_cn": "西班牙宗教裁判所以其残酷的逼供手段而臭名昭著。"
    },
    {
      "pos": "noun",
      "explanation_en": "A prolonged, aggressive, and often unjust interrogation or investigation, especially one that is overly intrusive or obsessive.",
      "explanation_cn": "指一种漫长、激烈且常常不公正的审问或调查，尤其指过度侵扰或执迷不悟的追问。",
      "example_en": "The media's inquisition into the politician's private life left him exhausted and humiliated.",
      "example_cn": "媒体对这位政客私生活的过度调查让他精疲力尽、颜面尽失。"
    },
    {
      "pos": "noun",
      "explanation_en": "A state or condition of intense scrutiny or persecution, metaphorically likened to the oppressive atmosphere of historical religious tribunals.",
      "explanation_cn": "指一种充满强烈审查或迫害的状态，隐喻性地类比于历史上宗教法庭的压迫氛围。",
      "example_en": "Living under the inquisition of constant surveillance made her feel like a criminal.",
      "example_cn": "在持续监视的压迫下生活，让她感觉自己像个罪犯。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "interrogation",
      "analysis": "“Interrogation”（审讯）是一个中性术语，泛指任何正式的提问过程，目的是获取信息，不一定带有压迫性或不公。而 “inquisition” 带有强烈负面含义，暗示滥用权力、残酷和不公正，常用于批评性语境。"
    },
    {
      "word_to_compare": "investigation",
      "analysis": "“Investigation”（调查）是系统性地收集事实以查明真相的过程，通常是合法且程序化的。而 “inquisition” 暗示调查过程已偏离理性，演变为压迫性、情绪化或政治化的迫害，强调手段而非目的。"
    },
    {
      "word_to_compare": "persecution",
      "analysis": "“Persecution”（迫害）指因宗教、政治、种族等原因对个人或群体进行系统性压迫，是一个更广泛的概念。而 “inquisition” 是一种具体的迫害机制或机构，常作为实施迫害的工具，因此是“迫害”的一种形式，但更具制度性和历史特定性。"
    }
  ]
}