{
  "word": "insert",
  "pronunciation": "in·surt",
  "concise_definition": "v. 插入, 嵌入, 加入; n. 插入物, 附页",
  "forms": {
    "third_person_singular": "inserts",
    "past_tense": "inserted",
    "past_participle": "inserted",
    "present_participle": "inserting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To put or force something into a space, opening, or position, often between or within other things.",
      "explanation_cn": "指将某物放入、塞入或强行置入某个空间、开口或位置，通常是在其他物体之间或内部。",
      "example_en": "She inserted the key into the lock and turned it.",
      "example_cn": "她把钥匙插入锁孔并转动了它。"
    },
    {
      "pos": "verb",
      "explanation_en": "To add or introduce something, especially text, media, or content, into a larger whole, such as a document, broadcast, or system.",
      "explanation_cn": "指在更大的整体（如文件、广播或系统）中添加或引入某物，尤其是文字、媒体或内容。",
      "example_en": "The editor inserted a footnote to clarify the historical reference.",
      "example_cn": "编辑添加了一条脚注以澄清历史引用。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to be included or incorporated, often unexpectedly or as an interruption.",
      "explanation_cn": "指使某物被包含或融入，常带有意外性或作为中断。",
      "example_en": "The director inserted a comedic scene to relieve the tension.",
      "example_cn": "导演插入了一个喜剧场景以缓解紧张气氛。"
    },
    {
      "pos": "noun",
      "explanation_en": "A separate piece of material, often printed, that is inserted into a publication, package, or container.",
      "explanation_cn": "指一张独立的材料（通常是印刷品），被插入到出版物、包装或容器中。",
      "example_en": "The magazine came with a free insert of concert tickets.",
      "example_cn": "这本杂志附赠了一张免费的演唱会门票附页。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "insert",
      "analysis": "“Insert” 强调将某物主动、有意识地放入一个已有结构中，常涉及物理或内容层面的嵌入，如插入钥匙、插入文本。它暗示了被插入物与原结构之间存在边界或分离。"
    },
    {
      "word_to_compare": "add",
      "analysis": "“Add” (添加) 更通用，指在原有基础上增加内容或数量，不强调物理位置或嵌入方式。例如添加糖、添加用户。而 “insert” 更具体，常暗示插入的位置或方式，如插入段落、插入芯片。"
    },
    {
      "word_to_compare": "embed",
      "analysis": "“Embed” (嵌入) 指将某物深度整合进另一个系统或结构中，使其成为整体不可分割的一部分，常用于技术语境（如嵌入代码、嵌入传感器）。而 “insert” 通常保持插入物的独立性，可被移除而不破坏原结构。"
    },
    {
      "word_to_compare": "introduce",
      "analysis": "“Introduce” (引入) 更侧重于首次呈现或使某物为人所知，常用于抽象概念（如引入新政策、引入新概念）。而 “insert” 更强调物理或结构上的放置行为，动作性更强。"
    }
  ]
}