{
  "word": "inspector",
  "pronunciation": "in·spek·tər",
  "concise_definition": "n. 检查员, 监督员, 侦探",
  "forms": {
    "plural": "inspectors"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person officially appointed to examine or inspect something, such as buildings, equipment, or systems, to ensure compliance with regulations, standards, or safety requirements.",
      "explanation_cn": "指被正式任命来检查建筑物、设备或系统等，以确保其符合法规、标准或安全要求的人员。",
      "example_en": "The building inspector found several code violations in the old apartment complex.",
      "example_cn": "建筑检查员在旧公寓楼中发现了多项违反规范的问题。"
    },
    {
      "pos": "noun",
      "explanation_en": "A police officer of a high rank, especially in British English, responsible for investigating crimes and managing investigations.",
      "explanation_cn": "指警察中较高阶的官员，尤其在英式英语中，负责调查犯罪案件并管理侦查工作。",
      "example_en": "Inspector Morse solved the mystery using his keen intuition and attention to detail.",
      "example_cn": "莫尔斯探长凭借敏锐的直觉和对细节的关注破解了这起谜案。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who supervises or monitors the quality or performance of a process, service, or product, often in industries like transportation, education, or health care.",
      "explanation_cn": "指监督或监控某一过程、服务或产品质量的人员，常见于交通、教育或医疗等行业。",
      "example_en": "The school inspector praised the teachers for their innovative teaching methods.",
      "example_cn": "学校督学称赞教师们采用了创新的教学方法。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "examiner",
      "analysis": "“Examiner”（考官/检查者）通常指专门评估或测试某人知识、能力或表现的人，如考试考官或学术评审员，其重点在于评判而非监督。而 “inspector” 更强调对设施、系统或操作的实地检查与合规性审查，带有行政或执法性质。"
    },
    {
      "word_to_compare": "auditor",
      "analysis": "“Auditor”（审计员）主要针对财务记录、账目或管理流程进行系统性审查，以确保准确性与合规性，通常属于会计或金融领域。而 “inspector” 的检查范围更广，可涉及安全、卫生、建筑、交通等非财务领域，且常具现场执行权。"
    },
    {
      "word_to_compare": "detective",
      "analysis": "“Detective”（侦探）专指从事刑事调查、搜集证据、追踪罪犯的警察或私家调查员，其核心是破案。虽然在英式英语中 “inspector” 可指高级警官，但并非所有 inspector 都是 detective；许多 inspector 的职责是预防性检查，而非事后调查。"
    }
  ]
}