{
  "word": "institutes",
  "pronunciation": "in·stuh·toons",
  "concise_definition": "n. 机构, 学会, 研究所; v. 建立, 设立, 制定",
  "forms": {
    "singular": "institute",
    "third_person_singular": "institutes",
    "past_tense": "instituted",
    "past_participle": "instituted",
    "present_participle": "instituting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An organization established for a specific purpose, especially in education, research, or public service, often with formal structure and authority.",
      "explanation_cn": "指为特定目的（尤其是教育、研究或公共服务）而设立的组织，通常具有正式的结构和权威性。",
      "example_en": "The National Institutes of Health is a leading center for medical research in the United States.",
      "example_cn": "美国国立卫生研究院是美国领先的医学研究机构。"
    },
    {
      "pos": "noun",
      "explanation_en": "A formal system, practice, or custom that has been established and is widely accepted within a society or organization.",
      "explanation_cn": "指在社会或组织中被正式确立并广泛接受的制度、做法或习俗。",
      "example_en": "Marriage is one of the oldest social institutes in human history.",
      "example_cn": "婚姻是人类历史上最古老的社会制度之一。"
    },
    {
      "pos": "verb",
      "explanation_en": "To establish or set up a system, policy, or practice, especially in an official or formal manner.",
      "explanation_cn": "指以正式或官方的方式建立、设立某种制度、政策或做法。",
      "example_en": "The government instituted new safety regulations to prevent workplace accidents.",
      "example_cn": "政府制定了新的安全法规，以防止 workplace 事故。"
    },
    {
      "pos": "verb",
      "explanation_en": "To initiate or introduce a process or procedure, often as a formal step toward change or improvement.",
      "explanation_cn": "指启动或引入某种程序或流程，通常作为实现变革或改进的正式步骤。",
      "example_en": "The school instituted a new curriculum to better prepare students for the modern workforce.",
      "example_cn": "该校引入了新课程，以更好地为学生进入现代职场做准备。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "organization",
      "analysis": "“Organization” (组织) 是一个更广泛、更通用的词，泛指任何有结构的团体或系统，可以是公司、非营利机构或临时团队。而 “institute” 通常特指具有学术、科研或公共服务性质的正式机构，带有更强的专业性和权威性。"
    },
    {
      "word_to_compare": "institution",
      "analysis": "“Institution” (制度/机构) 与 “institute” 非常接近，常可互换，但 “institution” 更侧重于社会层面的长期制度或传统（如教育制度、婚姻制度），而 “institute” 更常指具体的实体机构（如研究所、学院）。此外，“institution” 作为抽象概念的使用频率远高于 “institute”。"
    },
    {
      "word_to_compare": "establish",
      "analysis": "“Establish” (建立) 是一个更通用的动词，可用于建立任何事物——公司、规则、关系等，强调“使之存在”。“Institute” 作为动词时，更强调以正式、系统的方式引入制度、政策或程序，常用于法律、教育或行政语境，语气更正式。"
    }
  ]
}