{
  "word": "institutional",
  "pronunciation": "in·stuh·too·shuh·nuhl",
  "concise_definition": "adj. 机构的, 体制的, 由机构建立的",
  "forms": {
    "comparative": "more institutional",
    "superlative": "most institutional"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characteristic of an institution, especially one that is established, formal, and long-standing, such as a government, university, or hospital.",
      "explanation_cn": "与机构相关或具有机构特征的，尤指那些已建立、正式且历史悠久的组织，如政府、大学或医院。",
      "example_en": "The hospital has institutional policies that govern patient care.",
      "example_cn": "这家医院有规范患者护理的机构性政策。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Systematically embedded within an organization or system, often implying rigidity, tradition, or resistance to change.",
      "explanation_cn": "系统性地根植于某个组织或体系中，常暗示僵化、传统或对变革的抗拒。",
      "example_en": "Institutional racism can persist even when individuals do not hold prejudiced views.",
      "example_cn": "即使个人没有偏见，体制性种族主义仍可能持续存在。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Designed or operated by an institution rather than by individuals or private entities.",
      "explanation_cn": "由机构而非个人或私人实体设计或运作的。",
      "example_en": "The funding for this research comes from institutional grants, not private donors.",
      "example_cn": "这项研究的资金来自机构拨款，而非私人捐赠者。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "organizational",
      "analysis": "“Organizational”（组织的）泛指任何组织结构或运作方式，适用于公司、团队或非正式团体，强调结构和流程。而 “institutional” 更强调正式、历史悠久、具有社会权威性的机构，如国家、大学或宗教组织，带有更强的规范性和传统性。"
    },
    {
      "word_to_compare": "systemic",
      "analysis": "“Systemic”（系统性的）指影响整个系统或结构的深层、普遍性问题，常用于描述疾病、不平等或缺陷的广泛分布。它更侧重于系统内部的运作机制，而 “institutional” 更强调由具体机构所建立、维护或体现的规则与实践。两者常重叠，但 “institutional” 更具主体性（机构是行动者），而 “systemic” 更具抽象性（系统是机制）。"
    },
    {
      "word_to_compare": "formal",
      "analysis": "“Formal”（正式的）指符合既定程序、礼仪或规则，可应用于场合、语言或行为，不一定涉及机构。例如，正式的着装或正式的信函。“Institutional” 则特指由机构所确立或支持的，具有组织权威性，范围更广、更持久，且常带有权力结构的含义。"
    }
  ]
}