{
  "word": "insurgent",
  "pronunciation": "in·sür·jənt",
  "concise_definition": "n. 叛乱者, 反叛者; adj. 叛乱的, 反叛的",
  "forms": {
    "plural": "insurgents",
    "comparative": "more insurgent",
    "superlative": "most insurgent"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who rises in armed rebellion against an established government or authority, often as part of an organized movement seeking to overthrow or challenge its control.",
      "explanation_cn": "指武装反抗现有政府或权威的人，通常是作为有组织的运动成员，旨在推翻或挑战其统治。",
      "example_en": "The insurgents launched a surprise attack on the capital last night.",
      "example_cn": "叛乱者昨晚对首都发动了突然袭击。"
    },
    {
      "pos": "noun",
      "explanation_en": "A member of a group that opposes official policies or structures through violent or nonviolent resistance, especially in contexts of political or social upheaval.",
      "explanation_cn": "指在政治或社会动荡背景下，通过暴力或非暴力方式反对官方政策或体制的团体成员。",
      "example_en": "Many insurgents in the region are former soldiers disillusioned with the central government.",
      "example_cn": "该地区许多叛乱者是因对中央政府失望而脱离军队的前士兵。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characteristic of a rebellion or uprising against authority; rebellious and defiant.",
      "explanation_cn": "与反抗或起义相关或具有其特征的；具有反叛和挑衅性质的。",
      "example_en": "The insurgent forces controlled large areas of the countryside.",
      "example_cn": "叛乱部队控制了广大农村地区。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing actions, ideas, or movements that challenge conventional norms or established systems in a radical or disruptive way.",
      "explanation_cn": "形容以激进或破坏性方式挑战传统规范或既定体系的行为、思想或运动。",
      "example_en": "Her insurgent art challenged the traditional boundaries of gallery culture.",
      "example_cn": "她的叛逆艺术挑战了画廊文化的传统界限。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rebel",
      "analysis": "“Rebel” (反叛者) 是一个更广泛、更通用的词，可指任何反抗权威的人，无论是否使用暴力，也包括个人或非组织化的反抗。而 “insurgent” 更特指有组织、常以武装形式进行的反政府叛乱，具有更强的政治和军事语境。"
    },
    {
      "word_to_compare": "revolutionary",
      "analysis": "“Revolutionary” (革命者) 强调旨在彻底推翻旧制度、建立新秩序的意识形态驱动者，通常带有明确的政治纲领和长远目标。而 “insurgent” 更侧重于当前的武装反抗行动，不一定有完整的替代方案。革命者可能是 insurgents，但 insurgents 不一定是革命者。"
    },
    {
      "word_to_compare": "mutineer",
      "analysis": "“Mutineer” (哗变者) 专指军队或船只内部成员对上级的公开反抗，通常局限于组织内部的权力结构。而 “insurgent” 的反抗对象是国家或政府，范围更广，不局限于军事单位内部。"
    }
  ]
}