{
  "word": "interest",
  "pronunciation": "in·trest",
  "concise_definition": "n. 兴趣, 利息, 利益; v. 使感兴趣",
  "forms": {
    "plural": "interests",
    "third_person_singular": "interests",
    "past_tense": "interested",
    "past_participle": "interested",
    "present_participle": "interesting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A feeling of curiosity or concern about something, often leading to attention, engagement, or active involvement.",
      "explanation_cn": "对某事物产生的好奇或关注感，通常会引发注意、参与或积极投入。",
      "example_en": "She has a deep interest in ancient history and spends hours reading archaeological journals.",
      "example_cn": "她对古代历史有浓厚兴趣，常常花数小时阅读考古学期刊。"
    },
    {
      "pos": "noun",
      "explanation_en": "A financial return paid on money lent or invested, typically expressed as a percentage of the principal amount.",
      "explanation_cn": "借贷或投资所获得的经济回报，通常以本金的百分比表示。",
      "example_en": "The bank offers a 3% annual interest on savings accounts.",
      "example_cn": "该银行对储蓄账户提供年利率3%。"
    },
    {
      "pos": "noun",
      "explanation_en": "A personal or financial stake in a matter, often implying a benefit or advantage one stands to gain or lose.",
      "explanation_cn": "在某事中所持有的个人或经济利害关系，通常意味着可能获得或失去的利益。",
      "example_en": "The shareholders have a strong interest in the company's long-term profitability.",
      "example_cn": "股东们对公司的长期盈利能力有重大利害关系。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause someone to feel curiosity, attention, or engagement; to attract or hold someone's attention.",
      "explanation_cn": "使某人产生好奇、关注或参与感；吸引或维持某人的注意力。",
      "example_en": "The documentary interested even the most skeptical viewers.",
      "example_cn": "这部纪录片甚至吸引了最怀疑的观众。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "curiosity",
      "analysis": "“Curiosity” (好奇心) 强调一种纯粹的求知欲或对未知事物的探索冲动，通常是自发且非功利的。而 “interest” 更广泛，可包含情感、利益或实用动机，不一定源于纯粹的好奇。"
    },
    {
      "word_to_compare": "profit",
      "analysis": "“Profit” (利润) 专指经济收益，是财务上的正向结果。而 “interest” 在表示‘利益’时，范围更广，可包括非金钱的利害关系，如政治利益、情感利益等。"
    },
    {
      "word_to_compare": "engagement",
      "analysis": "“Engagement” (参与度) 强调行为上的投入和互动，如用户参与社交媒体、员工参与工作。而 “interest” 是心理层面的吸引，是产生参与的前提，但不一定导致实际行为。"
    }
  ]
}