{
  "word": "intelligence",
  "pronunciation": "in·tuh·lij·uhns",
  "concise_definition": "n. 智力, 智能, 情报",
  "forms": {
    "plural": "intelligences"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The ability to learn, understand, and apply knowledge, reason logically, solve problems, and adapt to new situations; a mental capacity that enables complex thinking and decision-making.",
      "explanation_cn": "指学习、理解、运用知识，进行逻辑推理，解决问题以及适应新情境的能力；一种使复杂思维和决策成为可能的心理能力。",
      "example_en": "She has exceptional intelligence and can solve complex mathematical problems with ease.",
      "example_cn": "她拥有非凡的智力，能够轻松解决复杂的数学问题。"
    },
    {
      "pos": "noun",
      "explanation_en": "Classified information gathered by governments or organizations about enemy activities, threats, or intentions, often through surveillance, espionage, or analysis.",
      "explanation_cn": "指政府或组织通过监视、间谍活动或分析收集的关于敌方活动、威胁或意图的机密信息。",
      "example_en": "The agency intercepted intelligence suggesting an imminent attack.",
      "example_cn": "该机构截获了暗示即将发生袭击的情报。"
    },
    {
      "pos": "noun",
      "explanation_en": "Artificial intelligence (AI): The simulation of human intelligence processes by machines, especially computer systems, including learning, reasoning, and self-correction.",
      "explanation_cn": "人工智能（AI）：指机器（尤其是计算机系统）模拟人类智能过程的能力，包括学习、推理和自我修正。",
      "example_en": "Modern smartphones use artificial intelligence to recognize faces and predict user behavior.",
      "example_cn": "现代智能手机使用人工智能来识别人脸并预测用户行为。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "wisdom",
      "analysis": "“Wisdom”（智慧）强调基于经验、洞察力和道德判断所做出的明智决策，侧重于“如何正确运用知识”；而 “intelligence” 更侧重于认知能力本身，如逻辑推理、记忆和学习速度，不一定包含道德或经验维度。"
    },
    {
      "word_to_compare": "knowledge",
      "analysis": "“Knowledge”（知识）指通过学习、经验或教育所获得的信息或事实的总和，是静态的积累；而 “intelligence” 是运用这些知识的能力，是动态的处理和应用过程。一个人可以拥有大量知识却缺乏智力，反之亦然。"
    },
    {
      "word_to_compare": "information",
      "analysis": "“Information”（信息）是原始的、未经处理的数据或事实，是情报的原材料；而 “intelligence” 是经过分析、筛选、整合并赋予意义的信息，具有目的性和行动导向性，尤其在军事或安全语境中，强调其战略价值。"
    }
  ]
}