{
  "word": "integrated",
  "pronunciation": "in·tuh·gray·tuhd",
  "concise_definition": "adj. 整合的, 统一的, 完整的",
  "forms": {
    "comparative": "more integrated",
    "superlative": "most integrated"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Combined or unified into a whole, where different parts work together harmoniously to form a single, cohesive system or structure.",
      "explanation_cn": "指不同部分被结合或统一成一个整体，各组成部分协同运作，形成一个和谐、连贯的系统或结构。",
      "example_en": "The school offers an integrated curriculum that combines science, math, and literature.",
      "example_cn": "这所学校提供一门整合了科学、数学和文学的综合课程。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Incorporated into a larger system or society, especially referring to the inclusion of previously segregated or marginalized groups.",
      "explanation_cn": "指被纳入更大的系统或社会中，尤其用于描述先前被隔离或边缘化的群体被接纳和融合。",
      "example_en": "After decades of segregation, the city has made progress toward an integrated public transportation system.",
      "example_cn": "经过数十年的隔离，这座城市在实现公共交通一体化方面取得了进展。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Designed so that components are mutually dependent and function as a single unit, often used in technology and engineering contexts.",
      "explanation_cn": "指各组件相互依赖、作为一个整体单元运作的设计，常用于技术和工程领域。",
      "example_en": "The new smartphone features an integrated camera and facial recognition system.",
      "example_cn": "这款新型智能手机配备了集成的摄像头和面部识别系统。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "combined",
      "analysis": "“Combined”（组合的）仅表示两个或多个事物被放在一起，但不一定形成统一或协调的整体。例如，把红蓝颜料混合是“combined”，但未必是“integrated”。而 “integrated” 强调功能上的协同与结构上的有机统一。"
    },
    {
      "word_to_compare": "unified",
      "analysis": "“Unified”（统一的）侧重于消除分歧、达成一致，常用于政治、组织或意识形态层面，如“unified front”（统一战线）。而 “integrated” 更强调系统性融合，尤其在技术、教育或社会结构中，关注的是组成部分如何协同运作。"
    },
    {
      "word_to_compare": "cohesive",
      "analysis": "“Cohesive”（有凝聚力的）描述的是整体内部各部分之间的紧密联系和团结，但不强调这些部分是否原本独立并被主动整合。例如，一个团队可以是“cohesive”但未必是“integrated”——如果成员从未经历结构重组。而 “integrated” 隐含了从分离到融合的过程。"
    }
  ]
}