{
  "word": "interpretations",
  "pronunciation": "in·ter·pruh·tay·shuhnz",
  "concise_definition": "n. 解释, 诠释, 理解",
  "forms": {
    "singular": "interpretation"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of explaining or defining the meaning of something, especially when it is ambiguous, complex, or open to multiple understandings.",
      "explanation_cn": "指对某事物进行解释或界定其含义，尤其当该事物含糊、复杂或存在多种理解可能性时。",
      "example_en": "The judge offered a strict interpretation of the law, ignoring the spirit behind it.",
      "example_cn": "法官对法律做出了严格解释，忽视了其背后的宗旨。"
    },
    {
      "pos": "noun",
      "explanation_en": "A particular version or rendering of a work of art, music, or literature, reflecting the performer's or creator's personal understanding or style.",
      "explanation_cn": "指对艺术、音乐或文学作品的一种特定演绎或呈现方式，体现表演者或创作者的个人理解或风格。",
      "example_en": "Her interpretation of Beethoven's sonata was both passionate and deeply introspective.",
      "example_cn": "她对贝多芬奏鸣曲的演绎既充满激情，又极具内省性。"
    },
    {
      "pos": "noun",
      "explanation_en": "A personal or cultural understanding of a symbol, dream, or event, often used in psychology, religion, or literary analysis.",
      "explanation_cn": "指个人或文化对符号、梦境或事件的理解，常用于心理学、宗教或文学分析中。",
      "example_en": "Freudian interpretations of dreams focus on unconscious desires and repressed emotions.",
      "example_cn": "弗洛伊德对梦境的解释聚焦于潜意识的欲望与压抑的情感。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "definition",
      "analysis": "“Definition”（定义）通常指权威、标准或字典式的明确说明，强调精确性和普遍接受性，多用于术语或概念的固定含义。而 “interpretation” 更强调主观理解，允许灵活性和语境依赖，常用于模糊或开放性内容。"
    },
    {
      "word_to_compare": "translation",
      "analysis": "“Translation”（翻译）是将一种语言的文字或口语转换为另一种语言，核心是语言符号的转换。而 “interpretation” 可以是语言间的，也可以是非语言的（如艺术、行为），更侧重于意义的传达与重构，而非字面转换。"
    },
    {
      "word_to_compare": "explanation",
      "analysis": "“Explanation”（解释）通常用于澄清因果关系、机制或逻辑，目的是使复杂事物变得清晰易懂，偏重理性分析。而 “interpretation” 更关注主观意义的赋予，常涉及价值判断、情感或文化背景，不一定追求客观正确性。"
    }
  ]
}