{
  "word": "interior",
  "pronunciation": "in·tir·ee·er",
  "concise_definition": "n. 内部, 内室, 内景; adj. 内部的, 内在的",
  "forms": {
    "plural": "interiors",
    "comparative": "interior",
    "superlative": "interior"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The inner part or surface of something, especially of a building, room, or vehicle, as opposed to its exterior.",
      "explanation_cn": "指某物的内部部分或表面，尤指建筑物、房间或车辆的内部，与外部相对。",
      "example_en": "The interior of the cathedral was adorned with stained glass and gold leaf.",
      "example_cn": "大教堂的内部装饰着彩绘玻璃和金箔。"
    },
    {
      "pos": "noun",
      "explanation_en": "The internal affairs or characteristics of a country, organization, or group, especially when contrasted with external relations.",
      "explanation_cn": "指一个国家、组织或团体的内部事务或特征，常与外部关系相对比。",
      "example_en": "The president addressed concerns about the country's interior politics.",
      "example_cn": "总统就该国的内政问题发表了讲话。"
    },
    {
      "pos": "noun",
      "explanation_en": "In film or photography, a scene that takes place indoors, as opposed to an exterior (outdoor) scene.",
      "explanation_cn": "在电影或摄影中，指发生在室内的场景，与外景（户外场景）相对。",
      "example_en": "The director chose to shoot the emotional climax in an interior setting to enhance intimacy.",
      "example_cn": "导演选择在室内场景中拍摄情感高潮，以增强亲密感。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Located or occurring within something; internal or inner in position or nature.",
      "explanation_cn": "位于或发生于某物内部的；在位置或性质上属于内部的。",
      "example_en": "She admired the interior design of the modern apartment.",
      "example_cn": "她欣赏这间现代公寓的内部设计。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "inside",
      "analysis": "“Inside” (内部) 是一个更口语化、更通用的词，可作名词或副词，强调空间上的“在…里面”，常用于日常对话。而 “interior” 更正式，常用于描述建筑、设计、地理或抽象概念的内部结构，具有更强的专业性和精确性。"
    },
    {
      "word_to_compare": "internal",
      "analysis": "“Internal” (内部的) 更侧重于事物内在的组成部分、机制或功能，常用于科学、医学、组织结构等语境，强调系统内部的运作。而 “interior” 更多指物理空间的内部，或视觉上的内部环境，如房间、景观等。"
    },
    {
      "word_to_compare": "inner",
      "analysis": "“Inner” (内心的、更里面的) 常用于表达抽象或情感层面的内部，如 inner peace（内心的平静）、inner self（内在自我），具有哲学或心理色彩。而 “interior” 更偏向于物理或空间意义上的内部，较少用于隐喻。"
    }
  ]
}