{
  "word": "interviewing",
  "pronunciation": "in·tər·vyoo·iŋ",
  "concise_definition": "v. 采访, 面试, 询问",
  "forms": {
    "base_form": "interview",
    "third_person_singular": "interviews",
    "past_tense": "interviewed",
    "past_participle": "interviewed",
    "present_participle": "interviewing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To ask someone a series of questions, typically in a formal setting, to assess their qualifications, opinions, or experiences (e.g., for a job, media report, or research).",
      "explanation_cn": "指在正式场合下向某人提出一系列问题，以评估其资格、观点或经历（如求职、新闻报道或研究）。",
      "example_en": "The HR team is interviewing candidates for the marketing manager position.",
      "example_cn": "人力资源团队正在面试市场营销经理职位的候选人。"
    },
    {
      "pos": "verb",
      "explanation_en": "To conduct a conversation with a person to gather information, often for journalistic, academic, or documentary purposes.",
      "explanation_cn": "指与某人进行对话以收集信息，通常用于新闻、学术或纪录片制作目的。",
      "example_en": "The journalist spent three days interviewing survivors of the earthquake.",
      "example_cn": "这位记者花了三天时间采访地震幸存者。"
    },
    {
      "pos": "verb",
      "explanation_en": "To question or interrogate someone, sometimes in a persistent or probing manner, to uncover hidden details or truths.",
      "explanation_cn": "指以持续或深入的方式质询某人，以揭示隐藏的细节或真相。",
      "example_en": "Police were interviewing the suspect for hours before they obtained a confession.",
      "example_cn": "警方连续数小时审问嫌疑人，最终获得了供词。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "questioning",
      "analysis": "“Questioning”（质询）是一个更宽泛的术语，泛指任何形式的提问，可以是随意的、非正式的，甚至带有怀疑或审讯性质。而 “interviewing” 通常具有结构性、目的性和礼仪性，常用于职业、媒体或学术场景，强调双向交流而非单向审问。"
    },
    {
      "word_to_compare": "interrogating",
      "analysis": "“Interrogating”（审讯）带有强烈的强制性、对抗性和法律/执法背景，常用于警方或军事环境中，目的是迫使对方承认罪行或提供信息。而 “interviewing” 更中性，强调信息收集而非施压，通常建立在自愿合作的基础上。"
    },
    {
      "word_to_compare": "surveying",
      "analysis": "“Surveying”（调查）通常指通过标准化问卷或量表向大量人群收集数据，强调统计性和代表性，而非深入的个人对话。而 “interviewing” 是一对一或小范围的深度交流，注重语境、语气和个体反应，适合获取主观体验和复杂见解。"
    }
  ]
}