{
  "word": "intellectual",
  "pronunciation": "in·tuh·lek·choo·uhl",
  "concise_definition": "adj. 智力的, 理性的; n. 知识分子",
  "forms": {
    "comparative": "more intellectual",
    "superlative": "most intellectual",
    "plural": "intellectuals"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to the intellect or the use of reason and critical thinking, rather than emotion or instinct; characterized by mental activity and deep thought.",
      "explanation_cn": "与智力或理性思维相关，而非情感或本能；以心智活动和深度思考为特征的。",
      "example_en": "She has an intellectual curiosity that drives her to read philosophy and science books.",
      "example_cn": "她对哲学和科学书籍的求知欲源于一种智力上的好奇心。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Designed for or appealing to people who enjoy complex ideas and abstract reasoning, often in contrast to popular or mass culture.",
      "explanation_cn": "专为喜欢复杂思想和抽象推理的人设计或吸引他们，常与大众文化相对。",
      "example_en": "The film is an intellectual thriller that challenges viewers to question reality.",
      "example_cn": "这部电影是一部发人深省的智力惊悚片，促使观众质疑现实。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who uses their intellect extensively, especially in areas such as philosophy, science, or the arts; someone engaged in critical thinking and scholarly pursuits.",
      "explanation_cn": "指广泛运用智力的人，尤其在哲学、科学或艺术领域；从事批判性思考和学术研究的人。",
      "example_en": "Many intellectuals in the 19th century advocated for social reform through writing and public debate.",
      "example_cn": "19世纪的许多知识分子通过写作和公开辩论倡导社会改革。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "intelligent",
      "analysis": "“Intelligent” (聪明的) 描述一个人具有较高的认知能力或学习能力，是一个更广泛、更基础的描述词，适用于日常语境。而 “intellectual” 强调对抽象思想、理论和学术的主动参与和偏好，带有文化或社会身份的意味。一个聪明的人未必是知识分子，但一个知识分子通常很聪明。"
    },
    {
      "word_to_compare": "academic",
      "analysis": "“Academic” (学术的) 侧重于与学校、大学或正式教育体系相关的事物，强调制度性、系统性。而 “intellectual” 更广泛，涵盖所有从事深度思考的人，无论是否在学术机构中。一个作家、哲学家或社会评论家可以是知识分子，但未必是学术人士。"
    },
    {
      "word_to_compare": "erudite",
      "analysis": "“Erudite” (博学的) 强调拥有大量知识，尤其是通过广泛阅读获得的渊博学识，常用于形容学识深厚的人。而 “intellectual” 更强调思维过程、批判性分析和思想表达，不一定要求知识量巨大，但必须有思想深度。一个 erudite 的人可能只是记忆丰富，而一个 intellectual 必须能运用知识进行反思和创造。"
    }
  ]
}