{
  "word": "interview",
  "pronunciation": "in·tər·vyü",
  "concise_definition": "n. 面试, 采访; v. 面试, 采访",
  "forms": {
    "third_person_singular": "interviews",
    "past_tense": "interviewed",
    "past_participle": "interviewed",
    "present_participle": "interviewing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A formal meeting in which one person asks another person questions to assess their qualifications, opinions, or experiences, typically for employment, admission, or media purposes.",
      "explanation_cn": "指一个人为了评估另一个人的资格、观点或经历而进行的正式会谈，常用于招聘、录取或媒体报道场景。",
      "example_en": "She had an interview with the hiring manager for the marketing position.",
      "example_cn": "她与招聘经理就市场岗位进行了面试。"
    },
    {
      "pos": "noun",
      "explanation_en": "A conversation between a journalist and a person of interest, conducted to gather information, quotes, or personal insights for publication or broadcast.",
      "explanation_cn": "指记者与有新闻价值的人物之间的对话，旨在收集信息、引语或个人见解，用于出版或广播。",
      "example_en": "The magazine published an exclusive interview with the Nobel Prize winner.",
      "example_cn": "这本杂志刊登了对诺贝尔奖得主的独家专访。"
    },
    {
      "pos": "verb",
      "explanation_en": "To question someone formally in order to evaluate their suitability for a job, program, or role.",
      "explanation_cn": "指正式地向某人提问，以评估其是否适合某一职位、项目或角色。",
      "example_en": "The committee will interview five candidates for the director position.",
      "example_cn": "委员会将对五位候选人进行面试，以选拔主任。"
    },
    {
      "pos": "verb",
      "explanation_en": "To conduct a formal conversation with someone to obtain information or statements for media or research purposes.",
      "explanation_cn": "指为媒体或研究目的，与某人进行正式对话以获取信息或陈述。",
      "example_en": "The reporter interviewed the eyewitness about the accident.",
      "example_cn": "记者就事故采访了目击者。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "question",
      "analysis": "“Question”（提问）是一个更广泛、更基础的词，泛指任何提出问题的行为，不带有特定目的或形式。而 “interview” 是一种结构化的、有目的的提问过程，通常涉及双方互动，且有明确目标（如招聘或报道）。"
    },
    {
      "word_to_compare": "interrogate",
      "analysis": "“Interrogate”（审问）通常带有强制性、压迫性或官方调查的语境，常用于法律或执法场景，强调施加压力以获取信息。而 “interview” 是中性或礼貌的交流，强调信息收集而非逼迫。"
    },
    {
      "word_to_compare": "consult",
      "analysis": "“Consult”（咨询）指寻求专家建议或意见，通常是为了解决问题或做决策，双方地位相对平等。而 “interview” 更侧重于一方评估或收集另一方的信息，存在明显的主客体关系。"
    }
  ]
}