{
  "word": "interpreting",
  "pronunciation": "in·tur·pruh·ting",
  "concise_definition": "v. 解释, 翻译, 诠释",
  "forms": {
    "base_form": "interpret",
    "third_person_singular": "interprets",
    "past_tense": "interpreted",
    "past_participle": "interpreted",
    "present_participle": "interpreting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To explain the meaning of something, especially when it is ambiguous, complex, or symbolic, by analyzing its context, intent, or underlying significance.",
      "explanation_cn": "指对模糊、复杂或具有象征意义的事物进行分析，解释其含义、意图或深层意义。",
      "example_en": "The judge was interpreting the law in light of recent social changes.",
      "example_cn": "法官正在根据最近的社会变化来解释法律。"
    },
    {
      "pos": "verb",
      "explanation_en": "To translate spoken language from one language to another in real time, often in formal settings such as conferences or diplomatic meetings.",
      "explanation_cn": "指在会议、外交场合等正式环境中，实时将一种语言的口语翻译成另一种语言。",
      "example_en": "She was interpreting between the French and Chinese delegates during the summit.",
      "example_cn": "她在峰会期间为法语和汉语代表进行口译。"
    },
    {
      "pos": "verb",
      "explanation_en": "To perform or present a work of art, music, or literature in a way that conveys personal understanding or emotional expression.",
      "explanation_cn": "指以个人的理解或情感表达方式来演绎艺术、音乐或文学作品。",
      "example_en": "The pianist's interpreting of Chopin's nocturnes was deeply moving.",
      "example_cn": "这位钢琴家对肖邦夜曲的演绎感人至深。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "translating",
      "analysis": "“Translating” (翻译) 通常指将书面或口语文字从一种语言逐字或逐句转换为另一种语言，强调语言形式的对应。而 “interpreting” 更侧重于在实时交流中传达语义、语气和文化背景，常用于口语场景，且允许灵活调整表达方式。"
    },
    {
      "word_to_compare": "explaining",
      "analysis": "“Explaining” (解释) 是用清晰、直接的语言使某事变得易懂，通常不涉及深层含义或艺术性重构。而 “interpreting” 更深入，常涉及主观理解、语境分析或象征意义的挖掘，尤其在艺术、法律或心理学语境中更为常见。"
    },
    {
      "word_to_compare": "analyzing",
      "analysis": "“Analyzing” (分析) 是系统性地拆解事物的组成部分以理解其结构或机制，通常是客观的、逻辑导向的。而 “interpreting” 在分析基础上进一步加入主观判断、情感投射或文化语境的解读，结果更具个性和开放性。"
    }
  ]
}