{
  "word": "integration",
  "pronunciation": "in·tuh·gray·shuhn",
  "concise_definition": "n. 整合, 融合, 同化, 积分",
  "forms": {
    "plural": "integrations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of combining or uniting separate elements into a cohesive and functioning whole, often to improve efficiency, harmony, or effectiveness.",
      "explanation_cn": "指将分离的元素结合或统一为一个协调且功能完整的整体，通常旨在提高效率、和谐性或有效性。",
      "example_en": "The company's successful integration of its new acquisition improved overall productivity.",
      "example_cn": "该公司对其新收购企业的成功整合提升了整体生产力。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of ending segregation and bringing different racial, ethnic, or social groups into equal participation within a society or institution.",
      "explanation_cn": "指结束隔离状态，使不同种族、民族或社会群体在社会或机构中实现平等参与。",
      "example_en": "The civil rights movement fought for the integration of public schools in the 1960s.",
      "example_cn": "民权运动在20世纪60年代为实现公立学校的融合而斗争。"
    },
    {
      "pos": "noun",
      "explanation_en": "In mathematics, the operation of finding the integral of a function, which calculates the area under a curve or the accumulation of quantities over a range.",
      "explanation_cn": "在数学中，指求函数的积分，用于计算曲线下的面积或某一范围内数量的累积。",
      "example_en": "Calculus students learn integration as a fundamental tool for solving real-world problems.",
      "example_cn": "微积分学生将积分学习为解决现实问题的基本工具。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "combination",
      "analysis": "“Combination”（组合）强调将多个部分放在一起，但不一定形成一个有机统一的整体，各部分仍可能保持独立性。而 “integration” 更强调系统性融合，各部分相互协调、功能互补，形成新的整体结构。"
    },
    {
      "word_to_compare": "assimilation",
      "analysis": "“Assimilation”（同化）通常指少数群体在文化、语言或行为上逐渐适应并融入主流群体，常隐含失去原有特征的意味，带有社会权力不平等的色彩。而 “integration” 更强调平等参与和多元共存，保留差异的同时实现协作。"
    },
    {
      "word_to_compare": "unification",
      "analysis": "“Unification”（统一）侧重于政治、领土或制度上的合并，常用于国家或组织的合并（如德国统一）。它强调形式上的合一，而 “integration” 更关注功能、流程或系统的内在协调与互动。"
    }
  ]
}