{
  "word": "intervention",
  "pronunciation": "in·tər·ven·shən",
  "concise_definition": "n. 干预, 插手, 介入",
  "forms": {
    "plural": "interventions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of becoming involved in a situation in order to improve it or prevent it from getting worse, often by an external party such as a government, organization, or individual.",
      "explanation_cn": "指外部一方（如政府、组织或个人）为改善某种状况或防止其恶化而主动介入的行为。",
      "example_en": "The government's intervention in the economy helped stabilize prices during the crisis.",
      "example_cn": "政府对经济的干预帮助在危机期间稳定了物价。"
    },
    {
      "pos": "noun",
      "explanation_en": "A medical or therapeutic procedure performed to treat or prevent a health condition, often when natural recovery is unlikely.",
      "explanation_cn": "指为治疗或预防健康问题而采取的医疗或治疗性措施，通常在自然康复可能性较低时使用。",
      "example_en": "Early intervention for children with autism can significantly improve long-term outcomes.",
      "example_cn": "对自闭症儿童进行早期干预可以显著改善长期预后。"
    },
    {
      "pos": "noun",
      "explanation_en": "An action taken to disrupt or alter the course of a process, conversation, or conflict, often to redirect or de-escalate it.",
      "explanation_cn": "指为打断或改变某一过程、对话或冲突的走向而采取的行动，通常旨在引导或缓和局势。",
      "example_en": "The mediator's intervention helped calm the heated argument between the two parties.",
      "example_cn": "调解人的介入帮助平息了双方激烈的争论。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "interference",
      "analysis": "“Interference”（干涉）通常带有负面含义，指未经允许或不恰当的介入，可能破坏原有秩序或自主性。而 “intervention” 更中性或积极，常用于有正当理由、旨在改善状况的介入，尤其在医疗、教育或公共政策语境中。"
    },
    {
      "word_to_compare": "mediation",
      "analysis": "“Mediation”（调解）是 “intervention” 的一种特定形式，特指由中立第三方协助冲突双方达成协议的过程。它强调协商与沟通，而 “intervention” 范围更广，可包括强制性、单方面或非协商性的行动。"
    },
    {
      "word_to_compare": "involvement",
      "analysis": "“Involvement”（参与）泛指任何程度的参与，可能是被动或轻微的，不必然带有改变现状的意图。而 “intervention” 暗示主动、有目的的介入，通常是为了产生实质性影响或改变。"
    }
  ]
}