{
  "word": "interviews",
  "pronunciation": "in·tər·vyüz",
  "concise_definition": "n. 面试, 采访, 会面",
  "forms": {
    "singular": "interview"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A formal meeting in which one person asks another person questions to assess their qualifications, skills, or suitability for a job, position, or opportunity.",
      "explanation_cn": "指一个人通过提问来评估另一个人的资格、技能或是否适合某一职位或机会的正式会面。",
      "example_en": "She had three interviews before landing her dream job at the tech company.",
      "example_cn": "她在获得这家科技公司理想的工作之前，经历了三次面试。"
    },
    {
      "pos": "noun",
      "explanation_en": "A conversation between a journalist and a person of interest, conducted to gather information, opinions, or personal stories for publication or broadcast.",
      "explanation_cn": "指记者与有新闻价值的人物之间的对话，旨在收集信息、观点或个人故事用于发表或播出。",
      "example_en": "The magazine published an exclusive interview with the Nobel Prize winner.",
      "example_cn": "这本杂志刊登了对诺贝尔奖得主的独家专访。"
    },
    {
      "pos": "noun",
      "explanation_en": "An official inquiry or questioning session, often used in legal, academic, or investigative contexts to obtain testimony or evidence.",
      "explanation_cn": "指在法律、学术或调查背景下进行的正式询问或质询，用于获取证词或证据。",
      "example_en": "The committee held interviews with witnesses to reconstruct the events of the accident.",
      "example_cn": "委员会对目击者进行了访谈，以还原事故经过。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "questionnaire",
      "analysis": "“Questionnaire”（问卷）是书面或电子形式的一系列标准化问题，用于收集大量人群的反馈，强调客观性和可量化性。而 “interview” 是面对面或实时的互动交流，允许追问、观察非语言信号，并深入探讨个人观点，更具灵活性和深度。"
    },
    {
      "word_to_compare": "interrogation",
      "analysis": "“Interrogation”（审讯）通常带有强制性、对抗性和法律压力，常用于警方或军事环境中获取供词，语气严厉。而 “interview” 更中性甚至友好，目的是收集信息而非施压或指控，语境更广泛且非对抗性。"
    },
    {
      "word_to_compare": "discussion",
      "analysis": "“Discussion”（讨论）是双向或多向的交流，参与者地位平等，目标是交换观点、达成共识或激发想法。而 “interview” 通常是单向主导的，提问者控制流程，被访者主要回应，目的是评估或获取信息，而非平等对话。"
    }
  ]
}