{
  "word": "intern",
  "pronunciation": "in·tərn",
  "concise_definition": "n. 实习生, 实习生职位; v. 实习, 住院实习",
  "forms": {
    "plural": "interns",
    "third_person_singular": "interns",
    "past_tense": "interned",
    "past_participle": "interned",
    "present_participle": "interning"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A student or recent graduate who works temporarily in a professional setting to gain practical experience, often without pay or for minimal compensation.",
      "explanation_cn": "指在专业环境中临时工作以获取实践经验的学生或应届毕业生，通常无薪或仅获得微薄报酬。",
      "example_en": "She completed a three-month internship at a major publishing house.",
      "example_cn": "她在一家大型出版社完成了为期三个月的实习。"
    },
    {
      "pos": "noun",
      "explanation_en": "A medical graduate undergoing supervised clinical training in a hospital, typically as the first stage of professional licensure.",
      "explanation_cn": "指刚毕业的医学生在医院接受监督下的临床培训，通常是获得执业资格的第一阶段。",
      "example_en": "After graduating, he began his internship in the emergency department.",
      "example_cn": "毕业后，他开始在急诊科进行住院实习。"
    },
    {
      "pos": "verb",
      "explanation_en": "To work as an intern, especially in a professional or clinical setting to gain experience.",
      "explanation_cn": "指作为实习生工作，尤其在专业或临床环境中以获取经验。",
      "example_en": "He is interning at a law firm this summer.",
      "example_cn": "他今年夏天在一家律师事务所实习。"
    },
    {
      "pos": "verb",
      "explanation_en": "To confine or imprison someone, especially during wartime or political unrest (archaic or specialized usage).",
      "explanation_cn": "指在战争或政治动荡期间拘禁某人（古语或特定语境用法）。",
      "example_en": "During the war, many civilians were interned without trial.",
      "example_cn": "战争期间，许多平民未经审判就被拘禁。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "apprentice",
      "analysis": "“Apprentice”（学徒）通常指在传统手工艺或技术行业中，通过长期、有组织的师徒关系学习技能的人，往往有明确的合同和培训周期，且更侧重于技艺传承。而 “intern” 更常见于现代职业环境，如商业、媒体、医疗等领域，时间较短，目的更偏向于积累经验而非掌握特定手艺。"
    },
    {
      "word_to_compare": "trainee",
      "analysis": "“Trainee”（受训者）是一个更宽泛的术语，泛指任何正在接受培训的人，无论是否在职场中，也包括公司内部的正式培训项目。而 “intern” 特指在真实工作环境中进行短期实践的学生或毕业生，通常与学术课程挂钩，且常为非正式或无薪性质。"
    },
    {
      "word_to_compare": "resident",
      "analysis": "“Resident”（住院医师）是医学领域中已完成实习（internship）后进入的下一阶段，通常有执照、承担更多责任并领取正式薪酬。而 “intern” 是医学培训的最初阶段，职责较基础，监督更严密。在某些国家，‘intern’ 和 ‘resident’ 可互换，但在美国医学体系中二者有明确层级区别。"
    }
  ]
}