{
  "word": "interpreted",
  "pronunciation": "in·tur·prit·id",
  "concise_definition": "v. 解释, 诠释, 翻译",
  "forms": {
    "base_form": "interpret",
    "third_person_singular": "interprets",
    "past_tense": "interpreted",
    "past_participle": "interpreted",
    "present_participle": "interpreting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To explain the meaning of something, especially when it is ambiguous, complex, or not directly stated, often based on personal understanding or context.",
      "explanation_cn": "指对某事物（尤其是模糊、复杂或未明确表达的内容）进行解释，通常基于个人的理解或上下文。",
      "example_en": "The judge interpreted the law in a way that favored the defendant.",
      "example_cn": "法官以有利于被告的方式解释了法律。"
    },
    {
      "pos": "verb",
      "explanation_en": "To translate spoken language from one language to another in real time, often in formal settings such as conferences or diplomatic meetings.",
      "explanation_cn": "指在会议、外交场合等正式环境中，实时将一种语言的口语翻译成另一种语言。",
      "example_en": "She interpreted between the French and Chinese delegates during the summit.",
      "example_cn": "她在峰会期间为法语和汉语代表进行口译。"
    },
    {
      "pos": "verb",
      "explanation_en": "To understand or perceive something in a particular way, especially in art, literature, or behavior, often subjectively.",
      "explanation_cn": "指以某种特定方式理解或感知某事物，尤其在艺术、文学或行为中，常带有主观性。",
      "example_en": "Different audiences interpreted the ending of the film in very different ways.",
      "example_cn": "不同的观众对这部电影的结局有着截然不同的理解。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "explain",
      "analysis": "“Explain” (解释) 更侧重于清晰、直接地阐明事实、原因或过程，通常用于使复杂内容变得易懂，强调逻辑性和客观性。而 “interpret” 更强调对模糊、隐含或主观内容的个人化解读，带有更多主观判断。"
    },
    {
      "word_to_compare": "translate",
      "analysis": "“Translate” (翻译) 通常指在两种语言的文字或符号之间进行字面或语义转换，强调准确性与对等性，多用于书面文本。而 “interpret” 专指口语的即时翻译，更注重语境、语气和即时沟通，常用于现场交流。"
    },
    {
      "word_to_compare": "analyze",
      "analysis": "“Analyze” (分析) 指系统性地拆解事物的组成部分以理解其结构或功能，强调理性推理和证据。而 “interpret” 更关注赋予意义，即使在缺乏明确信息的情况下，也试图找出潜在含义或意图，更偏向主观诠释。"
    }
  ]
}