{
  "word": "interpretation",
  "pronunciation": "in·ter·pruh·tay·shuhn",
  "concise_definition": "n. 解释, 诠释, 译释",
  "forms": {
    "plural": "interpretations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of explaining or defining the meaning of something, especially when it is ambiguous, complex, or symbolic, often based on personal understanding or context.",
      "explanation_cn": "指对某事物（尤其是模糊、复杂或象征性的事物）进行解释或界定其含义的行为，通常基于个人的理解或具体语境。",
      "example_en": "The artist's interpretation of the poem was deeply emotional and unconventional.",
      "example_cn": "这位艺术家对这首诗的诠释充满情感且非传统。"
    },
    {
      "pos": "noun",
      "explanation_en": "The translation of spoken language from one language to another in real time, often in settings such as conferences or diplomatic meetings.",
      "explanation_cn": "指在会议、外交场合等场景中，实时将一种语言的口语翻译成另一种语言的行为。",
      "example_en": "The UN provided simultaneous interpretation in six official languages.",
      "example_cn": "联合国提供了六种官方语言的同声传译。"
    },
    {
      "pos": "noun",
      "explanation_en": "A particular version or rendering of a musical piece, dramatic performance, or artistic work, reflecting the performer's personal style or insight.",
      "explanation_cn": "指对音乐作品、戏剧表演或艺术作品的一种特定演绎方式，体现表演者个人的风格或见解。",
      "example_en": "Her interpretation of Beethoven's sonata was praised for its sensitivity and nuance.",
      "example_cn": "她对贝多芬奏鸣曲的演绎因其细腻与深度而受到赞誉。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "explanation",
      "analysis": "“Explanation”（解释）侧重于清晰、逻辑地阐明事实、原因或机制，通常用于科学、技术或日常语境中，强调客观性和可验证性。而 “interpretation” 更强调主观理解、语境依赖和意义的构建，尤其适用于艺术、法律或模糊文本的解读。"
    },
    {
      "word_to_compare": "translation",
      "analysis": "“Translation”（翻译）主要指将书面或口语文字从一种语言系统准确转换为另一种语言，强调语义和语法的对应性。而 “interpretation” 在语言语境中特指口语的即时翻译，且常包含对语气、文化背景的调整，具有更强的临场性和主观性。"
    },
    {
      "word_to_compare": "analysis",
      "analysis": "“Analysis”（分析）指将整体分解为组成部分，以研究其结构、功能或关系，强调系统性与逻辑推理。而 “interpretation” 不是拆解，而是赋予整体以意义，更关注“为什么这样理解”而非“由什么组成”。"
    }
  ]
}