{
  "word": "intensive",
  "pronunciation": "in·tens·iv",
  "concise_definition": "adj. 密集的, 集中的, 强化的",
  "forms": {
    "comparative": "more intensive",
    "superlative": "most intensive"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Characterized by a high degree of concentration, effort, or activity within a short period or limited space; designed to achieve maximum effect in a focused manner.",
      "explanation_cn": "指在短时间内或有限空间内具有高度集中、努力或活动的特征；旨在以聚焦的方式实现最大效果。",
      "example_en": "She completed an intensive language course in just three months.",
      "example_cn": "她在短短三个月内完成了一门密集的语言课程。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Involving strong or extreme measures, often to address a problem or achieve a specific goal; not mild or casual.",
      "explanation_cn": "涉及强烈或极端的措施，通常用于解决问题或实现特定目标；非温和或随意的。",
      "example_en": "The farm uses intensive farming methods to maximize crop yield.",
      "example_cn": "该农场采用集约化耕作方法以最大化作物产量。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or involving a high level of detail, scrutiny, or analysis, often in scientific or technical contexts.",
      "explanation_cn": "指在科学或技术语境中涉及高水平的细节、审查或分析。",
      "example_en": "The study conducted an intensive analysis of soil composition across five regions.",
      "example_cn": "这项研究对五个地区的土壤成分进行了深入分析。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "extensive",
      "analysis": "“Extensive”（广泛的）强调范围广、覆盖面积大，常用于描述空间、时间或内容的广度。例如：extensive research（广泛的研究）。而 “intensive” 强调的是密度、深度和集中度，即使范围小，但投入的资源或精力极高。两者常构成对比：extensive but shallow vs. intensive but deep。"
    },
    {
      "word_to_compare": "rigorous",
      "analysis": "“Rigorous”（严格的、严谨的）侧重于方法、标准或程序的严密性和精确性，常用于学术、科学或纪律语境。例如：rigorous testing（严格的测试）。“Intensive” 则更关注投入的强度和集中程度，不一定隐含严谨性。一个过程可以是 intensive（密集）但不 rigorous（不严谨），反之亦然。"
    },
    {
      "word_to_compare": "focused",
      "analysis": "“Focused”（专注的）强调注意力或努力集中在某个特定目标上，是心理或行为层面的集中。而 “intensive” 更强调资源、时间或活动的密度和强度，是一个客观描述。例如：a focused study（专注的研究）可能只是时间短但投入不高；而 an intensive study（密集的研究）则意味着大量时间、人力和资源的投入。"
    }
  ]
}