{
  "word": "interception",
  "pronunciation": "in·ter·sep·shun",
  "concise_definition": "n. 截断, 截获, 抢断",
  "forms": {
    "plural": "interceptions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of stopping or catching something (such as a message, ball, or person) while it is in transit, often by intervening between the sender and the intended recipient.",
      "explanation_cn": "指在某物（如信息、球或人）传输过程中通过介入而将其截停或截获的行为，通常发生在发送者与接收者之间。",
      "example_en": "The quarterback's pass was picked off in a dramatic interception by the cornerback.",
      "example_cn": "四分卫的传球被角卫戏剧性地抢断，完成了一次精彩拦截。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of secretly capturing or accessing communications (e.g., phone calls, emails, or radio signals) without the knowledge of the parties involved.",
      "explanation_cn": "指在未经相关方知情的情况下，秘密截取或获取通信内容（如电话、电子邮件或无线电信号）的行为。",
      "example_en": "The agency was accused of mass interception of private communications.",
      "example_cn": "该机构被指控大规模截获私人通信。"
    },
    {
      "pos": "noun",
      "explanation_en": "In military or strategic contexts, the act of cutting off an enemy's movement, supply line, or communication route to disrupt their operations.",
      "explanation_cn": "在军事或战略语境中，指切断敌方的移动路线、补给线或通信线路以扰乱其行动的行为。",
      "example_en": "The success of the operation depended on the interception of enemy reinforcements before they reached the front line.",
      "example_cn": "此次行动的成功取决于在敌方增援部队抵达前线前将其拦截。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "interference",
      "analysis": "“Interference”（干涉/干扰）泛指任何对正常过程或通信的扰乱，可能是无意的或非针对性的，如信号干扰或他人插手事务。而 “interception” 强调主动、有目的地截取或拦截某物，通常具有明确的目标和行动意图。"
    },
    {
      "word_to_compare": "capture",
      "analysis": "“Capture”（捕获）通常指通过武力或策略使某人或某物落入控制之中，强调结果是占有或控制。而 “interception” 更强调在传输或移动过程中将其截停，不一定最终占有，重点在于中断其原定路径。"
    },
    {
      "word_to_compare": "block",
      "analysis": "“Block”（阻挡）指通过设置障碍阻止某物前进，通常是静态的、预防性的。而 “interception” 是动态的，发生在目标移动过程中，通过主动介入来中断其进程，更具策略性和时机性。"
    }
  ]
}