{
  "word": "intervened",
  "pronunciation": "in·tər·vēnd",
  "concise_definition": "v. 干预, 介入, 插手",
  "forms": {
    "base_form": "intervene",
    "third_person_singular": "intervenes",
    "past_tense": "intervened",
    "past_participle": "intervened",
    "present_participle": "intervening"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To become involved in a situation in order to change its course, especially when it is perceived as necessary or beneficial, often by a third party.",
      "explanation_cn": "指为了改变某种局势的走向而主动介入，通常由第三方发起，且通常认为这种介入是必要或有益的。",
      "example_en": "The teacher intervened when the two students began to argue loudly.",
      "example_cn": "当两名学生开始大声争吵时，老师出面干预了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To mediate or take action in a conflict or crisis to prevent harm or restore order, often by authority or external influence.",
      "explanation_cn": "指在冲突或危机中进行调解或采取行动，以防止伤害或恢复秩序，通常由权威或外部力量实施。",
      "example_en": "The United Nations intervened to stop the civil war and provide humanitarian aid.",
      "example_cn": "联合国介入以制止内战并提供人道主义援助。"
    },
    {
      "pos": "verb",
      "explanation_en": "To interfere in a process or system, sometimes unexpectedly or without being asked, often with the intent to influence the outcome.",
      "explanation_cn": "指在某个过程或系统中进行干涉，有时是出乎意料或未经请求的，通常旨在影响结果。",
      "example_en": "The government intervened in the market to stabilize prices during the shortage.",
      "example_cn": "政府在物资短缺期间介入市场以稳定价格。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "interfere",
      "analysis": "“Interfere” (干涉) 通常带有负面含义，暗示未经允许或不恰当的介入，可能破坏原有秩序。而 “intervene” 更中性或正面，常用于表示有正当理由、负责任的介入，尤其在危机或冲突中。"
    },
    {
      "word_to_compare": "mediate",
      "analysis": "“Mediate” (调解) 是一种特定类型的干预，强调作为中立第三方促进双方沟通与和解。而 “intervene” 范围更广，可以包括强制、命令或单方面行动，不一定包含协商过程。"
    },
    {
      "word_to_compare": "involve",
      "analysis": "“Involve” (涉及) 指使某人或某物成为过程的一部分，但不必然包含主动改变局势的意图。而 “intervene” 强调主动出击、改变现状，通常带有目的性和干预性。"
    }
  ]
}