{
  "word": "introduction",
  "pronunciation": "in·truh·dus·shun",
  "concise_definition": "n. 介绍, 引言, 导入",
  "forms": {
    "plural": "introductions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of presenting or making something known for the first time, especially to a person, group, or audience, in order to familiarize them with it.",
      "explanation_cn": "指首次向某人、群体或观众展示或介绍某事物，以使其熟悉该事物的行为。",
      "example_en": "The professor gave a brief introduction to the key theories of quantum physics.",
      "example_cn": "教授简要介绍了量子物理学的关键理论。"
    },
    {
      "pos": "noun",
      "explanation_en": "The opening section of a book, speech, or piece of music that sets the tone, provides context, or outlines the main topic to follow.",
      "explanation_cn": "指书籍、演讲或乐曲的开篇部分，用于定调、提供背景或概述后续的主要内容。",
      "example_en": "The introduction of the novel establishes the setting and introduces the main characters.",
      "example_cn": "这部小说的引言部分设定了背景并介绍了主要人物。"
    },
    {
      "pos": "noun",
      "explanation_en": "A formal act of bringing two or more people together for the first time, typically by stating their names and relevant details.",
      "explanation_cn": "指首次将两个人或多人正式介绍给彼此，通常通过说出他们的姓名及相关信息来实现。",
      "example_en": "At the conference, there was a formal introduction between the CEO and the visiting diplomat.",
      "example_cn": "在会议上，首席执行官与来访的外交官进行了正式的相互介绍。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "prelude",
      "analysis": "“Prelude”（前奏/序曲）通常指在主要事件或内容开始之前的短暂准备性阶段，常用于音乐或文学中，强调仪式性或象征性，但不一定包含信息传递的功能。而 “introduction” 更侧重于提供实质性的信息、背景或引导，目的性更强。"
    },
    {
      "word_to_compare": "overview",
      "analysis": "“Overview”（概览）是对一个主题或系统的全面、简要的总结，强调完整性与概括性，通常出现在内容主体之后或作为总结。而 “introduction” 是在内容开始前的引导，旨在激发兴趣、建立基础，而非总结已呈现的信息。"
    },
    {
      "word_to_compare": "presentation",
      "analysis": "“Presentation”（展示/陈述）强调以某种形式（如演讲、演示）主动呈现内容，常包含互动、视觉辅助或说服目的。而 “introduction” 更侧重于‘首次引入’，功能上更基础、更中性，不一定包含展示技巧或表演成分。"
    }
  ]
}