{
  "word": "intrigue",
  "pronunciation": "in·trēg",
  "concise_definition": "n. 阴谋, 诡计; v. 引起兴趣, 暗中策划",
  "forms": {
    "third_person_singular": "intrigues",
    "past_tense": "intrigued",
    "past_participle": "intrigued",
    "present_participle": "intriguing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A secret or complex scheme, often involving manipulation or deception, especially in politics or personal relationships.",
      "explanation_cn": "指一种秘密或复杂的计划，通常涉及操纵或欺骗，尤其在政治或人际关系中。",
      "example_en": "The palace was the center of political intrigue for decades.",
      "example_cn": "几十年来，这座宫殿一直是政治阴谋的中心。"
    },
    {
      "pos": "noun",
      "explanation_en": "A feeling of curiosity or fascination, especially when something is mysterious or unusual.",
      "explanation_cn": "指因某事物神秘或不寻常而产生的强烈好奇心或着迷感。",
      "example_en": "The novel’s ending left readers in a state of intrigue.",
      "example_cn": "这部小说的结局让读者充满好奇。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause someone to become curious, interested, or fascinated, often by being mysterious or unusual.",
      "explanation_cn": "指通过神秘或不寻常的特质引起某人的好奇、兴趣或着迷。",
      "example_en": "Her mysterious past intrigued everyone at the party.",
      "example_cn": "她神秘的过去让派对上的每个人都感到好奇。"
    },
    {
      "pos": "verb",
      "explanation_en": "To engage in secret or underhanded schemes, especially to gain power or advantage.",
      "explanation_cn": "指暗中策划或从事秘密、不正当的手段，以获取权力或优势。",
      "example_en": "They were accused of intriguing against the prime minister.",
      "example_cn": "他们被指控暗中策划反对首相。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "conspiracy",
      "analysis": "“Conspiracy” (阴谋) 指多个参与者共同策划的非法或不道德行为，强调集体性和违法性，通常带有法律或道德谴责色彩。而 “intrigue” 更侧重于策略性、权术性的秘密活动，不一定违法，常用于政治或社交场合的微妙操纵。"
    },
    {
      "word_to_compare": "fascination",
      "analysis": "“Fascination” (着迷) 是一种纯粹的情感反应，指被某事物强烈吸引，不包含任何操纵或计划的成分。而 “intrigue” 作为动词时，强调主动引发这种着迷，作为名词时则隐含着神秘背后的算计，比 “fascination” 更具复杂性和潜在的负面含义。"
    },
    {
      "word_to_compare": "charm",
      "analysis": "“Charm” (魅力) 指通过优雅、友善或吸引力自然地赢得他人好感，通常是正面且公开的。而 “intrigue” 通过神秘、悬念或策略激发兴趣，常带有隐蔽性甚至操纵性，其吸引力更偏向智力或心理层面，而非情感上的亲和力。"
    }
  ]
}