{
  "word": "invading",
  "pronunciation": "in·veyd·iŋ",
  "concise_definition": "v. 侵略, 侵入, 侵袭",
  "forms": {
    "base_form": "invade",
    "third_person_singular": "invades",
    "past_tense": "invaded",
    "past_participle": "invaded",
    "present_participle": "invading"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To enter and take control of a country or territory by force, typically with military power, often violating sovereignty or legal boundaries.",
      "explanation_cn": "指以武力进入并控制一个国家或领土，通常侵犯其主权或法律边界。",
      "example_en": "The army was accused of invading neighboring territory without provocation.",
      "example_cn": "该军队被指控在没有挑衅的情况下入侵了邻国领土。"
    },
    {
      "pos": "verb",
      "explanation_en": "To enter or spread into a place or system in an unwelcome or disruptive way, often referring to organisms, ideas, or technologies.",
      "explanation_cn": "指以不受欢迎或破坏性的方式进入或扩散到某个地方或系统中，常用于描述生物、思想或技术的侵入。",
      "example_en": "Invasive species are invading the local ecosystem and threatening native wildlife.",
      "example_cn": "入侵物种正在侵入当地生态系统，威胁本土野生动物。"
    },
    {
      "pos": "verb",
      "explanation_en": "To intrude upon someone’s personal space, privacy, or rights in an unwelcome or overbearing manner.",
      "explanation_cn": "指以不受欢迎或强加的方式侵入他人的私人空间、隐私或权利。",
      "example_en": "The paparazzi were accused of invading the celebrity’s privacy by following her everywhere.",
      "example_cn": "狗仔队因无处不在地跟踪这位名人而被指控侵犯其隐私。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "intruding",
      "analysis": "“Intruding” (侵入) 通常指轻微或非暴力地进入私人领域，强调对边界或隐私的冒犯，语气较轻，常用于个人或社会层面。而 “invading” 更具侵略性和强制性，常涉及权力、武力或大规模的系统性渗透。"
    },
    {
      "word_to_compare": "conquering",
      "analysis": "“Conquering” (征服) 强调通过武力取得胜利并建立长期统治，通常包含政治或文化上的同化过程。而 “invading” 更侧重于进入和占领的初始行动，不一定包含后续的统治或整合。"
    },
    {
      "word_to_compare": "encroaching",
      "analysis": "“Encroaching” (蚕食/逐步侵犯) 指缓慢、渐进地侵占他人权利、土地或空间，通常不使用暴力，而是利用模糊边界或法律漏洞。而 “invading” 是突然、直接且具有冲击性的行为，带有明确的敌意和强制性。"
    }
  ]
}