{
  "word": "invasive",
  "pronunciation": "in·vay·siv",
  "concise_definition": "adj. 侵入的, 侵袭的, 侵略性的",
  "forms": {
    "comparative": "more invasive",
    "superlative": "most invasive"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Tending to invade or encroach upon an area, system, or organism, often causing harm or disruption; typically used to describe non-native species that spread aggressively and outcompete native ones.",
      "explanation_cn": "倾向于侵入某一区域、系统或生物体，通常造成损害或干扰；常用于描述非本地物种，它们会迅速扩散并排挤本地物种。",
      "example_en": "The invasive plant species has taken over the wetland, choking out native flora.",
      "example_cn": "这种入侵性植物已占据湿地，抑制了本地植物的生长。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Medical procedures or devices that involve entering the body through incision or insertion, often posing risks such as infection or tissue damage.",
      "explanation_cn": "指通过切口或插入方式进入人体的医疗程序或器械，通常可能带来感染或组织损伤等风险。",
      "example_en": "Laparoscopic surgery is less invasive than open abdominal surgery.",
      "example_cn": "腹腔镜手术比开腹手术创伤更小。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by aggressive or unwelcome intrusion into personal space, privacy, or boundaries; often used to describe behavior or technology.",
      "explanation_cn": "指具有侵略性或令人不悦的侵入性，常用于描述对个人空间、隐私或界限的干涉行为或技术。",
      "example_en": "The app's invasive data collection practices raised serious privacy concerns.",
      "example_cn": "该应用程序侵入性的数据收集做法引发了严重的隐私担忧。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "intrusive",
      "analysis": "“Intrusive”（侵扰的）更侧重于对个人隐私、情感或空间的主观侵扰，常用于描述行为、广告或技术带来的不适感，如“intrusive ads”（烦人的广告）。“Invasive”则更强调物理性或系统性的渗透与破坏，尤其在生态或医学语境中更具客观危害性。"
    },
    {
      "word_to_compare": "aggressive",
      "analysis": "“Aggressive”（具攻击性的）泛指主动出击、具有敌意或强势的行为，可用于人际、体育或商业语境，但不必然涉及“侵入”。“Invasive”则特指通过进入或渗透造成影响，强调空间或系统的边界被突破，语义范围更具体。"
    },
    {
      "word_to_compare": "foreign",
      "analysis": "“Foreign”（外来的）仅描述来源不属于本地，是中性词，不隐含危害或扩散行为。而 “invasive” 在指物种或技术时，暗含了“外来且有害”的双重含义，是“foreign”在特定语境下的强化版本。"
    }
  ]
}