{
  "word": "invaders",
  "pronunciation": "in·vey·durs",
  "concise_definition": "n. 入侵者, 攻占者, 侵略者",
  "forms": {
    "singular": "invader"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person, group, or force that enters a country, territory, or system by force, typically with the intent to conquer, occupy, or control it.",
      "explanation_cn": "指以武力进入一个国家、领土或系统，通常意图征服、占领或控制该地的人、群体或力量。",
      "example_en": "The ancient Romans were invaders who expanded their empire across Europe and North Africa.",
      "example_cn": "古罗马人是入侵者，他们将帝国扩张至欧洲和北非。"
    },
    {
      "pos": "noun",
      "explanation_en": "An organism or substance that enters an ecosystem, organism, or digital system and disrupts its natural balance or function, often causing harm.",
      "explanation_cn": "指进入生态系统、生物体或数字系统并破坏其自然平衡或功能的生物或物质，通常会造成损害。",
      "example_en": "Invasive species like the zebra mussel are considered ecological invaders in freshwater lakes.",
      "example_cn": "斑马贻贝等入侵物种被视为淡水湖泊中的生态入侵者。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or entity that intrudes into a private space, domain, or personal boundary without permission, often in a threatening or unwelcome way.",
      "explanation_cn": "指未经许可擅自闯入私人空间、领域或个人界限的人或实体，通常具有威胁性或令人不悦。",
      "example_en": "The hackers were identified as digital invaders who breached the company's security system.",
      "example_cn": "这些黑客被认定为数字入侵者，他们突破了公司的安全系统。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "intruders",
      "analysis": "“Intruders”（闯入者）泛指任何未经允许进入某地或某系统的人或物，语气较中性，不一定带有暴力或征服意图。而 “invaders” 强调武力入侵和占领目的，更具侵略性和政治/军事色彩。"
    },
    {
      "word_to_compare": "conquerors",
      "analysis": "“Conquerors”（征服者）侧重于成功占领并统治某地的主体，强调结果——已取得控制权。而 “invaders” 仅指实施入侵行为的主体，不一定成功。例如，一个失败的入侵者不是征服者。"
    },
    {
      "word_to_compare": "colonizers",
      "analysis": "“Colonizers”（殖民者）通常指以建立长期定居点和文化统治为目的进入他国的人群，其行为常伴随系统性剥削和文化同化。虽然殖民者常是入侵者，但 “invaders” 更强调武力进入的瞬间行为，而 “colonizers” 更侧重长期的制度性控制。"
    }
  ]
}