{
  "word": "investigations",
  "pronunciation": "in·vee·tih·gay·shuhnz",
  "concise_definition": "n. 调查, 研究, 侦查",
  "forms": {
    "singular": "investigation"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A detailed and systematic examination or inquiry into a matter, often to uncover facts, determine causes, or establish responsibility, especially in legal, scientific, or official contexts.",
      "explanation_cn": "对某一事项进行的详细而系统的审查或探究，通常旨在揭示事实、查明原因或确定责任，尤其用于法律、科学或官方场合。",
      "example_en": "The police launched a full investigation into the suspicious death.",
      "example_cn": "警方对这起可疑死亡事件展开了全面调查。"
    },
    {
      "pos": "noun",
      "explanation_en": "An academic or scientific effort to explore a phenomenon, collect data, and draw conclusions based on evidence.",
      "explanation_cn": "指为探索某种现象、收集数据并基于证据得出结论而进行的学术或科学研究。",
      "example_en": "His investigations into climate patterns revealed a troubling trend over the past century.",
      "example_cn": "他对气候模式的研究揭示了过去一个世纪中一个令人担忧的趋势。"
    },
    {
      "pos": "noun",
      "explanation_en": "A formal process conducted by authorities or committees to examine misconduct, corruption, or systemic failures.",
      "explanation_cn": "指由权威机构或委员会进行的正式程序，用以审查不当行为、腐败或系统性失败。",
      "example_en": "The parliamentary investigation exposed widespread corruption in the ministry.",
      "example_cn": "议会调查揭露了该部门普遍存在的腐败现象。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "inquiry",
      "analysis": "“Inquiry”（询问/调查）范围更广，可指任何形式的提问或初步探查，不一定具有系统性或正式性。而 “investigation” 强调深入、有组织、证据导向的调查过程，通常涉及收集物证、访谈证人等正式手段。"
    },
    {
      "word_to_compare": "probe",
      "analysis": "“Probe”（深入调查）常用于比喻性语境，强调调查的深入性和突然性，有时带有秘密或突击性质。它更口语化，常用于新闻报道中，如 “a probe into corruption”。而 “investigation” 更正式、全面，是法律或学术语境中的标准术语。"
    },
    {
      "word_to_compare": "research",
      "analysis": "“Research”（研究）侧重于系统性地收集和分析信息以增进知识，通常不带有追责或执法目的。而 “investigation” 更常用于发现真相、追究责任或解决具体问题，具有更强的目的性和结果导向性。"
    }
  ]
}