{
  "word": "investigating",
  "pronunciation": "in·ves·tuh·gay·ting",
  "concise_definition": "v. 调查, 研究, 侦查",
  "forms": {
    "base_form": "investigate",
    "third_person_singular": "investigates",
    "past_tense": "investigated",
    "past_participle": "investigated",
    "present_participle": "investigating"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To examine or inquire into something systematically, especially to discover facts, uncover the truth, or determine the cause of an event or problem.",
      "explanation_cn": "指系统地检查或调查某事，尤其是为了发现事实、揭示真相或确定事件或问题的原因。",
      "example_en": "Police are investigating the cause of the fire that destroyed the building.",
      "example_cn": "警方正在调查导致这栋大楼被烧毁的火灾原因。"
    },
    {
      "pos": "verb",
      "explanation_en": "To conduct a formal or official inquiry, often in a legal, scientific, or journalistic context, to gather evidence or assess responsibility.",
      "explanation_cn": "指在法律、科学或新闻等正式语境中进行调查，以收集证据或评估责任归属。",
      "example_en": "The committee is investigating allegations of corruption within the department.",
      "example_cn": "该委员会正在调查该部门内部的腐败指控。"
    },
    {
      "pos": "verb",
      "explanation_en": "To explore or study a subject in depth, often with the aim of understanding underlying principles or patterns.",
      "explanation_cn": "指深入探索或研究某一主题，通常旨在理解其潜在原理或模式。",
      "example_en": "Scientists are investigating the effects of microplastics on marine ecosystems.",
      "example_cn": "科学家们正在研究微塑料对海洋生态系统的影响。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "examining",
      "analysis": "“Examining” (检查) 通常指较表面或一般的观察与审视，不一定包含系统性探究或寻找真相的意图。而 “investigating” 强调主动、深入、有目的的调查，常伴随证据收集和分析过程。"
    },
    {
      "word_to_compare": "researching",
      "analysis": "“Researching” (研究) 更侧重于通过文献、数据或实验获取新知识，常用于学术或科学领域，过程更理论化。而 “investigating” 更偏向于解决具体问题、查明事实，常涉及实地取证或追查线索，更具实践性和目的性。"
    },
    {
      "word_to_compare": "inquiring",
      "analysis": "“Inquiring” (询问/探询) 通常指提出问题或寻求信息，语气较温和，可能仅限于口头询问。而 “investigating” 是一个更全面、更正式、更结构化的行动，包含观察、分析、取证等多个阶段，通常由权威机构或专业人员执行。"
    }
  ]
}