{
  "word": "ironman",
  "pronunciation": "ai·ern·man",
  "concise_definition": "n. 铁人, 铁人三项运动员, 钢铁侠",
  "forms": {
    "plural": "ironmen"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who competes in an ironman triathlon, a grueling endurance event consisting of a 2.4-mile swim, a 112-mile bicycle ride, and a 26.2-mile marathon run, completed without interruption.",
      "explanation_cn": "指参加铁人三项赛的运动员，该赛事包括2.4英里游泳、112英里自行车骑行和26.2英里马拉松跑，全程不间断完成，是对体能与意志的极致考验。",
      "example_en": "After training for two years, she became the first woman in her region to complete an official ironman.",
      "example_cn": "经过两年的训练，她成为本地区首位完成正式铁人三项赛的女性。"
    },
    {
      "pos": "noun",
      "explanation_en": "A fictional superhero character from Marvel Comics, also known as Tony Stark, a genius inventor who wears a high-tech powered armor suit to fight evil.",
      "explanation_cn": "指漫威漫画中的虚构超级英雄角色，即托尼·斯塔克，一位天才发明家，身穿高科技动力装甲与邪恶势力作战。",
      "example_en": "Ironman's suit is powered by a miniature arc reactor, symbolizing the fusion of technology and human ingenuity.",
      "example_cn": "钢铁侠的战甲由微型弧形反应堆驱动，象征着科技与人类智慧的融合。"
    },
    {
      "pos": "noun",
      "explanation_en": "A metaphorical term for someone who displays extraordinary endurance, resilience, or determination, often in the face of physical or emotional hardship.",
      "explanation_cn": "比喻形容在身体或情感困境中展现出非凡耐力、韧性或决心的人。",
      "example_en": "Despite his injury, he was an ironman, finishing the race on a broken ankle.",
      "example_cn": "尽管脚踝骨折，他仍是个铁人，坚持跑完了全程。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "athlete",
      "analysis": "“Athlete”（运动员）是泛指参与体育运动的人，不特指耐力极限挑战者。而 “ironman” 专指完成铁人三项赛的运动员，具有明确的赛事标准和极高的体能门槛，强调极端耐力而非一般竞技能力。"
    },
    {
      "word_to_compare": "superhero",
      "analysis": "“Superhero”（超级英雄）是泛指拥有超自然能力或高科技装备、以正义为使命的虚构角色，如蜘蛛侠、雷神等。而 “ironman” 是超级英雄的一种，其独特性在于其能力完全源于科技而非天生异能，且该词在现实语境中也用于形容人类极限挑战者，具有双重含义。"
    },
    {
      "word_to_compare": "tough guy",
      "analysis": "“Tough guy”（硬汉）是口语化表达，泛指性格坚强、不轻易示弱的人，常用于形容心理或态度上的坚韧，但不涉及具体行为或成就。而 “ironman” 不仅指精神坚韧，更强调通过可衡量的、极端的体能挑战所证明的实质耐力，更具客观性和仪式感。"
    }
  ]
}