{
  "word": "irony",
  "pronunciation": "ai·ruh·nee",
  "concise_definition": "n. 反讽, 讽刺, 意外的结果",
  "forms": {
    "plural": "ironies"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A situation in which the opposite of what is expected happens, often in a way that is humorously or tragically incongruous, highlighting the discrepancy between appearance and reality.",
      "explanation_cn": "指发生的事情与预期完全相反，往往带有幽默或悲剧性的不协调感，突显表象与现实之间的矛盾。",
      "example_en": "It's ironic that the fire station burned down last night.",
      "example_cn": "消防站昨晚被烧毁，这真是讽刺。"
    },
    {
      "pos": "noun",
      "explanation_en": "A rhetorical device in which words are used to convey a meaning that is the opposite of their literal meaning, often to express sarcasm or criticism.",
      "explanation_cn": "一种修辞手法，指使用字面意思相反的词语来表达讽刺或批评的含义。",
      "example_en": "She said, 'Oh, great!' when her car broke down again — that was pure irony.",
      "example_cn": "她的车又坏了，她却说：‘太棒了！’——这完全是反讽。"
    },
    {
      "pos": "noun",
      "explanation_en": "A literary or dramatic technique where the audience understands the true significance of a situation, while the characters do not, creating tension or emotional depth.",
      "explanation_cn": "一种文学或戏剧手法，指观众或读者理解情境的真实含义，而剧中人物却不知情，从而制造张力或情感深度。",
      "example_en": "In Shakespeare’s Romeo and Juliet, the audience knows Juliet is not dead, but Romeo does not — this is dramatic irony.",
      "example_cn": "在莎士比亚的《罗密欧与朱丽叶》中，观众知道朱丽叶并未死亡，但罗密欧不知道——这是戏剧性反讽。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sarcasm",
      "analysis": "“Sarcasm”（讽刺）是一种带有攻击性或嘲弄语气的语言表达，通常直接说出与真实意图相反的话，目的是贬低或挖苦。而 “irony” 更侧重于情境或事件本身的荒谬性，不一定涉及言语，也不一定带有恶意。"
    },
    {
      "word_to_compare": "satire",
      "analysis": "“Satire”（讽刺文学/讽刺）是一种通过夸张、模仿或反讽来批评社会、政治或人性的文学或艺术形式，它常使用 irony 作为手段，但范围更广，包含结构、人物和情节的整体设计。Irony 是 satire 的工具之一，而 satire 是一种完整的创作类型。"
    },
    {
      "word_to_compare": "coincidence",
      "analysis": "“Coincidence”（巧合）指两个或多个事件偶然同时发生，没有内在逻辑或意义。而 “irony” 强调的是事件之间的反差和意义的反转，具有强烈的意图感或象征性。例如，下雨天忘带伞是巧合；但一个气象学家在雨天被雷劈中，就是讽刺。"
    }
  ]
}