{
  "word": "islamic",
  "pronunciation": "is·lam·ik",
  "concise_definition": "adj. 伊斯兰的, 伊斯兰教的",
  "forms": {
    "comparative": "more islamic",
    "superlative": "most islamic"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or associated with Islam, its teachings, practices, culture, or followers; describing anything that conforms to the principles of the Islamic faith.",
      "explanation_cn": "与伊斯兰教及其教义、实践、文化或信徒相关的；指任何符合伊斯兰信仰原则的事物。",
      "example_en": "The architecture of the mosque reflects traditional Islamic design.",
      "example_cn": "这座清真寺的建筑体现了传统的伊斯兰风格。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Governed by or based on Islamic law (Sharia), especially in the context of legal, financial, or social systems.",
      "explanation_cn": "以伊斯兰教法（沙里亚法）为基础或受其管辖的，尤其用于法律、金融或社会制度的语境中。",
      "example_en": "Many banks now offer islamic banking services that avoid interest-based transactions.",
      "example_cn": "许多银行现在提供不涉及利息交易的伊斯兰银行业务。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characteristic of or typical of Muslim societies, including customs, dress, language, or behavior rooted in Islamic tradition.",
      "explanation_cn": "具有穆斯林社会特征的，或典型的，包括根植于伊斯兰传统的习俗、服饰、语言或行为。",
      "example_en": "She wears an islamic veil as a sign of religious devotion.",
      "example_cn": "她佩戴伊斯兰头巾，以表达宗教虔诚。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "muslim",
      "analysis": "“Muslim”（穆斯林）是名词或形容词，指信仰伊斯兰教的人或与穆斯林个体相关的事物，强调主体是人；而 “islamic” 是纯粹的形容词，描述与宗教体系、文化或制度相关的事物，不直接指人。例如：a muslim person（穆斯林个人），an islamic state（伊斯兰国家）。"
    },
    {
      "word_to_compare": "arab",
      "analysis": "“Arab”（阿拉伯的）指与阿拉伯民族、语言或地理区域相关的事物，主要基于种族和语言，而非宗教。许多阿拉伯人是穆斯林，但并非所有穆斯林都是阿拉伯人，也并非所有阿拉伯人信仰伊斯兰教。因此，“islamic” 是宗教属性，而 “arab” 是民族/语言属性，二者不可互换。"
    },
    {
      "word_to_compare": "oriental",
      "analysis": "“Oriental”（东方的）是一个过时且常具刻板印象的术语，泛指亚洲或中东地区，带有殖民时代的文化偏见。它不涉及宗教内容，而 “islamic” 是精确的宗教文化术语。现代语境中应避免使用 “oriental” 来描述伊斯兰文化，而应使用 “islamic” 或 “middle eastern” 等更准确的词汇。"
    }
  ]
}