{
  "word": "issue",
  "pronunciation": "is·shoo",
  "concise_definition": "n. 问题, 争议, 期刊期号, 发行; v. 发布, 发放, 提出",
  "forms": {
    "third_person_singular": "issues",
    "past_tense": "issued",
    "past_participle": "issued",
    "present_participle": "issuing",
    "plural": "issues"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A topic or matter that is being discussed, debated, or considered, often one that is important, controversial, or requires resolution.",
      "explanation_cn": "指正在被讨论、争论或考虑的重要、有争议或需要解决的问题或议题。",
      "example_en": "Climate change is one of the most pressing issues of our time.",
      "example_cn": "气候变化是我们这个时代最紧迫的问题之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A particular edition or number of a newspaper, magazine, or other periodical publication.",
      "explanation_cn": "指报纸、杂志或其他定期出版物的某一特定期号。",
      "example_en": "The latest issue of National Geographic features endangered species.",
      "example_cn": "最新一期的《国家地理》刊登了濒危物种的内容。"
    },
    {
      "pos": "noun",
      "explanation_en": "A formal release or distribution of something, such as official documents, money, or equipment.",
      "explanation_cn": "指正式发布或分发某物，如官方文件、资金或设备。",
      "example_en": "The government issued new identification cards to all citizens.",
      "example_cn": "政府向所有公民发放了新的身份证。"
    },
    {
      "pos": "verb",
      "explanation_en": "To officially release, distribute, or make available something, especially by an authority or organization.",
      "explanation_cn": "指由权威机构或组织正式发布、分发或提供某物。",
      "example_en": "The bank issued a statement denying the rumors.",
      "example_cn": "银行发布声明否认了这些谣言。"
    },
    {
      "pos": "verb",
      "explanation_en": "To raise or bring up a topic for discussion or consideration, especially in a formal context.",
      "explanation_cn": "指在正式场合提出或引入一个议题供讨论或考虑。",
      "example_en": "She issued a challenge to the opposing team during the debate.",
      "example_cn": "她在辩论中向对方团队提出了挑战。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "problem",
      "analysis": "“Problem” (问题) 通常指需要解决的困难、障碍或负面状况，带有较强的负面含义和紧迫性。而 “issue” 更中性，可指任何值得讨论的议题，不一定是负面的，甚至可以是政策或社会层面的广泛议题。"
    },
    {
      "word_to_compare": "matter",
      "analysis": "“Matter” (事情) 是一个更宽泛、更模糊的词，泛指任何被提及或关注的事物，语气较轻。而 “issue” 更强调其重要性、争议性或需要处理的性质，常用于正式语境中。"
    },
    {
      "word_to_compare": "publication",
      "analysis": "“Publication” (出版物) 指的是出版行为或出版物本身，是一个名词，强调形式和媒介。而 “issue” 在指期刊时，特指某一期内容，是出版物的一个具体实例。例如：一本杂志是 publication，而它的第5期是 an issue。"
    },
    {
      "word_to_compare": "release",
      "analysis": "“Release” (发布) 与 “issue” 在动词义项上部分重叠，但 “release” 更常用于信息、产品、音乐、电影等的公开发布，强调“释放”或“解除限制”；而 “issue” 更常用于官方、行政或制度性文件的正式发放，如证件、通知、命令等，带有更强的权威性。"
    }
  ]
}