{
  "word": "jab",
  "pronunciation": "jab",
  "concise_definition": "n. 捶击, 猛刺; v. 捶击, 猛刺",
  "forms": {
    "third_person_singular": "jabs",
    "past_tense": "jabbed",
    "past_participle": "jabbed",
    "present_participle": "jabbing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A quick, sharp punch, especially in boxing, delivered with the front hand to strike an opponent’s face or body.",
      "explanation_cn": "一种快速、有力的拳击，尤其在拳击运动中，用前手击打对手的脸部或身体。",
      "example_en": "He landed a clean jab to the chin, staggering his opponent.",
      "example_cn": "他一记干净利落的直拳击中下巴，让对手踉跄后退。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strike someone or something quickly and sharply with a fist or pointed object, often repeatedly.",
      "explanation_cn": "用拳头或尖锐物体快速而有力地击打某人或某物，常为连续多次。",
      "example_en": "The nurse jabbed the needle into his arm to administer the vaccine.",
      "example_cn": "护士迅速将针头扎进他的手臂注射疫苗。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sharp, critical remark or comment, often delivered in a sudden or sarcastic way.",
      "explanation_cn": "一种尖锐、批评性的言论，通常突然或带有讽刺意味地提出。",
      "example_en": "Her speech was full of jabs at the opposing party’s policies.",
      "example_cn": "她的演讲中充满了对反对党政策的讽刺攻击。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a sharp, critical remark or comment, especially in a teasing or sarcastic tone.",
      "explanation_cn": "以尖锐、批评性的言辞进行攻击，常带有调侃或讽刺的语气。",
      "example_en": "He jabbed at his colleague during the meeting, questioning his competence.",
      "example_cn": "他在会议上讥讽同事，质疑他的能力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "punch",
      "analysis": "“Punch”（拳击）泛指任何形式的拳头打击，可以是重拳、勾拳或直拳，强调力量和冲击力；而 “jab” 特指快速、轻快、以速度和精准为主的前手直拳，常用于试探或干扰，力量较小但频率高。"
    },
    {
      "word_to_compare": "thrust",
      "analysis": "“Thrust”（刺击）通常指用尖锐物体（如剑、矛或针）向前猛刺的动作，强调直线推进和穿透力；“jab” 虽也可用于刺击（如打针），但更常用于拳击语境，且可引申为言语攻击，语义范围更广。"
    },
    {
      "word_to_compare": "barb",
      "analysis": "“Barb”（尖刻的言辞）专指言语中带有讽刺或伤害性的部分，是抽象的攻击；而 “jab” 作为名词时虽也可指言语攻击，但其本义是物理打击，因此更具动作感和形象性，常用于比喻时保留了‘突然、直接’的物理动作特征。"
    }
  ]
}