{
  "word": "jacked",
  "pronunciation": "jak·t",
  "concise_definition": "adj. (俚语) 肌肉发达的, 被偷的, 被抬高的; v. (俚语) 偷窃, 抬高",
  "forms": {
    "comparative": "jacker",
    "superlative": "jackest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Slang term describing a person, especially a man, who has a very muscular, well-defined physique, often achieved through intense weight training.",
      "explanation_cn": "俚语，形容一个人（尤指男性）肌肉发达、体型健硕，通常通过高强度力量训练获得。",
      "example_en": "He’s been hitting the gym hard all summer — now he’s totally jacked.",
      "example_cn": "他整个夏天都在拼命健身——现在浑身都是肌肉了。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Slang used to describe something that has been stolen or taken without permission, especially a vehicle or valuable item.",
      "explanation_cn": "俚语，指某物（尤指车辆或贵重物品）被偷走或未经许可被拿走。",
      "example_en": "My car got jacked last night near the mall.",
      "example_cn": "昨晚我的车在商场附近被偷了。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Slang describing something that has been significantly increased in price, value, or intensity, often unfairly or abruptly.",
      "explanation_cn": "俚语，形容某物的价格、价值或强度被大幅抬高，常带有不公平或突然的意味。",
      "example_en": "They jacked up the rent by 50% this year — it’s insane!",
      "example_cn": "他们今年把房租涨了50%——太离谱了！"
    },
    {
      "pos": "verb",
      "explanation_en": "Slang for stealing or hijacking something, especially a car or personal property.",
      "explanation_cn": "俚语，指偷窃或劫持某物，尤指汽车或个人财物。",
      "example_en": "Some guys jacked a laptop from the coffee shop while the owner wasn’t looking.",
      "example_cn": "几个家伙趁店主不注意，从咖啡店偷走了一台笔记本电脑。"
    },
    {
      "pos": "verb",
      "explanation_en": "Slang for raising or increasing something sharply, especially prices or rates.",
      "explanation_cn": "俚语，指急剧提高某物（尤指价格或费率）。",
      "example_en": "The airline jacked up ticket prices right before the holiday season.",
      "example_cn": "航空公司就在假期前把机票价格大幅提高了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "muscular",
      "analysis": "“Muscular” 是正式用语，仅描述身体肌肉发达的状态，中性客观；而 “jacked” 是强烈口语化表达，带有赞赏或夸张色彩，常用于流行文化中，语义更生动、情绪更浓。"
    },
    {
      "word_to_compare": "stolen",
      "analysis": "“Stolen” 是标准法律术语，指非法占有他人财物；“jacked” 是俚语，语气更粗俗、口语化，常用于非正式语境，如街头对话或影视作品，带有更强的戏剧性和紧迫感。"
    },
    {
      "word_to_compare": "raised",
      "analysis": "“Raised” 是中性、通用的动词，用于任何类型的提升（如价格、声音、手）；“jacked” 作为动词时专指不公正或突然的大幅上涨，带有负面情绪，常用于抱怨或讽刺语境。"
    }
  ]
}