{
  "word": "jacks",
  "pronunciation": "jakz",
  "concise_definition": "n. 千斤顶, 人名（Jack 的复数）, 玩具（如抓子儿）, 美式俚语：优秀的人或事物",
  "forms": {
    "singular": "jack"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A mechanical device used to lift heavy objects, especially vehicles, by applying force through a screw, lever, or hydraulic system.",
      "explanation_cn": "一种通过螺杆、杠杆或液压系统施加力量以抬起重物（尤其是车辆）的机械装置。",
      "example_en": "He used a jack to lift the car so he could change the flat tire.",
      "example_cn": "他用千斤顶把车顶起来，以便更换瘪掉的轮胎。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small toy consisting of five or more metal or plastic pieces, played by tossing and catching them in a specific sequence, commonly known as 'jacks' in children's games.",
      "explanation_cn": "一种儿童玩具，通常由五块或更多金属或塑料小片组成，玩法是抛起小球并依次捡起地上的小片，俗称‘抓子儿’。",
      "example_en": "The children were playing jacks on the sidewalk after school.",
      "example_cn": "放学后，孩子们在人行道上玩抓子儿。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slang term, especially in American English, referring to a person who is excellent, impressive, or of high quality — often used in phrases like 'the real jacks'.",
      "explanation_cn": "美式俚语，指某人非常出色、令人印象深刻或品质优秀，常用于短语如 'the real jacks'（真正厉害的人）。",
      "example_en": "That new guitarist? He’s the real jacks — nobody plays like that.",
      "example_cn": "那个新吉他手？他真是高手——没人能弹得像他那样。"
    },
    {
      "pos": "noun",
      "explanation_en": "A surname or informal name derived from 'Jack', used as a plural to refer to multiple individuals named Jack.",
      "explanation_cn": "由名字 'Jack' 派生的姓氏或非正式称呼，复数形式用于指代多个名叫 Jack 的人。",
      "example_en": "The jacks in our neighborhood all showed up for the block party.",
      "example_cn": "我们街区所有叫 Jack 的人都来参加街区派对了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "jack",
      "analysis": "“Jack” 是单数形式，通常指单一的千斤顶、一个人名或一个玩具；而 “jacks” 是其复数形式，用于指多个千斤顶、多个叫 Jack 的人，或一组抓子儿玩具。在俚语用法中，“jacks” 有时作为集体名词，强调一群优秀的人，比单数更具群体性或强调性。"
    },
    {
      "word_to_compare": "lift",
      "analysis": "“Lift” (举起) 是一个通用动词，泛指任何抬升动作，而 “jacks” 是实现抬升的特定工具。两者词性不同（动词 vs 名词），但语义上相关：jacks 是实现 lift 的手段。"
    },
    {
      "word_to_compare": "toy",
      "analysis": "“Toy” (玩具) 是一个泛称，涵盖所有儿童游戏器具；而 “jacks” 是一种特定类型的玩具，具有明确的规则和物理形态（小金属片+小球）。因此，jacks 是 toy 的一个子类。"
    }
  ]
}