{
  "word": "jam",
  "pronunciation": "jam",
  "concise_definition": "n. 堵塞, 果酱, 困境; v. 堵塞, 压紧, 紧挤",
  "forms": {
    "third_person_singular": "jams",
    "past_tense": "jammed",
    "past_participle": "jammed",
    "present_participle": "jamming"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A situation in which vehicles, people, or things are stuck in a crowded or blocked state, preventing movement or progress.",
      "explanation_cn": "指车辆、人员或物体因过度拥挤或阻塞而无法移动或前进的状态。",
      "example_en": "The highway was a complete jam during the morning rush hour.",
      "example_cn": "早高峰期间，高速公路完全堵死了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sweet, spreadable food made by cooking fruit with sugar, often containing pieces of fruit or pulp.",
      "explanation_cn": "指将水果与糖一起煮制而成的甜味可涂抹食品，通常含有果肉或果浆。",
      "example_en": "She spread strawberry jam on her toast for breakfast.",
      "example_cn": "她早餐在吐司上涂了草莓果酱。"
    },
    {
      "pos": "noun",
      "explanation_en": "A difficult or awkward situation, especially one that is hard to escape from or resolve.",
      "explanation_cn": "指一种困难或尴尬的处境，尤其是难以摆脱或解决的困境。",
      "example_en": "He found himself in a jam when he missed the deadline and lost the client.",
      "example_cn": "当他错过截止日期并失去客户时，他陷入了困境。"
    },
    {
      "pos": "verb",
      "explanation_en": "To block or obstruct something so that it cannot move or function properly.",
      "explanation_cn": "指使某物堵塞或受阻，导致其无法正常移动或运作。",
      "example_en": "The printer jammed because the paper was too thick.",
      "example_cn": "打印机卡纸了，因为纸张太厚。"
    },
    {
      "pos": "verb",
      "explanation_en": "To press or squeeze something tightly into a confined space.",
      "explanation_cn": "指将某物用力压入或挤进狭小的空间。",
      "example_en": "They jammed six people into the tiny elevator.",
      "example_cn": "他们把六个人塞进了这个狭小的电梯里。"
    },
    {
      "pos": "verb",
      "explanation_en": "To play music in an informal, improvisational session, especially among musicians.",
      "explanation_cn": "指音乐家们进行非正式的即兴演奏活动。",
      "example_en": "The band got together after hours to jam and try out new songs.",
      "example_cn": "乐队在下班后聚在一起即兴演奏，尝试新歌。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "block",
      "analysis": "“Block” (阻挡) 强调通过物理或抽象手段阻止通行或进展，通常是主动的、有意识的行为，如设置路障或阻止信息流通。而 “jam” 更强调因过度拥挤或机械故障导致的非自愿性堵塞，常带有混乱或意外的意味。"
    },
    {
      "word_to_compare": "preserve",
      "analysis": "“Preserve” (保存/腌制) 是指通过加工（如加糖、加热）延长水果等食物的保质期，是制作果酱的工艺过程；而 “jam” 是这种加工后的产品本身。两者是过程与结果的关系，不能互换。"
    },
    {
      "word_to_compare": "crisis",
      "analysis": "“Crisis” (危机) 指一种严重且可能带来重大后果的紧急状况，通常具有系统性或战略性影响；而 “jam” 作为困境时，语气更口语化、程度较轻，多用于日常琐事中的麻烦，如交通堵塞或时间紧迫。"
    },
    {
      "word_to_compare": "squeeze",
      "analysis": "“Squeeze” (挤压) 强调施加压力使物体变形或空间变小，常用于物理动作，如挤柠檬或挤公交；而 “jam” 在表示挤压时，隐含了‘过度填充’或‘强行塞入’的意味，常导致卡住或功能失常，比 ‘squeeze’ 更强调结果的不良性。"
    }
  ]
}