{
  "word": "jamming",
  "pronunciation": "jam·ing",
  "concise_definition": "n. 堵塞, 堵塞物; v. 堵塞, 干扰, 即兴演奏",
  "forms": {
    "present_participle": "jamming",
    "past_tense": "jammed",
    "past_participle": "jammed",
    "noun_form": "jam"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A situation in which something is blocked or stuck, preventing normal movement or operation, often due to overcrowding or mechanical failure.",
      "explanation_cn": "指由于过度拥挤或机械故障导致某物被堵塞，从而阻碍正常移动或运作的状态。",
      "example_en": "There was a traffic jamming on the highway during rush hour.",
      "example_cn": "高峰时段高速公路上出现了交通堵塞。"
    },
    {
      "pos": "noun",
      "explanation_en": "The deliberate interference with electronic signals, such as radio, Wi-Fi, or GPS, to prevent communication or tracking.",
      "explanation_cn": "指故意干扰电子信号（如无线电、Wi-Fi 或 GPS），以阻止通信或追踪的行为。",
      "example_en": "The military used jamming devices to disrupt enemy communications.",
      "example_cn": "军队使用干扰设备切断敌方通信。"
    },
    {
      "pos": "verb",
      "explanation_en": "To play music in an improvised, spontaneous manner, especially in jazz or rock, where musicians create melodies and rhythms on the spot.",
      "explanation_cn": "指在爵士乐或摇滚乐中即兴演奏，乐手现场创作旋律与节奏。",
      "example_en": "The band spent the evening jamming in the basement, exploring new sounds.",
      "example_cn": "乐队整晚在地下室即兴演奏，探索新的音乐风格。"
    },
    {
      "pos": "verb",
      "explanation_en": "To force or cram something tightly into a limited space, often causing congestion or pressure.",
      "explanation_cn": "指将某物强行塞进狭小空间，常导致拥挤或压力。",
      "example_en": "They were jamming too many people into the elevator.",
      "example_cn": "他们把太多人塞进了电梯。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "block",
      "analysis": "“Block” (阻挡) 是一个更通用的词，指任何阻止通行或进行的行为，可以是物理的、抽象的或临时的。而 “jamming” 更强调因过度填充或机械卡死导致的堵塞，常带有“卡住”或“过载”的含义，语义更具体、更强烈。"
    },
    {
      "word_to_compare": "interference",
      "analysis": "“Interference” (干扰) 是一个更广泛的术语，泛指任何对信号、过程或系统的扰乱，包括自然干扰或人为干扰。而 “jamming” 特指有目的、主动的电子信号干扰，常用于军事或技术语境，具有更强的恶意性和技术性。"
    },
    {
      "word_to_compare": "improvise",
      "analysis": "“Improvise” (即兴创作) 是一个更广义的词，指在没有准备的情况下即兴创作或行动，可用于语言、表演、解决问题等。而 “jamming” 是音乐领域中特指的即兴演奏行为，具有明确的音乐语境和文化背景，是 “improvise” 在音乐中的具体表现形式。"
    }
  ]
}