{
  "word": "jams",
  "pronunciation": "jamz",
  "concise_definition": "n. 堵塞, 拥堵, 果酱; v. 堵塞, 挤满, 卡住",
  "forms": {
    "singular": "jam"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A situation in which traffic, people, or machinery are stuck or moving very slowly due to overcrowding or obstruction.",
      "explanation_cn": "指因过度拥挤或阻碍而导致交通、人群或机械停滞或移动极其缓慢的状态。",
      "example_en": "The highway was a complete jam during the morning rush hour.",
      "example_cn": "早高峰期间，高速公路完全堵死了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sweet, spreadable preserve made by cooking fruit with sugar and sometimes pectin, often served on bread or toast.",
      "explanation_cn": "指将水果与糖（有时加果胶）一起熬煮制成的甜味果酱，常涂抹在面包或吐司上食用。",
      "example_en": "She spread strawberry jam on her toast for breakfast.",
      "example_cn": "她早餐在吐司上涂了草莓果酱。"
    },
    {
      "pos": "verb",
      "explanation_en": "To block or obstruct something so that it cannot move or function properly.",
      "explanation_cn": "指堵塞或阻碍某物，使其无法正常移动或运作。",
      "example_en": "The printer jammed because the paper was too thick.",
      "example_cn": "打印机卡纸了，因为纸张太厚。"
    },
    {
      "pos": "verb",
      "explanation_en": "To crowd or pack tightly into a confined space, often causing discomfort or difficulty.",
      "explanation_cn": "指将人或物紧密地塞进一个狭小空间，常导致不适或困难。",
      "example_en": "People were jammed into the subway car like sardines.",
      "example_cn": "人们像沙丁鱼一样挤在地铁车厢里。"
    },
    {
      "pos": "noun",
      "explanation_en": "A style of improvised, energetic music, especially in jazz, characterized by rhythmic complexity and spontaneous creativity.",
      "explanation_cn": "指一种即兴、充满活力的音乐风格，尤指爵士乐，以节奏复杂和即兴创作为特征。",
      "example_en": "The band launched into a fiery jam session after the main set.",
      "example_cn": "主演出结束后，乐队开始了一场热烈的即兴演奏。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "congestion",
      "analysis": "“Congestion”（拥堵）是更正式、更广泛的术语，常用于描述交通、人流或生理系统（如鼻腔）的过度拥挤，强调状态本身，不包含“卡住”或“机械故障”的含义。而 “jam” 更口语化，常暗示因障碍物或技术故障导致的完全停滞。"
    },
    {
      "word_to_compare": "preserves",
      "analysis": "“Preserves”（果脯/果酱类）是果酱的上位词，泛指通过糖或盐保存的水果制品，包括整颗水果、果块或果泥；而 “jam” 特指果肉被捣碎、质地较稠的果酱，是“preserves”的一种具体形式。"
    },
    {
      "word_to_compare": "crush",
      "analysis": "“Crush”（压碎）强调物理上的挤压破坏，常用于水果、物体被外力压扁；而 “jam” 作为动词时强调的是“塞满”或“卡住”，不必然造成破坏，如“卡纸”或“堵车”。作为名词时，“crush” 指暗恋，与 “jam” 无语义关联。"
    }
  ]
}