{
  "word": "jar",
  "pronunciation": "jahr",
  "concise_definition": "n. 罐子, 玻璃瓶; v. 震动, 使不协调",
  "forms": {
    "plural": "jars"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A wide-mouthed container, typically made of glass or ceramic, used for storing food, liquids, or other substances.",
      "explanation_cn": "一种宽口容器，通常由玻璃或陶瓷制成，用于储存食物、液体或其他物质。",
      "example_en": "She kept honey in a large glass jar on the kitchen counter.",
      "example_cn": "她把蜂蜜放在厨房台面上的一个大玻璃罐里。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden, harsh, or jarring sound or vibration that causes discomfort or disruption.",
      "explanation_cn": "一种突然、刺耳或令人不适的声响或震动，造成干扰或不协调感。",
      "example_en": "The jar of the train brakes echoed through the station.",
      "example_cn": "火车刹车时发出的刺耳声响在站台回荡。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a sudden, sharp vibration or shock, especially when something collides or moves abruptly.",
      "explanation_cn": "使某物突然发生剧烈震动或冲击，通常指因碰撞或突然移动而引起。",
      "example_en": "The potholes jarred the car's suspension as we drove down the road.",
      "example_cn": "我们开车经过坑洼路面时，坑洞使汽车悬挂系统剧烈震动。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a feeling of unease or conflict by being inconsistent or incongruous with something else.",
      "explanation_cn": "因与某事物不一致或不协调而引起不安或冲突感。",
      "example_en": "His cheerful attitude jarred with the somber mood of the funeral.",
      "example_cn": "他愉快的态度与葬礼的沉重气氛格格不入。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bottle",
      "analysis": "“Bottle”（瓶子）通常指窄口、细颈的容器，多用于盛装液体，如水、酒或药品，强调密封性和便于倾倒的设计。而 “jar” 通常为宽口，便于取用固体或粘稠内容物，如果酱、腌菜，更强调开放性和实用性。"
    },
    {
      "word_to_compare": "vibrate",
      "analysis": "“Vibrate”（振动）是一个中性、技术性的词，指物体快速来回运动，常用于物理或机械语境，如手机振动。而 “jar” 作为动词时，强调的是这种振动带来的不适、突兀或破坏性效果，带有主观感受色彩，常用于描述令人不快的冲击。"
    },
    {
      "word_to_compare": "clash",
      "analysis": "“Clash”（冲突）指两种事物在性质、风格或观点上直接对立，产生矛盾，多用于抽象语境，如音乐风格冲突或意见对立。而 “jar” 在表示不协调时，语气更轻微，强调的是感官或心理上的突兀感，而非激烈对抗，常用于描述氛围、情绪或行为的不和谐。"
    }
  ]
}