{
  "word": "jars",
  "pronunciation": "jahrz",
  "concise_definition": "n. 罐子, 罐子的复数形式; v. 使震惊, 使不协调 (第三人称单数形式)",
  "forms": {
    "singular": "jar",
    "third_person_singular": "jars",
    "past_tense": "jarred",
    "past_participle": "jarred",
    "present_participle": "jarring"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A wide-mouthed container, typically made of glass or ceramic, used for storing food, liquids, or other substances.",
      "explanation_cn": "一种广口容器，通常由玻璃或陶瓷制成，用于储存食物、液体或其他物质。",
      "example_en": "She kept homemade jam in a glass jar on the kitchen shelf.",
      "example_cn": "她把自制的果酱放在厨房架子上的玻璃罐里。"
    },
    {
      "pos": "noun",
      "explanation_en": "A container used in music or slang to refer to a record or a collection of music, especially in the phrase 'a jar of hits'.",
      "explanation_cn": "在音乐或俚语中，指一张唱片或音乐合集，尤其用于短语 'a jar of hits'（一罐热门歌曲）。",
      "example_en": "He dug through his old jars of vinyl records from the '70s.",
      "example_cn": "他翻找着他20世纪70年代的老式黑胶唱片罐。"
    },
    {
      "pos": "verb",
      "explanation_en": "To shock, disturb, or cause a sense of dissonance or incongruity, often used in the phrase 'to jar with' or 'to jar against'.",
      "explanation_cn": "使震惊、扰乱，或引起不协调感，常用于短语 'to jar with'（与……不协调）或 'to jar against'（与……冲突）。",
      "example_en": "The bright neon sign jarred with the quiet, rustic charm of the village.",
      "example_cn": "那醒目的霓虹灯招牌与村庄宁静质朴的风情格格不入。"
    },
    {
      "pos": "verb",
      "explanation_en": "To shake or cause to shake with a sudden, harsh motion, often due to impact or vibration.",
      "explanation_cn": "因突然、猛烈的冲击或震动而使某物摇晃或震动。",
      "example_en": "The old truck jarred violently as it bumped over the potholes.",
      "example_cn": "那辆旧卡车在颠簸的坑洼路上剧烈晃动。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "container",
      "analysis": "“Container”（容器）是更广泛的上位词，泛指任何用于盛放物品的器具，包括箱子、袋子、盒子等。而 “jar” 特指广口、通常为玻璃或陶瓷材质的密封容器，强调其形状和用途（如储藏食品）。"
    },
    {
      "word_to_compare": "vial",
      "analysis": "“Vial”（小瓶）通常指细颈、小容量的玻璃容器，多用于盛放药品或化学试剂，强调精密和密封性。而 “jar” 体积更大、开口更宽，适用于日常储存，如果酱、腌菜等，更偏向家用和非专业场景。"
    },
    {
      "word_to_compare": "shock",
      "analysis": "“Shock”（震惊）作为动词时，强调因突发事件或强烈刺激而引起的心理或情绪上的剧烈反应，常用于人或事件。而 “jar” 作为动词时，更侧重于感官或环境上的不协调感，常用于描述视觉、听觉或氛围上的冲突，语气较轻微且具象。"
    }
  ]
}