{
  "word": "jaw",
  "pronunciation": "jaw",
  "concise_definition": "n. 下颌, 颌骨; v. 喋喋不休, 闲聊",
  "forms": {
    "plural": "jaws"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The bony structure of the mouth that holds the teeth, consisting of the upper jaw (maxilla) and the lower jaw (mandible); often used to refer specifically to the lower jaw.",
      "explanation_cn": "指口腔中承载牙齿的骨性结构，包括上颌（上颚骨）和下颌（下颚骨）；通常特指下颌。",
      "example_en": "The lion opened its jaws wide to roar.",
      "example_cn": "狮子张开大嘴咆哮。"
    },
    {
      "pos": "noun",
      "explanation_en": "A metaphorical or idiomatic reference to speech or authority, often implying forceful or threatening talk (e.g., 'shut your jaw').",
      "explanation_cn": "比喻性或习语性地指说话或权威，常带有强制性或威胁性的言辞含义（如 '闭嘴'）。",
      "example_en": "He gave me a piece of his jaw about being late again.",
      "example_cn": "他又因为迟到被狠狠训了一顿。"
    },
    {
      "pos": "noun",
      "explanation_en": "A part of a tool or device that grips or holds something, such as the clamping mechanism of a vise or pliers.",
      "explanation_cn": "指工具或设备中用于夹持物体的部分，如台钳或钳子的夹持机构。",
      "example_en": "The mechanic tightened the jaws of the wrench to hold the bolt securely.",
      "example_cn": "技工拧紧了扳手的钳口，以牢固夹住螺栓。"
    },
    {
      "pos": "verb",
      "explanation_en": "To talk excessively or incessantly, often in a casual, gossipy, or annoying manner.",
      "explanation_cn": "指喋喋不休地说话，通常以随意、闲聊或令人厌烦的方式。",
      "example_en": "She was jawing on about her vacation for hours.",
      "example_cn": "她一连说了好几个小时的度假经历。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mouth",
      "analysis": "“Mouth”（嘴）泛指面部用于进食和说话的器官，包括嘴唇、舌头、牙齿等，是更广泛的解剖学概念。而 “jaw” 仅指支撑牙齿的骨性结构，是“mouth”的组成部分，更具体、更偏向骨骼结构。"
    },
    {
      "word_to_compare": "chin",
      "analysis": "“Chin”（下巴）是面部下部的软组织部分，位于下颌骨的前端，是“jaw”的外部可见部分，但不包含骨骼本身。“Jaw” 是包含骨骼和肌肉的完整结构，而 “chin” 仅是其最前端的软组织区域。"
    },
    {
      "word_to_compare": "rant",
      "analysis": "“Rant”（大发雷霆地抱怨）指情绪激烈、充满愤怒的长篇大论，强调情感强度和失控。“Jaw” 作为动词则更中性，仅表示持续不断的说话，不一定带有情绪，甚至可以是闲聊或唠叨。"
    }
  ]
}