{
  "word": "jazz",
  "pronunciation": "jaz",
  "concise_definition": "n. 爵士乐, 爵士风格; v. 使充满活力, 用爵士乐伴奏",
  "forms": {
    "plural": "jazzes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A genre of music that originated in African American communities in New Orleans in the late 19th and early 20th centuries, characterized by swing and blue notes, complex chords, call and response vocals, polyrhythms, and improvisation.",
      "explanation_cn": "一种起源于19世纪末至20世纪初美国新奥尔良非裔社区的音乐流派，以摇摆节奏、蓝音、复杂的和弦、应答式演唱、多节奏和即兴演奏为特征。",
      "example_en": "She spent her evenings listening to classic jazz at a small club downtown.",
      "example_cn": "她每晚都在市中心的一家小俱乐部聆听经典的爵士乐。"
    },
    {
      "pos": "noun",
      "explanation_en": "A style or quality characterized by energy, flair, and improvisational spirit, often used metaphorically to describe something lively or inventive.",
      "explanation_cn": "指一种充满活力、风格独特且富有即兴精神的特质，常用于比喻形容某事物生动、富有创意。",
      "example_en": "The designer added a bit of jazz to the otherwise plain interior with colorful accents.",
      "example_cn": "设计师通过一些色彩鲜艳的点缀，为原本朴素的室内增添了几分爵士风格。"
    },
    {
      "pos": "verb",
      "explanation_en": "To enhance or enliven something with energy, excitement, or improvisational elements, often in a playful or informal way.",
      "explanation_cn": "以活力、兴奋感或即兴元素来增强或活跃某事物，通常带有轻松或非正式的意味。",
      "example_en": "The director jazzed up the old script with modern dialogue and pop culture references.",
      "example_cn": "导演用现代对白和流行文化元素为这部老剧本注入了新活力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "blues",
      "analysis": "“Blues” (布鲁斯) 是一种情感深沉、结构较固定的音乐形式，通常以12小节为单位，强调忧郁、痛苦的情绪表达。而 “jazz” 更注重即兴演奏、节奏变化和复杂和声，情绪范围更广，从欢快到深沉皆可。两者虽有历史渊源，但爵士乐的结构更自由、更富实验性。"
    },
    {
      "word_to_compare": "swing",
      "analysis": "“Swing” (摇摆乐) 是爵士乐在1930–40年代的一个子流派，强调强烈的节奏律动和舞蹈性，常由大乐队演奏。虽然所有 swing 都是 jazz，但并非所有 jazz 都是 swing。jazz 是一个更广泛的总称，包含比波普、冷爵士、融合爵士等多种风格，而 swing 仅指特定时期的节奏风格。"
    },
    {
      "word_to_compare": "improvise",
      "analysis": "“Improvise” (即兴创作) 是 jazz 的核心技巧之一，但本身是一个动词，泛指在没有预先准备的情况下即刻创作。而 “jazz” 是一个名词，指代一种完整的音乐体系和文化现象，其中包含即兴，但还包括特定的节奏、和声、乐器编配和历史传统。"
    }
  ]
}