{
  "word": "jelly",
  "pronunciation": "jel·ee",
  "concise_definition": "n. 果冻, 琼脂, 胶状物; v. 变成果冻状",
  "forms": {
    "plural": "jellies"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A soft, semi-solid food made by boiling fruit juice with sugar and pectin, often served as a spread or dessert.",
      "explanation_cn": "一种通过将水果汁与糖和果胶煮沸制成的柔软半固态食品，常作为涂抹酱或甜点食用。",
      "example_en": "She spread strawberry jelly on her toast for breakfast.",
      "example_cn": "她早餐在吐司上涂了草莓果酱。"
    },
    {
      "pos": "noun",
      "explanation_en": "A translucent, gelatinous substance formed by the coagulation of proteins, such as gelatin or agar, used in food, science, or cosmetics.",
      "explanation_cn": "由蛋白质（如明胶或琼脂）凝固形成的半透明胶状物质，常用于食品、科学实验或化妆品中。",
      "example_en": "The laboratory used agar jelly to grow bacterial cultures.",
      "example_cn": "实验室使用琼脂培养基来培养细菌。"
    },
    {
      "pos": "noun",
      "explanation_en": "A colloquial term for the human brain or intellect, often used in phrases like 'lose one's jelly' to mean becoming confused or losing one's nerve.",
      "explanation_cn": "口语中指人的大脑或智力，常用于短语如 'lose one's jelly'，意为变得困惑或失去勇气。",
      "example_en": "After the scary movie, he felt like he'd lost his jelly.",
      "example_cn": "看完恐怖片后，他觉得自己脑子都吓懵了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To become or cause something to become jelly-like in consistency, often due to cooling or chemical reaction.",
      "explanation_cn": "使某物变成果冻状，通常因冷却或化学反应所致。",
      "example_en": "The soup began to jelly as it cooled in the refrigerator.",
      "example_cn": "汤在冰箱里冷却后开始凝固成冻状。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "jam",
      "analysis": "“Jam”（果酱）通常含有果肉碎片，质地较浓稠，而 “jelly”（果冻）是澄清透明的，不含果肉，仅由果汁和凝固剂制成。两者都是水果制品，但制作工艺和口感不同。"
    },
    {
      "word_to_compare": "gel",
      "analysis": "“Gel”（凝胶）是一个更广泛的科学术语，泛指任何具有胶状结构的物质，包括非食用的如头发凝胶、硅胶等。而 “jelly” 通常特指可食用的胶状物，语义范围更窄、更生活化。"
    },
    {
      "word_to_compare": "marmalade",
      "analysis": "“Marmalade”（柑橘果酱）特指用柑橘类水果（如橙子）的果皮和果肉制成的果冻状食品，带有苦味和颗粒感。而 “jelly” 一般不包含果皮，味道更纯净甜美，原料也更广泛。"
    }
  ]
}