{
  "word": "jesuit",
  "pronunciation": "jeh·zoo·it",
  "concise_definition": "n. 耶稣会士, 耶稣会的; adj. 耶稣会的, 精于诡辩的",
  "forms": {
    "plural": "jesuits"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A member of the Society of Jesus, a Roman Catholic religious order founded by Ignatius of Loyola in 1540, known for its emphasis on education, missionary work, and intellectual rigor.",
      "explanation_cn": "指耶稣会的成员，该组织由依纳爵·罗耀拉于1540年创立，以重视教育、传教活动和学术严谨性而著称。",
      "example_en": "The Jesuit priest spent decades teaching in remote villages across Asia.",
      "example_cn": "这位耶稣会神父在亚洲偏远村庄教授了数十年。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is perceived as cunning, scheming, or overly subtle in argument, often in a manipulative or hypocritical way — a usage derived from historical criticisms of Jesuit tactics.",
      "explanation_cn": "指被认为狡猾、工于心计或在辩论中过于迂回的人，常带有操纵性或虚伪的意味——这一用法源于历史上对耶稣会策略的批评。",
      "example_en": "He gave a Jesuit answer, avoiding the real question with layers of legalistic reasoning.",
      "example_cn": "他给出了一个耶稣会式的回答，用层层法律术语回避了真正的问题。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to the Society of Jesus or its members, especially in the context of education, theology, or missionary activity.",
      "explanation_cn": "与耶稣会或其成员相关的，尤指在教育、神学或传教活动方面的。",
      "example_en": "She attended a Jesuit university known for its strong liberal arts curriculum.",
      "example_cn": "她就读于一所以扎实的博雅教育课程著称的耶稣会大学。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by subtle, intricate, or overly rationalized reasoning, often with the implication of deceit or evasion.",
      "explanation_cn": "以微妙、复杂或过度理性化的推理为特征，常暗含欺骗或回避之意。",
      "example_en": "The politician’s Jesuit logic confused even his most loyal supporters.",
      "example_cn": "这位政客的耶稣会式逻辑连他最忠实的支持者都感到困惑。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "missionary",
      "analysis": "“Missionary”（传教士）泛指任何为传播宗教信仰而前往异域或边缘地区传教的人，不限于特定教派。而 “jesuit” 特指耶稣会成员，其传教活动往往与高度组织化的教育体系和学术训练相结合，更具系统性和政治影响力。"
    },
    {
      "word_to_compare": "schemer",
      "analysis": "“Schemer”（阴谋家）泛指任何策划诡计以达成私利的人，贬义明确但无宗教或历史背景。“Jesuit” 作为贬义用法时，带有特定的历史文化烙印，源于16–18世纪欧洲新教徒对耶稣会士在神学辩论和政治中使用辩证法的敌视，因此其语义更复杂、更具语境依赖性。"
    },
    {
      "word_to_compare": "intellectual",
      "analysis": "“Intellectual”（知识分子）强调理性思考与学术能力，是中性或褒义词。而 “jesuit” 在形容人时，虽可能隐含智力上的精明，但常带有负面色彩，暗示其智慧被用于诡辩、掩饰或操控，而非真诚求真。"
    }
  ]
}