{
  "word": "jet",
  "pronunciation": "jet",
  "concise_definition": "n. 喷气式飞机, 喷射, 黑曜石; v. 喷射, 乘喷气式飞机出行",
  "forms": {
    "plural": "jets",
    "third_person_singular": "jets",
    "past_tense": "jetted",
    "past_participle": "jetted",
    "present_participle": "jetting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A large, fast airplane powered by jet engines, typically used for commercial or private air travel.",
      "explanation_cn": "一种由喷气发动机驱动的大型高速飞机，通常用于商业或私人航空旅行。",
      "example_en": "She flew to Paris on a private jet.",
      "example_cn": "她乘坐私人喷气式飞机前往巴黎。"
    },
    {
      "pos": "noun",
      "explanation_en": "A narrow stream or burst of liquid, gas, or other substance ejected forcefully through a small opening.",
      "explanation_cn": "指通过小孔强力喷射出的液体、气体或其他物质的细流或喷涌。",
      "example_en": "A jet of water shot up from the broken pipe.",
      "example_cn": "一根断裂的管道喷出一股水柱。"
    },
    {
      "pos": "noun",
      "explanation_en": "A deep black color or a black gemstone, often used in jewelry.",
      "explanation_cn": "一种深黑色，或指用于珠宝的黑曜石（黑玉），常象征庄重或哀悼。",
      "example_en": "She wore a necklace made of jet beads.",
      "example_cn": "她戴着一条由黑曜石珠子制成的项链。"
    },
    {
      "pos": "verb",
      "explanation_en": "To travel by jet aircraft, especially for business or leisure purposes.",
      "explanation_cn": "指乘坐喷气式飞机出行，尤指为商务或休闲目的。",
      "example_en": "They jetted off to the Caribbean for their honeymoon.",
      "example_cn": "他们乘喷气式飞机前往加勒比海度蜜月。"
    },
    {
      "pos": "verb",
      "explanation_en": "To eject or discharge something forcefully in a stream or burst.",
      "explanation_cn": "指以强力喷射或喷涌的方式释放某物。",
      "example_en": "The fire hose jetted water onto the burning building.",
      "example_cn": "消防水龙带向着火的大楼喷射出大量水柱。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "airplane",
      "analysis": "“Airplane”（飞机）是泛指所有飞行器，包括螺旋桨飞机、小型飞机等；而 “jet” 特指使用喷气发动机的飞机，强调其高速、高功率的特性。所有喷气式飞机都是飞机，但并非所有飞机都是喷气式飞机。"
    },
    {
      "word_to_compare": "spray",
      "analysis": "“Spray”（喷雾）指细小液滴或颗粒的分散喷射，通常范围广、力量弱，如喷雾器；而 “jet” 指集中、强力、连续的喷射流，具有更强的穿透力和方向性，如高压水枪或火箭推进器。"
    },
    {
      "word_to_compare": "stream",
      "analysis": "“Stream”（水流/气流）强调连续、平缓、自然的流动，如溪流或电流；而 “jet” 强调由压力驱动的突然、猛烈、集中的喷射，具有人为或机械的强制性，语义上更动态、更具冲击力。"
    }
  ]
}