{
  "word": "jewish",
  "pronunciation": "joo·uh·wih",
  "concise_definition": "adj. 犹太人的, 犹太教的; n. 犹太人",
  "forms": {
    "comparative": "",
    "superlative": "",
    "noun_form": "Jew"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to the Jewish people, their culture, religion, or history; specifically connected to Judaism, the monotheistic religion originating from the ancient Israelites.",
      "explanation_cn": "与犹太民族、其文化、宗教或历史相关的；特指源于古代以色列人的单一神教——犹太教。",
      "example_en": "She comes from a Jewish family that observes Passover every year.",
      "example_cn": "她来自一个每年都会庆祝逾越节的犹太家庭。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing practices, traditions, language, or customs associated with Jewish communities worldwide, including Yiddish, kosher dietary laws, and religious holidays.",
      "explanation_cn": "描述与全球犹太社群相关的实践、传统、语言或习俗，包括意第绪语、洁食饮食法规和宗教节日。",
      "example_en": "The museum features an exhibit on Jewish art and literature from medieval Europe.",
      "example_cn": "博物馆展出了中世纪欧洲犹太艺术与文学的专题内容。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is a member of the Jewish people, either by ethnicity, religion, or cultural identity; often used to refer to someone who practices Judaism or has Jewish ancestry.",
      "explanation_cn": "指属于犹太民族的人，无论基于血统、宗教信仰还是文化认同；通常指实践犹太教或具有犹太血统的人。",
      "example_en": "Many Jewish communities around the world maintain strong ties to Israel.",
      "example_cn": "世界各地的许多犹太社群都与以色列保持着紧密联系。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "Hebrew",
      "analysis": "“Hebrew”（希伯来语的/希伯来人的）主要指语言（希伯来语）或古代民族（希伯来人），是犹太民族在圣经时代使用的语言和身份称谓。而 “Jewish” 是现代更广泛使用的术语，涵盖宗教、文化、民族身份，不限于语言。希伯来语是犹太教的圣典语言，但并非所有犹太人都说希伯来语。"
    },
    {
      "word_to_compare": "Israelite",
      "analysis": "“Israelite”（以色列人）特指古代《圣经》时代十二支派的后裔，是犹太民族的前身。该词主要用于历史语境，而 “Jewish” 是现代延续的身份标签，包含宗教信仰和文化传承。现代以色列公民不一定是犹太人，而犹太人也不一定居住在以色列。"
    },
    {
      "word_to_compare": "Messianic",
      "analysis": "“Messianic”（弥赛亚派的）指一种融合犹太传统与基督教信仰的宗教运动，其信徒自称是犹太人但相信耶稣是弥赛亚。这与传统犹太教（Jewish）在神学上根本对立，因此 “Messianic” 不是 “Jewish” 的同义词，而是常被犹太社群视为异端。"
    }
  ]
}