{
  "word": "jig",
  "pronunciation": "jig",
  "concise_definition": "n. 舞蹈, 诡计, 工装; v. 跳舞, 欺骗, 用工装固定",
  "forms": {
    "plural": "jigs",
    "third_person_singular": "jigs",
    "past_tense": "jigged",
    "past_participle": "jigged",
    "present_participle": "jigging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A lively, traditional dance, especially one originating in Ireland or England, typically performed to quick, upbeat music.",
      "explanation_cn": "一种活泼的传统舞蹈，尤其起源于爱尔兰或英格兰，通常伴随着轻快、节奏鲜明的音乐表演。",
      "example_en": "The dancers performed a lively jig at the Celtic festival.",
      "example_cn": "舞者们在凯尔特音乐节上跳了一支活泼的吉格舞。"
    },
    {
      "pos": "noun",
      "explanation_en": "A clever or deceptive trick, often used to achieve a goal through cunning or underhanded means.",
      "explanation_cn": "一种巧妙或欺骗性的诡计，常用于通过狡猾或不正当的手段达成目的。",
      "example_en": "The whole scheme was just a jig to get the contract without bidding.",
      "example_cn": "整个计划不过是个骗局，目的是在不竞标的情况下拿到合同。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device or tool used to guide or hold a workpiece during manufacturing or woodworking to ensure accuracy and consistency.",
      "explanation_cn": "一种在制造或木工中用于引导或固定工件的装置，以确保加工的精确性和一致性。",
      "example_en": "The carpenter used a jig to drill identical holes in each panel.",
      "example_cn": "木匠使用一个夹具在每块面板上钻出完全相同的孔。"
    },
    {
      "pos": "verb",
      "explanation_en": "To dance in a lively, bouncy manner, especially to the rhythm of a jig.",
      "explanation_cn": "以活泼、跳跃的方式跳舞，尤其随着吉格舞的节奏。",
      "example_en": "The children jigged around the bonfire, laughing and clapping.",
      "example_cn": "孩子们围着篝火蹦跳跳舞，又笑又拍手。"
    },
    {
      "pos": "verb",
      "explanation_en": "To deceive or trick someone, often in a playful or underhanded way.",
      "explanation_cn": "以一种戏谑或不正当的方式欺骗或愚弄某人。",
      "example_en": "He was just jiggling the system to get extra benefits.",
      "example_cn": "他只是在耍花招，以获取额外福利。"
    },
    {
      "pos": "verb",
      "explanation_en": "To use a jig to guide or hold a workpiece during a manufacturing process.",
      "explanation_cn": "在制造过程中使用夹具来引导或固定工件。",
      "example_en": "The machinist jigged the metal piece to ensure perfect alignment.",
      "example_cn": "技工用夹具固定金属件，以确保完美对齐。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "dance",
      "analysis": "“Dance” 是泛指所有形式的舞蹈，而 “jig” 特指一种节奏快速、动作跳跃的特定传统舞蹈类型。因此，jig 是 dance 的一种子类，更具文化与形式上的限定性。"
    },
    {
      "word_to_compare": "trick",
      "analysis": "“Trick” 是一个更通用的词，泛指任何形式的欺骗或恶作剧，而 “jig” 在表示诡计时带有更强的口语化和狡黠色彩，常暗示一种轻巧、不那么恶意的欺骗，有时甚至带点幽默感。"
    },
    {
      "word_to_compare": "fixture",
      "analysis": "“Fixture” 指固定安装在某处的装置（如灯具、水管），强调永久性或结构性；而 “jig” 是一种临时性、功能性的工具，专为特定制造任务设计，可移动、可更换，强调操作的精确引导而非固定安装。"
    }
  ]
}