{
  "word": "jingle",
  "pronunciation": "jing·gl",
  "concise_definition": "n. 铃声, 清脆的响声; v. 发出清脆的响声",
  "forms": {
    "third_person_singular": "jingles",
    "past_tense": "jingled",
    "past_participle": "jingled",
    "present_participle": "jingling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A short, catchy, and often repetitive melody, especially one used in advertising to promote a product or brand.",
      "explanation_cn": "指一段简短、朗朗上口且常重复的旋律，尤指用于广告中宣传产品或品牌的商业广告曲。",
      "example_en": "The commercial ended with a memorable jingle: 'Snap, crackle, pop!'",
      "example_cn": "广告以一句令人难忘的广告曲结束：‘咔嚓、噼啪、噗！’"
    },
    {
      "pos": "noun",
      "explanation_en": "A light, ringing sound made by small metal objects, such as bells or coins, shaking or colliding with each other.",
      "explanation_cn": "指小金属物体（如铃铛或硬币）相互碰撞或摇晃时发出的清脆响声。",
      "example_en": "The reindeer's harness made a cheerful jingle as they pulled the sleigh.",
      "example_cn": "驯鹿的挽具在拉雪橇时发出欢快的叮当声。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a light, ringing sound, typically by shaking or striking small metal objects.",
      "explanation_cn": "指通过摇晃或敲击小金属物体发出清脆的响声。",
      "example_en": "Her bracelets jingled as she waved goodbye.",
      "example_cn": "她挥手告别时，手镯叮当作响。"
    },
    {
      "pos": "verb",
      "explanation_en": "To compose or perform a short, catchy tune, especially for advertising purposes.",
      "explanation_cn": "指创作或演唱一段简短、易记的旋律，尤指用于广告宣传。",
      "example_en": "The agency jingled their way into the public's memory with a catchy slogan.",
      "example_cn": "这家机构用一句朗朗上口的口号成功让公众记住了他们。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "chime",
      "analysis": "“Chime”（钟声/和声）通常指钟、风铃等发出的和谐、悠扬的响声，常带有庄重或宁静的意味，如教堂钟声。而 “jingle” 更轻快、琐碎，常与金属碰撞、商业广告或节日装饰相关，情感上更活泼甚至俗气。"
    },
    {
      "word_to_compare": "tune",
      "analysis": "“Tune”（曲调）泛指任何有旋律的音乐片段，可以是严肃的、复杂的或艺术性的。而 “jingle” 是 “tune” 的一种特殊类型，特指用于广告、目的性强、结构简单且重复的短曲，强调传播效果而非艺术价值。"
    },
    {
      "word_to_compare": "clink",
      "analysis": "“Clink”（叮当声）描述的是两个硬物（如玻璃杯、金属勺）轻微碰撞时发出的短促、清脆声，通常单次发生。而 “jingle” 多指连续、有节奏的金属响声，常由多个物体（如铃铛串）同时振动产生，更具音乐性和重复性。"
    }
  ]
}