{
  "word": "jinx",
  "pronunciation": "jinks",
  "concise_definition": "n. 不祥之物, 诅咒; v. 使倒霉, 诅咒",
  "forms": {
    "third_person_singular": "jinxes",
    "past_tense": "jinxed",
    "past_participle": "jinxed",
    "present_participle": "jinxing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person, object, or situation believed to bring bad luck or misfortune, often due to superstition or cultural belief.",
      "explanation_cn": "指被认为会带来厄运或不幸的人、物或情境，通常源于迷信或文化信仰。",
      "example_en": "The black cat crossing the road was considered a jinx by the superstitious driver.",
      "example_cn": "那只横穿马路的黑猫被迷信的司机视为不祥之兆。"
    },
    {
      "pos": "noun",
      "explanation_en": "A magical spell or curse intended to cause harm or misfortune to someone.",
      "explanation_cn": "指一种旨在给某人带来伤害或不幸的魔法咒语或诅咒。",
      "example_en": "He muttered a jinx under his breath after losing the game.",
      "example_cn": "他在输掉比赛后低声念了一个诅咒。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause bad luck to happen to someone or something, often unintentionally, especially by speaking about a positive situation too soon.",
      "explanation_cn": "指无意中因过早谈论好事而招致厄运，使某人或某事遭遇不幸。",
      "example_en": "Don't say the team is going to win — you'll jinx them!",
      "example_cn": "别再说球队会赢了——你会招来厄运的！"
    },
    {
      "pos": "verb",
      "explanation_en": "To place a curse or magical spell on someone, typically with the intent to bring misfortune.",
      "explanation_cn": "指对某人施加诅咒或魔法，意图使其遭遇不幸。",
      "example_en": "The witch jinxed the prince, turning him into a frog.",
      "example_cn": "女巫对王子下了诅咒，把他变成了一只青蛙。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "curse",
      "analysis": "“Curse”（诅咒）更正式、更常用于宗教或神话语境，强调一种有意识的、强大的恶意咒语，通常具有超自然力量。而 “jinx” 更口语化，常用于日常迷信情境，不一定涉及真正的魔法，有时仅指因言语不慎而引发的厄运。"
    },
    {
      "word_to_compare": "hex",
      "analysis": "“Hex”（巫术诅咒）特指由巫师或女巫施加的魔法诅咒，具有明确的巫术文化背景，多用于奇幻语境。而 “jinx” 的范围更广，可以是无意识的口误带来的厄运，不一定涉及施咒者或仪式。"
    },
    {
      "word_to_compare": "bad luck",
      "analysis": "“Bad luck”（厄运）是中性描述，仅指不幸事件的发生，不涉及任何主动的施加者或超自然力量。而 “jinx” 暗示厄运是由某种特定的人、物或言语引起的，带有因果和迷信色彩。"
    }
  ]
}