{
  "word": "jock",
  "pronunciation": "jok",
  "concise_definition": "n. 运动员, 书呆子; adj. 运动的, 健壮的",
  "forms": {
    "plural": "jocks"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person, especially a male, who is heavily involved in sports and often associated with physical strength, athleticism, and a stereotypical aggressive or boastful attitude.",
      "explanation_cn": "指尤其男性中热衷于体育运动的人，常与体格强壮、运动能力出众以及刻板的自负或好斗态度相关联。",
      "example_en": "He was the star jock on the high school football team.",
      "example_cn": "他是高中橄榄球队的明星运动员。"
    },
    {
      "pos": "noun",
      "explanation_en": "A derogatory term used in North American slang to describe someone perceived as intellectually shallow, overly focused on sports, and dismissive of academic or artistic pursuits.",
      "explanation_cn": "北美俚语中带有贬义的用法，指被认为智力肤浅、过度专注于体育而轻视学术或艺术追求的人。",
      "example_en": "The movie contrasts the jocks with the nerds in the school cafeteria.",
      "example_cn": "这部电影对比了学校食堂里那些运动员和书呆子。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slang term for an athletic supporter (a protective garment worn by male athletes).",
      "explanation_cn": "指男性运动员穿的护裆（一种保护性内衣）的俚语说法。",
      "example_en": "He forgot his jock before the game and had to borrow one from a teammate.",
      "example_cn": "他比赛前忘了带护裆，只好向队友借了一个。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characteristic of athletes or sports culture, often implying physical prowess or a macho attitude.",
      "explanation_cn": "与运动员或体育文化相关的，常暗示体能出众或阳刚粗犷的态度。",
      "example_en": "The locker room had a jock vibe with posters of pro athletes on the walls.",
      "example_cn": "更衣室里充满了运动员的气息，墙上贴满了职业运动员的海报。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "athlete",
      "analysis": "“Athlete” (运动员) 是一个中性、正式的术语，仅指从事体育运动的人，不带有社会刻板印象或情感色彩。而 “jock” 常带有文化偏见，暗示其性格、态度或社会地位，可能包含贬义或调侃意味。"
    },
    {
      "word_to_compare": "geek",
      "analysis": "“Geek” (书呆子) 与 “jock” 在流行文化中常作为对立面出现：前者代表智力型、内向、专注学术或技术的人，后者代表体能型、外向、重视体育的人。两者都带有刻板印象，但 “geek” 的贬义近年来已逐渐被重新定义为褒义，而 “jock” 的贬义仍较普遍。"
    },
    {
      "word_to_compare": "sportsman",
      "analysis": "“Sportsman” (体育健将/绅士运动员) 强调体育精神、公平竞争和优雅风度，是一个褒义词。而 “jock” 更强调身体能力与社会标签，常忽略道德或礼仪层面，语义范围更窄且更世俗化。"
    }
  ]
}