{
  "word": "joint",
  "pronunciation": "joint",
  "concise_definition": "n. 关节, 接头, 共同的; adj. 共同的, 联合的",
  "forms": {
    "plural": "joints"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The point where two or more bones connect in the body, allowing movement and providing structural support.",
      "explanation_cn": "人体中两块或多块骨头相连接的部位，使身体能够活动并提供结构支撑。",
      "example_en": "She suffered an injury to her knee joint during the soccer match.",
      "example_cn": "她在足球比赛中膝盖关节受伤了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A connection or junction between two parts of a structure, such as in machinery, plumbing, or construction, designed to allow flexibility or secure attachment.",
      "explanation_cn": "结构中两个部分之间的连接处，如机械、管道或建筑中，用于实现灵活性或牢固连接。",
      "example_en": "The plumber checked the pipe joints for leaks.",
      "example_cn": "水管工检查了管道接头是否有泄漏。"
    },
    {
      "pos": "noun",
      "explanation_en": "A place where people gather, especially an informal or unconventional establishment such as a café, bar, or music venue.",
      "explanation_cn": "人们聚集的地方，尤指非正式或非传统的场所，如咖啡馆、酒吧或音乐场地。",
      "example_en": "This little jazz joint downtown is my favorite spot to unwind after work.",
      "example_cn": "市中心这家小爵士酒吧是我下班后放松的最爱之地。"
    },
    {
      "pos": "noun",
      "explanation_en": "A shared or combined interest, responsibility, or involvement between two or more parties.",
      "explanation_cn": "两个或多个主体之间共享的利益、责任或参与。",
      "example_en": "They have a joint venture to build a new housing complex.",
      "example_cn": "他们合作开展了一项建设新住宅区的合资项目。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Shared or undertaken together by two or more parties; involving mutual participation or responsibility.",
      "explanation_cn": "由两个或多个主体共同拥有、承担或参与的，涉及相互合作或责任。",
      "example_en": "The couple filed a joint tax return.",
      "example_cn": "这对夫妇联合申报了所得税。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "connection",
      "analysis": "“Connection” (连接) 是一个更广泛的术语，泛指任何事物之间的联系，可以是物理的、抽象的或情感的，如网络连接、人际关系。而 “joint” 更具体，通常指物理结构中的连接点，或法律/经济上明确的共同参与关系。"
    },
    {
      "word_to_compare": "link",
      "analysis": "“Link” (链接) 强调两个事物之间的纽带或中介，常用于抽象或非实体的连接，如数据链、因果链。而 “joint” 更强调两个部分在物理或功能上的直接交汇点，具有结构性和稳定性。"
    },
    {
      "word_to_compare": "union",
      "analysis": "“Union” (联合/联盟) 通常指组织、团体或国家之间的正式合并或结盟，具有政治或制度性含义，如工会、欧盟。而 “joint” 更中性，可用于日常语境中的合作或物理连接，不必然涉及正式结构。"
    }
  ]
}