{
  "word": "joints",
  "pronunciation": "joint",
  "concise_definition": "n. 关节, 接头, 连接处, 大麻烟卷",
  "forms": {
    "singular": "joint"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The point where two or more bones meet in the body, allowing movement and providing mechanical support.",
      "explanation_cn": "人体中两块或多块骨头相连接的部位，使身体能够活动并提供机械支撑。",
      "example_en": "She suffered an injury to her knee joint after the fall.",
      "example_cn": "她摔倒后膝盖关节受伤了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A connection or junction between two parts, especially in engineering, construction, or plumbing, designed to allow flexibility or secure joining.",
      "explanation_cn": "在工程、建筑或管道中，两个部件之间的连接处或接头，用于实现灵活性或牢固连接。",
      "example_en": "The plumber checked all the pipe joints for leaks.",
      "example_cn": "水管工检查了所有管道接头是否有泄漏。"
    },
    {
      "pos": "noun",
      "explanation_en": "A place where two things meet or join, often used metaphorically to describe a point of intersection or transition.",
      "explanation_cn": "两个事物相交或连接的地方，常用于比喻性地描述交汇点或过渡点。",
      "example_en": "The joint between the city and the countryside is becoming increasingly urbanized.",
      "example_cn": "城市与乡村的交界处正变得越来越城市化。"
    },
    {
      "pos": "noun",
      "explanation_en": "A hand-rolled cigarette containing marijuana, commonly used recreationally or medicinally.",
      "explanation_cn": "一种手工卷制的含有大麻的香烟，常用于娱乐或医疗目的。",
      "example_en": "He lit a joint and passed it to his friend.",
      "example_cn": "他点了一支大麻烟卷，递给了朋友。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "articulation",
      "analysis": "“Articulation”（关节/ articulation）在解剖学中与 “joint” 同义，但更常用于正式或医学语境，强调关节的运动机制和结构复杂性。它也可用于语言学中指发音的清晰度，这是 “joint” 所不具备的含义。"
    },
    {
      "word_to_compare": "connection",
      "analysis": "“Connection”（连接）是一个更广泛的通用词，可指任何类型的联系，包括抽象的（如人际关系、网络连接），而 “joint” 更强调物理上的结合点，尤其在结构或机械系统中具有明确的接口功能。"
    },
    {
      "word_to_compare": "seam",
      "analysis": "“Seam”（接缝）通常指两片材料（如布料、金属板）缝合或焊接形成的线状边缘，强调的是表面的结合痕迹，而 “joint” 更强调结构上的功能性连接，可能隐藏在内部，不一定可见。"
    }
  ]
}