{
  "word": "jonathan",
  "pronunciation": "joh·nath·uhn",
  "concise_definition": "n. 约拿单（人名）",
  "forms": {
    "plural": "jonathans"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A masculine given name of Hebrew origin, meaning 'Yahweh has given' or 'gift of God'. Commonly used in Christian and Jewish traditions, and historically associated with biblical figures such as Jonathan, son of King Saul.",
      "explanation_cn": "源自希伯来语的男性名字，意为‘耶和华所赐’或‘上帝的礼物’。在基督教和犹太传统中广泛使用，历史上常与圣经人物约拿单（扫罗王之子）相关联。",
      "example_en": "Jonathan was the loyal friend of David in the Bible.",
      "example_cn": "在《圣经》中，约拿单是大卫忠诚的朋友。"
    },
    {
      "pos": "noun",
      "explanation_en": "A proper noun used as a surname or family name in various cultures, particularly in English-speaking countries.",
      "explanation_cn": "在多种文化中用作姓氏，尤其在英语国家中作为家族姓氏使用。",
      "example_en": "Dr. Jonathan Smith published a groundbreaking study on climate change.",
      "example_cn": "乔纳森·史密斯博士发表了一项关于气候变化的开创性研究。"
    },
    {
      "pos": "noun",
      "explanation_en": "A colloquial or affectionate term sometimes used to refer to an apple, especially in British English, derived from the name of Jonathan Apple, a 19th-century American farmer who cultivated a popular apple variety.",
      "explanation_cn": "在英式英语中，有时作为‘苹果’的俚语或亲昵说法，源自19世纪美国农民乔纳森·阿普尔，他培育了一种广受欢迎的苹果品种。",
      "example_en": "She bit into a crisp jonathan from the orchard.",
      "example_cn": "她咬了一口果园里新鲜脆爽的乔纳森苹果。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "john",
      "analysis": "“John” 是一个更常见、更通用的男性名字，源自希伯来语“Yohanan”，意为“上帝是仁慈的”。它在英语世界中使用频率远高于 “Jonathan”，后者更正式、更具古典色彩，且常带有宗教或文学联想。"
    },
    {
      "word_to_compare": "jonas",
      "analysis": "“Jona” 或 “Jonas” 是 “Jonathan” 的简短变体或同源形式，源自希伯来语“Yonah”，意为“鸽子”。虽然两者都源于希伯来语名字，但 “Jonas” 更常用于欧洲大陆，而 “Jonathan” 更具盎格鲁-撒克逊传统，且在圣经语境中更完整、更正式。"
    },
    {
      "word_to_compare": "apple",
      "analysis": "虽然 “jonathan” 可作为苹果品种的名称，但它是一个专有名词，特指一种红皮酸甜苹果；而 “apple” 是通用名词，泛指所有苹果种类。使用 “jonathan” 时，语义上强调品种特性，而 “apple” 则是类别总称。"
    }
  ]
}