{
  "word": "jordan",
  "pronunciation": "jor·dan",
  "concise_definition": "n. 约旦（国家）, 约旦河, （姓氏）乔丹",
  "forms": {
    "plural": "Jordans"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The Hashemite Kingdom of Jordan, a country in Western Asia, bordered by Syria, Iraq, Saudi Arabia, and Israel, with Amman as its capital.",
      "explanation_cn": "约旦哈希姆王国，位于西亚的一个国家，毗邻叙利亚、伊拉克、沙特阿拉伯和以色列，首都是安曼。",
      "example_en": "Jordan is known for its ancient ruins, such as Petra, and its rich cultural heritage.",
      "example_cn": "约旦以其古代遗迹（如佩特拉）和丰富的文化遗产而闻名。"
    },
    {
      "pos": "noun",
      "explanation_en": "The Jordan River, a significant river in the Middle East that flows from the Sea of Galilee to the Dead Sea, and holds religious importance in Judaism, Christianity, and Islam.",
      "explanation_cn": "约旦河，中东一条重要河流，从加利利海流向死海，在犹太教、基督教和伊斯兰教中具有宗教意义。",
      "example_en": "According to the Bible, Jesus was baptized in the Jordan River.",
      "example_cn": "根据《圣经》，耶稣在约旦河受洗。"
    },
    {
      "pos": "noun",
      "explanation_en": "A surname, most famously associated with Michael Jordan, the legendary American basketball player who revolutionized the NBA and global sports culture.",
      "explanation_cn": "一个姓氏，最著名的是指迈克尔·乔丹——这位传奇的美国篮球运动员，彻底改变了NBA和全球体育文化。",
      "example_en": "Many children aspire to be like Jordan, wearing his signature sneakers and emulating his dunks.",
      "example_cn": "许多孩子渴望成为像乔丹一样的人，穿着他的标志性球鞋，模仿他的扣篮动作。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "jordan",
      "analysis": "作为专有名词，'Jordan' 与其他常见名词不同，它不具备普通词汇的多义性扩展，而是主要作为地理名称、河流名称或人名使用。因此，其语义边界清晰，不与普通动词或形容词形成语义重叠。与其他地名如 'France' 或 'Nile' 类似，'Jordan' 的语义依赖于其文化、历史和宗教背景，而非语言内部的词义演变。"
    },
    {
      "word_to_compare": "jordan (brand)",
      "analysis": "虽然 'Jordan' 本身是人名，但在现代语境中，'Jordan' 常被用作 'Air Jordan' 品牌的简称，指耐克旗下的篮球鞋系列。这种用法属于品牌化转义，与原义（国家/河流/人名）形成语义延伸，类似 'Nike' 从希腊女神变为运动品牌。这种用法在口语和商业语境中极为普遍，但不属于词典传统定义范畴。"
    },
    {
      "word_to_compare": "jordanian",
      "analysis": "'Jordanian' 是 'Jordan' 的形容词和民族形式，用于描述约旦的国籍、文化或语言特征（如 Jordanian cuisine）。它不是 'Jordan' 的同义词，而是其派生词，用于修饰名词。两者属于词形关系，而非语义等价关系。"
    }
  ]
}