{
  "word": "jubilee",
  "pronunciation": "joo·bil·ee",
  "concise_definition": "n. 纪念日, 周年庆典,  jubilee 年",
  "forms": {
    "plural": "jubilees"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A special anniversary, especially one marking 25, 50, 60, or 70 years of a monarch's reign or an institution's existence, often celebrated with public festivities and ceremonies.",
      "explanation_cn": "指特别的周年纪念日，尤其是君主在位25年、50年、60年或70年，或某个机构成立相应年数的纪念日，通常伴有公众庆祝活动和仪式。",
      "example_en": "The queen's platinum jubilee was celebrated with parades and fireworks across the country.",
      "example_cn": "女王的白金禧年庆典在全国范围内以游行和烟花庆祝。"
    },
    {
      "pos": "noun",
      "explanation_en": "In ancient Israel, a year of emancipation and restoration occurring every 50 years, during which slaves were freed, lands returned to original owners, and debts forgiven, as described in the Bible.",
      "explanation_cn": "根据《圣经》记载，古代以色列每50年一次的‘禧年’，期间奴隶获得自由、土地归还原主、债务被豁免。",
      "example_en": "The concept of the biblical jubilee inspired modern movements for debt relief and social justice.",
      "example_cn": "《圣经》中禧年的概念启发了现代的债务减免与社会正义运动。"
    },
    {
      "pos": "noun",
      "explanation_en": "A period of joyful celebration or rejoicing, often used figuratively to describe a time of great happiness or renewal.",
      "explanation_cn": "指一段充满欢乐与庆祝的时期，常用于比喻性地描述一个充满喜悦或复兴的时光。",
      "example_en": "After years of hardship, the town's reopening felt like a jubilee.",
      "example_cn": "经历了多年的艰难后，小镇的重新开放仿佛是一场欢庆盛会。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "anniversary",
      "analysis": "“Anniversary”（周年纪念日）泛指任何事件发生一周年或整数周年的日子，是中性、通用的术语。而 “jubilee” 特指具有重大意义或传统仪式的里程碑式周年（如25、50年），带有强烈的庆典和文化象征色彩。"
    },
    {
      "word_to_compare": "celebration",
      "analysis": "“Celebration”（庆祝活动）是泛指任何欢庆行为，可以是私人或小型的，如生日派对。而 “jubilee” 是一种制度性、公共性、具有历史或宗教背景的盛大庆典，通常由国家或机构组织，规模宏大且意义深远。"
    },
    {
      "word_to_compare": "festivity",
      "analysis": "“Festivity”（节日气氛）强调的是欢乐、热闹的氛围，是抽象名词，常用于描述情绪或环境。而 “jubilee” 是一个具体的事件或年份，是名词实体，承载着历史、宗教或政治意义，其庆祝形式是其核心组成部分。"
    }
  ]
}