{
  "word": "judah",
  "pronunciation": "joo·duh",
  "concise_definition": "n. 犹大（人名/地名）",
  "forms": {
    "plural": "judahs"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A male given name of Hebrew origin, meaning 'praised' or 'let him be praised'; in the Bible, Judah was the fourth son of Jacob and the ancestor of the tribe of Judah, from which the term 'Jew' is derived.",
      "explanation_cn": "源自希伯来语的男性名字，意为‘被赞美’或‘愿他被赞美’；在《圣经》中，犹大是雅各的第四个儿子，犹大支派的祖先，‘犹太人’（Jew）一词即由此衍生。",
      "example_en": "Judah was known for his leadership and the strength of his tribe in ancient Israel.",
      "example_cn": "犹大在古以色列以其领导力和部族的强盛而闻名。"
    },
    {
      "pos": "noun",
      "explanation_en": "The southern kingdom of ancient Israel after the division of the united monarchy, centered around Jerusalem and inhabited primarily by the tribes of Judah and Benjamin.",
      "explanation_cn": "古代以色列王国分裂后形成的南部王国，以耶路撒冷为中心，主要由犹大支派和便雅悯支派居住。",
      "example_en": "The prophets of Judah warned the people to return to God before the Babylonian exile.",
      "example_cn": "犹大王国的先知们警告人民，在巴比伦流亡之前要回归上帝。"
    },
    {
      "pos": "noun",
      "explanation_en": "A surname or place name in various cultures, often referencing the biblical figure or region.",
      "explanation_cn": "在多种文化中作为姓氏或地名使用，通常指代《圣经》中的人物或地区。",
      "example_en": "She moved to Judah, Pennsylvania, a small town named after the biblical tribe.",
      "example_cn": "她搬到了宾夕法尼亚州的犹大镇，这个小镇以《圣经》中的支派命名。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "jude",
      "analysis": "“Jude” 是 “Judah” 的希腊语或英语简化形式，常用于《新约》中耶稣的兄弟（Jude the Apostle），在现代英语中更常作为独立名字使用。而 “Judah” 更强调其希伯来语根源和《旧约》中的历史与部落背景，语义更厚重、更具宗教与民族意义。"
    },
    {
      "word_to_compare": "jew",
      "analysis": "“Jew”（犹太人）一词源于 “Judah”，指代信仰犹太教或具有犹太血统的人群，是民族与宗教身份的现代延伸。而 “Judah” 本身是古代部落或人名，不直接等同于现代意义上的犹太人，但为后者的词源基础。"
    },
    {
      "word_to_compare": "tribe",
      "analysis": "“Tribe”（部落）是一个泛指族群的通用词，而 “Judah” 特指《圣经》中雅各之子所建立的十二支派之一，具有明确的历史、地理和神学意义。因此，虽然犹大是一个部落，但 “Judah” 承载了远超一般部落名称的文化与宗教重量。"
    }
  ]
}