{
  "word": "judge",
  "pronunciation": "jooj",
  "concise_definition": "n. 法官, 裁判员; v. 判断, 评判, 审判",
  "forms": {
    "third_person_singular": "judges",
    "past_tense": "judged",
    "past_participle": "judged",
    "present_participle": "judging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A public official appointed or elected to preside over court proceedings, interpret laws, and render legal decisions.",
      "explanation_cn": "指被任命或选举产生的公共官员，负责主持法庭程序、解释法律并作出法律裁决。",
      "example_en": "The judge dismissed the case due to lack of evidence.",
      "example_cn": "法官因证据不足驳回了此案。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who evaluates and scores performances in a competition, such as in sports, arts, or beauty pageants.",
      "explanation_cn": "指在体育、艺术或选美比赛等场合中评估和打分的评判员。",
      "example_en": "The panel of judges awarded first prize to the most innovative design.",
      "example_cn": "评审团将一等奖颁给了最具创新性的设计。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form an opinion or make a decision about something or someone, often based on available information or personal standards.",
      "explanation_cn": "指根据现有信息或个人标准对某事或某人形成看法或作出判断。",
      "example_en": "It's not fair to judge a person by their appearance.",
      "example_cn": "以貌取人是不公平的。"
    },
    {
      "pos": "verb",
      "explanation_en": "To officially hear and decide a legal case in a court of law.",
      "explanation_cn": "指在法庭上正式审理并裁决法律案件。",
      "example_en": "The court will judge the defendant next Monday.",
      "example_cn": "法院将于下周一审理被告。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "evaluate",
      "analysis": "“Evaluate” (评估) 更侧重于系统性地分析事物的价值、质量或性能，通常用于学术、工作或技术场景，强调客观标准。而 “judge” 更常包含主观判断，甚至带有道德或情感色彩，如评判行为是否正当。"
    },
    {
      "word_to_compare": "arbitrate",
      "analysis": "“Arbitrate” (仲裁) 指在争议双方之间作为中立第三方进行调解并作出具有约束力的裁决，通常用于商业或法律纠纷的非诉讼解决方式。而 “judge” 是正式司法体系中的角色，其裁决具有法律强制力，程序更严格。"
    },
    {
      "word_to_compare": "decide",
      "analysis": "“Decide” (决定) 是一个更通用的词，泛指在多个选项中选择一个，不一定涉及评判或分析。而 “judge” 隐含了对是非、优劣、对错的衡量过程，常带有价值判断的意味。"
    }
  ]
}