{
  "word": "judged",
  "pronunciation": "joojd",
  "concise_definition": "v. 判断, 评判, 审判 (judge 的过去式和过去分词)",
  "forms": {
    "base_form": "judge",
    "third_person_singular": "judges",
    "present_participle": "judging",
    "past_tense": "judged",
    "past_participle": "judged"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To form an opinion or conclusion about someone or something based on available information, often after careful consideration.",
      "explanation_cn": "基于可获得的信息，经过仔细思考后对某人或某事形成观点或得出结论。",
      "example_en": "The panel judged the competition fairly and awarded the prize to the most innovative design.",
      "example_cn": "评审团公平地评判了比赛，并将奖项颁给了最具创新性的设计。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a formal decision in a court of law, typically by a judge or jury, determining guilt, liability, or a legal outcome.",
      "explanation_cn": "在法庭上由法官或陪审团作出正式裁决，判定有罪、责任或法律结果。",
      "example_en": "The jury judged the defendant guilty of fraud after reviewing all the evidence.",
      "example_cn": "陪审团在审查所有证据后，判定被告犯有欺诈罪。"
    },
    {
      "pos": "verb",
      "explanation_en": "To evaluate the quality, value, or performance of something, especially in a contest or artistic context.",
      "explanation_cn": "尤其在比赛或艺术语境中，对某事物的质量、价值或表现进行评估。",
      "example_en": "The art exhibit was judged by three renowned curators from major museums.",
      "example_cn": "这次艺术展览由三家大型博物馆的三位著名策展人进行评审。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "assessed",
      "analysis": "“Assessed” (评估) 通常用于系统性地衡量价值、状况或风险，常用于财务、教育或行政语境，强调客观标准和量化分析。而 “judged” 更侧重主观判断，可能包含个人偏好或道德评价，尤其在艺术、竞赛或法律裁决中更常见。"
    },
    {
      "word_to_compare": "evaluated",
      "analysis": "“Evaluated” (评价) 与 “judged” 相近，但更中性、更注重过程和分析，常用于绩效、项目或能力的系统性审查。它不必然包含价值判断或裁决，而 “judged” 常隐含最终结论或裁断，带有权威性或决定性。"
    },
    {
      "word_to_compare": "decided",
      "analysis": "“Decided” (决定) 指做出选择或结论，但不一定基于深入分析或评判过程。它可以是随意的、情绪化的或基于直觉的。而 “judged” 暗示了经过观察、权衡和推理后的正式判断，尤其在法律或专业评审语境中具有更强的权威性和严谨性。"
    }
  ]
}