{
  "word": "juggling",
  "pronunciation": "juh·luh·ng",
  "concise_definition": "v. 玩杂技, 同时处理多项任务; n. 杂技表演, 多任务处理",
  "forms": {
    "present_participle": "juggling",
    "past_tense": "juggled",
    "past_participle": "juggled",
    "third_person_singular": "juggles"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To toss and catch several objects (such as balls or clubs) in a continuous, skillful pattern, typically as a form of entertainment.",
      "explanation_cn": "指以连续、熟练的方式抛接多个物体（如球或棒），通常作为一种娱乐表演形式。",
      "example_en": "The circus performer was juggling five flaming torches with remarkable precision.",
      "example_cn": "马戏团演员以惊人的精准度抛接了五支燃烧的火把。"
    },
    {
      "pos": "verb",
      "explanation_en": "To manage or attempt to handle multiple tasks, responsibilities, or demands simultaneously, often under pressure or with limited resources.",
      "explanation_cn": "指在压力或资源有限的情况下，同时处理多项任务、责任或需求。",
      "example_en": "She's juggling a full-time job, night classes, and caring for her young child.",
      "example_cn": "她正同时兼顾全职工作、夜间课程和照顾年幼的孩子。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or art of performing juggling as a skill or entertainment, often involving props like balls, rings, or clubs.",
      "explanation_cn": "指作为技艺或娱乐表演的杂技行为，通常涉及使用球、环或棒等道具。",
      "example_en": "His juggling impressed the crowd at the street festival.",
      "example_cn": "他在街头节日上的杂技表演令观众惊叹。"
    },
    {
      "pos": "noun",
      "explanation_en": "The complex and often stressful process of balancing multiple competing demands or priorities.",
      "explanation_cn": "指在多个相互竞争的需求或优先事项之间进行平衡的复杂且常常令人压力重重的过程。",
      "example_en": "The juggling of deadlines, budgets, and team expectations is a daily challenge for project managers.",
      "example_cn": "平衡截止日期、预算和团队期望是项目经理每天面临的挑战。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "multitasking",
      "analysis": "“Multitasking”（多任务处理）是一个更广泛的术语，泛指同时进行多项任务，通常用于工作或日常生活的语境，不强调技巧性或表演性。而 “juggling” 更具形象性，常隐喻性地表达一种动态、高风险、需要高度协调的平衡状态，带有更强的视觉和情感色彩。"
    },
    {
      "word_to_compare": "balancing",
      "analysis": "“Balancing”（平衡）强调在不同事物之间维持稳定或公平，通常不涉及快速动作或持续的动态操作。而 “juggling” 暗示了持续的、动态的、甚至略显混乱的调整过程，更强调动作的连续性和紧张感。"
    },
    {
      "word_to_compare": "manipulating",
      "analysis": "“Manipulating”（操控）通常指以某种方式控制或影响事物，有时带有负面含义（如操纵他人）。而 “juggling” 是中性或积极的，强调的是协调、技巧和能力，尤其在物理动作或时间管理中体现为一种正面技能。"
    }
  ]
}