{
  "word": "juice",
  "pronunciation": "joo·is",
  "concise_definition": "n. 果汁, 液体, 电能; v. 给...加电, 激励",
  "forms": {
    "plural": "juices"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The natural liquid extracted from fruits or vegetables, often consumed as a beverage.",
      "explanation_cn": "从水果或蔬菜中榨取的天然液体，通常作为饮料饮用。",
      "example_en": "She started her day with a glass of fresh orange juice.",
      "example_cn": "她以一杯新鲜橙汁开启了一天。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slang term for electricity or power, especially in the context of electronic devices or energy supply.",
      "explanation_cn": "俚语，指电能或电力，尤其用于描述电子设备或供电系统中的能量。",
      "example_en": "The phone won't turn on—there's no juice in the battery.",
      "example_cn": "手机开不了机——电池没电了。"
    },
    {
      "pos": "noun",
      "explanation_en": "Slang for influence, energy, or motivation, especially in contexts where someone has the power to get things done.",
      "explanation_cn": "俚语，指影响力、动力或干劲，尤其用于形容某人拥有推动事情进展的能力。",
      "example_en": "He's got the juice to get this project approved by the board.",
      "example_cn": "他有本事让董事会批准这个项目。"
    },
    {
      "pos": "verb",
      "explanation_en": "To supply or charge something with electricity, especially to make a device operational.",
      "explanation_cn": "给某物充电或供电，尤指使设备恢复运作。",
      "example_en": "I need to juice my phone before we leave.",
      "example_cn": "我们出发前得给手机充个电。"
    },
    {
      "pos": "verb",
      "explanation_en": "To energize or stimulate someone or something, often figuratively, to increase enthusiasm or performance.",
      "explanation_cn": "比喻性地激励或激发某人或某事物，以增强热情或表现。",
      "example_en": "The coach juiced up the team with a rousing speech before the game.",
      "example_cn": "教练在比赛前用一番激昂的讲话激励了全队。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "nectar",
      "analysis": "“Nectar”（花蜜）通常指植物分泌的甜味液体，或文学中对果汁的诗意化表达，带有自然、神圣或珍贵的意味。而 “juice” 更口语化、日常化，泛指所有水果或蔬菜榨出的液体，不带情感色彩。"
    },
    {
      "word_to_compare": "power",
      "analysis": "“Power”（电力/权力）是正式术语，用于技术、政治或物理语境中，指能量或控制力。而 “juice” 作为其俚语替代词，更口语、生动，常用于非正式场合，如科技圈或街头文化中，带有更强的拟人化和活力感。"
    },
    {
      "word_to_compare": "essence",
      "analysis": "“Essence”（精华）指某物最核心、最本质的部分，常用于抽象概念（如“香水的精华”或“问题的本质”）。而 “juice” 虽在某些语境中可指“关键要素”，但更偏向于实际可感知的能量或动力，而非哲学意义上的本质。"
    }
  ]
}