{
  "word": "julian",
  "pronunciation": "joo·lee·uhn",
  "concise_definition": "adj. 朱利安的, 公历的; n. 朱利安历, 朱利安日",
  "forms": {
    "comparative": "julianer",
    "superlative": "julianest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to Julius Caesar or the Julian calendar, a solar calendar introduced by Julius Caesar in 46 BCE, which was the predecessor of the modern Gregorian calendar.",
      "explanation_cn": "与尤利乌斯·凯撒或朱利安历有关的，指公元前46年由尤利乌斯·凯撒引入的太阳历，是现代格里高利历的前身。",
      "example_en": "The Julian calendar added a leap day every four years to keep the calendar year synchronized with the solar year.",
      "example_cn": "朱利安历每四年增加一个闰日，以使历年与太阳年保持同步。"
    },
    {
      "pos": "noun",
      "explanation_en": "The Julian calendar, a system of dating used in Europe and the Christian world before the adoption of the Gregorian calendar.",
      "explanation_cn": "朱利安历，一种在采用格里高利历之前在欧洲和基督教世界使用的日期系统。",
      "example_en": "Many Eastern Orthodox churches still use the Julian calendar to determine the date of Easter.",
      "example_cn": "许多东正教教会仍使用朱利安历来确定复活节的日期。"
    },
    {
      "pos": "noun",
      "explanation_en": "A Julian day or Julian date, a continuous count of days since the beginning of the Julian Period used primarily in astronomy and software for time calculations.",
      "explanation_cn": "朱利安日或朱利安日期，自朱利安周期开始以来连续计算的天数，主要用于天文学和软件中的时间计算。",
      "example_en": "Astronomers often record observations using Julian day numbers to avoid confusion between calendar systems.",
      "example_cn": "天文学家通常使用朱利安日数记录观测数据，以避免不同历法系统之间的混淆。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "gregorian",
      "analysis": "“Gregorian”（格里高利的）指1582年由教皇格里高利十三世改革后的历法，修正了朱利安历每年多出约11分钟的误差。两者都是太阳历，但格里高利历更精确，是当今世界通用的公历。朱利安历在宗教和历史研究中仍有使用，而格里高利历是现代标准。"
    },
    {
      "word_to_compare": "calendar",
      "analysis": "“Calendar”（历法）是泛指任何记录日期的系统，如农历、伊斯兰历、朱利安历等。而 “Julian” 是特指由尤利乌斯·凯撒制定的那一种历法，是 “calendar” 的一个具体子类。"
    },
    {
      "word_to_compare": "julius",
      "analysis": "“Julius” 是人名，特指古罗马的尤利乌斯·凯撒，而 “Julian” 是由其名字衍生出的形容词或名词形式，用于描述与他相关的事物，如历法、家族或时代。两者词源相同，但词性和用法不同。"
    }
  ]
}