{
  "word": "jumpers",
  "pronunciation": "jum·pərz",
  "concise_definition": "n. 运动衫, 毛衣, 跳伞者, 跳跃者",
  "forms": {
    "singular": "jumper"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A knitted or sweater-like garment worn over the upper body, especially in British English; often worn for warmth or casual wear.",
      "explanation_cn": "一种针织或类似毛衣的上衣，尤其在英式英语中使用，常用于保暖或休闲穿着。",
      "example_en": "She wore a cozy wool jumper with jeans on the cold winter day.",
      "example_cn": "寒冷的冬日里，她穿着一件舒适的羊毛毛衣搭配牛仔裤。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of children's dress that is worn over a blouse or shirt, typically with straps or sleeves, common in British English.",
      "explanation_cn": "一种儿童穿的连衣裙，通常套在衬衫或上衣外面，带有肩带或袖子，在英式英语中常见。",
      "example_en": "The little girl looked adorable in her blue jumper and white socks.",
      "example_cn": "小女孩穿着蓝色连衣裙和白色袜子，看起来非常可爱。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that jumps, especially in the context of sports or parachuting.",
      "explanation_cn": "指跳跃的人或物，尤其在体育或跳伞语境中。",
      "example_en": "The jumpers leaped from the plane at 15,000 feet, free-falling before deploying their parachutes.",
      "example_cn": "跳伞者从一万五千英尺高空跃下，在打开降落伞前自由落体。"
    },
    {
      "pos": "noun",
      "explanation_en": "In British English, a term sometimes used for athletic shorts or leggings worn during exercise, especially in older usage.",
      "explanation_cn": "在英式英语中，有时用于指运动时穿的短裤或紧身裤（多为旧用法）。",
      "example_en": "He changed into his jumpers before heading to the gym.",
      "example_cn": "他换上运动裤后便去健身房了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sweater",
      "analysis": "“Sweater”（毛衣）是美式英语中对针织上衣的通用说法，而 “jumper” 是英式英语中的对应词，两者在大多数语境下可互换，但 “jumper” 在美式英语中可能被误解为儿童连衣裙。此外，美式英语中 “sweater” 更常用于成人服装，而 “jumper” 在英国可泛指任何针织上衣。"
    },
    {
      "word_to_compare": "dress",
      "analysis": "“Dress”（连衣裙）通常指一件完整的下身连体服装，而英式英语中的 “jumper dress” 是一种无袖或短袖、套在上衣外的儿童连衣裙，结构上更接近背心裙。因此，虽然部分语境下 “jumper” 可指连衣裙，但其功能和穿着方式与传统连衣裙不同。"
    },
    {
      "word_to_compare": "parachutist",
      "analysis": "“Parachutist”（跳伞者）是专业术语，专指进行跳伞运动的人，语气正式且精确；而 “jumper” 是口语化、简化的说法，常用于非正式语境或体育报道中，语义范围更广，也可泛指任何跳跃者（如体操运动员）。"
    }
  ]
}