{
  "word": "jumper",
  "pronunciation": "jum·pər",
  "concise_definition": "n. 跳伞者, 毛衣, 连体衣, 电闸",
  "forms": {
    "plural": "jumpers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who jumps, especially one who jumps from an aircraft using a parachute; a parachutist.",
      "explanation_cn": "指跳跃的人，尤指使用降落伞从飞机上跳下的人；即跳伞者。",
      "example_en": "The jumper landed safely after a 15,000-foot freefall.",
      "example_cn": "这名跳伞者在一万五千英尺的自由落体后安全着陆。"
    },
    {
      "pos": "noun",
      "explanation_en": "A knitted or crocheted garment worn over the upper body, typically with long sleeves and no buttons or zippers; equivalent to a sweater in American English.",
      "explanation_cn": "一种针织或钩编的上衣，通常有长袖，无纽扣或拉链；在美国英语中相当于 'sweater'。",
      "example_en": "She wore a cozy wool jumper with a turtleneck under her coat.",
      "example_cn": "她穿着一件舒适的羊毛毛衣，内搭高领衫，外披外套。"
    },
    {
      "pos": "noun",
      "explanation_en": "A one-piece garment covering the torso and legs, often worn by infants or as workwear; also called a romper or boiler suit.",
      "explanation_cn": "一种覆盖躯干和腿部的连体衣，常用于婴儿或作为工作服；也称为连体裤或工装服。",
      "example_en": "The baby was dressed in a cute cotton jumper with animal prints.",
      "example_cn": "婴儿穿着一件可爱的棉质连体衣，上面印有动物图案。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device or component used to connect or bypass an electrical circuit, often a removable connector or short wire.",
      "explanation_cn": "一种用于连接或绕过电路的装置，通常为可拆卸的连接器或短导线。",
      "example_en": "The technician used a jumper to bypass the faulty switch and restore power.",
      "example_cn": "技术人员使用跳线绕过故障开关，恢复了供电。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sweater",
      "analysis": "“Sweater”（毛衣）是美式英语中与 “jumper”（英式英语）同义的词，均指针织上衣。区别主要在于地域用法：英式英语用 “jumper”，美式英语用 “sweater”。两者在样式和功能上几乎完全相同。"
    },
    {
      "word_to_compare": "parachutist",
      "analysis": "“Parachutist”（跳伞者）是 “jumper” 在跳伞语境下的更正式、更精确的术语。虽然 “jumper” 可用于口语中指跳伞者，但 “parachutist” 更常用于军事、航空或专业语境中，强调技能和训练背景。"
    },
    {
      "word_to_compare": "romper",
      "analysis": "“Romper”（连体裤）特指儿童或休闲穿着的连体衣，通常更轻便、有短袖或短裤，风格更活泼；而 “jumper” 作为连体衣时，可能更偏向工装或保暖用途，覆盖范围更广，语义更宽泛。"
    }
  ]
}