{
  "word": "jumping",
  "pronunciation": "jum·ping",
  "concise_definition": "n. 跳跃, 跳动; adj. 跳跃的, 跳动的",
  "forms": {
    "base_form": "jump",
    "third_person_singular": "jumps",
    "past_tense": "jumped",
    "past_participle": "jumped",
    "present_participle": "jumping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of propelling oneself off the ground using the legs, typically to reach a higher point or cover a distance; often used in sports, physical exercise, or casual movement.",
      "explanation_cn": "指用腿部力量将身体推离地面，通常是为了达到更高处或跨越一段距离；常用于体育、锻炼或日常活动中。",
      "example_en": "The gymnast performed a perfect jumping routine on the balance beam.",
      "example_cn": "体操运动员在平衡木上完成了一套完美的跳跃动作。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden or rapid increase in amount, level, or intensity, often used metaphorically to describe changes in prices, numbers, or emotions.",
      "explanation_cn": "指数量、水平或强度的突然或迅速增加，常用于比喻价格、数字或情绪的急剧变化。",
      "example_en": "There was a jumping increase in online sales during the holiday season.",
      "example_cn": "假期期间，在线销售额出现了激增。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that is active, energetic, or characterized by sudden movements or fluctuations; often used in informal contexts.",
      "explanation_cn": "形容某事物充满活力、躁动不安，或具有突然的移动或波动特征；常用于非正式语境。",
      "example_en": "The jumping beat of the music made everyone want to dance.",
      "example_cn": "音乐中跳跃的节奏让每个人都想跟着跳舞。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "leaping",
      "analysis": "“Leaping” (飞跃) 与 “jumping” 意义相近，但更强调动作的幅度大、距离远或力量强，常带有优雅或戏剧性的色彩。例如，动物跃过沟壑或舞者腾空一跃。“Jumping” 更通用，可指任何高度或距离的跳跃，包括小幅度的原地弹跳。"
    },
    {
      "word_to_compare": "hopping",
      "analysis": "“Hopping” (单脚跳) 指用一只脚连续跳跃，通常动作较小、节奏轻快，常见于儿童游戏或小型动物（如兔子）的移动方式。“Jumping” 则通常指双脚离地的完整跳跃，动作更全面、更有力。"
    },
    {
      "word_to_compare": "bounding",
      "analysis": "“Bounding” (大步跳跃) 强调一种充满弹性和节奏感的连续跳跃，常用于描述动物（如鹿）或运动员在奔跑中轻盈地弹跳前进。它比 “jumping” 更具动态性和流畅性，暗示持续的运动而非单次动作。"
    }
  ]
}