{
  "word": "justifying",
  "pronunciation": "juh·stuh·fahy·ing",
  "concise_definition": "v. 证明…是正当的, 为…辩解, 使…合理化",
  "forms": {
    "base_form": "justify",
    "third_person_singular": "justifies",
    "past_tense": "justified",
    "past_participle": "justified",
    "present_participle": "justifying"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To provide a valid reason or evidence to show that an action, decision, or belief is reasonable, acceptable, or morally right.",
      "explanation_cn": "提供合理的理由或证据，以表明某一行为、决定或信念是合乎情理、可接受或道德上正当的。",
      "example_en": "She was justifying her decision to quit her job by citing chronic stress and lack of support.",
      "example_cn": "她以长期压力和缺乏支持为由，为自己的辞职决定进行辩解。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make something appear acceptable or defensible, often by downplaying its negative aspects or emphasizing its benefits.",
      "explanation_cn": "通过弱化其负面因素或强调其益处，使某事物显得可以被接受或有正当理由。",
      "example_en": "The company is justifying the price hike by claiming increased production costs.",
      "example_cn": "该公司以生产成本上升为由，为价格上涨进行辩解。"
    },
    {
      "pos": "verb",
      "explanation_en": "In typography, to adjust the spacing between words and letters so that the text aligns evenly along both the left and right margins.",
      "explanation_cn": "在排版中，通过调整单词和字母之间的间距，使文本在左右两边都对齐。",
      "example_en": "The editor chose to justify the paragraph to give the document a more formal appearance.",
      "example_cn": "编辑选择将段落两端对齐，使文档看起来更正式。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rationalizing",
      "analysis": "“Rationalizing”（合理化）常带有心理防御的意味，指为不合理的行为或情绪寻找看似合理的借口，有时是自我欺骗。而 “justifying” 更中性，强调基于事实或逻辑的正当性论证，不一定隐含自我欺骗。"
    },
    {
      "word_to_compare": "defending",
      "analysis": "“Defending”（辩护）侧重于在受到批评或攻击时进行反驳，常带有对抗性语境，如法庭辩护或为某人挺身而出。而 “justifying” 更侧重于主动提供理由以证明其合理性，不一定在面对指责时发生。"
    },
    {
      "word_to_compare": "excusing",
      "analysis": "“Excusing”（宽恕/开脱）通常意味着减轻或免除责任，常暗示行为本身有瑕疵，但因特殊原因可被原谅。而 “justifying” 则试图证明行为本身是正当的，无需原谅，因为它本就合理。"
    }
  ]
}