{
  "word": "keel",
  "pronunciation": "keel",
  "concise_definition": "n. 龙骨, 船底中线的纵向结构; v. 翻覆, 倾覆",
  "forms": {
    "plural": "keels",
    "third_person_singular": "keels",
    "past_tense": "keeled",
    "past_participle": "keeled",
    "present_participle": "keeling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The central structural member running longitudinally along the bottom of a ship or boat, providing stability, strength, and hydrodynamic efficiency; it is the backbone of the vessel.",
      "explanation_cn": "船体底部纵向贯穿的主结构构件，提供稳定性、强度和水动力效率，是船舶的脊梁。",
      "example_en": "The ship's keel was damaged during the storm, causing it to list dangerously.",
      "example_cn": "船的龙骨在风暴中受损，导致船身严重倾斜。"
    },
    {
      "pos": "noun",
      "explanation_en": "A long, narrow structure resembling a ship's keel, such as the central ridge of a roof or the bottom of a bird's breastbone.",
      "explanation_cn": "指类似船龙骨的细长结构，如屋顶的屋脊或鸟类胸骨的中央隆起。",
      "example_en": "The keel of the cathedral's roof rises sharply to shed rainwater efficiently.",
      "example_cn": "大教堂屋顶的屋脊高高隆起，以有效排走雨水。"
    },
    {
      "pos": "verb",
      "explanation_en": "To turn over completely, especially of a boat, so that it lies on its side or upside down due to instability or strong winds.",
      "explanation_cn": "指（船）因不稳定或强风而完全倾覆，侧翻或翻转成倒扣状态。",
      "example_en": "The small sailboat keeled over in the sudden gust of wind.",
      "example_cn": "那艘小帆船在一阵突如其来的狂风中翻覆了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or sway suddenly to one side, often used in the phrase 'to keel over' meaning to collapse suddenly, especially due to illness or exhaustion.",
      "explanation_cn": "指突然向一侧倾斜或摇晃，常用于短语 'keel over'，意为突然倒下，多因疾病或疲惫所致。",
      "example_en": "He keeled over at his desk after working 20 hours straight.",
      "example_cn": "他连续工作了二十个小时后，突然倒在了办公桌上。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hull",
      "analysis": "“Hull”（船体）指船舶的整个外部结构，包括船壳、甲板和内部空间，是容纳船员和货物的主体。而 “keel” 是船体内部的核心纵向结构，主要起支撑和稳定作用，是 hull 的一部分，但不等于 hull。"
    },
    {
      "word_to_compare": "fin",
      "analysis": "“Fin”（鳍）通常指鱼类或水下设备（如潜艇、冲浪板）上用于控制方向或稳定性的侧向结构，功能类似 keel，但位置在侧面而非底部，且多用于小型或高速装置。Keel 是大型船舶的纵向主结构，承担更重的承重和抗倾覆任务。"
    },
    {
      "word_to_compare": "capsize",
      "analysis": "“Capsize”（倾覆）是描述船只翻覆的通用动词，强调结果；而 “keel” 作为动词时，是更口语化、形象化的表达，常用于描述船体因失去平衡而突然侧翻的过程，语义更具体、更具画面感。两者可互换，但 “capsize” 更正式、更广泛用于航海术语中。"
    }
  ]
}