{
  "word": "keeper",
  "pronunciation": "kee·puhr",
  "concise_definition": "n. 看守者, 保管者, 门将, 保留物",
  "forms": {
    "plural": "keepers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person responsible for guarding, maintaining, or managing something, such as a building, animal, or collection.",
      "explanation_cn": "指负责看守、维护或管理某物的人，如建筑物、动物或收藏品。",
      "example_en": "The zookeeper fed the lions and cleaned their enclosures every morning.",
      "example_cn": "动物园管理员每天早上给狮子喂食并清理它们的围栏。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who plays the position of goalkeeper in sports such as soccer or hockey, responsible for preventing the opposing team from scoring.",
      "explanation_cn": "指在足球、曲棍球等运动中担任守门员的人，职责是阻止对方得分。",
      "example_en": "The goalkeeper made an incredible save in the final minute of the match.",
      "example_cn": "守门员在比赛最后一分钟做出了一次不可思议的扑救。"
    },
    {
      "pos": "noun",
      "explanation_en": "Something or someone worth keeping, often because of value, emotional significance, or enduring quality.",
      "explanation_cn": "指值得保留的人或物，通常因其价值、情感意义或持久品质。",
      "example_en": "That old photo is a real keeper—it reminds me of my childhood.",
      "example_cn": "那张旧照片真是值得保留的珍品——它让我想起了童年。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device or fastener used to hold something in place, such as a latch, hook, or clip.",
      "explanation_cn": "指用于固定某物的装置或紧固件，如搭扣、挂钩或夹子。",
      "example_en": "The cabinet door wouldn't stay shut until we installed a new keeper.",
      "example_cn": "直到我们安装了一个新的门扣，柜门才关得严实。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "guardian",
      "analysis": "“Guardian”（守护者）更强调保护和防御的职责，常用于法律、亲情或精神层面的保护，如儿童的监护人或守护神。而 “keeper” 更侧重于日常的看管、照料或管理，语义更具体、更实用，常用于动物、物品或体育角色。"
    },
    {
      "word_to_compare": "custodian",
      "analysis": "“Custodian”（保管人）通常用于正式或机构语境，指负责维护公共财产或设施的人，如博物馆的保管员。它比 “keeper” 更正式，且较少用于人或情感价值的语境。而 “keeper” 更口语化，适用范围更广，包括情感上的‘值得保留’。"
    },
    {
      "word_to_compare": "steward",
      "analysis": "“Steward”（管理员/管家）强调对资源、事务或他人的管理与服务，常用于航空、船运或大型组织中，带有服务性和责任性。而 “keeper” 更偏向于物理上的看守或控制，不强调服务性质，且可指代无生命物的保留。"
    },
    {
      "word_to_compare": "retainer",
      "analysis": "“Retainer”（保留物/定金）作为名词时，多指为保留某物而支付的定金，或法律上聘请的顾问。它不指人，也不强调看管行为，与 “keeper” 的核心语义（看守/保留）有本质区别。"
    }
  ]
}