{
  "word": "keepers",
  "pronunciation": "kee·puhrz",
  "concise_definition": "n. 保管者, 看守者, 守门员, 保留物",
  "forms": {
    "singular": "keeper"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person responsible for guarding, maintaining, or taking care of something or someone, often in a formal or official capacity.",
      "explanation_cn": "指负责看守、维护或照料某物或某人的人，通常具有正式或官方的职责。",
      "example_en": "The lighthouse keeper ensured the beacon was lit every night.",
      "example_cn": "灯塔看守人确保每晚都点亮灯塔。"
    },
    {
      "pos": "noun",
      "explanation_en": "In sports, especially soccer or hockey, the player whose primary role is to prevent the opposing team from scoring by guarding the goal.",
      "explanation_cn": "在体育运动中（尤其是足球或曲棍球），指主要职责是守卫球门、阻止对方得分的球员，即守门员。",
      "example_en": "The team's keeper made three incredible saves in the final minutes.",
      "example_cn": "球队的守门员在最后几分钟做出了三次不可思议的扑救。"
    },
    {
      "pos": "noun",
      "explanation_en": "Something that is worth keeping or retaining, often because of its value, sentimental significance, or usefulness.",
      "explanation_cn": "指值得保留的事物，通常因其价值、情感意义或实用性而被保留。",
      "example_en": "These photos are my true keepers — I’ll never delete them.",
      "example_cn": "这些照片是我真正的珍藏——我永远不会删除。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device or mechanism designed to hold something in place or prevent it from moving or falling.",
      "explanation_cn": "指用于固定某物、防止其移动或掉落的装置或机制。",
      "example_en": "The cabinet door had a magnetic keeper to keep it closed.",
      "example_cn": "橱柜门上有一个磁性门吸，用以保持门关闭。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "guardian",
      "analysis": "“Guardian”（监护人/守护者）更强调保护、庇护或法律上的责任，常用于人（如儿童的监护人）或抽象事物（如自然的守护者）。而 “keeper” 更侧重于日常的看管、照料或操作性职责，语义更具体、更贴近实际行为。"
    },
    {
      "word_to_compare": "custodian",
      "analysis": "“Custodian”（保管人）通常用于正式或机构语境，指负责管理财产、建筑或文物的人，强调法律或制度性责任。而 “keeper” 更口语化，适用范围更广，可指人、动物、物品甚至抽象概念的‘持有者’。"
    },
    {
      "word_to_compare": "retainer",
      "analysis": "“Retainer”（保留者/定金）主要指为保留某物或服务而支付的费用，或指被雇佣长期服务的人（如律师）。它强调‘预先支付’或‘持续雇佣’，而 ‘keeper’ 强调‘持续照料’或‘物理性看管’，两者语义重心不同。"
    }
  ]
}