{
  "word": "keeping",
  "pronunciation": "kee·ping",
  "concise_definition": "n. 保持, 维护; v. 保持, 维持 (keep 的现在分词/动名词)",
  "forms": {
    "base_form": "keep",
    "third_person_singular": "keeps",
    "past_tense": "kept",
    "past_participle": "kept",
    "present_participle": "keeping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of maintaining or preserving something in its current state, often referring to the continued care or attention required to sustain a condition, habit, or relationship.",
      "explanation_cn": "指维持或保持某事物处于当前状态的行为，通常指为维持某种状况、习惯或关系而持续付出的照料或关注。",
      "example_en": "Keeping a daily journal helped her manage stress and reflect on her progress.",
      "example_cn": "坚持写每日日记帮助她缓解压力并反思自己的进步。"
    },
    {
      "pos": "noun",
      "explanation_en": "The state of being retained or held in possession, especially in contexts like food storage, health, or legal custody.",
      "explanation_cn": "指某物被保留或持有的状态，尤其用于食物保存、健康状况或法律监护等语境中。",
      "example_en": "The keeping of perishable goods requires proper refrigeration.",
      "example_cn": "易腐物品的保存需要适当的冷藏。"
    },
    {
      "pos": "verb",
      "explanation_en": "To continue to have or hold something, especially over time; to refrain from losing or discarding.",
      "explanation_cn": "指持续拥有或持有某物，尤其是不丢失或不丢弃。",
      "example_en": "She kept the letter for twenty years as a reminder of their friendship.",
      "example_cn": "她把这封信保存了二十年，作为他们友谊的纪念。"
    },
    {
      "pos": "verb",
      "explanation_en": "To maintain a particular condition, level, or standard, often through deliberate effort.",
      "explanation_cn": "指通过有意识的努力维持某种状态、水平或标准。",
      "example_en": "He’s been keeping fit by jogging every morning.",
      "example_cn": "他每天早上慢跑以保持健康。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "maintaining",
      "analysis": "“Maintaining” (维护) 与 “keeping” 非常接近，但更强调系统性、持续性的维护行为，常用于技术、设施或制度层面，如“maintaining a machine”。而 “keeping” 更口语化，适用范围更广，可涵盖情感、习惯、物品等，语义更灵活。"
    },
    {
      "word_to_compare": "retaining",
      "analysis": "“Retaining” (保留) 侧重于“不失去”或“不释放”某物，常用于抽象概念如记忆、客户、员工等，隐含“本可能失去”的语境。而 “keeping” 更中性，不强调潜在的丧失风险，仅表示持续持有。"
    },
    {
      "word_to_compare": "preserving",
      "analysis": "“Preserving” (保存/保护) 常用于强调防止损坏、腐烂或消失，尤其用于食物、文物、自然环境等脆弱对象，带有保护性、防御性含义。而 “keeping” 更泛化，不必然包含保护的意图，仅表示持续拥有或维持。"
    }
  ]
}