{
  "word": "kelly",
  "pronunciation": "kel·ee",
  "concise_definition": "n. 凯利（人名）；（美俚）绿色；（旧时）凯利裙",
  "forms": {
    "plural": "kellies"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A proper noun used as a given name or surname, commonly of Irish origin, derived from the Gaelic Ó Ceallaigh, meaning 'descendant of Ceallach' (a personal name meaning 'bright-headed' or 'warrior').",
      "explanation_cn": "作为人名使用的专有名词，常见于爱尔兰语背景，源自盖尔语 Ó Ceallaigh，意为‘Ceallach 的后裔’（Ceallach 意为‘聪明的头’或‘战士’）。",
      "example_en": "Kelly Johnson is the lead architect of the new urban design project.",
      "example_cn": "凯莉·约翰逊是这个新城市设计项目的首席建筑师。"
    },
    {
      "pos": "noun",
      "explanation_en": "Slang term in American English, especially in older usage, referring to the color green, often associated with money or nature.",
      "explanation_cn": "美国俚语，多用于旧时，指绿色，常与金钱或自然相关联。",
      "example_en": "He was wearing a suit of kelly, and everyone knew he’d just cashed in.",
      "example_cn": "他穿着一身绿色西装，人人都知道他刚赚了一笔。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of short, full skirt worn by women in the 19th and early 20th centuries, often made of wool or cotton and associated with working-class fashion.",
      "explanation_cn": "19世纪至20世纪初女性穿着的一种短而蓬松的裙子，通常由羊毛或棉布制成，与工人阶级的服饰风格相关。",
      "example_en": "The historical reenactment featured women in kellys and bonnets, recreating life in 1880s London.",
      "example_cn": "这场历史重现活动展示了穿着凯利裙和女帽的女性，再现了1880年代伦敦的生活场景。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "green",
      "analysis": "“Green” 是标准英语中表示颜色的通用词，涵盖所有绿色调，用于自然、环境、经济等广泛语境。而 “kelly” 作为俚语仅特指一种明亮、饱和的绿色（类似翡翠绿），使用范围狭窄，多见于口语或怀旧语境。"
    },
    {
      "word_to_compare": "name",
      "analysis": "“Name” 是泛指任何称呼或标识，而 “Kelly” 是一个具体的专有名词，具有文化、历史和家族传承意义。它不仅是标签，还承载着爱尔兰姓氏传统，与 “name” 的抽象性形成鲜明对比。"
    },
    {
      "word_to_compare": "skirt",
      "analysis": "“Skirt” 是通用词，泛指任何女性下身穿着的裙装。而 “kelly” 是一种特定历史款式的裙子，具有明确的年代、剪裁和阶级属性，属于 “skirt” 的一个子类，具有更强的文化语境限定。"
    }
  ]
}