{
  "word": "kicks",
  "pronunciation": "kicks",
  "concise_definition": "n. 踢, 踢腿动作; (复数) 酷爱, 乐趣; v. 踢",
  "forms": {
    "singular": "kick",
    "third_person_singular": "kicks",
    "past_tense": "kicked",
    "past_participle": "kicked",
    "present_participle": "kicking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sudden, forceful movement of the foot or leg, typically directed at an object or person, often in sports, self-defense, or as an expression of anger.",
      "explanation_cn": "脚或腿的突然、有力的动作，通常用于踢击物体或他人，常见于体育运动、自卫或表达愤怒时。",
      "example_en": "The soccer player delivered a powerful kick that sent the ball into the net.",
      "example_cn": "这名足球运动员一脚有力的射门，将球送入了球网。"
    },
    {
      "pos": "noun",
      "explanation_en": "A feeling of excitement, pleasure, or satisfaction derived from an activity or experience, often used in the plural form to describe personal hobbies or obsessions.",
      "explanation_cn": "从某种活动或经历中获得的兴奋、愉悦或满足感，常以复数形式出现，指个人的爱好或痴迷。",
      "example_en": "He gets his kicks from skydiving and rock climbing.",
      "example_cn": "他从跳伞和攀岩中获得乐趣。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strike or propel something with the foot, especially in a forceful or sudden motion.",
      "explanation_cn": "用脚猛力击打或踢出某物，通常指突然而有力的动作。",
      "example_en": "The dog kicked up dirt as it ran across the yard.",
      "example_cn": "狗跑过院子时踢起了尘土。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slang term for shoes, especially fashionable or collectible ones, often used in streetwear culture.",
      "explanation_cn": "俚语，指鞋子，尤指时尚或收藏款的鞋，在街头服饰文化中常见。",
      "example_en": "He spent his entire paycheck on a new pair of kicks.",
      "example_cn": "他把整个月的工资都花在了一双新鞋上。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "stomp",
      "analysis": "“Stomp” (跺脚) 强调用脚重重踩踏，通常带有愤怒、强调或节奏感，动作更重、更缓慢，常用于表达情绪或打拍子。而 “kick” 更强调向前或向侧方的快速发力，动作范围更大，用途更广（如踢球、踢人）。"
    },
    {
      "word_to_compare": "thrill",
      "analysis": "“Thrill” (激动、刺激) 是一种抽象的情感体验，指因惊险或兴奋而产生的强烈快感。而 “kicks”（复数）作为俚语，是 “thrill” 的非正式口语替代，但更具体地关联到通过某种行为（如极限运动）获得的快感，带有行为导向性。"
    },
    {
      "word_to_compare": "boot",
      "analysis": "“Boot” (靴子) 是一种具体的鞋类名词，而 “kicks” 是其俚语说法。两者指代同一物品，但 “kicks” 更具文化语境（如嘻哈、街头文化），带有年轻化、潮流化的语义色彩，而 “boot” 更中性、正式。"
    }
  ]
}