{
  "word": "kidding",
  "pronunciation": "kɪd·ɪŋ",
  "concise_definition": "n. 玩笑, 捉弄; adj. 开玩笑的; v. 玩笑, 捉弄",
  "forms": {
    "base_form": "kid",
    "third_person_singular": "kids",
    "past_tense": "kidded",
    "past_participle": "kidded",
    "present_participle": "kidding"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To speak in a playful or humorous way, often with the intention of teasing or not being taken seriously, especially when saying something that is not true.",
      "explanation_cn": "以幽默或戏谑的方式说话，通常旨在捉弄他人或不被当真，尤其指说出并非真实的事情。",
      "example_en": "Are you kidding me? You actually thought that was a good idea?",
      "example_cn": "你是在开玩笑吧？你真觉得这是个好主意？"
    },
    {
      "pos": "verb",
      "explanation_en": "To engage in light-hearted banter or teasing, often among friends, without malice or serious intent.",
      "explanation_cn": "以轻松、无恶意的方式与他人开玩笑或调侃，通常发生在朋友之间。",
      "example_en": "We were just kidding around after class — no one was really upset.",
      "example_cn": "课后我们只是随便闹着玩，没人真生气。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something said or done in a joking manner, not meant to be taken seriously.",
      "explanation_cn": "形容某事是开玩笑地说或做的，并非当真。",
      "example_en": "It was just a kidding remark — I didn’t mean it literally.",
      "example_cn": "那只是句玩笑话，我不是字面意思。"
    },
    {
      "pos": "noun",
      "explanation_en": "A playful or humorous statement or action intended to amuse or tease someone.",
      "explanation_cn": "一种旨在逗乐或捉弄他人的幽默或戏谑性言语或行为。",
      "example_en": "He told a few kiddings at the party, and everyone laughed.",
      "example_cn": "他在派对上说了几个玩笑，大家都笑了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "joking",
      "analysis": "“Joking” 与 “kidding” 非常接近，常可互换，但 “joking” 更中性、更广泛，适用于任何幽默表达；而 “kidding” 常带有轻微的捉弄或试探对方反应的意味，语气更口语化、更随意。"
    },
    {
      "word_to_compare": "teasing",
      "analysis": "“Teasing” (逗弄) 通常带有轻微的挑衅或调侃性质，可能持续较久，有时甚至可能让对方感到不适；而 “kidding” 通常更短暂、更无害，且双方通常都明白是玩笑。"
    },
    {
      "word_to_compare": "mocking",
      "analysis": "“Mocking” (嘲讽) 是带有贬义的，常含有轻蔑、侮辱或贬低的意图，情感色彩负面；而 “kidding” 是善意的、非攻击性的，通常建立在彼此信任或亲密关系之上。"
    }
  ]
}