{
  "word": "kingdoms",
  "pronunciation": "king·duhmz",
  "concise_definition": "n. 王国, 领地, 领域",
  "forms": {
    "singular": "kingdom"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sovereign state ruled by a monarch, such as a king or queen, with its own government, territory, and population.",
      "explanation_cn": "指由君主（如国王或女王）统治的主权国家，拥有自己的政府、领土和人口。",
      "example_en": "Medieval Europe was divided into many kingdoms, each with its own laws and customs.",
      "example_cn": "中世纪的欧洲被划分为许多王国，每个王国都有自己的法律和习俗。"
    },
    {
      "pos": "noun",
      "explanation_en": "A major category or domain in biological classification, such as Animalia, Plantae, or Fungi, used to group organisms with shared fundamental characteristics.",
      "explanation_cn": "指生物学分类中的主要类别，如动物界、植物界或真菌界，用于根据基本共同特征对生物进行分组。",
      "example_en": "Scientists classify all living things into five kingdoms based on cell structure and nutrition.",
      "example_cn": "科学家根据细胞结构和营养方式将所有生物分为五个界。"
    },
    {
      "pos": "noun",
      "explanation_en": "A realm or domain of activity, influence, or interest, often used metaphorically to describe a particular sphere of existence or control.",
      "explanation_cn": "指一种活动、影响或兴趣的领域，常用于隐喻，描述某种特定的存在或控制范围。",
      "example_en": "The kingdom of technology is changing the way we communicate and work.",
      "example_cn": "科技领域正在改变我们的沟通和工作方式。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "empire",
      "analysis": "“Empire”（帝国）通常指由一个中央权威统治的多个民族或国家组成的庞大政治实体，常通过征服扩张形成，权力集中于皇帝或最高统治者。而 “kingdom”（王国）规模较小，通常由单一君主统治，结构更传统，不一定包含多个民族或被征服地区。"
    },
    {
      "word_to_compare": "realm",
      "analysis": "“Realm”（领域）是 “kingdom” 的近义词，常用于文学或比喻语境，泛指统治范围或某个特定领域，不必然指政治实体。它比 “kingdom” 更抽象，可指精神、想象或抽象的领域，如 “the realm of dreams”。而 “kingdom” 更具体，常指实际存在的国家或生物分类单位。"
    },
    {
      "word_to_compare": "domain",
      "analysis": "“Domain”（领域）强调控制权或影响范围，常用于科学、技术或抽象概念中，如 “the domain of physics”。它不带有君主制或政治结构的含义，而 “kingdom” 在比喻用法中仍隐含某种统治或主权的意象，更具权威性和等级感。"
    }
  ]
}