{
  "word": "kink",
  "pronunciation": "kink",
  "concise_definition": "n. 异常癖好, 扭结, 小曲折; v. 扭结, 使弯曲",
  "forms": {
    "plural": "kinks",
    "third_person_singular": "kinks",
    "past_tense": "kinked",
    "past_participle": "kinked",
    "present_participle": "kinking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A peculiar or unconventional sexual preference or behavior, often involving non-traditional practices or role-playing that deviates from mainstream norms.",
      "explanation_cn": "指一种非传统或非主流的性偏好或行为，常涉及角色扮演或非典型实践，偏离常规性行为模式。",
      "example_en": "His interest in bondage and discipline is considered a kink by many in the community.",
      "example_cn": "他对束缚与支配的兴趣在许多社群成员眼中被视为一种性癖好。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small twist, bend, or irregularity in something that is otherwise straight or smooth, such as a rope, wire, or hair.",
      "explanation_cn": "指原本笔直或平滑的物体上出现的小扭结、弯曲或不规则处，如绳子、电线或头发中的打结。",
      "example_en": "The cable had a kink in it, which caused the signal to drop.",
      "example_cn": "这条电缆有一个扭结，导致信号中断。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form a twist or bend in something, especially when it is not intended or causes malfunction.",
      "explanation_cn": "使某物形成扭结或弯曲，通常指非预期的变形而导致功能异常。",
      "example_en": "She accidentally kinked the hose while dragging it across the yard.",
      "example_cn": "她拖水管时不小心把它扭结了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "quirk",
      "analysis": "“Quirk”（怪癖）指个人性格或行为中的奇特习惯，通常是无害、非性相关的，如爱用左手或每天必须按固定顺序穿衣。而 “kink” 在性语境中特指性偏好，具有更强烈的生理与心理指向性，且常与成人内容相关。"
    },
    {
      "word_to_compare": "bend",
      "analysis": "“Bend”（弯曲）是通用词，指任何物理上的弯曲动作或状态，不带负面或异常含义。而 “kink” 暗示一种不自然、突兀或破坏性的弯曲，常带有功能障碍或审美上的瑕疵，如电线打结或头发打结。"
    },
    {
      "word_to_compare": "fetish",
      "analysis": "“Fetish”（恋物）特指对无生命物体或特定身体部位产生强烈性唤起，如鞋子、皮革等。而 “kink” 是更宽泛的术语，涵盖所有非主流性行为，包括角色扮演、支配与服从等，不一定涉及物体。因此，所有 fetish 都是 kink，但并非所有 kink 都是 fetish。"
    }
  ]
}