{
  "word": "kiss",
  "pronunciation": "kis",
  "concise_definition": "n. 吻, 亲吻; v. 亲, 亲吻",
  "forms": {
    "third_person_singular": "kisses",
    "past_tense": "kissed",
    "past_participle": "kissed",
    "present_participle": "kissing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A touch or pressure of the lips on a person or object, typically as an expression of affection, love, greeting, or respect.",
      "explanation_cn": "嘴唇对人或物的轻触或压合，通常作为表达爱意、喜爱、问候或尊敬的方式。",
      "example_en": "She gave him a gentle kiss on the forehead before leaving.",
      "example_cn": "离开前，她在他额头上轻轻吻了一下。"
    },
    {
      "pos": "noun",
      "explanation_en": "A symbolic gesture or token representing affection, often used metaphorically (e.g., a kiss of death, a kiss of betrayal).",
      "explanation_cn": "一种象征爱意的举动，常用于比喻意义（如‘致命之吻’、‘背叛之吻’）。",
      "example_en": "The offer seemed generous, but it was a kiss of death for the company’s independence.",
      "example_cn": "这个提议看似慷慨，实则是对公司独立性的致命一击。"
    },
    {
      "pos": "verb",
      "explanation_en": "To press one’s lips to someone or something, especially as a sign of love, affection, or greeting.",
      "explanation_cn": "用嘴唇轻触某人或某物，尤指表达爱意、喜爱或问候。",
      "example_en": "He kissed her goodbye at the airport and promised to call.",
      "example_cn": "他在机场吻别她，并承诺会打电话。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or pass lightly over a surface, as if touching with the lips; often used figuratively.",
      "explanation_cn": "轻拂或掠过某表面，仿佛用嘴唇触碰一般；常用于比喻。",
      "example_en": "The plane kissed the runway before coming to a stop.",
      "example_cn": "飞机轻触跑道后才停下。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "embrace",
      "analysis": "“Embrace”（拥抱）指用双臂环抱某人，表达亲密、安慰或欢迎，动作范围更大，更强调身体的包裹感和安全感。而 “kiss” 仅限于嘴唇接触，更私密、更短暂，常作为情感的点睛之笔，而非整体表达。"
    },
    {
      "word_to_compare": "peck",
      "analysis": "“Peck”（轻吻）是 “kiss” 的一种子类型，特指快速、轻浅、非浪漫的吻，常用于父母对孩子、朋友之间或鸟类啄食的比喻。它比一般 “kiss” 更随意、更缺乏情感深度。"
    },
    {
      "word_to_compare": "smooch",
      "analysis": "“Smooch”（响亮的吻）是口语化表达，强调热烈、夸张甚至带有表演性质的亲吻，常用于浪漫或戏谑语境。它比 “kiss” 更具感官冲击力和情绪外露性，有时带点俗气或幽默感。"
    }
  ]
}