{
  "word": "knights",
  "pronunciation": "nīts",
  "concise_definition": "n. 骑士, 骑士团成员, 被封为骑士的人",
  "forms": {
    "singular": "knight"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A mounted soldier in medieval Europe, typically serving a king or noble, who was bound by a code of chivalry and often granted land in exchange for military service.",
      "explanation_cn": "中世纪欧洲的重装骑兵，通常效忠于国王或贵族，受骑士精神准则约束，并常以军事服务换取土地封赏。",
      "example_en": "The knight in shining armor rode forth to defend the castle.",
      "example_cn": "那位身披闪亮铠甲的骑士骑马前去保卫城堡。"
    },
    {
      "pos": "noun",
      "explanation_en": "A man who has been honored by a monarch with a title of knighthood, often for exceptional service to the country; the title is usually denoted by 'Sir' before the name.",
      "explanation_cn": "由君主授予骑士头衔以表彰其对国家杰出贡献的男性，头衔通常以 'Sir'（爵士）置于姓名前。",
      "example_en": "Sir Elton John was knighted for his contributions to music and charity.",
      "example_cn": "埃尔顿·约翰爵士因对音乐和慈善事业的贡献而被封为骑士。"
    },
    {
      "pos": "noun",
      "explanation_en": "A piece in the game of chess, shaped like a horse's head, that moves in an L-shape and is one of the most versatile pieces on the board.",
      "explanation_cn": "国际象棋中的一种棋子，形状如马头，以‘日’字形移动，是棋盘上最灵活的棋子之一。",
      "example_en": "She sacrificed her knight to gain control of the center of the board.",
      "example_cn": "她牺牲了自己的马，以控制棋盘中心。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "soldier",
      "analysis": "“Soldier”（士兵）泛指任何服役于军队的人员，强调其职业身份和军事职能，无阶级或荣誉内涵。而 “knight” 特指中世纪拥有贵族身份、受骑士精神约束的骑兵，具有社会地位、荣誉制度和道德准则的特殊含义。"
    },
    {
      "word_to_compare": "warrior",
      "analysis": "“Warrior”（战士）是一个更广泛、更文化中立的词，指任何勇敢作战的人，可来自任何时代或文明（如日本武士、美洲原住民战士）。而 “knight” 是欧洲封建制度下的特定历史角色，与封地、效忠、宗教和骑士精神紧密相连，文化语境更具体。"
    },
    {
      "word_to_compare": "baron",
      "analysis": "“Baron”（男爵）是欧洲贵族头衔之一，属于世袭封建等级体系，主要权力来自土地所有权和政治影响力。而 “knight” 虽然也常拥有土地，但其核心身份是军事服务者，且骑士头衔不一定是世袭的，更多是基于个人功绩授予的荣誉。"
    }
  ]
}