{
  "word": "knight",
  "pronunciation": "nīt",
  "concise_definition": "n. 骑士, 男爵, 有封号的武士; v. 封为骑士",
  "forms": {
    "plural": "knights",
    "third_person_singular": "knights",
    "past_tense": "knighted",
    "past_participle": "knighted",
    "present_participle": "knighting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A mounted warrior in medieval Europe, typically serving a monarch or noble, bound by a code of chivalry, and often granted land in exchange for military service.",
      "explanation_cn": "中世纪欧洲的重装骑兵，通常效忠于君主或贵族，遵循骑士精神准则，并常以军事服务换取土地封赏。",
      "example_en": "The knight in shining armor rode forth to defend the castle.",
      "example_cn": "那位身披闪亮铠甲的骑士骑马前去保卫城堡。"
    },
    {
      "pos": "noun",
      "explanation_en": "A man who has been honored by a monarch with a title of nobility, often for exceptional service to the country; the title is hereditary in some cases.",
      "explanation_cn": "由君主授予荣誉称号以表彰其对国家杰出贡献的男性，该头衔在某些情况下可世袭。",
      "example_en": "Sir Elton John was knighted by Queen Elizabeth II for his contributions to music.",
      "example_cn": "埃尔顿·约翰爵士因对音乐的贡献被伊丽莎白二世女王封为骑士。"
    },
    {
      "pos": "noun",
      "explanation_en": "A chess piece shaped like a horse's head, which moves in an L-shape: two squares in one direction and then one square perpendicular.",
      "explanation_cn": "国际象棋中形状如马头的棋子，以‘日’字形移动：先向任意方向走两格，再垂直方向走一格。",
      "example_en": "She sacrificed her knight to gain control of the center of the board.",
      "example_cn": "她牺牲了自己的马，以控制棋盘中心。"
    },
    {
      "pos": "verb",
      "explanation_en": "To confer knighthood upon someone, typically in a formal ceremony by a monarch or head of state.",
      "explanation_cn": "在正式仪式中由君主或国家元首授予某人骑士头衔。",
      "example_en": "The prime minister was knighted for his leadership during the crisis.",
      "example_cn": "这位首相因在危机中的领导能力被封为骑士。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "warrior",
      "analysis": "“Warrior”（战士）泛指任何勇敢作战的人，不限于中世纪或特定社会阶层，也不一定遵循道德准则。而 “knight” 特指欧洲封建制度下具有特定社会地位、受骑士精神约束的骑兵，强调荣誉、忠诚与礼仪。"
    },
    {
      "word_to_compare": "baron",
      "analysis": "“Baron”（男爵）是贵族头衔，属于世袭封建等级体系中的一级，主要强调土地所有权和政治权力。而 “knight” 虽可为贵族阶层的最低级，但其核心身份是军事服务者，不一定拥有土地，且头衔有时非世袭。"
    },
    {
      "word_to_compare": "paladin",
      "analysis": "“Paladin”（圣骑士）源自传说中的查理曼大帝的十二勇士，常带有神话或宗教色彩，象征神圣使命与超凡正义。而 “knight” 是历史现实中存在的社会角色，虽受骑士精神影响，但更世俗化、制度化。"
    }
  ]
}