{
  "word": "knitted",
  "pronunciation": "nɪt·ɪd",
  "concise_definition": "adj. 编织的, 针织的; v. 编织（knit 的过去式和过去分词）",
  "forms": {
    "base_form": "knit",
    "past_tense": "knitted",
    "past_participle": "knitted",
    "present_participle": "knitting",
    "third_person_singular": "knits"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Made by interlocking loops of yarn or thread using needles, typically referring to clothing or textiles produced by hand or machine knitting.",
      "explanation_cn": "指用针具将纱线或线圈相互交织而成的，通常用于描述手工或机器编织的衣物或纺织品。",
      "example_en": "She wore a warm, hand-knitted sweater during the winter.",
      "example_cn": "她在冬天穿了一件温暖的手工编织毛衣。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form fabric by interlocking loops of yarn with knitting needles or a machine, often as a craft or for making garments.",
      "explanation_cn": "指用织针或机器将纱线相互编织成布料，常作为一种手工技艺或用于制作衣物。",
      "example_en": "My grandmother knitted scarves for all her grandchildren every Christmas.",
      "example_cn": "我祖母每年圣诞节都会为所有孙辈织围巾。"
    },
    {
      "pos": "verb",
      "explanation_en": "To join or fuse together tightly or closely, often used metaphorically to describe close relationships or integration.",
      "explanation_cn": "指紧密地连接或融合在一起，常用于比喻人际关系的紧密或事物的整合。",
      "example_en": "The community was knitted together by shared traditions and mutual support.",
      "example_cn": "这个社区因共同的传统和相互支持而紧密联系在一起。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "woven",
      "analysis": "“Woven”（编织的）指通过经纬线在织机上交叉交织制成的布料，结构更紧密、更平整，常用于棉布、丝绸等；而 “knitted” 是通过线圈套环形成，更具弹性，常用于毛衣、袜子等贴身衣物。两者工艺不同，前者是经纬交织，后者是线圈串连。"
    },
    {
      "word_to_compare": "crocheted",
      "analysis": "“Crocheted”（钩针编织的）使用单根钩针形成线圈，结构更立体、孔洞更大，常用于蕾丝、装饰品；而 “knitted” 使用两根或多根针，形成连续的线圈行，更均匀、延展性更强。两者虽同属手工编织，但工具和技法有本质区别。"
    },
    {
      "word_to_compare": "sewn",
      "analysis": "“Sewn”（缝制的）指用针线将两块布料或部件缝合在一起，强调连接而非材料本身的构造；而 “knitted” 描述的是材料本身由线圈编织而成，是材料的生成方式，不是拼接行为。"
    }
  ]
}