{
  "word": "knitting",
  "pronunciation": "nɪt·ɪŋ",
  "concise_definition": "n. 针织, 编织; v. 编织, 缝合",
  "forms": {
    "base_form": "knit",
    "third_person_singular": "knits",
    "past_tense": "knit / knitted",
    "past_participle": "knit / knitted",
    "present_participle": "knitting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The activity or art of creating fabric by interlocking loops of yarn or thread with knitting needles, typically used to make garments such as sweaters, scarves, or socks.",
      "explanation_cn": "指用织针将纱线或线圈相互穿套，以制作织物的活动或技艺，常用于制作毛衣、围巾或袜子等衣物。",
      "example_en": "She spends her evenings knitting sweaters for her grandchildren.",
      "example_cn": "她每晚都为孙子孙女们织毛衣。"
    },
    {
      "pos": "noun",
      "explanation_en": "The fabric produced by the process of knitting, characterized by its stretchy, flexible texture.",
      "explanation_cn": "指通过针织工艺制成的织物，其特点是富有弹性和柔韧性。",
      "example_en": "The scarf was made of soft wool knitting that kept her warm in winter.",
      "example_cn": "这条围巾是用柔软的羊毛针织而成，在冬天能让她保持温暖。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form fabric by interlocking loops of yarn with needles, often as a hobby or craft.",
      "explanation_cn": "指用织针将纱线相互穿套以形成织物，常作为一种爱好或手工艺。",
      "example_en": "My grandmother taught me how to knit when I was seven.",
      "example_cn": "我七岁时，祖母教我如何织毛衣。"
    },
    {
      "pos": "verb",
      "explanation_en": "To join or unite closely, often used metaphorically to describe the integration of people, ideas, or systems.",
      "explanation_cn": "指紧密地连接或融合，常用于比喻人、思想或系统的整合。",
      "example_en": "The community is knitting together through shared cultural events.",
      "example_cn": "通过共同的文化活动，这个社区正日益紧密地融合在一起。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "crocheting",
      "analysis": "“Crocheting”（钩针编织）使用单根钩针形成线圈，而 “knitting” 使用两根或多根织针，通过连续的线圈串连形成织物。钩针织物通常更厚、更蓬松，而针织物更柔软、有弹性。两者都是手工编织技艺，但工具和针法不同。"
    },
    {
      "word_to_compare": "weaving",
      "analysis": "“Weaving”（机织）是将经线和纬线在织机上纵横交错形成布料，属于静态结构；而 “knitting” 是通过连续的线圈动态形成，具有更好的延展性。织物通常更硬挺，适合窗帘、桌布；针织物则更适合贴身衣物。"
    },
    {
      "word_to_compare": "sewing",
      "analysis": "“Sewing”（缝纫）是用针线将两块已有的布料缝合在一起，属于组装行为；而 “knitting” 是从一根线开始，逐步构建出整块织物。缝纫是连接，针织是创造。"
    }
  ]
}