{
  "word": "knit",
  "pronunciation": "nɪt",
  "concise_definition": "v. 编织, 缝合, 紧密结合; n. 针织品",
  "forms": {
    "third_person_singular": "knits",
    "past_tense": "knitted",
    "past_participle": "knitted",
    "present_participle": "knitting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To make fabric by interlocking loops of yarn or thread with needles, typically by hand or using a machine.",
      "explanation_cn": "指用针将纱线或线圈相互交织，制成织物，通常用手或机器完成。",
      "example_en": "She spent the evening knitting a woolen scarf for her grandson.",
      "example_cn": "她晚上花时间给孙子织一条羊毛围巾。"
    },
    {
      "pos": "verb",
      "explanation_en": "To join or heal (especially tissue) by forming new connections, often used in medical contexts.",
      "explanation_cn": "指（尤指组织）通过形成新的连接而愈合或接合，常用于医学语境。",
      "example_en": "The surgeon said the broken bone had knit well after six weeks.",
      "example_cn": "外科医生说，骨折在六周后愈合得很好。"
    },
    {
      "pos": "verb",
      "explanation_en": "To bind or unite closely, especially people or groups, through shared experiences or common purpose.",
      "explanation_cn": "指通过共同经历或共同目标，将人或群体紧密地联系在一起。",
      "example_en": "The crisis knit the community together in a way nothing else could.",
      "example_cn": "这场危机以其他任何事物都无法做到的方式将社区紧密地团结在了一起。"
    },
    {
      "pos": "noun",
      "explanation_en": "A garment or fabric made by knitting, such as a sweater, hat, or scarf.",
      "explanation_cn": "指通过编织制成的衣物或织物，如毛衣、帽子或围巾。",
      "example_en": "She loves wearing cozy knits during the winter months.",
      "example_cn": "她喜欢在冬季穿柔软的针织衣物。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "weave",
      "analysis": "“Weave”（编织）通常指用经纬线在织机上交叉交织成布料，强调结构的平面性和机械性，多用于机织物；而 “knit” 是通过线圈相互串套形成织物，具有弹性，多用于手工或针织品，结构更立体。"
    },
    {
      "word_to_compare": "stitch",
      "analysis": "“Stitch”（缝合）泛指用针线将材料缝在一起，可以是缝纫、缝补或外科缝合，动作更基础、更通用；而 “knit” 特指通过连续线圈形成织物，是一种特定的编织工艺，不单是连接，而是创造织物本身。"
    },
    {
      "word_to_compare": "unite",
      "analysis": "“Unite”（联合）是抽象意义上的结合，强调两个或多个独立实体合并为一个整体，常用于政治、组织或情感层面；而 “knit” 用于比喻时，强调通过紧密、细致、持续的互动使关系变得牢固，带有“编织”般的细腻和结构性，比 “unite” 更具形象性和过程感。"
    }
  ]
}