{
  "word": "knock",
  "pronunciation": "nok",
  "concise_definition": "v. 敲, 击, 批评; n. 敲击声, 批评",
  "forms": {
    "third_person_singular": "knocks",
    "past_tense": "knocked",
    "past_participle": "knocked",
    "present_participle": "knocking"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To strike something, especially a door or surface, with the fist or a hard object, typically to attract attention or gain entry.",
      "explanation_cn": "用拳头或硬物敲击某物（尤其是门或表面），通常是为了引起注意或请求进入。",
      "example_en": "She knocked on the door but no one answered.",
      "example_cn": "她敲了敲门，但没人应答。"
    },
    {
      "pos": "verb",
      "explanation_en": "To criticize or find fault with someone or something, often in a harsh or unfair way.",
      "explanation_cn": "对某人或某事进行批评或挑毛病，常带有严厉或不公正的语气。",
      "example_en": "He’s always knocking his colleagues for minor mistakes.",
      "example_cn": "他总是因为一些小错误就批评同事。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sharp, rhythmic sound made by striking something, especially a door or window.",
      "explanation_cn": "敲击某物（尤其是门或窗）时发出的清脆、有节奏的声音。",
      "example_en": "There was a loud knock at the door, and everyone fell silent.",
      "example_cn": "门外传来一声响亮的敲门声，所有人都安静了下来。"
    },
    {
      "pos": "noun",
      "explanation_en": "An act of criticism or a negative remark directed at someone or something.",
      "explanation_cn": "对某人或某事的批评行为或负面评价。",
      "example_en": "The movie received a lot of knocks from critics for its weak plot.",
      "example_cn": "这部电影因情节薄弱而遭到评论家的诸多批评。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tap",
      "analysis": "“Tap”（轻敲）指轻柔、短暂的敲击，通常不具强制性或紧迫感，如用手指轻敲桌面。而 “knock” 强调更重、更响亮、更具目的性的敲击，常用于引起注意或要求进入，语气更强。"
    },
    {
      "word_to_compare": "blow",
      "analysis": "“Blow”（击打）通常指用更大的力量或工具（如拳头、棍棒）进行的一次性猛烈打击，可能带有攻击性或破坏性。而 “knock” 更常用于重复性、有节奏的敲击，且不一定具有破坏意图，如敲门。"
    },
    {
      "word_to_compare": "criticize",
      "analysis": "“Criticize”（批评）是更正式、更广泛的术语，泛指对行为、作品或观点进行评价性评论，可正面可负面。而 “knock” 作为动词时，特指带有贬义、挑剔甚至刻薄的批评，语气更口语化、更尖锐。"
    }
  ]
}