{
  "word": "knocks",
  "pronunciation": "noks",
  "concise_definition": "n. 敲击, 敲门声, 批评; v. 敲, 敲打, 批评",
  "forms": {
    "singular": "knock",
    "third_person_singular": "knocks",
    "past_tense": "knocked",
    "past_participle": "knocked",
    "present_participle": "knocking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sharp, sudden impact or sound made by striking a surface, especially a door or wall, often to attract attention or signal arrival.",
      "explanation_cn": "指以突然、有力的方式撞击表面（尤其是门或墙）所发出的响声，通常用于吸引注意或表示到来。",
      "example_en": "I heard three loud knocks on the front door.",
      "example_cn": "我听到前门传来三下响亮的敲门声。"
    },
    {
      "pos": "noun",
      "explanation_en": "A critical remark or expression of disapproval, often informal or colloquial.",
      "explanation_cn": "指一种非正式或口语化的批评、指责或负面评价。",
      "example_en": "The critic gave the movie a few hard knocks for its weak plot.",
      "example_cn": "影评人因这部电影情节薄弱而对其进行了严厉批评。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strike something repeatedly with the fist, knuckles, or a hard object, typically to make a sound or gain entry.",
      "explanation_cn": "指用拳头、指节或硬物反复敲击某物，通常为发出声响或请求进入。",
      "example_en": "She knocked on the door but no one answered.",
      "example_cn": "她敲了敲门，但没人应答。"
    },
    {
      "pos": "verb",
      "explanation_en": "To criticize someone or something harshly, often in a casual or informal context.",
      "explanation_cn": "指在非正式语境中严厉批评某人或某事物。",
      "example_en": "He’s always knocking his colleagues for taking long lunches.",
      "example_cn": "他总是批评同事午休时间太长。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tap",
      "analysis": "“Tap”（轻敲）指轻微、短暂、不具威胁性的敲击，常用于表示礼貌或试探，如轻敲玻璃杯引起注意。而 “knock” 强调更重、更响亮、更具目的性的撞击，常用于请求进入或表达不满。"
    },
    {
      "word_to_compare": "criticize",
      "analysis": "“Criticize”（批评）是正式用语，指系统性地指出错误或不足，常用于学术、专业或官方语境。而 “knock” 作为动词时更口语化、带有情绪色彩，常含贬低或嘲讽意味，语气更随意甚至刻薄。"
    },
    {
      "word_to_compare": "beat",
      "analysis": "“Beat”（敲打/击打）强调连续、有力甚至暴力的击打动作，常用于描述殴打或节奏性打击（如打鼓）。而 “knock” 通常指短暂、间歇性的撞击，目的性更强（如敲门），且不必然伴随伤害意图。"
    }
  ]
}