{
  "word": "knot",
  "pronunciation": "nɑt",
  "concise_definition": "n. 结, 纽; v. 打结, 缠结",
  "forms": {
    "plural": "knots"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A tight entanglement or loop formed by tying a rope, cord, or similar material, often used to secure or join objects together.",
      "explanation_cn": "由绳子、线或其他类似材料打成的紧致缠结或环状结构，常用于固定或连接物体。",
      "example_en": "He tied a knot in the rope to prevent it from slipping through the pulley.",
      "example_cn": "他在绳子上打了个结，以防止它从滑轮中滑脱。"
    },
    {
      "pos": "noun",
      "explanation_en": "A hard, rounded lump or swelling, especially one formed by a bony growth or a cluster of tense muscles, often causing pain or discomfort.",
      "explanation_cn": "一种坚硬、圆形的隆起或肿块，尤指由骨质增生或紧张肌肉群形成的，常引起疼痛或不适。",
      "example_en": "She had a knot in her shoulder from carrying the heavy bag all day.",
      "example_cn": "她因为一整天背着沉重的包，肩膀上长了个硬块。"
    },
    {
      "pos": "noun",
      "explanation_en": "A unit of speed equal to one nautical mile per hour, commonly used in maritime and aviation contexts.",
      "explanation_cn": "一种速度单位，等于每小时一海里，常用于航海和航空领域。",
      "example_en": "The ship was traveling at 20 knots through the calm sea.",
      "example_cn": "这艘船以20节的速度在平静的海面上航行。"
    },
    {
      "pos": "verb",
      "explanation_en": "To tie or fasten something into a knot, especially to secure or join parts together.",
      "explanation_cn": "将某物打成结，尤指用于固定或连接部分。",
      "example_en": "She knotted the scarf around her neck before stepping out into the cold.",
      "example_cn": "她出门前把围巾在脖子上打了个结。"
    },
    {
      "pos": "verb",
      "explanation_en": "To become twisted or entangled, often in a way that is difficult to undo; to cause something to become tangled.",
      "explanation_cn": "变得缠结或扭结，通常难以解开；使某物缠结在一起。",
      "example_en": "The wires had knotted together during the move, making them impossible to separate.",
      "example_cn": "搬家时电线缠在了一起，根本无法分开。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bond",
      "analysis": "“Bond” (纽带/结合) 指人与人、物与物之间抽象的联系或情感纽带，如亲情、合同关系等，强调连接的本质而非物理形态。而 “knot” 是具体的、物理的缠结或打结，具有可触摸的结构。"
    },
    {
      "word_to_compare": "tangle",
      "analysis": "“Tangle” (缠绕) 指杂乱无章地纠缠在一起，通常带有负面含义，强调混乱和难以理清的状态。而 “knot” 是有意识打成的、结构相对固定的结，有时是功能性的（如系鞋带），不一定混乱。"
    },
    {
      "word_to_compare": "node",
      "analysis": "“Node” (节点) 多用于技术或抽象系统中，指连接点或关键点，如网络节点、神经节点，强调功能位置而非物理形态。而 “knot” 是实体的、手工或自然形成的缠结，常用于日常或物理语境。"
    }
  ]
}