{
  "word": "knots",
  "pronunciation": "nɒts",
  "concise_definition": "n. 结, 纽结, 紧张, 难题",
  "forms": {
    "singular": "knot"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A fastening made by tying a rope or cord into a loop or interlacing, used to secure objects or join lengths together.",
      "explanation_cn": "通过将绳子或线打成环状或交织而成的固定方式，用于固定物体或连接多段绳索。",
      "example_en": "He tied a knot in the rope to prevent it from slipping through the pulley.",
      "example_cn": "他把绳子打了个结，以防止它从滑轮中滑脱。"
    },
    {
      "pos": "noun",
      "explanation_en": "A tight, tense, or congested area, often used metaphorically to describe physical or emotional tension, such as a muscle spasm or mental stress.",
      "explanation_cn": "指紧张、僵硬或堵塞的部位，常用于比喻身体或情绪上的紧张，如肌肉痉挛或心理压力。",
      "example_en": "She had knots in her shoulders from sitting at the computer all day.",
      "example_cn": "她因为一整天坐在电脑前，肩膀上全是紧张的结块。"
    },
    {
      "pos": "noun",
      "explanation_en": "A difficult or complex problem or situation that is hard to resolve, often used in the phrase 'a knot to unravel'.",
      "explanation_cn": "指难以解决的复杂问题或状况，常用于短语 'a knot to unravel'（一个难解的结）。",
      "example_en": "The legal case presented a knot of conflicting testimonies that took months to sort out.",
      "example_cn": "这个法律案件涉及相互矛盾的证词，花了数月才理清。"
    },
    {
      "pos": "noun",
      "explanation_en": "A unit of speed equal to one nautical mile per hour, commonly used in maritime and aviation contexts.",
      "explanation_cn": "一种速度单位，等于每小时一海里，常用于航海和航空领域。",
      "example_en": "The ship was traveling at 20 knots through the calm waters.",
      "example_cn": "这艘船在平静的海面上以20节的速度航行。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "braid",
      "analysis": "“Braid”（编结）指将三股或更多材料交叉编织成一条紧密的结构，强调的是有规律的交织过程，常用于头发、绳索或装饰品。而 “knot” 是通过缠绕、打结形成固定点，不强调规律性，更注重功能性或临时性连接。"
    },
    {
      "word_to_compare": "tangle",
      "analysis": "“Tangle”（纠缠）指杂乱无章地缠绕在一起，通常带有负面含义，表示混乱或难以理清的状态。而 “knot” 是有意识打成的、结构明确的结，虽然也可能难解，但本质是人为的、有目的的。"
    },
    {
      "word_to_compare": "bond",
      "analysis": "“Bond”（纽带/连接）强调抽象的联系，如情感、法律或化学上的连接，而 “knot” 是具体的物理实体，通常由绳索或线材构成。虽然两者都可比喻为“联系”，但 “knot” 更具象、可触摸，而 “bond” 更抽象。"
    }
  ]
}