{
  "word": "knuckle",
  "pronunciation": "nuk·uhl",
  "concise_definition": "n. 指节, 拳头; v. 用指节敲击, 紧握",
  "forms": {
    "plural": "knuckles"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The joint between the bones of the fingers and the hand, especially the one that becomes prominent when the hand is clenched into a fist.",
      "explanation_cn": "手指与手掌之间的关节，尤其在拳头紧握时突出的部分。",
      "example_en": "He cracked his knuckles nervously before the interview.",
      "example_cn": "面试前，他紧张地掰响指节。"
    },
    {
      "pos": "noun",
      "explanation_en": "A clenched fist, especially when used as a weapon or in a gesture of aggression or determination.",
      "explanation_cn": "紧握的拳头，尤其用作武器或表达攻击性或决心的姿态。",
      "example_en": "She raised her knuckles in a silent show of solidarity.",
      "example_cn": "她举起拳头，以沉默的方式表达团结。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strike or tap someone or something with the knuckles, often as a signal or in a playful or aggressive manner.",
      "explanation_cn": "用指节敲击某人或某物，常用于示意、戏弄或表达攻击性。",
      "example_en": "He knuckled the table to get the waiter's attention.",
      "example_cn": "他敲了敲桌子以引起服务员的注意。"
    },
    {
      "pos": "verb",
      "explanation_en": "To grip or hold something tightly, often with the fingers curled and knuckles white from tension.",
      "explanation_cn": "紧紧握住某物，通常手指弯曲，因紧张而指节发白。",
      "example_en": "She knuckled the steering wheel as the storm raged outside.",
      "example_cn": "外面风暴肆虐时，她紧紧握住方向盘。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "joint",
      "analysis": "“Joint” (关节) 是解剖学上的通用术语，泛指身体任何两骨相接之处，如膝关节、肘关节等，范围广泛且中性。而 “knuckle” 特指手指与手掌之间的指节关节，是 “joint” 的一个具体子类，且常带有动作或情绪的联想。"
    },
    {
      "word_to_compare": "fist",
      "analysis": "“Fist” (拳头) 指整个紧握的手部形态，是包含五个手指和掌心的完整结构；而 “knuckle” 仅指指节部分，是拳头的组成部分。当说 “knuckle” 作动词时，强调的是用指节敲击的动作，而 “fist” 作动词时通常指用整个拳头击打。"
    },
    {
      "word_to_compare": "tap",
      "analysis": "“Tap” (轻拍) 是一个通用动词，指任何轻柔、短暂的接触，可用于手、工具或物体，不涉及特定身体部位。而 “knuckle” 作为动词时，特指用指节敲击，动作更具体、更具身体性，常带有节奏感或情绪色彩（如焦虑、挑衅）。"
    }
  ]
}