{
  "word": "koch",
  "pronunciation": "kohk",
  "concise_definition": "n. 科赫（姓氏），科赫氏杆菌；v. （罕见）用科赫法培养细菌",
  "forms": {
    "plural": "koches"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A surname, most notably associated with Robert Koch, a German physician and microbiologist who pioneered the field of bacteriology and identified the causative agents of tuberculosis, cholera, and anthrax.",
      "explanation_cn": "一个姓氏，最著名的是罗伯特·科赫（Robert Koch），一位德国医生和微生物学家，被誉为细菌学的奠基人，首次鉴定出结核病、霍乱和炭疽病的病原体。",
      "example_en": "Robert Koch's postulates remain a foundational framework in medical microbiology.",
      "example_cn": "科赫法则至今仍是医学微生物学的基础框架。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of bacterium or culture method named after Robert Koch, especially used in historical contexts to refer to the tubercle bacillus (Mycobacterium tuberculosis).",
      "explanation_cn": "一种以罗伯特·科赫命名的细菌或培养方法，尤其在历史语境中指结核杆菌（结核分枝杆菌）。",
      "example_en": "The lab technicians carefully handled the Koch bacillus under sterile conditions.",
      "example_cn": "实验室技术人员在无菌条件下小心处理科赫氏杆菌。"
    },
    {
      "pos": "verb",
      "explanation_en": "To culture or isolate bacteria using techniques developed by Robert Koch, especially on solid media such as agar plates.",
      "explanation_cn": "使用罗伯特·科赫开发的技术（如在琼脂平板上）培养或分离细菌，此用法极为罕见，多见于专业文献或历史语境。",
      "example_en": "Early microbiologists would koch the sample to observe colony formation.",
      "example_cn": "早期的微生物学家会将样本进行科赫培养，以观察菌落形成。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "culture",
      "analysis": "“Culture”（培养）是通用术语，指在人工环境中使微生物生长的过程，可使用液体或固体培养基。而 “koch” 作为动词特指科赫所建立的、以固体培养基和纯菌落分离为核心的经典方法，具有历史和技术专属性。"
    },
    {
      "word_to_compare": "isolate",
      "analysis": "“Isolate”（分离）泛指从混合样本中分离出单一微生物或成分，是一个目标或结果。而 “koch” 不仅包含分离，还特指通过科赫的固体培养技术实现分离和纯化的过程，强调方法论。"
    },
    {
      "word_to_compare": "bacillus",
      "analysis": "“Bacillus”（杆菌）是细菌形态学分类术语，指杆状细菌，是一个广泛类别。而 “Koch” 作为名词时，特指由科赫发现或命名的某种致病菌（如结核杆菌），是专有名词，具有历史和科学权威性。"
    }
  ]
}