{
  "word": "kodak",
  "pronunciation": "koh·dak",
  "concise_definition": "n. 柯达（品牌名），胶卷；adj. 柯达的",
  "forms": {
    "plural": "Kodaks"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A brand name for a company founded by George Eastman in 1888, renowned for pioneering consumer photography and producing film, cameras, and photographic equipment; often used generically to refer to film or cameras, especially in the 20th century.",
      "explanation_cn": "由乔治·伊士曼于1888年创立的品牌，以开创大众摄影并生产胶卷、相机和摄影设备而闻名；在20世纪常被泛指为胶卷或相机。",
      "example_en": "She still uses a classic Kodak camera to capture her summer vacations.",
      "example_cn": "她仍使用一台经典的柯达相机来记录她的暑假时光。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of photographic film or roll film originally produced by the Kodak company, known for its reliability and widespread use in amateur photography.",
      "explanation_cn": "由柯达公司最初生产的胶卷类型，以可靠性高和在业余摄影中的广泛应用著称。",
      "example_en": "The photo album was filled with Kodaks from the 1970s, faded but full of memories.",
      "example_cn": "相册里满是20世纪70年代的柯达胶卷照片，虽然褪色了，却充满回忆。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characteristic of the Kodak company or its products, especially in the context of traditional film photography.",
      "explanation_cn": "与柯达公司或其产品相关的，尤指传统胶片摄影中的特征。",
      "example_en": "The warm, slightly saturated colors in the picture have a classic Kodak look.",
      "example_cn": "这张照片中温暖略带饱和的色彩具有经典的柯达风格。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "film",
      "analysis": "“Film”（胶片）是通用术语，泛指任何用于摄影的感光材料，而 “Kodak” 是一个特定品牌，曾长期主导市场，因此在口语中常被当作胶片的代名词，类似“施乐”之于复印机。但“film”不带有品牌含义，也不特指某一种质量或风格。"
    },
    {
      "word_to_compare": "camera",
      "analysis": "“Camera”（相机）是泛指所有成像设备，而 “Kodak” 作为品牌，特指由柯达公司生产的相机。虽然历史上“Kodak”常被用作相机的代称（如“拿个柯达去拍照”），但现代语境中，它仅指特定品牌的产品，不能替代所有相机类型（如单反、手机相机）。"
    },
    {
      "word_to_compare": "snapshot",
      "analysis": "“Snapshot”（快照）指一种随意、非正式的摄影行为或照片，强调瞬间性和生活化，而 “Kodak” 是物理产品（胶卷或相机），是实现快照的工具。两者属于不同维度：一个是行为/结果，一个是设备/媒介。但“Kodak moment”已成为文化短语，指值得用柯达相机记录的温馨瞬间。"
    }
  ]
}