{
  "word": "kosher",
  "pronunciation": "koh·sher",
  "concise_definition": "adj. 符合犹太教规的, 合格的, 正当的; n. 犹太洁食",
  "forms": {
    "comparative": "kasher",
    "superlative": "kashered"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "In accordance with Jewish dietary laws, which specify which foods are permitted and how they must be prepared, slaughtered, and processed to be considered ritually pure.",
      "explanation_cn": "符合犹太教饮食法规的，指那些被允许食用、并经过特定方式屠宰和加工以确保其仪式上洁净的食物。",
      "example_en": "The restaurant serves only kosher meat, certified by a rabbi.",
      "example_cn": "这家餐厅只提供经拉比认证的犹太洁食肉类。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Genuine, legitimate, or acceptable according to established rules or standards, often used informally to describe something that is above board or trustworthy.",
      "explanation_cn": "指符合既定规则或标准的、真实的、正当的，常用于非正式语境中形容某事物合法、可靠或无可非议。",
      "example_en": "Is this deal really kosher, or are we being scammed?",
      "example_cn": "这笔交易真的合法吗，还是我们在被欺骗？"
    },
    {
      "pos": "noun",
      "explanation_en": "Food that meets the requirements of Jewish dietary law; specifically, food that has been prepared and certified as ritually pure.",
      "explanation_cn": "符合犹太教饮食法规的食物，特指经过认证为仪式上洁净的食品。",
      "example_en": "She only eats kosher, so she avoids pork and shellfish entirely.",
      "example_cn": "她只吃犹太洁食，因此完全避免食用猪肉和贝类。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "halal",
      "analysis": "“Halal”（清真）是伊斯兰教法中对可食用食物的定义，与“kosher”在功能上相似，都涉及宗教饮食规范。但两者在屠宰方式、禁食清单和仪式程序上存在差异，例如犹太教要求由专门的屠夫（shochet）以特定方式宰杀，而伊斯兰教则要求以真主之名诵念。两者不可互换，但常被类比为宗教洁食的对应概念。"
    },
    {
      "word_to_compare": "legitimate",
      "analysis": "“Legitimate”（合法的、正当的）是一个更广泛的通用词，指符合法律、道德或社会规范的事物，不涉及宗教背景。而“kosher”在非宗教语境中借用其“正当性”含义，但其根源和文化语境仍与犹太教紧密相关，因此“kosher”带有更强的文化和仪式色彩。"
    },
    {
      "word_to_compare": "authentic",
      "analysis": "“Authentic”（真实的、原汁原味的）强调事物的真实性或来源的纯粹性，如“authentic Italian pizza”。它关注的是是否为原版或非仿冒，而“kosher”关注的是是否符合宗教规范。一个食物可以是“authentic”但不“kosher”，反之亦然。"
    }
  ]
}