{
  "word": "labelling",
  "pronunciation": "lab·uh·ling",
  "concise_definition": "n. 贴标签, 标识, 标注",
  "forms": {
    "base_form": "label",
    "plural": "labellings",
    "present_participle": "labelling",
    "past_tense": "labelled",
    "past_participle": "labelled"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of attaching a label or tag to something to identify, classify, or provide information about it, often for organizational, legal, or commercial purposes.",
      "explanation_cn": "指为某物附加标签或标记，以识别、分类或提供相关信息，通常用于组织、法律或商业目的。",
      "example_en": "The labelling of food products must comply with strict health regulations.",
      "example_cn": "食品包装的标签必须符合严格的安全法规。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process of assigning a category or descriptor to a person or group, often carrying social, psychological, or political implications.",
      "explanation_cn": "指为个人或群体赋予某种类别或描述性标签，通常带有社会、心理或政治层面的影响。",
      "example_en": "The labelling of teenagers as 'troublemakers' can reinforce negative stereotypes and limit their opportunities.",
      "example_cn": "将青少年贴上‘问题少年’的标签，会强化负面刻板印象并限制他们的机会。"
    },
    {
      "pos": "noun",
      "explanation_en": "The text or symbols printed on a product's packaging that convey details such as ingredients, origin, usage, or warnings.",
      "explanation_cn": "指印在产品包装上的文字或符号，用于传达成分、产地、使用方法或警告等信息。",
      "example_en": "The labelling on the bottle clearly states 'recyclable' and 'BPA-free'.",
      "example_cn": "瓶子上的标签清楚地标明了‘可回收’和‘不含双酚A’。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tagging",
      "analysis": "“Tagging”（标记）通常指在数字环境或物理对象上快速附加简短标识，如社交媒体标签（#hashtag）或仓库中的条形码标签，强调便捷性和功能性。而 “labelling” 更正式、更系统，常涉及法律或规范要求，信息更完整，语义更丰富。"
    },
    {
      "word_to_compare": "naming",
      "analysis": "“Naming”（命名）侧重于赋予一个事物正式或独特的名称，通常是唯一的、识别性的，如公司命名、人名命名。而 “labelling” 更强调分类、归类或附加描述性信息，可能包含多个标签，且不一定具有唯一性。"
    },
    {
      "word_to_compare": "annotation",
      "analysis": "“Annotation”（注释）通常指在文本、图像或数据上添加解释性文字，目的是辅助理解或分析，常见于学术、技术或艺术领域。它更侧重于解释性内容，而 “labelling” 更侧重于标识、分类或合规性要求，通常更简洁直接。"
    }
  ]
}