{
  "word": "labor",
  "pronunciation": "ley·bər",
  "concise_definition": "n. 劳动, 劳动力, 工人; v. 努力工作, 艰难地从事",
  "forms": {
    "plural": "labors",
    "third_person_singular": "labors",
    "past_tense": "laborled",
    "past_participle": "laborled",
    "present_participle": "laboring"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Physical or mental effort exerted to produce goods or services, especially when performed for wages or as part of a job.",
      "explanation_cn": "指为生产商品或提供服务而付出的体力或脑力劳动，通常以获得报酬为目的或作为工作的一部分。",
      "example_en": "The construction project required hundreds of hours of manual labor.",
      "example_cn": "这个建筑工程需要数百小时的体力劳动。"
    },
    {
      "pos": "noun",
      "explanation_en": "The workforce or group of people engaged in physical or industrial work, often considered as a collective economic class.",
      "explanation_cn": "指从事体力或工业工作的劳动者群体，常被视为一个整体的经济阶级。",
      "example_en": "The union represents the interests of labor in negotiations with management.",
      "example_cn": "工会在与管理层的谈判中代表劳动者的利益。"
    },
    {
      "pos": "verb",
      "explanation_en": "To work hard or struggle persistently, especially when the task is difficult, exhausting, or prolonged.",
      "explanation_cn": "指努力工作或坚持不懈地从事某项任务，尤其当这项任务艰难、耗尽精力或持续时间长时。",
      "example_en": "She labored for hours to finish the report before the deadline.",
      "example_cn": "她花了数小时努力完成报告，赶在截止日期前交稿。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give birth to a child; to undergo the process of childbirth.",
      "explanation_cn": "指分娩，经历生产的过程。",
      "example_en": "She labored for twelve hours before the baby was born.",
      "example_cn": "她分娩了十二个小时，孩子才出生。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "work",
      "analysis": "“Work” (工作) 是一个更广泛、更通用的词，涵盖所有类型的职业活动，包括脑力和体力劳动，也可作名词或动词使用。而 “labor” 更强调体力付出、艰苦性或作为社会经济群体的集体性，常用于正式或政治语境中。"
    },
    {
      "word_to_compare": "toil",
      "analysis": "“Toil” (辛劳) 与 “labor” 意义接近，但语气更强烈，带有极度疲惫、单调和痛苦的色彩，常用于文学性表达。例如：toil in the fields。而 “labor” 更中性，可指正常的工作或分娩过程，适用范围更广。"
    },
    {
      "word_to_compare": "effort",
      "analysis": "“Effort” (努力) 指为达成目标所付出的精力或尝试，是抽象名词，不特指职业性劳动。而 “labor” 强调实际的、持续的、有产出的活动，常与报酬、职业或生产相关。例如：make an effort（做出努力）≠ do labor（从事劳动）。"
    }
  ]
}