{
  "word": "labour",
  "pronunciation": "læb·ər",
  "concise_definition": "n. 劳动, 劳动力, 工作; v. 努力工作, 分娩",
  "forms": {
    "third_person_singular": "labours",
    "past_tense": "laboured",
    "past_participle": "laboured",
    "present_participle": "labouring"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Physical or mental effort exerted in the performance of work, especially when it is hard, sustained, or done for wages.",
      "explanation_cn": "指为完成工作而付出的体力或脑力劳动，尤指艰苦、持续或以获取报酬为目的的劳动。",
      "example_en": "The construction workers endured long hours of hard labour under the hot sun.",
      "example_cn": "建筑工人在烈日下忍受着长时间的艰苦劳动。"
    },
    {
      "pos": "noun",
      "explanation_en": "The collective body of workers in a particular industry, region, or country; the workforce.",
      "explanation_cn": "指某一行业、地区或国家中所有工人的总称；劳动力。",
      "example_en": "The government is negotiating with the labour union to improve working conditions.",
      "example_cn": "政府正在与工会谈判，以改善工作条件。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process of giving birth to a baby; childbirth.",
      "explanation_cn": "指分娩的过程；生产。",
      "example_en": "She was in labour for over 12 hours before the baby was born.",
      "example_cn": "她在分娩过程中持续了12个多小时才生下孩子。"
    },
    {
      "pos": "verb",
      "explanation_en": "To work hard or exert oneself, especially in a difficult or prolonged effort.",
      "explanation_cn": "指努力工作或付出大量精力，尤指在困难或持久的劳动中。",
      "example_en": "He laboured for years to complete his doctoral thesis.",
      "example_cn": "他花了多年时间才完成博士论文。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give birth to a child; to undergo childbirth.",
      "explanation_cn": "指分娩，经历生产的过程。",
      "example_en": "She laboured through the night and delivered a healthy baby in the morning.",
      "example_cn": "她整夜分娩，第二天早上顺利生下了一个健康的婴儿。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "work",
      "analysis": "“Work” (工作) 是一个更广泛、更通用的词，泛指任何有目的的活动或任务，可以是脑力或体力，也可以是自愿或有报酬的。“Labour” 更强调体力消耗、艰苦性或作为经济生产要素的劳动力，常带有沉重、辛劳的语义色彩。"
    },
    {
      "word_to_compare": "effort",
      "analysis": "“Effort” (努力) 指为达成目标所付出的精力或尝试，可以是短暂的、一次性的，不一定涉及持续劳动或报酬。“Labour” 则通常指持续性的、制度化的体力或脑力付出，常与职业、生产或经济活动相关。"
    },
    {
      "word_to_compare": "delivery",
      "analysis": "“Delivery” (分娩) 是一个中性术语，泛指将婴儿从母体中送出的过程，可指医疗行为或结果。“Labour” 专指分娩前的整个生理过程，包括宫缩、扩张等阶段，强调过程的艰辛与时间跨度。"
    }
  ]
}