{
  "word": "labyrinth",
  "pronunciation": "lab·uh·rinth",
  "concise_definition": "n. 迷宫, 迷惑, 复杂的系统",
  "forms": {
    "plural": "labyrinths"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A complex network of paths or passages, typically with many twists and turns, designed to confuse or challenge those who try to navigate it.",
      "explanation_cn": "指由众多曲折路径组成的复杂通道网络，通常设计用来迷惑或挑战试图穿越的人。",
      "example_en": "The ancient Greeks built a legendary labyrinth to house the Minotaur.",
      "example_cn": "古希腊人建造了一个传奇般的迷宫来关押弥诺陶洛斯。"
    },
    {
      "pos": "noun",
      "explanation_en": "A situation or system that is extremely complicated, confusing, or difficult to understand or escape from, often due to bureaucratic or procedural complexity.",
      "explanation_cn": "指一种极其复杂、令人困惑或难以理解或摆脱的状况或系统，通常源于官僚程序或制度的繁琐。",
      "example_en": "Navigating the tax system feels like walking through a labyrinth of forms and regulations.",
      "example_cn": "处理税务系统就像在一堆表格和法规构成的迷宫中穿行。"
    },
    {
      "pos": "noun",
      "explanation_en": "A symbolic or spiritual path, often circular and single-threaded, used for meditation or contemplation, especially in religious contexts.",
      "explanation_cn": "指一种象征性或精神性的路径，通常为圆形且单线贯穿，用于冥想或沉思，尤其在宗教语境中。",
      "example_en": "She walked the labyrinth in the cathedral to find inner peace.",
      "example_cn": "她在大教堂里沿着迷宫行走，以寻求内心的平静。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "maze",
      "analysis": "“Maze”（迷宫）通常指由多个路径、死胡同和选择构成的、旨在让人迷失方向的物理结构，强调“多路径选择”和“解谜性”；而 “labyrinth” 传统上指单一路线、无死胡同的螺旋路径，更强调象征意义或精神旅程，现代用法中两者常混用，但 “labyrinth” 更具诗意和隐喻色彩。"
    },
    {
      "word_to_compare": "complex",
      "analysis": "“Complex”（复杂系统）是一个更广泛的抽象词，指由多个相互关联部分组成的系统，不一定具有空间或路径的物理形态；而 “labyrinth” 强调一种“令人困惑的路径感”或“难以逃脱的结构”，常带有情感上的压迫感和叙事性。"
    },
    {
      "word_to_compare": "web",
      "analysis": "“Web”（网）常比喻错综复杂的关系网络（如信息网、阴谋网），强调“连接性”和“交织性”；而 “labyrinth” 更强调“路径的曲折”和“迷失方向”的体验，具有更强的空间感和行动导向，常用于描述需要主动穿越的困境。"
    }
  ]
}