{
  "word": "lace",
  "pronunciation": "lays",
  "concise_definition": "n. 鞋带, 细带, 花边; v. 系鞋带, 用带子系紧, 缝花边",
  "forms": {
    "plural": "laces",
    "third_person_singular": "laces",
    "past_tense": "laced",
    "past_participle": "laced",
    "present_participle": "lacing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A thin, flexible cord or strip, typically made of fabric or plastic, used to bind or fasten parts of clothing or footwear together, especially shoes.",
      "explanation_cn": "一种细长、柔韧的带子，通常由织物或塑料制成，用于将衣物或鞋类的部件系紧，尤指鞋带。",
      "example_en": "She tied her shoelaces tightly before going for a run.",
      "example_cn": "她跑步前把鞋带系得很紧。"
    },
    {
      "pos": "noun",
      "explanation_en": "A decorative trim made of delicate fabric with open patterns, often used on clothing, curtains, or bedding to add elegance.",
      "explanation_cn": "一种由精细织物制成的装饰性花边，带有镂空图案，常用于服装、窗帘或床上用品，以增添优雅感。",
      "example_en": "The wedding dress featured intricate lace along the neckline and sleeves.",
      "example_cn": "这件婚纱的领口和袖口装饰着精致的花边。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fasten or secure something using laces, especially shoes or corsets.",
      "explanation_cn": "用鞋带或其他细带将某物系紧，尤指系鞋带或束紧束身衣。",
      "example_en": "He laced his hiking boots before setting off up the mountain.",
      "example_cn": "他出发登山前系好了登山靴的鞋带。"
    },
    {
      "pos": "verb",
      "explanation_en": "To sew or insert lace as decoration on fabric or garments.",
      "explanation_cn": "在织物或衣物上缝制或嵌入花边作为装饰。",
      "example_en": "The seamstress laced the gown with silk ribbon to enhance its vintage look.",
      "example_cn": "女裁缝用丝带为礼服缝上花边，以增强其复古风格。"
    },
    {
      "pos": "verb",
      "explanation_en": "To mix or add something (often an intoxicant or drug) to a drink, usually secretly.",
      "explanation_cn": "（通常秘密地）将某种物质（常为酒精或毒品）掺入饮料中。",
      "example_en": "Someone laced his soda with LSD at the party.",
      "example_cn": "有人在派对上往他的苏打水里掺了麦角酸二乙基酰胺。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "string",
      "analysis": "“String”（细绳）泛指任何细长的线状物，用途广泛，如捆绑、悬挂等，材质和用途均较普通，无装饰性。而 “lace” 特指用于系紧鞋履或作为装饰性花边的细带，具有特定功能和审美属性。"
    },
    {
      "word_to_compare": "ribbon",
      "analysis": "“Ribbon”（丝带）通常较宽、较硬，多用于装饰、包装或发饰，材质多为绸缎或塑料，一般不用于系紧鞋履。而 “lace” 更细、更柔韧，常用于功能性系带或精细花边，强调结构与装饰的双重作用。"
    },
    {
      "word_to_compare": "embroidery",
      "analysis": "“Embroidery”（刺绣）是用线在织物上绣出图案的工艺，属于表面装饰技法，而 “lace” 是一种独立的织物结构，本身具有镂空图案，可作为边缘装饰或独立部件使用。两者虽都用于装饰，但制作方式和物理形态不同。"
    }
  ]
}