{
  "word": "laced",
  "pronunciation": "lāst",
  "concise_definition": "adj. 缝有带子的, 掺有, 加有; v. 用带子系紧, 掺入 (lace 的过去式和过去分词)",
  "forms": {
    "base_form": "lace",
    "third_person_singular": "laces",
    "present_participle": "lacing",
    "past_tense": "laced",
    "past_participle": "laced"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Fastened or secured with laces, typically referring to shoes, corsets, or garments that have strings threaded through eyelets to tighten them.",
      "explanation_cn": "指用鞋带、绳子等穿过孔眼系紧的，通常用于描述鞋子、紧身胸衣或需要系带的衣物。",
      "example_en": "She slipped on her laced boots before heading out into the snow.",
      "example_cn": "她出门前穿上了系带的靴子。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Mixed or infused with a substance, often one that is hidden, harmful, or enhancing, such as drugs, alcohol, or sugar.",
      "explanation_cn": "指被掺入某种物质（常为隐蔽的、有害的或增强效果的），如毒品、酒精或糖分。",
      "example_en": "The wine was laced with poison, and several guests fell ill.",
      "example_cn": "那瓶酒被掺了毒，几位客人因此生病。"
    },
    {
      "pos": "verb",
      "explanation_en": "To thread a lace through holes or eyelets in order to fasten or tighten something, especially footwear or clothing.",
      "explanation_cn": "指将鞋带穿过孔眼以系紧某物，尤指鞋子或衣物。",
      "example_en": "He laced his hiking boots tightly to prevent blisters.",
      "example_cn": "他把登山靴的鞋带系得很紧，以防起水泡。"
    },
    {
      "pos": "verb",
      "explanation_en": "To add a substance, often subtly or unexpectedly, to a drink, food, or other mixture.",
      "explanation_cn": "指将某种物质（常是悄悄地或出人意料地）加入饮料、食物或其他混合物中。",
      "example_en": "The punch was laced with rum, though no one had been told.",
      "example_cn": "那杯潘趣酒里掺了朗姆酒，但没人被告知。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fastened",
      "analysis": "“Fastened”（系紧）是更通用的词，泛指任何方式的固定，如扣子、拉链、卡扣等；而 “laced” 特指通过穿绳或系带的方式固定，强调绳状物的穿插动作和结构。"
    },
    {
      "word_to_compare": "infused",
      "analysis": "“Infused”（注入）通常用于描述温和、渐进或芳香性的添加，如香料注入茶中，带有正面或中性含义；而 “laced” 常带有隐秘性或负面色彩，如掺毒、掺酒，强调非自愿或隐蔽的混合。"
    },
    {
      "word_to_compare": "threaded",
      "analysis": "“Threaded”（穿线）强调物理上将线穿过孔洞的动作，可用于针线、电线等广泛场景；而 “laced” 专用于系带系统，如鞋带、束腰，具有特定的服饰或功能语境，语义范围更窄。"
    }
  ]
}