{
  "word": "lancaster",
  "pronunciation": "lan·cas·ter",
  "concise_definition": "n. 兰开斯特（地名/姓氏），兰开斯特王朝，兰开斯特轰炸机",
  "forms": {
    "plural": "lancasters"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A city in northwestern England, known for its historic castle, university, and as the namesake of the House of Lancaster in English history.",
      "explanation_cn": "英格兰西北部的一座城市，以其历史悠久的城堡、大学以及作为英国历史上兰开斯特王朝的名称来源而闻名。",
      "example_en": "The University of Lancaster is renowned for its research in environmental science.",
      "example_cn": "兰开斯特大学以其在环境科学领域的研究而著称。"
    },
    {
      "pos": "noun",
      "explanation_en": "A royal house in medieval England that ruled from 1399 to 1461 and again from 1470 to 1471, one of the two rival factions in the Wars of the Roses.",
      "explanation_cn": "中世纪英格兰的一个王室家族，曾于1399至1461年以及1470至1471年统治英格兰，是玫瑰战争中两大对立派系之一。",
      "example_en": "Henry IV, the first Lancastrian king, seized the throne from Richard II.",
      "example_cn": "首位兰开斯特王朝国王亨利四世从理查二世手中夺取了王位。"
    },
    {
      "pos": "noun",
      "explanation_en": "A British four-engine heavy bomber used extensively by the Royal Air Force during World War II, known for its reliability and payload capacity.",
      "explanation_cn": "二战期间英国皇家空军广泛使用的四发重型轰炸机，以其可靠性与大载弹量著称。",
      "example_en": "The Lancaster bomber played a crucial role in the bombing raids over Germany.",
      "example_cn": "兰开斯特轰炸机在对德国的轰炸行动中发挥了关键作用。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "chester",
      "analysis": "“Chester” 是英格兰多个地名的后缀（如 Chester, Manchester），源自拉丁语 castra（军营），通常指古罗马军事要塞所在地。而 “Lancaster” 是一个完整专有名词，特指英格兰兰开夏郡的城市，其名称源于古英语 Lanchaster，结合了河流名与罗马军营含义，具有独特历史语境。"
    },
    {
      "word_to_compare": "york",
      "analysis": "“York”（约克）是另一个英国历史重镇，与兰开斯特同为玫瑰战争中的对立家族（约克家族 vs 兰开斯特家族）的象征。两者均为地名演化为王朝名，但 “York” 代表白玫瑰派系，而 “Lancaster” 代表红玫瑰派系，具有鲜明的政治与象征对立关系。"
    },
    {
      "word_to_compare": "bomber",
      "analysis": "“Bomber” 是泛指执行轰炸任务的军用飞机，而 “Lancaster” 是特指二战中英国制造的一种具体型号的重型轰炸机。前者是类别词，后者是专有名词，具有唯一性和历史标志性。"
    }
  ]
}