{
  "word": "lancashire",
  "pronunciation": "lan·kash·er",
  "concise_definition": "n. 兰开夏（英国英格兰西北部的一个郡）",
  "forms": {
    "adjective": "Lancashire"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A historic and ceremonial county in North West England, known for its industrial heritage, particularly in textiles during the Industrial Revolution, and for landmarks such as the Ribble Valley and the Forest of Bowland.",
      "explanation_cn": "位于英格兰西北部的一个历史悠久且具有礼仪地位的郡，以工业革命时期纺织业的繁荣著称，拥有里布尔谷和鲍尔顿森林等著名地标。",
      "example_en": "Lancashire is famous for its traditional dish, Lancashire hotpot.",
      "example_cn": "兰开夏以其传统菜肴兰开夏炖菜而闻名。"
    },
    {
      "pos": "noun",
      "explanation_en": "A dialect or accent associated with the people of Lancashire, characterized by distinctive vowel sounds and local vocabulary.",
      "explanation_cn": "与兰开夏人相关的方言或口音，以独特的元音发音和本地词汇为特征。",
      "example_en": "He spoke with a strong Lancashire accent, saying 'owt' instead of 'anything'.",
      "example_cn": "他带着浓重的兰开夏口音，把 'anything' 说成 'owt'。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of cheese originating from Lancashire, known for its crumbly texture and mild flavor, often used in sandwiches and cooking.",
      "explanation_cn": "一种起源于兰开夏的奶酪，以其易碎的质地和温和的风味著称，常用于三明治和烹饪。",
      "example_en": "She packed a sandwich with fresh Lancashire cheese for her picnic.",
      "example_cn": "她为野餐准备了一个夹着新鲜兰开夏奶酪的三明治。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "Yorkshire",
      "analysis": "“Yorkshire”（约克郡）是英格兰北部另一个历史悠久的郡，与兰开夏相邻，同样以工业革命时期的纺织业闻名。但约克郡更强调其广阔的荒原（如北约克荒原）和更强烈的地域自豪感，而兰开夏则以城市化程度高、棉纺业集中和独特的奶酪与炖菜文化为特色。"
    },
    {
      "word_to_compare": "Cumbria",
      "analysis": "“Cumbria”（坎布里亚）位于兰开夏以北，以自然风光著称，包括湖区国家公园。与兰开夏的工业遗产不同，坎布里亚更侧重于农业、旅游和生态保护，文化上更偏向乡村与自然主义。"
    },
    {
      "word_to_compare": "Cheshire",
      "analysis": "“Cheshire”（柴郡）位于兰开夏以南，以奶酪（柴郡奶酪）和乡村风光闻名。虽然两者都出产著名奶酪，但兰开夏奶酪质地更易碎、风味更清淡，而柴郡奶酪更坚实、咸味更重；此外，兰开夏的工业历史比柴郡更显著。"
    }
  ]
}