{
  "word": "landscapes",
  "pronunciation": "land·skayps",
  "concise_definition": "n. 风景, 景观, 地貌",
  "forms": {
    "singular": "landscape"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The visible features of an area of land, including its physical elements such as mountains, rivers, forests, and human-made structures, often considered in terms of their aesthetic appeal.",
      "explanation_cn": "指一片土地上可见的自然与人文特征，如山脉、河流、森林、建筑等，通常以其美学价值来评价。",
      "example_en": "The painter captured the rolling hills and golden fields of the countryside in breathtaking detail.",
      "example_cn": "这位画家以惊人的细节描绘了乡村连绵的山丘和金色的田野。"
    },
    {
      "pos": "noun",
      "explanation_en": "A picture, photograph, or other visual representation that depicts natural scenery, especially one in a horizontal format.",
      "explanation_cn": "指描绘自然景色的图画、照片或其他视觉表现形式，尤指横向构图的作品。",
      "example_en": "She hung a beautiful landscape above the fireplace to bring a sense of calm to the room.",
      "example_cn": "她在壁炉上方挂了一幅美丽的风景画，为房间增添了一份宁静。"
    },
    {
      "pos": "noun",
      "explanation_en": "A broad range or variety of something, especially in terms of experiences, options, or characteristics.",
      "explanation_cn": "指某事物的广泛范围或多样性，尤指经验、选择或特征的多样性。",
      "example_en": "The city offers a rich landscape of cultural activities, from theater to street art.",
      "example_cn": "这座城市提供了丰富多彩的文化活动，从戏剧到街头艺术应有尽有。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "scenery",
      "analysis": "“Scenery” (景色) 通常指自然环境中整体的视觉美感，更侧重于观赏性，常用于描述剧院、电影或旅行中的视觉体验。它不包含人为结构，也不强调地理构成。而 “landscape” 更全面，既包括自然元素，也包括人类活动的影响，且可用于抽象比喻。"
    },
    {
      "word_to_compare": "view",
      "analysis": "“View” (视野/景色) 指从特定位置所看到的景象，具有主观性和视角依赖性。例如，从山顶看到的“view”是局部的、瞬时的。而 “landscape” 是对一个区域整体特征的客观描述，不依赖于观察者的位置。"
    },
    {
      "word_to_compare": "terrain",
      "analysis": "“Terrain” (地形) 专指土地的物理特征，如坡度、土壤类型、地貌结构，常用于军事、地质或工程语境，强调实用性而非美学。而 “landscape” 更广泛，包含视觉、文化与情感维度，是更综合的概念。"
    }
  ]
}