{
  "word": "landscape",
  "pronunciation": "lands·kayp",
  "concise_definition": "n. 风景, 景观; v. 景观设计",
  "forms": {
    "plural": "landscapes",
    "third_person_singular": "landscapes",
    "past_tense": "landscaped",
    "past_participle": "landscaped",
    "present_participle": "landscaping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The visible features of an area of land, including natural elements such as mountains, rivers, and forests, as well as human-made structures like buildings and roads, often considered in terms of their aesthetic appeal.",
      "explanation_cn": "指一片土地上可见的自然与人工特征，如山脉、河流、森林、建筑和道路等，通常从美学角度加以审视。",
      "example_en": "The rolling hills and golden fields created a breathtaking landscape at sunset.",
      "example_cn": "连绵的丘陵与金色的田野在日落时分构成了一幅令人叹为观止的风景。"
    },
    {
      "pos": "noun",
      "explanation_en": "A picture or representation of a natural scene, especially in painting or photography, emphasizing the arrangement of land and sky.",
      "explanation_cn": "指以绘画或摄影形式表现自然景色的作品，特别强调土地与天空的构图与布局。",
      "example_en": "She specializes in oil paintings of rural landscapes.",
      "example_cn": "她专攻乡村风景的油画创作。"
    },
    {
      "pos": "noun",
      "explanation_en": "The overall environment or context in which something exists or operates, especially in a metaphorical or abstract sense (e.g., political, technological, or market landscape).",
      "explanation_cn": "指某事物存在或运作的整体环境或背景，常用于隐喻或抽象意义（如政治、技术或市场环境）。",
      "example_en": "The digital landscape has changed dramatically since the rise of social media.",
      "example_cn": "自社交媒体兴起以来，数字环境已发生巨大变化。"
    },
    {
      "pos": "verb",
      "explanation_en": "To design and arrange the natural and artificial elements of an outdoor area to enhance its beauty and functionality, typically involving plants, paths, water features, and structures.",
      "explanation_cn": "指通过规划和布置户外区域的自然与人工元素（如植物、小径、水景和构筑物）来提升其美观性与实用性。",
      "example_en": "The homeowners hired professionals to landscape their backyard with native plants and a stone pathway.",
      "example_cn": "房主聘请专业人士用本地植物和石板小径为后院进行景观设计。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "scenery",
      "analysis": "“Scenery”（景色）通常指视觉上吸引人的自然或城市景象，尤其强调观赏性，多用于戏剧、电影或旅游语境，范围较窄，不包含人为设计的元素。而 “landscape” 不仅包括自然景色，还可涵盖人工改造的环境，且可作动词使用，语义更广、更结构化。"
    },
    {
      "word_to_compare": "view",
      "analysis": "“View”（视野/景色）指从特定位置所看到的景象，强调观察者的视角和位置，通常是局部的、瞬时的。而 “landscape” 是对一片区域整体风貌的描述，不依赖于观察点，具有更全面、更客观的空间属性。"
    },
    {
      "word_to_compare": "terrain",
      "analysis": "“Terrain”（地形）专指土地的物理特征，如坡度、海拔、土壤类型等，侧重地理与工程层面的客观描述，不包含美学或人文设计因素。而 “landscape” 包含地形，但更强调其视觉呈现与人为干预后的综合效果。"
    }
  ]
}