{
  "word": "land",
  "pronunciation": "land",
  "concise_definition": "n. 土地, 国土, 陆地; v. 登陆, 降落, 安置, 获得",
  "forms": {
    "third_person_singular": "lands",
    "past_tense": "landed",
    "past_participle": "landed",
    "present_participle": "landing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The solid part of the Earth's surface, as opposed to water or air; a specific area of ground, often with legal or economic significance.",
      "explanation_cn": "地球表面的固体部分，与水或空气相对；特指具有法律或经济意义的某块地面。",
      "example_en": "The family inherited a large piece of land in the countryside.",
      "example_cn": "这家人继承了乡下的一大片土地。"
    },
    {
      "pos": "noun",
      "explanation_en": "A country or region considered as a territory or homeland, often used in political or national contexts.",
      "explanation_cn": "在政治或国家语境中，指一个国家或地区作为领土或家园的概念。",
      "example_en": "She was exiled from her native land.",
      "example_cn": "她被流放出了自己的祖国。"
    },
    {
      "pos": "verb",
      "explanation_en": "To come down to the ground or surface after flying or falling, especially referring to aircraft, birds, or spacecraft.",
      "explanation_cn": "指飞行物或鸟类在飞行或下落之后降落在地面或表面，尤指飞机、航天器等。",
      "example_en": "The plane landed safely at Heathrow Airport.",
      "example_cn": "飞机在希思罗机场安全降落。"
    },
    {
      "pos": "verb",
      "explanation_en": "To arrive on shore after a journey by sea; to reach land after traveling over water.",
      "explanation_cn": "指经过海上航行后抵达陆地。",
      "example_en": "The explorers landed on the island after three weeks at sea.",
      "example_cn": "探险家们在海上航行三周后登上了这座岛屿。"
    },
    {
      "pos": "verb",
      "explanation_en": "To obtain or secure something, especially a job, contract, or opportunity, often through effort or skill.",
      "explanation_cn": "指通过努力或技巧获得某物，尤指工作、合同或机会。",
      "example_en": "He landed a prestigious internship at a top law firm.",
      "example_cn": "他成功获得了一家顶尖律师事务所的宝贵实习机会。"
    },
    {
      "pos": "verb",
      "explanation_en": "To place or settle something firmly on a surface, often implying careful or deliberate placement.",
      "explanation_cn": "指将某物稳稳地放置在表面上，常暗示有意识或谨慎的安置。",
      "example_en": "She landed the book gently on the table.",
      "example_cn": "她轻轻地把书放在桌上。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ground",
      "analysis": "“Ground” (地面) 更侧重于指地表本身，常用于物理接触或自然状态（如泥土、草地），而 “land” 更强调土地作为财产、区域或国家的抽象概念。例如，我们说 “walk on the ground”（走在地面上），但说 “own land”（拥有土地）。"
    },
    {
      "word_to_compare": "earth",
      "analysis": "“Earth” (地球/泥土) 可指整个行星，也可指土壤或尘土，具有更广泛的自然或宇宙含义。而 “land” 通常指可供人类使用或占据的陆地部分，不包括海洋或大气。例如，“earth” 可用于 “earthquake”（地震），但 “land” 不用于此语境。"
    },
    {
      "word_to_compare": "arrive",
      "analysis": "“Arrive” (到达) 是一个通用动词，表示抵达某个地点，不强调方式或媒介。而 “land” 特指通过空中或海上方式抵达陆地，具有明确的运动路径和媒介限制。例如，你可以说 “arrive at the airport”，但不能说 “land at the airport” 除非你是指飞机降落。"
    }
  ]
}