{
  "word": "lands",
  "pronunciation": "lændz",
  "concise_definition": "n. 土地, 领地, 国家; v. 降落, 登陆, 获得",
  "forms": {
    "singular": "land",
    "third_person_singular": "lands",
    "past_tense": "landed",
    "past_participle": "landed",
    "present_participle": "landing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The solid part of the Earth's surface, especially when considered in terms of ownership, territory, or agricultural use; often used in plural to refer to estates, domains, or regions.",
      "explanation_cn": "地球表面的陆地部分，尤指涉及所有权、领土或农业用途时；常用复数形式指庄园、领地或区域。",
      "example_en": "The noble family owned vast lands across the countryside.",
      "example_cn": "这个贵族家族拥有横跨乡村的广阔土地。"
    },
    {
      "pos": "noun",
      "explanation_en": "A country or region, especially when referred to poetically or formally as a collective territory.",
      "explanation_cn": "指国家或地区，尤其在诗歌或正式语境中作为整体领土的称呼。",
      "example_en": "He traveled to distant lands in search of ancient wisdom.",
      "example_cn": "他远赴异国他乡，寻求古老的智慧。"
    },
    {
      "pos": "verb",
      "explanation_en": "To come down to the ground or surface after being in the air, especially of aircraft, birds, or people jumping.",
      "explanation_cn": "指从空中降落到地面或表面，尤指飞机、鸟类或人跳跃后着陆。",
      "example_en": "The plane landed safely at Heathrow Airport.",
      "example_cn": "飞机在希思罗机场安全降落。"
    },
    {
      "pos": "verb",
      "explanation_en": "To arrive at a place, especially after a journey or effort; often used metaphorically to mean achieving a goal or position.",
      "explanation_cn": "指经过旅程或努力后抵达某地；常用于比喻意义，表示达成目标或获得职位。",
      "example_en": "After years of hard work, she finally landed her dream job.",
      "example_cn": "经过多年的努力，她终于得到了理想的工作。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ground",
      "analysis": "“Ground” (地面) 指具体的地表或土壤，强调物理接触面，常用于日常语境（如站在地面上）。而 “lands” 更强调领土、所有权或地理区域的整体概念，具有更强的政治或经济含义。"
    },
    {
      "word_to_compare": "territory",
      "analysis": "“Territory” (领土) 是一个更正式、法律化的术语，通常用于国家主权或管辖范围，强调政治边界。而 “lands” 更口语化、文学化，可包含自然景观、农地或历史领地，范围更广且情感色彩更浓。"
    },
    {
      "word_to_compare": "arrive",
      "analysis": "“Arrive” (到达) 是一个中性动词，仅表示抵达某地，不强调方式或结果。而 “land” 作为动词时，常隐含一种经过努力、挑战或飞行后的最终落脚，带有结果导向和成就感，尤其在比喻用法中（如 landed a job）更加强调成功获得。"
    }
  ]
}