{
  "word": "lanes",
  "pronunciation": "leynz",
  "concise_definition": "n. 车道, 航道, 小道",
  "forms": {
    "singular": "lane"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A narrow section of a road or highway designated for a single line of vehicles to travel in, often marked by painted lines or physical barriers to organize traffic flow.",
      "explanation_cn": "指道路上为单列车辆行驶而划定的狭窄区域，通常由标线或物理隔离物标记，用于组织交通流。",
      "example_en": "Drivers must stay in their lane unless overtaking another vehicle.",
      "example_cn": "驾驶员除非超车，否则必须保持在自己的车道内。"
    },
    {
      "pos": "noun",
      "explanation_en": "A designated path or channel for movement, especially in water or air, such as a shipping lane or flight lane.",
      "explanation_cn": "指水路或空中用于特定方向移动的指定通道，如航运航道或飞行航线。",
      "example_en": "Cargo ships follow established shipping lanes across the Pacific Ocean.",
      "example_cn": "货轮沿着太平洋上已确立的航运航道航行。"
    },
    {
      "pos": "noun",
      "explanation_en": "A narrow path or track, especially one used for walking or running, often found in parks or rural areas.",
      "explanation_cn": "指一条狭窄的小径或小道，常用于步行或跑步，多见于公园或乡村地区。",
      "example_en": "We took a quiet stroll down the tree-lined lane behind the cottage.",
      "example_cn": "我们在小屋后那条绿树成荫的小道上悠闲地散步。"
    },
    {
      "pos": "noun",
      "explanation_en": "In sports or competitions, a marked area or division assigned to each participant to ensure fair and organized competition.",
      "explanation_cn": "在体育或比赛中，为每位参赛者分配的标记区域或分道，以确保比赛公平有序。",
      "example_en": "The swimmers lined up at the starting blocks, each in their assigned lane.",
      "example_cn": "游泳运动员们在起跳台上就位，每人占据一条指定的泳道。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "road",
      "analysis": "“Road”（道路）泛指连接两地的公共通行路径，是一个整体概念；而 “lane” 是道路的组成部分，特指其中一条供单列车辆或行人使用的细分通道。一个道路可包含多个车道（lanes）。"
    },
    {
      "word_to_compare": "path",
      "analysis": "“Path”（小路）泛指任何供人或动物行走的通道，通常非正式、无明确边界，可用于自然环境或城市绿地；而 “lane” 更强调被划定或规范化的通道，常用于交通或竞技场景，具有更强的结构性和规则性。"
    },
    {
      "word_to_compare": "corridor",
      "analysis": "“Corridor”（走廊）通常指建筑物内部连接房间或区域的狭长通道，强调封闭空间内的通行功能；而 “lane” 多用于开放空间（如公路、水域、运动场），强调线性分隔与方向性，不具围合结构。"
    }
  ]
}