{
  "word": "lane",
  "pronunciation": "layn",
  "concise_definition": "n. 车道, 小巷, 航道, 赛道",
  "forms": {
    "plural": "lanes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A narrow section of a road or highway, marked or designated for the movement of vehicles in a single line, typically to organize traffic flow and improve safety.",
      "explanation_cn": "指道路上一条狭窄的区域，通常通过标线划分，专供车辆单列行驶，用于组织交通流并提高安全性。",
      "example_en": "She changed lanes to overtake the slow-moving truck.",
      "example_cn": "她换到另一条车道以超车那辆缓慢行驶的卡车。"
    },
    {
      "pos": "noun",
      "explanation_en": "A narrow passageway or alley, especially between buildings or in a market, often used for pedestrian or limited vehicle access.",
      "explanation_cn": "指建筑物之间或市场中的狭窄通道，通常供行人或有限车辆通行。",
      "example_en": "The old market had winding lanes lined with stalls selling fresh produce.",
      "example_cn": "旧市场里有蜿蜒的小巷，两旁摆满了售卖新鲜农产品的摊位。"
    },
    {
      "pos": "noun",
      "explanation_en": "A designated path or course in a competitive setting, such as a swimming pool, racing track, or bowling alley, where participants move independently.",
      "explanation_cn": "指在竞赛环境中（如游泳池、赛道或保龄球道）为参赛者划分的独立路径，确保公平竞争和有序进行。",
      "example_en": "The swimmer stayed in lane 5 throughout the race.",
      "example_cn": "这名游泳运动员在整个比赛中都保持在第五道。"
    },
    {
      "pos": "noun",
      "explanation_en": "A defined route or channel in air or sea navigation, often used to regulate the flow of vessels or aircraft to prevent collisions.",
      "explanation_cn": "指在航空或航海中划定的特定航线，用于规范船只或飞机的流动，防止碰撞。",
      "example_en": "Air traffic controllers direct planes along designated air lanes to maintain safe distances.",
      "example_cn": "空中交通管制员引导飞机沿指定的航路飞行，以保持安全距离。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "road",
      "analysis": "“Road”（道路）泛指连接两地的公共通行路径，是一个整体概念；而 “lane” 是道路的组成部分，特指其中一条供单向行驶的分道。一个 road 可包含多个 lanes。"
    },
    {
      "word_to_compare": "aisle",
      "analysis": "“Aisle”（通道）通常指建筑物内部的纵向通道，如超市、剧院或教堂中的走道，强调的是人行通道而非车辆行驶路径。而 “lane” 更常用于交通或竞赛场景，具有明确的边界和功能划分。"
    },
    {
      "word_to_compare": "track",
      "analysis": "“Track”（轨道/跑道）通常指专为特定运动或交通工具（如火车、赛车）设计的专用路径，结构更固定且常为环形或封闭式；而 “lane” 更通用，可存在于道路、泳池、机场等多种环境中，且不一定是封闭或专用的。"
    }
  ]
}