{
  "word": "langley",
  "pronunciation": "lang·ley",
  "concise_definition": "n. 兰利（姓氏/地名/单位）",
  "forms": {
    "plural": "Langleys"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A surname, notably associated with individuals such as Samuel Pierpont Langley, an American astronomer, physicist, and aviation pioneer who conducted early experiments in powered flight.",
      "explanation_cn": "一个姓氏，尤指美国天文学家、物理学家和航空先驱塞缪尔·皮尔庞特·兰利，他曾进行早期动力飞行实验。",
      "example_en": "The Langley Research Center, named after Samuel Pierpont Langley, is one of NASA's oldest field centers.",
      "example_cn": "以塞缪尔·皮尔庞特·兰利命名的兰利研究中心是美国宇航局最古老的现场中心之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A place name, most commonly referring to Langley, Virginia, a suburban community near Washington, D.C., and home to the Central Intelligence Agency (CIA) headquarters.",
      "explanation_cn": "一个地名，最常指位于华盛顿特区附近的弗吉尼亚州兰利，是美国中央情报局（CIA）总部所在地。",
      "example_en": "He works at Langley, so he’s likely employed by the CIA.",
      "example_cn": "他在兰利工作，所以他很可能受雇于中央情报局。"
    },
    {
      "pos": "noun",
      "explanation_en": "A unit of aerodynamic heating rate in aerospace engineering, defined as one calorie per square centimeter per second, named in honor of Samuel Pierpont Langley.",
      "explanation_cn": "航空航天工程中的一种气动加热率单位，定义为每平方厘米每秒一卡路里，以纪念塞缪尔·皮尔庞特·兰利。",
      "example_en": "The spacecraft's thermal shield must withstand up to 10 langleys during re-entry.",
      "example_cn": "航天器的热防护罩必须能承受再入大气层时高达10兰利的加热率。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hampton",
      "analysis": "“Hampton”（汉普顿）是另一个常见的英语姓氏和地名，多用于美国东海岸，如汉普顿海滩或汉普顿大学。与“Langley”类似，它作为地名常与机构或社区相关，但“Hampton”没有被用作科学单位，而“Langley”在航空航天领域具有特定技术含义。"
    },
    {
      "word_to_compare": "wright",
      "analysis": "“Wright”（莱特）作为姓氏，因莱特兄弟（Wright Brothers）而闻名，与航空史直接相关。虽然“Langley”和“Wright”都与早期飞行实验有关，但“Wright”是人物姓氏，而“Langley”既可指人，也可指地点和科学单位，用途更广泛。"
    },
    {
      "word_to_compare": "newton",
      "analysis": "“Newton”（牛顿）是国际单位制中的力的单位，以科学家艾萨克·牛顿命名，与“Langley”类似，都是以科学家命名的单位。但“Newton”是广泛使用的标准物理单位，而“Langley”是专业领域（如大气科学和航天热力学）中的非SI单位，使用范围更窄、更专业。"
    }
  ]
}