{
  "word": "lantern",
  "pronunciation": "lan·tern",
  "concise_definition": "n. 灯笼, 提灯, 信号灯",
  "forms": {
    "plural": "lanterns"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A portable device with a transparent or translucent cover and a handle, designed to hold and protect a light source such as a candle, oil lamp, or electric bulb, typically used for illumination in outdoor or low-light settings.",
      "explanation_cn": "一种带有透明或半透明罩子和手柄的便携装置，用于容纳并保护蜡烛、油灯或电灯泡等光源，通常用于户外或光线昏暗的环境中提供照明。",
      "example_en": "The hikers carried lanterns to guide their way through the dark forest.",
      "example_cn": "徒步者们提着灯笼，在黑暗的森林中照亮前行的路。"
    },
    {
      "pos": "noun",
      "explanation_en": "A decorative light, often made of paper, silk, or plastic, used in festivals or celebrations, especially in East Asian cultures, symbolizing hope, guidance, or good fortune.",
      "explanation_cn": "一种装饰性灯具，通常由纸、丝绸或塑料制成，常用于节日或庆典中，尤其在东亚文化中象征希望、指引或好运。",
      "example_en": "During the Mid-Autumn Festival, children release colorful lanterns into the night sky.",
      "example_cn": "在中秋节期间，孩子们将五彩的灯笼放上夜空。"
    },
    {
      "pos": "noun",
      "explanation_en": "A signal light, especially one mounted on a vehicle or vessel, used to indicate direction, position, or status (e.g., a ship's lantern or a railway lantern).",
      "explanation_cn": "一种信号灯，尤其指安装在车辆或船只上，用于指示方向、位置或状态的灯光（如船用信号灯或铁路信号灯）。",
      "example_en": "The old lighthouse lantern could be seen for miles out at sea.",
      "example_cn": "那座旧灯塔的信号灯在海上数英里外都能看见。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "flashlight",
      "analysis": "“Flashlight” (手电筒) 通常指使用电池供电、体积小巧、光线集中且可开关的现代照明工具，强调功能性与便携性，主要用于临时照明。而 “lantern” 更强调光源的保护性结构和较广的照明范围，常为传统或装饰性设计，可能使用油、蜡或电，且多用于固定或户外场景。"
    },
    {
      "word_to_compare": "lamp",
      "analysis": "“Lamp” (灯) 是一个更广泛的术语，泛指任何提供照明的装置，包括台灯、吊灯、路灯等，通常固定安装在室内或建筑结构中。而 “lantern” 特指可手持、可移动、有保护罩的照明设备，具有更强的便携性和防护性。"
    },
    {
      "word_to_compare": "candle",
      "analysis": "“Candle” (蜡烛) 是一种独立的燃烧光源，本身不包含外壳或保护结构，易受风影响，主要用于氛围营造或应急照明。而 “lantern” 是一个容器式装置，专门设计用来容纳和保护蜡烛或其他光源，使其更安全、更持久、更适用于户外环境。"
    }
  ]
}