{
  "word": "lap",
  "pronunciation": "lap",
  "concise_definition": "n. 大腿, 一圈, 层次; v. 吮吸, 拍打",
  "forms": {
    "plural": "laps",
    "third_person_singular": "laps",
    "past_tense": "lapped",
    "past_participle": "lapped",
    "present_participle": "lapping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The upper part of the legs when a person is sitting, forming a flat surface on which something can be placed.",
      "explanation_cn": "人坐下时双腿上部形成的平面区域，可用于放置物品。",
      "example_en": "She placed the sleeping baby on her lap.",
      "example_cn": "她把熟睡的婴儿放在自己的腿上。"
    },
    {
      "pos": "noun",
      "explanation_en": "One complete circuit around a race track or a designated course in a race.",
      "explanation_cn": "在赛车或比赛中，围绕赛道或指定路线的一整圈。",
      "example_en": "The driver set a new record on the final lap.",
      "example_cn": "车手在最后一圈创造了新的纪录。"
    },
    {
      "pos": "noun",
      "explanation_en": "A layer or fold of something, especially fabric or material that overlaps another part.",
      "explanation_cn": "某物（尤其是布料或材料）的一层或重叠部分。",
      "example_en": "The blanket had three laps of wool for extra warmth.",
      "example_cn": "这条毯子有三层羊毛重叠，以增加保暖性。"
    },
    {
      "pos": "verb",
      "explanation_en": "To take liquid into the mouth repeatedly with the tongue, as a cat or dog does when drinking.",
      "explanation_cn": "像猫或狗喝水那样，用舌头反复舔舐液体。",
      "example_en": "The cat lapped up the milk from the bowl.",
      "example_cn": "猫用舌头舔光了碗里的牛奶。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or strike with a soft, rhythmic sound or motion, as water or waves do against a shore.",
      "explanation_cn": "以轻柔、有节奏的声音或动作移动或拍打，如水或波浪轻拍岸边。",
      "example_en": "The waves lapped gently against the rocks.",
      "example_cn": "海浪轻轻拍打着岩石。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "thigh",
      "analysis": "“Thigh”（大腿）是人体解剖学上的具体部位，指从臀部到膝盖的骨骼和肌肉区域，是客观的身体结构。而 “lap” 是指坐下时大腿形成的平面区域，是功能性的、临时的承载面，不强调解剖结构。"
    },
    {
      "word_to_compare": "circle",
      "analysis": "“Circle”（圆圈）泛指任何圆形轨迹或形状，是几何概念。而 “lap” 在赛跑语境中特指围绕赛道的一圈，具有明确的起点和终点，强调运动过程中的重复路径，具有时间性和竞技性。"
    },
    {
      "word_to_compare": "suck",
      "analysis": "“Suck”（吸）是通过口腔产生负压将液体或物体吸入，动作更强烈、主动，常用于吸管或婴儿哺乳。而 “lap” 是用舌头轻柔地舔取液体，动作更缓慢、被动，常见于动物饮水，不涉及负压机制。"
    }
  ]
}