{
  "word": "lapse",
  "pronunciation": "lapss",
  "concise_definition": "n. 疏忽, 暂时的失误; v. 陷入, 逐渐消失, 过期",
  "forms": {
    "third_person_singular": "lapses",
    "past_tense": "lapsed",
    "past_participle": "lapsed",
    "present_participle": "lapsing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A temporary failure or slip, especially in behavior, attention, or judgment, often due to carelessness or weakness.",
      "explanation_cn": "指在行为、注意力或判断上的短暂失误或疏忽，通常由粗心或意志薄弱引起。",
      "example_en": "His lapse in judgment led to a costly mistake in the contract.",
      "example_cn": "他在判断上的疏忽导致了合同中一个代价高昂的错误。"
    },
    {
      "pos": "noun",
      "explanation_en": "The end or termination of a right, agreement, or condition after a period of time, especially due to non-use or non-payment.",
      "explanation_cn": "指由于长时间未使用、未支付或其他原因而导致的权利、协议或条件的终止或失效。",
      "example_en": "The insurance policy lapsed after the premium was not paid for six months.",
      "example_cn": "由于连续六个月未支付保费，这份保险单已失效。"
    },
    {
      "pos": "verb",
      "explanation_en": "To gradually decline, disappear, or cease to be active or effective over time.",
      "explanation_cn": "指随着时间推移逐渐衰退、消失或停止活跃或有效。",
      "example_en": "The old traditions have lapsed in most urban areas.",
      "example_cn": "在大多数城市地区，这些古老的传统已经逐渐消失。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fall into a particular state, especially a negative or undesirable one, such as sleep, silence, or error.",
      "explanation_cn": "指陷入某种状态，尤其是负面或不理想的状态，如睡眠、沉默或错误。",
      "example_en": "She lapsed into unconsciousness after the accident.",
      "example_cn": "事故发生后，她陷入了昏迷。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "slip",
      "analysis": "“Slip”（失误）通常指一个轻微、偶然的错误，常用于身体动作或语言表达中的小差错（如口误、滑倒），带有非正式色彩。而 “lapse” 更常用于抽象层面的疏忽，如判断、道德或责任上的暂时失职，语义更正式、更严重。"
    },
    {
      "word_to_compare": "expire",
      "analysis": "“Expire”（到期）强调一个明确的截止时间点，如证件、合同或生命终止，具有法律或时间上的强制性。而 “lapse” 更强调因未续期、未履行而导致的逐渐失效，过程更缓慢，且常含主观责任因素。"
    },
    {
      "word_to_compare": "decline",
      "analysis": "“Decline”（衰退）指一种持续、渐进的下降趋势，常用于数量、质量或影响力，如人口下降、经济衰退。而 “lapse” 更强调从活跃到停止的转折点，或短暂的中断，不一定是长期趋势。"
    }
  ]
}