{
  "word": "lashes",
  "pronunciation": "lash·iz",
  "concise_definition": "n. 睫毛；v. 抽打，鞭打；猛烈抨击",
  "forms": {
    "singular": "lash"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The short, thin hairs that grow along the edge of the eyelids, serving to protect the eyes from dust and debris.",
      "explanation_cn": "生长在眼睑边缘的短而细的毛发，用于保护眼睛免受灰尘和异物的侵入。",
      "example_en": "She applied mascara to make her lashes look longer and fuller.",
      "example_cn": "她涂了睫毛膏，让睫毛看起来更长更浓密。"
    },
    {
      "pos": "noun",
      "explanation_en": "A single stroke or blow delivered with a whip, rope, or similar flexible object; often used in plural to refer to multiple strikes.",
      "explanation_cn": "用鞭子、绳索或其他柔性物体抽打的一下或一次击打；常以复数形式指多次抽打。",
      "example_en": "The prisoner received twenty lashes as punishment.",
      "example_cn": "囚犯被处以二十鞭作为惩罚。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strike repeatedly with a whip, rod, or other flexible instrument, often as a form of punishment or in anger.",
      "explanation_cn": "用鞭子、棍棒或其他柔性工具反复抽打，通常作为惩罚或出于愤怒。",
      "example_en": "The storm lashes the coastline with heavy rain and wind.",
      "example_cn": "暴风雨以暴雨和狂风猛烈抽打着海岸线。"
    },
    {
      "pos": "verb",
      "explanation_en": "To criticize or attack someone or something harshly and publicly, often in speech or writing.",
      "explanation_cn": "以严厉和公开的方式批评或攻击某人或某事，常用于言语或文字中。",
      "example_en": "The newspaper lashed out at the government for its handling of the crisis.",
      "example_cn": "这家报纸猛烈抨击政府对危机的处理方式。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "eyelashes",
      "analysis": "“Eyelashes” 是 “lashes” 在指代眼睑毛发时的更具体形式，专指眼睛周围的毛发。而 “lashes” 作为名词时，还可指鞭打或抽打，语义范围更广。在日常语境中，人们常直接用 “lashes” 指代睫毛，但严格来说，”eyelashes“ 更准确。"
    },
    {
      "word_to_compare": "whip",
      "analysis": "“Whip” 作为名词时指鞭子本身，作为动词时与 “lash” 在‘抽打’义项上相近。但 “whip” 更强调工具和动作的物理性，而 “lash” 更具动态感和情感色彩，常用于比喻性表达（如风暴 lashes 大地）。"
    },
    {
      "word_to_compare": "criticize",
      "analysis": "“Criticize” 是中性或正式的批评，可温和也可严厉，但不带有强烈的情绪色彩。而 “lash out at” 是一种情绪激烈、带有攻击性的公开抨击，语气更重，更具爆发性，常用于新闻或文学语境中表达愤怒的谴责。"
    }
  ]
}