{
  "word": "lateral",
  "pronunciation": "lat·uh·rul",
  "concise_definition": "adj. 侧面的, 旁侧的; n. 侧向移动",
  "forms": {
    "comparative": "lateral",
    "superlative": "lateral"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to the side or being situated at, proceeding from, or directed toward the side; not central or vertical.",
      "explanation_cn": "指与侧面有关的，位于、源自或朝向一侧的；非中心的或非垂直的。",
      "example_en": "The surgeon made a lateral incision to access the organ without damaging the spine.",
      "example_cn": "外科医生做了侧向切口，以在不损伤脊柱的情况下接触器官。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or involving movement or extension to the side, especially in anatomy or sports.",
      "explanation_cn": "指与向侧面的运动或延伸有关，尤其在解剖学或体育运动中。",
      "example_en": "Lateral movement is essential for basketball players to defend against quick opponents.",
      "example_cn": "侧向移动对篮球运动员防守快速对手至关重要。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Not hierarchical; involving communication or relationships between people at the same level in an organization.",
      "explanation_cn": "非层级的；指组织中同级人员之间的沟通或关系。",
      "example_en": "The company encourages lateral communication between departments to improve collaboration.",
      "example_cn": "公司鼓励部门间的横向沟通以提升协作效率。"
    },
    {
      "pos": "noun",
      "explanation_en": "A lateral movement or shift, especially in sports or organizational contexts.",
      "explanation_cn": "指侧向的移动或转移，尤其在体育或组织语境中。",
      "example_en": "The quarterback executed a perfect lateral pass to avoid the tackle.",
      "example_cn": "四分卫完成了一次完美的横向传球以避开擒抱。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "side",
      "analysis": "“Side” (侧面) 是一个更通用的词，指任何物体的边缘或一侧，常用于物理空间描述，如“on the side of the hill”。而 “lateral” 更强调方向性或结构性的“侧向”，常用于专业语境，如解剖学、工程或组织管理，具有更强的技术性。"
    },
    {
      "word_to_compare": "horizontal",
      "analysis": "“Horizontal” (水平的) 指与地面平行、无垂直倾斜的方向，强调的是空间中的角度关系。而 “lateral” 强调的是相对于中心或主体的“侧向”，不一定与地面平行。例如，头部的侧向运动可能是水平的，也可能是倾斜的，但始终是“lateral”。"
    },
    {
      "word_to_compare": "transverse",
      "analysis": "“Transverse” (横向的) 指垂直于某物长轴的方向，常用于解剖学或工程中，强调“横切”或“交叉”关系。而 “lateral” 指的是相对于身体或物体中线的左右方向，不一定是横切。例如，手臂的 lateral movement 是远离身体中线，而 transverse cut 是垂直于身体长轴的切口。"
    }
  ]
}