{
  "word": "latin",
  "pronunciation": "lat·in",
  "concise_definition": "n. 拉丁语, 拉丁文; adj. 拉丁的, 拉丁语的",
  "forms": {
    "noun_plural": "Latin languages",
    "adjective_comparative": "more Latin",
    "adjective_superlative": "most Latin"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The classical language of ancient Rome, used in law, religion, science, and literature throughout much of European history; it is the ancestor of the Romance languages.",
      "explanation_cn": "古罗马的古典语言，曾广泛用于法律、宗教、科学和文学领域，是现代罗曼语族（如法语、意大利语、西班牙语）的源头。",
      "example_en": "Many scientific terms are derived from Latin, such as 'homo sapiens' and 'in vitro'.",
      "example_cn": "许多科学术语源自拉丁语，例如 'homo sapiens'（智人）和 'in vitro'（体外）。"
    },
    {
      "pos": "noun",
      "explanation_en": "A language or text written in Latin, especially in academic, religious, or legal contexts.",
      "explanation_cn": "指用拉丁语书写的一种语言或文本，尤用于学术、宗教或法律语境中。",
      "example_en": "The university still requires students to read Latin texts in its classical studies program.",
      "example_cn": "这所大学的古典研究课程仍要求学生阅读拉丁语文本。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to ancient Rome, its people, language, or culture; also referring to the Romance languages or regions influenced by Roman civilization.",
      "explanation_cn": "与古罗马、其人民、语言或文化相关的；也可指受罗马文明影响的罗曼语族语言或地区。",
      "example_en": "Latin architecture features arches, domes, and grand public spaces.",
      "example_cn": "拉丁式建筑以拱门、圆顶和宏伟的公共空间为特色。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used to describe something that is formal, scholarly, or overly complex, often in a way that suggests pretentiousness.",
      "explanation_cn": "用于形容某种正式、学术性或过于复杂的表达方式，常带有矫揉造作的意味。",
      "example_en": "His speech was full of Latin phrases meant to impress the audience.",
      "example_cn": "他的演讲充斥着为了取悦听众而使用的拉丁短语。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "roman",
      "analysis": "“Roman”（罗马的）通常指与古罗马帝国或其后裔直接相关的事物，如罗马人、罗马建筑或罗马法，强调历史与民族属性；而 “Latin” 更侧重语言和文化传承，尤其在语言学和学术语境中，涵盖范围更广，包括所有受拉丁语影响的罗曼语族。"
    },
    {
      "word_to_compare": "classical",
      "analysis": "“Classical”（古典的）泛指古希腊罗马时期的文化遗产，是一个更宽泛的术语，可涵盖哲学、艺术、文学等；而 “Latin” 是一个具体的语言标签，特指拉丁语及其衍生体系。虽然拉丁语属于古典文化，但并非所有古典事物都是拉丁的（如古希腊语就不是拉丁语）。"
    },
    {
      "word_to_compare": "vernacular",
      "analysis": "“Vernacular”（方言/母语）指某一地区或群体日常使用的自然语言，与拉丁语形成鲜明对比。在中世纪欧洲，拉丁语是教会和学术的官方语言，而 vernacular 是普通民众使用的本地语言（如古法语、古英语）。因此，两者代表了‘精英书面语’与‘大众口语’的对立。"
    }
  ]
}