{
  "word": "latinos",
  "pronunciation": "lə·tin·ōz",
  "concise_definition": "n. 拉丁裔人士, 拉丁美洲人（复数形式）",
  "forms": {
    "singular": "latino",
    "feminine_form": "latina",
    "plural": "latinos"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person of Latin American origin or descent, especially one living in the United States; the term often includes people from countries in Central America, South America, and the Caribbean whose languages are derived from Latin, such as Spanish or Portuguese.",
      "explanation_cn": "指具有拉丁美洲血统或起源的人，尤指居住在美国的人；该词通常包括来自中美洲、南美洲和加勒比地区、语言源自拉丁语（如西班牙语或葡萄牙语）的国家的人。",
      "example_en": "The city has a large and vibrant Latino community that celebrates its culture with music and festivals.",
      "example_cn": "这座城市拥有庞大而充满活力的拉丁裔社区，他们通过音乐和节日庆祝自己的文化。"
    },
    {
      "pos": "noun",
      "explanation_en": "Used as a collective term to refer to people sharing cultural and linguistic ties to Latin America, regardless of race or nationality; sometimes used interchangeably with 'Hispanic', though not all Latinos are Hispanic and vice versa.",
      "explanation_cn": "作为集体术语，指具有拉丁美洲文化与语言联系的人群，不论种族或国籍；有时与 'Hispanic'（西班牙裔）互换使用，但并非所有拉丁裔都是西班牙裔，反之亦然。",
      "example_en": "Latino authors have made significant contributions to world literature, blending indigenous, European, and African influences.",
      "example_cn": "拉丁裔作家为世界文学作出了重要贡献，融合了土著、欧洲和非洲的文化影响。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "Hispanic",
      "analysis": "“Hispanic”（西班牙裔）特指来自西班牙语国家或有西班牙语背景的人，包括西班牙本土居民；而 “Latino” 指来自拉丁美洲（包括巴西）的人，不论是否说西班牙语（如巴西人说葡萄牙语）。因此，所有 Hispanic 人不一定是 Latino，所有 Latino 人也不一定是 Hispanic。"
    },
    {
      "word_to_compare": "Spanish",
      "analysis": "“Spanish” 指西班牙的国籍或语言，与 “Latino” 有本质区别。西班牙人是欧洲人，不属于拉丁美洲；而 Latino 指美洲的拉丁语系后裔。将两者混淆是常见误解。"
    },
    {
      "word_to_compare": "Latin American",
      "analysis": "“Latin American” 是地理和政治术语，指拉丁美洲地区（包括墨西哥、巴西、阿根廷等）的国家或其公民，强调地域归属；而 “Latino” 更常用于美国语境中，强调族群身份和文化认同，可涵盖移民及其后代，不限于当前居住地。"
    }
  ]
}