{
  "word": "lattice",
  "pronunciation": "lat·is",
  "concise_definition": "n. 格子, 网架, 晶格",
  "forms": {
    "plural": "lattices"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A structure made of strips of material (such as wood, metal, or plastic) crossed and fastened together with regular gaps between them, often used for decoration, support, or screening.",
      "explanation_cn": "由条状材料（如木材、金属或塑料）交叉固定而成的结构，其间有规则的空隙，常用于装饰、支撑或遮挡。",
      "example_en": "The garden was adorned with a wooden lattice trellis covered in climbing roses.",
      "example_cn": "花园里装饰着一个覆盖着攀援玫瑰的木制格架。"
    },
    {
      "pos": "noun",
      "explanation_en": "A regular, repeating arrangement of points or objects in space, especially in physics and crystallography, representing the structure of a crystal or a periodic system.",
      "explanation_cn": "在空间中点或物体规则、重复排列的结构，尤其在物理学和晶体学中，用于表示晶体或周期性系统的结构。",
      "example_en": "The atoms in a salt crystal form a three-dimensional lattice.",
      "example_cn": "食盐晶体中的原子排列成三维晶格。"
    },
    {
      "pos": "noun",
      "explanation_en": "A pattern or design resembling a network of intersecting lines, often used in art, architecture, or mathematics to represent interconnected systems.",
      "explanation_cn": "一种类似交叉线条网络的图案或设计，常用于艺术、建筑或数学中，表示相互关联的系统。",
      "example_en": "The stained-glass window featured a delicate lattice pattern of interwoven geometric shapes.",
      "example_cn": "彩绘玻璃窗上装饰着精致的交叉几何图形格子图案。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "grid",
      "analysis": "“Grid”（网格）通常指由水平和垂直线严格按矩形或方形排列形成的规则结构，强调精确的坐标系统，常用于地图、电子表格或城市规划。而 “lattice” 更强调交叉结构的装饰性或物理支撑性，其线条可以是任意角度，不一定限于直角，且常用于自然或有机形态中。"
    },
    {
      "word_to_compare": "mesh",
      "analysis": "“Mesh”（网状物）通常指由柔性材料（如金属丝、塑料）编织而成的疏松网状结构，强调孔洞的通透性和弹性，常用于过滤、防护或捕捞。而 “lattice” 更坚硬、结构更刚性，通常由刚性条材构成，孔洞更规则，多用于建筑或晶体结构。"
    },
    {
      "word_to_compare": "framework",
      "analysis": "“Framework”（框架）泛指支撑或组织某事物的基本结构，可以是抽象的（如法律框架）或具体的（如建筑骨架），不强调重复的几何图案。而 “lattice” 特指具有重复交叉线条的物理或数学结构，其形式是其定义的核心特征。"
    }
  ]
}