{
  "word": "lavish",
  "pronunciation": "lav·ish",
  "concise_definition": "adj. 奢华的, 奢侈的; v. 挥霍, 慷慨给予",
  "forms": {
    "comparative": "lavisher",
    "superlative": "lavishest",
    "third_person_singular": "lavishes",
    "past_tense": "lavished",
    "past_participle": "lavished",
    "present_participle": "lavishing"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Characterized by or involving great expense, luxury, or abundance; marked by generous or extravagant provision of resources, often to impress or indulge.",
      "explanation_cn": "以巨大的开销、奢华或丰盛为特征；指慷慨或挥霍地提供资源，常用于炫耀或满足享乐。",
      "example_en": "They threw a lavish wedding with champagne fountains and gold-plated tableware.",
      "example_cn": "他们举办了一场奢华的婚礼，有香槟喷泉和镀金餐具。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give or spend something in large amounts, especially money, attention, or praise, often to an excessive or extravagant degree.",
      "explanation_cn": "以大量方式给予或花费某物，尤其是金钱、注意力或赞美，常达到过度或挥霍的程度。",
      "example_en": "The director lavished praise on the lead actor for his groundbreaking performance.",
      "example_cn": "导演对主演的突破性表演给予了高度赞扬。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provide something abundantly or generously, often in a way that exceeds what is necessary or expected.",
      "explanation_cn": "慷慨或丰盛地提供某物，通常超出必要或预期的程度。",
      "example_en": "She lavished affection on her grandchildren, buying them toys and taking them on trips.",
      "example_cn": "她对孙子孙女宠爱有加，给他们买玩具，带他们旅行。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "extravagant",
      "analysis": "“Extravagant” (奢侈的) 强调超出合理或必要范围的花费或行为，常带有负面评价，暗示浪费或不理智。而 “lavish” 虽然也指过度，但更常用于描述令人愉悦的奢华，有时甚至带有褒义，如 ‘lavish hospitality’（盛情款待）。"
    },
    {
      "word_to_compare": "generous",
      "analysis": "“Generous” (慷慨的) 指在给予时大方、不吝啬，通常带有正面道德含义，强调善意和体贴。而 “lavish” 更侧重于数量或规模上的庞大，可能不涉及情感动机，甚至可能显得浮夸或铺张。"
    },
    {
      "word_to_compare": "opulent",
      "analysis": "“Opulent” (富丽堂皇的) 专指物质财富的富足与华丽，常用于描述建筑、装饰或服饰的奢华，强调视觉上的恢弘与精致。而 “lavish” 适用范围更广，可形容行为、言语、宴会等，不仅限于物质层面。"
    }
  ]
}