{
  "word": "leafy",
  "pronunciation": "leef·ee",
  "concise_definition": "adj. 多叶的, 绿叶茂盛的, 植物繁茂的",
  "forms": {
    "comparative": "leafier",
    "superlative": "leafiest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Covered with or characterized by an abundance of leaves, typically describing plants, trees, or areas with dense green foliage.",
      "explanation_cn": "指被大量叶子覆盖或以茂密绿叶为特征的，通常用于描述植物、树木或植被繁茂的区域。",
      "example_en": "The park was a leafy oasis in the middle of the busy city.",
      "example_cn": "这个公园是繁忙城市中一片绿意盎然的绿洲。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used informally to describe something that is lush, verdant, or associated with natural, rural, or tranquil environments, often implying aesthetic appeal or freshness.",
      "explanation_cn": "非正式用法，形容某物郁郁葱葱、青翠欲滴，或与自然、乡村或宁静环境相关，常暗示美感或清新感。",
      "example_en": "She lives in a leafy suburb where the streets are lined with tall oaks.",
      "example_cn": "她住在一片绿树成荫的郊区，街道两旁种满了高大的橡树。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing food, especially vegetables, that are primarily composed of edible leaves, such as lettuce, spinach, or kale.",
      "explanation_cn": "用于描述食物，尤其是主要由可食用叶子组成的蔬菜，如生菜、菠菜或羽衣甘蓝。",
      "example_en": "A healthy salad should include a variety of leafy greens.",
      "example_cn": "一份健康的沙拉应包含多种绿叶蔬菜。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "green",
      "analysis": "“Green” (绿色的) 是一个更广泛、更基础的形容词，泛指颜色或环保概念，不一定强调叶子的数量或茂密程度。而 “leafy” 特指由叶子构成或覆盖的状态，强调植物性、结构和密度。例如，一片草地可以是 green，但不一定是 leafy；一棵树可以是 leafy，因为它有大量叶子。"
    },
    {
      "word_to_compare": "lush",
      "analysis": "“Lush” (茂盛的) 强调植物生长旺盛、丰盈、富有生机，常带有视觉和感官上的奢华感，可用于描述草地、热带雨林或花园。它更侧重于整体的丰茂与繁盛，而 “leafy” 更具体地指向叶子的密集程度，范围更窄。一个地方可以是 lush 但不 leafy（如多花少叶的热带植物），但 leafy 通常也意味着 lush。"
    },
    {
      "word_to_compare": "foliage",
      "analysis": "“Foliage” (树叶， foliage) 是一个名词，指植物的叶子总称，不能直接作形容词使用。而 “leafy” 是形容词，由 “leaf” 派生而来，专门用于修饰名词，描述具有大量叶子的特征。例如，我们说 “leafy trees”，但不能说 “foliage trees”；可以说 “covered in foliage”，但不能说 “foliage-covered” 作为标准形容词形式。"
    }
  ]
}