{
  "word": "leagues",
  "pronunciation": "leegz",
  "concise_definition": "n. 联盟, 联赛, (距离单位) 英里",
  "forms": {
    "singular": "league"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An organized association of teams or groups that compete against each other in a particular sport or activity, often under a unified set of rules and governance.",
      "explanation_cn": "指在特定体育项目或活动中，由多个团队或组织组成的有组织的联盟，通常在统一的规则和管理下进行比赛。",
      "example_en": "The English Premier League is one of the most popular football leagues in the world.",
      "example_cn": "英格兰足球超级联赛是世界上最受欢迎的足球联赛之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of people or organizations united for a common purpose, often political, social, or economic, such as a labor union or an alliance of nations.",
      "explanation_cn": "指为实现共同目标（如政治、社会或经济目的）而联合起来的人群或组织，例如工会或国家联盟。",
      "example_en": "The League of Nations was established after World War I to promote international cooperation.",
      "example_cn": "国际联盟是在第一次世界大战后成立的，旨在促进国际合作。"
    },
    {
      "pos": "noun",
      "explanation_en": "A unit of length equal to approximately 3 miles (4.8 kilometers), traditionally used to measure long distances, especially in navigation or rural areas.",
      "explanation_cn": "一种长度单位，约等于3英里（4.8公里），传统上用于测量较长距离，尤其在航海或乡村地区。",
      "example_en": "The castle was several leagues away from the nearest town.",
      "example_cn": "这座城堡离最近的城镇有好几英里远。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "association",
      "analysis": "“Association” (协会) 是一个更广泛、更中性的术语，泛指任何为共同目标而联合的团体，不一定涉及竞争或规则体系。而 “league” 通常特指有组织竞赛或对抗的团体，尤其在体育语境中具有更强的制度性和竞技性。"
    },
    {
      "word_to_compare": "conference",
      "analysis": "“Conference” (会议/联盟) 常用于北美体育语境，指由多个球队组成的区域性组织，通常作为更大联盟（如NBA）的子单位。它更强调地理或行政划分，而 “league” 更强调整体竞赛体系和统一管理。"
    },
    {
      "word_to_compare": "mile",
      "analysis": "“Mile” (英里) 是现代通用的距离单位，精确等于1.609公里，广泛用于日常和科学测量。而 “league” 是一个较古老、非标准化的单位，其具体长度在不同国家和历史时期有所不同（通常为3英里），如今仅用于文学或历史语境中，带有诗意或夸张色彩。"
    }
  ]
}