{
  "word": "leaked",
  "pronunciation": "leekt",
  "concise_definition": "v. 泄露, 泄密, 渗漏 (leak 的过去式和过去分词)",
  "forms": {
    "base_form": "leak",
    "third_person_singular": "leaks",
    "present_participle": "leaking",
    "past_tense": "leaked",
    "past_participle": "leaked"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To allow information, especially confidential or secret information, to be disclosed unintentionally or illegally to the public or unauthorized parties.",
      "explanation_cn": "指无意中或非法地将机密或敏感信息透露给公众或未经授权的人员。",
      "example_en": "The classified documents were leaked to the press by an insider.",
      "example_cn": "这些机密文件被内部人士泄露给了媒体。"
    },
    {
      "pos": "verb",
      "explanation_en": "To allow a liquid, gas, or other substance to escape through a hole, crack, or imperfection in a container or system.",
      "explanation_cn": "指液体、气体或其他物质通过容器或系统的裂缝、孔洞或缺陷渗出或泄漏。",
      "example_en": "A pipe in the basement leaked water all night, flooding the floor.",
      "example_cn": "地下室的一根管道整晚都在漏水，导致地板被淹。"
    },
    {
      "pos": "verb",
      "explanation_en": "To become known publicly before the official announcement, especially regarding media content such as movies, music, or product designs.",
      "explanation_cn": "指在官方发布之前，媒体内容（如电影、音乐或产品设计）已提前被公众知晓。",
      "example_en": "The trailer for the new superhero movie leaked online a week before its official release.",
      "example_cn": "这部新超级英雄电影的预告片在官方发布前一周就已在网络上泄露。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "revealed",
      "analysis": "“Revealed” (揭示) 通常指有意识地、正式地或公开地披露信息，带有中性或积极的语义色彩，如官方发布或真相大白。而 “leaked” 强调信息是未经许可、非正式甚至非法地流出，常含负面或隐秘的意味。"
    },
    {
      "word_to_compare": "spilled",
      "analysis": "“Spilled” (洒出) 常用于描述液体或颗粒物意外洒落，多用于物理层面的泄漏，如咖啡洒了、沙子洒了。虽然有时可比喻为信息泄露（如 “spill the beans”），但其语义更口语化、更具体，不如 “leaked” 在信息或系统泄漏语境中正式和广泛。"
    },
    {
      "word_to_compare": "disclosed",
      "analysis": "“Disclosed” (披露) 是一个正式术语，常用于法律、商业或官方语境，指依法或按程序公开信息，通常不带负面含义。而 “leaked” 暗示披露行为违反了保密义务或规定，具有违规或背叛的色彩。"
    }
  ]
}