{
  "word": "lean",
  "pronunciation": "lehn",
  "concise_definition": "adj. 瘦的, 精简的; v. 倾斜, 依靠; n. 精益管理",
  "forms": {
    "third_person_singular": "leans",
    "past_tense": "leaned",
    "past_participle": "leaned",
    "present_participle": "leaning",
    "comparative": "leaner",
    "superlative": "leanest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having little fat or meat; thin in a healthy or desirable way, often used to describe body type or food.",
      "explanation_cn": "脂肪或肉很少的；形容身体或食物瘦削但健康、理想的状态。",
      "example_en": "She maintains a lean physique through regular exercise and a balanced diet.",
      "example_cn": "她通过规律锻炼和均衡饮食保持了匀称的身材。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Minimizing waste and maximizing efficiency, especially in business processes or organizational structure; characterized by streamlined operations.",
      "explanation_cn": "指在业务流程或组织结构中最大限度地减少浪费、提高效率；以精简的运营为特征。",
      "example_en": "The company adopted a lean manufacturing approach to reduce costs and improve quality.",
      "example_cn": "该公司采用了精益制造方法以降低成本并提高质量。"
    },
    {
      "pos": "verb",
      "explanation_en": "To incline or bend from a vertical position; to rest or support oneself against something.",
      "explanation_cn": "指从垂直位置倾斜或弯曲；或倚靠、支撑在某物上。",
      "example_en": "He leaned against the wall while waiting for the bus.",
      "example_cn": "他等公交车时靠在墙上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To have a preference or tendency toward a particular opinion, choice, or direction.",
      "explanation_cn": "指在观点、选择或方向上有所倾向或偏好。",
      "example_en": "The jury seems to lean toward acquitting the defendant.",
      "example_cn": "陪审团似乎倾向于判定被告无罪。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "thin",
      "analysis": "“Thin” (瘦的) 是一个更通用的词，仅描述物理上的纤细，不带有健康或效率的评价色彩。而 “lean” 常隐含积极含义，如健康、精干或高效，尤其在描述肌肉发达的身体或优化的流程时。"
    },
    {
      "word_to_compare": "slim",
      "analysis": "“Slim” (苗条的) 通常用于形容人的体型，带有审美上的褒义，但不用于描述系统或流程。而 “lean” 可用于人体、组织、生产系统等多种语境，强调功能性优化，适用范围更广。"
    },
    {
      "word_to_compare": "tilt",
      "analysis": "“Tilt” (倾斜) 强调突然或明显的角度变化，常用于物体或方向的物理偏转，如“tilt your head”。而 “lean” 更常用于持续性的、自然的倚靠或倾向，语气更温和，也常用于抽象意义（如倾向某观点）。"
    },
    {
      "word_to_compare": "efficient",
      "analysis": "“Efficient” (高效的) 是一个直接描述性能的形容词，强调资源利用的最优性。而 “lean” 是一个更综合的概念，不仅包含效率，还强调消除浪费、简化流程、持续改进，是精益管理方法论的核心术语，具有特定的管理内涵。"
    }
  ]
}