{
  "word": "leash",
  "pronunciation": "leesh",
  "concise_definition": "n. 皮带, 绳索; v. 用皮带拴住",
  "forms": {
    "plural": "leashes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A strap or cord, typically made of leather or fabric, used to control or guide an animal, especially a dog, by attaching it to a collar or harness.",
      "explanation_cn": "一条通常由皮革或织物制成的带子或绳索，用于通过连接到项圈或背带来控制或引导动物，尤其是狗。",
      "example_en": "She kept her dog on a short leash while walking through the crowded park.",
      "example_cn": "她在穿过拥挤的公园时，用一根短皮带牵着她的狗。"
    },
    {
      "pos": "noun",
      "explanation_en": "A means of control or restriction, often used metaphorically to describe limiting someone's freedom or autonomy.",
      "explanation_cn": "一种控制或限制的手段，常用于比喻意义上，指限制某人的自由或自主权。",
      "example_en": "The new regulations put a tight leash on corporate spending.",
      "example_cn": "新规定对企业的开支施加了严格限制。"
    },
    {
      "pos": "verb",
      "explanation_en": "To attach an animal to a leash in order to control its movement or prevent it from wandering.",
      "explanation_cn": "用皮带将动物拴住，以控制其行动或防止其乱跑。",
      "example_en": "The owner leashed the puppy before entering the restaurant.",
      "example_cn": "主人在进入餐厅前把小狗拴上了皮带。"
    },
    {
      "pos": "verb",
      "explanation_en": "To restrict or control someone or something tightly, often figuratively.",
      "explanation_cn": "（常用于比喻）严格限制或控制某人或某事。",
      "example_en": "The manager leashed the team’s budget to prevent overspending.",
      "example_cn": "经理严格控制了团队的预算，以防止超支。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "chain",
      "analysis": "“Chain”（链条）通常指由金属环连接而成的坚硬、沉重的束缚工具，多用于固定或禁锢，带有更强的强制性和物理限制感。而 “leash” 更轻便、灵活，常用于日常宠物管理，语义上更温和，也更常用于比喻性控制。"
    },
    {
      "word_to_compare": "tether",
      "analysis": "“Tether”（系绳）与 “leash” 非常相似，都指连接动物或物体以限制其活动范围的绳索。但 “tether” 更常用于描述固定在某一点上的长绳，如拴在木桩上的牲畜，强调空间限制；而 “leash” 更强调人手控制下的移动引导，常用于犬类管理。"
    },
    {
      "word_to_compare": "restraint",
      "analysis": "“Restraint”（约束）是一个更抽象、更广泛的术语，泛指任何形式的限制，包括法律、道德或心理层面的约束。而 “leash” 是具体的物理工具，其比喻用法虽可指控制，但根源仍来自实体的牵绳，语义更形象、具象。"
    }
  ]
}