{
  "word": "leaving",
  "pronunciation": "lee·ving",
  "concise_definition": "n. 离开, 离境; v. 离开 (leave 的现在分词/动名词形式)",
  "forms": {
    "base_form": "leave",
    "third_person_singular": "leaves",
    "past_tense": "left",
    "past_participle": "left",
    "present_participle": "leaving"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of departing from a place, person, or situation; often used to refer to the moment or process of departure, especially in emotional or significant contexts.",
      "explanation_cn": "指离开某个地方、人或情境的行为；常用于描述离开的时刻或过程，尤其在情感深厚或具有重要意义的情境中。",
      "example_en": "Her leaving the company after ten years was a sad moment for everyone.",
      "example_cn": "她离开公司时，对每个人来说都是一个令人难过的时刻。"
    },
    {
      "pos": "noun",
      "explanation_en": "A formal or official departure, especially in contexts such as military service, employment, or political office.",
      "explanation_cn": "指正式或官方的离开，尤其用于军事服役、工作或政治职务的辞任或退役。",
      "example_en": "The general's leaving was marked by a full honors ceremony.",
      "example_cn": "这位将军的退役举行了隆重的全礼仪式。"
    },
    {
      "pos": "verb",
      "explanation_en": "The present participle and gerund form of 'leave'; used to describe an ongoing or continuous action of departing, or as a noun-like verb form in phrases.",
      "explanation_cn": "动词 'leave' 的现在分词和动名词形式，用于描述正在发生的离开行为，或在短语中作为名词性动词使用。",
      "example_en": "Leaving the house without saying goodbye made her feel guilty.",
      "example_cn": "没说再见就离开家让她感到内疚。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "departure",
      "analysis": "“Departure” (出发/离别) 是一个更正式、更中性的名词，强调离开这一事件本身，常用于交通、航空或官方语境（如航班起飞）。而 “leaving” 更具情感色彩，常用于人际关系或个人经历中，带有主观感受。"
    },
    {
      "word_to_compare": "exit",
      "analysis": "“Exit” (出口/退出) 更侧重于物理空间的离开，如从房间、建筑或系统中退出，常用于建筑标识或技术语境（如程序退出）。而 “leaving” 更广泛，可指抽象的离开（如离开一段关系、一个国家），不局限于空间。"
    },
    {
      "word_to_compare": "withdrawal",
      "analysis": "“Withdrawal” (撤回/退出) 强调有意识地从参与、承诺或关系中抽身，常用于心理、政治或金融语境（如撤资、退出联盟）。它隐含主动性和策略性，而 “leaving” 更中性，可能是被动或情绪驱动的。"
    }
  ]
}