{
  "word": "leftist",
  "pronunciation": "left·ist",
  "concise_definition": "n. 左派人士, 激进分子; adj. 左派的, 激进的",
  "forms": {
    "plural": "leftists"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who supports or advocates for left-wing political ideologies, typically emphasizing social equality, economic redistribution, workers' rights, and government intervention in the economy.",
      "explanation_cn": "指支持或倡导左翼政治理念的人，通常强调社会平等、经济再分配、工人权利以及政府对经济的干预。",
      "example_en": "The activist was labeled a leftist by the media for demanding universal healthcare.",
      "example_cn": "这位活动家因要求全民医疗而被媒体称为左派人士。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person whose political views are considered radical or extreme within the left-wing spectrum, often associated with revolutionary socialism or communism.",
      "explanation_cn": "指在左翼光谱中持激进或极端政治观点的人，常与革命社会主义或共产主义相关联。",
      "example_en": "During the 1960s, many college students were accused of being leftist radicals.",
      "example_cn": "在20世纪60年代，许多大学生被指控为左翼激进分子。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or supporting left-wing political positions, especially those favoring progressive social change and economic equality.",
      "explanation_cn": "与左翼政治立场相关或支持左翼立场的，尤其指支持进步性社会变革和经济平等的。",
      "example_en": "The newspaper published a leftist critique of capitalist policies.",
      "example_cn": "这家报纸发表了一篇对资本主义政策的左派批评。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "liberal",
      "analysis": "“Liberal”（自由派）通常指支持个人自由、民主制度和社会改革的人，但一般不主张彻底推翻现有经济体系；而 “leftist” 更倾向于激进变革，常支持社会主义或共产主义，立场比 “liberal” 更左、更激进。"
    },
    {
      "word_to_compare": "progressive",
      "analysis": "“Progressive”（进步派）强调推动社会和经济改革以实现公平，常与左翼立场重叠，但语义更温和、更广泛，可用于非革命性改革语境；而 “leftist” 常带有意识形态的强烈色彩，可能指向更系统的制度批判。"
    },
    {
      "word_to_compare": "radical",
      "analysis": "“Radical”（激进派）泛指主张根本性变革的任何人，无论左右；而 “leftist” 特指政治立场在左翼谱系中的激进者。因此，所有 leftist 都可能是 radical，但并非所有 radical 都是 leftist（例如右翼激进分子）。"
    }
  ]
}