{
  "word": "legends",
  "pronunciation": "lej·uhndz",
  "concise_definition": "n. 传说, 神话, 传奇人物",
  "forms": {
    "singular": "legend"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A traditional story, often involving supernatural elements or heroic figures, that is passed down through generations and may be based on historical events but is not necessarily factual.",
      "explanation_cn": "指代代相传的古老故事，通常包含超自然元素或英雄人物，可能基于历史事件，但不一定具有事实依据。",
      "example_en": "The legend of King Arthur and the Knights of the Round Table has fascinated people for centuries.",
      "example_cn": "亚瑟王与圆桌骑士的传说几个世纪以来一直令人们着迷。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is celebrated for their extraordinary achievements or influence, often becoming a symbol of excellence or inspiration in a particular field.",
      "explanation_cn": "指因非凡成就或深远影响而被世人传颂的人物，常成为某一领域卓越与激励的象征。",
      "example_en": "Michael Jordan is considered a legend in the world of basketball.",
      "example_cn": "迈克尔·乔丹被认为是篮球界的一位传奇人物。"
    },
    {
      "pos": "noun",
      "explanation_en": "A written or spoken account that blends fact and fiction, often used to explain cultural beliefs, natural phenomena, or moral lessons.",
      "explanation_cn": "指融合事实与虚构的叙述，常用于解释文化信仰、自然现象或道德教训。",
      "example_en": "Native American legends explain the origins of mountains and rivers through the actions of spirits.",
      "example_cn": "美洲原住民的传说通过神灵的行为解释了山脉与河流的起源。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "myths",
      "analysis": "“Myths”（神话）通常与宗教信仰、宇宙起源或神祇行为紧密相关，具有仪式性和象征性，常用于解释世界的本质。而 “legends” 更侧重于人类英雄或历史人物的非凡事迹，虽可能包含超自然元素，但通常被设定在更接近现实的时间和地点。"
    },
    {
      "word_to_compare": "fables",
      "analysis": "“Fables”（寓言）是短小精悍的道德故事，主角常为动物或非人类角色，其核心目的是传达明确的道德教训。而 “legends” 不以说教为主要目的，更注重叙事的壮丽性与文化传承，人物通常是真实或半真实的历史人物。"
    },
    {
      "word_to_compare": "heroes",
      "analysis": "“Heroes”（英雄）指实际或虚构中具有勇气、美德或做出伟大贡献的个体，是一个具体角色；而 “legends” 可以指代这些英雄所承载的整个故事体系或文化形象。一个人可以是英雄，但只有当他的事迹被广泛传颂并带有传奇色彩时，他才成为 ‘legend’。"
    }
  ]
}