{
  "word": "legend",
  "pronunciation": "led·jend",
  "concise_definition": "n. 传说, 传奇人物, 图例",
  "forms": {
    "plural": "legends"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A traditional story, often involving supernatural elements or heroic deeds, that is passed down through generations and may be based on historical events but is not necessarily factual.",
      "explanation_cn": "指代代相传的古老故事，常包含超自然元素或英雄事迹，可能基于历史事件，但不一定具有事实依据。",
      "example_en": "The legend of King Arthur and the Knights of the Round Table has fascinated people for centuries.",
      "example_cn": "亚瑟王与圆桌骑士的传说几个世纪以来一直令人们着迷。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is celebrated for extraordinary achievements or qualities, often becoming a symbol of excellence or inspiration.",
      "explanation_cn": "指因非凡成就或品质而被广泛敬仰的人物，常成为卓越或激励的象征。",
      "example_en": "Michael Jordan is considered a legend in the world of basketball.",
      "example_cn": "迈克尔·乔丹被认为是篮球界的一位传奇人物。"
    },
    {
      "pos": "noun",
      "explanation_en": "A key or explanatory note on a map, chart, or diagram that identifies the meaning of symbols, colors, or lines used.",
      "explanation_cn": "指地图、图表或示意图中用于解释所用符号、颜色或线条含义的图例或说明键。",
      "example_en": "Check the legend to understand what the different shades of blue represent on this weather map.",
      "example_cn": "查看图例，了解这张天气图上不同深浅的蓝色代表什么。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "myth",
      "analysis": "“Myth”（神话）通常指古代文化中用于解释自然现象、宗教信仰或宇宙起源的叙事，具有强烈的仪式性和象征性，常与宗教体系紧密相连。而 “legend” 更侧重于与特定历史人物或地点相关的口头传统，虽可能掺杂虚构，但通常被认为有一定历史基础。"
    },
    {
      "word_to_compare": "fable",
      "analysis": "“Fable”（寓言）是一种简短的道德故事，通常以动物为主角，明确旨在传达一个教训或道德观念（如《伊索寓言》）。它本质上是虚构的，且目的明确；而 “legend” 不一定有道德意图，其核心在于传承文化记忆或英雄叙事。"
    },
    {
      "word_to_compare": "figure",
      "analysis": "“Figure”（人物）是一个更宽泛的词，泛指任何被提及或关注的人，可以是真实或虚构的。当用于 “legend” 的第二义项时，两者可互换，但 “legend” 强调的是该人物已被神化或赋予了近乎神话般的地位，而 “figure” 更中性，不必然带有崇拜色彩。"
    }
  ]
}