{
  "word": "legs",
  "pronunciation": "legz",
  "concise_definition": "n. 腿, 腿部, 支撑部分, 旅程的一段",
  "forms": {
    "singular": "leg"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "One of the paired limbs of a human or animal used for standing and walking, extending from the hip to the foot.",
      "explanation_cn": "人类或动物用于站立和行走的成对肢体，从臀部延伸至脚部。",
      "example_en": "She hurt her leg while playing soccer.",
      "example_cn": "她在踢足球时伤了腿。"
    },
    {
      "pos": "noun",
      "explanation_en": "A supporting part of a piece of furniture or structure, typically slender and vertical, that holds up the main body.",
      "explanation_cn": "家具或结构物中细长垂直的支撑部分，用于承托主体。",
      "example_en": "The table has four wooden legs.",
      "example_cn": "这张桌子有四条木腿。"
    },
    {
      "pos": "noun",
      "explanation_en": "A distinct segment or stage of a journey, trip, or process, especially one involving a change in direction or mode of transport.",
      "explanation_cn": "旅程、旅行或过程中的一个独立段落，通常涉及方向或交通方式的改变。",
      "example_en": "The flight had three legs: New York to London, London to Dubai, and Dubai to Sydney.",
      "example_cn": "这次航班有三个航段：纽约到伦敦，伦敦到迪拜，迪拜到悉尼。"
    },
    {
      "pos": "noun",
      "explanation_en": "In sports or competitions, a leg refers to one of two or more matches or contests between the same teams, often played at different venues.",
      "explanation_cn": "在体育或比赛中，指两支队伍之间进行的两场或多场比赛中的一场，通常在不同场地举行。",
      "example_en": "The teams will play the first leg at home and the second leg away.",
      "example_cn": "两队将先在主场进行首回合比赛，再在客场进行次回合比赛。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "limb",
      "analysis": "“Limb”（肢体）是更广泛的生物学术语，包括手臂和腿，而 “leg” 仅指下肢。在非正式语境中，人们通常用 “leg” 指代行走的器官，而 “limb” 更常用于医学或科学语境中，涵盖四肢。"
    },
    {
      "word_to_compare": "support",
      "analysis": "“Support”（支撑物）是泛指任何提供支撑的结构或物体，而 “leg” 特指垂直、细长、用于承重的支撑部分，如桌腿、椅腿。它更具体，常带有结构形态的联想。"
    },
    {
      "word_to_compare": "stage",
      "analysis": "“Stage”（阶段）用于描述过程、发展或事件中的一个时期，强调时间或逻辑顺序，如项目阶段、演出幕次。而 “leg” 在旅程或比赛中指物理或空间上的分段，强调路径或行程的划分，更具地理或运动特性。"
    }
  ]
}