{
  "word": "letters",
  "pronunciation": "let·uhrz",
  "concise_definition": "n. 信件, 字母, 文学, 学问",
  "forms": {
    "singular": "letter"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Written or printed messages sent from one person to another, typically through postal services or electronic means, expressing thoughts, feelings, or information.",
      "explanation_cn": "指由一人写给另一人的书面或印刷信息，通常通过邮政服务或电子方式传递，表达思想、情感或信息。",
      "example_en": "She kept all the love letters he wrote during their long-distance relationship.",
      "example_cn": "她保存了他们在异地恋期间他写的所有情书。"
    },
    {
      "pos": "noun",
      "explanation_en": "The basic symbols of an alphabet used to form words and represent spoken sounds in written language.",
      "explanation_cn": "指构成字母表的基本符号，用于组成单词并代表书面语言中的口语发音。",
      "example_en": "The English alphabet consists of 26 letters.",
      "example_cn": "英语字母表由26个字母组成。"
    },
    {
      "pos": "noun",
      "explanation_en": "Literature, especially written works such as novels, poems, and essays, considered as a field of humanistic study and cultural expression.",
      "explanation_cn": "指文学作品，尤其是小说、诗歌和散文等，作为人文学科研究和文化表达的领域。",
      "example_en": "She majored in letters at university, focusing on 19th-century British fiction.",
      "example_cn": "她在大学主修文学，专注于19世纪英国小说。"
    },
    {
      "pos": "noun",
      "explanation_en": "Knowledge or education, especially in the humanities; often used in the phrase 'the letters' to denote scholarly or cultivated learning.",
      "explanation_cn": "指知识或教育，尤指人文学科方面的学问；常用于短语 'the letters' 表示学术或有教养的学识。",
      "example_en": "In the 18th century, a gentleman was expected to be well-versed in the letters and the arts.",
      "example_cn": "在18世纪，绅士应通晓文学与艺术。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mail",
      "analysis": "“Mail”（邮件）是一个更宽泛的术语，泛指所有通过邮政系统传递的物品，包括信件、包裹、广告等。而 “letters” 专指书面通信内容，强调信息的传递性质，不包括非文字物品。"
    },
    {
      "word_to_compare": "alphabet",
      "analysis": "“Alphabet”（字母表）是所有字母的集合系统，是一个完整的符号体系，如英文字母表包含26个字母。而 “letters” 是构成字母表的单个单位，是字母表的组成部分，强调个体而非整体。"
    },
    {
      "word_to_compare": "literature",
      "analysis": "“Literature”（文学）是广义的书面作品总称，包括小说、诗歌、戏剧等，强调艺术性、思想性和文化价值。而 “letters” 在此语境下是其同义词之一，但更偏向于书面文本的集合或学术传统，尤其在短语 'the letters' 中带有古典教育的意味。"
    }
  ]
}