{
  "word": "lever",
  "pronunciation": "lee·vər",
  "concise_definition": "n. 杠杆, 杠杆作用; v. 利用, 借助",
  "forms": {
    "plural": "levers",
    "third_person_singular": "levers",
    "past_tense": "levered",
    "past_participle": "levered",
    "present_participle": "levering"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A rigid bar or beam that pivots on a fixed point (fulcrum) and is used to transmit and amplify force, enabling the lifting or moving of loads with less effort.",
      "explanation_cn": "一种刚性杆或梁，围绕一个固定支点（支点）转动，用于传递和放大作用力，从而以较小的力抬起或移动重物。",
      "example_en": "The mechanic used a long lever to pry open the stuck car door.",
      "example_cn": "修理工用一根长杠杆撬开了卡住的车门。"
    },
    {
      "pos": "noun",
      "explanation_en": "A means or instrument used to gain advantage or exert influence, especially in politics, economics, or social contexts.",
      "explanation_cn": "指用于获取优势或施加影响的手段或工具，尤其在政治、经济或社会语境中。",
      "example_en": "Education is a powerful lever for social mobility.",
      "example_cn": "教育是实现社会流动的强大工具。"
    },
    {
      "pos": "verb",
      "explanation_en": "To use a lever or leverage to move, lift, or manipulate something, often with mechanical force.",
      "explanation_cn": "使用杠杆或借助杠杆作用来移动、抬起或操纵某物，通常借助机械力。",
      "example_en": "They levered the heavy crate onto the truck using a steel bar.",
      "example_cn": "他们用一根钢条将沉重的木箱撬上了卡车。"
    },
    {
      "pos": "verb",
      "explanation_en": "To use one's position, resources, or influence to achieve a desired outcome, often in a strategic or indirect way.",
      "explanation_cn": "利用自己的地位、资源或影响力以达成预期结果，通常以策略性或间接的方式进行。",
      "example_en": "The CEO leveraged her connections to secure the funding.",
      "example_cn": "这位首席执行官利用自己的人脉获得了资金支持。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "wedge",
      "analysis": "“Wedge” (楔子) 是一种用于劈开、固定或塞入缝隙的工具，主要依靠尖端的斜面产生分离力，常用于物理分离物体。而 “lever” 通过支点和力臂的力学原理放大作用力，更强调力的传递与省力效果，而非单纯的分离。"
    },
    {
      "word_to_compare": "tool",
      "analysis": "“Tool” (工具) 是一个泛称，泛指任何用于完成特定任务的器具，而 “lever” 是一种具有特定物理结构（支点、力臂）的机械工具。所有杠杆都是工具，但并非所有工具都是杠杆。"
    },
    {
      "word_to_compare": "leverage",
      "analysis": "“Leverage” 是 “lever” 的名词和动词形式的延伸，常用于抽象语境，指利用资源或影响力获得优势。而 “lever” 作为名词时更侧重于物理实体，作为动词时虽可与 “leverage” 互换，但后者在现代英语中更常用于比喻义，前者则保留更多物理动作的含义。"
    }
  ]
}