{
  "word": "leveling",
  "pronunciation": "lev·uh·ling",
  "concise_definition": "n. 找平, 水准测量, 平等化",
  "forms": {
    "base_form": "level",
    "present_participle": "leveling",
    "past_tense": "leveled",
    "past_participle": "leveled"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of making a surface flat or horizontal, especially in construction, landscaping, or surveying, using tools such as a spirit level or laser level.",
      "explanation_cn": "指在建筑、景观设计或测量中，使用水准仪或激光水平仪等工具使表面变得平整或水平的过程。",
      "example_en": "The leveling of the ground took three days before the foundation could be poured.",
      "example_cn": "在浇筑地基之前，平整地面花了三天时间。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or process of reducing disparities in wealth, power, or status among individuals or groups, often in a social or political context.",
      "explanation_cn": "指在社会或政治语境中，减少个人或群体之间在财富、权力或地位上的差异的行为或过程。",
      "example_en": "The policy aimed at leveling the playing field for small businesses competing with large corporations.",
      "example_cn": "这项政策旨在为小企业与大公司竞争创造公平的环境。"
    },
    {
      "pos": "noun",
      "explanation_en": "The measurement of elevation differences between points on the earth’s surface, typically performed by surveyors to establish precise heights for engineering projects.",
      "explanation_cn": "指测量地球表面各点之间的高程差异，通常由测量员执行，以确定工程项目的精确高度。",
      "example_en": "The survey team completed the leveling of the site to ensure accurate construction benchmarks.",
      "example_cn": "测量团队完成了该场地的水准测量，以确保施工基准的准确性。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "flattening",
      "analysis": "“Flattening”（变平）强调将某物从有起伏的状态变为完全平坦，通常用于物理形态的改变，如压平纸张或地形。而 “leveling” 更强调达到水平状态，可能涉及高程调整，不一定要求完全无起伏，而是使表面符合水平基准。"
    },
    {
      "word_to_compare": "equalizing",
      "analysis": "“Equalizing”（使相等）侧重于使两个或多个事物在数量、价值或机会上达到完全相等，常用于经济或社会公平语境。而 “leveling” 在此语境中更强调消除不平等的结构或障碍，是一个过程性、渐进性的调整，不一定要求结果完全相等。"
    },
    {
      "word_to_compare": "surveying",
      "analysis": "“Surveying”（测量）是一个更广泛的术语，包括地形、边界、角度和高程的测量。而 “leveling” 是测量学中的一个子集，特指高程测量。因此，所有 leveling 都属于 surveying，但并非所有 surveying 都是 leveling。"
    }
  ]
}