{
  "word": "leverage",
  "pronunciation": "lev·er·ij",
  "concise_definition": "n. 杠杆作用, 影响力; v. 利用, 借助",
  "forms": {
    "third_person_singular": "leverages",
    "past_tense": "leveraged",
    "past_participle": "leveraged",
    "present_participle": "leveraging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The power or ability to influence or control a situation, often by using available resources, relationships, or advantages to achieve a desired outcome.",
      "explanation_cn": "指通过利用现有资源、关系或优势来影响或控制局势的能力，以实现预期目标。",
      "example_en": "She used her connections in government as leverage to secure the contract.",
      "example_cn": "她利用自己在政府的人脉作为筹码，成功获得了这份合同。"
    },
    {
      "pos": "noun",
      "explanation_en": "In finance, the use of borrowed capital to increase the potential return on an investment, often involving risk due to increased debt.",
      "explanation_cn": "在金融领域，指通过借入资本来放大投资的潜在回报，通常伴随着因债务增加而带来的风险。",
      "example_en": "The company increased its leverage by taking on a $50 million loan to buy new equipment.",
      "example_cn": "该公司通过举借5000万美元贷款购买新设备，提高了财务杠杆。"
    },
    {
      "pos": "verb",
      "explanation_en": "To use something (such as a resource, position, or tool) to maximum advantage in order to achieve a goal or gain an edge.",
      "explanation_cn": "指充分利用某种资源、地位或工具，以实现目标或获得优势。",
      "example_en": "The startup leveraged social media to reach millions of customers without a large advertising budget.",
      "example_cn": "这家初创公司利用社交媒体，在没有巨额广告预算的情况下触达了数百万客户。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "influence",
      "analysis": "“Influence” (影响) 指通过说服、示范或权威使他人改变态度或行为，强调的是心理或行为层面的间接作用。而 “leverage” 更强调主动、策略性地使用某种资源或优势作为工具来达成目的，更具操作性和功利性。"
    },
    {
      "word_to_compare": "utilize",
      "analysis": "“Utilize” (利用) 是一个中性词，泛指使用某物以发挥其功能，不隐含权力或优势的意味。而 “leverage” 不仅指使用，还强调以最小投入换取最大回报，常带有战略性和乘数效应的含义，尤其在商业和金融语境中。"
    },
    {
      "word_to_compare": "capitalize",
      "analysis": "“Capitalize” (利用/变现) 常用于将机会或资源转化为经济利益，侧重于“变现”或“获利”。而 “leverage” 更广泛，可涵盖非经济领域的影响力运用，如政治、社交或技术资源，其核心是“借力”而非“变现”。"
    }
  ]
}