{
  "word": "leveraged",
  "pronunciation": "lev·ruh·jed",
  "concise_definition": "v. 利用, 借助, 杠杆化",
  "forms": {
    "base_form": "leverage",
    "third_person_singular": "leverages",
    "past_tense": "leveraged",
    "past_participle": "leveraged",
    "present_participle": "leveraging"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To use a resource, tool, or asset strategically to gain a greater advantage or output than would be possible otherwise, often by multiplying effect through minimal input.",
      "explanation_cn": "指战略性地利用某种资源、工具或资产，以获得远超其本身投入所能产生的更大优势或产出，通常通过最小投入实现最大效果。",
      "example_en": "The startup leveraged social media to reach millions of customers without a large advertising budget.",
      "example_cn": "这家初创公司利用社交媒体，在没有巨额广告预算的情况下触达了数百万客户。"
    },
    {
      "pos": "verb",
      "explanation_en": "To use borrowed capital or debt to increase the potential return on an investment, often in finance or business contexts.",
      "explanation_cn": "指在金融或商业语境中，通过借入资本或债务来放大投资的潜在回报，即‘杠杆化’。",
      "example_en": "The company leveraged its assets to secure a loan and expand operations overseas.",
      "example_cn": "该公司通过抵押资产获得贷款，以拓展海外业务。"
    },
    {
      "pos": "verb",
      "explanation_en": "To use one’s influence, connections, or position to achieve a desired outcome, often in political or organizational settings.",
      "explanation_cn": "指在政治或组织环境中，利用自己的影响力、人脉或地位来达成特定目标。",
      "example_en": "She leveraged her connections in government to fast-track the approval process.",
      "example_cn": "她利用自己在政府的人脉，加速了审批流程。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "utilized",
      "analysis": "“Utilized” (使用) 是一个中性词，泛指任何方式的使用，不强调效率或放大效应。而 “leveraged” 隐含了策略性、乘数效应和资源的最优配置，常用于强调以小博大或高效转化。"
    },
    {
      "word_to_compare": "exploited",
      "analysis": "“Exploited” (利用/剥削) 常带有负面含义，暗示不公平、过度或不道德地使用资源。而 “leveraged” 是中性或正面的，强调智慧和战略性地使用资源以达成共赢。"
    },
    {
      "word_to_compare": "harnessed",
      "analysis": "“Harnessed” ( Harnessing, 利用/驾驭) 常用于自然力量或能量（如风能、太阳能），强调控制和引导某种原始力量。而 “leveraged” 更广泛用于抽象资源（如人脉、数据、债务），强调通过结构化手段放大效果。"
    }
  ]
}