{
  "word": "level",
  "pronunciation": "lev·uhl",
  "concise_definition": "n. 水平, 等级, 层面; adj. 平的, 水平的; v. 使平, 水平化",
  "forms": {
    "plural": "levels",
    "third_person_singular": "levels",
    "past_tense": "leveled",
    "past_participle": "leveled",
    "present_participle": "leveling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A horizontal plane or surface, especially one that is flat and even, often used as a reference point for measuring height or position.",
      "explanation_cn": "指一个水平的平面或表面，尤其指平坦且均匀的表面，常作为测量高度或位置的基准。",
      "example_en": "The water in the pipe reached the same level on both ends.",
      "example_cn": "管道中的水在两端达到了相同的水平。"
    },
    {
      "pos": "noun",
      "explanation_en": "A degree or standard of quality, ability, or achievement, often used to classify or compare people, things, or situations.",
      "explanation_cn": "指质量、能力或成就的程度或标准，常用于对人、事物或情境进行分类或比较。",
      "example_en": "Her English proficiency is at an advanced level.",
      "example_cn": "她的英语水平达到了高级水平。"
    },
    {
      "pos": "noun",
      "explanation_en": "A distinct layer or tier within a system, structure, or hierarchy, such as in an organization or a building.",
      "explanation_cn": "指系统、结构或等级制度中的一个独立层次或层级，如组织或建筑物中的不同层级。",
      "example_en": "Employees at the managerial level have more decision-making authority.",
      "example_cn": "管理层的员工拥有更多的决策权。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Having a flat or even surface; not sloping or inclined.",
      "explanation_cn": "具有平坦或均匀表面的；不倾斜或不倾斜的。",
      "example_en": "The carpenter made sure the shelf was perfectly level.",
      "example_cn": "木匠确保架子完全水平。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make something flat or even, especially by adjusting its height or position.",
      "explanation_cn": "通过调整高度或位置使某物变得平坦或均匀。",
      "example_en": "They leveled the ground before building the house.",
      "example_cn": "他们在建房前将地面整平了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reduce something to the same level as something else, often implying a decrease in status, power, or value.",
      "explanation_cn": "将某物降低到与另一物相同的水平，常暗示地位、权力或价值的下降。",
      "example_en": "The new policy aims to level the playing field for all competitors.",
      "example_cn": "这项新政策旨在为所有竞争者创造公平的竞争环境。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "degree",
      "analysis": "“Degree” (程度) 强调的是某种特质或状态的量度，常用于抽象概念如温度、情绪或教育水平，侧重于连续谱上的位置。而 “level” 更常用于可测量、分层的系统，如组织层级或物理高度，具有更强的结构性和分层感。"
    },
    {
      "word_to_compare": "standard",
      "analysis": "“Standard” (标准) 指的是被广泛接受的规范或基准，用于评判优劣或一致性，具有规范性和权威性。而 “level” 更侧重于描述当前所处的位置或状态，不必然隐含规范性，仅表示一个客观的层次。"
    },
    {
      "word_to_compare": "plane",
      "analysis": "“Plane” (平面) 是一个几何学术语，指无限延伸的二维表面，强调数学或空间上的抽象概念。而 “level” 在日常语境中更常指具体的、可测量的水平面，如地面或桌面，具有实际应用性。"
    },
    {
      "word_to_compare": "tier",
      "analysis": "“Tier” (层、级) 与 “level” 在表示层级时非常接近，但 “tier” 更常用于描述金字塔式或分层结构中的物理或组织分层，如体育赛事的分级或座位分区，带有更强的视觉分层意象。而 “level” 更通用，可用于抽象或物理语境。"
    }
  ]
}