{
  "word": "liberated",
  "pronunciation": "lib·uh·rey·tidd",
  "concise_definition": "adj. 获得自由的, 解放的",
  "forms": {
    "base_form": "liberate",
    "present_participle": "liberating",
    "past_tense": "liberated",
    "past_participle": "liberated"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Free from imprisonment, oppression, or control; having been released from physical, political, or psychological constraints.",
      "explanation_cn": "指从监禁、压迫或控制中获得自由；摆脱了身体、政治或心理上的束缚。",
      "example_en": "The country was liberated from colonial rule after decades of struggle.",
      "example_cn": "经过数十年的斗争，这个国家从殖民统治中获得了解放。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Free from traditional social norms, especially regarding gender roles, sexuality, or personal expression; characterized by openness and autonomy.",
      "explanation_cn": "指摆脱了传统社会规范（尤其是关于性别角色、性取向或个人表达的规范）的束缚；表现出开放性和自主性。",
      "example_en": "She felt liberated after quitting her toxic job and embracing a more authentic lifestyle.",
      "example_cn": "她在辞去那份有毒的工作并拥抱更真实的生活方式后，感到前所未有的自由。"
    },
    {
      "pos": "adjective",
      "explanation_en": "In computing or digital contexts, referring to software or content that is no longer restricted by proprietary licenses and is freely usable, modifiable, and distributable.",
      "explanation_cn": "在计算或数字语境中，指不再受专有许可证限制、可自由使用、修改和分发的软件或内容。",
      "example_en": "Many developers prefer using liberated (open-source) software to avoid vendor lock-in.",
      "example_cn": "许多开发者更倾向于使用开源（自由）软件，以避免被供应商锁定。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "freed",
      "analysis": "“Freed” 是 “free” 的过去分词，语义上与 “liberated” 非常接近，但更口语化、更直接，常用于物理或法律层面的释放，如 “freed from chains”。而 “liberated” 更具政治、社会或哲学色彩，常用于描述系统性压迫的解除，语气更正式、更富有象征意义。"
    },
    {
      "word_to_compare": "released",
      "analysis": "“Released” (释放) 强调从束缚、限制或保管中被放出来，常用于具体情境，如释放囚犯、释放压力、发布产品。它不必然包含“获得自主权”或“打破制度性压迫”的深层含义，而 “liberated” 则隐含了从压迫结构中获得根本性自由的含义。"
    },
    {
      "word_to_compare": "emancipated",
      "analysis": "“Emancipated” 与 “liberated” 在政治或社会解放语境中高度重合，尤其用于奴隶制或儿童监护权的解除（如 emancipated minors）。但 “emancipated” 更具法律术语色彩，常用于正式文件或历史语境；而 “liberated” 更广泛用于现代语境，包括心理、文化、性别等领域，语义范围更广。"
    }
  ]
}