{
  "word": "liberty",
  "pronunciation": "luhb·er·tee",
  "concise_definition": "n. 自由, 自主权, 放任",
  "forms": {
    "plural": "liberties"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The state of being free from oppressive restrictions imposed by authority on one's way of life, behavior, or political views; the right to act, speak, or think as one wants without hindrance or restraint.",
      "explanation_cn": "指个人不受权威强加的压迫性限制，能够自由地生活、行为或表达政治观点的状态；享有无阻碍或约束地行动、言论或思考的权利。",
      "example_en": "The constitution guarantees the liberty of speech and religion.",
      "example_cn": "宪法保障了言论和宗教信仰自由。"
    },
    {
      "pos": "noun",
      "explanation_en": "A privilege or freedom granted within a particular context, often implying a degree of discretion or license beyond strict rules.",
      "explanation_cn": "指在特定情境下被授予的某种特权或自由，常暗示在严格规则之外享有一定的裁量权或放任空间。",
      "example_en": "The teacher gave the students some liberty in choosing their project topics.",
      "example_cn": "老师允许学生在选择项目主题时有一定的自由度。"
    },
    {
      "pos": "noun",
      "explanation_en": "A departure from normal or accepted standards, especially in behavior or expression; often used in the phrase 'take liberties' to mean acting in an overly familiar or disrespectful way.",
      "explanation_cn": "指偏离正常或公认标准的行为或表达方式，尤其用于短语 'take liberties'，意为行为过于随意或不敬。",
      "example_en": "He took too many liberties with the original text, changing its meaning entirely.",
      "example_cn": "他对原文改动过多，完全改变了其原意。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "freedom",
      "analysis": "“Freedom” (自由) 是一个更广泛、更基础的词，泛指不受控制或压迫的状态，适用于个人、社会、国家等各个层面。而 “liberty” 更常用于法律、政治语境中，强调公民权利和制度保障下的自由，语气更正式、更具规范性。"
    },
    {
      "word_to_compare": "independence",
      "analysis": "“Independence” (独立) 强调自主性、不依赖他人或外部力量，常用于国家主权或个人精神上的自立。而 “liberty” 更侧重于行动和表达的不受限制，即使在依附关系中（如公民对国家）仍可享有 liberty。"
    },
    {
      "word_to_compare": "license",
      "analysis": "“License” (许可/放纵) 指被正式允许的行为，或有时带有贬义的过度放任。它强调的是授权或逾矩，而 “liberty” 可以是天然权利，不一定需要授权；当用于贬义时（如 take liberties），它与 license 有重叠，但更强调行为的越界而非制度性许可。"
    }
  ]
}