{
  "word": "liberal",
  "pronunciation": "lib·er·uhl",
  "concise_definition": "adj. 开明的, 自由的, 宽宏的; n. 自由主义者",
  "forms": {
    "comparative": "more liberal",
    "superlative": "most liberal",
    "noun_plural": "liberals"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Open to new behavior or ideas; not strict or traditional in attitudes, especially regarding social or political matters.",
      "explanation_cn": "对新行为或思想持开放态度；在社会或政治问题上不拘泥于传统或严格规范。",
      "example_en": "She has a liberal attitude toward education and encourages students to think independently.",
      "example_cn": "她对教育持开明态度，鼓励学生独立思考。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Generous in giving or spending; not stingy or restrictive.",
      "explanation_cn": "在给予或花费上慷慨大方；不吝啬或拘谨。",
      "example_en": "The charity received a liberal donation from the philanthropist.",
      "example_cn": "这家慈善机构收到了这位慈善家慷慨的捐赠。"
    },
    {
      "pos": "adjective",
      "explanation_en": "In politics, supporting individual freedoms, social progress, and government intervention to promote equality and justice.",
      "explanation_cn": "在政治上支持个人自由、社会进步，并主张政府干预以促进平等与正义。",
      "example_en": "The liberal party advocates for universal healthcare and environmental protection.",
      "example_cn": "自由派政党主张全民医疗和环境保护。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who holds liberal political views, typically supporting civil liberties, social reform, and progressive policies.",
      "explanation_cn": "指持有自由主义政治观点的人，通常支持公民自由、社会改革和进步政策。",
      "example_en": "As a liberal, he voted for policies that expanded access to education and healthcare.",
      "example_cn": "作为一名自由主义者，他投票支持扩大教育和医疗获取机会的政策。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "progressive",
      "analysis": "“Progressive”（进步的）与 “liberal” 在政治语境中常互换，但 “progressive” 更强调推动社会变革、挑战现有体制的激进性，常用于描述更左翼的立场；而 “liberal” 范围更广，可包含温和改革者，有时甚至指中左翼立场。"
    },
    {
      "word_to_compare": "tolerant",
      "analysis": "“Tolerant”（宽容的）侧重于对不同观点、信仰或行为的忍耐与接受，是一种态度上的包容；而 “liberal” 不仅包含宽容，还积极支持变革、自由和权利扩展，具有更强的意识形态内涵。"
    },
    {
      "word_to_compare": "generous",
      "analysis": "“Generous”（慷慨的）仅指在物质或情感上乐于给予，是 “liberal” 在‘慷慨’义项下的近义词，但不涉及政治或思想层面的开放性。例如，一个人可以很慷慨却思想保守，但不能称其为 ‘liberal’ 在政治意义上。"
    }
  ]
}