{
  "word": "licensing",
  "pronunciation": "lahy·suhns-ing",
  "concise_definition": "n. 许可, 授权, 发放许可证",
  "forms": {
    "base_form": "license",
    "verb_third_person_singular": "licenses",
    "verb_past_tense": "licensed",
    "verb_past_participle": "licensed",
    "verb_present_participle": "licensing",
    "noun_plural": "licenses"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The official authorization granted by an authority to an individual or organization to perform a specific activity, often regulated by law or policy, such as operating a business, using intellectual property, or driving a vehicle.",
      "explanation_cn": "指由权威机构授予个人或组织的正式授权，允许其从事某项受法律或政策监管的活动，例如经营业务、使用知识产权或驾驶车辆。",
      "example_en": "The company obtained a licensing agreement to use the patented technology.",
      "example_cn": "该公司获得了使用该专利技术的许可协议。"
    },
    {
      "pos": "noun",
      "explanation_en": "The system, process, or industry involved in granting, managing, and regulating official permissions, especially in contexts like media, software, or professional services.",
      "explanation_cn": "指授予、管理和监管官方许可的体系、流程或行业，尤其在媒体、软件或专业服务等领域。",
      "example_en": "The licensing of streaming services has become a major concern for content creators.",
      "example_cn": "流媒体服务的许可问题已成为内容创作者关注的主要议题。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of granting a license, especially in the context of intellectual property, where rights to use, reproduce, or distribute a product or brand are transferred under specific terms.",
      "explanation_cn": "指授予许可的行为，尤其在知识产权领域，指在特定条款下转让使用、复制或分发某产品或品牌权利的行为。",
      "example_en": "Licensing of the cartoon character led to a surge in merchandise sales.",
      "example_cn": "该卡通角色的授权导致周边商品销量激增。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "permit",
      "analysis": "“Permit”（许可证）通常指针对具体、短期或局部活动的官方批准，如建筑许可或活动许可，语义范围较窄，常为一次性或临时性授权。而 “licensing” 更强调系统性、长期性或商业化的授权机制，常涉及持续性的权利转让和监管。"
    },
    {
      "word_to_compare": "authorization",
      "analysis": "“Authorization”（授权）是一个更广泛的术语，泛指任何形式的批准或同意，可以是口头、书面或制度性的，不一定需要正式文件。而 “licensing” 特指通过正式法律或行政程序颁发的书面许可，具有更强的法律约束力和规范性。"
    },
    {
      "word_to_compare": "franchising",
      "analysis": "“Franchising”（特许经营）是一种特殊的商业许可形式，不仅授予使用品牌或模式的权利，还包含运营支持、培训和统一标准等系统性安排。而 “licensing” 通常仅限于权利的授予，不涉及运营体系的全面移交，范围更窄、更灵活。"
    }
  ]
}