{
  "word": "licks",
  "pronunciation": "likts",
  "concise_definition": "n. 舔，轻拍，少量；v. 舔，轻拍",
  "forms": {
    "singular": "lick",
    "third_person_singular": "licks",
    "past_tense": "licked",
    "past_participle": "licked",
    "present_participle": "licking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A single act of touching or moving the tongue over a surface, typically to taste or clean something.",
      "explanation_cn": "指用舌头一次性接触或拂过某表面，通常是为了品尝或清洁。",
      "example_en": "The cat gave the milk a few quick licks before walking away.",
      "example_cn": "猫在走开之前，快速舔了几口牛奶。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small amount or portion of something, often used informally to describe a brief experience or taste.",
      "explanation_cn": "指某物的一小部分，常用于非正式语境中表示短暂的体验或品尝。",
      "example_en": "He got a lick of ice cream before his mom caught him.",
      "example_cn": "他妈妈抓到他之前，他偷吃了一点冰淇淋。"
    },
    {
      "pos": "noun",
      "explanation_en": "A light blow or strike, often with a flat object or the hand; sometimes used metaphorically to mean a minor punishment or defeat.",
      "explanation_cn": "指用扁平物体或手掌轻拍一下；有时隐喻为轻微的惩罚或失败。",
      "example_en": "The team took a few licks in the first half but came back strong in the second.",
      "example_cn": "球队上半场挨了几下重击，但下半场强势反弹。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pass the tongue over a surface, especially to taste, clean, or show affection.",
      "explanation_cn": "用舌头拂过某表面，尤指为了品尝、清洁或表达亲昵。",
      "example_en": "The dog licked its paws after eating.",
      "example_cn": "狗吃完后舔了舔爪子。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strike or hit lightly, often repeatedly, as if with the tongue or a flat object.",
      "explanation_cn": "轻拍或轻击，常为重复性动作，如同用舌头或扁平物体拍打。",
      "example_en": "The waves licked the shore gently as the sun set.",
      "example_cn": "夕阳西下时，海浪轻轻拍打着海岸。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "taste",
      "analysis": "“Taste” (品尝) 强调通过味觉感知食物或液体的味道，是一个更抽象、更注重感官体验的词。而 “lick” 是具体的动作，强调舌头的物理接触，不一定以品尝为目的，也可能用于清洁或表达情感。"
    },
    {
      "word_to_compare": "sweep",
      "analysis": "“Sweep” (扫过) 指快速、大面积地移动，常用于描述扫帚、风或视线的移动，强调范围和速度。而 “lick” 是小范围、轻柔、短暂的接触，常用于液体、表面或轻微打击的语境，动作更细腻、更局部。"
    },
    {
      "word_to_compare": "nibble",
      "analysis": "“Nibble” (轻咬) 指用牙齿轻轻咬下小部分食物，强调牙齿的参与和食物的消耗。而 “lick” 不涉及牙齿，仅靠舌头接触，通常不消耗物质，更多用于试探、清洁或表达亲昵。"
    }
  ]
}