{
  "word": "lid",
  "pronunciation": "lid",
  "concise_definition": "n. 盖子, 罩子; v. 用盖子盖住",
  "forms": {
    "plural": "lids",
    "third_person_singular": "lids",
    "past_tense": "lidded",
    "past_participle": "lidded",
    "present_participle": "lidding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A removable or hinged cover for a container, used to seal or protect its contents from contamination, spillage, or evaporation.",
      "explanation_cn": "用于容器上的可拆卸或铰链式盖子，用于密封或保护内容物免受污染、溢出或蒸发。",
      "example_en": "She tightened the lid on the jar to keep the jam fresh.",
      "example_cn": "她拧紧了罐子的盖子，以保持果酱新鲜。"
    },
    {
      "pos": "noun",
      "explanation_en": "The upper eyelid, the fold of skin that covers and protects the eye when closed.",
      "explanation_cn": "上眼睑，闭眼时覆盖并保护眼睛的皮肤褶皱。",
      "example_en": "He blinked slowly, his eyelids fluttering like butterfly wings.",
      "example_cn": "他缓慢地眨了眨眼，眼睑如蝴蝶翅膀般颤动。"
    },
    {
      "pos": "noun",
      "explanation_en": "A metaphorical or figurative cover that conceals something, often used in expressions like 'keep a lid on' to mean suppressing or controlling.",
      "explanation_cn": "比喻性或象征性的覆盖物，常用于短语如 'keep a lid on'，意为压制或控制某事。",
      "example_en": "The government tried to keep a lid on the protests to avoid public panic.",
      "example_cn": "政府试图压制抗议活动，以避免公众恐慌。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover or close something with a lid, especially to seal or contain it.",
      "explanation_cn": "用盖子覆盖或关闭某物，尤指将其密封或封闭。",
      "example_en": "He lidded the pot before turning down the heat.",
      "example_cn": "他在调低火候前盖上了锅盖。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cover",
      "analysis": "“Cover”（覆盖）是一个更广泛、更通用的词，指任何遮盖物或遮盖动作，可以是布、纸、手等，不一定是刚性或可拆卸的。而 “lid” 特指刚性、通常可开合的容器盖子，具有明确的物理结构和密封功能。"
    },
    {
      "word_to_compare": "cap",
      "analysis": "“Cap”（帽、塞）通常指较小、更紧密贴合的盖子，如瓶塞、帽子或笔帽，常用于圆柱形容器顶部。而 “lid” 更常用于方形或宽口容器（如锅、罐子），且通常更大、更厚重。两者虽可互换，但语境和形状偏好不同。"
    },
    {
      "word_to_compare": "top",
      "analysis": "“Top”（顶部）是方位词，泛指物体的最上部，不一定是可移动的盖子。例如，桌子的顶部。而 “lid” 是一个具体的、可操作的部件，专用于封闭容器。因此，“top” 更抽象，而 “lid” 更具体且具有功能性。"
    }
  ]
}