{
  "word": "life",
  "pronunciation": "lahyf",
  "concise_definition": "n. 生命, 生活, 生涯, 生物",
  "forms": {
    "plural": "lives"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The condition that distinguishes animals and plants from inorganic matter, including the capacity for metabolism, growth, reproduction, and response to stimuli.",
      "explanation_cn": "指区别于无机物的生物所具有的状态，包括新陈代谢、生长、繁殖和对外界刺激作出反应的能力。",
      "example_en": "All living organisms share the basic characteristics of life.",
      "example_cn": "所有生物都具备生命的基本特征。"
    },
    {
      "pos": "noun",
      "explanation_en": "The period between birth and death; the duration of an individual's existence.",
      "explanation_cn": "指从出生到死亡的整个时间段；个体存在的全过程。",
      "example_en": "She devoted her life to helping the poor.",
      "example_cn": "她将一生奉献给了帮助穷人。"
    },
    {
      "pos": "noun",
      "explanation_en": "The way in which a person or group lives, including their activities, experiences, and social conditions.",
      "explanation_cn": "指一个人或群体的生活方式，包括其活动、经历和社会状况。",
      "example_en": "City life can be fast-paced and stressful.",
      "example_cn": "城市生活节奏快、压力大。"
    },
    {
      "pos": "noun",
      "explanation_en": "A living organism, especially an animal or plant; used to refer to living things collectively.",
      "explanation_cn": "指一个生物体，尤指动物或植物；也可泛指所有生物。",
      "example_en": "The rainforest is home to a vast diversity of life.",
      "example_cn": "这片雨林是众多生物的家园。"
    },
    {
      "pos": "noun",
      "explanation_en": "The quality or state of being alive, often used metaphorically to describe energy, vitality, or animation (e.g., in art or performance).",
      "explanation_cn": "指活着的状态，常用于比喻，形容活力、生气或生动性（如在艺术或表演中）。",
      "example_en": "The painting comes to life with vibrant colors and bold brushstrokes.",
      "example_cn": "这幅画以鲜艳的色彩和大胆的笔触栩栩如生。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "existence",
      "analysis": "“Existence” (存在) 是一个更哲学、更抽象的词，强调某物“有”或“存在”这一事实，不必然包含生物性或动态过程。例如，黑洞的存在。而 “life” 强调具有新陈代谢、意识、繁殖等生物特征的活跃状态。"
    },
    {
      "word_to_compare": "livelihood",
      "analysis": "“Livelihood” (生计) 侧重于维持生存所需的方式，如工作、收入或资源获取，是“如何活着”的经济层面。而 “life” 涵盖更广泛的生活内容，包括情感、经历、文化等非经济维度。"
    },
    {
      "word_to_compare": "existence",
      "analysis": "“Existence” (存在) 是一个更哲学、更抽象的词，强调某物“有”或“存在”这一事实，不必然包含生物性或动态过程。例如，黑洞的存在。而 “life” 强调具有新陈代谢、意识、繁殖等生物特征的活跃状态。"
    },
    {
      "word_to_compare": "vitality",
      "analysis": "“Vitality” (活力) 指生命所表现出的能量、健康或生气，是 “life” 的一种表现特征，而非其本质。例如，一个人可能有活力，但若失去生命，活力也随之消失。"
    }
  ]
}