{
  "word": "lifting",
  "pronunciation": "lif·ting",
  "concise_definition": "n. 举起, 提升, 提升动作; adj. 有提升作用的",
  "forms": {
    "base_form": "lift",
    "present_participle": "lifting",
    "past_tense": "lifted",
    "past_participle": "lifted"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of raising or moving something upward, especially with physical effort; often used in contexts such as weight training, construction, or logistics.",
      "explanation_cn": "指通过体力将某物向上抬起或移动的动作，常用于举重、建筑或物流等场景。",
      "example_en": "He struggled with the lifting of the heavy crate across the dock.",
      "example_cn": "他费力地将沉重的木箱从码头上抬起来。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of exercise in strength training that involves raising weights, such as deadlifts, bench presses, or squats.",
      "explanation_cn": "指力量训练中涉及举起重物的运动，如硬拉、卧推或深蹲。",
      "example_en": "Her favorite lifting routine includes squats and overhead presses.",
      "example_cn": "她最喜欢的举重训练包括深蹲和 overhead 推举。"
    },
    {
      "pos": "noun",
      "explanation_en": "A cosmetic procedure or technique designed to tighten and elevate sagging skin, especially on the face or body, to create a more youthful appearance.",
      "explanation_cn": "指一种美容程序或技术，旨在紧致并提升松弛的皮肤（尤其是面部或身体），以营造更年轻的外观。",
      "example_en": "She opted for a facial lifting to reduce the signs of aging.",
      "example_cn": "她选择了面部提升术来减少衰老迹象。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that has the effect of raising, improving, or enhancing, especially in mood, appearance, or status.",
      "explanation_cn": "形容具有提升、改善或增强作用的，尤其指在情绪、外观或地位方面。",
      "example_en": "The bright colors and uplifting music created a lifting atmosphere at the party.",
      "example_cn": "明亮的色彩和振奋人心的音乐为派对营造出一种令人振奋的氛围。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "raise",
      "analysis": "“Raise” (提高/举起) 是一个更通用的动词，强调将某物从较低位置移动到较高位置，常用于抽象或具体语境（如 raise prices, raise your hand）。而 “lifting” 作为名词，更侧重于动作本身，尤其在体力或健身语境中，带有持续性或技术性的含义。"
    },
    {
      "word_to_compare": "elevation",
      "analysis": "“Elevation” (提升/海拔) 通常指位置或高度的抽象或物理提升，常用于地理（如山的海拔）或医学（如肢体抬高），强调结果而非动作。而 “lifting” 更强调主动的、有意识的提升行为，尤其在健身或美容领域中使用更频繁。"
    },
    {
      "word_to_compare": "uplifting",
      "analysis": "“Uplifting” (鼓舞人心的) 是形容词，专指在情绪或精神层面带来积极影响的事物，如音乐、言论或经历。而 “lifting” 作为形容词时虽可表示类似含义，但更常用于描述物理或美容层面的提升，语义范围更窄，且不如 “uplifting” 常用于情感语境。"
    }
  ]
}