{
  "word": "lifted",
  "pronunciation": "lif·təd",
  "concise_definition": "adj. 被抬起的, 被提升的; v. (lift 的过去式和过去分词) 抬起, 提升, 盗窃, 举起",
  "forms": {
    "base_form": "lift",
    "present_participle": "lifting",
    "third_person_singular": "lifts",
    "past_tense": "lifted",
    "past_participle": "lifted"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To raise something from a lower position to a higher one, typically using physical force.",
      "explanation_cn": "指用体力将某物从较低位置抬升到较高位置。",
      "example_en": "He lifted the box onto the shelf with ease.",
      "example_cn": "他轻松地把箱子抬到了架子上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To improve or elevate someone's mood, spirit, or condition; to cheer or inspire.",
      "explanation_cn": "指改善某人的情绪、精神或状态；使振奋、鼓舞。",
      "example_en": "Her kind words lifted my spirits after a long day.",
      "example_cn": "她善意的话语让我在漫长的一天后心情好转。"
    },
    {
      "pos": "verb",
      "explanation_en": "To steal or take something illegally, especially in a casual or opportunistic manner.",
      "explanation_cn": "指非法窃取或顺手牵羊地拿走某物，通常带有随意或趁机而为的意味。",
      "example_en": "Someone lifted my wallet from my pocket while I was on the bus.",
      "example_cn": "我在公交车上时，有人从我口袋里偷走了钱包。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove or take away something that was previously in place, such as a restriction or ban.",
      "explanation_cn": "指移除或撤销先前存在的限制、禁令或障碍。",
      "example_en": "The government lifted the travel restrictions last month.",
      "example_cn": "政府上个月解除了旅行限制。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that has been raised or elevated, often used in contexts like hair, posture, or emotional state.",
      "explanation_cn": "形容某物已被抬起或提升的，常用于描述发型、姿态或情绪状态。",
      "example_en": "She had her hair lifted into a stylish updo for the party.",
      "example_cn": "她为参加派对把头发梳成了时尚的盘发。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "raise",
      "analysis": "“Raise” (提高) 通常用于更正式或有意识的提升动作，常涉及责任、价格、水平等抽象概念，如 raise your hand, raise the temperature。而 “lift” 更强调物理上的向上移动，动作感更强，常用于具体物体，如 lift a box。"
    },
    {
      "word_to_compare": "elevate",
      "analysis": "“Elevate” (提升) 更正式，常用于抽象意义，如提升地位、品位或精神境界，带有社会或道德上的升华意味。而 “lift” 更口语化，既可以用于物理动作，也可用于情绪，但较少用于正式语境中的地位提升。"
    },
    {
      "word_to_compare": "steal",
      "analysis": "“Steal” (偷窃) 是更通用、更直接的非法占有行为，强调违法性。而 “lift” 作为偷窃的同义词时，语气更轻、更口语化，常用于非暴力、小规模的顺手牵羊行为，如 lift a pen 或 lift a snack。"
    },
    {
      "word_to_compare": "remove",
      "analysis": "“Remove” (移除) 指将某物从某处拿走，不强调方向性，可以是横向、向下或向上。而 “lift” 在表示撤销（如 lift a ban）时，隐含着从压制状态到释放状态的向上运动，带有积极转变的意象。"
    }
  ]
}