{
  "word": "lighting",
  "pronunciation": "lahy·ting",
  "concise_definition": "n. 照明, 灯光布置, 光效",
  "forms": {
    "none": "lighting (不可数名词，无复数形式)"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The arrangement and use of artificial or natural light in a space to provide visibility, create atmosphere, or enhance aesthetics, commonly used in architecture, theater, film, and interior design.",
      "explanation_cn": "指在空间中对人工或自然光线的布置与运用，以提供照明、营造氛围或增强美感，常用于建筑、戏剧、电影和室内设计领域。",
      "example_en": "The lighting in the theater was carefully designed to highlight the actors' expressions.",
      "example_cn": "剧院的灯光经过精心设计，以突出演员的表情。"
    },
    {
      "pos": "noun",
      "explanation_en": "The equipment or system used to produce light in a building, room, or outdoor area, including lamps, fixtures, bulbs, and control systems.",
      "explanation_cn": "指用于在建筑物、房间或户外区域产生光线的设备或系统，包括灯具、灯泡、灯座和控制系统。",
      "example_en": "The building's energy-efficient lighting reduces electricity costs by 40%.",
      "example_cn": "这座建筑的节能照明系统使电费降低了40%。"
    },
    {
      "pos": "noun",
      "explanation_en": "In photography and film, the specific quality, direction, and intensity of light used to shape the visual mood and texture of a scene.",
      "explanation_cn": "在摄影和电影中，指用于塑造场景视觉氛围与质感的光线质量、方向和强度。",
      "example_en": "The low-key lighting created a moody, suspenseful atmosphere in the thriller.",
      "example_cn": "低照度灯光为这部惊悚片营造出一种阴郁而紧张的氛围。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "illumination",
      "analysis": "“Illumination”（照明/发光）更侧重于光线本身的存在或照亮的动作，常用于描述光的物理效果或抽象意义上的“启迪”。它更偏向科学或哲学语境，如“the illumination of a problem”。而 “lighting” 更强调人为设计和布置的系统或艺术性安排，具有更强的实践性和技术性。"
    },
    {
      "word_to_compare": "luminaire",
      "analysis": "“Luminaire”（灯具）是照明系统中的具体硬件设备，指包含光源、灯罩、镇流器等的完整照明装置。它是 “lighting” 的组成部分，属于实物名词，而 “lighting” 是一个涵盖设备、设计、效果的综合性概念。"
    },
    {
      "word_to_compare": "brightness",
      "analysis": "“Brightness”（亮度）仅描述光的强弱程度，是一个物理量度指标，如流明或勒克斯。它不涉及光线的分布、颜色、方向或美学目的。而 “lighting” 包含亮度，但更广泛地涵盖光线的整体设计与功能，是多维度的综合概念。"
    }
  ]
}