{
  "word": "lights",
  "pronunciation": "līts",
  "concise_definition": "n. 灯, 光, 光线, 灯光",
  "forms": {
    "singular": "light"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A source of illumination, such as a lamp, bulb, or natural phenomenon, that produces visible energy to enable vision or create ambiance.",
      "explanation_cn": "指能够产生可见光以提供照明或营造氛围的光源，如灯、灯泡或自然光。",
      "example_en": "The city skyline was dazzling under the bright lights of neon signs.",
      "example_cn": "在霓虹灯的璀璨光芒下，城市天际线令人目眩神迷。"
    },
    {
      "pos": "noun",
      "explanation_en": "The visible energy emitted by a source, such as sunlight or a flashlight, that allows objects to be seen.",
      "explanation_cn": "指由光源（如阳光或手电筒）发出的可见光，使物体能够被看见。",
      "example_en": "She stepped into the light and blinked, adjusting to the brightness.",
      "example_cn": "她走进光里，眯起眼睛，适应着这强烈的光线。"
    },
    {
      "pos": "noun",
      "explanation_en": "A system or device used for signaling or indicating status, such as traffic lights or indicator lights on a dashboard.",
      "explanation_cn": "指用于信号传递或状态指示的系统或装置，如交通信号灯或仪表盘上的指示灯。",
      "example_en": "The car's warning lights flashed red when the engine overheated.",
      "example_cn": "当发动机过热时，汽车的警示灯亮起了红光。"
    },
    {
      "pos": "noun",
      "explanation_en": "A metaphorical reference to attention, awareness, or revelation, often used in phrases like 'in the light of' or 'bring to light'.",
      "explanation_cn": "比喻意义上的‘关注’、‘意识’或‘揭示’，常用于短语如 'in the light of'（鉴于）或 'bring to light'（揭露）。",
      "example_en": "In the light of new evidence, the case must be reopened.",
      "example_cn": "鉴于新证据，此案必须重新审理。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "lamp",
      "analysis": "“Lamp”（灯）特指一种具体的照明设备，通常是可移动的、有灯罩和灯泡的装置，属于“light”的一种具体实现形式。而 “lights” 是更广泛的术语，可泛指任何形式的光源，包括自然光、建筑照明或信号灯。"
    },
    {
      "word_to_compare": "glow",
      "analysis": "“Glow”（微光）强调一种柔和、持续、非直射的发光状态，常带有温暖或朦胧的视觉感受，如萤火虫的光或炉火的余晖。而 “lights” 更中性，可指任何强度、方向或类型的光，包括刺眼或冷峻的光源。"
    },
    {
      "word_to_compare": "radiance",
      "analysis": "“Radiance”（光辉）是文学性更强的词，强调光的美丽、神圣或令人敬畏的特质，常用于形容阳光、神灵或人的气质。它带有情感和审美色彩，而 “lights” 是日常、实用、客观的词汇，不带情感倾向。"
    }
  ]
}