{
  "word": "likes",
  "pronunciation": "laɪks",
  "concise_definition": "n. 喜好, 喜欢的事物; v. 喜欢, 赞同",
  "forms": {
    "base_form": "like",
    "third_person_singular": "likes",
    "past_tense": "liked",
    "past_participle": "liked",
    "present_participle": "liking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A thing that someone enjoys, prefers, or finds appealing; often used in plural to refer to a person's interests or preferences, especially in social media contexts.",
      "explanation_cn": "指某人喜欢、偏好或觉得有吸引力的事物；常以复数形式出现，表示一个人的兴趣或偏好，尤其在社交媒体语境中。",
      "example_en": "Her social media profile shows her likes: hiking, coffee, and vintage books.",
      "example_cn": "她的社交媒体主页显示了她的喜好：徒步、咖啡和古董书籍。"
    },
    {
      "pos": "verb",
      "explanation_en": "To have a feeling of enjoyment, interest, or approval toward someone or something; to find something pleasant or agreeable.",
      "explanation_cn": "指对某人或某事物产生愉悦、兴趣或赞同的感觉；觉得某事物令人愉快或合意。",
      "example_en": "I like reading novels before bed because it helps me relax.",
      "example_cn": "我喜欢睡前读小说，因为它能帮助我放松。"
    },
    {
      "pos": "verb",
      "explanation_en": "To express approval or support for something, especially by clicking the 'like' button on a social media platform.",
      "explanation_cn": "指通过点击社交媒体平台上的“点赞”按钮来表达对某事物的赞同或支持。",
      "example_en": "She liked my photo and left a kind comment.",
      "example_cn": "她给我的照片点了赞，并留下了一条友善的评论。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "enjoy",
      "analysis": "“Enjoy” (享受) 强调在体验过程中获得愉悦或满足感，通常用于持续性的活动或感官体验（如享受美食、音乐）。而 “like” 更侧重于一种稳定的态度或偏好，不一定涉及实际体验，也可以是对抽象事物的倾向性认可。"
    },
    {
      "word_to_compare": "love",
      "analysis": "“Love” (热爱) 表达的情感强度远高于 “like”，表示强烈的喜爱甚至依恋，常用于亲密关系或极度偏好的事物。而 “like” 是中性或温和的偏好，语气更轻，适用于日常语境。例如：I like chocolate. vs. I love chocolate. "
    },
    {
      "word_to_compare": "fancy",
      "analysis": "“Fancy” (喜欢/中意) 是英式英语中较正式或文雅的表达，常带有某种审美或浪漫色彩，有时暗示一时的兴趣或幻想。它比 “like” 更具主观性和情绪化，且使用范围较窄，多用于特定语境，如 ‘I fancy a cup of tea.’"
    }
  ]
}