{
  "word": "lily",
  "pronunciation": "lil·ee",
  "concise_definition": "n. 百合花, 白色象征物, 纯洁的代表",
  "forms": {
    "plural": "lilies"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A perennial flowering plant of the genus Lilium, known for its large, fragrant, trumpet-shaped blooms, often in white, pink, or yellow, and widely cultivated for ornamental purposes.",
      "explanation_cn": "一种多年生开花植物，属于百合属，以其大型、芳香、喇叭状的花朵著称，常为白色、粉色或黄色，广泛栽培作为观赏植物。",
      "example_en": "She placed a single white lily on the altar as a symbol of peace.",
      "example_cn": "她将一朵白色百合花放在祭坛上，作为和平的象征。"
    },
    {
      "pos": "noun",
      "explanation_en": "A symbolic representation of purity, innocence, and rebirth, especially in Christian art and literature, often associated with the Virgin Mary.",
      "explanation_cn": "象征纯洁、天真与重生的意象，尤其在基督教艺术与文学中，常与圣母玛利亚相关联。",
      "example_en": "In medieval paintings, the lily is held by angels to signify the divine purity of the Virgin.",
      "example_cn": "在中世纪绘画中，天使手持百合，象征圣母的神圣纯洁。"
    },
    {
      "pos": "noun",
      "explanation_en": "A heraldic symbol used in French and English royal emblems, particularly the fleur-de-lis, which resembles a stylized lily and represents nobility and monarchy.",
      "explanation_cn": "一种用于法国和英国王室徽章中的纹章符号，尤其是鸢尾花（fleur-de-lis），其形似 stylized 百合，象征贵族与王权。",
      "example_en": "The fleur-de-lis, though botanically an iris, has long been called a lily in heraldic tradition.",
      "example_cn": "尽管鸢尾花在植物学上属于鸢尾属，但在纹章传统中常被称为百合。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rose",
      "analysis": "“Rose”（玫瑰）常象征爱情、激情或美丽，颜色不同含义各异（如红玫瑰代表热烈爱情，白玫瑰代表纯洁）；而 “lily” 更强调精神层面的纯洁、神圣与重生，较少与情爱直接关联，更多用于宗教或哀悼语境。"
    },
    {
      "word_to_compare": "iris",
      "analysis": "“Iris”（鸢尾花）在植物学上与百合不同科，但因其外形相似，在纹章和艺术中常被误称为 lily（如 fleur-de-lis）。实际上，iris 更象征信仰、智慧与勇气，而 lily 的象征意义更集中于纯洁与神圣。"
    },
    {
      "word_to_compare": "chrysanthemum",
      "analysis": "“Chrysanthemum”（菊花）在西方象征忠诚与长寿，在东亚文化中则常代表哀悼与死亡；而 lily 在多数文化中均与纯洁、新生相关，较少与死亡直接绑定，尽管在葬礼中也常用，但其寓意更偏向灵魂的净化而非终结。"
    }
  ]
}