{
  "word": "lincoln",
  "pronunciation": "lin·kən",
  "concise_definition": "n. 林肯（人名/地名），尤指美国第16任总统亚伯拉罕·林肯",
  "forms": {
    "plural": "lincolns"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to Abraham Lincoln (1809–1865), the 16th President of the United States, known for leading the country through the Civil War, preserving the Union, and abolishing slavery through the Emancipation Proclamation.",
      "explanation_cn": "专有名词，指美国第16任总统亚伯拉罕·林肯（1809–1865），他领导国家度过内战，维护联邦统一，并通过《解放奴隶宣言》废除了奴隶制。",
      "example_en": "Lincoln's Gettysburg Address remains one of the most powerful speeches in American history.",
      "example_cn": "林肯的葛底斯堡演说是美国历史上最有力的演讲之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to places named after Abraham Lincoln, such as the city of Lincoln in Nebraska, the capital of the state, or Lincoln, England.",
      "explanation_cn": "专有名词，指以亚伯拉罕·林肯命名的地点，如内布拉斯加州首府林肯市，或英格兰的林肯市。",
      "example_en": "We visited Lincoln, Nebraska, to see the state capitol building named in his honor.",
      "example_cn": "我们参观了内布拉斯加州的林肯市，参观了为纪念他而命名的州议会大厦。"
    },
    {
      "pos": "noun",
      "explanation_en": "A proper noun used in compound terms such as 'Lincoln penny' (a one-cent coin featuring Lincoln's portrait) or 'Lincoln Memorial' (a national monument in Washington, D.C.).",
      "explanation_cn": "用于复合词中的专有名词，如‘林肯分币’（正面印有林肯肖像的一美分硬币）或‘林肯纪念堂’（位于华盛顿特区的国家纪念碑）。",
      "example_en": "The Lincoln penny has been in circulation since 1909, the centennial of his birth.",
      "example_cn": "林肯分币自1909年发行以来一直在流通，以纪念他诞辰一百周年。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "president",
      "analysis": "“President”（总统）是一个通用头衔，泛指任何国家的国家元首，而 “Lincoln” 是特指美国历史上一位具体的总统，承载着独特的历史意义和文化象征。前者是类别，后者是实例。"
    },
    {
      "word_to_compare": "abraham",
      "analysis": "“Abraham” 是林肯的名（first name），在英语中常用于宗教语境（如《圣经》中的亚伯拉罕），而 “Lincoln” 是其姓氏（last name），在现代语境中已成为其历史身份的代称。单独使用 “Abraham” 不足以指代这位总统，必须与姓氏结合。"
    },
    {
      "word_to_compare": "monument",
      "analysis": "“Monument”（纪念碑）是一个通用名词，指为纪念某人或某事而建的结构，而 “Lincoln” 本身不是纪念碑，但常作为其名称的一部分（如 Lincoln Memorial）。前者是物体，后者是被纪念的人物。"
    }
  ]
}