{
  "word": "lineup",
  "pronunciation": "laɪnˌʌp",
  "concise_definition": "n. 排列, 阵容, 演出节目单; v. 排列, 组织, 安排",
  "forms": {
    "plural": "lineups",
    "third_person_singular": "lineups",
    "past_tense": "lined up",
    "past_participle": "lined up",
    "present_participle": "lining up"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A group of people or things arranged in a line, especially for a specific purpose such as performance, competition, or inspection.",
      "explanation_cn": "指为特定目的（如表演、比赛或检查）而排成一列的一群人或事物。",
      "example_en": "The team's lineup for the championship game includes three rookie players.",
      "example_cn": "这场冠军赛中，球队的阵容包括三名新秀球员。"
    },
    {
      "pos": "noun",
      "explanation_en": "A list or schedule of performers, acts, or events presented in sequence, especially at a concert, festival, or television program.",
      "explanation_cn": "指按顺序排列的表演者、节目或活动列表，尤指在音乐会、音乐节或电视节目中。",
      "example_en": "The music festival's lineup features top artists from around the world.",
      "example_cn": "这场音乐节的演出阵容汇集了来自世界各地的顶尖艺人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A police procedure in which a suspect is placed among several similar-looking individuals for identification by a witness.",
      "explanation_cn": "指警方将一名嫌疑人与其他几名外貌相似者排成一列，供目击者辨认的程序。",
      "example_en": "The victim was asked to identify the thief in a police lineup.",
      "example_cn": "受害者被要求在警方的辨认列队中指认小偷。"
    },
    {
      "pos": "verb",
      "explanation_en": "To arrange people or things in a line, often in preparation for an event or activity.",
      "explanation_cn": "指将人或物排成一列，通常为某项活动或事件做准备。",
      "example_en": "Fans lined up outside the store hours before the new phone went on sale.",
      "example_cn": "粉丝们在新手机发售前数小时就在商店外排起了长队。"
    },
    {
      "pos": "verb",
      "explanation_en": "To organize or select a group of participants for a performance, competition, or event.",
      "explanation_cn": "指为表演、比赛或活动组织或选定一组参与者。",
      "example_en": "The producer lined up several celebrities for the charity gala.",
      "example_cn": "制作人邀请了多位名人参加这场慈善晚宴。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "queue",
      "analysis": "“Queue”（排队）通常指人们为等待服务或进入某处而自然形成的有序队伍，强调等待和顺序，多用于日常场景（如排队买票）。“Lineup” 更强调为特定目的（如比赛、演出或辨认）而有组织地排列，范围更广，可指人、物或节目单。"
    },
    {
      "word_to_compare": "roster",
      "analysis": "“Roster”（名单）是一个静态的、正式的人员列表，常用于记录成员归属（如球队名单、值班表），不强调物理排列。“Lineup” 则强调在特定时刻的动态排列或实际出场安排，更具情境性和行动性。"
    },
    {
      "word_to_compare": "program",
      "analysis": "“Program”（节目单）是更正式、全面的活动安排文件，包含时间、地点、内容等详细信息，常用于剧院、会议等正式场合。“Lineup” 作为节目单使用时更口语化，侧重于表演者或节目的顺序列表，信息更简洁。"
    }
  ]
}