{
  "word": "lines",
  "pronunciation": "lahynz",
  "concise_definition": "n. 线, 行, 线路, 职责范围, 台词",
  "forms": {
    "singular": "line"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long, thin mark or stroke, especially one made by a pen, pencil, or other instrument, used to represent boundaries, paths, or connections.",
      "explanation_cn": "指用笔、铅笔或其他工具画出的长而细的痕迹，常用于表示边界、路径或连接关系。",
      "example_en": "She drew a straight line across the page with a ruler.",
      "example_cn": "她用尺子在纸上画了一条直线。"
    },
    {
      "pos": "noun",
      "explanation_en": "A row of words or text on a page, especially in poetry, scripts, or printed material.",
      "explanation_cn": "指页面上的一行文字，尤其用于诗歌、剧本或印刷材料中。",
      "example_en": "The poem had fourteen lines, each with a perfect rhyme.",
      "example_cn": "这首诗有十四行，每行都押了完美的韵。"
    },
    {
      "pos": "noun",
      "explanation_en": "A route or system for transportation, communication, or service, such as a bus line, telephone line, or power line.",
      "explanation_cn": "指用于交通、通信或服务的路线或系统，如公交线路、电话线路或电线。",
      "example_en": "The subway line runs from downtown to the airport.",
      "example_cn": "地铁线路从市中心通往机场。"
    },
    {
      "pos": "noun",
      "explanation_en": "A defined area of responsibility, activity, or expertise; often used in phrases like 'stay in your line' or 'in the line of work'.",
      "explanation_cn": "指明确的职责范围、活动领域或专业领域，常用于短语如‘坚守你的本分’或‘在……行业’中。",
      "example_en": "He works in the line of education, teaching high school biology.",
      "example_cn": "他在教育行业工作，教授高中生物。"
    },
    {
      "pos": "noun",
      "explanation_en": "The words spoken by a character in a play, film, or other performance.",
      "explanation_cn": "指戏剧、电影或其他表演中角色所说的台词。",
      "example_en": "She forgot her lines during the live performance and had to improvise.",
      "example_cn": "她在现场演出时忘记了台词，只好即兴发挥。"
    },
    {
      "pos": "noun",
      "explanation_en": "A queue or sequence of people or vehicles waiting for something, such as tickets or service.",
      "explanation_cn": "指为等待某物（如票务或服务）而排成的队列或序列。",
      "example_en": "There was a long line of customers waiting to buy concert tickets.",
      "example_cn": "有许多顾客排着长队购买演唱会门票。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "stroke",
      "analysis": "“Stroke”（笔画）通常指单次、独立的笔触动作，尤其在绘画或书法中，强调动作本身；而 “line” 更强调结果——一条连续的、有方向的痕迹，可以是几何的、抽象的或功能性的。"
    },
    {
      "word_to_compare": "row",
      "analysis": "“Row”（排）强调横向排列的多个并列事物（如椅子、人、数字），常用于空间上的整齐排列；而 “line” 可以是直线、曲线或抽象的序列，不仅限于横向，也用于时间、逻辑或功能上的延续。"
    },
    {
      "word_to_compare": "route",
      "analysis": "“Route”（路线）特指从起点到终点的交通路径，强调地理或实际移动的轨迹；而 “line” 在交通语境中更抽象，可指代运营系统（如地铁线路），不一定对应精确地理路径，也可能用于电话线、信号线等非物理路径。"
    }
  ]
}