{
  "word": "liners",
  "pronunciation": "lī·nərz",
  "concise_definition": "n. 船舶, 衬里, 眼线笔, 邮政包裹",
  "forms": {
    "singular": "liner"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A large passenger ship, especially one that operates on a regular schedule between fixed ports, often used for transoceanic travel.",
      "explanation_cn": "指大型客运船舶，尤其是定期在固定港口之间航行、常用于跨洋旅行的班轮。",
      "example_en": "The Titanic was one of the most famous ocean liners of the early 20th century.",
      "example_cn": "泰坦尼克号是20世纪初最著名的远洋班轮之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A lining or inner layer inserted into a container, garment, or structure to protect, insulate, or improve appearance.",
      "explanation_cn": "指插入容器、衣物或结构内部的一层衬里，用于保护、隔热或改善外观。",
      "example_en": "The suitcase has a waterproof liner to prevent moisture from damaging the contents.",
      "example_cn": "这个行李箱有防水衬里，以防止湿气损坏内部物品。"
    },
    {
      "pos": "noun",
      "explanation_en": "A cosmetic product applied along the eyelid to define or darken the eye, commonly known as eyeliner.",
      "explanation_cn": "指用于沿眼睑涂抹以勾勒或加深眼部轮廓的化妆品，通常称为眼线笔。",
      "example_en": "She applied a thin black liner to make her eyes look more dramatic.",
      "example_cn": "她画了一条细黑眼线，使眼睛看起来更有神采。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of postal service or container used for the secure and standardized transport of letters or small packages, especially in bulk.",
      "explanation_cn": "指用于批量安全、标准化运输信件或小包裹的邮政服务或容器，尤指邮政包裹。",
      "example_en": "The airline also handles cargo liners for international mail delivery.",
      "example_cn": "这家航空公司还负责国际邮件的包裹运输。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ship",
      "analysis": "“Ship”（船）是泛指所有水上航行的载具，而 “liner” 特指定期航行、载客或运货的班轮，强调其运营的规律性和商业性。并非所有船都是 liner，但所有 liner 都是 ship。"
    },
    {
      "word_to_compare": "lining",
      "analysis": "“Lining” 是 “liner” 的动名词或抽象名词形式，泛指衬里这一概念，而 “liner” 作为名词可指具体的衬里物品（如包内衬、衣服内衬），也可指班轮或眼线笔等其他含义，语义更具体、更广泛。"
    },
    {
      "word_to_compare": "eyeliner",
      "analysis": "“Eyeliner” 是 “liner” 在化妆品领域的专指，是其子类。而 “liner” 本身含义更广，可指船舶、衬里、邮政包裹等。使用时需根据语境区分，避免混淆。"
    }
  ]
}