{
  "word": "lined",
  "pronunciation": "līnd",
  "concise_definition": "adj. 有线的, 有衬里的, 排列成行的",
  "forms": {
    "base_form": "line",
    "past_tense": "lined",
    "past_participle": "lined",
    "present_participle": "lining"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having a line or lines, especially as a decorative or functional feature; often referring to fabric or material with a layer of another material sewn inside for warmth, structure, or smoothness.",
      "explanation_cn": "指带有线条，尤其是作为装饰性或功能性特征；常用于描述布料或材料内部缝有一层其他材料，以提供保暖、结构支撑或顺滑感。",
      "example_en": "She wore a lined coat to stay warm during the winter.",
      "example_cn": "她穿了一件有衬里的外套以在冬天保暖。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Arranged in a straight line or in parallel rows, often describing physical features such as streets, trees, or paper with horizontal markings.",
      "explanation_cn": "指呈直线排列或平行成行，常用于描述街道、树木或带有水平线条的纸张等物理特征。",
      "example_en": "The avenue was lined with tall oak trees on both sides.",
      "example_cn": "这条大道两侧排列着高大的橡树。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Marked with lines, especially for writing or drawing; commonly used to describe paper with pre-printed horizontal lines to guide handwriting.",
      "explanation_cn": "指带有线条，尤其是用于书写或绘画；常用于描述印有预设水平线的纸张，以引导书写。",
      "example_en": "He filled the lined notebook with his neat handwriting.",
      "example_cn": "他用工整的字迹填满了这本有横线的笔记本。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "striped",
      "analysis": "“Striped”（有条纹的）指由宽窄交替的色带或图案组成，强调颜色或纹理的对比性条纹，如条纹衬衫。“Lined”则更侧重于单一线条或平行线的排列，通常不涉及颜色变化，而是用于结构、引导或衬里功能。"
    },
    {
      "word_to_compare": "bordered",
      "analysis": "“Bordered”（有边界的）指物体边缘被一条线或不同材料环绕，强调的是外围轮廓。“Lined”则指内部或沿路径的线性排列，可以是内部衬里，也可以是纵向或横向的线性标记，不局限于边缘。"
    },
    {
      "word_to_compare": "rowed",
      "analysis": "“Rowed”（成排的）是动词“row”的过去式，通常描述由人或物组成的行列，如“rowed boats”（成排的船）。“Lined”作为形容词更广泛地用于静态的线性排列，包括非生物对象（如树、纸张、衬里），语义更抽象且用途更广。"
    }
  ]
}