{
  "word": "lion",
  "pronunciation": "lahy·uhn",
  "concise_definition": "n. 狮子, 勇敢的人, 重要人物",
  "forms": {
    "plural": "lions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A large, powerful carnivorous cat (Panthera leo) native to Africa and parts of Asia, known for its mane (in males), roar, and dominance as a top predator.",
      "explanation_cn": "一种原产于非洲和部分亚洲地区的大型肉食性猫科动物（学名：Panthera leo），雄性有鬃毛，以吼叫和作为顶级捕食者的统治地位而闻名。",
      "example_en": "The lion is often called the king of the jungle, though it primarily lives in grasslands and savannas.",
      "example_cn": "狮子常被称为丛林之王，尽管它主要生活在草原和稀树草原上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is brave, powerful, or dominant in a particular field, often used metaphorically to describe a courageous or influential individual.",
      "explanation_cn": "比喻指在某个领域中勇敢、强大或具有主导地位的人，常用于形容有勇气或影响力的杰出人物。",
      "example_en": "She is a lion of the legal profession, known for her fearless defense of human rights.",
      "example_cn": "她是法律界的一位杰出人物，以无畏地捍卫人权而闻名。"
    },
    {
      "pos": "noun",
      "explanation_en": "A symbol or emblem representing courage, royalty, or strength, commonly used in heraldry, logos, and cultural iconography.",
      "explanation_cn": "象征勇气、王权或力量的图案或标志，常用于纹章、徽标和文化意象中。",
      "example_en": "The British royal family has used the lion as a symbol of sovereignty for centuries.",
      "example_cn": "几个世纪以来，英国王室一直以狮子作为主权的象征。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tiger",
      "analysis": "“Tiger”（老虎）与“lion”同为大型猫科动物，但老虎更独居、更擅长潜行捕猎，且无鬃毛；狮子则群居，雄性有显著鬃毛，常被视为“百兽之王”。文化上，狮子更常与王权和集体力量关联，而老虎则象征野性、独立与神秘。"
    },
    {
      "word_to_compare": "leopard",
      "analysis": "“Leopard”（豹）体型较狮子小，行动敏捷，善于攀爬，常单独活动，其斑点皮毛与狮子的统一毛色形成鲜明对比。在象征意义上，豹代表隐秘、机敏与优雅，而狮子则代表公开的权威与威严。"
    },
    {
      "word_to_compare": "bear",
      "analysis": "“Bear”（熊）虽也象征力量，但其形象更偏向原始、粗犷与自然力量，常与荒野、冬眠和母性关联；而“lion”则带有文明社会中的王者气质，常与秩序、领导和荣誉联系在一起，象征更偏向社会性权威而非自然本能。"
    }
  ]
}