{
  "word": "liquidation",
  "pronunciation": "lih·kwee·uh·sey·shun",
  "concise_definition": "n. 清算, 变现, 清偿",
  "forms": {
    "plural": "liquidations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of selling off a company's assets to convert them into cash, typically to pay off debts when the business is closing down or undergoing financial distress.",
      "explanation_cn": "指企业在关闭或财务困境时，通过出售其资产以变现，用于偿还债务的过程。",
      "example_en": "The court ordered the liquidation of the bankrupt company's inventory and property.",
      "example_cn": "法院下令对该破产公司的库存和财产进行清算。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of settling or paying off obligations, especially in a final or comprehensive manner, often used in financial or legal contexts.",
      "explanation_cn": "指以彻底或全面的方式结清债务或义务，常用于金融或法律语境中。",
      "example_en": "After the liquidation of all outstanding loans, the account was officially closed.",
      "example_cn": "在所有未偿贷款清偿完毕后，该账户被正式关闭。"
    },
    {
      "pos": "noun",
      "explanation_en": "The rapid selling of goods at reduced prices to generate quick cash, often seen in retail during seasonal sales or store closures.",
      "explanation_cn": "指为快速回笼资金而以折扣价大量出售商品的行为，常见于零售业的季节性促销或店铺关闭时。",
      "example_en": "The store held a massive liquidation sale before shutting its doors for good.",
      "example_cn": "这家商店在永久关门前举行了一场大规模的清仓甩卖。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bankruptcy",
      "analysis": "“Bankruptcy” (破产) 是一种法律状态，指债务人无力偿还债务而向法院申请保护或重组。而 “liquidation” 是破产程序中可能采取的一种具体行动，即变卖资产还债。并非所有破产都涉及清算，有些是重组（reorganization）。"
    },
    {
      "word_to_compare": "dissolution",
      "analysis": "“Dissolution” (解散) 指法律实体（如公司）的终止存在，是组织结构上的终结。而 “liquidation” 侧重于资产变现和债务清偿的财务过程。一个公司可以先解散再清算，也可以在清算完成后才正式解散。"
    },
    {
      "word_to_compare": "asset sale",
      "analysis": "“Asset sale” (资产出售) 是一个中性术语，泛指任何出售资产的行为，不一定与债务清偿或企业关闭相关。而 “liquidation” 隐含了强制性、终结性和偿债目的，通常发生在企业危机背景下，语义更特定、更负面。"
    }
  ]
}