{
  "word": "listing",
  "pronunciation": "lis·ting",
  "concise_definition": "n. 列表, 登记, 广告, 挂牌出售",
  "forms": {
    "plural": "listings"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A structured record or display of items, names, or details in a sequential or categorized format, often for reference, organization, or public access.",
      "explanation_cn": "指以有序或分类格式记录的项目、名称或细节清单，通常用于参考、组织或公众查阅。",
      "example_en": "The real estate website showed a comprehensive listing of homes for sale in the neighborhood.",
      "example_cn": "这个房地产网站展示了该社区内所有待售房屋的完整清单。"
    },
    {
      "pos": "noun",
      "explanation_en": "An advertisement or public notice, especially in newspapers, online platforms, or classified sections, promoting goods, services, or properties for sale or rent.",
      "explanation_cn": "指在报纸、在线平台或分类广告版块中发布的广告或公告，用于推广商品、服务或房产的出售或出租。",
      "example_en": "She placed a listing for her vintage car on Craigslist and received five inquiries within a day.",
      "example_cn": "她在Craigslist上发布了那辆古董车的广告，一天内就收到了五条咨询。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of registering or enrolling something officially, particularly in the context of property or securities (e.g., a stock listing on an exchange).",
      "explanation_cn": "指正式登记或注册某物，尤其在房地产或证券领域（如股票在交易所挂牌上市）。",
      "example_en": "The company's successful IPO led to its official listing on the New York Stock Exchange.",
      "example_cn": "该公司成功的首次公开募股使其正式在纽约证券交易所挂牌上市。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "list",
      "analysis": "“List”（列表）是名词或动词，泛指任何项目集合，语义更通用，可指手写清单、购物单等非正式内容。而 “listing” 通常指经过组织、正式发布或用于公共传播的列表，常带有商业或官方性质，如房产挂牌、股票上市等。"
    },
    {
      "word_to_compare": "catalog",
      "analysis": "“Catalog”（目录）通常指系统化、详尽且结构严谨的物品集合，常用于商品目录、图书馆藏书目录等，强调完整性和分类体系。而 “listing” 更简洁，常用于广告或在线平台，侧重信息的可检索性而非系统性。"
    },
    {
      "word_to_compare": "inventory",
      "analysis": "“Inventory”（库存）特指企业或机构持有的实物资产清单，强调数量、价值和管理用途，多用于仓储或财务场景。而 “listing” 不一定涉及实物所有权，更多是信息展示或市场推广行为，如房源挂牌、服务广告等。"
    }
  ]
}