{
  "word": "literate",
  "pronunciation": "lit·uh·rut",
  "concise_definition": "adj. 有文化的, 会读写的, 有素养的",
  "forms": {
    "comparative": "more literate",
    "superlative": "most literate"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Able to read and write with competence, typically at a level sufficient to function effectively in daily life or within a specific context.",
      "explanation_cn": "具备足够读写能力，能够有效应对日常生活或特定情境中的基本文字需求。",
      "example_en": "In many developing countries, improving literacy rates remains a key educational goal.",
      "example_cn": "在许多发展中国家，提高识字率仍然是关键的教育目标。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Having knowledge or competence in a particular subject area or field, beyond basic reading and writing; often used in compound terms like 'computer-literate' or 'financially literate'.",
      "explanation_cn": "在某一特定领域具备知识或能力，超越基本的读写能力；常用于复合词，如 'computer-literate'（懂电脑）或 'financially literate'（具备财商）。",
      "example_en": "To make informed decisions, citizens should be politically literate.",
      "example_cn": "为了做出明智的决定，公民应当具备政治素养。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by or exhibiting a high degree of literary skill or cultural awareness, often implying refined taste or intellectual depth.",
      "explanation_cn": "体现或具有高度的文学技巧或文化意识，常暗示高雅的品味或思想深度。",
      "example_en": "Her literate commentary on classical poetry revealed deep scholarly insight.",
      "example_cn": "她对古典诗歌的有文化深度的评论展现了深厚的学术洞察力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "educated",
      "analysis": "“Educated”（受过教育的）强调系统性的学习经历和正式教育背景，可能包括高等教育或专业训练；而 “literate” 更侧重于基本的读写能力或特定领域的知识掌握，不一定需要正规教育。一个人可以是 literate 但未受过正规教育，反之亦然。"
    },
    {
      "word_to_compare": "learned",
      "analysis": "“Learned”（博学的）指拥有广泛而深入的知识，通常用于形容学者或专家，带有高度学术性；而 “literate” 的范围更广，既可以指基础读写能力，也可以指某一领域的基本理解，语义强度远低于 “learned”。"
    },
    {
      "word_to_compare": "illiterate",
      "analysis": "“Illiterate” 是 “literate” 的反义词，特指完全不具备读写能力的人。但现代语境中，它也常被引申为在某一领域缺乏基本认知（如 'financially illiterate'），这种用法与 “literate” 的扩展含义形成直接对比，突显了素养的有无。"
    }
  ]
}