{
  "word": "literary",
  "pronunciation": "lɪt·ər·er·i",
  "concise_definition": "adj. 文学的, 文学上的, 书面的",
  "forms": {
    "comparative": "more literary",
    "superlative": "most literary"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to the writing, study, or appreciation of literature, especially works of imaginative or artistic value such as novels, poetry, and drama.",
      "explanation_cn": "与文学的创作、研究或鉴赏相关的，尤指具有想象力或艺术价值的作品，如小说、诗歌和戏剧。",
      "example_en": "She has a deep interest in literary classics from the 19th century.",
      "example_cn": "她对19世纪的文学经典有着浓厚的兴趣。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by the style, diction, or conventions of written literature, often implying elegance, complexity, or formality in language.",
      "explanation_cn": "具有文学作品的风格、用词或惯例特征，通常暗示语言的优雅、复杂性或正式性。",
      "example_en": "His speech was too literary for the average listener to follow easily.",
      "example_cn": "他的演讲语言过于文雅，普通听众难以轻松理解。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Concerned with written rather than spoken language; often used to describe forms of expression that are more formal or stylized than everyday speech.",
      "explanation_cn": "指与书面语而非口语相关的，常用于描述比日常口语更正式或更具风格化的表达形式。",
      "example_en": "The literary use of archaic words gives the poem a timeless quality.",
      "example_cn": "诗中使用古语赋予了它一种永恒的气质。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "literature",
      "analysis": "“Literature” (文学) 是一个名词，指所有具有艺术价值的书面作品的总称，是一个实体范畴；而 “literary” 是形容词，用于描述某事物是否属于文学范畴或具有文学特征。例如，我们说 “a work of literature”（一部文学作品），但说 “a literary style”（一种文学风格）。"
    },
    {
      "word_to_compare": "academic",
      "analysis": "“Academic” (学术的) 强调与教育机构、研究或理论体系相关，常用于科学、历史或社会科学领域；而 “literary” 专指与文学创作、批评或审美相关的领域。一个学术论文可能分析文学，但它本身不一定是 “literary” 的，除非它采用文学化的语言或风格。"
    },
    {
      "word_to_compare": "artistic",
      "analysis": "“Artistic” (艺术的) 范围更广，涵盖所有艺术形式，如绘画、音乐、舞蹈等；而 “literary” 仅限于文字艺术，即文学。虽然所有文学作品都可称为 artistic，但并非所有 artistic 的表达都是 literary。例如，一幅画是 artistic，但不是 literary。"
    }
  ]
}