{
  "word": "lithuanian",
  "pronunciation": "liht·oo·nee·uhn",
  "concise_definition": "adj. 立陶宛的, n. 立陶宛人, 立陶宛语",
  "forms": {
    "plural": "lithuanians"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to Lithuania, its people, culture, or language; describing anything originating from or characteristic of the country of Lithuania in northeastern Europe.",
      "explanation_cn": "与立陶宛有关的，指其人民、文化或语言；描述源自或具有东欧国家立陶宛特征的事物。",
      "example_en": "Lithuanian folk music features unique polyphonic singing traditions.",
      "example_cn": "立陶宛民间音乐以其独特的复调歌唱传统而闻名。"
    },
    {
      "pos": "noun",
      "explanation_en": "A native or citizen of Lithuania; a person belonging to the Baltic ethnic group native to the region of modern-day Lithuania.",
      "explanation_cn": "立陶宛的原住民或公民；属于现代立陶宛地区原住波罗的民族的人。",
      "example_en": "Many Lithuanians emigrated to the United States in the early 20th century.",
      "example_cn": "20世纪初，许多立陶宛人移民到了美国。"
    },
    {
      "pos": "noun",
      "explanation_en": "The official language of Lithuania, a Baltic language closely related to Latvian and one of the oldest surviving Indo-European languages.",
      "explanation_cn": "立陶宛的官方语言，属于波罗的语族，与拉脱维亚语关系密切，是现存最古老的印欧语系语言之一。",
      "example_en": "Lithuanian has preserved many archaic features of Proto-Indo-European grammar.",
      "example_cn": "立陶宛语保留了原始印欧语语法中的许多古老特征。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "latvian",
      "analysis": "“Latvian”（拉脱维亚语/拉脱维亚人）与 “Lithuanian” 同属波罗的语族，语言和民族上高度相近，但两者是独立的国家和语言体系。立陶宛语比拉脱维亚语更保守，保留了更多原始印欧语特征，而拉脱维亚语受斯拉夫语影响更深。"
    },
    {
      "word_to_compare": "polish",
      "analysis": "“Polish”（波兰语/波兰人）属于斯拉夫语族，与立陶宛语在语系上完全不同。尽管立陶宛与波兰历史上曾有密切政治联盟（如波兰-立陶宛联邦），但语言结构、词汇和发音差异显著，立陶宛语更接近古印欧语，而波兰语受拉丁字母和德语影响更大。"
    },
    {
      "word_to_compare": "baltic",
      "analysis": "“Baltic”（波罗的海的）是一个更广泛的地理或语言学术语，涵盖立陶宛、拉脱维亚及历史上的普鲁士地区。它不是民族或语言的专称，而是类别词。而 “Lithuanian” 是特指立陶宛国家、民族或语言的专有名词，属于 “Baltic” 的子集。"
    }
  ]
}