{
  "word": "litter",
  "pronunciation": "lit·er",
  "concise_definition": "n. 垃圾, 杂物; v. 乱扔垃圾, 使到处都是垃圾",
  "forms": {
    "plural": "litters",
    "third_person_singular": "litters",
    "past_tense": "littered",
    "past_participle": "littered",
    "present_participle": "littering"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Scattered waste or trash, especially in public places such as streets, parks, or beaches, often left by people carelessly.",
      "explanation_cn": "指散落在公共场所（如街道、公园或海滩）的废弃物或垃圾，通常是人们随意丢弃所致。",
      "example_en": "The beach was covered in litter after the summer festival.",
      "example_cn": "夏季音乐节过后，海滩上到处都是垃圾。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of young animals born to a mother at the same time, especially in mammals such as dogs, cats, or pigs.",
      "explanation_cn": "指同一胎出生的一群幼崽，尤指狗、猫或猪等哺乳动物的幼崽。",
      "example_en": "The cat gave birth to a litter of five kittens last night.",
      "example_cn": "这只猫昨晚生了一窝五只小猫。"
    },
    {
      "pos": "verb",
      "explanation_en": "To throw trash or unwanted items carelessly onto the ground or into public spaces, often violating environmental norms or laws.",
      "explanation_cn": "指随意将垃圾或无用物品丢弃在地面或公共场所，通常违反环保规范或法律。",
      "example_en": "Visitors were fined for littering in the national park.",
      "example_cn": "游客因在国家公园乱扔垃圾而被罚款。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover or fill a place with scattered objects or debris, often in a messy or disorderly way.",
      "explanation_cn": "指使某地布满散落的物体或碎片，通常显得杂乱无章。",
      "example_en": "The floor was littered with papers, toys, and empty food containers.",
      "example_cn": "地板上散落着纸张、玩具和空食品容器。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "trash",
      "analysis": "“Trash” (垃圾) 是一个更通用的名词，泛指任何被丢弃的无用物品，通常指收集起来的废弃物，不强调其散落状态。而 “litter” 特指被随意丢弃、散落在公共或自然环境中的垃圾，带有负面的环境和道德含义。"
    },
    {
      "word_to_compare": "debris",
      "analysis": "“Debris” (残骸、碎片) 通常指因破坏、爆炸或自然灾害后留下的碎片，如建筑废墟、树木断枝等，多为非人为故意丢弃的产物。而 “litter” 通常指人类日常生活中故意或疏忽丢弃的废弃物，如塑料袋、饮料瓶等。"
    },
    {
      "word_to_compare": "offspring",
      "analysis": "“Offspring” (后代) 是一个更正式、更广泛的术语，泛指任何生物的子女或后代，不特指同一胎出生的数量。而 “litter” 专指哺乳动物一次分娩所生的多个幼崽，具有数量和时间上的集体性，语义范围更窄、更具体。"
    }
  ]
}