{
  "word": "lives",
  "pronunciation": "līvz",
  "concise_definition": "n. 生命, 生活, 生存; v. 生活, 居住, 活着 (第三人称单数形式)",
  "forms": {
    "singular": "life",
    "base_form": "live",
    "third_person_singular": "lives",
    "past_tense": "lived",
    "past_participle": "lived",
    "present_participle": "living"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The plural form of 'life', referring to the existence or condition of living beings, especially when considering multiple individuals or instances of life.",
      "explanation_cn": "'life' 的复数形式，指多个生物的存在状态或生活条件，常用于强调多个个体的生命。",
      "example_en": "The war claimed thousands of innocent lives.",
      "example_cn": "这场战争夺去了成千上万无辜的生命。"
    },
    {
      "pos": "noun",
      "explanation_en": "The way in which a person or group spends their time, including their activities, experiences, and lifestyle.",
      "explanation_cn": "指一个人或群体如何度过其时间，包括其活动、经历和生活方式。",
      "example_en": "Their lives have changed dramatically since they moved to the city.",
      "example_cn": "自从他们搬到城市后，他们的生活发生了巨大变化。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be alive; to exist in a physical or conscious state; to experience life through daily activities.",
      "explanation_cn": "指活着、存在，通过日常活动体验生命。",
      "example_en": "She lives in New York with her two children.",
      "example_cn": "她和两个孩子住在纽约。"
    },
    {
      "pos": "verb",
      "explanation_en": "To lead a specified kind of life or exist under particular conditions, often implying a quality or manner of existence.",
      "explanation_cn": "指以某种特定方式生活或处于某种特定条件下，常暗示生活的质量或方式。",
      "example_en": "He lives simply, without luxury or excess.",
      "example_cn": "他生活简朴，不追求奢华与浪费。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "life",
      "analysis": "“Life” 是单数形式，泛指生命或生活这一抽象概念，常用于哲学、科学或泛指语境（如 “The meaning of life”）。而 “lives” 是复数，强调多个个体的生命或生活方式，更具具体性和数量感。"
    },
    {
      "word_to_compare": "exist",
      "analysis": "“Exist” (存在) 更侧重于客观的、物理的或哲学意义上的存在，不必然包含主观体验或生活方式。而 “lives” 不仅表示存在，还隐含了主动经历、感受和参与生活的过程，语义更丰富。"
    },
    {
      "word_to_compare": "reside",
      "analysis": "“Reside” (居住) 仅指在某地长期居住，是一个地理或法律意义上的行为，不涉及生活方式或生命状态。而 “lives” 可以包含居住，但更广泛地涵盖情感、经济、社会等多维度的生活内容。"
    }
  ]
}