{
  "word": "live",
  "pronunciation": "līv",
  "concise_definition": "v. 生活, 居住, 活着; adj. 活的, 实时的",
  "forms": {
    "third_person_singular": "lives",
    "past_tense": "lived",
    "past_participle": "lived",
    "present_participle": "living"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To be alive; to exist in a state of consciousness and biological function, often implying the experience of daily life, emotions, and activities.",
      "explanation_cn": "指处于有意识和生物功能的状态，通常意味着经历日常生活、情感和活动。",
      "example_en": "She lives in New York with her two children.",
      "example_cn": "她和两个孩子住在纽约。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reside in a particular place for an extended period, often implying a sense of belonging or habitual existence.",
      "explanation_cn": "指在某个地方长期居住，通常暗示一种归属感或习惯性存在。",
      "example_en": "They lived in Paris for ten years before moving to Berlin.",
      "example_cn": "他们在搬到柏林之前在巴黎住了十年。"
    },
    {
      "pos": "verb",
      "explanation_en": "To experience life in a particular way, often reflecting one's values, choices, or lifestyle.",
      "explanation_cn": "指以某种特定方式体验生活，通常反映一个人的价值观、选择或生活方式。",
      "example_en": "He lives simply, valuing time with family over material wealth.",
      "example_cn": "他生活简朴，更重视与家人共度的时光而非物质财富。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Being alive or having life; not dead or inanimate.",
      "explanation_cn": "指有生命的，非死亡或无生命的。",
      "example_en": "The fish was still live when we bought it.",
      "example_cn": "我们买的时候鱼还是活的。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Broadcast or performed in real time, without pre-recording; happening as it is seen or heard.",
      "explanation_cn": "指实时广播或表演，未经预先录制；发生时即被观看或收听。",
      "example_en": "We watched the live concert from our living room.",
      "example_cn": "我们在客厅观看了这场现场演唱会。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "reside",
      "analysis": "“Reside”（居住）更正式，强调法律或官方意义上的住所，常用于书面语或正式语境，如“他居住在大使馆”。而 “live” 更口语化、通用，涵盖情感和生活方式的维度，适用范围更广。"
    },
    {
      "word_to_compare": "exist",
      "analysis": "“Exist”（存在）是中性、哲学性的词，仅表示“有”或“不灭”，不包含情感、体验或主动生活的内容。例如“恐龙早已不存在”。而 “live” 强调有意识、有感受的生命状态，带有主观性和生命力。"
    },
    {
      "word_to_compare": "alive",
      "analysis": "“Alive”（活着的）是形容词，仅描述生命状态的有无，不涉及居住或生活方式。例如“他从事故中活了下来”。而 “live” 作为动词时包含持续的行为和经历，作为形容词时多用于“实时”语境（如 live broadcast），与 “alive” 的语义领域不同。"
    }
  ]
}