{
  "word": "livingstone",
  "pronunciation": "liv·ing·stohn",
  "concise_definition": "n. 利文斯通（专有名词，人名/地名）",
  "forms": {
    "plural": "Livingstones"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to David Livingstone (1813–1873), a Scottish missionary, explorer, and abolitionist who became famous for his expeditions in Africa and his efforts to end the slave trade.",
      "explanation_cn": "专有名词，指苏格兰传教士、探险家和废奴主义者大卫·利文斯通（1813–1873），他因在非洲的探险活动以及致力于废除奴隶贸易而闻名。",
      "example_en": "David Livingstone's maps and journals provided some of the first detailed accounts of central Africa.",
      "example_cn": "大卫·利文斯通的地图和日记提供了关于中非最早的详细记录之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to Livingstone, a town in Zambia, named after the explorer David Livingstone, and known as a gateway to Victoria Falls.",
      "explanation_cn": "专有名词，指赞比亚的一个城镇——利文斯通，以探险家大卫·利文斯通命名，是通往维多利亚瀑布的门户。",
      "example_en": "Tourists flock to Livingstone to witness the thundering power of Victoria Falls.",
      "example_cn": "游客纷纷前往利文斯通，亲眼目睹维多利亚瀑布的磅礴气势。"
    },
    {
      "pos": "noun",
      "explanation_en": "A surname of Scottish origin, occasionally used as a family name in English-speaking countries.",
      "explanation_cn": "苏格兰姓氏，偶尔在英语国家中作为姓氏使用。",
      "example_en": "Dr. Livingstone, I presume? — a famous phrase attributed to Henry Morton Stanley upon meeting David Livingstone.",
      "example_cn": "利文斯通博士，我想是您吧？——这是亨利·莫顿·斯坦利与大卫·利文斯通会面时所说的著名话语。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "explorer",
      "analysis": "“Explorer”（探险家）是一个通用名词，泛指任何进行地理探索的人，而 “Livingstone” 是一个具体的历史人物名称，特指大卫·利文斯通。前者是类别，后者是实例。"
    },
    {
      "word_to_compare": "missionary",
      "analysis": "“Missionary”（传教士）描述的是宗教传播者的身份，而 “Livingstone” 虽然曾是传教士，但其历史意义远超这一身份，涵盖探险、科学记录与反奴隶制运动。因此，不能用 “missionary” 替代 “Livingstone” 作为专有名词。"
    },
    {
      "word_to_compare": "Victoria Falls",
      "analysis": "“Victoria Falls”（维多利亚瀑布）是位于赞比亚与津巴布韦交界处的自然景观，以利文斯通命名，但本身是地理实体。而 “Livingstone” 是人名或地名，二者是命名关系，而非同义词。"
    }
  ]
}