{
  "word": "living",
  "pronunciation": "liv·ing",
  "concise_definition": "n. 生活, 生计, 活着; adj. 活着的, 活跃的, 现存的",
  "forms": {
    "comparative": "livelier",
    "superlative": "liveliest"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The means by which one supports oneself financially; a person's occupation or source of income.",
      "explanation_cn": "指一个人维持生计的经济来源或职业，即谋生手段。",
      "example_en": "He earns his living as a freelance photographer.",
      "example_cn": "他靠做自由摄影师谋生。"
    },
    {
      "pos": "noun",
      "explanation_en": "The state of being alive; the experience of being conscious and active in the world.",
      "explanation_cn": "指处于活着的状态；体验在世间有意识地活动。",
      "example_en": "She values the simple pleasures of living.",
      "example_cn": "她珍视生活中简单的乐趣。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Being alive, not dead; having life or vital functions.",
      "explanation_cn": "指活着的，非死亡的；具有生命或生命功能的。",
      "example_en": "The police found a living suspect hiding in the woods.",
      "example_cn": "警察在树林里发现了一名活着的嫌疑人。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by activity, energy, or vibrancy; not static or dull.",
      "explanation_cn": "指充满活力、能量或生动性的，非静止或沉闷的。",
      "example_en": "The market was a living scene of bargaining and laughter.",
      "example_cn": "市场上是一幅充满讨价还价与欢笑的生动景象。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Existing or currently in effect, as opposed to historical or obsolete.",
      "explanation_cn": "指当前存在的、有效的，而非历史的或过时的。",
      "example_en": "These are the living languages spoken in the region today.",
      "example_cn": "这些是当今该地区仍在使用的活语言。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "alive",
      "analysis": "“Alive” (活着的) 仅强调生物意义上的生命存在，常用于否定死亡状态，语义较窄。而 “living” 不仅可指生理上的活着，还可用于比喻意义（如“活的语言”“活生生的场景”），语义更广、更灵活。"
    },
    {
      "word_to_compare": "life",
      "analysis": "“Life” (生命、生活) 是名词，泛指生命现象或人生经历，是抽象概念；而 “living” 作为名词时特指谋生方式，作为形容词时强调状态或活跃性，更具体、更具功能性。"
    },
    {
      "word_to_compare": "live",
      "analysis": "“Live” (作为形容词) 与 “living” 在许多语境中可互换（如 live broadcast / living broadcast），但 “live” 更常用于技术或媒体语境（如现场直播），而 “living” 更常用于描述人、语言、传统等具有持续生命力的事物，语感更人文、更自然。"
    }
  ]
}