{
  "word": "loads",
  "pronunciation": "lohdz",
  "concise_definition": "n. 大量, 负荷, 载重; v. 装载, 赋予, 使超载",
  "forms": {
    "singular": "load",
    "third_person_singular": "loads",
    "past_tense": "loaded",
    "past_participle": "loaded",
    "present_participle": "loading"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A large amount or quantity of something, often used informally to emphasize abundance or excess.",
      "explanation_cn": "指大量或数量众多的某物，常用于非正式语境中强调丰盛或过剩。",
      "example_en": "She has loads of friends and always knows what's happening in town.",
      "example_cn": "她朋友很多，总是知道城里发生的事。"
    },
    {
      "pos": "noun",
      "explanation_en": "The weight or burden that something carries or is expected to bear, especially in mechanical or physical contexts.",
      "explanation_cn": "指某物所承载或应承受的重量或负担，尤其用于机械或物理语境中。",
      "example_en": "The bridge was designed to handle a maximum load of 50 tons.",
      "example_cn": "这座桥的设计最大承载量为50吨。"
    },
    {
      "pos": "noun",
      "explanation_en": "A quantity of material that can be carried or handled at one time, such as a load of laundry or a load of bricks.",
      "explanation_cn": "指一次能搬运或处理的材料数量，如一洗衣篮衣物或一车砖块。",
      "example_en": "He carried a load of firewood into the house before the storm.",
      "example_cn": "风暴来临前，他搬了一车木柴进屋。"
    },
    {
      "pos": "verb",
      "explanation_en": "To put a heavy amount of something onto or into something else, especially to fill or overload a container, vehicle, or system.",
      "explanation_cn": "指将大量物品放入或置于某物之上，尤其是填满、装满容器、车辆或系统，使其超载。",
      "example_en": "They loaded the truck with supplies for the expedition.",
      "example_cn": "他们把远征所需的物资装上了卡车。"
    },
    {
      "pos": "verb",
      "explanation_en": "To assign or burden someone with a heavy responsibility, task, or obligation, often excessively.",
      "explanation_cn": "指给予某人繁重的责任、任务或义务，常带有过度的意味。",
      "example_en": "Don't load her with too many assignments during her vacation.",
      "example_cn": "别在她休假时给她安排太多任务。"
    },
    {
      "pos": "verb",
      "explanation_en": "To charge or fill a device with energy or material, such as loading a gun, a camera, or a washing machine.",
      "explanation_cn": "指为设备充填能量或材料，如装弹、装胶卷或装入洗衣机。",
      "example_en": "He loaded the camera with a new roll of film.",
      "example_cn": "他给相机装上了一卷新胶片。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "amount",
      "analysis": "“Amount”（数量）是中性、正式的术语，用于可数或不可数名词，强调数量大小，但不带有情感或负荷的隐含意义。而 “loads” 是非正式用语，常带有夸张或口语色彩，强调‘非常多’，有时隐含‘过多’的负面含义。"
    },
    {
      "word_to_compare": "burden",
      "analysis": "“Burden”（负担）专指心理或责任上的沉重压力，常含消极色彩，如道德负担或情感负担。而 “load” 既可用于物理重量，也可用于抽象责任，语义范围更广，且在口语中可中性甚至积极使用（如 ‘a load of fun’）。"
    },
    {
      "word_to_compare": "cargo",
      "analysis": "“Cargo”（货物）特指运输中的商品或物资，是专业术语，多用于航运、航空或物流语境，强调运输对象本身。而 “load” 更通用，可指任何被装载的物品，包括非商业性物品（如洗衣物、木材），且可作动词使用。"
    }
  ]
}