{
  "word": "lobby",
  "pronunciation": "lób·ee",
  "concise_definition": "n. 大厅, 大堂; v. 游说, 试图影响",
  "forms": {
    "plural": "lobbies",
    "third_person_singular": "lobbies",
    "past_tense": "lobbied",
    "past_participle": "lobbied",
    "present_participle": "lobbying"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A large entrance hall or waiting area in a public building, such as a hotel, theater, or government building, often used for gathering or transit.",
      "explanation_cn": "指公共建筑（如酒店、剧院或政府大楼）中的大型门厅或等候区，常用于聚集或通行。",
      "example_en": "We waited in the hotel lobby for our reservation to be confirmed.",
      "example_cn": "我们在酒店大堂等待预订确认。"
    },
    {
      "pos": "noun",
      "explanation_en": "The collective group of individuals or organizations that attempt to influence legislation or public policy, especially in a government building.",
      "explanation_cn": "指试图影响立法或公共政策的个人或组织的总称，尤指在政府大楼内活动的群体。",
      "example_en": "The pharmaceutical lobby has significant influence over healthcare legislation.",
      "example_cn": "制药行业的游说团体对医疗保健立法有重大影响。"
    },
    {
      "pos": "verb",
      "explanation_en": "To attempt to influence the decisions of legislators, officials, or organizations, typically by direct communication, persuasion, or financial support.",
      "explanation_cn": "指通过直接沟通、说服或经济支持等方式，试图影响立法者、官员或组织的决策。",
      "example_en": "Environmental groups are lobbying Congress to pass stricter pollution controls.",
      "example_cn": "环保组织正在游说国会通过更严格的污染控制法案。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hall",
      "analysis": "“Hall”（大厅）泛指任何大型室内空间，用途广泛，如礼堂、大厅、走廊等，不特指入口区域或政治活动场所。而 “lobby” 特指建筑物入口处的等候或过渡空间，或政治游说活动的代称，语义更具体。"
    },
    {
      "word_to_compare": "advocate",
      "analysis": "“Advocate”（倡导）指公开支持或为某事辩护，强调立场和信念，可以是个人或组织的公开表态，不一定涉及直接施压决策者。而 “lobby” 更强调有组织、有策略地直接接触权力机构以影响决策，具有更强的功利性和操作性。"
    },
    {
      "word_to_compare": "influence",
      "analysis": "“Influence”（影响）是一个更广泛、中性的动词，指任何方式的间接或直接作用，可以是舆论、榜样、环境等。而 “lobby” 是一种特定形式的“影响”，特指通过正式渠道（如会见议员、提交报告、提供资金）对政策制定者施加压力，具有制度化和职业化特征。"
    }
  ]
}