{
  "word": "localization",
  "pronunciation": "loh·kuh·luh·zey·shuhn",
  "concise_definition": "n. 本地化, 地方化, 定位",
  "forms": {
    "plural": "localizations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of adapting a product, service, or content to meet the language, cultural, legal, and other requirements of a specific target market or locale.",
      "explanation_cn": "指将产品、服务或内容调整以适应特定目标市场或地区的语言、文化、法律及其他需求的过程。",
      "example_en": "The localization of the video game included translated dialogue, culturally appropriate symbols, and adjusted date formats.",
      "example_cn": "这款电子游戏的本地化工作包括翻译对话、使用符合当地文化的符号以及调整日期格式。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of making something specific to a particular place or region, often in contrast to global or standardized versions.",
      "explanation_cn": "指使某事物变得特定于某一地点或地区，通常与全球统一或标准化版本相对。",
      "example_en": "The company's success relied on strong localization of its marketing campaigns to suit regional tastes.",
      "example_cn": "该公司成功的关键在于其营销活动针对地区偏好进行了充分本地化。"
    },
    {
      "pos": "noun",
      "explanation_en": "In biology or medicine, the process of identifying or confining a disease, function, or abnormality to a specific part of the body.",
      "explanation_cn": "在生物学或医学中，指确定疾病、功能或异常具体发生于身体的哪个部位的过程。",
      "example_en": "The MRI scan helped in the localization of the tumor within the brain.",
      "example_cn": "核磁共振扫描有助于确定脑内肿瘤的具体位置。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "translation",
      "analysis": "“Translation”（翻译）仅指语言层面的文字转换，不涉及文化、格式或法律适配。而 “localization” 是翻译的扩展，包含语言翻译、图像调整、货币单位、日期格式、宗教敏感性等全方位本地化处理。"
    },
    {
      "word_to_compare": "adaptation",
      "analysis": "“Adaptation”（适应）是一个更广泛的概念，泛指任何为适应新环境或条件而做出的改变，可用于生物、技术、社会等多个领域。而 “localization” 是 “adaptation” 在跨文化产品和服务语境下的一个特定子集，专指地域性适配。"
    },
    {
      "word_to_compare": "customization",
      "analysis": "“Customization”（定制）强调根据个人或用户的具体偏好进行个性化调整，通常是用户主动选择的结果。而 “localization” 是面向一个地区所有用户的系统性调整，基于该地区普遍的文化和规范，而非个体需求。"
    }
  ]
}