{
  "word": "lockdown",
  "pronunciation": "lok·doun",
  "concise_definition": "n. 封锁, 封城, 紧急封闭措施",
  "forms": {
    "plural": "lockdowns"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A strict restriction on movement and activities imposed by authorities during an emergency, such as a pandemic, terrorist threat, or civil unrest, to contain danger and protect public safety.",
      "explanation_cn": "指在疫情、恐怖袭击或社会动荡等紧急情况下，当局为控制危险、保障公共安全而实施的严格人员流动和活动限制措施。",
      "example_en": "The city entered a full lockdown after the outbreak of the new virus.",
      "example_cn": "新病毒爆发后，该城市实施了全面封锁。"
    },
    {
      "pos": "noun",
      "explanation_en": "A security measure in prisons or institutions where inmates or residents are confined to their rooms or cells for an extended period, often for safety or disciplinary reasons.",
      "explanation_cn": "指监狱或机构中为安全或惩戒原因，将囚犯或居民长时间限制在房间或牢房内的安全措施。",
      "example_en": "The prison went into lockdown after a fight broke out between two inmates.",
      "example_cn": "两名囚犯发生斗殴后，监狱进入了封锁状态。"
    },
    {
      "pos": "noun",
      "explanation_en": "A temporary closure of schools, businesses, or public spaces to prevent the spread of disease or respond to an immediate threat.",
      "explanation_cn": "指为防止疾病传播或应对突发威胁而临时关闭学校、企业或公共场所的措施。",
      "example_en": "Many schools remained under lockdown for weeks during the height of the pandemic.",
      "example_cn": "在疫情高峰期，许多学校连续数周处于封闭状态。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "quarantine",
      "analysis": "“Quarantine” (隔离) 通常指对可能接触过传染病的人或动物进行单独限制，以防止潜在传播，对象是特定个体或群体，而非整个区域。而 “lockdown” 是针对整个地区或机构的全面行动限制，范围更广，强制性更强。"
    },
    {
      "word_to_compare": "curfew",
      "analysis": "“Curfew” (宵禁) 是指规定在特定时间段内禁止人员外出，通常在夜间实施，目的是维持治安或控制骚乱。它限制的是时间，而非空间或活动类型。而 “lockdown” 是全天候、全方位的行动限制，包括禁止外出、关闭设施等。"
    },
    {
      "word_to_compare": "closure",
      "analysis": "“Closure” (关闭) 是一个中性词，泛指任何场所或服务的停止运营，可能是临时的、计划内的或非强制性的，如商店关门或道路封闭。而 “lockdown” 是紧急状态下的强制性封闭，通常伴随法律强制力和公共安全威胁。"
    }
  ]
}