{
  "word": "lodges",
  "pronunciation": "lodgez",
  "concise_definition": "n. 小屋, 小型住所; v. 住宿, 寄宿, 提交, 正式提出",
  "forms": {
    "singular": "lodge",
    "third_person_singular": "lodges",
    "past_tense": "lodged",
    "past_participle": "lodged",
    "present_participle": "lodging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small, often rustic building used for temporary accommodation, especially in rural or recreational areas such as forests, mountains, or hunting grounds.",
      "explanation_cn": "指一种小型、常具乡村风格的建筑，用于临时住宿，尤其见于森林、山区或狩猎区等休闲场所。",
      "example_en": "We stayed in a cozy wooden lodge near the lake during our winter vacation.",
      "example_cn": "我们在冬季假期住在湖边一座温馨的木制小屋里。"
    },
    {
      "pos": "noun",
      "explanation_en": "A building or room used as a meeting place for members of a fraternal or secret society, such as a Masonic lodge.",
      "explanation_cn": "指兄弟会或秘密社团成员聚会所用的建筑或房间，如共济会会所。",
      "example_en": "The Freemasons held their monthly meeting in the historic lodge downtown.",
      "example_cn": "共济会成员在市中心的历史会所举行了月度会议。"
    },
    {
      "pos": "verb",
      "explanation_en": "To stay temporarily in a place, especially a small or simple accommodation.",
      "explanation_cn": "指暂时居住在某地，尤指在小型或简朴的住所中住宿。",
      "example_en": "The hikers lodged at a mountain cabin after a long day of trekking.",
      "example_cn": "徒步者在长途跋涉后，住在山间小屋过夜。"
    },
    {
      "pos": "verb",
      "explanation_en": "To formally submit or file a document, complaint, or application with an authority or institution.",
      "explanation_cn": "指正式向权威机构或组织提交文件、投诉或申请。",
      "example_en": "She lodged a formal complaint with the city council about the noise pollution.",
      "example_cn": "她向市议会正式提交了关于噪音污染的投诉。"
    },
    {
      "pos": "verb",
      "explanation_en": "To become fixed or stuck in a particular position, often unexpectedly or forcefully.",
      "explanation_cn": "指意外或强行地卡在某个位置，无法轻易移动。",
      "example_en": "A bullet lodged in the wall after it missed the target.",
      "example_cn": "子弹射偏后卡在了墙上。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "inn",
      "analysis": "“Inn”（旅店）通常指提供餐饮和住宿服务的中型商业场所，历史较久，常位于交通要道，服务更全面；而 “lodge” 更强调简朴、临时性，常位于偏远或自然环境中，服务较基础，有时不提供餐饮。"
    },
    {
      "word_to_compare": "cabin",
      "analysis": "“Cabin”（小木屋）多指由木材建造的简单住所，常用于度假或野外，强调建筑材质和结构；“lodge” 则更侧重功能用途——作为住宿或社团会所，其建筑形式可以是木屋，也可以是石砌或现代结构。"
    },
    {
      "word_to_compare": "file",
      "analysis": "“File”（提交文件）是更通用的动词，指将文件正式呈交，适用于法律、行政等广泛场景；“lodge” 在此语境下更强调‘正式呈交并被记录’的动作，常用于投诉、申请或法律程序，带有更强的制度性与程序性色彩。"
    },
    {
      "word_to_compare": "embed",
      "analysis": "“Embed”（嵌入）强调物体被完全或深度地固定在另一物体内部，常用于技术或抽象语境（如记者嵌入部队）；而 “lodge” 在表示‘卡住’时，多指部分嵌入或卡在表面，更口语化，且常带有偶然性或意外性。"
    }
  ]
}