{
  "word": "lodge",
  "pronunciation": "lodge",
  "concise_definition": "v. 住宿, 寄存, 提交, n. 小屋, 门房, 会所",
  "forms": {
    "third_person_singular": "lodges",
    "past_tense": "lodged",
    "past_participle": "lodged",
    "present_participle": "lodging"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To stay temporarily in a place, especially a small or simple accommodation such as a cabin or hotel room.",
      "explanation_cn": "指暂时居住在某个地方，尤指小屋、旅馆房间等简单住宿场所。",
      "example_en": "We lodged in a cozy cabin by the lake during our hiking trip.",
      "example_cn": "我们在徒步旅行期间住在湖边一间舒适的小屋里。"
    },
    {
      "pos": "verb",
      "explanation_en": "To formally submit or file a document, complaint, or application, especially with an official body.",
      "explanation_cn": "指正式提交文件、投诉或申请，尤指呈交给官方机构。",
      "example_en": "She lodged a formal complaint with the city council about the noise pollution.",
      "example_cn": "她向市议会正式提交了关于噪音污染的投诉。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to become fixed or stuck in a particular position, often tightly or firmly.",
      "explanation_cn": "指使某物固定或卡在某个位置，通常指紧贴或嵌入。",
      "example_en": "A bone fragment became lodged in his throat after he swallowed it accidentally.",
      "example_cn": "他不小心吞下一块骨头碎片，卡在了喉咙里。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, often rustic house or cabin, typically located in a rural or remote area, used for temporary accommodation.",
      "explanation_cn": "指位于乡村或偏远地区的小型、常为简朴风格的房屋或小屋，用于临时住宿。",
      "example_en": "The hunters rented a wooden lodge in the mountains for the winter season.",
      "example_cn": "猎人们在冬季租了一座山中的木制小屋。"
    },
    {
      "pos": "noun",
      "explanation_en": "A building or room at the entrance of a large estate or park, often occupied by a gatekeeper or caretaker.",
      "explanation_cn": "指大型庄园或公园入口处的建筑或房间，通常由看门人或管理员居住。",
      "example_en": "The gatekeeper lived in a small lodge just inside the main entrance of the estate.",
      "example_cn": "看门人住在庄园主入口内侧的一间小门房里。"
    },
    {
      "pos": "noun",
      "explanation_en": "A local chapter or meeting place of a fraternal organization, such as a Freemasons lodge.",
      "explanation_cn": "指兄弟会组织（如共济会）的地方分会或集会场所。",
      "example_en": "The members gathered at the Masonic lodge for their monthly meeting.",
      "example_cn": "会员们在共济会会所举行了月度会议。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "stay",
      "analysis": "“Stay”（停留/住宿）是一个更通用的词，泛指在某地居住一段时间，不强调住宿的类型或目的。而 “lodge” 更具体，常暗示住宿环境较为简陋、临时或位于偏远地区，有时带有特定语境（如狩猎小屋、会所）。"
    },
    {
      "word_to_compare": "file",
      "analysis": "“File”（提交文件）通常用于法律或行政语境中，强调正式递交书面材料，如文件、申请表。而 “lodge” 在此义项下虽可互换，但更常用于英式英语，且常与 “complaint” 或 “claim” 搭配，语气略带正式但不那么机械。"
    },
    {
      "word_to_compare": "shelter",
      "analysis": "“Shelter”（庇护所）强调提供保护、安全或避难的功能，常用于紧急或人道主义语境（如地震避难所）。而 “lodge” 作为名词时，更侧重于建筑形式和用途（如度假小屋、门房），不一定具有保护性功能。"
    }
  ]
}