{
  "word": "logically",
  "pronunciation": "loj·i·kuh·lee",
  "concise_definition": "adv. 合乎逻辑地, 合理地, 有条理地",
  "forms": {
    "comparative": "more logically",
    "superlative": "most logically"
  },
  "definitions": [
    {
      "pos": "adverb",
      "explanation_en": "In a way that follows the principles of logic; using clear, rational reasoning based on evidence and consistent rules.",
      "explanation_cn": "以符合逻辑原则的方式；基于证据和一致规则，运用清晰、理性的推理。",
      "example_en": "She argued logically that the policy would lead to unintended consequences.",
      "example_cn": "她合乎逻辑地论证说，这项政策将导致意想不到的后果。"
    },
    {
      "pos": "adverb",
      "explanation_en": "In a manner that is consistent, orderly, and coherent, making ideas or actions easy to follow and understand.",
      "explanation_cn": "以连贯、有序、清晰的方式，使思想或行为易于理解和追踪。",
      "example_en": "The lecture was logically structured, moving from basic concepts to complex applications.",
      "example_cn": "这场讲座结构合乎逻辑，从基本概念逐步过渡到复杂应用。"
    },
    {
      "pos": "adverb",
      "explanation_en": "As a necessary conclusion derived from premises or facts; implying that something is the only reasonable outcome.",
      "explanation_cn": "作为从前提或事实中必然推出的结论；暗示某事是唯一合理的结果。",
      "example_en": "If all humans are mortal and Socrates is a human, then, logically, Socrates is mortal.",
      "example_cn": "如果所有人都是会死的，而苏格拉底是人，那么合乎逻辑地，苏格拉底也是会死的。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rationally",
      "analysis": "“Rationally”（理性地）强调基于冷静、客观的思考，避免情绪干扰，常用于决策或行为分析；而 “logically” 更侧重于推理过程是否符合形式逻辑规则，如前提与结论之间的必然联系。前者关注心理状态，后者关注结构有效性。"
    },
    {
      "word_to_compare": "reasonably",
      "analysis": "“Reasonably”（合理地）指在现实情境中可接受、适度或公平的判断，常带有实用主义色彩，不一定要求严格的逻辑推导。例如：‘合理的价格’。而 ‘logically’ 要求推理链条严密无漏洞，即使结论在现实中不实用，只要符合逻辑即可成立。"
    },
    {
      "word_to_compare": "coherently",
      "analysis": "“Coherently”（连贯地）强调表达或叙述的流畅性和内部一致性，使内容易于理解，但不必然要求每一步都符合逻辑规则。例如，一个故事可以讲得连贯但不合逻辑。而 ‘logically’ 必须保证推理过程的正确性，即使表达笨拙，只要推理成立，仍可称为 logically sound。"
    }
  ]
}