{
  "word": "logos",
  "pronunciation": "loh·gohs",
  "concise_definition": "n. 标志, 理性, 词, 原理",
  "forms": {
    "plural": "logoi"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A graphic symbol or emblem used by an organization, brand, or company to represent its identity visually and distinguish itself from others.",
      "explanation_cn": "指由组织、品牌或公司使用的图形符号或徽标，用于视觉上代表其身份并区别于其他实体。",
      "example_en": "The Apple logo is one of the most recognizable logos in the world.",
      "example_cn": "苹果的标志是全球最易识别的标志之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "In ancient Greek philosophy, the principle of divine reason or order that governs the universe; a concept central to Stoicism and early Christian theology.",
      "explanation_cn": "在古希腊哲学中，指支配宇宙的神圣理性或秩序原则；这是斯多葛学派和早期基督教神学的核心概念。",
      "example_en": "For Heraclitus, logos was the underlying structure of reality, present in all things.",
      "example_cn": "对赫拉克利特而言，逻各斯是现实的潜在结构，存在于万物之中。"
    },
    {
      "pos": "noun",
      "explanation_en": "In rhetoric and literary theory, the appeal to logic or reason in persuasion, as opposed to emotional or ethical appeals (pathos and ethos).",
      "explanation_cn": "在修辞学和文学理论中，指通过逻辑或理性来说服听众的方式，区别于情感诉求（pathos）和道德诉求（ethos）。",
      "example_en": "The lawyer relied heavily on logos, presenting clear evidence and sound arguments to win the case.",
      "example_cn": "律师大量运用逻辑论证，通过清晰的证据和合理的论点赢得案件。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "symbol",
      "analysis": "“Symbol”（符号）是一个更广泛的概念，泛指任何代表其他事物的标记或形象，可以是抽象的（如鸽子象征和平）或具体的。而 “logos” 特指商业或组织的视觉标识，具有明确的识别和品牌功能，是符号的一种特定类型。"
    },
    {
      "word_to_compare": "emblem",
      "analysis": "“Emblem”（徽章）通常指具有象征意义的图案，常用于国家、家族或团体，强调其代表的含义或价值观，如国徽。而 “logos” 更侧重于商业品牌识别，设计上更简洁、现代，且主要用于市场传播，而非传统象征。"
    },
    {
      "word_to_compare": "reason",
      "analysis": "“Reason”（理性）是英语中表示逻辑思维能力的通用词，而 “logos” 在哲学语境中承载更深层的宇宙秩序与语言本体论含义，是古希腊思想中理性与语言统一的终极原则，远超日常语义中的 ‘reason’。"
    }
  ]
}