{
  "word": "looks",
  "pronunciation": "looks",
  "concise_definition": "n. 外貌, 神情, 外观; v. 看起来, 似乎",
  "forms": {
    "singular": "look",
    "third_person_singular": "looks",
    "past_tense": "looked",
    "past_participle": "looked",
    "present_participle": "looking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The overall appearance or visual impression of a person, place, or thing, especially as it relates to attractiveness or style.",
      "explanation_cn": "指一个人、地方或事物的整体外貌或视觉印象，尤其与吸引力或风格相关。",
      "example_en": "She has a very elegant look that turns heads wherever she goes.",
      "example_cn": "她有一种非常优雅的外貌，无论走到哪里都令人瞩目。"
    },
    {
      "pos": "noun",
      "explanation_en": "A particular facial expression or glance that conveys emotion, attitude, or intention.",
      "explanation_cn": "指传达情感、态度或意图的特定面部表情或眼神。",
      "example_en": "He gave her a look that said he wasn't going to tolerate any more excuses.",
      "example_cn": "他给了她一个眼神，意思是不会再容忍任何借口。"
    },
    {
      "pos": "verb",
      "explanation_en": "To appear or seem in a certain way, often based on visual perception or impression rather than fact.",
      "explanation_cn": "指看起来或似乎具有某种特征，通常基于视觉印象而非事实。",
      "example_en": "This cake looks delicious, but I'm not sure if it's actually baked properly.",
      "example_cn": "这个蛋糕看起来很美味，但我不确定它是否真的烤好了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To direct one's gaze or attention toward something or someone.",
      "explanation_cn": "指将视线或注意力转向某物或某人。",
      "example_en": "She looked out the window and saw a rainbow forming in the sky.",
      "example_cn": "她望向窗外，看到天空中出现了一道彩虹。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "appearance",
      "analysis": "“Appearance” (外观) 更正式、更中性，常用于描述事物的外在状态或形象，强调客观事实，如服装、整洁度等。而 “looks” 更口语化，常带有主观评价色彩，尤其在描述人时，更侧重于美感或风格。"
    },
    {
      "word_to_compare": "seems",
      "analysis": "“Seems” (似乎) 是一个更抽象的动词，用于表达基于推理、感觉或间接信息的判断，不一定依赖视觉。而 “looks” 通常基于视觉感知，更具体、更感官化。例如：It seems strange（它似乎很奇怪）vs. It looks strange（它看起来很奇怪）。"
    },
    {
      "word_to_compare": "view",
      "analysis": "“View” (看法/景色) 可以指视觉上的景象（如风景），也可以指主观意见（如观点）。作为名词时，它更偏向于观察的角度或整体画面；而 “looks” 作为名词时，更聚焦于个体的外貌或表情，范围更窄、更具体。"
    }
  ]
}