{
  "word": "loom",
  "pronunciation": "loom",
  "concise_definition": "v. 隐现, 逼近; n. 织布机",
  "forms": {
    "third_person_singular": "looms",
    "past_tense": "loomed",
    "past_participle": "loomed",
    "present_participle": "looming"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To appear or seem to be approaching, especially in a threatening, ominous, or imposing way; often used to describe something large, distant, or impending that casts a shadow over the present.",
      "explanation_cn": "指某物（尤指庞大、遥远或即将来临的事物）以威胁性、不祥或压倒性的方式隐约出现或逼近，常用于形容一种令人不安的预感或前景。",
      "example_en": "A storm was looming on the horizon, dark and menacing.",
      "example_cn": "地平线上乌云密布，一场风暴正悄然逼近。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be visible in a vague or indistinct way, especially when seen from a distance or through obscurity.",
      "explanation_cn": "指在远处或透过模糊的视线中隐约可见，常带有神秘或朦胧的色彩。",
      "example_en": "The castle loomed through the mist, its towers barely discernible.",
      "example_cn": "城堡在薄雾中若隐若现，塔楼几乎难以辨认。"
    },
    {
      "pos": "noun",
      "explanation_en": "A machine used for weaving threads into fabric, typically with a frame that holds the warp threads under tension while the weft threads are passed through them.",
      "explanation_cn": "一种用于编织纱线成布料的机器，通常通过框架将经纱绷紧，纬纱穿过其间形成织物。",
      "example_en": "The weaver sat at her loom, rhythmically clicking the shuttle back and forth.",
      "example_cn": "织布工坐在织布机旁，有节奏地来回穿梭梭子。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "appear",
      "analysis": "“Appear”（出现）是一个中性词，仅表示某物进入视野，无情感或氛围色彩。而 “loom” 强调一种压迫感、威胁性或神秘感，常带有文学性或情绪张力，语义更丰富。"
    },
    {
      "word_to_compare": "looming",
      "analysis": "“Looming” 是 “loom” 的现在分词，但作为形容词时已独立成词，专用于描述即将发生且令人不安的事物（如 a looming deadline）。它比 “approaching” 更具心理压迫感，常用于新闻、文学中渲染紧张气氛。"
    },
    {
      "word_to_compare": "weave",
      "analysis": "“Weave”（编织）是织布机的操作动作，强调过程；而 “loom” 作为名词时指完成该动作的工具本身。两者相关但语义层级不同：一个是行为，一个是设备。"
    }
  ]
}