{
  "word": "loot",
  "pronunciation": "loot",
  "concise_definition": "n. 战利品, 赃物; v. 抢劫, 掠夺",
  "forms": {
    "plural": "loots",
    "third_person_singular": "loots",
    "past_tense": "looted",
    "past_participle": "looted",
    "present_participle": "looting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Stolen goods or valuables taken by force, especially during war, riots, or burglary; often refers to wealth acquired through violence or lawlessness.",
      "explanation_cn": "指通过武力、战争、暴乱或入室盗窃等方式非法夺取的财物或贵重物品，通常指通过暴力或非法手段获得的财富。",
      "example_en": "The soldiers returned home with sacks of loot from the conquered city.",
      "example_cn": "士兵们带着从被征服城市掠夺来的战利品回到了家乡。"
    },
    {
      "pos": "noun",
      "explanation_en": "In video games, items or currency collected by players after defeating enemies or completing quests, often representing rewards for progress.",
      "explanation_cn": "在电子游戏中，指玩家击败敌人或完成任务后获得的物品或货币，通常作为进度奖励。",
      "example_en": "After defeating the dragon, the party gathered a pile of magical loot.",
      "example_cn": "击败龙之后，队伍收集了一大堆魔法战利品。"
    },
    {
      "pos": "verb",
      "explanation_en": "To steal or take property by force, especially during a time of chaos such as war, riot, or natural disaster.",
      "explanation_cn": "指在战争、暴乱或自然灾害等混乱时期，通过暴力手段抢劫或夺取财物。",
      "example_en": "After the earthquake, mobs looted stores and homes for food and supplies.",
      "example_cn": "地震之后，暴徒们抢劫商店和民宅，搜刮食物和物资。"
    },
    {
      "pos": "verb",
      "explanation_en": "To collect or gather something eagerly, especially in a context of reward or acquisition (often used informally or humorously).",
      "explanation_cn": "指热切地收集或获取某物，常用于非正式或幽默语境中，指获取奖励或好处。",
      "example_en": "The kids looted the candy table at the birthday party.",
      "example_cn": "孩子们在生日派对上把糖果桌上的糖果一扫而空。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "plunder",
      "analysis": "“Plunder” (掠夺) 与 “loot” 非常接近，常可互换，但 “plunder” 更强调系统性、大规模的掠夺行为，常用于历史或军事语境，带有更强的正式感和暴力色彩。而 “loot” 更口语化，也可用于游戏或非暴力语境。"
    },
    {
      "word_to_compare": "steal",
      "analysis": "“Steal” (偷窃) 是一个通用词，指未经允许拿走他人财物，通常是个体行为，不涉及暴力或混乱场景。而 “loot” 强调在集体混乱或暴力背景下进行的公开抢劫，具有群体性和破坏性。"
    },
    {
      "word_to_compare": "booty",
      "analysis": "“Booty” (战利品) 是 “loot” 的近义名词，多用于文学或幽默语境，常指海盗或冒险故事中的财富。它比 “loot” 更具浪漫化色彩，而 “loot” 更中性或负面，常与犯罪或破坏相关联。"
    }
  ]
}