{
  "word": "lordship",
  "pronunciation": "lord·ship",
  "concise_definition": "n. 领主身份, 领地, 尊称, 主权",
  "forms": {
    "plural": "lordships"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The position, authority, or status of a lord, especially in a feudal system, including the right to govern land and people under one's control.",
      "explanation_cn": "指领主在封建制度中的地位、权力或身份，包括对所辖土地和人民的统治权。",
      "example_en": "The medieval lordship extended over several villages and their inhabitants.",
      "example_cn": "中世纪的领主统治范围涵盖数个村庄及其居民。"
    },
    {
      "pos": "noun",
      "explanation_en": "A territorial domain or estate ruled by a lord, often with legal and administrative autonomy.",
      "explanation_cn": "指由领主统治的领土或庄园，通常具有法律和行政上的自治权。",
      "example_en": "He inherited the lordship of Warwick, a vast estate with its own courts and taxes.",
      "example_cn": "他继承了沃里克领地，这片广袤的领地拥有自己的法庭和税收体系。"
    },
    {
      "pos": "noun",
      "explanation_en": "A formal title of respect used to address or refer to a nobleman, judge, or high-ranking official, especially in British usage.",
      "explanation_cn": "在英国用法中，用作对贵族、法官或高级官员的正式尊称。",
      "example_en": "Your Lordship, may I present the evidence in this matter?",
      "example_cn": "大人，我可以就此案呈交证据吗？"
    },
    {
      "pos": "noun",
      "explanation_en": "The sovereign power or dominion of a divine or supreme being, often used in religious contexts to denote God's supreme authority.",
      "explanation_cn": "在宗教语境中，指神或至高存在所拥有的至高主权或统治权。",
      "example_en": "We bow before the lordship of Christ, acknowledging His ultimate rule over all creation.",
      "example_cn": "我们向基督的主权俯首，承认祂对一切受造物的终极统治。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "lordship",
      "analysis": "“Lordship” 强调的是领主所拥有的权威、地位或统治权，既可以是世俗的（如封建领主），也可以是宗教的（如神的主权）。它比 “lord” 更抽象，侧重于权力体系而非个人身份。"
    },
    {
      "word_to_compare": "sovereignty",
      "analysis": "“Sovereignty” (主权) 是一个更广泛、更政治化的术语，指一个国家或政府在法律上独立、不受外部控制的最高权力。它不涉及个人身份或封建关系，而 “lordship” 常与个人统治、土地所有权和封建等级制度相关。"
    },
    {
      "word_to_compare": "authority",
      "analysis": "“Authority” (权威) 是一个通用词，泛指任何合法的权力或影响力，可来自法律、职位、知识或传统。而 “lordship” 是特定历史和文化语境下的权威形式，带有贵族、土地和世袭的色彩，语义更具体、更具历史厚重感。"
    },
    {
      "word_to_compare": "seigniorie",
      "analysis": "“Seigniorie”（法语借词，指封建领地）是欧洲大陆（尤其是法国）对类似领主领地的称呼，与 “lordship” 在英语语境中几乎同义，但 “lordship” 是英语传统用法，更常用于英国历史和文学中，而 “seigniorie” 多用于学术性历史文献中。"
    }
  ]
}