{
  "word": "loss",
  "pronunciation": "lɔs",
  "concise_definition": "n. 损失, 亏损, 失去, 失败",
  "forms": {
    "plural": "losses"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The fact of no longer having something, especially something valuable, such as money, possessions, or a person; often accompanied by emotional or financial harm.",
      "explanation_cn": "指不再拥有某物，尤其是金钱、财产或亲人等有价值的东西；通常伴随着情感或经济上的伤害。",
      "example_en": "The family is still grieving the loss of their son in the accident.",
      "example_cn": "这家人仍在为儿子在事故中去世而悲痛。"
    },
    {
      "pos": "noun",
      "explanation_en": "A decrease in amount, value, or quantity, especially in financial contexts, such as when expenses exceed income.",
      "explanation_cn": "指数量、价值或金额的减少，尤其在财务语境中，指支出超过收入时的亏损。",
      "example_en": "The company reported a net loss of $2 million last quarter.",
      "example_cn": "该公司上个季度报告了200万美元的净亏损。"
    },
    {
      "pos": "noun",
      "explanation_en": "The failure to win a game, competition, or contest; the opposite of victory.",
      "explanation_cn": "指在比赛、竞赛或对抗中未能获胜；与胜利相对。",
      "example_en": "The team suffered a heartbreaking loss in the final minutes of the match.",
      "example_cn": "球队在比赛最后几分钟遭遇了令人心碎的失败。"
    },
    {
      "pos": "noun",
      "explanation_en": "The state of being missing or unaccounted for, especially in the context of people or objects.",
      "explanation_cn": "指人或物失踪或无法找到的状态。",
      "example_en": "The search for the missing hiker continues after his loss on the mountain trail.",
      "example_cn": "在登山者于小径上失踪后，搜救行动仍在继续。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "defeat",
      "analysis": "“Defeat” (失败) 通常指在竞争、战斗或对抗中被他人战胜，强调外部对手的存在和明确的胜负关系。而 “loss” 更广泛，可以是被动的失去（如失去财物），不一定是被他人击败的结果。"
    },
    {
      "word_to_compare": "deprivation",
      "analysis": "“Deprivation” (剥夺) 指被系统性地剥夺了基本需求或权利，如食物、睡眠或自由，带有长期性和结构性的含义。而 “loss” 更侧重于一次性或具体事物的丧失，情感色彩更直接。"
    },
    {
      "word_to_compare": "decline",
      "analysis": "“Decline” (衰退) 指逐渐减弱或下降的过程，常用于描述趋势，如经济衰退、健康恶化。它强调渐进性，而 “loss” 更强调结果或事件性的丧失，通常是突然或已完成的状态。"
    }
  ]
}