{
  "word": "love",
  "pronunciation": "luhv",
  "concise_definition": "n. 爱, 爱情, 喜爱; v. 爱, 喜爱, 热爱",
  "forms": {
    "third_person_singular": "loves",
    "past_tense": "loved",
    "past_participle": "loved",
    "present_participle": "loving"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A deep, intense affection or emotional attachment toward a person, animal, or thing, often characterized by care, devotion, and selflessness.",
      "explanation_cn": "对某人、动物或事物的深厚、强烈的情感依恋，通常表现为关怀、奉献和无私。",
      "example_en": "Their love for each other has endured through years of hardship.",
      "example_cn": "他们之间的爱经受住了多年艰难岁月的考验。"
    },
    {
      "pos": "noun",
      "explanation_en": "A strong liking or enthusiasm for an activity, subject, or object, often without romantic connotations.",
      "explanation_cn": "对某项活动、主题或物体的强烈喜好或热情，通常不带有浪漫含义。",
      "example_en": "She has a love of classical music and attends concerts every week.",
      "example_cn": "她热爱古典音乐，每周都去听音乐会。"
    },
    {
      "pos": "verb",
      "explanation_en": "To feel deep affection or strong emotional attachment toward someone or something, often implying commitment and care.",
      "explanation_cn": "对某人或某物产生深厚的情感依恋或喜爱，通常包含承诺与关怀。",
      "example_en": "I love spending time with my family on weekends.",
      "example_cn": "我喜欢在周末与家人共度时光。"
    },
    {
      "pos": "verb",
      "explanation_en": "To enjoy or take great pleasure in something, often used in casual contexts to express preference.",
      "explanation_cn": "享受或从某事物中获得极大快乐，常用于口语中表达偏好。",
      "example_en": "I love this movie—it never gets old!",
      "example_cn": "我超爱这部电影——怎么看都不腻！"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "like",
      "analysis": "“Like” (喜欢) 表达的是一种较轻微、较表面的偏好或好感，情感强度远低于 “love”。例如，你可能喜欢某种食物或电影，但不会为它付出牺牲或长期投入。而 “love” 暗示更深的情感联结、承诺或依恋，常用于亲密关系或核心价值观中。"
    },
    {
      "word_to_compare": "adore",
      "analysis": "“Adore” (崇拜/极度喜爱) 比 “love” 更具情感强度和崇拜色彩，常用于表达对偶像、孩子或神圣事物的近乎虔诚的喜爱。它带有更强烈的赞美和仰慕意味，有时略显夸张，而 “love” 更普遍、更真实，适用于日常情感表达。"
    },
    {
      "word_to_compare": "cherish",
      "analysis": "“Cherish” (珍爱) 强调对某人或某物的珍惜、保护和小心呵护，侧重于情感的持久性和珍贵性，常用于回忆、关系或物品。它更内敛、更庄重，而 “love” 更直接、更广泛，可涵盖激情、亲情、友情等多种形式。"
    }
  ]
}