{
  "word": "lowering",
  "pronunciation": "low·er·ing",
  "concise_definition": "adj. 降低的, 下降的; v. 降低, 使下降 (现在分词)",
  "forms": {
    "base_form": "lower",
    "comparative": "lower",
    "superlative": "lowest",
    "present_participle": "lowering",
    "past_tense": "lowered",
    "past_participle": "lowered"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing something that is at a reduced height, level, or intensity, often implying a deliberate or gradual decrease.",
      "explanation_cn": "形容某物的高度、水平或强度被降低，通常暗示一种有意识或渐进的下降。",
      "example_en": "The lowering sky signaled an approaching storm.",
      "example_cn": "低垂的天空预示着暴风雨即将来临。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used to describe a mood, tone, or atmosphere that is subdued, gloomy, or threatening.",
      "explanation_cn": "用于描述一种压抑、阴郁或具有威胁性的氛围或情绪。",
      "example_en": "He gave her a lowering glance that made her feel uneasy.",
      "example_cn": "他投来一道阴沉的目光，让她感到不安。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reduce the height, level, or amount of something, often by physical or intentional action.",
      "explanation_cn": "通过物理动作或有意行为降低某物的高度、水平或数量。",
      "example_en": "The crane was lowering the heavy container onto the ship.",
      "example_cn": "起重机正将沉重的集装箱吊放到船上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a decrease in the intensity, value, or quality of something, such as morale, prices, or standards.",
      "explanation_cn": "导致某事物的强度、价值或质量下降，如士气、价格或标准。",
      "example_en": "The scandal was lowering public trust in the government.",
      "example_cn": "这起丑闻正在削弱公众对政府的信任。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "decreasing",
      "analysis": "“Decreasing” (减少) 更侧重于数量、规模或程度上的减少，常用于可量化的对象（如温度、收入、人数），强调数学或统计意义上的下降。而 “lowering” 更常用于物理高度、位置或抽象氛围的降低，带有更明显的动作感或视觉意象。"
    },
    {
      "word_to_compare": "dropping",
      "analysis": "“Dropping” (下降) 通常暗示一种突然、快速或非受控的下降，如价格暴跌、体温下降。而 “lowering” 更常指有意识、缓慢或受控的降低，如降低音量、降低旗帜，带有目的性和主动性。"
    },
    {
      "word_to_compare": "sinking",
      "analysis": "“Sinking” (下沉) 强调因重力或自然力量导致的向下运动，常用于物体沉入液体或情绪陷入低谷，具有被动或不可逆的意味。而 “lowering” 可以是主动行为，且不一定涉及垂直运动，也可用于抽象概念如情绪或标准的降低。"
    }
  ]
}