{
  "word": "lump",
  "pronunciation": "lump",
  "concise_definition": "n. 块, 团; v. 把… lump 成块, 一并处理",
  "forms": {
    "plural": "lumps",
    "third_person_singular": "lumps",
    "past_tense": "lumped",
    "past_participle": "lumped",
    "present_participle": "lumping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small, irregular mass or chunk of a solid substance, often without a defined shape.",
      "explanation_cn": "指一种小而形状不规则的固体块状物，通常没有明确的外形。",
      "example_en": "She stirred the soup until the flour dissolved and no lumps remained.",
      "example_cn": "她搅拌汤，直到面粉完全溶解，没有留下任何块状物。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, rounded swelling or protuberance on the body, often caused by injury or disease.",
      "explanation_cn": "指身体上因受伤或疾病引起的小型圆形隆起或肿块。",
      "example_en": "He felt a lump on his neck and went to see a doctor immediately.",
      "example_cn": "他感到脖子上有个肿块，立即去看医生。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of things or people considered together without distinction, often in a careless or dismissive way.",
      "explanation_cn": "指将事物或人不加区分地归为一组，常带有粗心或轻视的意味。",
      "example_en": "He lumped all the critics together as jealous people.",
      "example_cn": "他把所有批评者一概视为嫉妒的人。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form or press something into a lump or lumps; to make into a compact mass.",
      "explanation_cn": "指将某物形成或压成块状，使其成为紧密的团块。",
      "example_en": "The sugar had lumped together in the container after being exposed to moisture.",
      "example_cn": "糖因受潮而在容器中结成了块。"
    },
    {
      "pos": "verb",
      "explanation_en": "To group or classify things or people together in an undifferentiated way, often unfairly or simplistically.",
      "explanation_cn": "指以不加区分的方式将事物或人归为一类，常带有不公平或简单化的倾向。",
      "example_en": "Don't lump all teenagers together as rebellious — many are responsible and thoughtful.",
      "example_cn": "不要把所有青少年都一概视为叛逆的——很多人是负责任且有思想的。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "clump",
      "analysis": "“Clump” (丛, 团) 通常指自然聚集在一起的物体，如草丛、头发打结，强调的是聚集状态而非形状不规则；而 “lump” 更强调不规则、无结构的固体块状物，常含负面或不雅的意味。"
    },
    {
      "word_to_compare": "mass",
      "analysis": "“Mass” (质量, 大量) 是一个更中性、更广泛的术语，可指任何大量聚集的物质或人群，常用于科学或抽象语境；而 “lump” 更具体，常指不规则、笨重、不精致的实体，带有口语化或贬义色彩。"
    },
    {
      "word_to_compare": "bundle",
      "analysis": "“Bundle” (捆, 包) 指有意识地将物品捆绑或打包在一起，通常有组织性、目的性；而 “lump” 暗示无序、随意地归为一类，缺乏结构或意图，常含贬义。"
    }
  ]
}