{
  "word": "luna",
  "pronunciation": "loo·nuh",
  "concise_definition": "n. 月球, 月亮（拉丁语来源，常用于文学、科学或命名）",
  "forms": {
    "plural": "lunas"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The natural satellite of Earth, commonly referred to as the Moon; often used in poetic, scientific, or mythological contexts to evoke a sense of mystery or celestial beauty.",
      "explanation_cn": "地球的天然卫星，通常指月亮；常用于诗歌、科学或神话语境中，以唤起神秘感或天体之美。",
      "example_en": "Luna rose above the horizon, casting a silvery glow over the quiet lake.",
      "example_cn": "月亮从地平线上升起，为宁静的湖面洒下银色的光辉。"
    },
    {
      "pos": "noun",
      "explanation_en": "A proper name used in literature, art, or branding to symbolize the moon, often associated with femininity, cycles, or mysticism.",
      "explanation_cn": "在文学、艺术或品牌中用作专有名称，象征月亮，常与女性特质、周期性或神秘主义相关联。",
      "example_en": "The character Luna in the novel embodies the quiet wisdom of the night.",
      "example_cn": "小说中的角色露娜体现了夜晚的宁静智慧。"
    },
    {
      "pos": "noun",
      "explanation_en": "A term used in astronomy and space exploration to refer to Earth's moon, especially in formal or international contexts (e.g., Luna program, Luna 2).",
      "explanation_cn": "在天文学和太空探索中，用于指代地球的月球，尤其在正式或国际语境中（如‘月球计划’、‘月球2号’）。",
      "example_en": "The Soviet Union's Luna 9 was the first spacecraft to achieve a soft landing on the lunar surface.",
      "example_cn": "苏联的月球9号是首个在月球表面实现软着陆的航天器。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "moon",
      "analysis": "“Moon” 是日常英语中最常用的词，泛指地球的天然卫星，语气中性、通用。而 “luna” 源自拉丁语，带有更强的文学性、学术性或浪漫色彩，常用于艺术、命名或正式科学语境，使用频率远低于 “moon”。"
    },
    {
      "word_to_compare": "selene",
      "analysis": "“Selene” 是希腊神话中月亮女神的名字，常用于古典文学或奇幻作品中，强调神话渊源。而 “luna” 源自罗马神话，更广泛地被现代科学和大众文化采用，如月球探测器命名。两者均为诗意用词，但 “luna” 更具现代通用性。"
    },
    {
      "word_to_compare": "satellite",
      "analysis": "“Satellite” (卫星) 是一个通用科学术语，指围绕行星运行的任何天体，包括人造卫星和自然卫星。而 “luna” 专指地球的天然卫星，具有唯一性和特指性，不能用于其他行星的卫星。"
    }
  ]
}