{
  "word": "lush",
  "pronunciation": "loosh",
  "concise_definition": "adj. 茂盛的, 丰饶的; n. 茂密的植被; n. 沉溺享乐者",
  "forms": {
    "comparative": "lusher",
    "superlative": "lushest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing vegetation that is thick, green, and abundant, often due to ample water and fertile soil, suggesting richness and vitality.",
      "explanation_cn": "形容植被茂密、翠绿且丰盛，通常因水分充足和土壤肥沃而呈现出旺盛的生命力。",
      "example_en": "The valley was covered in lush green grass after the spring rains.",
      "example_cn": "春雨过后，山谷里覆盖着茂盛的绿草。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something rich, extravagant, or indulgent, especially in terms of luxury, decoration, or sensory experience.",
      "explanation_cn": "形容某物丰富、奢华或放纵，尤其指在装饰、享受或感官体验上的极致享受。",
      "example_en": "She wore a lush velvet gown to the gala, adorned with gold embroidery.",
      "example_cn": "她在晚会上穿着一件奢华的丝绒长裙，饰以金色刺绣。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who indulges excessively in pleasures, especially food, drink, or comfort, often with a connotation of laziness or gluttony.",
      "explanation_cn": "指沉溺于享乐（尤其是饮食或舒适生活）的人，常带有懒惰或贪吃的贬义。",
      "example_en": "The old millionaire was known as a lush who spent his days drinking fine wine and napping in his garden.",
      "example_cn": "这位老百万富翁以沉溺享乐著称，整日品饮美酒，在花园里小憩。"
    },
    {
      "pos": "noun",
      "explanation_en": "A dense growth of vegetation, especially in a wet or tropical environment.",
      "explanation_cn": "指茂密的植被群，尤指在湿润或热带环境中生长的植物丛。",
      "example_en": "The hikers lost their way in the lush of the rainforest.",
      "example_cn": "徒步者在雨林的茂密植被中迷了路。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "verdant",
      "analysis": "“Verdant”（青翠的）专指植物颜色鲜绿、生机勃勃，强调视觉上的绿色，常用于文学或诗意语境。而 “lush” 不仅包含绿色，更强调茂密、丰盈和富足的质感，涵盖范围更广，可延伸至感官享受。"
    },
    {
      "word_to_compare": "luxuriant",
      "analysis": "“Luxuriant”（繁茂的）与 “lush” 非常接近，都形容植物茂盛，但 “luxuriant” 更正式、更书面化，常用于描述植物或头发的浓密繁复，带有精致、优雅的意味；而 “lush” 更口语化，且可引申用于物质享受，语义更宽泛。"
    },
    {
      "word_to_compare": "drunkard",
      "analysis": "“Drunkard”（酒鬼）是明确指酗酒者，带有强烈道德谴责，语义单一且负面。而 “lush” 作为名词时虽也指沉溺享乐者，但语气较轻，有时甚至带点幽默或怀旧色彩，且可泛指沉溺于任何享乐的人，不限于酒精。"
    }
  ]
}