{
  "word": "mace",
  "pronunciation": "mays",
  "concise_definition": "n. 火炬, 警棍, 肉豆蔻; v. 用警棍击打",
  "forms": {
    "plural": "maces",
    "third_person_singular": "maces",
    "past_tense": "maced",
    "past_participle": "maced",
    "present_participle": "macing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A heavy, spiked club used as a weapon in medieval times, often carried by ceremonial officers or soldiers to crush armor or deliver blunt force.",
      "explanation_cn": "一种中世纪使用的沉重带刺棍棒，常由仪仗官员或士兵携带，用于击碎盔甲或施加钝器打击。",
      "example_en": "The royal usher carried a golden mace as a symbol of authority during the ceremony.",
      "example_cn": "仪式上，皇家侍从手持一根金制火炬，象征权威。"
    },
    {
      "pos": "noun",
      "explanation_en": "A powdered spice made from the dried outer covering of the nutmeg seed, used to add warm, slightly sweet flavor to both sweet and savory dishes.",
      "explanation_cn": "由肉豆蔻种子外层干燥后研磨而成的香料，用于为甜食和咸食增添温暖、微甜的风味。",
      "example_en": "A pinch of mace enhances the flavor of this custard dessert.",
      "example_cn": "少许肉豆蔻皮能提升这款蛋奶冻的风味。"
    },
    {
      "pos": "noun",
      "explanation_en": "A ceremonial staff topped with a decorative metal sphere or emblem, carried by officials in formal processions to signify rank or jurisdiction.",
      "explanation_cn": "一种在正式游行中由官员携带的礼仪权杖，顶端装饰有金属球体或徽章，象征其等级或管辖权。",
      "example_en": "The mayor entered the chamber accompanied by the city mace-bearer.",
      "example_cn": "市长在持权杖官的陪同下步入议事厅。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strike or attack someone with a mace, especially in a violent or forceful manner.",
      "explanation_cn": "用警棍或带刺棍棒击打某人，通常指暴力或强力的攻击行为。",
      "example_en": "The guard maced the intruder to stop him from escaping.",
      "example_cn": "警卫用警棍击打入侵者，阻止其逃跑。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "club",
      "analysis": "“Club”（棍棒）泛指任何粗重的棒状武器，形状较简单，通常无尖刺；而 “mace” 特指带有金属尖刺或钉头的重型打击武器，专为破甲设计，更具攻击性和历史军事特征。"
    },
    {
      "word_to_compare": "nutmeg",
      "analysis": "“Nutmeg”（肉豆蔻）是肉豆蔻种子的内核，味道更浓烈、辛香；而 “mace” 是其外层的红色假种皮，味道更温和、甜美，常作为肉豆蔻的补充香料使用。两者来自同一植物，但部位和风味不同。"
    },
    {
      "word_to_compare": "baton",
      "analysis": "“Baton”（指挥棒/警棍）通常指现代警察使用的短棍或指挥家使用的细长棒，主要用于控制或指挥，无攻击性尖刺；而 “mace” 作为武器时更具杀伤力，作为礼仪物品时也更厚重、象征性更强，常用于传统仪式场合。"
    }
  ]
}