{
  "word": "madonna",
  "pronunciation": "muh·don·uh",
  "concise_definition": "n. 圣母玛利亚, 女性圣像, （非正式）对女性的尊称",
  "forms": {
    "plural": "madonnas"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A representation of the Virgin Mary, especially in Christian art, typically depicted holding the infant Jesus, symbolizing purity, maternal love, and divine grace.",
      "explanation_cn": "指基督教艺术中圣母玛利亚的画像或雕像，通常描绘她怀抱婴儿耶稣，象征纯洁、母爱与神圣恩典。",
      "example_en": "The chapel contains a beautiful marble madonna from the 15th century.",
      "example_cn": "这座小教堂里有一尊15世纪的精美大理石圣母像。"
    },
    {
      "pos": "noun",
      "explanation_en": "A woman who is idealized or revered for her beauty, grace, or moral purity, often used in literary or poetic contexts.",
      "explanation_cn": "指被理想化或尊崇为美丽、优雅或道德纯洁的女性，常用于文学或诗歌语境中。",
      "example_en": "To the poet, his late mother was a madonna of quiet strength and unwavering kindness.",
      "example_cn": "对这位诗人而言，他已故的母亲是一位拥有宁静力量与坚定仁慈的圣母般人物。"
    },
    {
      "pos": "noun",
      "explanation_en": "A nickname or informal title for a woman perceived as iconic, glamorous, or culturally significant, especially in pop culture (e.g., the singer Madonna).",
      "explanation_cn": "指在流行文化中被视为具有标志性、魅力或文化重要性的女性的昵称或非正式称谓（如歌手麦当娜）。",
      "example_en": "She was called the madonna of rock for her powerful voice and timeless style.",
      "example_cn": "她因强大的嗓音和永恒的风格被称为摇滚界的圣母。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "virgin",
      "analysis": "“Virgin”（处女）是一个强调生理或道德纯洁状态的词，常用于宗教或道德语境中，但本身不包含艺术形象或崇拜的含义。而 “madonna” 是一个文化符号，特指被艺术化、神圣化的圣母形象，承载着宗教、美学与情感的多重意义。"
    },
    {
      "word_to_compare": "saint",
      "analysis": "“Saint”（圣人）泛指被教会正式封圣的男女信徒，其崇拜范围广泛，不限于母性或女性形象。而 “madonna” 专指圣母玛利亚，具有唯一性和母性中心性，是基督教中最具代表性的女性圣像，不适用于其他圣徒。"
    },
    {
      "word_to_compare": "icon",
      "analysis": "“Icon”（偶像/象征）是一个更宽泛的词，可指任何具有文化象征意义的人物或图像（如电影偶像、宗教符号）。而 “madonna” 是一个具体的文化专有名词，特指圣母玛利亚或其艺术表现，具有明确的宗教与艺术传统背景，比 “icon” 更具历史与语义限定性。"
    }
  ]
}