{
  "word": "mainstream",
  "pronunciation": "mayn·strim",
  "concise_definition": "n. 主流, 潮流; adj. 主流的, 普遍接受的",
  "forms": {
    "plural": "mainstreams",
    "comparative": "more mainstream",
    "superlative": "most mainstream"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The prevailing or dominant attitudes, values, or practices within a society or group, especially those accepted by the majority of people.",
      "explanation_cn": "指一个社会或群体中占主导地位的态度、价值观或实践，尤其是被大多数人所接受的部分。",
      "example_en": "The film's themes have moved from the margins to the mainstream.",
      "example_cn": "这部电影的主题已从边缘走向了主流。"
    },
    {
      "pos": "noun",
      "explanation_en": "The main current of a river or stream; figuratively, the dominant flow or direction of a process or movement.",
      "explanation_cn": "指河流或溪流的主干水流；引申义为某一过程或运动的主导趋势或方向。",
      "example_en": "The river's mainstream flows steadily toward the ocean.",
      "example_cn": "这条河的主干水流稳定地流向海洋。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Widely accepted or popular among the general public, as opposed to being alternative, niche, or subcultural.",
      "explanation_cn": "指被大众广泛接受或流行的，与另类、小众或亚文化相对。",
      "example_en": "Smartphones have become a mainstream technology in modern households.",
      "example_cn": "智能手机已成为现代家庭中的主流技术。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Conforming to conventional or established norms, especially in culture, politics, or aesthetics.",
      "explanation_cn": "指符合传统或既定规范的，尤其在文化、政治或审美方面。",
      "example_en": "Her music is too experimental to be considered mainstream.",
      "example_cn": "她的音乐太过实验性，不能被视为主流。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "popular",
      "analysis": "“Popular”（受欢迎的）强调被许多人喜欢或追捧，但不一定代表社会主流价值观。一个事物可以很流行（如小众网红产品），却仍属边缘文化。而 “mainstream” 更强调被社会多数人普遍接受、符合主流规范，具有文化权威性。"
    },
    {
      "word_to_compare": "conventional",
      "analysis": "“Conventional”（传统的、常规的）侧重于遵循既定规则或习惯，常带保守或缺乏创新的意味。而 “mainstream” 更中性，仅描述当前多数人所接受的状态，不一定与传统挂钩（如电子支付曾是创新，如今已是主流）。"
    },
    {
      "word_to_compare": "dominant",
      "analysis": "“Dominant”（占主导地位的）强调在数量、权力或影响力上压倒其他选项，常用于竞争语境（如主导语言、主导物种）。而 “mainstream” 更侧重于文化接受度和普遍性，不一定具有强制性或压倒性优势。"
    }
  ]
}