{
  "word": "makeup",
  "pronunciation": "meyk·uhp",
  "concise_definition": "n. 化妆, 化妆品; 组成, 补偿; v. 化妆, 弥补",
  "forms": {
    "plural": "makeups"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Cosmetics used to enhance or alter the appearance of the face, especially to conceal imperfections or emphasize features.",
      "explanation_cn": "用于修饰或改变面部外观的化妆品，常用于掩盖瑕疵或突出五官特征。",
      "example_en": "She applied a light layer of makeup before the interview.",
      "example_cn": "她在面试前轻轻涂了一层妆。"
    },
    {
      "pos": "noun",
      "explanation_en": "The composition or arrangement of parts that form a whole, often referring to the structure or content of a group, system, or team.",
      "explanation_cn": "构成整体的各个部分的组成或安排，常用于描述群体、系统或团队的构成。",
      "example_en": "The makeup of the committee includes experts from five different countries.",
      "example_cn": "该委员会的成员由来自五个不同国家的专家组成。"
    },
    {
      "pos": "noun",
      "explanation_en": "Something given or done to compensate for a loss, deficiency, or missed opportunity.",
      "explanation_cn": "为弥补损失、不足或错失机会而给予或采取的补偿措施。",
      "example_en": "The school offered a makeup exam for students who were sick on the test day.",
      "example_cn": "学校为考试当天生病的学生安排了补考。"
    },
    {
      "pos": "verb",
      "explanation_en": "To apply cosmetics to one's face to improve or change appearance.",
      "explanation_cn": "在脸上涂抹化妆品以改善或改变外貌。",
      "example_en": "She made up her face before going to the party.",
      "example_cn": "她参加派对前化了妆。"
    },
    {
      "pos": "verb",
      "explanation_en": "To compensate for something lost, missed, or inadequate by doing or providing something extra.",
      "explanation_cn": "通过额外做某事或提供某些东西来弥补失去的、错过的或不足的部分。",
      "example_en": "He stayed up late to make up for the hours he missed at work.",
      "example_cn": "他熬夜工作，以弥补之前错过的工时。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cosmetics",
      "analysis": "“Cosmetics”（化妆品）是“makeup”的上位词，泛指所有用于美容的化学产品，包括护肤品、香水、指甲油等；而 “makeup” 专指用于面部修饰的彩妆产品，如粉底、眼影、口红等，范围更窄、更具体。"
    },
    {
      "word_to_compare": "composition",
      "analysis": "“Composition”（构成）是一个更正式、更广泛的术语，用于描述任何系统、结构或文本的组成部分，适用于科学、艺术、写作等领域；而 “makeup” 在表示“组成”时更口语化，常用于描述人群、团队或组织的构成，语气更轻松。"
    },
    {
      "word_to_compare": "compensation",
      "analysis": "“Compensation”（补偿）是法律或经济语境中更正式的术语，通常指金钱或物质上的赔偿；而 “makeup” 在表示“弥补”时更常用于日常语境，如补课、补考、补时间等，强调行为上的补救而非经济回报。"
    }
  ]
}