{
  "word": "malay",
  "pronunciation": "muh·lay",
  "concise_definition": "n. 马来人, 马来语; adj. 马来的",
  "forms": {
    "plural": "malays"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A member of an ethnic group native to the Malay Peninsula, parts of Sumatra, and coastal Borneo, known for their distinct language, culture, and historical influence in Southeast Asia.",
      "explanation_cn": "指原生于马来半岛、苏门答腊部分地区和婆罗洲沿海的民族群体成员，以其独特的语言、文化和在东南亚的历史影响力而著称。",
      "example_en": "The Malay community in Singapore maintains strong traditions of batik weaving and silat martial arts.",
      "example_cn": "新加坡的马来社群保留着蜡染织造和席拉武术等深厚传统。"
    },
    {
      "pos": "noun",
      "explanation_en": "The Austronesian language spoken by the Malay people, serving as the official language of Malaysia, Brunei, and Singapore, and a national language in Indonesia (where it is called Indonesian).",
      "explanation_cn": "马来人所使用的南岛语系语言，是马来西亚、文莱和新加坡的官方语言，也是印度尼西亚的国语（在印尼称为印尼语）。",
      "example_en": "Malay is widely understood across Southeast Asia due to its historical role as a lingua franca.",
      "example_cn": "由于历史上作为通用语的角色，马来语在东南亚地区被广泛理解。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to the Malay people, their language, or their culture, especially in the context of Southeast Asia.",
      "explanation_cn": "与马来人、其语言或文化相关的，尤其在东南亚语境中。",
      "example_en": "The temple architecture reflects a blend of Malay and Hindu influences.",
      "example_cn": "这座寺庙的建筑体现了马来与印度教风格的融合。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "indonesian",
      "analysis": "“Indonesian”（印尼语）与 “Malay” 在语言上高度相似，几乎可视为同一种语言的两种标准化变体。印尼语以马来语为基础，但吸收了更多荷兰语、爪哇语和地方词汇，且拼写和部分语法略有不同。两者在口语中常可互通，但作为官方语言，它们分属不同国家。"
    },
    {
      "word_to_compare": "chinese",
      "analysis": "“Chinese”（中文）指中国及海外华人使用的语言群（如普通话、粤语），与马来语在语系、文字和语法结构上完全不同。马来语属南岛语系，无声调，使用拉丁字母；中文属汉藏语系，有声调，使用表意文字。两者在东南亚常并存，但代表截然不同的文化背景。"
    },
    {
      "word_to_compare": "tamil",
      "analysis": "“Tamil”（泰米尔语）是印度南部和斯里兰卡的主要语言，属达罗毗荼语系，与马来语无亲缘关系。在马来西亚，泰米尔语是印度裔社群的主要语言，而马来语是国家通用语。两者在社会功能上互补，但语言结构、词汇和书写系统差异显著。"
    }
  ]
}