{
  "word": "male",
  "pronunciation": "meyl",
  "concise_definition": "n. 男性, 雄性; adj. 男性的, 雄性的",
  "forms": {
    "comparative": "more male",
    "superlative": "most male"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person or animal that is biologically male, typically possessing male reproductive organs and secondary sexual characteristics such as higher testosterone levels and greater muscle mass.",
      "explanation_cn": "指在生物学上为男性的人或动物，通常具有男性生殖器官及第二性征，如较高的睾酮水平和更大的肌肉质量。",
      "example_en": "The male of the species is significantly larger than the female.",
      "example_cn": "该物种的雄性明显比雌性体型更大。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who identifies as a man or is socially recognized as male, regardless of biological sex, in the context of gender identity.",
      "explanation_cn": "在性别认同语境中，指自我认同为男性或被社会视为男性的个体，不论其生理性别如何。",
      "example_en": "He identifies as male and uses he/him pronouns.",
      "example_cn": "他认同为男性，并使用他/他的代词。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characteristic of men or males, including physical traits, roles, or behaviors traditionally associated with masculinity.",
      "explanation_cn": "与男性或雄性相关或具有其特征的，包括传统上与男性气质相关的身体特征、角色或行为。",
      "example_en": "The room was decorated in male colors like navy blue and charcoal gray.",
      "example_cn": "这个房间用深蓝色和炭灰色等男性化色调装饰。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used to describe the sex of an animal or plant that produces sperm or male gametes, as opposed to female.",
      "explanation_cn": "用于描述动物或植物中产生精子或雄性配子的性别，与雌性相对。",
      "example_en": "Male flowers lack pistils and contain only stamens.",
      "example_cn": "雄花没有雌蕊，只含有雄蕊。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "man",
      "analysis": "“Man” (男人) 通常特指成年男性人类，具有社会和文化含义，强调身份和年龄；而 “male” 是更中性、更生物学的术语，可用于人类、动物甚至植物，不隐含社会角色。例如，我们说 “a male lion”（雄狮），但不说 “a man lion”。"
    },
    {
      "word_to_compare": "masculine",
      "analysis": "“Masculine” (阳刚的) 描述的是符合传统男性气质的特质，如坚强、理性、果断，属于文化或心理范畴；而 “male” 是生物学或性别分类术语，不必然关联性格特征。一个男性（male）不一定表现得阳刚（masculine），反之亦然。"
    },
    {
      "word_to_compare": "boy",
      "analysis": "“Boy” (男孩) 指未成年男性，带有年龄限制；而 “male” 是一个无年龄限制的分类词，可指从幼崽到成年的所有雄性个体。例如，一个三岁的 male child 是男孩，但一个 50 岁的 male 是男性，不能称为 boy。"
    }
  ]
}