{
  "word": "managing",
  "pronunciation": "man·eej·ing",
  "concise_definition": "v. 管理, 经营, 应对, 设法完成",
  "forms": {
    "base_form": "manage",
    "third_person_singular": "manages",
    "past_tense": "managed",
    "past_participle": "managed",
    "present_participle": "managing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To be in charge of the operation, organization, or direction of a business, team, project, or system, often involving planning, decision-making, and oversight.",
      "explanation_cn": "负责某项业务、团队、项目或系统的运作、组织或指导，通常包括计划、决策和监督。",
      "example_en": "She is managing a team of 20 engineers developing a new AI platform.",
      "example_cn": "她正在管理一个由20名工程师组成的团队，开发一个全新的AI平台。"
    },
    {
      "pos": "verb",
      "explanation_en": "To handle or deal with a difficult situation, person, or task successfully, often with limited resources or under pressure.",
      "explanation_cn": "成功应对困难的情况、人物或任务，通常在资源有限或压力下完成。",
      "example_en": "He is managing his time well despite having two part-time jobs and a full-time course.",
      "example_cn": "尽管他同时打两份兼职并上全日制课程，他仍能很好地安排时间。"
    },
    {
      "pos": "verb",
      "explanation_en": "To control or direct something with skill, especially when it is complex or challenging (e.g., emotions, a vehicle, or a conversation).",
      "explanation_cn": "以技巧控制或引导某事物，尤其当其复杂或具有挑战性时（如情绪、车辆或对话）。",
      "example_en": "The pilot was managing the aircraft through severe turbulence with calm precision.",
      "example_cn": "飞行员以冷静而精准的操控应对了严重的气流颠簸。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "administering",
      "analysis": "“Administering”（管理/执行）更侧重于执行规章制度、分配资源或处理行政事务，常用于政府、法律或医疗体系中，强调程序性和规范性。而 “managing” 更广泛，包含战略规划、人员激励和动态调整，适用范围更广。"
    },
    {
      "word_to_compare": "leading",
      "analysis": "“Leading”（领导）强调激励、影响和引导他人朝着共同目标前进，注重人际关系和愿景传达。而 “managing” 更关注任务执行、流程控制和效率维持，偏向操作层面。一个优秀的领导者可能不擅长管理，反之亦然。"
    },
    {
      "word_to_compare": "handling",
      "analysis": "“Handling”（处理）语气更轻，常用于应对具体事件或临时问题，如“handling a complaint”（处理投诉），强调应对能力而非系统性控制。“Managing” 则暗示持续性、全面性和责任性，范围更广、程度更深。"
    }
  ]
}