{
  "word": "mandarin",
  "pronunciation": "man·duh·rin",
  "concise_definition": "n. 普通话, 官话; n. (历史) 明清时期的官员; adj. 普通话的, 官话的",
  "forms": {
    "plural": "mandarins"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The standard form of Chinese spoken in China and Taiwan, based on the Beijing dialect and used as the official language of the People's Republic of China and the Republic of China (Taiwan).",
      "explanation_cn": "指以北京话为基础的现代标准汉语，是中国大陆和台湾的官方语言，也是全球华人社会最广泛使用的汉语标准形式。",
      "example_en": "She is fluent in Mandarin and uses it daily in her business meetings.",
      "example_cn": "她能流利地说普通话，并在日常商务会议中使用。"
    },
    {
      "pos": "noun",
      "explanation_en": "A high-ranking official in imperial China, especially during the Ming and Qing dynasties, who was selected through civil service examinations and governed provinces or departments.",
      "explanation_cn": "指中国明清时期通过科举考试选拔的高级官员，负责管理省份或政府部门，常被称为‘官僚’或‘士大夫’。",
      "example_en": "The ancient palace was once the residence of a powerful mandarin who controlled trade along the Yangtze River.",
      "example_cn": "这座古宫殿曾是一位掌控长江沿岸贸易的显赫官员的府邸。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characteristic of Mandarin Chinese, especially in terms of language, pronunciation, or usage.",
      "explanation_cn": "指与普通话相关的或具有普通话特征的，尤指语言、发音或用法方面。",
      "example_en": "The textbook includes a Mandarin pronunciation guide for beginners.",
      "example_cn": "这本教材为初学者提供了普通话发音指南。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "Chinese",
      "analysis": "“Chinese” (汉语/中文) 是一个总称，泛指所有汉语方言，包括粤语、闽南语、吴语等。而 “Mandarin” 是其中一种特定的方言，即现代标准汉语，是官方和教育系统中使用的标准形式。因此，所有 Mandarin 都是 Chinese，但并非所有 Chinese 都是 Mandarin。"
    },
    {
      "word_to_compare": "dialect",
      "analysis": "“Dialect” (方言) 是指某一地区或社会群体使用的语言变体，通常与标准语相对。Mandarin 本身是一种方言（北京方言）发展而来的标准语，但在现代语境中，它已超越了‘方言’的范畴，成为国家官方语言，因此不能简单等同于一般意义上的方言。"
    },
    {
      "word_to_compare": "officer",
      "analysis": "“Officer” (官员) 是一个通用词，泛指任何政府或军队中的任职人员。而 “mandarin” 是特指中国帝制时代通过科举制度选拔的文官，具有深厚的文化和历史背景，带有特定的东方官僚体系色彩，不能直接与现代意义上的 ‘officer’ 混用。"
    }
  ]
}