{
  "word": "mandate",
  "pronunciation": "man·deyt",
  "concise_definition": "n. 授权, 委任, 指令; v. 授权, 委任",
  "forms": {
    "plural": "mandates",
    "third_person_singular": "mandates",
    "past_tense": "mandated",
    "past_participle": "mandated",
    "present_participle": "mandating"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An official order or authority given by a higher power or elected body to carry out a specific action or policy, often reflecting the will of the people or a legal requirement.",
      "explanation_cn": "指由上级权力机构或民选机构授予的正式命令或授权，用于执行特定行动或政策，通常反映人民的意愿或法律要求。",
      "example_en": "The new government claims a clear mandate to reform the healthcare system.",
      "example_cn": "新政府声称拥有明确的授权来改革医疗体系。"
    },
    {
      "pos": "noun",
      "explanation_en": "A formal instruction or requirement imposed by law, regulation, or policy, often compulsory in nature.",
      "explanation_cn": "指由法律、法规或政策强制施加的正式指令或要求，通常具有强制性。",
      "example_en": "The law imposes a mandate that all children must attend school until the age of 16.",
      "example_cn": "法律规定所有儿童必须接受教育至16岁。"
    },
    {
      "pos": "verb",
      "explanation_en": "To officially authorize or empower someone or an organization to act on behalf of another, especially in a formal or legal context.",
      "explanation_cn": "指正式授权某人或某组织代表他人行事，尤其在正式或法律语境中。",
      "example_en": "The constitution mandates the president to deliver an annual address to Congress.",
      "example_cn": "宪法规定总统必须向国会发表年度讲话。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "order",
      "analysis": "“Order” (命令) 通常指由权威人物直接下达的指令，语气更直接、更个人化，不一定具有法律或民主合法性。而 “mandate” 强调授权的合法性来源，如选举、法律或制度性授权，更具广泛性和正当性。"
    },
    {
      "word_to_compare": "directive",
      "analysis": "“Directive” (指示) 多用于组织或行政体系内部，是上级对下级的指导性文件，通常不具法律强制力，而 “mandate” 常具有法律效力或来自公众授权，权威性更强。"
    },
    {
      "word_to_compare": "commission",
      "analysis": "“Commission” (委任) 侧重于授予某人特定职责或任务，常用于任命官员或成立委员会，强调角色的设立；而 “mandate” 更强调任务背后的授权依据和权力来源，如选民赋予的政治使命。"
    }
  ]
}