{
  "word": "maneuver",
  "pronunciation": "muh·noo·vur",
  "concise_definition": "n. 机动, 操纵, 策略; v. 机动, 操纵, 策划",
  "forms": {
    "third_person_singular": "maneuvers",
    "past_tense": "maneuvered",
    "past_participle": "maneuvered",
    "present_participle": "maneuvering"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A carefully planned and skillful movement or action, especially one designed to gain an advantage in a competitive or complex situation.",
      "explanation_cn": "指经过精心策划、技巧娴熟的行动或移动，尤其用于在竞争或复杂情境中获取优势。",
      "example_en": "The politician's maneuver to win public support was both clever and controversial.",
      "example_cn": "这位政客为赢得公众支持所采取的策略既巧妙又富有争议。"
    },
    {
      "pos": "noun",
      "explanation_en": "A tactical movement, especially by military forces or vehicles, to reposition for strategic advantage.",
      "explanation_cn": "指军事力量或车辆为取得战略优势而进行的战术性调动或机动。",
      "example_en": "The tank's rapid maneuver around the hill caught the enemy off guard.",
      "example_cn": "坦克迅速绕过山丘的机动行动使敌人措手不及。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or direct something, especially with skill and care, often in a confined or difficult space.",
      "explanation_cn": "指以技巧和谨慎的方式移动或引导某物，尤其在狭小或困难的空间中。",
      "example_en": "She maneuvered the car into the tight parking spot without hitting the curb.",
      "example_cn": "她巧妙地将车停进了狭小的停车位，没有碰到路缘。"
    },
    {
      "pos": "verb",
      "explanation_en": "To handle or control a situation through clever or indirect means, often to achieve a desired outcome.",
      "explanation_cn": "指通过巧妙或间接的手段处理或控制局势，通常是为了达成预期结果。",
      "example_en": "He maneuvered his way into the boardroom by building alliances with key stakeholders.",
      "example_cn": "他通过与关键利益相关者建立联盟，巧妙地进入了董事会。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "move",
      "analysis": "“Move” (移动) 是一个通用词，泛指任何位置的变化，不强调技巧或策略性。而 “maneuver” 特指有目的、有技巧的移动，常用于复杂或受限环境中，带有战略意图。"
    },
    {
      "word_to_compare": "manipulate",
      "analysis": "“Manipulate” (操纵) 常带有负面含义，指不正当或欺骗性地控制他人或局势。而 “maneuver” 可以是中性或正面的，强调智慧和策略，不一定涉及道德瑕疵。"
    },
    {
      "word_to_compare": "tactic",
      "analysis": "“Tactic” (战术) 是一个名词，指为实现目标而采用的具体方法或手段，是 “maneuver” 的抽象概念。而 “maneuver” 既可以是名词（具体行动）也可以是动词（执行该行动），更强调实际操作和动态过程。"
    }
  ]
}