{
  "word": "manhood",
  "pronunciation": "man·hood",
  "concise_definition": "n. 男子气概, 男性身份, 成年男性阶段",
  "forms": {
    "plural": "manhoods"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The state or condition of being a man, especially in terms of maturity, responsibility, and the qualities traditionally associated with adult males such as courage, strength, and integrity.",
      "explanation_cn": "指成为男子汉的状态或条件，尤其指成熟、责任感以及传统上与成年男性相关的品质，如勇气、力量和正直。",
      "example_en": "He entered manhood after graduating from college and taking his first full-time job.",
      "example_cn": "他在大学毕业并找到第一份全职工作后，步入了成年男子的阶段。"
    },
    {
      "pos": "noun",
      "explanation_en": "The collective identity or social role of men as a group, often invoked in discussions about gender norms, expectations, and cultural ideals of masculinity.",
      "explanation_cn": "指男性作为一个群体的集体身份或社会角色，常用于讨论性别规范、社会期望以及关于男子气概的文化理想。",
      "example_en": "The film explores the pressures of modern manhood and the cost of suppressing emotions.",
      "example_cn": "这部电影探讨了现代男子气概的压力以及压抑情感的代价。"
    },
    {
      "pos": "noun",
      "explanation_en": "The period of life during which a male is considered an adult, typically following puberty and the transition from boyhood.",
      "explanation_cn": "指男性从青春期后进入成年阶段的时期，通常是从男孩向成年男性的过渡阶段。",
      "example_en": "In many cultures, rites of passage mark the transition from boyhood to manhood.",
      "example_cn": "在许多文化中，成年礼标志着从男孩到男子汉的转变。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "masculinity",
      "analysis": "“Masculinity”（男性气质）更侧重于社会文化建构的男性特质，如坚强、理性、主导等，常用于性别研究，强调其可变性和社会性。而 “manhood” 更强调个体作为男性所处的完整身份状态或人生阶段，包含情感、责任与社会角色的综合体现。"
    },
    {
      "word_to_compare": "adulthood",
      "analysis": "“Adulthood”（成年）是中性词，泛指任何性别的成年阶段，强调法律或生理上的成熟。而 “manhood” 专指男性的成年身份，带有性别特定的文化内涵和期望，不适用于女性。"
    },
    {
      "word_to_compare": "boyhood",
      "analysis": "“Boyhood”（童年/少年时期）是 “manhood” 的对立面，指男性从出生到青春期前的阶段，强调天真、依赖与未成熟。两者构成人生阶段的对比：boyhood 是成长的起点，manhood 是成熟的目标。"
    }
  ]
}