{
  "word": "manipulating",
  "pronunciation": "muh·nip·yuh·leyt-ing",
  "concise_definition": "v. 操纵, 控制, 巧妙处理",
  "forms": {
    "base_form": "manipulate",
    "third_person_singular": "manipulates",
    "past_tense": "manipulated",
    "past_participle": "manipulated",
    "present_participle": "manipulating"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To control or influence someone or something, often in a clever, unfair, or deceptive way, to achieve a desired outcome.",
      "explanation_cn": "以巧妙、不公正或欺骗性的方式控制或影响某人或某事物，以达成特定目的。",
      "example_en": "The politician was accused of manipulating public opinion through misleading advertisements.",
      "example_cn": "这位政治家被指控通过误导性广告操纵公众舆论。"
    },
    {
      "pos": "verb",
      "explanation_en": "To handle or control something, especially a tool, object, or system, with skill or dexterity, often in a physical sense.",
      "explanation_cn": "以熟练或灵巧的方式操作或控制某物，尤指物理层面的处理，如工具、设备或系统。",
      "example_en": "The surgeon was manipulating the tiny instruments with remarkable precision.",
      "example_cn": "外科医生以惊人的精确度操纵着微型器械。"
    },
    {
      "pos": "verb",
      "explanation_en": "To alter or adjust data, information, or systems in a way that distorts their original meaning or purpose, often for personal gain.",
      "explanation_cn": "以扭曲原始含义或目的的方式修改数据、信息或系统，通常是为了个人利益。",
      "example_en": "The accountant was fired for manipulating financial records to hide losses.",
      "example_cn": "该会计因篡改财务记录以掩盖亏损而被解雇。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "influencing",
      "analysis": "“Influencing”（影响）通常指通过说服、建议或环境作用使他人改变想法或行为，不一定带有欺骗性或强制性，语义较中性。而 “manipulating” 暗含了不诚实、操控和利用他人弱点的负面含义，具有更强的道德贬义。"
    },
    {
      "word_to_compare": "controlling",
      "analysis": "“Controlling”（控制）强调对人或事的直接支配或限制，可以是权威性的（如父母管教孩子）或制度性的（如政府管控）。而 “manipulating” 更侧重于间接、隐蔽、心理层面的操控，常通过误导或情感操纵实现目的，而非直接命令。"
    },
    {
      "word_to_compare": "handling",
      "analysis": "“Handling”（处理）是一个中性词，指对事物进行操作或管理，强调技巧与能力，如“handling a difficult client”（处理难缠的客户）。它不包含操纵的意图或道德评判。而 “manipulating” 在涉及人时，几乎总是带有负面意图，暗示利用或欺骗。"
    }
  ]
}