{
  "word": "manila",
  "pronunciation": "muh·nee·luh",
  "concise_definition": "n. 马尼拉麻, 马尼拉纸, 菲律宾马尼拉",
  "forms": {
    "plural": "manilas"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A strong, coarse fiber obtained from the leaves of the abacá plant, native to the Philippines, used historically for making ropes, sacks, and paper.",
      "explanation_cn": "一种从菲律宾原产的蕉麻植物叶片中提取的强韧粗纤维，历史上用于制作绳索、麻袋和纸张。",
      "example_en": "The old documents were stored in manila envelopes for durability.",
      "example_cn": "这些旧文件被存放在马尼拉纸信封中以增强耐用性。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of thick, unbleached paper made from manila fiber, typically tan or buff in color, commonly used for file folders and envelopes.",
      "explanation_cn": "一种用马尼拉麻纤维制成的厚实未漂白纸张，通常呈浅棕色或米黄色，常用于文件夹和信封。",
      "example_en": "She sorted the receipts into manila folders labeled by month.",
      "example_cn": "她将收据按月份分类，放入马尼拉纸文件夹中。"
    },
    {
      "pos": "noun",
      "explanation_en": "The capital city of the Philippines, located on the island of Luzon, known for its colonial architecture, bustling markets, and historical significance.",
      "explanation_cn": "菲律宾的首都，位于吕宋岛，以其殖民时期建筑、繁华市场和历史重要性而闻名。",
      "example_en": "Manila is a vibrant metropolis with a rich blend of Spanish, American, and Asian influences.",
      "example_cn": "马尼拉是一座充满活力的大都市，融合了西班牙、美国和亚洲的多元文化影响。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "kraft",
      "analysis": "“Kraft”（牛皮纸）是一种由化学木浆制成的强韧纸张，通常呈棕色，广泛用于包装和信封。与 “manila” 相比，kraft 纸的原料是木材，而 manila 纸传统上使用蕉麻纤维，质地更粗糙、更耐用，颜色也更偏黄褐。现代 “manila” 纸常以木浆仿制，但名称仍保留其历史来源。"
    },
    {
      "word_to_compare": "cotton",
      "analysis": "“Cotton”（棉）是一种天然植物纤维，质地柔软，常用于纺织品和高级纸张。与 “manila” 的粗硬、耐用特性不同，棉纤维更细腻、吸水性更强，多用于档案级纸张或钞票纸，而非日常文件夹。Manila 纸强调实用性与经济性，而棉纸强调耐久性与品质。"
    },
    {
      "word_to_compare": " Manila Bay",
      "analysis": "“Manila Bay”（马尼拉湾）是菲律宾吕宋岛西侧的地理区域，与城市 “Manila” 密切相关，但并非同一概念。Manila 指城市或材料，而 Manila Bay 是水域名称，常出现在历史事件（如美西战争）或旅游语境中。两者虽共享名称，但语义范畴完全不同：一个是人文地理实体，一个是材料或城市名。"
    }
  ]
}