{
  "word": "mania",
  "pronunciation": "mey·nee·uh",
  "concise_definition": "n. 狂热, 痴迷, 精神错乱",
  "forms": {
    "plural": "manias"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An intense and often irrational enthusiasm or obsession with a particular activity, idea, or object, typically to an excessive or uncontrolled degree.",
      "explanation_cn": "指对某种活动、想法或物体产生强烈而常常非理性的热情或痴迷，通常达到过度或失控的程度。",
      "example_en": "The 1980s saw a rubber duck collecting mania among children in Europe.",
      "example_cn": "20世纪80年代，欧洲儿童中曾掀起一股收集橡胶鸭子的狂热。"
    },
    {
      "pos": "noun",
      "explanation_en": "A clinical psychiatric condition characterized by periods of abnormally elevated mood, increased energy, and impulsive behavior, often associated with bipolar disorder.",
      "explanation_cn": "一种临床精神疾病，表现为情绪异常高涨、精力过度旺盛和冲动行为，常与双相情感障碍相关。",
      "example_en": "After weeks of sleepless nights and reckless spending, she was diagnosed with manic episodes.",
      "example_cn": "在经历了数周的失眠和挥霍无度后，她被诊断出患有躁狂发作。"
    },
    {
      "pos": "noun",
      "explanation_en": "A historical or archaic term for a mental disorder or madness, especially when used in compound forms like 'pyromania' or 'kleptomania'.",
      "explanation_cn": "一个历史或古语用法，指某种精神障碍或疯狂状态，尤其用于如 'pyromania'（纵火癖）或 'kleptomania'（偷窃癖）等复合词中。",
      "example_en": "His compulsive urge to set fires was labeled as pyromania by the psychiatrist.",
      "example_cn": "精神科医生将他那种无法控制的纵火冲动诊断为纵火癖。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "frenzy",
      "analysis": "“Frenzy”（狂乱）强调一种短暂、激烈、失去理智的激动状态，通常是突发的、情绪化的，如人群的骚乱或恐慌。而 “mania” 更具持续性和系统性，可能是一种长期的痴迷或病理性的心理状态。"
    },
    {
      "word_to_compare": "obsession",
      "analysis": "“Obsession”（执念）指反复出现、难以摆脱的思想或冲动，常带有焦虑或强迫色彩，多用于心理学术语。而 “mania” 不仅包含执念，还常伴随外显的亢奋行为、能量过剩，甚至临床诊断意义，语义范围更广、强度更高。"
    },
    {
      "word_to_compare": "enthusiasm",
      "analysis": "“Enthusiasm”（热情）是中性或正面的词，指对某事物的积极兴趣和投入，通常理性且可控。而 “mania” 带有贬义或病理色彩，暗示过度、非理性甚至危险的沉迷，是热情的极端化形式。"
    }
  ]
}