{
  "word": "mantle",
  "pronunciation": "man·tul",
  "concise_definition": "n. 披风, 外套; 覆盖层; 职责; v. 以披风覆盖, 承担",
  "forms": {
    "plural": "mantles",
    "third_person_singular": "mantles",
    "past_tense": "mantled",
    "past_participle": "mantled",
    "present_participle": "mantling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A loose, sleeveless cloak or garment worn over other clothing, often symbolizing authority, dignity, or ceremonial status.",
      "explanation_cn": "一种无袖、宽松的外衣，披在其他衣物之外，常象征权威、尊严或仪式性地位。",
      "example_en": "The queen wore a velvet mantle embroidered with gold thread.",
      "example_cn": "女王身披一件绣有金线的天鹅绒披风。"
    },
    {
      "pos": "noun",
      "explanation_en": "A layer or covering that lies over something else, especially a natural geological layer between the Earth's crust and core.",
      "explanation_cn": "指覆盖在某物之上的层状结构，尤指地球内部位于地壳与地核之间的地质层。",
      "example_en": "The Earth's mantle is composed mostly of silicate rocks rich in iron and magnesium.",
      "example_cn": "地球的地幔主要由富含铁和镁的硅酸盐岩石组成。"
    },
    {
      "pos": "noun",
      "explanation_en": "A responsibility, role, or authority that is passed from one person or group to another, often implying a transfer of power or duty.",
      "explanation_cn": "指从一个人或群体传递给另一个人或群体的责任、角色或权威，常暗示权力或职责的交接。",
      "example_en": "With the old mayor's retirement, the young councilwoman assumed the mantle of leadership.",
      "example_cn": "随着老市长退休，这位年轻的市议员接过了领导的重任。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover or envelop something as if with a mantle, often metaphorically to assume a role or responsibility.",
      "explanation_cn": "以披风或覆盖物的形式遮盖或包裹某物，常用于比喻性地承担某种角色或责任。",
      "example_en": "The fog mantled the valley in a silent, ghostly veil.",
      "example_cn": "薄雾如轻纱般笼罩着山谷，寂静而幽灵般。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cloak",
      "analysis": "“Cloak”（斗篷）与 “mantle” 在作为衣物时意义相近，但 “cloak” 更常用于遮蔽、隐藏或伪装（如 ‘cloak of secrecy’），而 “mantle” 更强调象征性的权威或正式地位，语义更庄重。"
    },
    {
      "word_to_compare": "layer",
      "analysis": "“Layer”（层）是中性、通用的术语，用于描述任何分层结构，如皮肤层、数据层。而 “mantle” 在地质学中特指地球的中间层，且在比喻义中带有文化或权力传承的厚重感，语义更具体、更具象征性。"
    },
    {
      "word_to_compare": "burden",
      "analysis": "“Burden”（负担）强调责任带来的压力或沉重感，常含消极含义；而 “mantle” 在表示职责时，虽也指承担重任，但更强调荣誉、传承与正当性，语义更积极、庄重。"
    }
  ]
}