{
  "word": "manure",
  "pronunciation": "muh·noor",
  "concise_definition": "n. 粪肥, 肥料; v. 施粪肥, 肥沃",
  "forms": {
    "plural": "manures",
    "third_person_singular": "manures",
    "past_tense": "manured",
    "past_participle": "manured",
    "present_participle": "manuring"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Animal excrement, especially when used as a fertilizer to enrich soil with nutrients for plant growth.",
      "explanation_cn": "动物粪便，尤指用作肥料以增加土壤养分、促进植物生长的物质。",
      "example_en": "Farmers spread manure on their fields to improve crop yields.",
      "example_cn": "农民在田地里施用粪肥以提高作物产量。"
    },
    {
      "pos": "noun",
      "explanation_en": "Any organic or inorganic material used to improve soil fertility, sometimes used loosely to refer to compost or other nutrient-rich substances.",
      "explanation_cn": "泛指任何用于改善土壤肥力的有机或无机物质，有时也宽松地指堆肥或其他富含养分的物质。",
      "example_en": "The garden was fertilized with a mixture of manure and leaf mold.",
      "example_cn": "花园里施用了粪肥与腐叶土的混合物。"
    },
    {
      "pos": "verb",
      "explanation_en": "To apply manure or other fertilizers to land in order to improve its fertility and support plant growth.",
      "explanation_cn": "将粪肥或其他肥料施用于土地，以提高其肥力并促进植物生长。",
      "example_en": "They manured the soil before planting the vegetables.",
      "example_cn": "他们在种植蔬菜之前给土壤施了肥。"
    },
    {
      "pos": "verb",
      "explanation_en": "To enrich or improve something, often metaphorically, as if by adding nutrients.",
      "explanation_cn": "比喻性地指使某事物变得丰富或改善，如同添加养分一般。",
      "example_en": "The new policy manured the economy with fresh investment.",
      "example_cn": "这项新政策为经济注入了新的投资，使其得以振兴。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fertilizer",
      "analysis": "“Fertilizer” (肥料) 是一个更广泛的术语，包括所有用于提供植物养分的化学或有机物质，如合成氮磷钾肥。而 “manure” 特指动物粪便或有机废弃物制成的天然肥料，属于 “fertilizer” 的一种子类。"
    },
    {
      "word_to_compare": "compost",
      "analysis": "“Compost” (堆肥) 是由植物残体、厨余等有机物经微生物分解后形成的腐殖质，强调自然降解过程；而 “manure” 主要来源于动物排泄物，通常未经完全分解，养分浓度更高，但可能含有杂草种子或病原体。"
    },
    {
      "word_to_compare": "dung",
      "analysis": "“Dung” (粪便) 是一个更口语化、更直接的词，仅指动物的排泄物本身，不强调其用途；而 “manure” 专指被用作肥料的粪便，带有农业应用的语义色彩，是功能导向的术语。"
    }
  ]
}