{
  "word": "manual",
  "pronunciation": "man·choo·uhl",
  "concise_definition": "n. 手册, 指南; adj. 手动的, 用手操作的",
  "forms": {
    "plural": "manuals",
    "comparative": "more manual",
    "superlative": "most manual"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A written guide or instruction booklet that provides detailed information on how to use, operate, or maintain a device, system, or process.",
      "explanation_cn": "指一份书面指南或使用手册，提供关于如何使用、操作或维护某设备、系统或流程的详细信息。",
      "example_en": "The car came with a comprehensive manual explaining all its features.",
      "example_cn": "这辆车附带了一份详尽的手册，解释了所有功能。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who performs tasks by hand rather than by machine or automation, especially in contrast to automated systems.",
      "explanation_cn": "指通过手工而非机器或自动化方式完成任务的人，常用于与自动化系统相对比的语境。",
      "example_en": "Despite advances in robotics, many factories still rely on manual labor for delicate assembly work.",
      "example_cn": "尽管机器人技术取得了进步，许多工厂仍依赖手工劳动进行精细装配。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Performed or controlled by hand rather than automatically or electronically; not automated.",
      "explanation_cn": "指由人手操作或控制，而非自动或电子方式完成的；非自动化的。",
      "example_en": "She prefers a manual transmission because it gives her more control over the car.",
      "example_cn": "她更喜欢手动挡，因为这样能让她对汽车有更多控制。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "guide",
      "analysis": "“Guide”（指南）是一个更宽泛的词，泛指任何提供方向或建议的材料，可以是口头、视觉或非正式的，如旅游指南、生活指南。而 “manual” 更强调技术性、操作性和系统性，通常为书面、标准化的使用说明，具有权威性和强制性。"
    },
    {
      "word_to_compare": "handbook",
      "analysis": "“Handbook”（手册）与 “manual” 非常接近，常可互换，但 “handbook” 更侧重于综合性知识的汇编，内容可能涵盖理论、政策、规范等，适用于教育或组织环境；而 “manual” 更专注于操作步骤和实用技巧，常用于设备、软件或机械的使用说明。"
    },
    {
      "word_to_compare": "automatic",
      "analysis": "“Automatic”（自动的）是 “manual” 的反义词，强调无需人为干预即可运行。在技术语境中，对比 “manual transmission” 和 “automatic transmission” 可清晰体现二者的核心差异：前者依赖驾驶员操作，后者由系统自动完成。"
    }
  ]
}