{
  "word": "maori",
  "pronunciation": "mow·ree",
  "concise_definition": "n. 毛利人, 毛利语; adj. 毛利人的",
  "forms": {
    "plural": "Maoris"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A member of the indigenous Polynesian people of New Zealand, with a rich cultural heritage including traditional arts, oral history, and spiritual beliefs centered on ancestral connections and the natural world.",
      "explanation_cn": "新西兰的原住民波利尼西亚人，拥有丰富的文化遗产，包括传统艺术、口述历史以及以祖先联系和自然世界为核心的信仰体系。",
      "example_en": "The Maori people have preserved their language and customs despite centuries of colonization.",
      "example_cn": "尽管经历了数个世纪的殖民，毛利人仍保留了他们的语言和习俗。"
    },
    {
      "pos": "noun",
      "explanation_en": "The language spoken by the indigenous Maori people of New Zealand, which is one of the country's official languages and features a unique phonology and rich oral literature.",
      "explanation_cn": "新西兰原住民毛利人所使用的语言，是该国官方语言之一，具有独特的语音系统和丰富的口头文学传统。",
      "example_en": "Schools in New Zealand now teach children to speak and write in Maori as part of cultural revitalization efforts.",
      "example_cn": "新西兰的学校现在将毛利语的听说读写纳入教学，作为文化复兴的一部分。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to the Maori people, their culture, language, or traditions.",
      "explanation_cn": "与毛利人、其文化、语言或传统相关的。",
      "example_en": "The meeting opened with a traditional Maori welcome ceremony called a powhiri.",
      "example_cn": "会议以一场名为 'powhiri' 的传统毛利欢迎仪式开场。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "indigenous",
      "analysis": "“Indigenous”（土著的）是一个通用术语，指任何地区原住民的群体或事物，如美洲原住民、澳大利亚原住民等。而 “Maori” 是特指新西兰的原住民族群，是专有名词，具有明确的地理和文化边界。"
    },
    {
      "word_to_compare": "Polynesian",
      "analysis": "“Polynesian”（波利尼西亚的）是一个更大的语言文化族群分类，涵盖夏威夷、塔希提、萨摩亚、汤加等众多岛屿的民族。Maori 是 Polynesian 的一个分支，因此所有 Maori 人都是 Polynesian，但并非所有 Polynesian 人都是 Maori。"
    },
    {
      "word_to_compare": "native",
      "analysis": "“Native”（本地的/土生的）是一个泛指某地原生或原住的形容词，可用于动植物或人群，如 “native plant” 或 “native speaker”。而 “Maori” 是一个具体民族的名称，具有历史、政治和文化身份的特定含义，不能简单等同于 “native”。"
    }
  ]
}