{
  "word": "mara",
  "pronunciation": "muh·ruh",
  "concise_definition": "n. （专有名词）玛拉（人名、地名或神话中的名称）",
  "forms": {
    "plural": "Maras"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A proper noun used as a personal name, often of Hebrew or biblical origin, meaning 'bitterness' or 'sadness'. In the Bible, Naomi refers to herself as Mara after experiencing great loss.",
      "explanation_cn": "一个专有名词，常作为人名使用，源自希伯来语或《圣经》，意为‘苦涩’或‘悲伤’。在《圣经》中，拿俄米在经历巨大悲痛后称自己为玛拉。",
      "example_en": "In the Book of Ruth, Naomi says, 'Call me Mara, for the Almighty has made my life very bitter.'",
      "example_cn": "在《路得记》中，拿俄米说：‘叫我玛拉吧，因为全能者使我受尽苦楚。’"
    },
    {
      "pos": "noun",
      "explanation_en": "A name used in various mythologies and modern fiction to denote a female figure associated with darkness, sorrow, or supernatural power.",
      "explanation_cn": "在多种神话和现代虚构作品中，用作指代与黑暗、悲伤或超自然力量相关的女性角色之名。",
      "example_en": "In the fantasy novel, Mara the Shadowweaver was feared for her ability to drain hope from entire villages.",
      "example_cn": "在这部奇幻小说中，阴影编织者玛拉因其能从整个村庄吸走希望而令人畏惧。"
    },
    {
      "pos": "noun",
      "explanation_en": "A geographical name, such as Mara River in East Africa, known for its role in the Great Migration of wildebeest and zebras.",
      "explanation_cn": "一个地理名称，例如东非的马拉河，以其在角马和斑马大迁徙中的关键作用而闻名。",
      "example_en": "The annual crossing of the Mara River is one of the most dramatic events in the Serengeti ecosystem.",
      "example_cn": "每年马拉河的渡河是塞伦盖蒂生态系统中最壮观的事件之一。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bitter",
      "analysis": "“Bitter”（苦的）是一个形容词，描述味道或情绪上的苦涩，而 “Mara” 是一个专有名词，虽然其词源含义为‘苦涩’，但作为名称使用时已脱离形容词功能，承载文化与象征意义。"
    },
    {
      "word_to_compare": "sorrow",
      "analysis": "“Sorrow”（悲伤）是抽象名词，表达一种情感状态；而 “Mara” 是具体的人名或地名，虽可象征悲伤，但本身是实体指称，不直接等同于情感概念。"
    },
    {
      "word_to_compare": "name",
      "analysis": "“Name”（名字）是通用词，泛指任何称谓；而 “Mara” 是一个具有特定文化、宗教或地理背景的专有名词，其意义依赖于语境，不能作为普通名词使用。"
    }
  ]
}