{
  "word": "march",
  "pronunciation": "mahrch",
  "concise_definition": "v. 行军, 步行; n. 三月, 行进",
  "forms": {
    "third_person_singular": "marches",
    "past_tense": "marched",
    "past_participle": "marched",
    "present_participle": "marching"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To walk in a steady, rhythmic, and often military manner, typically in formation and with purposeful steps.",
      "explanation_cn": "以稳定、有节奏、通常是军事化的方式行走，通常成队列行进，步伐坚定有力。",
      "example_en": "The soldiers marched in perfect formation through the city square.",
      "example_cn": "士兵们整齐列队穿过城市广场。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move forward in a determined or forceful way, often to express protest or support for a cause.",
      "explanation_cn": "以坚定或有力的方式前进，通常用于表达抗议或支持某项事业。",
      "example_en": "Thousands marched in the streets to demand climate action.",
      "example_cn": "成千上万的人走上街头，要求采取气候行动。"
    },
    {
      "pos": "noun",
      "explanation_en": "The third month of the year in the Gregorian calendar, following February and preceding April.",
      "explanation_cn": "公历中的第三个月，位于二月之后、四月之前。",
      "example_en": "The flowers begin to bloom in March as spring arrives.",
      "example_cn": "随着春天的到来，三月里花朵开始绽放。"
    },
    {
      "pos": "noun",
      "explanation_en": "A steady, rhythmic walking or procession, especially one done in a group for a specific purpose.",
      "explanation_cn": "一种有节奏的、持续的行走或游行，尤指一群人为了特定目的而进行的集体行进。",
      "example_en": "The annual charity march raised over a million dollars this year.",
      "example_cn": "今年的年度慈善游行筹集了超过一百万美元。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "walk",
      "analysis": "“Walk” (走路) 是最普通的行走方式，无特定节奏或目的，可随意进行。而 “march” 强调有组织、有节奏、有目的的行进，常带有军事、抗议或仪式色彩，动作更统一、更有力。"
    },
    {
      "word_to_compare": "parade",
      "analysis": "“Parade” (游行) 通常指为庆祝或展示而举行的盛大、装饰性的队伍行进，包含表演、花车、音乐等元素，更注重观赏性。而 “march” 更强调行进本身，常与抗议、纪律或军事行动相关，形式更严肃、简洁。"
    },
    {
      "word_to_compare": "advance",
      "analysis": "“Advance” (前进) 是一个更广泛的词，可指物理上的移动、进展或提升，不一定是步行，也不一定有节奏。而 “march” 特指以脚步进行的、有规律的前进，常隐含集体性和纪律性。"
    }
  ]
}