{
  "word": "marches",
  "pronunciation": "mahrch·iz",
  "concise_definition": "n. 行军, 游行, 三月; v. 行军, 游行, 步行",
  "forms": {
    "singular": "march",
    "third_person_singular": "marches",
    "past_tense": "marched",
    "past_participle": "marched",
    "present_participle": "marching"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A formal, organized, and often public procession of people walking together to express solidarity, protest, or support for a cause.",
      "explanation_cn": "指一群人有组织地、通常公开地列队步行，以表达团结、抗议或支持某项事业。",
      "example_en": "Thousands of people joined the marches demanding climate action.",
      "example_cn": "成千上万的人参加了要求采取气候行动的游行。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of soldiers moving in a disciplined, rhythmic manner, typically as part of military training or ceremony.",
      "explanation_cn": "指士兵以有纪律、有节奏的方式行进，通常作为军事训练或仪式的一部分。",
      "example_en": "The soldiers performed their morning marches with precision and pride.",
      "example_cn": "士兵们以精准和自豪的姿态进行晨间行军。"
    },
    {
      "pos": "noun",
      "explanation_en": "The third month of the year, following February and preceding April.",
      "explanation_cn": "一年中的第三个月，位于二月之后、四月之前。",
      "example_en": "The festival is held every year in March.",
      "example_cn": "这个节日每年三月举行。"
    },
    {
      "pos": "verb",
      "explanation_en": "To walk in a steady, rhythmic, and often military manner, typically in a group.",
      "explanation_cn": "以稳定、有节奏的方式行走，通常为群体行动，常带有军事色彩。",
      "example_en": "The protesters marched peacefully through the city center.",
      "example_cn": "抗议者和平地列队穿过市中心。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move forward in a determined, forceful, or continuous way, often implying progress or expansion.",
      "explanation_cn": "以坚定、有力或持续的方式前进，常暗示进展或扩张。",
      "example_en": "The company is marching toward its goal of becoming a market leader.",
      "example_cn": "该公司正坚定地朝着成为市场领导者的目标迈进。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "protest",
      "analysis": "“Protest” (抗议) 是一个更广泛的动词或名词，泛指任何形式的反对或表达不满，可以是静坐、示威、演讲等，不一定涉及行走。而 “march” 特指以步行列队的形式进行抗议，强调行动的组织性和集体性。"
    },
    {
      "word_to_compare": "parade",
      "analysis": "“Parade” (游行) 通常指庆祝性、娱乐性或仪式性的公开行进，如节日游行、胜利游行，强调装饰、表演和欢乐氛围。而 “march” 更常用于表达严肃目的，如政治诉求或军事训练，氛围更庄重、有纪律。"
    },
    {
      "word_to_compare": "advance",
      "analysis": "“Advance” (前进) 是一个更抽象的动词，可指物理上的移动，也可指进展、提升，如技术进步或谈判进展。它不强调行进方式或集体性。而 “march” 强调有节奏、有组织的步行，常带有军事或集体行动的意象。"
    }
  ]
}