{
  "word": "markers",
  "pronunciation": "mahr·kuhrz",
  "concise_definition": "n. 标记物, 标志, 记号, 检测指标",
  "forms": {
    "singular": "marker"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A physical object or symbol used to indicate a location, boundary, or point of interest, often for navigation or identification purposes.",
      "explanation_cn": "指用于指示位置、边界或兴趣点的实物或符号，常用于导航或识别目的。",
      "example_en": "The hikers followed the red markers along the trail to stay on course.",
      "example_cn": "徒步者沿着小径上的红色标记行进，以确保不迷路。"
    },
    {
      "pos": "noun",
      "explanation_en": "A tool or writing instrument, such as a felt-tip pen, used to make visible marks on surfaces, often with bold or permanent ink.",
      "explanation_cn": "指用于在表面留下明显痕迹的书写工具，如记号笔，通常使用浓烈或持久的墨水。",
      "example_en": "She used bright yellow markers to highlight key passages in the textbook.",
      "example_cn": "她用亮黄色的记号笔标出教科书中的重点段落。"
    },
    {
      "pos": "noun",
      "explanation_en": "A measurable indicator or sign used to assess a condition, progress, or characteristic, especially in medical, scientific, or economic contexts.",
      "explanation_cn": "指用于评估某种状况、进展或特征的可测量指标，尤其在医学、科学或经济领域中使用。",
      "example_en": "High cholesterol levels are a key marker for cardiovascular disease risk.",
      "example_cn": "高胆固醇水平是心血管疾病风险的重要指标。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that serves as a sign or symbol of a particular trend, era, or cultural phenomenon.",
      "explanation_cn": "指代表某种趋势、时代或文化现象的标志或象征物。",
      "example_en": "The rise of smartphones became a cultural marker of the early 21st century.",
      "example_cn": "智能手机的兴起成为21世纪初的一个文化标志。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sign",
      "analysis": "“Sign”（迹象/标志）更广泛，可指任何传达信息的符号或征兆，包括自然现象（如乌云是下雨的迹象）或人为符号（如交通标志）。而 “marker” 更强调作为具体、可识别的实体或测量点，常用于有目的的标记或量化评估。"
    },
    {
      "word_to_compare": "indicator",
      "analysis": "“Indicator”（指标）与 “marker” 在科学和医学语境中常可互换，但 “indicator” 更侧重于反映整体状态或趋势的统计性或功能性参数，如失业率是经济健康的指标；而 “marker” 更常用于指具体的生物或物理实体，如基因标记或路标。"
    },
    {
      "word_to_compare": "symbol",
      "analysis": "“Symbol”（象征）具有抽象和文化内涵，代表某种理念、信仰或价值（如鸽子象征和平），其意义是约定俗成的。而 “marker” 是功能性的、具体的，其作用是定位、识别或测量，而非表达深层含义。"
    },
    {
      "word_to_compare": "label",
      "analysis": "“Label”（标签）通常指贴在物体上用于分类、说明或识别的文字或代码，如商品标签。它强调信息的附着性与可读性，而 “marker” 更强调视觉或物理上的标记行为本身，可能不包含文字，如路标上的箭头。"
    }
  ]
}