{
  "word": "markings",
  "pronunciation": "mahr·kings",
  "concise_definition": "n. 标记, 记号, 图案, 标识",
  "forms": {
    "singular": "marking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Visible signs, symbols, or lines applied to a surface to convey information, indicate boundaries, or identify ownership or function.",
      "explanation_cn": "施加在表面上的可见符号、标记或线条，用于传达信息、指示边界或标识所有权与功能。",
      "example_en": "The runway had bright white markings to guide pilots during landing.",
      "example_cn": "跑道上有醒目的白色标记，以引导飞行员着陆。"
    },
    {
      "pos": "noun",
      "explanation_en": "Distinctive patterns or designs on an animal’s body, often used for identification, camouflage, or species recognition.",
      "explanation_cn": "动物身体上特有的图案或花纹，常用于识别个体、伪装或辨识物种。",
      "example_en": "The tiger’s black markings on its orange fur help it blend into the tall grass.",
      "example_cn": "老虎橙色皮毛上的黑色条纹有助于它融入高草丛中。"
    },
    {
      "pos": "noun",
      "explanation_en": "Signs of wear, damage, or use on an object, such as scratches, dents, or stains, often indicating age or history.",
      "explanation_cn": "物体表面因使用、磨损或损坏而留下的痕迹，如划痕、凹痕或污渍，常反映其年代或经历。",
      "example_en": "The antique vase had subtle markings from centuries of handling.",
      "example_cn": "这尊古董花瓶上有数百年把玩留下的细微痕迹。"
    },
    {
      "pos": "noun",
      "explanation_en": "In legal or official contexts, official stamps, seals, or labels affixed to documents or goods to certify authenticity, origin, or compliance.",
      "explanation_cn": "在法律或官方语境中，贴在文件或商品上以证明真实性、来源或合规性的官方印章、标签或标记。",
      "example_en": "The wine bottle bore official markings indicating it was produced in France.",
      "example_cn": "酒瓶上带有官方标记，表明其产自法国。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "symbols",
      "analysis": "“Symbols”（符号）是抽象的、约定俗成的代表物，通常不依赖物理痕迹，如交通标志中的三角形代表警告。而 “markings” 更强调物理或视觉上的具体痕迹，可以是手绘、刻印或自然形成的，范围更广，包括符号但不仅限于符号。"
    },
    {
      "word_to_compare": "labels",
      "analysis": "“Labels”（标签）通常是附着在物体上的纸质或塑料标识，包含文字或条形码，用于分类或说明，具有临时性和可移除性。而 “markings” 多为直接施加在表面的永久性痕迹，如油漆涂写、雕刻或天然花纹，不可轻易移除。"
    },
    {
      "word_to_compare": "signs",
      "analysis": "“Signs”（迹象/标志）常指某种现象或状态的间接证据，如“signs of illness”（疾病的征兆），更偏向抽象或隐含的含义。而 “markings” 是具体的、可见的物理痕迹，强调可观察的外在形式，而非推断的内在状态。"
    }
  ]
}