{
  "word": "marker",
  "pronunciation": "mahr·kuhr",
  "concise_definition": "n. 标记物, 标志, 记号笔, 玩具棋子",
  "forms": {
    "plural": "markers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An object or symbol used to indicate a position, boundary, or point of interest, often for identification or reference purposes.",
      "explanation_cn": "用于指示位置、边界或兴趣点的物体或符号，常用于识别或参考目的。",
      "example_en": "The surveyors placed a metal marker at the property boundary.",
      "example_cn": "测量员在地产边界处放置了一个金属标记物。"
    },
    {
      "pos": "noun",
      "explanation_en": "A pen or tool that applies colored ink for writing, highlighting, or drawing, typically with a broad or fine tip.",
      "explanation_cn": "一种用于书写、高亮或绘画的笔具，通常配有宽头或细头，能渗出彩色墨水。",
      "example_en": "She used a bright yellow marker to highlight key passages in the textbook.",
      "example_cn": "她用一支亮黄色记号笔标出了教科书中的重点段落。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small piece used to represent a player in board games or to track progress on a game board.",
      "explanation_cn": "用于棋盘游戏中代表玩家或追踪进度的小物件。",
      "example_en": "Each player moved their wooden marker along the path toward the finish line.",
      "example_cn": "每位玩家都移动自己的木制棋子沿着路径向终点前进。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that serves as an indicator or sign of a particular condition or trend, often in economic, social, or scientific contexts.",
      "explanation_cn": "在经济、社会或科学语境中，用作某种状况或趋势指示物的人或事物。",
      "example_en": "Rising carbon dioxide levels are a key marker of climate change.",
      "example_cn": "二氧化碳水平的上升是气候变化的关键指标。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sign",
      "analysis": "“Sign”（标志/信号）更广泛，可指自然或人为的任何表明某种意义的迹象，如路标、症状或手势。而 “marker” 更强调作为物理或视觉参照物的实体，常用于具体定位或量化追踪，如地图标记或生物标志物。"
    },
    {
      "word_to_compare": "label",
      "analysis": "“Label”（标签）通常指附着在物体上、以文字或符号形式提供分类、说明或身份信息的标识，如商品标签。而 “marker” 更侧重于指示位置或作为追踪工具，不一定包含文字信息，如路标或棋子。"
    },
    {
      "word_to_compare": "indicator",
      "analysis": "“Indicator”（指示器）多用于抽象或系统性语境，如经济指标、健康指标，强调功能性与测量性。而 “marker” 可以是物理实体，也可以是抽象指标，但更常用于具体、可观察的参照点，如生物标记物或游戏棋子。"
    }
  ]
}