{
  "word": "mark",
  "pronunciation": "mahrk",
  "concise_definition": "n. 标记, 成绩, 痕迹, 符号; v. 标记, 评分, 留下痕迹",
  "forms": {
    "third_person_singular": "marks",
    "past_tense": "marked",
    "past_participle": "marked",
    "present_participle": "marking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A visible impression, symbol, or sign left on a surface, often to indicate identity, location, or condition.",
      "explanation_cn": "指在表面上留下的可见痕迹、符号或印记，通常用于表示身份、位置或状态。",
      "example_en": "There was a deep mark on the table where the vase had been sitting.",
      "example_cn": "桌子上有块深深的痕迹，是花瓶曾经放过的痕迹。"
    },
    {
      "pos": "noun",
      "explanation_en": "A grade or score given to evaluate performance, especially in an academic or testing context.",
      "explanation_cn": "指用于评估表现的分数或等级，尤其在学业或考试情境中。",
      "example_en": "She received a perfect mark on her final exam.",
      "example_cn": "她在期末考试中得了满分。"
    },
    {
      "pos": "noun",
      "explanation_en": "A distinctive feature or characteristic that identifies something or someone.",
      "explanation_cn": "指能够识别某物或某人的显著特征或标志。",
      "example_en": "The mark of a true leader is the ability to inspire others.",
      "example_cn": "真正领导者的标志是能够激励他人。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a visible sign or symbol on something, often to indicate ownership, status, or a specific point.",
      "explanation_cn": "指在某物上做可见的记号，通常用于表示所有权、地位或特定位置。",
      "example_en": "He marked the pages he wanted to reread with sticky notes.",
      "example_cn": "他用便利贴标记了想要重读的页面。"
    },
    {
      "pos": "verb",
      "explanation_en": "To evaluate and assign a grade or score to someone's work, especially in an educational setting.",
      "explanation_cn": "指在教育环境中对某人的作业进行评估并给予分数或等级。",
      "example_en": "The teacher marked all the essays over the weekend.",
      "example_cn": "老师在周末批改了所有作文。"
    },
    {
      "pos": "verb",
      "explanation_en": "To notice or recognize something as significant or noteworthy.",
      "explanation_cn": "指注意到或意识到某事具有重要意义或值得注意。",
      "example_en": "Many observers marked the speech as a turning point in the campaign.",
      "example_cn": "许多观察家认为这场演讲是竞选活动的转折点。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sign",
      "analysis": "“Sign” (标志/迹象) 更侧重于传达信息或含义的符号，常用于抽象或象征性语境，如交通标志、症状迹象。而 “mark” 更强调物理上的痕迹或具体标识，如划痕、记号，范围更广，可包含人为或自然形成。"
    },
    {
      "word_to_compare": "score",
      "analysis": "“Score” (分数) 专指在比赛、考试或游戏中获得的数值，是 “mark” 在评分语境下的一个子集。但 “mark” 还可指等级（如A、B、C）或非数值的评价，而 “score” 通常是数字。"
    },
    {
      "word_to_compare": "trace",
      "analysis": "“Trace” (痕迹) 指微弱、模糊或几乎消失的残留物，常用于暗示存在但不明显，如“trace of smoke”。而 “mark” 通常是清晰可见、有意或无意留下的明显印记，强度和可见度更高。"
    }
  ]
}