{
  "word": "marshall",
  "pronunciation": "mahr·shol",
  "concise_definition": "v. 组织, 安排, 率领; n. (头衔) 元帅, 警长",
  "forms": {
    "third_person_singular": "marshals",
    "past_tense": "marshalled",
    "past_participle": "marshalled",
    "present_participle": "marshalling"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To organize or arrange people, resources, or ideas in a systematic and effective way, especially for a specific purpose such as a ceremony, event, or military operation.",
      "explanation_cn": "指有条不紊地组织人员、资源或想法，通常是为了特定目的，如仪式、活动或军事行动。",
      "example_en": "The general marshalled his troops for the final assault.",
      "example_cn": "将军将部队组织起来，准备最后的进攻。"
    },
    {
      "pos": "verb",
      "explanation_en": "To lead or guide a group of people in a formal or ceremonial procession, often in a public or official setting.",
      "explanation_cn": "指在正式或仪式场合中引导一群人行进，常用于公共或官方场合。",
      "example_en": "A marshal marshalled the parade participants to their starting positions.",
      "example_cn": "一名警长将游行参与者引导至起始位置。"
    },
    {
      "pos": "noun",
      "explanation_en": "A high-ranking military officer, especially in some countries like France or the United States, equivalent to a general or field marshal.",
      "explanation_cn": "指某些国家（如法国或美国）的高级军官，相当于将军或元帅。",
      "example_en": "The Marshal of the Air Force was honored at the ceremony.",
      "example_cn": "空军元帅在仪式上受到表彰。"
    },
    {
      "pos": "noun",
      "explanation_en": "An official responsible for maintaining order, especially in a courtroom, at a public event, or as a law enforcement officer in rural areas.",
      "explanation_cn": "指负责维持秩序的官员，尤指在法庭、公共活动或乡村地区执行法律的执法人员。",
      "example_en": "The court marshal announced, 'All rise!' as the judge entered.",
      "example_cn": "法官入场时，法庭警长宣布：‘全体起立！’"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "organize",
      "analysis": "“Organize” (组织) 是一个通用词，泛指安排事物使其有条理，不强调权威性或仪式性。而 “marshall” 更强调在正式场合中以权威方式引导或部署人员，常带有军事或典礼色彩。"
    },
    {
      "word_to_compare": "command",
      "analysis": "“Command” (指挥) 强调下达命令和控制权，通常用于军事或权威语境，但不包含“排列”或“引导行进”的动作。“Marshall” 则更侧重于有序地引导和安排，而非单纯发号施令。"
    },
    {
      "word_to_compare": "usher",
      "analysis": "“Usher” (引导者) 通常指在仪式中引导宾客入座，动作较温和、服务性更强，多用于社交场合。而 “marshal” 的职责更正式、更权威，常涉及秩序维护、人员调度甚至执法职能。"
    }
  ]
}