{
  "word": "martyrs",
  "pronunciation": "mahr·turs",
  "concise_definition": "n. 烈士, 殉道者, 牺牲者",
  "forms": {
    "singular": "martyr"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who is killed or suffers greatly because of their religious beliefs, political convictions, or commitment to a cause, often regarded as a symbol of sacrifice and moral courage.",
      "explanation_cn": "指因宗教信仰、政治立场或对某种信念的坚持而被杀害或遭受巨大苦难的人，常被视为牺牲精神与道德勇气的象征。",
      "example_en": "The martyrs of the civil rights movement are remembered for their unwavering courage in the face of violence.",
      "example_cn": "民权运动中的烈士们因在暴力面前表现出的坚定勇气而被人们铭记。"
    },
    {
      "pos": "noun",
      "explanation_en": "Someone who endures prolonged suffering or makes a significant personal sacrifice for a cause, even if not killed, and is thus honored as a martyr by others.",
      "explanation_cn": "指为某种事业长期忍受苦难或做出重大个人牺牲的人，即使未被杀害，仍被他人尊为殉道者。",
      "example_en": "She became a martyr to the cause of education, giving up her career to teach in remote villages.",
      "example_cn": "她为教育事业献身，放弃了自己的职业生涯去偏远村庄教书，被尊为殉道者。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who seeks sympathy or attention by exaggerating their suffering or sacrifices, often used in a critical or ironic tone.",
      "explanation_cn": "指通过夸大自己的苦难或牺牲来博取同情或关注的人，常带有批评或讽刺意味。",
      "example_en": "He's not a real martyr—he just complains about working overtime every day to get pity.",
      "example_cn": "他不是真正的烈士——他只是每天抱怨加班，好博取同情。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "heroes",
      "analysis": "“Heroes” (英雄) 指在危险或困难中表现出非凡勇气、智慧或成就的人，其核心是主动的英勇行为，不一定涉及死亡或牺牲。而 “martyrs” 强调因坚持信念而遭受迫害甚至死亡，其价值在于被动承受苦难所体现的道德力量。"
    },
    {
      "word_to_compare": "victims",
      "analysis": "“Victims” (受害者) 是一个中性词，泛指因灾难、犯罪或不幸事件而受伤害的人，不包含道德或精神层面的崇高性。而 “martyrs” 特指为信仰或理想主动承受苦难并因此被赋予象征意义的人，带有敬仰和纪念的色彩。"
    },
    {
      "word_to_compare": "sacrifices",
      "analysis": "“Sacrifices” (牺牲) 是动词或名词，泛指为他人或某种目标放弃利益、时间甚至生命的行为，是一个过程或行为本身。而 “martyrs” 是指完成这种牺牲后的人，是牺牲行为的承载者和象征体，具有人格化和历史纪念意义。"
    }
  ]
}