{
  "word": "masculine",
  "pronunciation": "mas·kyuh·lin",
  "concise_definition": "adj. 男性的, 男子气概的, 阳性的",
  "forms": {
    "comparative": "more masculine",
    "superlative": "most masculine"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having qualities traditionally associated with men or boys, such as strength, assertiveness, courage, or stoicism; often used to describe behavior, appearance, or characteristics perceived as typically male.",
      "explanation_cn": "具有传统上与男性或男孩相关的特质，如力量、果断、勇气或坚忍；常用于描述被视为典型男性化的言行、外貌或特征。",
      "example_en": "His deep voice and broad shoulders gave him a very masculine appearance.",
      "example_cn": "他低沉的声音和宽阔的肩膀使他看起来非常阳刚。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Grammatically referring to a gender category used for nouns and pronouns that denote males or male-associated entities, as opposed to feminine or neuter.",
      "explanation_cn": "语法上指用于表示男性或与男性相关实体的名词和代词的性别类别，与阴性或中性相对。",
      "example_en": "In French, the word 'acteur' is masculine, while 'actrice' is feminine.",
      "example_cn": "在法语中，'acteur' 是阳性词，而 'actrice' 是阴性词。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characteristic of the male sex in biological or symbolic terms, such as in astrology or symbolism (e.g., the sun is often considered masculine).",
      "explanation_cn": "从生物或象征意义上与男性性别相关或具有其特征，例如在占星学或象征体系中（如太阳常被视为阳性）。",
      "example_en": "In many cultures, the lion is a masculine symbol of power and leadership.",
      "example_cn": "在许多文化中，狮子是代表力量与领导力的阳性象征。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "male",
      "analysis": "“Male” (雄性的/男性的) 是一个纯粹的生物学或分类学术语，用于区分性别，不带有文化或性格含义。例如，一只雄性狮子或一个男性医生。“Masculine” 则强调社会文化建构的男性特质，即使对象是女性，也可能被描述为“masculine”（如一位强势的女CEO）。"
    },
    {
      "word_to_compare": "manly",
      "analysis": "“Manly” (男子气的) 与 “masculine” 意义高度重叠，但更口语化、情感色彩更强，常带有传统或刻板印象的意味，有时甚至显得过时或保守。例如，“manly virtues” 暗示一种理想化的男性气质，而 “masculine” 更中性、学术化，适用于更广泛的语境。"
    },
    {
      "word_to_compare": "virile",
      "analysis": "“Virile” (强健的/有男子气概的) 特别强调生理上的力量、活力和性能力，常用于描述健康、有生育力的男性，有时带有性暗示。而 “masculine” 范围更广，涵盖性格、行为、语言、风格等，不限于生理层面。"
    }
  ]
}