{
  "word": "mask",
  "pronunciation": "mask",
  "concise_definition": "n. 面具, 面罩; v. 掩盖, 隐藏",
  "forms": {
    "plural": "masks",
    "third_person_singular": "masks",
    "past_tense": "masked",
    "past_participle": "masked",
    "present_participle": "masking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A covering for the face, typically worn to protect against particles, gases, or to conceal identity, often used in medical, ceremonial, or theatrical contexts.",
      "explanation_cn": "一种覆盖面部的物品，通常用于防护颗粒物或气体，或隐藏身份，常见于医疗、仪式或戏剧场合。",
      "example_en": "Health workers wore masks to prevent the spread of the virus.",
      "example_cn": "医护人员佩戴口罩以防止病毒传播。"
    },
    {
      "pos": "noun",
      "explanation_en": "A false appearance or facade used to conceal one's true feelings, intentions, or identity, often in social or psychological contexts.",
      "explanation_cn": "一种虚假的外表或伪装，用于隐藏真实的情感、意图或身份，常用于社会或心理语境中。",
      "example_en": "He wore a mask of calm during the crisis, though he was terrified inside.",
      "example_cn": "危机期间他表面镇定自若，内心却恐惧不已。"
    },
    {
      "pos": "verb",
      "explanation_en": "To conceal or hide something, especially a feeling, fact, or quality, often deliberately or strategically.",
      "explanation_cn": "有意或策略性地隐藏某物，尤其是情感、事实或特质。",
      "example_en": "She masked her disappointment with a smile.",
      "example_cn": "她用微笑掩饰了自己的失望。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover or obscure something visually or physically, such as using a barrier or filter to block light, sound, or data.",
      "explanation_cn": "通过物理屏障或滤镜覆盖或遮蔽某物，例如阻挡光线、声音或数据。",
      "example_en": "The photographer used a mask to block out unwanted light in the shot.",
      "example_cn": "摄影师使用遮光罩来阻挡拍摄中不需要的光线。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "disguise",
      "analysis": "“Disguise” (伪装) 强调通过改变外貌或身份来欺骗他人，通常涉及更全面的装扮或改变，如假发、服装、假声等，目的是让人误认身份。而 “mask” 更侧重于遮盖面部或表面特征，不一定涉及整体身份的改变，且可指物理或抽象的遮蔽。"
    },
    {
      "word_to_compare": "cover",
      "analysis": "“Cover” (覆盖) 是一个更通用的词，指任何物理或抽象的遮盖行为，如用布盖住桌子、掩盖错误。它不强调“隐藏真实本质”的意图，而 “mask” 常带有主动隐藏真实意图或情感的含义，更具心理或象征性。"
    },
    {
      "word_to_compare": "veil",
      "analysis": "“Veil” (面纱/遮蔽) 通常带有诗意、宗教或隐喻色彩，指轻柔、半透明的遮盖，如面纱、隐喻性的“面纱”掩盖真相。它比 “mask” 更含蓄、更文雅，而 “mask” 更直接、更实用，甚至带有防御或欺骗的意味。"
    }
  ]
}