{
  "word": "masks",
  "pronunciation": "masks",
  "concise_definition": "n. 面具, 面罩, 遮掩物; v. 掩饰, 隐藏",
  "forms": {
    "singular": "mask",
    "plural": "masks"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A covering for the face, typically worn to protect against pollutants, pathogens, or to conceal identity, often used in medical, ceremonial, or theatrical contexts.",
      "explanation_cn": "一种覆盖面部的物品，通常用于防护污染物、病原体，或隐藏身份，常见于医疗、仪式或戏剧场合。",
      "example_en": "During the pandemic, everyone was required to wear masks in public spaces.",
      "example_cn": "疫情期间，每个人在公共场所都被要求佩戴口罩。"
    },
    {
      "pos": "noun",
      "explanation_en": "A decorative or symbolic face covering used in festivals, rituals, or performances to represent a character, spirit, or emotion.",
      "explanation_cn": "用于节日、仪式或表演中，以代表某种角色、灵魂或情感的装饰性或象征性面部遮盖物。",
      "example_en": "The dancers wore elaborate masks during the traditional carnival procession.",
      "example_cn": "舞者们在传统狂欢节游行中佩戴了精致的面具。"
    },
    {
      "pos": "noun",
      "explanation_en": "A metaphorical covering that hides true feelings, intentions, or identity, often implying deception or social pretense.",
      "explanation_cn": "比喻意义上用来隐藏真实情感、意图或身份的伪装，常暗示欺骗或社会性的伪装。",
      "example_en": "He wore a mask of calm, but inside he was terrified.",
      "example_cn": "他表面装作镇定，内心却恐惧不已。"
    },
    {
      "pos": "verb",
      "explanation_en": "To conceal or hide something, especially emotions, intentions, or the true nature of a situation, often deliberately.",
      "explanation_cn": "有意隐藏某物，尤其是情感、意图或真实情况的本质。",
      "example_en": "She masked her disappointment with a bright smile.",
      "example_cn": "她用灿烂的笑容掩饰了自己的失望。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover or obscure something physically, such as an image, sound, or signal, often to reduce visibility or interference.",
      "explanation_cn": "物理上遮盖或掩盖某物，如图像、声音或信号，通常是为了降低可见度或减少干扰。",
      "example_en": "The fog masked the outline of the distant mountains.",
      "example_cn": "浓雾遮蔽了远处山脉的轮廓。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cover",
      "analysis": "“Cover”（覆盖）是一个更通用的词，指任何物理或抽象的遮盖行为，不强调隐藏意图或身份。而 “mask” 更强调有意识地隐藏真实状态，常带有欺骗性或象征性含义。例如，用毯子盖住家具是 cover，但用微笑掩盖悲伤是 mask。"
    },
    {
      "word_to_compare": "disguise",
      "analysis": "“Disguise”（伪装）通常指通过改变外貌或身份来欺骗他人，常用于逃亡、间谍或角色扮演场景，强调整体形象的改变。而 “mask” 更侧重于面部遮盖，可以是物理的（如口罩）或隐喻的（如情绪伪装），范围更广但形式更局部。"
    },
    {
      "word_to_compare": "veil",
      "analysis": "“Veil”（面纱）多用于象征性或诗意的语境，常指轻薄、半透明的遮盖，带有神秘、神圣或压抑的意味（如“veil of secrecy”）。而 “mask” 更直接、更实体化，常用于功能性或对抗性情境，如防护或欺骗，语义更强烈、更具体。"
    }
  ]
}