{
  "word": "massacre",
  "pronunciation": "mas·uh·kayr",
  "concise_definition": "n. 大屠杀, 屠杀; v. 屠杀, 残杀",
  "forms": {
    "third_person_singular": "massacres",
    "past_tense": "massacred",
    "past_participle": "massacred",
    "present_participle": "massacring"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The indiscriminate and brutal killing of a large number of people, often defenseless or unarmed, typically in a violent and cruel manner.",
      "explanation_cn": "指对大量人员（通常是无抵抗能力或 unarmed 的人）进行无差别、残忍的屠杀，通常伴随着极端暴力。",
      "example_en": "The massacre of civilians in the village shocked the entire international community.",
      "example_cn": "村中平民的大屠杀震惊了整个国际社会。"
    },
    {
      "pos": "noun",
      "explanation_en": "A severe and overwhelming defeat, especially in sports or politics, where one side is utterly crushed by the other.",
      "explanation_cn": "指在体育或政治中一方被另一方彻底击败的惨败局面，常用于比喻性语境。",
      "example_en": "The team suffered a massacre in the final, losing 10–0.",
      "example_cn": "球队在决赛中遭遇惨败，以 0:10 落败。"
    },
    {
      "pos": "verb",
      "explanation_en": "To kill a large number of people in a violent and cruel way, often without mercy or justification.",
      "explanation_cn": "指以暴力和残忍的方式杀害大量人员，通常毫无怜悯或正当理由。",
      "example_en": "Soldiers were accused of massacring the entire population of the town.",
      "example_cn": "士兵被指控屠杀了镇上的全体居民。"
    },
    {
      "pos": "verb",
      "explanation_en": "To defeat an opponent overwhelmingly, especially in a competition or contest.",
      "explanation_cn": "指在竞赛或对抗中以压倒性优势击败对手。",
      "example_en": "The champion team massacred their rivals in the championship game.",
      "example_cn": "冠军队在决赛中以压倒性优势击败了对手。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "murder",
      "analysis": "“Murder” (谋杀) 指非法故意杀人，通常针对个体，强调主观恶意和法律定性。而 “massacre” 强调大规模、集体性、非选择性的屠杀，常带有极端暴力和非人道色彩，不局限于法律定义。"
    },
    {
      "word_to_compare": "slaughter",
      "analysis": "“Slaughter” (屠杀) 与 “massacre” 意义接近，常可互换，但 “slaughter” 更常用于动物宰杀或战争中的大规模杀戮，语气上略偏中性或描述性；而 “massacre” 带有强烈道德谴责，多用于人类受害的语境，情感色彩更强烈。"
    },
    {
      "word_to_compare": "genocide",
      "analysis": "“Genocide” (种族灭绝) 是一个法律术语，特指蓄意毁灭某一民族、种族、宗教或族群的系统性行为，具有明确的政治和历史背景。而 “massacre” 可以是孤立事件，不一定涉及系统性灭绝意图，范围更广但法律定义更弱。"
    }
  ]
}