{
  "word": "master",
  "pronunciation": "mas·tər",
  "concise_definition": "n. 主人, 大师, 硕士; v. 掌握, 精通, 控制",
  "forms": {
    "third_person_singular": "masters",
    "past_tense": "mastered",
    "past_participle": "mastered",
    "present_participle": "mastering",
    "plural": "masters"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who has complete control or authority over someone or something, especially in a historical or hierarchical context.",
      "explanation_cn": "指在历史或等级制度背景下，对他人或事物拥有完全控制权或权威的人，如奴隶主、雇主。",
      "example_en": "The slave owner was known as the master of the plantation.",
      "example_cn": "这位奴隶主被称为种植园的主人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who has achieved the highest level of skill or expertise in a particular field, often through years of dedicated practice.",
      "explanation_cn": "指在某一领域通过长期专注实践达到最高水平的专家或大师。",
      "example_en": "She is a master of classical piano and has performed worldwide.",
      "example_cn": "她是古典钢琴大师，曾在世界各地演出。"
    },
    {
      "pos": "noun",
      "explanation_en": "An academic degree awarded by a university after completing a course of study beyond the bachelor's degree.",
      "explanation_cn": "指大学在学士学位之后授予的研究生学位，如硕士。",
      "example_en": "He earned his master's in computer science from MIT.",
      "example_cn": "他在麻省理工学院获得了计算机科学硕士学位。"
    },
    {
      "pos": "verb",
      "explanation_en": "To gain complete control or proficiency in a skill, subject, or activity through dedicated effort and practice.",
      "explanation_cn": "指通过专注努力和练习，完全掌握某项技能、学科或活动。",
      "example_en": "It took him ten years to master the art of calligraphy.",
      "example_cn": "他花了十年时间才精通书法艺术。"
    },
    {
      "pos": "verb",
      "explanation_en": "To control or dominate a situation, emotion, or reaction, often successfully overcoming challenges.",
      "explanation_cn": "指成功控制或主导某种局面、情绪或反应，通常意味着克服了困难。",
      "example_en": "She mastered her fear of public speaking and gave a confident presentation.",
      "example_cn": "她克服了公众演讲的恐惧，做了自信的演讲。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "expert",
      "analysis": "“Expert” (专家) 指在某一领域拥有高度知识或技能的人，但不一定达到“master”所暗示的巅峰造诣或权威性。“Master” 更强调全面掌控、艺术性或传承性，而 “expert” 更侧重专业性与实用性。"
    },
    {
      "word_to_compare": "owner",
      "analysis": "“Owner” (所有者) 仅指法律或物质上的拥有权，如房产、车辆的所有者，不包含技能或控制力的含义。而 “master” 在作为名词时，常隐含对人或事物的支配与管理权，语义更复杂、更具权力色彩。"
    },
    {
      "word_to_compare": "learn",
      "analysis": "“Learn” (学习) 是获取知识或技能的初始过程，而 “master” 是学习的最终阶段，意味着彻底内化、自如运用并达到卓越水平。前者是过程，后者是结果。"
    },
    {
      "word_to_compare": "conquer",
      "analysis": "“Conquer” (征服) 强调通过力量或斗争战胜外部障碍，如征服国家或恐惧，常带有对抗性。而 “master” 更强调通过理解、练习和掌控实现内在的精通，语气更理性、更持久。"
    }
  ]
}