{
  "word": "masters",
  "pronunciation": "mas·turs",
  "concise_definition": "n. 大师, 精通者, 硕士; v. 精通, 掌握",
  "forms": {
    "singular": "master",
    "third_person_singular": "masters",
    "past_tense": "mastered",
    "past_participle": "mastered",
    "present_participle": "mastering"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who has achieved a very high level of skill, knowledge, or expertise in a particular field, often through years of practice and dedication.",
      "explanation_cn": "指在某一领域通过长期实践与专注而达到极高技能或知识水平的人。",
      "example_en": "Leonardo da Vinci was a master of painting, sculpture, and engineering.",
      "example_cn": "列奥纳多·达·芬奇是绘画、雕塑和工程学的大师。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who holds a master’s degree, typically the second academic degree earned after a bachelor’s degree.",
      "explanation_cn": "指获得硕士学位的人，通常是学士学位之后取得的第二个学术学位。",
      "example_en": "She is pursuing her masters in environmental science at Harvard.",
      "example_cn": "她正在哈佛大学攻读环境科学硕士学位。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who has control or authority over another, especially in historical or hierarchical contexts (e.g., slave owner, employer).",
      "explanation_cn": "指在历史或等级制度中对他人拥有控制权或权威的人（如奴隶主、雇主）。",
      "example_en": "In ancient Rome, the master had absolute power over his slaves.",
      "example_cn": "在古罗马，主人对奴隶拥有绝对权力。"
    },
    {
      "pos": "verb",
      "explanation_en": "To become highly skilled or proficient in a subject, activity, or technique through dedicated practice and learning.",
      "explanation_cn": "指通过专注的练习与学习，在某一学科、活动或技术上达到精通的程度。",
      "example_en": "He mastered the piano by practicing for hours every day.",
      "example_cn": "他每天练习数小时，最终精通了钢琴。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "expert",
      "analysis": "“Expert” (专家) 指在某一领域拥有专业知识或技能的人，强调权威性和被认可的专业性，但不一定达到“大师”所蕴含的创造性、艺术性或深远影响力。“Master” 更常用于艺术、技艺或哲学层面，带有崇敬意味。"
    },
    {
      "word_to_compare": "specialist",
      "analysis": "“Specialist” (专家/专科医生) 强调在狭窄领域内的专业能力，通常是职业分工的结果，偏重功能性与技术性。“Master” 则暗示更全面、更深刻、更融会贯通的掌握，常包含个人风格与传承。"
    },
    {
      "word_to_compare": "proficient",
      "analysis": "“Proficient” (熟练的) 描述的是达到良好或胜任水平的能力，属于中性描述，不带有“master”所蕴含的卓越、权威或典范性。“Master” 是 proficiency 的顶点，是质的飞跃。"
    }
  ]
}