{
  "word": "mastermind",
  "pronunciation": "mas·ter·mīnd",
  "concise_definition": "n. 策划者, 首谋者; v. 策划, 策动",
  "forms": {
    "third_person_singular": "masterminds",
    "past_tense": "masterminded",
    "past_participle": "masterminded",
    "present_participle": "masterminding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who plans and directs a complex or criminal scheme with great intelligence and strategic skill, often operating behind the scenes.",
      "explanation_cn": "指以高超的智慧和战略能力策划并指挥复杂计划（尤其是犯罪活动）的人，通常在幕后操控。",
      "example_en": "The police believe the notorious heist was masterminded by a former bank executive.",
      "example_cn": "警方认为这起臭名昭著的抢劫案是由一位前银行高管策划的。"
    },
    {
      "pos": "noun",
      "explanation_en": "A highly intelligent and influential person who organizes and leads a project, movement, or organization with exceptional vision.",
      "explanation_cn": "指具有非凡远见、组织并领导某项事业、运动或组织的高智商且有影响力的人物，常含褒义。",
      "example_en": "She is the mastermind behind the successful environmental campaign that changed national policy.",
      "example_cn": "她是成功推动改变国家政策的环保运动背后的策划者。"
    },
    {
      "pos": "verb",
      "explanation_en": "To plan and organize a complex activity or scheme, especially one that requires careful coordination and intellectual effort.",
      "explanation_cn": "指精心策划并组织一项复杂的活动或阴谋，尤其需要周密的协调与智力投入。",
      "example_en": "He masterminded the company’s global expansion strategy over five years.",
      "example_cn": "他在五年内策划了公司的全球扩张战略。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "architect",
      "analysis": "“Architect”（设计者/构想者）强调设计结构、系统或框架，常用于建筑、技术或战略层面，语气较中性或正面，不必然涉及操控或隐秘性。而 “mastermind” 更强调对整个计划的主导与操控，常带有阴谋或高度组织性的色彩。"
    },
    {
      "word_to_compare": "instigator",
      "analysis": "“Instigator”（挑唆者）指引发冲突、事件或骚动的人，通常带有负面含义，强调煽动而非系统性策划。而 “mastermind” 不仅引发事件，还负责整个计划的执行与控制，更具全面性和智力性。"
    },
    {
      "word_to_compare": "organizer",
      "analysis": "“Organizer”（组织者）泛指安排事务、协调资源的人，适用于日常活动或合法项目，语义中性。而 “mastermind” 暗示更高的智力层级、主导权和潜在的隐蔽性，常用于描述具有深远影响甚至非法性质的策划行为。"
    }
  ]
}