{
  "word": "mat",
  "pronunciation": "mat",
  "concise_definition": "n. 垫子, 地垫, 席子; v. 使成垫状, 覆盖",
  "forms": {
    "plural": "mats"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A flat, woven or pressed piece of material, typically used to cover a floor or surface for protection, decoration, or to provide a non-slip surface.",
      "explanation_cn": "一种扁平的、编织或压制成的材料片，通常用于覆盖地板或表面，以提供保护、装饰或防滑功能。",
      "example_en": "She wiped her shoes on the doormat before entering the house.",
      "example_cn": "她进屋前在门垫上擦了擦鞋子。"
    },
    {
      "pos": "noun",
      "explanation_en": "A thick, padded surface used in gymnastics or wrestling to cushion falls and prevent injury.",
      "explanation_cn": "一种厚实的垫子，用于体操或摔跤运动中，以缓冲跌落、防止受伤。",
      "example_en": "The gymnast landed safely on the foam mat after her routine.",
      "example_cn": "体操运动员完成动作后安全落在泡沫垫上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A dense mass of tangled fibers, hair, or threads, often forming an unwanted clump.",
      "explanation_cn": "一种由纠缠的纤维、毛发或线头形成的密集团块，通常为不希望出现的杂物。",
      "example_en": "The cat's fur had formed a large mat behind its ears.",
      "example_cn": "猫耳朵后面长出了一大团毛结。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover or surround something with a layer of material, especially to form a dense, matted surface.",
      "explanation_cn": "用一层材料覆盖或包围某物，尤其指形成密集、纠缠的表面。",
      "example_en": "The old roof had been matted with moss and leaves over the years.",
      "example_cn": "多年来，旧屋顶已被青苔和落叶覆盖成一片密实的垫状物。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rug",
      "analysis": "“Rug”（地毯）通常指较小、可移动的地面覆盖物，多用于装饰，材质较厚且常有图案；而 “mat” 更强调功能性，如防滑、吸水或保护，通常更薄、更实用，且多用于入口、厨房等区域。"
    },
    {
      "word_to_compare": "pad",
      "analysis": "“Pad”（垫片/衬垫）通常指较薄、柔软、用于缓冲或吸收冲击的材料，如鼠标垫、卫生巾；而 “mat” 更强调平面、大面积的覆盖，常用于地面或作为基础支撑，结构更坚固。"
    },
    {
      "word_to_compare": "tangle",
      "analysis": "“Tangle”（纠缠）是动词或名词，泛指任何杂乱纠缠的状态，如头发、电线；而 “mat” 作为名词时特指因长期纠缠而形成的致密、硬化的团块，常用于描述毛发或纤维的病理状态，语义更具体且带有负面含义。"
    }
  ]
}