{
  "word": "matchup",
  "pronunciation": "match·up",
  "concise_definition": "n. 对阵, 对手搭配, 比赛配对",
  "forms": {
    "plural": "matchups"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A pairing or contest between two competitors, teams, or players, especially in sports or competitive contexts, often analyzed for strategic or entertainment value.",
      "explanation_cn": "指在体育或竞争性情境中两个对手、队伍或选手之间的配对或对决，常被用于分析其战略意义或娱乐价值。",
      "example_en": "The championship matchup between the Lakers and the Celtics drew millions of viewers.",
      "example_cn": "湖人队与凯尔特人队的冠军对决吸引了数百万观众。"
    },
    {
      "pos": "noun",
      "explanation_en": "A deliberate arrangement of opposing parties in a competition, debate, or game to create balance, excitement, or a favorable outcome.",
      "explanation_cn": "指为制造平衡、刺激性或有利结果而有意安排的对立双方组合，可用于比赛、辩论或其他竞争性活动。",
      "example_en": "The tournament organizers created an exciting matchup between the rising star and the reigning champion.",
      "example_cn": "赛事组织者安排了一场新星与卫冕冠军之间的精彩对决。"
    },
    {
      "pos": "noun",
      "explanation_en": "A comparison or contrast between two entities, often used metaphorically to highlight similarities or differences in style, quality, or characteristics.",
      "explanation_cn": "指两个事物之间的比较或对照，常用于隐喻性语境中，以突出其风格、质量或特征上的异同。",
      "example_en": "The matchup between the two CEOs' leadership styles revealed stark contrasts in corporate culture.",
      "example_cn": "两位首席执行官领导风格的对比揭示了企业文化的显著差异。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "game",
      "analysis": "“Game”（比赛）泛指一场完整的竞技活动，包含规则、时间、得分等完整结构；而 “matchup” 更侧重于参赛双方的配对关系本身，不强调比赛过程，而是强调谁对谁、是否具有看点或悬念。"
    },
    {
      "word_to_compare": "contest",
      "analysis": "“Contest”（竞赛）强调为争夺胜利而进行的正式竞争，范围更广，可包括才艺、写作、选举等非体育场景；“matchup” 则更具体地指两个对手之间的直接对抗，尤其在体育和竞技语境中使用频率更高。"
    },
    {
      "word_to_compare": "duel",
      "analysis": "“Duel”（决斗）通常指两人之间一对一的、往往具有对抗性甚至生死意味的较量，带有历史或戏剧色彩；而 “matchup” 是中性术语，广泛用于现代体育、商业或媒体语境，不隐含暴力或极端对抗。"
    }
  ]
}