{
  "word": "matches",
  "pronunciation": "mat·chiz",
  "concise_definition": "n. 比赛, 火柴, 匹配; v. 匹配, 与...相配, 燃烧",
  "forms": {
    "singular": "match"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A contest or game between two or more competitors, typically organized and governed by rules, often for entertainment or competition.",
      "explanation_cn": "指两个或多个竞争者之间按照规则进行的竞赛或比赛，通常用于娱乐或竞技目的。",
      "example_en": "The final match of the World Cup attracted millions of viewers worldwide.",
      "example_cn": "世界杯决赛吸引了全球数百万观众观看。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small stick with a combustible tip used for lighting fires or cigarettes, typically made of wood or cardboard.",
      "explanation_cn": "一种带有可燃头的小棍，用于点燃火或香烟，通常由木头或纸板制成。",
      "example_en": "He struck a match to light the candle.",
      "example_cn": "他划了一根火柴点燃了蜡烛。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that is equal or similar to another in quality, appearance, or characteristics; a suitable counterpart.",
      "explanation_cn": "指在质量、外观或特征上与另一人或物相等或相似的人或物；合适的对应物。",
      "example_en": "Her skills are a perfect match for the demands of this job.",
      "example_cn": "她的技能与这份工作的要求完美匹配。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be equal or similar to something else in quality, quantity, or appearance; to correspond or align properly.",
      "explanation_cn": "指在质量、数量或外观上与另一事物相等或相似；正确对应或协调。",
      "example_en": "The curtains match the color of the sofa perfectly.",
      "example_cn": "窗帘的颜色与沙发完美搭配。"
    },
    {
      "pos": "verb",
      "explanation_en": "To ignite or light something using a matchstick, especially in the context of lighting a fire or cigarette.",
      "explanation_cn": "指使用火柴点燃某物，尤指点燃火或香烟。",
      "example_en": "She matched the cigarette and took a deep drag.",
      "example_cn": "她点燃了香烟，深深吸了一口。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "game",
      "analysis": "“Game”（游戏）泛指任何形式的娱乐性或竞技性活动，可能不具正式规则或组织性，如儿童游戏或电子游戏。而 “match” 强调有明确规则、双方对抗、结果明确的正式竞赛，如足球赛或网球赛。"
    },
    {
      "word_to_compare": "firestarter",
      "analysis": "“Firestarter”（点火器）是现代工具，如打火机或电子点火装置，用于点燃火焰，功能上与 “match” 类似，但 “match” 特指传统的一次性火柴，具有更具体的物质形态和文化意象。"
    },
    {
      "word_to_compare": "pair",
      "analysis": "“Pair”（一对）指两个在形式或功能上组合在一起的物品，如一双鞋或一对耳环，强调数量为二且成组。而 “match” 强调的是两个独立事物在属性上的相似性或协调性，不一定成对出现，如颜色匹配、性格匹配。"
    }
  ]
}