{
  "word": "matching",
  "pronunciation": "mætʃ·ɪŋ",
  "concise_definition": "adj. 相配的, 一致的; n. 比赛, 对阵",
  "forms": {
    "base_form": "match",
    "plural": "matchings"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Corresponding in color, style, pattern, or quality; suitable or complementary when paired together.",
      "explanation_cn": "在颜色、风格、图案或品质上相一致；搭配在一起时和谐、相称。",
      "example_en": "She wore a matching handbag and shoes to complete her outfit.",
      "example_cn": "她搭配了一只与服装相配的手提包和鞋子，使整体造型更加完整。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Exactly alike or identical in characteristics, often used to describe things that are deliberately made to correspond.",
      "explanation_cn": "在特征上完全相同或一致，常用于描述特意设计成相互对应的事物。",
      "example_en": "The two rooms have matching furniture and wallpaper.",
      "example_cn": "这两个房间的家具和墙纸都完全一致。"
    },
    {
      "pos": "noun",
      "explanation_en": "A contest or competition between two or more parties, especially in sports or games.",
      "explanation_cn": "指两个或多个参与者之间的比赛或对抗，尤指体育或游戏中的对阵。",
      "example_en": "The football match ended in a thrilling 3-2 victory for the home team.",
      "example_cn": "这场足球比赛以主队3比2的激动人心胜利告终。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of pairing or joining two things that are similar or compatible.",
      "explanation_cn": "指将两个相似或相容的事物配对或结合的行为。",
      "example_en": "The matching of candidates to job openings is done by an automated system.",
      "example_cn": "候选人与职位的匹配由一个自动化系统完成。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "compatible",
      "analysis": "“Compatible”（兼容的）强调两个事物可以共存或协同工作，但不一定在外观或形式上完全一致。例如，软件与操作系统兼容，但不一定看起来一样。而 “matching” 更强调外在或形式上的完全对应，如颜色、样式的一致。"
    },
    {
      "word_to_compare": "similar",
      "analysis": "“Similar”（相似的）表示有共同点但不完全相同，程度较弱。例如，两件衣服颜色相似，但可能有深浅差异。而 “matching” 意味着精确对应，是更高程度的一致性，常用于刻意搭配的语境。"
    },
    {
      "word_to_compare": "contest",
      "analysis": "“Contest”（竞赛）是一个更广泛的术语，泛指任何形式的竞争，包括智力、才艺或体力较量，不一定有明确的双方配对。而 “match” 作为名词时，特指两个对手或团队之间的直接对抗，结构更正式、更对称，如网球比赛、棋类对局。"
    }
  ]
}