{
  "word": "match",
  "pronunciation": "mach",
  "concise_definition": "n. 比赛, 对手, 火柴; v. 匹配, 与...相配, 打火",
  "forms": {
    "third_person_singular": "matches",
    "past_tense": "matched",
    "past_participle": "matched",
    "present_participle": "matching",
    "plural": "matches"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A contest or game between two or more competitors, typically organized according to specific rules and often for entertainment or competition.",
      "explanation_cn": "指两个或多个竞争者之间按照特定规则进行的竞赛或比赛，通常用于娱乐或竞技目的。",
      "example_en": "The final match of the World Cup attracted millions of viewers worldwide.",
      "example_cn": "世界杯决赛吸引了全球数百万观众观看。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that is equal or similar to another in quality, appearance, or ability; a suitable counterpart.",
      "explanation_cn": "指在品质、外观或能力上与另一人或物相等或相似的人或物；一个合适的配对或对应者。",
      "example_en": "She’s the perfect match for the job—highly skilled and deeply motivated.",
      "example_cn": "她与这份工作完美匹配——技能高超且充满动力。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small stick with a combustible tip used for lighting fires or cigarettes.",
      "explanation_cn": "一种带有可燃头的小木棒，用于点火或点燃香烟。",
      "example_en": "He struck a match to light the candle.",
      "example_cn": "他划了一根火柴点燃了蜡烛。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be equal or similar in quality, quantity, or appearance; to correspond or fit well with something else.",
      "explanation_cn": "指在质量、数量或外观上相等或相似；与另一事物相符合或搭配良好。",
      "example_en": "The curtains match the color of the sofa perfectly.",
      "example_cn": "窗帘的颜色与沙发完美搭配。"
    },
    {
      "pos": "verb",
      "explanation_en": "To bring two things together so that they correspond or align properly, often to achieve harmony or functionality.",
      "explanation_cn": "指将两件事物配对或对齐，使其相互对应，常为了达成和谐或功能性。",
      "example_en": "The system matches user preferences with relevant content automatically.",
      "example_cn": "该系统会自动将用户的偏好与相关内容匹配。"
    },
    {
      "pos": "verb",
      "explanation_en": "To ignite or light something using a matchstick.",
      "explanation_cn": "指使用火柴点燃某物。",
      "example_en": "She matched the lantern to see her way through the dark hallway.",
      "example_cn": "她划着火柴照亮了漆黑的走廊。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "game",
      "analysis": "“Game”（游戏）泛指任何形式的娱乐性或竞技性活动，范围更广，可包括棋类、电子游戏等，不一定有正式规则或输赢结果。而 “match” 更强调有明确规则、对手和胜负结果的正式竞赛，如足球赛、网球赛等。"
    },
    {
      "word_to_compare": "pair",
      "analysis": "“Pair”（一对）指两个自然或人为组合在一起的物品或人，强调数量为二，如一双鞋、一对情侣。而 “match” 强调两者在特征、功能或外观上的契合性，不一定是成对出现，如颜色匹配、能力匹配。"
    },
    {
      "word_to_compare": "compete",
      "analysis": "“Compete”（竞争）是动词，强调参与对抗或争取胜利的行为过程，不涉及具体形式。而 “match” 作为动词时，不仅包含竞争，更强调‘配对’或‘使相称’的含义，如匹配对手、匹配条件，语义范围更广。"
    }
  ]
}