{
  "word": "material",
  "pronunciation": "muh·tir·ee·uhl",
  "concise_definition": "n. 材料, 物质, 资料; adj. 物质的, 实际的, 重要的",
  "forms": {
    "plural": "materials"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A physical substance or matter from which things are made or can be processed, often referring to raw or unprocessed resources.",
      "explanation_cn": "指用于制造物品或可被加工的物理物质或原材料，通常指未经处理的资源。",
      "example_en": "Wood and steel are common building materials.",
      "example_cn": "木材和钢材是常见的建筑材料。"
    },
    {
      "pos": "noun",
      "explanation_en": "Content or information used in communication, education, or artistic creation, such as text, images, or audio.",
      "explanation_cn": "指用于交流、教育或艺术创作中的内容或信息，如文本、图像或音频资料。",
      "example_en": "The teacher prepared teaching materials for the new course.",
      "example_cn": "老师为新课程准备了教学资料。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to physical matter or tangible things, as opposed to spiritual or abstract concepts.",
      "explanation_cn": "指与物质实体相关的事物，而非精神或抽象概念。",
      "example_en": "The artist focused on the material aspects of the sculpture rather than its symbolic meaning.",
      "example_cn": "这位艺术家关注的是雕塑的物质层面，而非其象征意义。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Significant or substantial in terms of importance, value, or effect; not trivial or negligible.",
      "explanation_cn": "指在重要性、价值或影响方面显著或实质性的，非微不足道的。",
      "example_en": "She made a material contribution to the success of the project.",
      "example_cn": "她为项目的成功做出了重要贡献。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "substance",
      "analysis": "“Substance” (物质/实质) 更强调事物的内在本质或化学成分，常用于科学语境，如“chemical substance”。而 “material” 更侧重于可被使用或加工的物理材料，范围更广，也包括非化学意义上的原材料。"
    },
    {
      "word_to_compare": "resource",
      "analysis": "“Resource” (资源) 指可被利用以达成某种目的的天然或人造资产，常用于经济或环境语境（如自然资源）。而 “material” 更具体，指构成某物的实体成分，不强调其可用性或战略价值。"
    },
    {
      "word_to_compare": "content",
      "analysis": "“Content” (内容) 通常指信息、思想或表达的载体，如网页内容、视频内容，强调意义而非物理形态。而 “material” 作为名词时，可包含内容，但更常指承载内容的物理或可处理形式（如教材、录音带）。"
    },
    {
      "word_to_compare": "physical",
      "analysis": "“Physical” (物理的) 是形容词，强调与身体或物质世界相关，常用于对比抽象概念（如 physical vs. emotional）。而 “material” 作为形容词时，除了表示物质的，还常用于表示‘实质性的’或‘重要的’，语义更丰富，且可作名词使用。"
    }
  ]
}