{
  "word": "mate",
  "pronunciation": "mayt",
  "concise_definition": "n. 朋友, 同事, 配偶; v. 交配, 配对",
  "forms": {
    "plural": "mates",
    "third_person_singular": "mates",
    "past_tense": "mated",
    "past_participle": "mated",
    "present_participle": "mating"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A close friend or companion, especially in British English, often used informally to refer to someone with whom one shares camaraderie or regular interaction.",
      "explanation_cn": "指亲密的朋友或同伴，尤其在英式英语中常用于非正式场合，指与自己有友谊或经常互动的人。",
      "example_en": "I went for a beer with my mates after work.",
      "example_cn": "下班后我和朋友们去喝了杯啤酒。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person's partner in a romantic or marital relationship, especially in Australian and British informal usage.",
      "explanation_cn": "指某人的恋爱伴侣或配偶，尤其在澳大利亚和英式英语的非正式语境中使用。",
      "example_en": "She introduced me to her new mate at the party.",
      "example_cn": "她在聚会上向我介绍了她的新男友。"
    },
    {
      "pos": "noun",
      "explanation_en": "A colleague or fellow worker, especially in a shared profession or workplace environment.",
      "explanation_cn": "指同事或同僚，尤其在共同职业或工作环境中使用。",
      "example_en": "My mate in the office helped me finish the report.",
      "example_cn": "我办公室的同事帮我完成了报告。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pair or join with another, especially in the context of animals reproducing or forming a bond for breeding purposes.",
      "explanation_cn": "指（尤指动物）配对交配或为繁殖目的建立结合关系。",
      "example_en": "The penguins mated for life and raised their chicks together.",
      "example_cn": "这些企鹅终身配对，一起抚养幼崽。"
    },
    {
      "pos": "verb",
      "explanation_en": "To connect or join two things together, often in a mechanical or structural context.",
      "explanation_cn": "指将两个事物连接或结合在一起，常用于机械或结构语境。",
      "example_en": "The two pieces of metal were mated using a precision bolt.",
      "example_cn": "这两块金属用一颗精密螺栓连接在一起。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "friend",
      "analysis": "“Friend” (朋友) 是通用词，适用于所有语境，强调情感联系和相互尊重；而 “mate” 更具地域性（英澳英语），语气更随意、口语化，有时带有男性化或兄弟情谊的色彩，且在某些语境下可指同事或伴侣，语义范围更广。"
    },
    {
      "word_to_compare": "partner",
      "analysis": "“Partner” (伴侣/合作伙伴) 更正式，可用于商业、婚姻或长期关系，强调功能性或法律性结合；“mate” 则更口语化，常用于非正式亲密关系或动物交配，情感深度和正式程度较低。"
    },
    {
      "word_to_compare": "companion",
      "analysis": "“Companion” (同伴) 偏书面，强调陪伴和同行，常用于旅行、任务或情感支持语境，语气较温和庄重；“mate” 更随意、接地气，常用于日常社交，带有轻松、平等的语气。"
    }
  ]
}