{
  "word": "mathematical",
  "pronunciation": "math·uh·mat·i·kuhl",
  "concise_definition": "adj. 数学的, 数学上的, 精确的",
  "forms": {
    "comparative": "more mathematical",
    "superlative": "most mathematical"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or involving mathematics, especially in terms of methods, principles, or reasoning based on numbers, symbols, and logical structures.",
      "explanation_cn": "与数学相关或涉及数学的，尤指基于数字、符号和逻辑结构的方法、原理或推理。",
      "example_en": "The scientist used a mathematical model to predict climate change trends.",
      "example_cn": "这位科学家使用了一个数学模型来预测气候变化趋势。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by extreme precision, exactness, or logical consistency, often used to describe something that is perfectly accurate or systematic.",
      "explanation_cn": "以极度精确、严谨或逻辑一致性为特征，常用于形容某事物完美准确或系统化。",
      "example_en": "Her mathematical attention to detail ensured that no error slipped through.",
      "example_cn": "她对细节的数学般严谨确保了没有任何错误被遗漏。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Of or relating to the field of mathematics as a discipline, as opposed to applied or practical uses.",
      "explanation_cn": "指作为一门学科的数学本身，而非其应用或实际用途。",
      "example_en": "He has a deep interest in mathematical theories rather than their real-world applications.",
      "example_cn": "他对数学理论本身有浓厚兴趣，而非其在现实世界中的应用。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "numerical",
      "analysis": "“Numerical”（数值的）特指与数字本身相关，强调数量或算术值，如数值计算、数值数据。而 “mathematical” 范围更广，涵盖符号、逻辑、结构、关系等整个数学体系，不仅限于数字。"
    },
    {
      "word_to_compare": "precise",
      "analysis": "“Precise”（精确的）是通用形容词，泛指任何准确无误的事物，如精确的时间、精确的语言。而 “mathematical” 是 “precise” 的一种特殊强化形式，特指像数学那样绝对严谨、无歧义的精确性，带有学科权威性。"
    },
    {
      "word_to_compare": "logical",
      "analysis": "“Logical”（合乎逻辑的）强调推理过程的合理性与一致性，可应用于哲学、语言或日常思维。而 “mathematical” 不仅要求逻辑，还要求形式化系统、公理体系和符号运算，其严谨性远超一般逻辑。"
    }
  ]
}