{
  "word": "matte",
  "pronunciation": "mat",
  "concise_definition": "n. 亚光表面, 无光泽; adj. 亚光的, 无光泽的",
  "forms": {
    "plural": "mattes",
    "comparative": "matte",
    "superlative": "matte"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having a surface that does not reflect light; not shiny or glossy, often used to describe finishes on paint, paper, or makeup that appear flat and soft.",
      "explanation_cn": "指表面不反光的，无光泽的，常用于描述油漆、纸张或化妆品等具有平坦、柔和外观的质地。",
      "example_en": "She chose a matte lipstick for a more natural, understated look.",
      "example_cn": "她选择了一款哑光口红，以获得更自然、低调的妆效。"
    },
    {
      "pos": "noun",
      "explanation_en": "A surface or finish that lacks shine or gloss, especially in photography, art, or printing, used to reduce glare and create a subtle visual texture.",
      "explanation_cn": "指缺乏光泽的表面或涂层，尤其在摄影、艺术或印刷中使用，用于减少眩光并营造细腻的视觉质感。",
      "example_en": "The photographer preferred the matte finish of the print to avoid reflections under gallery lights.",
      "example_cn": "摄影师更喜欢照片的哑光表面，以避免在画廊灯光下产生反光。"
    },
    {
      "pos": "noun",
      "explanation_en": "A frame or border, often made of paper or cardboard, placed around a photograph or artwork to enhance its presentation and separate it visually from the frame.",
      "explanation_cn": "指围绕在照片或艺术品周围的边框，通常由纸或硬纸板制成，用于增强展示效果并使其与画框在视觉上区分开来。",
      "example_en": "The vintage photo was mounted in a wide white matte to give it a classic gallery appearance.",
      "example_cn": "这张复古照片被装裱在宽大的白色衬纸上，呈现出经典的画廊风格。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "glossy",
      "analysis": "“Glossy”（有光泽的）与 “matte” 形成直接对比，前者表面光滑、反光强烈，能增强色彩饱和度和视觉冲击力，常用于高端印刷品或亮面化妆品；而 “matte” 则追求低调、柔和、无反光的效果，更显自然和高级感，适合追求简约或专业感的场景。"
    },
    {
      "word_to_compare": "flat",
      "analysis": "“Flat”（平的）在色彩语境中有时可与 “matte” 互换，但 “flat” 更侧重于描述颜色缺乏明暗变化或立体感，而 “matte” 专指表面的光学特性——不反光。一个表面可以是 matte 但仍有丰富的色彩层次，而 flat 可能意味着颜色单调。"
    },
    {
      "word_to_compare": "dull",
      "analysis": "“Dull”（暗淡的）常带有负面含义，指失去光泽、陈旧或缺乏吸引力；而 “matte” 是一个中性甚至积极的美学术语，强调设计意图和专业质感。例如，一个 matte 表面是精心选择的风格，而一个 dull 表面可能是因老化或劣质材料导致的。"
    }
  ]
}