{
  "word": "matters",
  "pronunciation": "mat·erz",
  "concise_definition": "n. 事情, 问题, 重要性; v. 重要, 有关系",
  "forms": {
    "singular": "matter"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A subject, issue, or situation that requires attention, discussion, or resolution; often used to refer to a specific problem or concern.",
      "explanation_cn": "指需要关注、讨论或解决的主题、问题或情况；常用于指某个具体的问题或关切点。",
      "example_en": "The main matter under discussion was budget allocation.",
      "example_cn": "正在讨论的主要问题是预算分配。"
    },
    {
      "pos": "noun",
      "explanation_en": "The substance or essence of something, especially when referring to the core content or significance of a situation or argument.",
      "explanation_cn": "指某事物的实质或核心内容，尤其用于强调某种情况或论点的要点或重要性。",
      "example_en": "Let's get to the matter of why the project was delayed.",
      "example_cn": "让我们谈谈项目为何延误的核心问题。"
    },
    {
      "pos": "noun",
      "explanation_en": "A state of affairs or condition, often used in phrases like 'no matter' or 'in matters of...'.",
      "explanation_cn": "指某种状况或情形，常用于短语如 'no matter'（无论）或 'in matters of...'（在……方面）。",
      "example_en": "In matters of health, it's best to consult a professional.",
      "example_cn": "在健康问题上，最好咨询专业人士。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be of importance or significance; to have an effect or consequence on a situation or outcome.",
      "explanation_cn": "指具有重要性或意义；对某种情况或结果产生影响或后果。",
      "example_en": "It doesn't matter what you wear to the party; just come early.",
      "example_cn": "你穿什么去派对都无所谓，只要早点来就行。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be worth caring about or considering, often used in negative or rhetorical contexts to downplay significance.",
      "explanation_cn": "指值得关心或考虑，常用于否定或反问语境中，以弱化其重要性。",
      "example_en": "Whether he agrees or not doesn't matter—we're proceeding anyway.",
      "example_cn": "他是否同意无关紧要——我们还是会继续推进。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "issue",
      "analysis": "“Issue”（问题）通常指需要被正式讨论或解决的争议性或敏感性话题，常用于政治、社会或组织语境中，带有一定紧迫性或对立性。而 “matter” 更中性、更广泛，可指任何需要关注的事物，包括日常琐事或抽象概念。"
    },
    {
      "word_to_compare": "concern",
      "analysis": "“Concern”（关切）强调情感或心理上的关注，常带有忧虑或责任感的色彩，如对他人福祉的关心。而 “matter” 更侧重于客观重要性或实际影响，不一定包含情绪成分。"
    },
    {
      "word_to_compare": "significance",
      "analysis": "“Significance”（重要性）是名词，专指某事物的价值、影响或含义，是抽象的评价。而 “matter” 作为动词时，是口语化表达‘有关系’，更直接、更生活化；作为名词时，它指具体的事物或问题，而非抽象的‘重要性’本身。"
    }
  ]
}