{
  "word": "mayan",
  "pronunciation": "muh·yan",
  "concise_definition": "adj. 玛雅的, n. 玛雅人, 玛雅语",
  "forms": {
    "plural": "mayans"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to the ancient or modern Maya people, their culture, language, or civilization, particularly in Mesoamerica (southern Mexico, Guatemala, Belize, and parts of Honduras and El Salvador).",
      "explanation_cn": "指与古代或现代玛雅人、其文化、语言或文明相关的，尤指中美洲地区（墨西哥南部、危地马拉、伯利兹及洪都拉斯和萨尔瓦多部分地区）。",
      "example_en": "The Mayan pyramids at Chichén Itzá are among the most impressive archaeological sites in the Americas.",
      "example_cn": "奇琴伊察的玛雅金字塔是美洲最令人印象深刻的考古遗址之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A member of the indigenous people of Mesoamerica who developed a complex civilization with advanced writing, astronomy, and architecture.",
      "explanation_cn": "指中美洲的原住民，他们发展出了拥有先进文字、天文学和建筑的复杂文明。",
      "example_en": "Many Mayan communities still preserve traditional customs and speak Mayan languages today.",
      "example_cn": "如今，许多玛雅社区仍保留着传统习俗并使用玛雅语。"
    },
    {
      "pos": "noun",
      "explanation_en": "Any of the group of languages spoken by the Maya people, characterized by complex grammar and a unique hieroglyphic writing system.",
      "explanation_cn": "指玛雅人所使用的语言群，具有复杂的语法和独特的象形文字系统。",
      "example_en": "Yucatec Maya is one of the most widely spoken Mayan languages in the Yucatán Peninsula.",
      "example_cn": "尤卡坦玛雅语是尤卡坦半岛最广泛使用的玛雅语之一。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "aztec",
      "analysis": "“Aztec”（阿兹特克）指代的是另一个中美洲古代文明，主要位于今墨西哥中部，以特诺奇蒂特兰城和太阳神崇拜著称。虽然与玛雅文明同时期存在，但阿兹特克人使用纳瓦特尔语，文字系统为表意符号而非玛雅的完整象形文字，且政治结构更集中于帝国统治。两者常被并列提及，但文化、语言和地理分布截然不同。"
    },
    {
      "word_to_compare": "inca",
      "analysis": "“Inca”（印加）指南美洲安第斯山脉地区的古代文明，中心位于今秘鲁，以石砌建筑、道路系统和中央集权国家闻名。印加人没有文字系统，依靠结绳记事（基普），而玛雅人拥有美洲最发达的书写体系。两者地理上相距遥远，文化发展路径完全不同。"
    },
    {
      "word_to_compare": "indigenous",
      "analysis": "“Indigenous”（土著的）是一个泛指原住民的形容词，适用于全球任何原住民族群，如澳大利亚原住民、北美印第安人等。而 “Mayan” 是特指中美洲玛雅族群的专有名词，具有明确的文化、语言和历史边界。前者是类别词，后者是具体民族标签。"
    }
  ]
}