{
  "word": "mediterranean",
  "pronunciation": "med·i·tuh·ray·nee·uhn",
  "concise_definition": "adj. 地中海的, n. 地中海人, 地中海饮食",
  "forms": {
    "comparative": "more Mediterranean",
    "superlative": "most Mediterranean"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or bordering the Mediterranean Sea, including its geography, climate, culture, or peoples.",
      "explanation_cn": "与地中海或其沿岸地区相关的，包括其地理、气候、文化或人民。",
      "example_en": "The Mediterranean climate is characterized by hot, dry summers and mild, wet winters.",
      "example_cn": "地中海气候的特点是炎热干燥的夏季和温和湿润的冬季。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person native to or living in the countries surrounding the Mediterranean Sea.",
      "explanation_cn": "指居住在地中海沿岸国家的原住民或居民。",
      "example_en": "She admires the Mediterranean lifestyle, with its emphasis on family, fresh food, and leisurely meals.",
      "example_cn": "她钦佩地中海式的生活方式，这种生活方式强调家庭、新鲜食物和悠闲的用餐。"
    },
    {
      "pos": "noun",
      "explanation_en": "A dietary pattern typical of the countries bordering the Mediterranean Sea, rich in olive oil, vegetables, fruits, legumes, whole grains, fish, and moderate wine consumption.",
      "explanation_cn": "指地中海沿岸国家典型的饮食模式，富含橄榄油、蔬菜、水果、豆类、全谷物、鱼类，并适量饮用葡萄酒。",
      "example_en": "The Mediterranean diet is widely recommended by nutritionists for its heart-healthy benefits.",
      "example_cn": "营养学家广泛推荐地中海饮食，因其有益心脏健康。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "atlantic",
      "analysis": "“Atlantic”（大西洋的）指与大西洋相关的地理或文化特征，而 “Mediterranean” 专指地中海区域。两者均为海域形容词，但所指区域、气候、文化传统截然不同。地中海地区以温暖干燥气候和悠久文明著称，大西洋沿岸则涵盖更广泛的气候带和多元文化。"
    },
    {
      "word_to_compare": "continental",
      "analysis": "“Continental”（大陆的）通常指欧洲大陆的特征，与岛屿或沿海地区相对，也可指大陆性气候（温差大、降水少）。而 “Mediterranean” 强调特定海域周边的独特气候与生活方式，两者在地理范围和文化内涵上无重叠。"
    },
    {
      "word_to_compare": "tropical",
      "analysis": "“Tropical”（热带的）描述赤道附近高温高湿的气候和生态系统，与地中海的夏季干热、冬季温和的气候形成鲜明对比。地中海饮食虽健康，但其食材和生活方式不依赖热带作物（如香蕉、椰子），而以橄榄、葡萄、小麦等温带作物为主。"
    }
  ]
}