{
  "word": "medically",
  "pronunciation": "med·uh·kuhl·lee",
  "concise_definition": "adv. 医学上, 医疗上, 以医学方式",
  "forms": {
    "comparison": "no comparative or superlative form"
  },
  "definitions": [
    {
      "pos": "adverb",
      "explanation_en": "In a manner relating to medicine or medical treatment; according to medical standards, principles, or professional judgment.",
      "explanation_cn": "以与医学或医疗治疗相关的方式；依据医学标准、原则或专业判断。",
      "example_en": "She is not fit to return to work medically, as her condition still requires ongoing treatment.",
      "example_cn": "从医学角度看，她尚不适合返岗，因为她的病情仍需持续治疗。"
    },
    {
      "pos": "adverb",
      "explanation_en": "Used to describe the physical or physiological state of a person, as determined by a medical professional, rather than by personal perception or social factors.",
      "explanation_cn": "用于描述一个人由医疗专业人员判定的生理或身体状况，而非基于个人感受或社会因素。",
      "example_en": "Medically, he is classified as obese, despite feeling healthy and active.",
      "example_cn": "从医学上讲，他被归类为肥胖，尽管他自感健康且活跃。"
    },
    {
      "pos": "adverb",
      "explanation_en": "In terms of clinical or scientific medical evidence, as opposed to anecdotal, traditional, or alternative approaches.",
      "explanation_cn": "从临床或科学医学证据的角度而言，而非基于轶事、传统或替代疗法。",
      "example_en": "The treatment is not medically proven to be effective for this condition.",
      "example_cn": "这种疗法尚未被医学证据证实对该病症有效。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "clinically",
      "analysis": "“Clinically”（临床地）更强调在医疗实践或临床环境中通过观察、诊断和治疗所获得的证据，常用于医生对患者的具体评估。而 “medically” 范围更广，可涵盖医学理论、公共卫生、政策或一般性医学判断，不一定局限于临床场景。"
    },
    {
      "word_to_compare": "healthily",
      "analysis": "“Healthily”（健康地）描述的是符合健康生活方式的状态或行为，如饮食、运动等，侧重于预防和整体福祉。而 “medically” 仅指基于医学专业判断的状况或干预，可能涉及疾病、治疗或病理状态，不一定是‘健康’的。"
    },
    {
      "word_to_compare": "therapeutically",
      "analysis": "“Therapeutically”（治疗性地）特指用于治疗目的的方式或效果，强调干预的疗效。而 “medically” 是更宽泛的术语，包括诊断、评估、预防、治疗等所有医学相关方面，不限于治疗本身。"
    }
  ]
}