{
  "word": "medusa",
  "pronunciation": "muh·doo·suh",
  "concise_definition": "n. 美杜莎, 水母, 乱发的女人",
  "forms": {
    "plural": "medusae"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "In Greek mythology, a monstrous female creature with living snakes for hair, whose gaze could turn people to stone; one of the three Gorgon sisters, famously slain by Perseus.",
      "explanation_cn": "在希腊神话中，一个长着活蛇作为头发的怪物女性，其目光能将人石化；戈尔贡三姐妹之一，被珀尔修斯杀死。",
      "example_en": "Perseus used a mirrored shield to avoid Medusa's gaze and beheaded her while she slept.",
      "example_cn": "珀尔修斯使用一面镜子般的盾牌避开美杜莎的目光，在她熟睡时斩下了她的头颅。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of free-swimming marine animal belonging to the phylum Cnidaria, characterized by a bell-shaped body and trailing tentacles; commonly known as a jellyfish.",
      "explanation_cn": "一种属于刺胞动物门的自由游动海洋生物，身体呈钟形，带有下垂的触手；通常被称为水母。",
      "example_en": "The beach was closed after swimmers were stung by a large medusa drifting near the shore.",
      "example_cn": "由于有大型水母漂近岸边并蜇伤了游泳者，海滩被关闭了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A woman with tangled, wild, or disheveled hair, often used metaphorically to describe someone appearing chaotic or frightening.",
      "explanation_cn": "指头发凌乱、蓬松或杂乱的女人，常用于隐喻形容某人显得混乱或令人恐惧。",
      "example_en": "She woke up in a panic, her hair a wild medusa after a sleepless night.",
      "example_cn": "她惊慌地醒来，经过一夜未眠，头发乱得像美杜莎一样。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "jellyfish",
      "analysis": "“Jellyfish” 是日常用语中对水母的通用称呼，强调其生物特征和常见形态，语气中性或通俗；而 “medusa” 是生物学和神话中的正式术语，带有古典色彩，常用于科学文献或文学隐喻中，语义更丰富。"
    },
    {
      "word_to_compare": "monster",
      "analysis": "“Monster” (怪物) 是一个泛指恐怖或畸形生物的宽泛词汇，不特指美杜莎；而 “Medusa” 是一个具体神话人物，具有明确的视觉特征（蛇发、石化目光）和文化背景，是“monster”的一个典型子类。"
    },
    {
      "word_to_compare": "gorgon",
      "analysis": "“Gorgon” 是美杜莎所属的三姐妹的总称，泛指三者；而 “Medusa” 是其中最著名、唯一凡人可被杀死的一位。因此，所有 Medusa 都是 Gorgon，但并非所有 Gorgon 都是 Medusa。"
    }
  ]
}