{
  "word": "melissa",
  "pronunciation": "muh·lis·uh",
  "concise_definition": "n. 蜜蜂, 蜜源植物, 人名（梅丽莎）",
  "forms": {
    "plural": "melissas"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A genus of aromatic herbs in the mint family, commonly known as lemon balm, used in traditional medicine and culinary applications for its calming and citrus-scented leaves.",
      "explanation_cn": "唇形科的一种芳香草本植物，俗称柠檬香蜂草，其叶片具有柑橘香气，常用于传统医学和烹饪中，具有镇静和舒缓功效。",
      "example_en": "She brewed a soothing tea from fresh melissa leaves to ease her anxiety.",
      "example_cn": "她用新鲜的柠檬香蜂草叶片泡了一杯舒缓的茶，以缓解焦虑。"
    },
    {
      "pos": "noun",
      "explanation_en": "In ancient Greek mythology and beekeeping lore, Melissa was the name of a nymph who discovered and taught the use of honey, and later became a term for bees themselves.",
      "explanation_cn": "在古希腊神话与养蜂传统中，Melissa 是一位发现并传授蜂蜜使用方法的宁芙仙女，后来成为蜜蜂的代称。",
      "example_en": "The ancient Greeks called bees 'Melissae', honoring the nymph who first taught humans to harvest honey.",
      "example_cn": "古希腊人称蜜蜂为 'Melissae'，以纪念那位最早教会人类采蜜的仙女。"
    },
    {
      "pos": "noun",
      "explanation_en": "A feminine given name of Greek origin, meaning 'honeybee', often associated with sweetness, gentleness, and natural charm.",
      "explanation_cn": "源自希腊语的女性名字，意为 '蜜蜂'，常与甜美、温柔和自然的魅力联系在一起。",
      "example_en": "Melissa is a popular name in many English-speaking countries, evoking warmth and approachability.",
      "example_cn": "Melissa 是许多英语国家中常见的女性名字，让人联想到温暖与亲和力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bee",
      "analysis": "“Bee” 是指昆虫蜜蜂的通用名称，强调其生物学属性和采蜜行为；而 “Melissa” 作为名词时，是蜜蜂的文学性或古典代称，带有神话和文化内涵，使用频率较低，更具诗意。"
    },
    {
      "word_to_compare": "lemon balm",
      "analysis": "“Lemon balm” 是植物 melissa 的常用英文俗名，直接描述其气味特征；而 “melissa” 是其植物学学名，更常用于科学文献、草药学或正式语境中，语义更精确。"
    },
    {
      "word_to_compare": "name",
      "analysis": "作为人名时，'Melissa' 与其他女性名字（如 Sophia、Emma）一样是文化符号，但其独特之处在于词源直接关联 '蜜蜂'，赋予名字自然、勤劳与甜蜜的隐喻，这在其他常见名字中较为罕见。"
    }
  ]
}