{
  "word": "meltdown",
  "pronunciation": "mel·tdown",
  "concise_definition": "n. 熔毁, 崩溃, 失控",
  "forms": {
    "plural": "meltdowns"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A severe nuclear reactor accident in which the fuel rods overheat and melt, potentially releasing dangerous radiation into the environment.",
      "explanation_cn": "指核反应堆中燃料棒因过热而熔化，可能导致危险辐射泄漏至环境的严重事故。",
      "example_en": "The Chernobyl disaster was a catastrophic nuclear meltdown that contaminated large areas of Europe.",
      "example_cn": "切尔诺贝利灾难是一场灾难性的核熔毁，导致欧洲大片地区受到污染。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden and complete failure or collapse of a system, process, or emotional state, often due to overwhelming stress or pressure.",
      "explanation_cn": "指由于压力过大而导致的系统、流程或情绪状态的突然全面崩溃或失效。",
      "example_en": "After months of work overload, she had a complete emotional meltdown and couldn't get out of bed for days.",
      "example_cn": "在经历了数月的工作超负荷后，她情绪彻底崩溃，连续几天无法起床。"
    },
    {
      "pos": "noun",
      "explanation_en": "A financial collapse or crash, especially when markets or institutions fail due to panic, insolvency, or systemic risk.",
      "explanation_cn": "指金融市场或机构因恐慌、资不抵债或系统性风险而发生的崩溃或崩盘。",
      "example_en": "The 2008 financial meltdown was triggered by the collapse of the housing bubble and risky lending practices.",
      "example_cn": "2008 年的金融危机是由房地产泡沫破裂和高风险贷款行为引发的。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "collapse",
      "analysis": "“Collapse” (崩溃) 是一个更通用的词，泛指任何结构、系统或状态的突然倒塌或失效，不特指由过热或压力引发。而 “meltdown” 更强调因过度负荷（如热量、情绪或金融压力）导致的失控性、破坏性崩溃，常带有技术或极端情境的色彩。"
    },
    {
      "word_to_compare": "breakdown",
      "analysis": "“Breakdown” (故障/失灵) 通常指机械、心理或系统功能的局部或渐进性失效，语气较轻，不一定伴随灾难性后果。而 “meltdown” 暗示的是全面、剧烈、不可控的灾难性失败，常用于极端语境，如核事故或情绪崩溃。"
    },
    {
      "word_to_compare": "crash",
      "analysis": "“Crash” (坠毁/暴跌) 多用于交通工具（如飞机）或金融市场（如股市暴跌），强调速度和突然性，但不一定包含内部过热或系统性失控的含义。而 “meltdown” 更强调内部能量失控导致的连锁反应，尤其在核能或情绪领域具有独特语义。"
    }
  ]
}