{
  "word": "membranes",
  "pronunciation": "mem·breyns",
  "concise_definition": "n. 膜, 薄膜, 膜状物",
  "forms": {
    "singular": "membrane"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A thin, flexible layer of tissue or synthetic material that covers or separates parts of an organism or system, often serving as a selective barrier to control the passage of substances.",
      "explanation_cn": "指覆盖或分隔生物体或系统中各部分的一层薄而柔韧的组织或合成材料，通常作为选择性屏障，控制物质的通过。",
      "example_en": "The cell membrane regulates what enters and exits the cell.",
      "example_cn": "细胞膜控制着哪些物质可以进入或离开细胞。"
    },
    {
      "pos": "noun",
      "explanation_en": "A thin, elastic layer that encloses or lines a body cavity or organ, such as the peritoneum or pleura, providing protection and reducing friction.",
      "explanation_cn": "指包围或衬覆体腔或器官的薄而有弹性的层，如腹膜或胸膜，起到保护和减少摩擦的作用。",
      "example_en": "The pleural membranes surround the lungs and allow them to expand smoothly during breathing.",
      "example_cn": "胸膜包裹着肺部，使肺在呼吸时能够顺畅扩张。"
    },
    {
      "pos": "noun",
      "explanation_en": "A thin film or layer used in technology or industry, such as a semiconductor membrane or a filtration membrane, designed to perform a specific functional role.",
      "explanation_cn": "指在科技或工业中使用的薄层或薄膜，如半导体膜或过滤膜，用于实现特定功能。",
      "example_en": "Reverse osmosis membranes are used to purify drinking water by removing salts and impurities.",
      "example_cn": "反渗透膜通过去除盐分和杂质来净化饮用水。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "film",
      "analysis": "“Film”（薄膜）泛指任何极薄的层状物，可以是液体干燥后形成的（如油膜），也可以是人工制造的（如塑料薄膜）。它不强调生物功能或选择性屏障作用，而 “membrane” 通常具有生理或工程上的选择性通透性，功能更明确。"
    },
    {
      "word_to_compare": "skin",
      "analysis": "“Skin”（皮肤）通常指生物体最外层的保护性组织，如人类皮肤或动物皮。它更具体、更厚实，且多用于宏观生物体表面；而 “membrane” 更薄、更广泛，可存在于体内或微观层面，如细胞膜或组织膜。"
    },
    {
      "word_to_compare": "layer",
      "analysis": "“Layer”（层）是一个通用词，指任何堆叠或覆盖的结构，不具特定结构或功能含义。它可以是土层、漆层、云层等。而 “membrane” 特指具有生物、物理或工程功能的薄层，强调其作为屏障或界面的特性。"
    }
  ]
}