{
  "word": "memorials",
  "pronunciation": "mem·uh·ree·uhlz",
  "concise_definition": "n. 纪念物, 纪念碑, 纪念活动",
  "forms": {
    "singular": "memorial"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A structure, object, or ceremony created to honor and remember a person, group, or event, especially one who has died or something significant that has occurred.",
      "explanation_cn": "为纪念某人、某群体或某事件（尤其是已故者或重大事件）而建立的建筑、物品或仪式。",
      "example_en": "The Vietnam Veterans Memorial in Washington, D.C., bears the names of over 58,000 fallen soldiers.",
      "example_cn": "华盛顿特区的越南战争老兵纪念碑上刻有超过五万八千名阵亡士兵的名字。"
    },
    {
      "pos": "noun",
      "explanation_en": "A written or spoken tribute expressing remembrance, often in the form of a speech, book, or inscription.",
      "explanation_cn": "以文字或言语形式表达追思的纪念性陈述，常表现为演讲、书籍或铭文。",
      "example_en": "At the funeral, her family read a heartfelt memorial written by her closest friend.",
      "example_cn": "在葬礼上，她的家人朗读了她最亲密朋友写的一篇感人至深的悼词。"
    },
    {
      "pos": "noun",
      "explanation_en": "An annual or periodic event held to commemorate a historical occasion or loss, often involving public participation.",
      "explanation_cn": "为纪念某一历史事件或损失而定期举行的公众活动，通常包含集体参与。",
      "example_en": "Every year on April 25, Australians observe Anzac Day as a national memorial to those who served in wartime.",
      "example_cn": "每年4月25日，澳大利亚人都会举行澳新军团日，作为对所有参战人员的全国性纪念活动。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "monument",
      "analysis": "“Monument”（纪念碑）通常指具体的、永久性的物理结构，如雕像、石碑或建筑，其主要功能是视觉化地纪念某人或某事。而 “memorial” 范围更广，可以是实体的，也可以是抽象的（如纪念日、仪式或文字），更强调情感与记忆的传达。"
    },
    {
      "word_to_compare": "tribute",
      "analysis": "“Tribute”（致敬）泛指任何形式的表达敬意的行为或作品，可以是礼物、演讲、表演等，不一定与死亡或损失相关，且不一定具有公共性或永久性。而 “memorial” 通常特指对逝者或重大悲剧的纪念，具有庄重性和纪念目的。"
    },
    {
      "word_to_compare": "commemoration",
      "analysis": "“Commemoration”（纪念活动）是动词 “commemorate” 的名词形式，强调举行仪式或活动以铭记某事，侧重于行为过程。而 “memorial” 更常指纪念的产物或载体（如纪念碑、铭文），是结果而非过程。两者常共现，但 “memorial” 是实体或象征，而 “commemoration” 是事件本身。"
    }
  ]
}