{
  "word": "memorial",
  "pronunciation": "meh·moh·ree·uhl",
  "concise_definition": "n. 纪念物, 纪念碑, 纪念仪式; adj. 纪念的, 纪念性的",
  "forms": {
    "plural": "memorials",
    "adjective_form": "memorial"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A structure, object, or ceremony established to honor and remember a person, event, or group, especially one who has died or something significant that has occurred.",
      "explanation_cn": "为纪念某人、某事件或某群体（尤其是已故者或重大事件）而设立的建筑、物品或仪式。",
      "example_en": "The Vietnam Veterans Memorial in Washington, D.C., honors those who served and died in the Vietnam War.",
      "example_cn": "华盛顿特区的越南战争老兵纪念碑，纪念在越战中服役和牺牲的人们。"
    },
    {
      "pos": "noun",
      "explanation_en": "A written or spoken statement presented to an authority, especially to express a request, complaint, or tribute, often in a formal context.",
      "explanation_cn": "一种提交给权威机构的书面或口头陈述，通常用于表达请求、申诉或致敬，多用于正式场合。",
      "example_en": "The citizens submitted a memorial to the city council requesting better public transportation.",
      "example_cn": "市民向市议会提交了一份请愿书，要求改善公共交通。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Designed or intended to honor and remember someone or something, especially in a solemn or respectful way.",
      "explanation_cn": "旨在以庄重或尊敬的方式纪念某人或某事的。",
      "example_en": "They held a memorial service to mark the tenth anniversary of the tragedy.",
      "example_cn": "他们举行了一场纪念仪式，以纪念这场悲剧发生十周年。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "monument",
      "analysis": "“Monument”（纪念碑）通常指为纪念重要人物或事件而建造的大型、永久性建筑或雕塑，强调物理形态和公共性。而 “memorial” 更广泛，可以是纪念碑、仪式、文字甚至数字形式，不一定具有实体结构，更侧重纪念行为本身的意义。"
    },
    {
      "word_to_compare": "tribute",
      "analysis": "“Tribute”（致敬）是表达敬意或感激的行为或言语，可以是口头、书面、表演或礼物，形式灵活，不一定与死亡或损失相关。而 “memorial” 通常与纪念逝者或重大灾难有关，情感基调更庄重、肃穆。"
    },
    {
      "word_to_compare": "commemoration",
      "analysis": "“Commemoration”（纪念活动）是泛指为纪念某事而举行的仪式或活动，强调过程和集体参与。而 “memorial” 可以是仪式，也可以是实体对象（如纪念碑），更常作为纪念行为的产物或载体。两者常可互换，但 “commemoration” 更侧重动态的纪念行为，而 “memorial” 更侧重静态的纪念物或结果。"
    }
  ]
}