{
  "word": "mercury",
  "pronunciation": "mehr·kyoo·ree",
  "concise_definition": "n. 水银, 水星, 墨丘利",
  "forms": {
    "plural": "mercuries"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A heavy, silvery-white metallic element that is liquid at room temperature, used in thermometers, barometers, and some electrical switches due to its unique physical properties.",
      "explanation_cn": "一种在室温下呈液态的重银白色金属元素，因其独特的物理性质，常用于温度计、气压计和某些电气开关中。",
      "example_en": "The thermometer contains a small amount of mercury to measure temperature changes.",
      "example_cn": "温度计中含有少量水银，用于测量温度变化。"
    },
    {
      "pos": "noun",
      "explanation_en": "The closest planet to the Sun, known for its rapid orbit, extreme temperature variations, and heavily cratered surface.",
      "explanation_cn": "太阳系中离太阳最近的行星，以其快速的公转轨道、极端的温差和布满陨石坑的表面而闻名。",
      "example_en": "Astronomers have detected signs of water ice in the shadowed craters of Mercury.",
      "example_cn": "天文学家已在水星阴影陨石坑中发现了水冰的迹象。"
    },
    {
      "pos": "noun",
      "explanation_en": "In Roman mythology, the messenger god associated with commerce, travel, and communication; equivalent to the Greek god Hermes.",
      "explanation_cn": "在罗马神话中，作为商业、旅行和沟通的信使神，相当于希腊神话中的赫尔墨斯。",
      "example_en": "The symbol of Mercury, with wings on his helmet and sandals, is still used today to represent speed and communication.",
      "example_cn": "墨丘利头戴带翼头盔、脚穿带翼凉鞋的符号，至今仍被用来象征速度与沟通。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "quicksilver",
      "analysis": "“Quicksilver” 是 “mercury”（水银）的古语或诗意表达，特指其流动性强、银光闪闪的特性，常用于文学或历史语境中。现代科学和日常用语中几乎只用 “mercury”。两者指同一物质，但 “quicksilver” 不用于天文学或神话含义。"
    },
    {
      "word_to_compare": "venus",
      "analysis": "“Venus”（金星）是太阳系中另一颗行星，常与 Mercury 并列比较，但两者在物理特征和文化象征上截然不同。Mercury 以速度和流动性著称，而 Venus 以美丽和温暖闻名。在神话中，Mercury 是信使，Venus 是爱与美之神。"
    },
    {
      "word_to_compare": "hershel",
      "analysis": "“Hershel” 是一个姓氏（如天文学家威廉·赫歇尔），与 “mercury” 无语义关联。此处为干扰项，但为严谨起见，需指出：它既非元素、行星，也非神祇，与 mercury 在任何语义维度上均无重叠。"
    }
  ]
}