{
  "word": "mercenaries",
  "pronunciation": "mehr·sen·uh·reez",
  "concise_definition": "n. 雇佣兵, 为金钱而战的人",
  "forms": {
    "singular": "mercenary"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A professional soldier who fights for money rather than for a cause or country, typically hired by a foreign government or private entity.",
      "explanation_cn": "指为金钱而战的职业士兵，通常受雇于外国政府或私人实体，而非出于对国家或信仰的忠诚。",
      "example_en": "The rebel group was accused of hiring mercenaries to strengthen their forces.",
      "example_cn": "该叛乱组织被指控雇佣雇佣兵以增强其兵力。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is motivated primarily by financial gain rather than principle, often used metaphorically to describe someone who lacks loyalty or integrity.",
      "explanation_cn": "比喻指那些以金钱利益为主要动机、缺乏原则或忠诚的人，常用于批评功利主义的行为。",
      "example_en": "He's been called a mercenary journalist, willing to write anything for the highest bidder.",
      "example_cn": "他被称为一名功利的记者，为了最高出价者愿意撰写任何内容。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Driven by the desire for monetary reward rather than by moral, ethical, or patriotic considerations.",
      "explanation_cn": "指由对金钱回报的渴望所驱动，而非出于道德、伦理或爱国考虑的。",
      "example_en": "The company's mercenary approach to customer data raised serious privacy concerns.",
      "example_cn": "该公司对客户数据的功利主义做法引发了严重的隐私担忧。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "soldiers",
      "analysis": "“Soldiers”（士兵）通常指为国家或合法政府服役的武装人员，其动机包括忠诚、义务或爱国主义。而 “mercenaries” 的核心特征是纯粹以金钱为报酬，缺乏政治或道德归属，常被视为缺乏正当性。"
    },
    {
      "word_to_compare": "freelancers",
      "analysis": "“Freelancers”（自由职业者）指在非雇佣关系下提供专业服务（如写作、设计）的人，其工作通常合法且受市场规范约束。而 “mercenaries” 特指参与暴力或军事行动的付费人员，带有负面道德色彩，二者在性质和语境上截然不同。"
    },
    {
      "word_to_compare": "hired guns",
      "analysis": "“Hired guns” 是 “mercenaries” 的非正式同义表达，常用于口语或文学中，强调其武器使用者的身份和被雇佣的暴力属性。两者几乎可互换，但 “hired guns” 更具俚语色彩，且多用于北美英语语境，而 “mercenaries” 更正式、广泛用于法律和国际关系文本中。"
    }
  ]
}