{
  "word": "meridian",
  "pronunciation": "muh·rid·ee·uhn",
  "concise_definition": "n. 子午线, 经线, 最高点, 顶点",
  "forms": {
    "plural": "meridians"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An imaginary line on the Earth's surface running from the North Pole to the South Pole, used to measure longitude and determine time zones.",
      "explanation_cn": "地球表面上一条假想的线，从北极延伸至南极，用于测量经度和确定时区。",
      "example_en": "The Prime Meridian passes through Greenwich, England, and is defined as 0 degrees longitude.",
      "example_cn": "本初子午线穿过英国格林威治，被定义为零度经线。"
    },
    {
      "pos": "noun",
      "explanation_en": "In traditional Chinese medicine, a pathway through which vital energy (qi) flows; there are twelve main meridians connecting organs and body parts.",
      "explanation_cn": "在中医中，指气血运行的通道；共有十二条主要经络，连接人体各脏腑与部位。",
      "example_en": "Acupuncture targets specific meridians to restore the balance of qi in the body.",
      "example_cn": "针灸通过刺激特定的经络来恢复人体内气血的平衡。"
    },
    {
      "pos": "noun",
      "explanation_en": "The highest point or peak of something, especially in terms of influence, power, or success; often used metaphorically.",
      "explanation_cn": "指某事物的最高点或巅峰，尤指在影响力、权力或成就方面的顶峰，常用于比喻意义。",
      "example_en": "The artist's career reached its meridian in the 1980s with a series of groundbreaking albums.",
      "example_cn": "这位艺术家在20世纪80年代凭借一系列开创性的专辑达到了事业的巅峰。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "longitude",
      "analysis": "“Longitude”（经度）是测量东西位置的数值（以度为单位），而 “meridian” 是承载这些数值的地理线本身。前者是量度，后者是实体线。例如，我们说 ‘the 120th meridian’，但不说 ‘the 120th longitude’。"
    },
    {
      "word_to_compare": "axis",
      "analysis": "“Axis”（轴）泛指任何旋转或对称的中心线，可以是物理的（如地球自转轴）或抽象的（如思想轴线）。“Meridian” 是特定于地理或中医语境中的垂直线，具有明确的功能和文化含义，范围更窄。"
    },
    {
      "word_to_compare": "apex",
      "analysis": "“Apex”（顶点）与 “meridian” 在比喻义上相近，都表示最高点，但 “apex” 更通用，适用于任何领域的巅峰（如山峰、组织结构），而 “meridian” 作为比喻时带有更强的文学性和时间性，常用于描述成就或影响力的巅峰时刻，更具诗意。"
    }
  ]
}