{
  "word": "metaphysical",
  "pronunciation": "me·tuh·fiz·i·kəl",
  "concise_definition": "adj. 形而上学的, 超越物理的, 抽象的",
  "forms": {
    "comparative": "metaphysical",
    "superlative": "metaphysical"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to metaphysics, the branch of philosophy that explores the nature of reality, existence, and the fundamental principles of being beyond the physical world.",
      "explanation_cn": "与形而上学相关的，指哲学中研究现实本质、存在以及超越物理世界的根本原理的领域。",
      "example_en": "The poet explored metaphysical questions about the soul and eternity.",
      "example_cn": "这位诗人探讨了关于灵魂与永恒的形而上学问题。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Extremely abstract or theoretical; not based on physical or empirical evidence, often dealing with concepts that cannot be observed or measured.",
      "explanation_cn": "极为抽象或理论化的；不基于物理或经验证据，常涉及无法观察或测量的概念。",
      "example_en": "His argument was so metaphysical that it failed to address any practical concerns.",
      "example_cn": "他的论点太过抽象，未能触及任何实际问题。"
    },
    {
      "pos": "adjective",
      "explanation_en": "In literature and art, describing a style that blends intellectual complexity with emotional intensity, especially characteristic of 17th-century poets like John Donne.",
      "explanation_cn": "在文学与艺术中，指一种融合智力复杂性与情感强度的风格，尤指17世纪如约翰·多恩等诗人的创作特点。",
      "example_en": "Donne’s metaphysical poetry uses surprising analogies to connect spiritual and physical experiences.",
      "example_cn": "多恩的形而上学诗歌运用出人意料的类比，将精神体验与肉体经验联系起来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "philosophical",
      "analysis": "“Philosophical”（哲学的）范围更广，泛指任何与哲学思考相关的内容，包括伦理、认识论、逻辑等；而 “metaphysical” 是哲学的一个子领域，专指探讨存在、实体、因果等超越经验的终极问题，更具特定性和抽象性。"
    },
    {
      "word_to_compare": "abstract",
      "analysis": "“Abstract”（抽象的）是一个通用词，指脱离具体实例或感官经验的概念，可用于数学、艺术或思维等多个领域；而 “metaphysical” 特指哲学传统中对超验实在的探讨，具有历史和学术语境的限定性，比 “abstract” 更具专业深度。"
    },
    {
      "word_to_compare": "spiritual",
      "analysis": "“Spiritual”（精神的）强调与灵魂、信仰、宗教体验相关的内在感受，常带有情感或宗教色彩；而 “metaphysical” 更偏向理性思辨，不必然涉及信仰，而是通过逻辑推理探讨存在本质，二者虽有重叠，但方法论和目的不同。"
    }
  ]
}