{
  "word": "metals",
  "pronunciation": "mee·tuhls",
  "concise_definition": "n. 金属, 金属材料",
  "forms": {
    "singular": "metal"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A class of solid elements characterized by high electrical and thermal conductivity, luster, malleability, and ductility, typically forming positive ions by losing electrons; commonly used in construction, manufacturing, and electronics.",
      "explanation_cn": "一类固态元素，具有高导电性、导热性、光泽、延展性和可锻性，通常通过失去电子形成正离子；广泛用于建筑、制造和电子工业。",
      "example_en": "Copper, iron, and aluminum are common metals used in electrical wiring.",
      "example_cn": "铜、铁和铝是用于电线的常见金属。"
    },
    {
      "pos": "noun",
      "explanation_en": "A material or alloy composed primarily of metallic elements, often combined to enhance strength, durability, or resistance to corrosion.",
      "explanation_cn": "主要由金属元素组成或以金属元素为主要成分的材料或合金，常通过组合以增强强度、耐久性或抗腐蚀性。",
      "example_en": "Stainless steel is a metal alloy of iron, chromium, and nickel.",
      "example_cn": "不锈钢是一种由铁、铬和镍组成的金属合金。"
    },
    {
      "pos": "noun",
      "explanation_en": "In music, a category of instruments that produce sound by vibration of metal, such as trumpets, cymbals, and tubas.",
      "explanation_cn": "在音乐中，指通过金属振动发声的一类乐器，如小号、钹和大号。",
      "example_en": "The brass section of the orchestra includes several metals like trombones and French horns.",
      "example_cn": "管弦乐队的铜管乐器组包括小号、长号和圆号等金属乐器。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "alloy",
      "analysis": "“Alloy” (合金) 指由两种或多种元素（至少一种为金属）熔合而成的混合物，目的是改善性能，如强度或耐腐蚀性。而 “metals” 是更广泛的类别，包括纯金属（如纯铁）和合金（如钢）。所有合金都属于金属材料，但并非所有金属都是合金。"
    },
    {
      "word_to_compare": "minerals",
      "analysis": "“Minerals” (矿物) 是自然界中天然形成的无机固体，具有特定化学成分和晶体结构，金属元素常以矿物形式存在于地壳中（如赤铁矿含铁）。但矿物不一定是金属，也可能是非金属（如石英）。而 “metals” 是指具有特定物理性质的元素或材料，通常需从矿物中提炼获得。"
    },
    {
      "word_to_compare": "elements",
      "analysis": "“Elements” (元素) 是化学上不可再分的纯物质，金属是元素周期表中的一类元素（如金、银、锌）。但并非所有元素都是金属（如氧、碳是非金属）。“Metals” 作为名词时，通常指具有金属特性的物质，可以是纯元素，也可以是合金，而 “elements” 是更基础的化学分类概念。"
    }
  ]
}