{
  "word": "metropolitan",
  "pronunciation": "met·uh·puh·li·tuhn",
  "concise_definition": "adj. 大都市的, 大城市的; n. 大主教, 都主教",
  "forms": {
    "comparative": "metropolitan",
    "superlative": "metropolitan",
    "noun_plural": "metropolitans"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characteristic of a large, important city and its surrounding area, especially in terms of population, infrastructure, or cultural influence.",
      "explanation_cn": "指与一个大型重要城市及其周边地区相关或具有其特征的，尤其在人口、基础设施或文化影响力方面。",
      "example_en": "The metropolitan area of Tokyo includes over 37 million people.",
      "example_cn": "东京大都市区的人口超过三千七百万。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Of or relating to a metropolitan church or diocese, especially in the context of Eastern Orthodox or Anglican ecclesiastical hierarchy.",
      "explanation_cn": "指与大主教区或大教区相关的，尤其在东正教或圣公会教会等级制度中。",
      "example_en": "The metropolitan presided over the synod of bishops from the region.",
      "example_cn": "大主教主持了该地区主教们的主教会议。"
    },
    {
      "pos": "noun",
      "explanation_en": "A high-ranking bishop in certain Christian churches, especially in Eastern Orthodoxy, who has authority over other bishops in a metropolitan province.",
      "explanation_cn": "在某些基督教教会（尤其是东正教）中，拥有对大主教区范围内其他主教管辖权的高级主教。",
      "example_en": "The metropolitan of Athens is one of the most influential religious leaders in Greece.",
      "example_cn": "雅典大主教是希腊最具影响力的宗教领袖之一。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "urban",
      "analysis": "“Urban”（城市的）泛指任何城市地区的特征，适用于各种规模的城市，甚至包括中小城市；而 “metropolitan” 特指大型、具有全国或国际影响力的核心都市及其辐射区域，强调规模、复杂性和中心地位。"
    },
    {
      "word_to_compare": "cosmopolitan",
      "analysis": "“Cosmopolitan”（国际化的）强调文化多样性、全球性与开放性，常用于描述人口构成或社会氛围；而 “metropolitan” 更侧重地理、行政和人口规模上的“大都市”属性，不一定包含文化多元的含义。"
    },
    {
      "word_to_compare": "city",
      "analysis": "“City”（城市）是一个基本的地理行政单位，指一个有明确边界的居民聚居区；而 “metropolitan” 是一个形容词或名词，描述的是由中心城市及其通勤郊区共同构成的更大功能区域，常用于统计和规划语境，如 “metropolitan statistical area”。"
    }
  ]
}