{
  "word": "mexican",
  "pronunciation": "mehk·sih·kun",
  "concise_definition": "adj. 墨西哥的, 墨西哥人的; n. 墨西哥人, 墨西哥语",
  "forms": {
    "plural": "mexicans",
    "comparative": "more mexican",
    "superlative": "most mexican"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or originating from Mexico, its people, culture, language, or geography.",
      "explanation_cn": "与墨西哥有关的，或源自墨西哥的，包括其人民、文化、语言或地理特征。",
      "example_en": "She loves cooking mexican food, especially tacos and mole sauce.",
      "example_cn": "她喜欢做墨西哥菜，尤其是玉米饼和摩尔酱。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characteristic of the style, traditions, or aesthetics associated with Mexico, such as vibrant colors, folk art, or mariachi music.",
      "explanation_cn": "具有与墨西哥相关的风格、传统或美学特征，如鲜艳的色彩、民间艺术或马里亚奇音乐。",
      "example_en": "The festival was decorated with mexican papel picado banners and colorful altars.",
      "example_cn": "节日装饰着墨西哥的剪纸彩旗和五彩缤纷的祭坛。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is a native or citizen of Mexico.",
      "explanation_cn": "墨西哥的原住民或公民。",
      "example_en": "Many mexicans celebrate Día de los Muertos with family gatherings and offerings to ancestors.",
      "example_cn": "许多墨西哥人会通过家庭聚会和供奉祖先来庆祝亡灵节。"
    },
    {
      "pos": "noun",
      "explanation_en": "The Spanish-based language spoken in Mexico, which includes regional variations and indigenous influences.",
      "explanation_cn": "在墨西哥使用的以西班牙语为基础的语言，包含地区性变体和土著语言的影响。",
      "example_en": "Although spanish is the official language, some mexicans also speak nahuatl or mayan dialects.",
      "example_cn": "尽管西班牙语是官方语言，但一些墨西哥人也说纳瓦特尔语或玛雅语方言。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "latino",
      "analysis": "“Latino”（拉丁裔）是一个更广泛的术语，指来自拉丁美洲（包括中美洲、南美洲和加勒比地区）的人或文化，涵盖西班牙语、葡萄牙语等背景。而 “mexican” 仅特指墨西哥，是 “latino” 的一个子集。并非所有拉丁裔都是墨西哥人，但所有墨西哥人都是拉丁裔。"
    },
    {
      "word_to_compare": "hispanic",
      "analysis": "“Hispanic”（西班牙裔）指来自西班牙语国家或具有西班牙语文化背景的人，包括西班牙本土居民。而 “mexican” 仅指墨西哥人。所有墨西哥人都是西班牙裔，但西班牙裔不一定是墨西哥人（如阿根廷人、古巴人）。此外，巴西人是拉丁裔但不是西班牙裔，因为他们说葡萄牙语。"
    },
    {
      "word_to_compare": "chicano",
      "analysis": "“Chicano”（奇卡诺）是特指在美国出生的墨西哥裔美国人，常带有政治和文化认同的含义，强调对墨西哥根源的自豪感和对美国社会不公的抗争。它不是地理意义上的 “mexican”，而是一种族裔身份标签，多用于美国语境中。"
    }
  ]
}