{
  "word": "middle",
  "pronunciation": "mid·uhl",
  "concise_definition": "n. 中间, 中部; adj. 中间的, 中等的",
  "forms": {
    "comparative": "middler",
    "superlative": "middlest"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The central part or point of something, whether physical, temporal, or abstract, often equidistant from two extremes.",
      "explanation_cn": "指某物的中心部分或点，无论是物理空间、时间还是抽象概念，通常位于两个极端之间且等距。",
      "example_en": "She stood in the middle of the room, waiting for everyone to arrive.",
      "example_cn": "她站在房间中央，等待所有人到来。"
    },
    {
      "pos": "noun",
      "explanation_en": "The intermediate stage or period in a process, sequence, or life cycle, often implying a transition between beginning and end.",
      "explanation_cn": "指一个过程、序列或生命周期中的中间阶段，常暗示从开始到结束的过渡时期。",
      "example_en": "The middle of the movie was the most suspenseful part.",
      "example_cn": "电影的中段是最紧张刺激的部分。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Located or occurring between two extremes, not at either end or edge; can refer to position, quantity, quality, or social status.",
      "explanation_cn": "位于两个极端之间，不在任一端或边缘；可指位置、数量、质量或社会地位。",
      "example_en": "He has a middle-class income and lives in a modest neighborhood.",
      "example_cn": "他有中等收入，住在普通的社区。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Of average size, degree, or quality; neither large nor small, strong nor weak, good nor bad.",
      "explanation_cn": "指尺寸、程度或质量属平均水平的，既不大也不小，不强也不弱，不好也不坏。",
      "example_en": "The restaurant offers a middle-priced menu that appeals to most customers.",
      "example_cn": "这家餐厅提供价格适中的菜单，迎合大多数顾客。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "center",
      "analysis": "“Center” (中心) 强调几何或物理上的绝对中心点，常用于空间或结构的正中央，如地球的中心、圆的中心。而 “middle” 更广泛，可用于时间、过程、序列或抽象概念，且不一定要求精确对称。"
    },
    {
      "word_to_compare": "intermediate",
      "analysis": "“Intermediate” (中间的) 更正式，常用于教育、技能或发展阶段，强调处于两个明确层级之间的过渡状态，如中级课程。而 “middle” 更口语化，适用范围更广，包括位置、年龄、社会阶层等，不强调层级关系。"
    },
    {
      "word_to_compare": "mid",
      "analysis": "“Mid” 是 “middle” 的缩略形式，通常作为前缀使用（如 midday, midlife），不能单独作名词或形容词。它仅用于复合词中表达“中期”或“中部”的概念，而 “middle” 可独立使用并承担完整语法功能。"
    }
  ]
}