{
  "word": "militant",
  "pronunciation": "mil·uh·tuhnt",
  "concise_definition": "adj. 好战的, 激进的; n. 激进分子, 好战分子",
  "forms": {
    "comparative": "more militant",
    "superlative": "most militant",
    "plural": "militants"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Showing a aggressive, combative, or uncompromising attitude, especially in support of a political or social cause; willing to use force or extreme measures to achieve goals.",
      "explanation_cn": "表现出好战、好斗或不妥协的态度，尤其在支持某种政治或社会事业时；愿意使用武力或极端手段实现目标。",
      "example_en": "The militant union leaders demanded immediate wage increases.",
      "example_cn": "这些激进的工会领导人要求立即加薪。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by or involving active, often violent, resistance or opposition, especially against authority or established systems.",
      "explanation_cn": "以积极、常为暴力的抵抗或反对为特征，尤其针对权威或既定制度。",
      "example_en": "The militant protests turned violent when police intervened.",
      "example_cn": "当警察介入时，这些激进的抗议活动演变成了暴力冲突。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is aggressively active in support of a cause, especially one involving political or social change through force or confrontation.",
      "explanation_cn": "指积极投身于某项事业、尤其通过武力或对抗推动政治或社会变革的人。",
      "example_en": "Several militants were arrested after the raid on the government building.",
      "example_cn": "在对政府大楼的突袭后，数名激进分子被逮捕。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "aggressive",
      "analysis": "“Aggressive” (好斗的) 描述一种主动进攻或强势的行为方式，可用于竞争、商业或人际交往，不一定涉及政治立场或暴力。而 “militant” 特指为政治或社会目标而采取的武装或极端对抗态度，语义更强烈且常具意识形态色彩。"
    },
    {
      "word_to_compare": "radical",
      "analysis": "“Radical” (激进的) 强调对根本性变革的追求，可能通过非暴力手段（如思想宣传）实现，而 “militant” 则强调使用武力或直接对抗的行动方式。一个激进分子未必是好战分子，但一个好战分子通常是激进的。"
    },
    {
      "word_to_compare": "extremist",
      "analysis": "“Extremist” (极端分子) 指持有极端观点或立场的人，其行为可能包括暴力，但不一定主动采取武装行动；而 “militant” 更强调行动上的战斗性和组织性，常指实际参与暴力或准军事活动的人。因此，所有 militant 都可能是 extremist，但并非所有 extremist 都是 militant。"
    }
  ]
}