{
  "word": "milk",
  "pronunciation": "milk",
  "concise_definition": "n. 牛奶；v. 挤奶，榨取，利用",
  "forms": {
    "plural": "milks",
    "third_person_singular": "milks",
    "past_tense": "milked",
    "past_participle": "milked",
    "present_participle": "milking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A white liquid produced by the mammary glands of female mammals, especially cows, used as a beverage or ingredient in food preparation.",
      "explanation_cn": "雌性哺乳动物（尤其是奶牛）乳腺分泌的白色液体，用作饮品或食品原料。",
      "example_en": "She poured a glass of cold milk over her cereal.",
      "example_cn": "她把一杯冷牛奶倒在麦片上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A plant-based liquid that resembles milk in texture and use, such as almond milk or soy milk.",
      "explanation_cn": "一种植物性液体，质地和用途类似牛奶，如杏仁奶或豆奶。",
      "example_en": "Many people now choose oat milk as a dairy-free alternative.",
      "example_cn": "许多人现在选择燕麦奶作为无乳制品的替代品。"
    },
    {
      "pos": "verb",
      "explanation_en": "To extract milk from the udders of a mammal, typically a cow or goat, by hand or machine.",
      "explanation_cn": "用手或机器从哺乳动物（通常是奶牛或山羊）的乳房中挤出牛奶。",
      "example_en": "The farmer milks the cows every morning at five.",
      "example_cn": "农夫每天早上五点给奶牛挤奶。"
    },
    {
      "pos": "verb",
      "explanation_en": "To exploit or take advantage of someone or something for personal gain, often in a manipulative or excessive way.",
      "explanation_cn": "以操纵或过度的方式利用某人或某物以谋取私利。",
      "example_en": "He's been milking the system for free healthcare benefits for years.",
      "example_cn": "多年来他一直在利用这个系统获取免费的医疗福利。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cream",
      "analysis": "“Cream”（奶油）是牛奶中脂肪含量较高的上层部分，通常通过分离获得，质地更浓稠，用于烹饪或直接食用。而 “milk” 是未经分离的完整液体，脂肪含量较低，用途更广泛。两者是成分关系，而非同义词。"
    },
    {
      "word_to_compare": "dairy",
      "analysis": "“Dairy”（乳制品）是一个总称，包括牛奶、奶酪、黄油、酸奶等所有由牛奶制成的产品。而 “milk” 是 dairy 的核心原料，是其中一种具体形式。因此，“dairy” 是类别词，而 “milk” 是成员词。"
    },
    {
      "word_to_compare": "extract",
      "analysis": "“Extract”（提取）是一个更广泛的动词，指从任何物质中分离出某种成分，如提取精油或提取信息。而 “milk” 作为动词时特指从生物体（如动物乳房）中挤出液体，或隐喻性地榨取利益，具有更强的具象性和情感色彩。"
    }
  ]
}