{
  "word": "milking",
  "pronunciation": "milk·ing",
  "concise_definition": "n. 挤奶, 榨取; v. 挤奶, 榨取, 利用",
  "forms": {
    "base_form": "milk",
    "third_person_singular": "milks",
    "past_tense": "milked",
    "past_participle": "milked",
    "present_participle": "milking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of extracting milk from the udders of a cow, goat, or other lactating animal, typically using manual or mechanical methods.",
      "explanation_cn": "指通过手工或机械方式从奶牛、山羊或其他泌乳动物的乳房中提取牛奶的行为。",
      "example_en": "The farmer started his day at dawn with the morning milking.",
      "example_cn": "农夫在黎明时分开始一天的晨间挤奶工作。"
    },
    {
      "pos": "verb",
      "explanation_en": "To extract milk from an animal, especially a cow or goat, by pressing or squeezing the teats.",
      "explanation_cn": "通过按压或挤压乳头从动物（尤其是奶牛或山羊）身上挤出牛奶。",
      "example_en": "She spends an hour each day milking her three goats.",
      "example_cn": "她每天花一小时给她的三只山羊挤奶。"
    },
    {
      "pos": "verb",
      "explanation_en": "To exploit or take advantage of a situation, person, or system for personal gain, often excessively or unfairly.",
      "explanation_cn": "指过度或不公平地利用某种情况、人或系统以谋取私利，常含贬义。",
      "example_en": "The politicians were accused of milking the crisis for media attention.",
      "example_cn": "这些政客被指控利用这场危机博取媒体关注。"
    },
    {
      "pos": "verb",
      "explanation_en": "To prolong or drag out a situation, especially to extract more benefit or delay an end.",
      "explanation_cn": "指故意拖延某个情境，以获取更多利益或推迟结束。",
      "example_en": "He was milking the joke for all it was worth, making the audience laugh longer.",
      "example_cn": "他把那个笑话反复讲，尽量榨取它的笑果，让观众笑了更久。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "squeezing",
      "analysis": "“Squeezing” (挤压) 通常指物理上的施压动作，也可比喻性地表示强迫某人提供资源，但语气更直接、粗暴，常用于负面语境（如“squeezing money out of someone”）。而 “milking” 更强调持续、反复、系统性地榨取，带有策略性和耐性，常用于描述利用体制或情绪获取长期利益。"
    },
    {
      "word_to_compare": "exploiting",
      "analysis": "“Exploiting” (剥削) 是一个更广泛、更正式的词，指利用他人或资源以获取利益，通常涉及权力不平等或道德问题，如剥削劳工。而 “milking” 更口语化，常用于描述对情境、机会或公众情绪的“过度利用”，不一定涉及压迫，但隐含过度和贪婪。"
    },
    {
      "word_to_compare": "draining",
      "analysis": "“Draining” (耗尽) 强调资源或能量被逐渐抽空，导致枯竭，如“draining the battery”或“draining one’s patience”。而 “milking” 侧重于主动、有意识地持续获取利益，不一定导致枯竭，有时甚至能持续很长时间而不被察觉。"
    }
  ]
}