{
  "word": "mill",
  "pronunciation": "mil",
  "concise_definition": "n. 磨坊, 工厂; v. 磨碎, 加工",
  "forms": {
    "plural": "mills",
    "third_person_singular": "mills",
    "past_tense": "milled",
    "past_participle": "milled",
    "present_participle": "milling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A building or facility equipped with machinery for grinding grain into flour, or for processing raw materials through mechanical means.",
      "explanation_cn": "指配备机械以将谷物研磨成面粉，或对原材料进行机械加工的建筑物或设施。",
      "example_en": "The old water mill on the river still turns with the current.",
      "example_cn": "河上的那座旧水磨坊仍随着水流转动。"
    },
    {
      "pos": "noun",
      "explanation_en": "A factory or industrial plant, especially one that processes materials such as metal, paper, or textiles.",
      "explanation_cn": "指工厂或工业设施，尤指加工金属、纸张或纺织品的工厂。",
      "example_en": "The steel mill employs over a thousand workers and produces thousands of tons of steel each month.",
      "example_cn": "这家钢铁厂雇佣了上千名工人，每月生产数千吨钢材。"
    },
    {
      "pos": "verb",
      "explanation_en": "To grind or crush something, especially grain or metal, using a mill or similar machinery.",
      "explanation_cn": "指使用磨坊或类似机械将某物（尤其是谷物或金属）研磨或压碎。",
      "example_en": "Farmers used to mill their own wheat to make flour.",
      "example_cn": "以前农民会自己磨小麦来制作面粉。"
    },
    {
      "pos": "verb",
      "explanation_en": "To shape or form material, especially metal, by passing it through rollers or cutting tools in a manufacturing process.",
      "explanation_cn": "指在制造过程中通过轧辊或切削工具将材料（尤其是金属）加工成特定形状。",
      "example_en": "The aluminum was milled into thin sheets for use in aircraft construction.",
      "example_cn": "铝材被轧制成薄片，用于飞机制造。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "factory",
      "analysis": "“Factory”（工厂）泛指任何进行工业生产的场所，强调大规模制造和装配；而 “mill” 通常特指以机械加工、研磨或轧制为主要工艺的工厂，如磨坊、钢厂、纸浆厂，带有更传统或特定工艺的含义。"
    },
    {
      "word_to_compare": "grind",
      "analysis": "“Grind”（研磨）是描述动作的动词，泛指通过摩擦使物体变细或破碎，可手工或机械完成；而 “mill” 作为动词时，特指使用专门的磨机或加工设备进行的系统性研磨或成型，常用于工业语境，语义更专业、更具体。"
    },
    {
      "word_to_compare": "plant",
      "analysis": "“Plant”（工厂/装置）是更广泛的术语，可指任何工业设施，包括发电厂、化工厂等；而 “mill” 通常限于涉及物理加工（如轧制、研磨）的场所，语义范围更窄，且常与金属、木材、谷物等原材料的加工相关。"
    }
  ]
}