{
  "word": "mills",
  "pronunciation": "milz",
  "concise_definition": "n. 磨坊, 工厂, 机器; v. 磨碎, 加工",
  "forms": {
    "singular": "mill"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A building or facility equipped with machinery for grinding grain into flour, or for processing raw materials through mechanical means.",
      "explanation_cn": "指配备机械以将谷物研磨成面粉，或对原材料进行机械加工的建筑物或设施。",
      "example_en": "The old water mill on the riverbank still stands, though it no longer grinds wheat.",
      "example_cn": "河边那座旧水磨坊依然矗立，尽管它已不再研磨小麦。"
    },
    {
      "pos": "noun",
      "explanation_en": "A factory or industrial plant, especially one involved in large-scale manufacturing or processing, such as a steel mill or textile mill.",
      "explanation_cn": "指进行大规模制造或加工的工厂，如钢铁厂、纺织厂等。",
      "example_en": "Thousands of workers were employed at the steel mill during its peak production years.",
      "example_cn": "在生产高峰期，这家钢铁厂雇佣了数千名工人。"
    },
    {
      "pos": "verb",
      "explanation_en": "To grind or crush something into smaller pieces, typically using a machine or mechanical force.",
      "explanation_cn": "指使用机器或机械力将某物碾碎或磨成小块。",
      "example_en": "The farmer mills his own corn to make feed for the livestock.",
      "example_cn": "这位农民自己将玉米磨碎，用作牲畜饲料。"
    },
    {
      "pos": "verb",
      "explanation_en": "To process or shape material, especially metal, by passing it through rollers or other machinery.",
      "explanation_cn": "指通过滚轮或其他机械对材料（尤其是金属）进行加工或成型。",
      "example_en": "The aluminum sheets were milled to precise thicknesses in the factory.",
      "example_cn": "这些铝板在工厂中被轧制成精确的厚度。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "factory",
      "analysis": "“Factory”（工厂）泛指任何进行工业生产的场所，强调大规模制造和装配；而 “mill” 更特指以研磨、轧制或加工原材料为主要功能的工厂，如磨坊、轧钢厂，带有更强的机械加工和物理改变材料的含义。"
    },
    {
      "word_to_compare": "grinder",
      "analysis": "“Grinder”（研磨机）是执行研磨动作的单一设备，通常体积较小，用于家庭或小型作业；而 “mill” 是一个完整的设施或系统，可能包含多个机械部件，用于工业级的连续加工，范围更广、规模更大。"
    },
    {
      "word_to_compare": "plant",
      "analysis": "“Plant”（工厂/装置）是一个更宽泛的术语，可指任何工业设施，包括发电厂、化工厂等，不一定涉及机械加工；而 “mill” 特指以物理加工（如碾磨、轧制）为核心功能的工业场所，语义更具体、更技术化。"
    }
  ]
}