{
  "word": "miniature",
  "pronunciation": "min·yuh·chur",
  "concise_definition": "n. 小型模型, 微型画; adj. 微型的, 小型的",
  "forms": {
    "plural": "miniatures",
    "comparative": "miniaturer",
    "superlative": "miniaturest"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A very small, detailed representation or model of something, often created with great precision to replicate the original in reduced scale.",
      "explanation_cn": "指以极高精度制作的、按比例缩小的某物的精细复制品或模型，常用于艺术、建筑或收藏领域。",
      "example_en": "The museum displays a miniature replica of the entire ancient city, built with tiny bricks and figures.",
      "example_cn": "博物馆展出了一座整个古城的微型复制品，由微小的砖块和人物模型精心搭建而成。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, highly detailed portrait painting, especially popular in the 16th to 18th centuries, often painted on ivory or metal.",
      "explanation_cn": "指一种流行于16至18世纪的微型肖像画，通常绘制在象牙或金属片上，以极精细的笔触描绘人物面容。",
      "example_en": "Her ancestor's miniature, painted on a locket, was passed down through five generations.",
      "example_cn": "她祖先的微型肖像画被绘制在吊坠上，代代相传了五代人。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Extremely small in size, often significantly smaller than the normal or standard version of something.",
      "explanation_cn": "指尺寸极小的，通常远小于某物的正常或标准版本。",
      "example_en": "She owns a miniature dachshund that fits comfortably in her purse.",
      "example_cn": "她养了一只迷你腊肠犬，可以轻松放进她的手提包里。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "small",
      "analysis": "“Small” (小的) 是一个通用形容词，仅表示尺寸不大，不强调精细度或比例还原。而 “miniature” 不仅指尺寸小，还隐含了“按比例缩小的复制品”或“高度精细”的含义，具有更强的工艺性和目的性。"
    },
    {
      "word_to_compare": "tiny",
      "analysis": "“Tiny” (极小的) 强调尺寸微小到几乎难以察觉，常带有主观情感色彩（如可爱、脆弱），但不涉及模型或复制品的概念。而 “miniature” 是客观的、有目的的缩小版本，常用于专业或艺术语境。"
    },
    {
      "word_to_compare": "model",
      "analysis": "“Model” (模型) 是一个更宽泛的词，泛指任何用于展示、测试或模仿的复制品，可以是全尺寸或任意比例。而 “miniature” 特指“缩小比例”的模型，强调其尺寸特征，是 “model” 的一个子类。"
    }
  ]
}