{
  "word": "minimalist",
  "pronunciation": "min·uh·muh·list",
  "concise_definition": "n. 极简主义者, 极简风格的拥护者; adj. 极简主义的, 追求极简风格的",
  "forms": {
    "plural": "minimalists"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who advocates for or practices minimalism, especially in lifestyle, design, or art, by eliminating excess and focusing on essential elements.",
      "explanation_cn": "指倡导或实践极简主义的人，尤其在生活方式、设计或艺术中，通过去除多余元素，专注于核心要素。",
      "example_en": "She is a minimalist who owns only twenty items of clothing and lives in a sparsely furnished apartment.",
      "example_cn": "她是一位极简主义者，只拥有二十件衣物，住在一间陈设极少的公寓里。"
    },
    {
      "pos": "noun",
      "explanation_en": "An artist or designer who creates works characterized by extreme simplicity of form, color, and texture, often associated with 20th-century modern art.",
      "explanation_cn": "指创作以形式、色彩和质感极度简化为特征的艺术品或设计作品的艺术家或设计师，常与20世纪现代艺术相关。",
      "example_en": "The museum featured a retrospective of famous minimalist sculptors like Donald Judd.",
      "example_cn": "博物馆展出了唐纳德·贾德等著名极简主义雕塑家的回顾展。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by extreme simplicity, using only the bare essentials and avoiding ornamentation or decoration.",
      "explanation_cn": "以极度简化为特征，仅使用最基本元素，避免任何装饰或繁复设计。",
      "example_en": "The room had a minimalist aesthetic with white walls, a single chair, and no artwork.",
      "example_cn": "这个房间具有极简主义风格，墙壁为白色，仅有一把椅子，没有任何装饰画。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "simple",
      "analysis": "“Simple”（简单的）是一个通用词，泛指不复杂、易理解的事物，但不一定带有哲学或美学立场。而 “minimalist” 不仅指形式简单，更强调一种有意识的、系统性的删减，追求功能与美学的极致精简，具有明确的文化和设计语境。"
    },
    {
      "word_to_compare": "spartan",
      "analysis": "“Spartan”（斯巴达式的）形容生活或环境极其简朴、严苛，常带有苦行、禁欲的负面或历史联想，强调牺牲与忍耐。而 “minimalist” 更偏向于主动选择的优雅与宁静，强调美感与效率，而非苦修。"
    },
    {
      "word_to_compare": "austere",
      "analysis": "“Austere”（严峻的、朴素的）常用于描述缺乏装饰、情感冷峻或道德严格的环境或风格，带有严肃甚至压抑的意味。而 “minimalist” 虽然也简洁，但通常传达的是平静、和谐与现代感，情感上更中性甚至积极。"
    }
  ]
}