{
  "word": "minister",
  "pronunciation": "mihn·uh·stur",
  "concise_definition": "n. 部长, 大臣; v. 服务, 传道, 照料",
  "forms": {
    "third_person_singular": "ministers",
    "past_tense": "ministered",
    "past_participle": "ministered",
    "present_participle": "ministering",
    "plural": "ministers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A high-ranking government official who heads a specific department or ministry, responsible for policy-making and administration in a particular area such as defense, education, or finance.",
      "explanation_cn": "指在政府中负责某一特定部门（如国防、教育或财政）的高级官员，主管政策制定与行政事务。",
      "example_en": "The Minister of Education announced new reforms for public schools.",
      "example_cn": "教育部长宣布了关于公立学校的改革新举措。"
    },
    {
      "pos": "noun",
      "explanation_en": "A religious official, such as a priest or pastor, who leads worship services, performs sacraments, and provides spiritual guidance to a congregation.",
      "explanation_cn": "指主持礼拜、施行圣礼并为教众提供精神指导的宗教人员，如牧师或神父。",
      "example_en": "The minister delivered a powerful sermon on forgiveness and compassion.",
      "example_cn": "牧师发表了一篇关于宽恕与慈悲的有力布道。"
    },
    {
      "pos": "verb",
      "explanation_en": "To perform religious duties or provide spiritual care, especially in a formal or official capacity.",
      "explanation_cn": "指以正式或官方身份履行宗教职责或提供精神关怀。",
      "example_en": "He ministered to the sick and elderly in the village for over thirty years.",
      "example_cn": "他三十年来一直为村里的病人和老人提供精神照料。"
    },
    {
      "pos": "verb",
      "explanation_en": "To attend to or provide service for someone’s needs, often in a supportive or helpful way.",
      "explanation_cn": "指以支持或帮助的方式照料某人的需求，常用于非宗教语境中。",
      "example_en": "The staff ministered to the guests’ every need during the conference.",
      "example_cn": "会议期间，工作人员悉心照料了与会嘉宾的每一项需求。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "secretary",
      "analysis": "“Secretary”（秘书/部长）在某些国家（如美国）指内阁成员，但通常职责更偏向行政执行而非政策主导；而 “minister” 更强调政策制定和领导职能，尤其在英联邦国家中，其地位更高、权力更全面。此外，“secretary” 也可用于非政府职位（如秘书处），而 “minister” 几乎专指政府或宗教高层职位。"
    },
    {
      "word_to_compare": "priest",
      "analysis": "“Priest”（神父）是天主教、东正教等传统教会中的圣职人员，强调通过圣礼（如弥撒、告解）传递神圣恩典；而 “minister” 多用于新教体系，更侧重讲道、牧养和社区服务，仪式性较弱。两者都可译为“牧师”，但神学背景和职能侧重不同。"
    },
    {
      "word_to_compare": "serve",
      "analysis": "“Serve”（服务）是一个更广泛、更通用的动词，可指任何形式的服务行为，如服务顾客、服务国家；而 “minister” 作为动词时，特指以关怀、专业或神圣的方式提供服务，常带有情感深度或精神维度，语义更具体、更富人文色彩。"
    }
  ]
}