{
  "word": "ministers",
  "pronunciation": "mɪn·ɪs·tərz",
  "concise_definition": "n. 部长, 大臣, 牧师",
  "forms": {
    "singular": "minister"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A high-ranking government official who heads a specific department or ministry, responsible for policy-making and administration in a particular area such as education, defense, or finance.",
      "explanation_cn": "指在政府中主管某一特定部门（如教育、国防或财政）的高级官员，负责该领域的政策制定与行政管理。",
      "example_en": "The Minister of Health announced new guidelines for public hospitals.",
      "example_cn": "卫生部长宣布了关于公立医院的新指南。"
    },
    {
      "pos": "noun",
      "explanation_en": "A religious official authorized to perform sacred rites and ceremonies, such as leading worship, conducting marriages, and offering spiritual guidance.",
      "explanation_cn": "指有资格主持宗教仪式（如带领礼拜、主持婚礼、提供精神指导）的宗教人员，通常在基督教教会中称为牧师。",
      "example_en": "The ministers at the church held a service to honor the community's veterans.",
      "example_cn": "教堂的牧师们举行了一场仪式，以纪念社区的退伍军人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who serves or acts on behalf of another, often in a supportive or representative role, especially in a spiritual or diplomatic context.",
      "explanation_cn": "指代表他人行事或提供服务的人，尤其在精神或外交语境中，可引申为‘使者’或‘服务者’。",
      "example_en": "She saw herself as a minister of peace in a time of conflict.",
      "example_cn": "她在冲突时期视自己为和平的使者。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "secretary",
      "analysis": "“Secretary”（秘书/部长）在某些国家（如美国）用于指内阁成员，如“Secretary of State”，其职能与“minister”类似，但“minister”更常见于英联邦国家。此外，“secretary”也可指行政助理，语义范围更广，而“minister”特指高级政治或宗教职位。"
    },
    {
      "word_to_compare": "priest",
      "analysis": "“Priest”（神父）是天主教、东正教等教会中经过正式圣职按立、可主持圣事（如弥撒、告解）的神职人员，而“minister”多用于新教教会，强调讲道与牧养，不必然具备施行圣礼的神学权威。两者虽都可译为“牧师”，但教派背景和职能有差异。"
    },
    {
      "word_to_compare": "official",
      "analysis": "“Official”（官员）是泛指任何在政府或组织中担任职务的人，涵盖范围极广，从基层职员到内阁部长都可称“official”。“Minister”是“official”的一种，特指拥有决策权和领导职责的高级官员，语义更具体、层级更高。"
    }
  ]
}