{
  "word": "minorities",
  "pronunciation": "mī·nər·ə·tēz",
  "concise_definition": "n. 少数群体, 少数民族, 少数派",
  "forms": {
    "singular": "minority"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A group of people within a larger population who differ from the majority in terms of race, ethnicity, religion, language, or other characteristics, and who may be subject to unequal treatment or underrepresentation.",
      "explanation_cn": "指在更大人口群体中，因种族、民族、宗教、语言或其他特征与多数群体不同，且可能面临不平等对待或代表性不足的群体。",
      "example_en": "The government has implemented policies to protect the rights of linguistic minorities.",
      "example_cn": "政府已实施政策以保护语言少数群体的权利。"
    },
    {
      "pos": "noun",
      "explanation_en": "A smaller number or part of a group that holds a different opinion or position from the majority, especially in political or decision-making contexts.",
      "explanation_cn": "指在政治或决策环境中，持有与多数人不同观点或立场的较小部分人或团体。",
      "example_en": "Despite being a minority in the committee, she successfully argued for the reform.",
      "example_cn": "尽管在委员会中属于少数派，她仍成功地为改革进行了辩护。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group that is numerically smaller and often socially or politically marginalized, especially in the context of civil rights and social justice.",
      "explanation_cn": "指在人数上较少，且常在民权与社会正义语境中被边缘化的群体。",
      "example_en": "Advocates for racial minorities have long fought for equal access to education and employment.",
      "example_cn": "为种族少数群体争取权益的人士长期为争取平等的教育和就业机会而奋斗。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "majority",
      "analysis": "“Majority”（多数）指人口或意见中占主导地位的较大群体，与 “minorities” 形成直接对立。前者通常拥有更大的话语权和资源，而后者则常处于被忽视或受压制的地位。两者在政治、社会和法律语境中常作为对比概念使用。"
    },
    {
      "word_to_compare": "groups",
      "analysis": "“Groups”（群体）是一个中性、泛指的术语，可指任何集合的人群，无论大小或地位。而 “minorities” 特指在权力、资源或代表性上处于劣势的群体，具有明确的社会政治内涵，不能简单等同于一般意义上的群体。"
    },
    {
      "word_to_compare": "ethnic groups",
      "analysis": "“Ethnic groups”（族群）强调文化、语言或血统上的共同性，是 “minorities” 的一个子集。并非所有少数民族都是族群（如宗教少数派），也并非所有族群都是少数群体（如汉族在中国是多数）。因此，‘minorities’ 的范围更广，涵盖种族、宗教、语言、性取向等多种维度。"
    }
  ]
}