{
  "word": "minors",
  "pronunciation": "mī·nərs",
  "concise_definition": "n. 未成年人, 小人物, 次要事物",
  "forms": {
    "singular": "minor"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who has not yet reached the age of legal adulthood, and therefore lacks full legal rights and responsibilities in many jurisdictions.",
      "explanation_cn": "指尚未达到法定成年年龄的人，在许多司法管辖区中不享有完全的法律权利和责任。",
      "example_en": "The law prohibits the sale of alcohol to minors.",
      "example_cn": "法律禁止向未成年人出售酒精饮料。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing of lesser importance, rank, or significance, often in contrast to a major or primary element.",
      "explanation_cn": "指在重要性、地位或意义方面较次要的人或事物，常与主要或核心部分相对。",
      "example_en": "In the company's annual report, the financial losses were mentioned only as minors in comparison to the overall profit.",
      "example_cn": "在公司的年度报告中，财务亏损仅作为次要事项提及，与整体利润相比微不足道。"
    },
    {
      "pos": "noun",
      "explanation_en": "In music, a scale or key based on a minor tonality, characterized by a lowered third scale degree and often associated with a somber or melancholic mood.",
      "explanation_cn": "在音乐中，指以小调音阶为基础的调式，其特征是第三音降低，常带有忧郁或哀伤的情绪。",
      "example_en": "She played the piece in A minor, giving it a hauntingly beautiful quality.",
      "example_cn": "她用A小调演奏了这首曲子，赋予它一种令人难忘的优美气质。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "children",
      "analysis": "“Children” (儿童) 是一个更宽泛、更口语化的词，泛指所有未满青春期的年幼个体，通常指0–12岁左右的人。而 “minors” 是法律术语，强调的是未达法定成年年龄（通常为18岁）的法律地位，可能包括青少年，范围更广且更具法律意义。"
    },
    {
      "word_to_compare": "juveniles",
      "analysis": "“Juveniles” (青少年) 通常特指处于青春期或接近成年的未成年人，多用于法律或心理学语境，强调生理和心理发展阶段。而 “minors” 是一个更中性的法律分类，涵盖从婴儿到17岁的所有未满法定成年者，不强调发展阶段。"
    },
    {
      "word_to_compare": "minorities",
      "analysis": "“Minorities” (少数群体) 指在人口、权力、文化或社会地位上处于少数的群体，如种族、宗教或语言少数群体。虽然拼写相似，但语义完全不同。“Minors” 关注年龄与法律身份，而 “minorities” 关注社会结构中的数量与权力关系。"
    }
  ]
}