{
  "word": "minority",
  "pronunciation": "mī·nər·ə·tē",
  "concise_definition": "n. 少数, 少数群体, 少数派",
  "forms": {
    "plural": "minorities"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A smaller group within a larger population or organization that differs from the majority in terms of race, ethnicity, religion, language, or other characteristics, often facing social, political, or economic disadvantages.",
      "explanation_cn": "指在人口或组织中占较小比例、在种族、民族、宗教、语言或其他特征上与多数群体不同的群体，通常面临社会、政治或经济上的不利处境。",
      "example_en": "The government has implemented policies to protect the rights of linguistic minorities.",
      "example_cn": "政府已实施政策以保护语言少数群体的权利。"
    },
    {
      "pos": "noun",
      "explanation_en": "The smaller number of votes, members, or supporters in a decision-making body, as opposed to the majority.",
      "explanation_cn": "指在决策机构中持少数意见的投票数、成员数或支持者数量，与多数派相对。",
      "example_en": "The bill passed by a majority of 62 to 38, with the minority opposing it on constitutional grounds.",
      "example_cn": "该法案以62票赞成、38票反对获得通过，少数派以宪法理由表示反对。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that is in the minority in a particular context, especially when outnumbered or underrepresented.",
      "explanation_cn": "指在特定情境中处于少数地位的个人或事物，尤其在数量上被压倒或代表性不足时。",
      "example_en": "As a minority in the department, she often felt her ideas were overlooked.",
      "example_cn": "作为部门中的少数派，她常感到自己的意见被忽视。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "majority",
      "analysis": "“Majority”（多数）是“minority”的直接对立面，指占主导地位或数量更多的群体或意见。两者常在政治、社会或投票语境中成对出现，强调权力、代表性和决策的分配差异。"
    },
    {
      "word_to_compare": "group",
      "analysis": "“Group”（群体）是一个中性泛称，指任何聚集在一起的人或事物，不涉及数量比例。而 “minority” 特指在数量或权力上处于劣势的群体，具有明确的社会或统计含义。"
    },
    {
      "word_to_compare": "fraction",
      "analysis": "“Fraction”（部分）通常指整体中的一小部分，强调数学或比例上的分割，如“a fraction of the population”。它更抽象、更量化，而 “minority” 更强调社会身份、权利和结构性不平等，具有更强的政治和文化内涵。"
    }
  ]
}