{
  "word": "miracles",
  "pronunciation": "mih·ruh·kls",
  "concise_definition": "n. 奇迹, 奇事, 奇观",
  "forms": {
    "singular": "miracle"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An extraordinary and astonishing event that is attributed to the presence and action of a divine or supernatural power, often defying natural laws and inspiring awe or wonder.",
      "explanation_cn": "指被认为由神灵或超自然力量所引发的非凡而令人惊叹的事件，通常违背自然规律，引发敬畏或惊奇。",
      "example_en": "The doctors called her recovery from the coma a miracle.",
      "example_cn": "医生们称她从昏迷中康复是一个奇迹。"
    },
    {
      "pos": "noun",
      "explanation_en": "Something remarkably positive or beneficial that seems impossible or highly unlikely, often used metaphorically to express gratitude or amazement.",
      "explanation_cn": "指某种看似不可能或极不可能发生的、极其积极或有益的事情，常用于比喻性表达感激或惊叹之情。",
      "example_en": "It's a miracle we got the project finished on time with such limited resources.",
      "example_cn": "在资源如此有限的情况下，我们还能按时完成项目，真是个奇迹。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that is exceptionally outstanding or effective, often used to describe someone who achieves extraordinary results.",
      "explanation_cn": "指某人或某物极其出色或高效，常用于形容取得非凡成就的人。",
      "example_en": "The young pianist is a miracle—she plays Chopin better than most professionals.",
      "example_cn": "这位年轻钢琴家是个天才——她演奏肖邦的水平比大多数专业演奏家还好。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "wonders",
      "analysis": "“Wonders” (奇观/奇迹) 与 “miracles” 非常接近，常可互换，但 “wonders” 更侧重于自然或人造的壮丽景象或令人惊叹的现象（如世界七大奇迹），强调视觉或感官上的震撼；而 “miracles” 更强调超自然力量的介入或不可能事件的发生，带有宗教或情感色彩。"
    },
    {
      "word_to_compare": "signs",
      "analysis": "“Signs” (征兆/迹象) 指某种预示或传达信息的符号或事件，常用于宗教语境中表示神的旨意，但不一定包含“超自然干预”或“奇迹般的结果”。而 “miracles” 必须包含实际发生的、超越自然法则的事件，其目的不仅是传达信息，更是彰显力量。"
    },
    {
      "word_to_compare": "phenomena",
      "analysis": "“Phenomena” (现象) 是一个中性、科学的术语，指任何可观察到的事件或事实，无论是否可解释。它不包含任何超自然或情感价值判断。而 “miracles” 是主观的、带有敬畏或信仰色彩的术语，特指那些被认为无法用自然规律解释的非凡事件。"
    }
  ]
}