{
  "word": "mira",
  "pronunciation": "mee·ruh",
  "concise_definition": "n. 镜子, 观测仪; (专有名词) 米拉",
  "forms": {
    "plural": "miras"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A reflective surface, typically made of glass with a metallic coating, used to produce images by reflection; commonly used in everyday contexts as a personal or decorative mirror.",
      "explanation_cn": "一种由玻璃和金属涂层制成的反射表面，用于通过反射形成图像；常用于日常生活中作为个人或装饰性镜子。",
      "example_en": "She checked her appearance in the mirror before leaving the house.",
      "example_cn": "她出门前在镜子里检查了自己的仪容。"
    },
    {
      "pos": "noun",
      "explanation_en": "A scientific instrument used in surveying and astronomy, consisting of a sighting device and a mirror to reflect distant objects for precise measurement or observation.",
      "explanation_cn": "一种用于测量和天文学的科学仪器，由瞄准装置和反射镜组成，用于反射远处物体以进行精确测量或观测。",
      "example_en": "The surveyor used a mira to align the telescope with the distant landmark.",
      "example_cn": "测量员使用米拉仪器将望远镜对准远处的地标。"
    },
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to Mira, a variable star in the constellation Cetus, known for its periodic changes in brightness.",
      "explanation_cn": "专有名词，指位于鲸鱼座的一颗变星——米拉星，以其周期性的亮度变化而闻名。",
      "example_en": "Mira, the red giant star, can be seen with the naked eye during its brightest phase.",
      "example_cn": "米拉这颗红巨星在其最亮阶段可以用肉眼观测到。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mirror",
      "analysis": "“Mirror” 是更通用、更常见的词，泛指任何用于反射成像的表面，涵盖日常、科学和艺术用途。而 “mira” 作为“镜子”的用法较为罕见，多用于特定技术语境（如测量仪器）或作为专有名词，日常交流中几乎不使用。"
    },
    {
      "word_to_compare": "reflective surface",
      "analysis": "“Reflective surface” 是一个描述性短语，泛指任何能反射光线的表面，包括水面、金属板、玻璃等，不特指成像功能。而 “mira” 在作为仪器或镜子使用时，隐含了精确成像或定向反射的意图，具有功能性目的。"
    },
    {
      "word_to_compare": "star",
      "analysis": "“Star” 是天文学中对恒星的通用术语，而 “Mira” 是特指某一颗著名变星的专有名称。当使用 “mira” 指代恒星时，它不是类别词，而是具体个体，类似 “Sirius” 或 “Polaris”。"
    }
  ]
}