{
  "word": "mirror",
  "pronunciation": "mir·rər",
  "concise_definition": "n. 镜子, 反映; v. 反映, 模仿",
  "forms": {
    "plural": "mirrors"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A smooth, typically glass surface coated with a reflective material (such as silver or aluminum) that produces an image of objects placed in front of it.",
      "explanation_cn": "一种表面光滑、通常由玻璃制成并涂有反光材料（如银或铝）的物体，能够呈现置于其前方的物体的影像。",
      "example_en": "She checked her appearance in the mirror before leaving the house.",
      "example_cn": "她出门前在镜子里检查了自己的仪容。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that reflects or represents something else, often an idea, quality, or situation, especially in a clear or accurate way.",
      "explanation_cn": "指能够清晰或准确地反映或代表某种事物（如思想、品质或状况）的人或物。",
      "example_en": "The film is a mirror of contemporary social anxieties.",
      "example_cn": "这部电影反映了当代社会的焦虑情绪。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reflect or reproduce something closely, often an action, attitude, or appearance, especially as a response or counterpart.",
      "explanation_cn": "指紧密地反映或再现某事物，常指某种行为、态度或外观，作为回应或对应物。",
      "example_en": "His calm demeanor mirrors the confidence of the team’s leadership.",
      "example_cn": "他冷静的态度反映了团队领导层的自信。"
    },
    {
      "pos": "verb",
      "explanation_en": "To imitate or copy someone’s behavior or expression, often unconsciously or as a form of empathy.",
      "explanation_cn": "指无意识地或作为共情表现而模仿他人的行为或表情。",
      "example_en": "Children often mirror the emotions and gestures of their parents.",
      "example_cn": "孩子常常模仿父母的情绪和动作。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "reflection",
      "analysis": "“Reflection”（反映、倒影）更侧重于物理或抽象意义上的影像呈现，常用于描述光线、思想或情感的自然映射，不强调主动模仿。而 “mirror” 作为动词时，更强调有意识或主动地再现，常用于比喻语境中表示‘如镜子般精准反映’。"
    },
    {
      "word_to_compare": "replica",
      "analysis": "“Replica”（复制品）指对原物的精确物理复制，通常是实体对象，如艺术品的复制品。而 “mirror” 作为动词或名词时，强调的是‘映像’或‘象征性再现’，不一定是实体，也不一定追求完全一致，更注重本质的相似性。"
    },
    {
      "word_to_compare": "imitate",
      "analysis": "“Imitate”（模仿）泛指有意识地复制他人行为、风格或声音，常带有人为意图，可能带有贬义（如虚假模仿）。而 “mirror” 作为动词时，常暗示一种无意识、自然或情感上的同步，更强调共鸣与对应，语义上更中性甚至带有正面含义。"
    }
  ]
}