{
  "word": "miscarriage",
  "pronunciation": "mis·kar·ij",
  "concise_definition": "n. 流产, 失败, 错误的判断",
  "forms": {
    "plural": "miscarriages"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The spontaneous loss of a fetus before it is viable, typically before 20 weeks of pregnancy; a medical event in which pregnancy ends prematurely without intentional intervention.",
      "explanation_cn": "指胎儿在具备存活能力之前（通常在怀孕20周前）自然终止妊娠，是一种非人为干预的医学事件。",
      "example_en": "She experienced a miscarriage in her first trimester and needed time to heal both physically and emotionally.",
      "example_cn": "她在怀孕早期经历了流产，需要时间在身体和情感上恢复。"
    },
    {
      "pos": "noun",
      "explanation_en": "A failure to achieve a desired outcome, especially due to poor planning, execution, or external factors; often used metaphorically to describe projects, plans, or efforts that collapse before completion.",
      "explanation_cn": "指因计划不周、执行不力或外部因素导致未能实现预期目标，常用于比喻性地描述未能完成的项目、计划或努力。",
      "example_en": "The new marketing campaign was a complete miscarriage, wasting millions without attracting a single new customer.",
      "example_cn": "这项新的营销活动彻底失败，浪费了数百万美元却未吸引到任何新客户。"
    },
    {
      "pos": "noun",
      "explanation_en": "An unjust or erroneous outcome, especially in legal or judicial contexts, where justice is not properly served.",
      "explanation_cn": "指不公正或错误的结果，尤其在法律或司法语境中，表示正义未能得到实现。",
      "example_en": "Many believe the conviction was a miscarriage of justice, as key evidence was ignored by the court.",
      "example_cn": "许多人认为这一定罪是司法不公，因为法庭忽视了关键证据。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "abortion",
      "analysis": "“Abortion”（人工流产）指通过医疗手段人为终止妊娠，通常是经过选择和决定的；而 “miscarriage” 是指自然发生的、非人为的妊娠终止，强调其意外性和非意愿性。两者在医学和伦理语境中不可互换。"
    },
    {
      "word_to_compare": "failure",
      "analysis": "“Failure”（失败）是一个通用词，泛指任何未达成目标的情况，适用范围极广；而 “miscarriage” 在比喻用法中特指一种‘本应成功却因过程缺陷而崩溃’的失败，带有更强的遗憾和程序性失误的意味，常用于正式或书面语境。"
    },
    {
      "word_to_compare": "mistake",
      "analysis": "“Mistake”（错误）通常指个体在判断、行为或决策中的过失，是主观层面的失误；而 “miscarriage of justice” 等用法中，强调的是系统性、结构性的错误结果，责任往往不归于单一行为者，而是制度或程序的缺陷。"
    }
  ]
}