{
  "word": "miss",
  "pronunciation": "mis",
  "concise_definition": "v. 错过, 想念, 未击中; n. 错过, 未击中, 失误",
  "forms": {
    "third_person_singular": "misses",
    "past_tense": "missed",
    "past_participle": "missed",
    "present_participle": "missing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To fail to hit, reach, or catch something intended, often due to error or bad timing.",
      "explanation_cn": "因错误或时机不当而未能击中、触及或抓住预期的目标。",
      "example_en": "He missed the ball by a few inches and lost the game.",
      "example_cn": "他差几英寸没打中球，结果输掉了比赛。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fail to attend, be present for, or experience something scheduled or expected.",
      "explanation_cn": "未能出席、到场或经历某件已安排或预期的事情。",
      "example_en": "I missed the train because I woke up late.",
      "example_cn": "我因为睡过头而错过了火车。"
    },
    {
      "pos": "verb",
      "explanation_en": "To feel a deep sense of longing or sadness because someone or something is absent.",
      "explanation_cn": "因某人或某物的缺席而感到深切的思念或悲伤。",
      "example_en": "I miss my grandmother every day since she moved away.",
      "example_cn": "自从祖母搬走后，我每天都想念她。"
    },
    {
      "pos": "noun",
      "explanation_en": "A failure to hit, reach, or connect with something intended; often used in sports or shooting contexts.",
      "explanation_cn": "未能击中、触及或连接预期目标的失败，常用于体育或射击语境。",
      "example_en": "The pitcher threw a fastball, but it was a miss — right down the middle.",
      "example_cn": "投手投出了一记快速球，但却是失误——正好投在了球路正中。"
    },
    {
      "pos": "noun",
      "explanation_en": "An error or mistake, especially one that results in a failure to achieve a goal.",
      "explanation_cn": "一种错误或过失，尤指导致未能达成目标的失误。",
      "example_en": "That was a costly miss in the final minutes of the match.",
      "example_cn": "那是在比赛最后几分钟里一次代价高昂的失误。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "lose",
      "analysis": "“Lose” (失去) 强调失去某物的所有权、控制权或存在，如失去钥匙、失去信心，常带有永久性或不可逆的意味。而 “miss” 更侧重于未能参与、未能到达或未能击中，通常是暂时性的，且常伴随情感或动作上的落空。"
    },
    {
      "word_to_compare": "long for",
      "analysis": "“Long for” (渴望) 是一种强烈的、持续的渴望，通常用于表达对未得之物的深切向往，语气更主观、更情感化。而 “miss” 不仅包含思念，还隐含了因缺席而产生的失落感，常用于描述已存在但已离开的人或事。"
    },
    {
      "word_to_compare": "fail",
      "analysis": "“Fail” (失败) 是一个更广泛、更正式的词，指未能达成目标、标准或期望，常用于任务、考试或责任层面。而 “miss” 更具体，常用于物理动作（未击中）、时间（错过）或情感（想念）的语境，语气更口语化、更个人化。"
    }
  ]
}