{
  "word": "missions",
  "pronunciation": "mish·uhnz",
  "concise_definition": "n. 任务, 使命, 传教团, 航天任务",
  "forms": {
    "singular": "mission"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A specific task or assignment given to a person or group, often with a clear objective, especially one that is important, challenging, or dangerous.",
      "explanation_cn": "指赋予个人或团体的一项具体任务或指派，通常具有明确的目标，尤其指重要、具有挑战性或危险性的任务。",
      "example_en": "The special forces were sent on a secret mission to rescue the hostages.",
      "example_cn": "特种部队被派去执行一项秘密任务，营救被劫持的人质。"
    },
    {
      "pos": "noun",
      "explanation_en": "A religious or charitable endeavor undertaken to spread beliefs, provide aid, or serve a community, often in a foreign or underserved area.",
      "explanation_cn": "指为传播信仰、提供援助或服务社区而开展的宗教或慈善活动，通常在外国或资源匮乏的地区进行。",
      "example_en": "The missionaries established a school and clinic in the remote village.",
      "example_cn": "传教士在偏远村庄建立了一所学校和诊所。"
    },
    {
      "pos": "noun",
      "explanation_en": "A planned space flight or operation conducted by a space agency to achieve scientific or exploratory goals.",
      "explanation_cn": "指航天机构为实现科学或探索目标而计划的太空飞行或操作。",
      "example_en": "NASA's Perseverance rover is part of a mission to search for signs of ancient life on Mars.",
      "example_cn": "NASA 的毅力号火星车是寻找火星上古代生命迹象任务的一部分。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of people sent by an organization to represent it in a foreign country, often for diplomatic, commercial, or cultural purposes.",
      "explanation_cn": "指由组织派遣到外国代表其利益的一群人，通常用于外交、商业或文化目的。",
      "example_en": "The French trade mission met with local business leaders to strengthen economic ties.",
      "example_cn": "法国贸易代表团会见了当地商界领袖，以加强经济联系。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "task",
      "analysis": "“Task”（任务）泛指任何需要完成的工作，可以是日常的、简单的或例行的，语义范围更广但缺乏“mission”所蕴含的庄严性、重要性或使命感。例如，完成一份报告是 task，而执行一次救援行动是 mission。"
    },
    {
      "word_to_compare": "assignment",
      "analysis": "“Assignment”（指派）通常用于正式场合，如工作或学业中被分配的任务，强调来源和责任归属，但不一定包含“mission”所具有的崇高目标、牺牲精神或深远影响。例如，老师布置的作业是 assignment，而联合国维和行动是 mission。"
    },
    {
      "word_to_compare": "objective",
      "analysis": "“Objective”（目标）指希望达成的具体结果或终点，是任务或使命所追求的方向，但本身不是行动。而 “mission” 是实现该目标所采取的整个行动或计划。例如，‘消灭病毒’是 objective，而‘派遣医疗队前往疫区’是 mission。"
    }
  ]
}