{
  "word": "moan",
  "pronunciation": "mohn",
  "concise_definition": "v. 呻吟, 抱怨; n. 呻吟声, 抱怨声",
  "forms": {
    "third_person_singular": "moans",
    "past_tense": "moaned",
    "past_participle": "moaned",
    "present_participle": "moaning"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To make a low, prolonged sound, typically due to physical pain, emotional distress, or pleasure, often involuntarily.",
      "explanation_cn": "因身体疼痛、情绪痛苦或愉悦而发出低沉、拖长的声音，通常是无意识的。",
      "example_en": "She moaned softly as the doctor examined her injured leg.",
      "example_cn": "医生检查她受伤的腿时，她轻声呻吟着。"
    },
    {
      "pos": "verb",
      "explanation_en": "To complain in a continuous, mournful or discontented way, often expressing dissatisfaction without taking action.",
      "explanation_cn": "以持续、哀怨或不满的方式抱怨，通常表达不满但不采取行动。",
      "example_en": "He’s always moaning about the weather, but never brings an umbrella.",
      "example_cn": "他总是抱怨天气，却从不带伞。"
    },
    {
      "pos": "noun",
      "explanation_en": "A low, prolonged sound made by a person or animal, especially due to pain, sorrow, or pleasure.",
      "explanation_cn": "人或动物因疼痛、悲伤或愉悦而发出的低沉、拖长的声音。",
      "example_en": "The moan of the wind through the trees was eerie and unsettling.",
      "example_cn": "风穿过树木发出的呜咽声令人毛骨悚然。"
    },
    {
      "pos": "noun",
      "explanation_en": "A continuous expression of complaint or dissatisfaction, often in a whining or passive-aggressive tone.",
      "explanation_cn": "一种持续不断的抱怨或不满的表达，常带有抱怨或消极攻击的语气。",
      "example_en": "The office was filled with the daily moans of employees about the new policy.",
      "example_cn": "办公室里充满了员工对新政策的每日抱怨声。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "groan",
      "analysis": "“Groan” (呻吟/叹气) 通常比 “moan” 声音更低沉、更沉重，常与极度痛苦、疲惫或沉重负担相关，语气更压抑。而 “moan” 可以是轻微的、持续的，甚至带有愉悦的意味，适用范围更广。"
    },
    {
      "word_to_compare": "complain",
      "analysis": "“Complain” (抱怨) 是明确、有意识地表达不满，通常伴随语言或具体诉求；而 “moan” 作为动词时更偏向于无意识的、情绪化的低语或叹息，不一定有明确内容，语气更消极被动。"
    },
    {
      "word_to_compare": "whine",
      "analysis": "“Whine” (哭诉/发牢骚) 强调尖锐、刺耳、孩子气或令人厌烦的抱怨声，常带有情绪化和不成熟的特点；而 “moan” 更低沉、更含蓄，可能源于生理或深层情绪，不一定是故意惹人烦。"
    }
  ]
}