{
  "word": "moaning",
  "pronunciation": "moh·n ing",
  "concise_definition": "n. 呻吟, 抱怨; v. 呻吟, 抱怨",
  "forms": {
    "base_form": "moan",
    "third_person_singular": "moans",
    "past_tense": "moaned",
    "past_participle": "moaned",
    "present_participle": "moaning"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To make a low, continuous, mournful sound, often due to physical pain, emotional distress, or sexual pleasure.",
      "explanation_cn": "因身体疼痛、情绪痛苦或性快感而发出低沉、持续的声音。",
      "example_en": "She was moaning softly in her sleep after the surgery.",
      "example_cn": "手术后，她在睡梦中轻声呻吟。"
    },
    {
      "pos": "verb",
      "explanation_en": "To complain persistently or in a whining tone, often about trivial or unimportant matters.",
      "explanation_cn": "持续地、以抱怨或哀怨的语调表达不满，通常针对琐碎或不重要的事情。",
      "example_en": "He spent the whole flight moaning about the cramped seats.",
      "example_cn": "他整个航程都在抱怨座位太拥挤。"
    },
    {
      "pos": "noun",
      "explanation_en": "A low, continuous sound made by a person, typically expressing pain, sorrow, or pleasure.",
      "explanation_cn": "人发出的低沉、持续的声音，通常表达痛苦、悲伤或愉悦。",
      "example_en": "The moaning of the wind through the trees was eerie.",
      "example_cn": "风穿过树木发出的呜咽声令人毛骨悚然。"
    },
    {
      "pos": "noun",
      "explanation_en": "A persistent complaint or expression of dissatisfaction, often perceived as tiresome or excessive.",
      "explanation_cn": "一种持续不断的抱怨或不满的表达，常被视为烦人或过度。",
      "example_en": "His constant moaning about the weather drove everyone crazy.",
      "example_cn": "他不断抱怨天气，让所有人都快疯了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "groaning",
      "analysis": "“Groaning” (呻吟/叹气) 通常指更沉重、更低沉、更压抑的声音，常与体力负担、巨大压力或沉重物体相关（如老房子的地板发出的嘎吱声）。而 “moaning” 更常用于表达情绪性痛苦或主观抱怨，声音相对更连贯、更人性化。"
    },
    {
      "word_to_compare": "complaining",
      "analysis": "“Complaining” (抱怨) 是一个更广泛、更中性的词，指任何表达不满的行为，可以是口头的、书面的或非语言的。而 “moaning” 作为动词时，带有强烈的情绪色彩，常暗示一种消极、反复、带有哭腔或低沉语调的抱怨，更具主观性和感染力。"
    },
    {
      "word_to_compare": "whining",
      "analysis": "“Whining” (哭诉/发牢骚) 强调尖锐、高音调、孩子气或令人厌烦的抱怨，常带有撒娇或无理取闹的意味。而 “moaning” 的声音更低沉、更绵长，可能源于真实痛苦，不一定是故意惹人烦，因此语义上更沉重、更真实。"
    }
  ]
}