{
  "word": "mobility",
  "pronunciation": "moh·bil·uh·tee",
  "concise_definition": "n. 移动性, 流动性, 迁移能力",
  "forms": {
    "plural": "mobilities"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The ability to move or be moved freely and easily, especially in the context of physical movement or transportation.",
      "explanation_cn": "指自由且轻松地移动或被移动的能力，尤其在物理运动或交通的语境中。",
      "example_en": "The new wheelchair design greatly improves mobility for people with disabilities.",
      "example_cn": "这种新型轮椅设计大大提高了残障人士的行动能力。"
    },
    {
      "pos": "noun",
      "explanation_en": "The capacity for social or occupational movement, such as changing jobs, social classes, or geographic locations.",
      "explanation_cn": "指社会或职业层面的流动性，例如更换工作、社会阶层跃迁或迁居不同地区。",
      "example_en": "Education is often seen as a key driver of social mobility in modern societies.",
      "example_cn": "在现代社会中，教育常被视为推动社会流动性的关键因素。"
    },
    {
      "pos": "noun",
      "explanation_en": "The ease with which data, services, or devices can be transferred or accessed across different systems or locations, especially in technology contexts.",
      "explanation_cn": "指数据、服务或设备在不同系统或地点之间转移或访问的便捷性，尤其在技术语境中。",
      "example_en": "Cloud computing enhances data mobility, allowing users to access files from any device worldwide.",
      "example_cn": "云计算提升了数据的流动性，使用户能够从全球任何设备访问文件。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "movement",
      "analysis": "“Movement” (移动) 是一个更广泛、更通用的词，泛指任何位置的变化，可以是物理的、抽象的，甚至是政治或艺术上的运动。而 “mobility” 更强调移动的“能力”或“便利性”，而非移动本身。例如，一个人可以有“movement”（一次行走），但“mobility”指的是他能否自由行走。"
    },
    {
      "word_to_compare": "flexibility",
      "analysis": "“Flexibility” (灵活性) 指适应变化或调整的能力，常用于描述态度、计划或身体的柔韧性。虽然在某些语境中（如工作安排）两者可部分重叠，但 “mobility” 专指空间或位置上的可移动性，而 “flexibility” 更侧重于适应性和弹性。"
    },
    {
      "word_to_compare": "transit",
      "analysis": "“Transit” (运输/ transit) 指从一个地方到另一个地方的运输过程或系统，如公共交通。它强调的是“过程”或“系统”，而 “mobility” 强调的是个体或实体“拥有”的移动能力。例如，地铁系统改善了城市的 transit，但最终提升的是居民的 mobility。"
    }
  ]
}