{
  "word": "mobilization",
  "pronunciation": "mohb·uh·luh·zey·shun",
  "concise_definition": "n. 动员, 调动, 集结",
  "forms": {
    "plural": "mobilizations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of assembling and organizing military forces and resources for war or emergency service, often involving the activation of reserves, logistics, and infrastructure.",
      "explanation_cn": "指为战争或紧急状态而集结和组织军事力量与资源的过程，通常包括动员后备役、后勤系统和基础设施。",
      "example_en": "The country's rapid mobilization of troops prevented the enemy from gaining a foothold.",
      "example_cn": "该国迅速动员军队，阻止了敌方建立立足点。"
    },
    {
      "pos": "noun",
      "explanation_en": "The organized effort to rally people, resources, or public support for a social, political, or economic cause, often on a large scale.",
      "explanation_cn": "指为实现某一社会、政治或经济目标而大规模组织人力、资源或公众支持的行动。",
      "example_en": "The health campaign relied on the mobilization of volunteers and community centers.",
      "example_cn": "这项健康宣传活动依赖于志愿者和社区中心的广泛动员。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of making something mobile or capable of movement, especially in economic or technological contexts (e.g., mobilizing capital or data).",
      "explanation_cn": "指使某物具备流动性或可移动性，尤其在经济或技术语境中（如调动资本或数据）。",
      "example_en": "The new policy aims at the mobilization of private investment into renewable energy.",
      "example_cn": "这项新政策旨在将私人投资调动至可再生能源领域。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "deployment",
      "analysis": "“Deployment” (部署) 指将已动员的资源或人员正式派往特定地点或任务中，强调的是‘分配’和‘就位’的行动。而 “mobilization” 是部署之前的准备阶段，侧重于‘集结’和‘组织’。"
    },
    {
      "word_to_compare": "activation",
      "analysis": "“Activation” (激活) 通常指启动某个系统、机制或程序，使其从休眠或待命状态进入工作状态，范围较窄，常用于技术或设备语境。而 “mobilization” 更广泛，涵盖人力、物资、社会力量的全面动员，具有更强的政治和社会维度。"
    },
    {
      "word_to_compare": "conscription",
      "analysis": "“Conscription” (征兵) 是动员的一种具体手段，特指强制征召公民入伍。而 “mobilization” 是一个更全面的概念，包括征兵、物资调配、工业转产、宣传动员等多方面内容，征兵只是其中一部分。"
    }
  ]
}