{
  "word": "mobile",
  "pronunciation": "moh·buhl",
  "concise_definition": "adj. 可移动的, 流动的; n. 手机, 移动设备",
  "forms": {
    "comparative": "more mobile",
    "superlative": "most mobile"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Capable of moving or being moved freely or easily; not fixed or stationary.",
      "explanation_cn": "能够自由或容易地移动的；非固定或静止的。",
      "example_en": "The hospital has a mobile clinic that serves remote villages.",
      "example_cn": "这家医院有一辆流动诊所车，为偏远村庄提供服务。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Subject to frequent change or variation, especially in location, opinion, or allegiance.",
      "explanation_cn": "指位置、观点或忠诚度等经常发生变化的，不稳定的。",
      "example_en": "Her political views are quite mobile, shifting with public opinion.",
      "example_cn": "她的政治观点很不稳定，随着公众意见而变化。"
    },
    {
      "pos": "noun",
      "explanation_en": "A portable electronic device used for communication, especially a cellular phone.",
      "explanation_cn": "指用于通信的便携式电子设备，尤指手机。",
      "example_en": "She checked her mobile for messages while waiting in line.",
      "example_cn": "她在排队等候时查看了手机上的信息。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of hanging decorative structure, often with moving parts, commonly seen above a baby's crib.",
      "explanation_cn": "一种悬挂式装饰结构，通常带有可动部件，常见于婴儿床上方。",
      "example_en": "The baby smiled as the colorful mobile spun gently above the crib.",
      "example_cn": "婴儿望着婴儿床上方缓缓旋转的彩色摇铃，露出了微笑。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "portable",
      "analysis": "“Portable”（便携的）强调设备轻便、易于携带，通常用于描述可随身携带的物品（如笔记本电脑、充电器），但不一定具备移动功能或联网能力。而 “mobile” 不仅指可携带，更强调其“可移动使用”和“动态性”，尤其在通信领域特指能随时接入网络的设备（如手机）。"
    },
    {
      "word_to_compare": "movable",
      "analysis": "“Movable”（可移动的）是更通用的物理移动描述，适用于任何能被搬动的物体（如家具），不隐含技术性或智能性。而 “mobile” 常用于现代语境，带有技术或系统性的含义，如移动网络、移动应用，强调功能上的灵活性和实时性。"
    },
    {
      "word_to_compare": "cellular",
      "analysis": "“Cellular”（蜂窝的）特指使用蜂窝网络技术的通信设备，是 “mobile” 的一种技术实现方式。虽然在口语中常与 “mobile phone” 互换，但 “cellular” 仅限于描述通信技术，而 “mobile” 作为名词时涵盖所有移动终端（如平板、移动热点），语义更广。"
    }
  ]
}