{
  "word": "mocked",
  "pronunciation": "mokt",
  "concise_definition": "v. 嘲笑, 讽刺, 模仿（mock 的过去式和过去分词）",
  "forms": {
    "base_form": "mock",
    "third_person_singular": "mocks",
    "present_participle": "mocking",
    "past_tense": "mocked",
    "past_participle": "mocked"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To make fun of someone or something in a cruel or contemptuous way, often by imitating their behavior, speech, or appearance to highlight perceived absurdity or weakness.",
      "explanation_cn": "以残忍或轻蔑的方式取笑某人或某事，常通过模仿其行为、言语或外表来突出其荒谬或弱点。",
      "example_en": "The students mocked her accent during the presentation, making her feel humiliated.",
      "example_cn": "学生们在演讲时嘲笑她的口音，让她感到羞辱。"
    },
    {
      "pos": "verb",
      "explanation_en": "To imitate someone or something in a playful or satirical manner, often for comedic effect or to critique a trend, without necessarily being malicious.",
      "explanation_cn": "以幽默或讽刺的方式模仿某人或某事，常用于制造喜剧效果或批评某种潮流，未必带有恶意。",
      "example_en": "The comedy show mocked political leaders by exaggerating their mannerisms.",
      "example_cn": "这部喜剧节目通过夸张政治家的举止来讽刺他们。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pretend to perform or simulate an action, often in a trial or rehearsal context, especially in sports or military training.",
      "explanation_cn": "在训练或排练情境中假装执行某项行动，常用于体育或军事训练中进行模拟。",
      "example_en": "The soldiers mocked the enemy’s attack pattern during the drill to prepare for real combat.",
      "example_cn": "士兵们在演习中模拟敌人的攻击模式，以准备应对真实战斗。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "teased",
      "analysis": "“Teased”（逗弄）通常指轻度、非恶意的玩笑，常用于朋友之间，带有亲密或调侃的意味，很少造成伤害。而 “mocked” 更具攻击性，常包含贬低、羞辱的意图，情感色彩更负面。"
    },
    {
      "word_to_compare": "ridiculed",
      "analysis": "“Ridiculed”（讥笑）与 “mocked” 非常接近，都表示强烈的嘲笑，但 “ridiculed” 更强调使某人显得荒谬可笑，常带有公开羞辱的意味，语气比 “mocked” 更严厉和残酷。"
    },
    {
      "word_to_compare": "parodied",
      "analysis": "“Parodied”（模仿讽刺）是一种有艺术性、结构化的模仿，通常用于文学、影视或音乐中，目的是通过夸张来评论或娱乐，而非直接攻击个人。而 “mocked” 更直接、个人化，常针对具体的人或行为，缺乏艺术加工。"
    }
  ]
}