{
  "word": "mod",
  "pronunciation": "mɒd",
  "concise_definition": "n. 摩德文化爱好者, 改装; v. 改装, 修饰",
  "forms": {
    "plural": "mods"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A member of a youth subculture that originated in the UK in the late 1950s and early 1960s, characterized by a focus on fashion, music (especially jazz, R&B, and later soul and pop), and motor scooters; known for sharp, modernist style and a rejection of traditional working-class norms.",
      "explanation_cn": "指20世纪50年代末至60年代初起源于英国的青年亚文化群体成员，以注重时尚、音乐（尤其是爵士、节奏布鲁斯，后扩展至灵魂乐和流行乐）和摩托车为特征，崇尚简洁现代的着装风格，反对传统工人阶级规范。",
      "example_en": "In the 1960s, mods were famous for their tailored suits, parkas, and Friday night trips to clubs.",
      "example_cn": "在20世纪60年代，摩德族以定制西装、风衣和周五晚上的俱乐部之旅而闻名。"
    },
    {
      "pos": "noun",
      "explanation_en": "Short for 'modification'; a change made to a game, software, or device to alter its original functionality or appearance, often by users or fans.",
      "explanation_cn": "“modification”（修改）的缩写，指用户或爱好者对游戏、软件或设备进行的更改，以改变其原始功能或外观。",
      "example_en": "The community created a popular mod that adds realistic weather effects to the game.",
      "example_cn": "社区创建了一个广受欢迎的模组，为游戏增添了真实的天气效果。"
    },
    {
      "pos": "verb",
      "explanation_en": "To modify or customize something, especially a vehicle, computer, or game, to improve performance, appearance, or functionality.",
      "explanation_cn": "指对某物（尤其是车辆、电脑或游戏）进行修改或定制，以提升其性能、外观或功能。",
      "example_en": "He spent months modding his motorcycle to make it faster and more stylish.",
      "example_cn": "他花了数月时间改装自己的摩托车，使其更快、更时尚。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "customize",
      "analysis": "“Customize”（定制）强调根据个人偏好进行调整，通常用于产品、服务或界面，范围更广，不局限于技术或亚文化语境。而 “mod” 更常用于技术或亚文化领域，特指对系统、游戏或设备的非官方修改，带有技术性或社群性色彩。"
    },
    {
      "word_to_compare": "upgrade",
      "analysis": "“Upgrade”（升级）指通过更换部件或更新版本来提升性能或功能，通常是官方的、正向的改进。而 “mod” 可以是任何类型的修改，包括降低性能或增加非官方功能，不一定追求“更好”，而是追求“不同”或“个性化”。"
    },
    {
      "word_to_compare": "style",
      "analysis": "“Style”（风格）是抽象的审美表达，而 “mod” 作为名词时特指一种具有历史和文化背景的亚文化身份，作为动词时则指具体的、技术性的改装行为。两者虽都涉及外观，但 “mod” 包含行为、社群和历史维度，远比 “style” 更具体和语境化。"
    }
  ]
}