{
  "word": "modern",
  "pronunciation": "muh·duhn",
  "concise_definition": "adj. 现代的, 当代的, 新式的",
  "forms": {
    "comparative": "more modern",
    "superlative": "most modern"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Belonging to or characteristic of the present or recent times, especially in terms of technology, design, or social norms that have evolved from traditional or historical forms.",
      "explanation_cn": "指属于当前或近现代的，尤其在技术、设计或社会规范方面，与传统或历史形式相比已发生演变。",
      "example_en": "The museum features a collection of modern art from the 20th century.",
      "example_cn": "这座博物馆收藏了20世纪的现代艺术作品。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Designed or constructed using contemporary methods, materials, or styles, often implying simplicity, functionality, and innovation.",
      "explanation_cn": "指采用当代方法、材料或风格设计或建造的，通常暗示简洁、实用和创新。",
      "example_en": "She lives in a modern apartment with open-plan living spaces and smart home technology.",
      "example_cn": "她住在一间拥有开放式布局和智能家居技术的现代公寓里。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Referring to a period in history, especially from the late 19th century onward, marked by significant cultural, political, and technological change.",
      "explanation_cn": "指历史上自19世纪末以来的一个时期，以重大的文化、政治和技术变革为特征。",
      "example_en": "Modern history begins after the Industrial Revolution.",
      "example_cn": "现代史始于工业革命之后。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "contemporary",
      "analysis": "“Contemporary” (当代的) 强调与当前时代同时存在的事物，侧重时间上的共时性，常用于艺术、文学或社会现象，语气更中性、学术化。而 “modern” 可能指近几十年甚至上百年前的革新阶段，不一定等于现在，例如 ‘modernist architecture’ 可能指20世纪初的风格。"
    },
    {
      "word_to_compare": "current",
      "analysis": "“Current” (当前的) 指正在发生或流行的，时间范围更窄，强调‘此时此刻’。例如 ‘current events’ 指最近发生的新闻。而 ‘modern’ 是一个更宽泛的时间范畴，可能涵盖几十年甚至一个世纪的演变，不局限于当下。"
    },
    {
      "word_to_compare": "new",
      "analysis": "“New” (新的) 是一个相对模糊的词，仅表示最近出现或未使用过，不涉及风格、时代或文化背景的转变。例如 ‘a new phone’ 只是刚买的产品。而 ‘modern’ 暗示一种系统性、风格化的革新，具有历史和文化维度，如 ‘modern medicine’ 不仅指新发明，更指整个科学范式的转变。"
    }
  ]
}