{
  "word": "models",
  "pronunciation": "moh·duhlz",
  "concise_definition": "n. 模型, 模范, 模特",
  "forms": {
    "singular": "model"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A simplified representation of a system, object, or concept, designed to explain, predict, or simulate its behavior or structure.",
      "explanation_cn": "指为解释、预测或模拟某个系统、物体或概念的行为或结构而构建的简化表示形式。",
      "example_en": "Climate scientists use computer models to predict future temperature changes.",
      "example_cn": "气候科学家使用计算机模型来预测未来的气温变化。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who displays clothing, accessories, or products for advertising or fashion purposes, often in photoshoots or runway shows.",
      "explanation_cn": "指为广告或时尚目的展示服装、配饰或产品的人员，通常出现在摄影棚或时装秀中。",
      "example_en": "She became a famous fashion model after being discovered at a shopping mall.",
      "example_cn": "她在购物中心被发现后，成为了一名著名的时尚模特。"
    },
    {
      "pos": "noun",
      "explanation_en": "An ideal or exemplary pattern to be imitated or followed, often serving as a standard of excellence.",
      "explanation_cn": "指可供模仿或遵循的理想典范，常作为卓越的标准。",
      "example_en": "Her integrity and leadership make her a model citizen.",
      "example_cn": "她的正直与领导力使她成为模范公民。"
    },
    {
      "pos": "noun",
      "explanation_en": "A prototype or preliminary version of a product, especially in engineering, design, or manufacturing, used for testing or demonstration.",
      "explanation_cn": "指在工程、设计或制造中用于测试或展示的产品原型或初步版本。",
      "example_en": "The car manufacturer unveiled a new electric vehicle model at the auto show.",
      "example_cn": "汽车制造商在车展上发布了一款新型电动汽车模型。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "prototype",
      "analysis": "“Prototype”（原型）特指产品开发初期的物理或功能版本，主要用于测试和验证设计可行性，强调技术实现的初步形态。而 “model” 的范围更广，可指抽象概念的表示（如数学模型）或非实物的典范（如行为模型），不一定具有可操作性。"
    },
    {
      "word_to_compare": "example",
      "analysis": "“Example”（范例）侧重于用具体事例说明一个普遍原则或规则，常用于教育或论证语境；而 “model” 更强调作为模仿对象的规范性或理想性，具有引导和标准作用。例如，一个模范学生不仅是‘例子’，更是‘榜样’。"
    },
    {
      "word_to_compare": "template",
      "analysis": "“Template”（模板）是预先设定的结构或格式，供重复使用以确保一致性（如文档模板、网页模板），强调标准化和可复制性；而 “model” 更注重对现实的抽象表达或理想形态的构建，不一定提供固定格式，可能包含动态或预测性元素。"
    }
  ]
}