{
  "word": "moderate",
  "pronunciation": "mahn·duh·rət",
  "concise_definition": "adj. 中等的, 适度的; v. 缓和, 调节, 主持",
  "forms": {
    "third_person_singular": "moderates",
    "past_tense": "moderated",
    "past_participle": "moderated",
    "present_participle": "moderating",
    "comparative": "more moderate",
    "superlative": "most moderate"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Not extreme, excessive, or intense; occupying a middle position in degree, amount, or intensity.",
      "explanation_cn": "不极端、不过度或不强烈；在程度、数量或强度上处于中间位置。",
      "example_en": "She has a moderate approach to dieting, avoiding both strict restrictions and overindulgence.",
      "example_cn": "她对节食采取适度的方式，既避免过度限制，也不放纵无度。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Of a political or ideological stance that favors gradual change and compromise rather than radical reform.",
      "explanation_cn": "指政治或意识形态立场倾向于渐进变革与妥协，而非激进改革。",
      "example_en": "The party's moderate wing supports incremental tax reform rather than sweeping changes.",
      "example_cn": "该党温和派支持渐进式税制改革，而非全面变革。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reduce the intensity, severity, or extremeness of something, often to make it more acceptable or manageable.",
      "explanation_cn": "减轻某事物的强度、严重性或极端性，使其更易被接受或控制。",
      "example_en": "The new policy aims to moderate the impact of inflation on low-income families.",
      "example_cn": "新政策旨在减轻通货膨胀对低收入家庭的影响。"
    },
    {
      "pos": "verb",
      "explanation_en": "To preside over or manage a discussion, debate, or event, ensuring fairness and order.",
      "explanation_cn": "主持讨论、辩论或活动，确保公平与秩序。",
      "example_en": "The professor moderated the panel discussion on climate change.",
      "example_cn": "教授主持了关于气候变化的小组讨论。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mild",
      "analysis": "“Mild”（温和的）通常用于描述感官体验（如味道、气候）或性格的柔和，强调缺乏强烈刺激或攻击性，语义范围较窄。而 “moderate” 更广泛用于程度、立场或行为的中庸，强调避免极端，常用于政治、经济或抽象概念。"
    },
    {
      "word_to_compare": "average",
      "analysis": "“Average”（平均的）是统计学概念，指在一组数据中居中的数值，强调数量上的中心趋势。而 “moderate” 是价值判断，强调在极端之间的合理平衡，不一定与统计平均值一致。例如，一个“moderate”立场可能远高于或低于平均意见。"
    },
    {
      "word_to_compare": "temper",
      "analysis": "“Temper”（缓和、控制）常用于情绪或反应的调节，如“temper one’s anger”，侧重于自我约束。而 “moderate” 更常用于外部环境、政策或讨论的调控，具有更正式和结构性的含义，且可作名词使用，而 “temper” 作动词时语义更局限。"
    }
  ]
}