{
  "word": "model",
  "pronunciation": "moh·del",
  "concise_definition": "n. 模型, 模范, 模特; v. 模仿, 示范, 扮演",
  "forms": {
    "plural": "models",
    "third_person_singular": "models",
    "past_tense": "modeled",
    "past_participle": "modeled",
    "present_participle": "modeling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A simplified representation of a system, object, or concept, used to understand, explain, or predict its behavior, often in science, engineering, or economics.",
      "explanation_cn": "指用于理解、解释或预测系统、物体或概念行为的简化表示形式，常用于科学、工程或经济学领域。",
      "example_en": "Climate scientists use computer models to predict future temperature changes.",
      "example_cn": "气候科学家使用计算机模型来预测未来的气温变化。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who displays clothing or products for advertising, especially in fashion or commercial contexts.",
      "explanation_cn": "指在时尚或商业环境中为服装或产品做展示的人，尤指时装模特。",
      "example_en": "She became a famous model after appearing on the cover of Vogue.",
      "example_cn": "她在《Vogue》杂志封面上亮相后成为著名模特。"
    },
    {
      "pos": "noun",
      "explanation_en": "An ideal example or standard to be imitated, often representing excellence or perfection in a particular field.",
      "explanation_cn": "指值得模仿的理想典范或标准，通常代表某一领域中的卓越或完美。",
      "example_en": "Her integrity and leadership make her a model citizen.",
      "example_cn": "她的正直与领导力使她成为模范公民。"
    },
    {
      "pos": "verb",
      "explanation_en": "To behave in a way that serves as an example for others to follow; to emulate or imitate.",
      "explanation_cn": "指以某种行为为他人树立榜样，模仿或效仿。",
      "example_en": "Parents should model kindness and patience for their children.",
      "example_cn": "父母应为孩子树立善良与耐心的榜样。"
    },
    {
      "pos": "verb",
      "explanation_en": "To create or design a representation of something, especially in a physical or digital form for testing or visualization.",
      "explanation_cn": "指为某物创建或设计一种表现形式，尤其用于测试或可视化目的的实体或数字模型。",
      "example_en": "Architects modeled the building in 3D before construction began.",
      "example_cn": "建筑师在施工前用三维软件建模了这座建筑。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "example",
      "analysis": "“Example” 强调用具体事例来说明或支持一个观点，侧重于“证明”或“阐释”；而 “model” 更强调作为“榜样”或“标准”被模仿，具有规范性和理想性。例如，一个错误的决策是“example”，而一个完美的领导方式是“model”。"
    },
    {
      "word_to_compare": "prototype",
      "analysis": "“Prototype” (原型) 是产品开发初期的实物雏形，用于测试功能和设计，强调“技术性”和“可迭代性”；而 “model” 可以是抽象的（如数学模型）或视觉的（如服装模特），用途更广泛，不一定用于测试。"
    },
    {
      "word_to_compare": "pattern",
      "analysis": "“Pattern” (模式/样板) 指重复出现的结构、样式或规律，常用于纺织、数学或行为分析；而 “model” 更强调作为参照对象的完整性与代表性，不一定是重复的模板。例如，缝纫用的纸样是 pattern，而设计师的风格是 model。"
    }
  ]
}