{
  "word": "modernist",
  "pronunciation": "muh·duh·nist",
  "concise_definition": "n. 现代主义者, 现代派; adj. 现代主义的",
  "forms": {
    "plural": "modernists"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who supports or practices modernism, especially in art, literature, architecture, or culture, characterized by a break from traditional forms and an emphasis on innovation, abstraction, and experimentation.",
      "explanation_cn": "指支持或实践现代主义的人，尤其在艺术、文学、建筑或文化领域，其特征是摒弃传统形式，强调创新、抽象与实验。",
      "example_en": "Pablo Picasso was a leading modernist in 20th-century painting.",
      "example_cn": "巴勃罗·毕加索是20世纪绘画领域的杰出现代主义者。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who adheres to modernist principles in religion or theology, often advocating for reinterpretation of doctrine in light of contemporary knowledge and values.",
      "explanation_cn": "指在宗教或神学领域坚持现代主义原则的人，通常主张根据当代知识与价值观重新诠释教义。",
      "example_en": "The modernists in the Catholic Church sought to reconcile faith with scientific progress.",
      "example_cn": "天主教会中的现代主义者试图调和信仰与科学进步。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characteristic of modernism, especially in style, design, or thought, favoring simplicity, functionality, and rejection of ornamentation.",
      "explanation_cn": "与现代主义相关或具有其特征的，尤其在风格、设计或思想上，倾向于简洁、功能性和摒弃装饰。",
      "example_en": "The building features a modernist design with clean lines and open spaces.",
      "example_cn": "这栋建筑采用现代主义风格，线条简洁，空间开阔。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "modern",
      "analysis": "“Modern”（现代的）是一个更广泛、更中性的词，泛指当代或近现代的事物，不必然包含艺术或思想上的革新立场。而 “modernist” 特指主动拥抱并推动现代主义运动的人或作品，具有明确的意识形态和美学主张。"
    },
    {
      "word_to_compare": "contemporary",
      "analysis": "“Contemporary”（当代的）仅指时间上属于当前时代的，不涉及风格或哲学立场。一个作品可以是当代的但非现代主义的（如传统风格的油画）。而 “modernist” 强调的是20世纪初兴起的特定艺术与文化革命，具有历史和风格的限定性。"
    },
    {
      "word_to_compare": "avant-garde",
      "analysis": "“Avant-garde”（先锋的）强调在艺术或文化中处于最前沿、最具颠覆性的实验性立场，常超越现代主义。现代主义是先锋艺术的一个重要阶段，但先锋艺术可能包括后现代、超现实等更激进的形式。因此，所有现代主义者都可被视为先锋，但并非所有先锋都是现代主义者。"
    }
  ]
}