{
  "word": "mold",
  "pronunciation": "mohld",
  "concise_definition": "n. 霉菌, 模具; v. 塑造, 形成, 发霉",
  "forms": {
    "third_person_singular": "molds",
    "past_tense": "molded",
    "past_participle": "molded",
    "present_participle": "molding",
    "plural": "molds"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A type of fungus that grows in damp environments, often appearing as a fuzzy or discolored patch on food, walls, or other organic materials.",
      "explanation_cn": "一种在潮湿环境中生长的真菌，常表现为食物、墙壁或其他有机材料上的绒毛状或变色斑块。",
      "example_en": "The old bread had developed a green mold after being left in the pantry for weeks.",
      "example_cn": "那块旧面包在食品柜里放了几周后长出了绿色霉菌。"
    },
    {
      "pos": "noun",
      "explanation_en": "A hollow container or frame used to give a specific shape to a material as it hardens, such as molten metal, plastic, or plaster.",
      "explanation_cn": "一种空心容器或框架，用于在材料凝固时赋予其特定形状，如熔融金属、塑料或石膏。",
      "example_en": "The artist used a clay mold to cast the bronze statue.",
      "example_cn": "这位艺术家使用陶土模具铸造了青铜雕像。"
    },
    {
      "pos": "verb",
      "explanation_en": "To shape or form something by using a mold, or to influence the development of someone's character, beliefs, or behavior over time.",
      "explanation_cn": "通过模具塑造某物，或长期影响某人的性格、信念或行为的发展。",
      "example_en": "Her teachers molded her into a confident and thoughtful leader.",
      "example_cn": "她的老师将她塑造成一位自信而富有思辨力的领导者。"
    },
    {
      "pos": "verb",
      "explanation_en": "To become covered with mold, especially due to dampness or poor ventilation.",
      "explanation_cn": "因潮湿或通风不良而长出霉菌。",
      "example_en": "The basement walls had molded after the flood.",
      "example_cn": "地下室的墙壁在水灾后发霉了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fungal",
      "analysis": "“Fungal” 是形容词，意为‘真菌的’，用于描述与真菌相关的特性，如 fungal infection（真菌感染）。而 “mold” 是名词或动词，特指一种可见的、常有害的真菌生长形式，具有具体实体和行为含义。"
    },
    {
      "word_to_compare": "cast",
      "analysis": "“Cast” (铸造) 通常指将熔融材料倒入模具中形成特定形状的过程，强调物理成型的最终动作。而 “mold” 作为动词时，不仅指物理塑造，还可用于抽象意义（如塑造性格），范围更广。作为名词时，mold 指模具本身，cast 指成型后的产物。"
    },
    {
      "word_to_compare": "shape",
      "analysis": "“Shape” (塑造/形成) 是一个更通用的词，可用于物理或抽象层面，但不包含“模具”或“霉菌”的具体含义。而 “mold” 在作为动词时，隐含了通过外部模型或长期影响进行塑造的过程，更具语义深度和具体性。"
    }
  ]
}