{
  "word": "molds",
  "pronunciation": "mohldz",
  "concise_definition": "n. 霉菌, 模具, 塑形; v. 塑形, 形成",
  "forms": {
    "singular": "mold",
    "third_person_singular": "molds",
    "past_tense": "molded",
    "past_participle": "molded",
    "present_participle": "molding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A type of fungus that grows in damp environments, often appearing as fuzzy or discolored patches on food, walls, or other organic materials.",
      "explanation_cn": "一种在潮湿环境中生长的真菌，常表现为食物、墙壁或其他有机材料上的绒毛状或变色斑块。",
      "example_en": "The old bread was covered in green molds after being left in the pantry for weeks.",
      "example_cn": "那块旧面包在食品柜里放了几周后，表面长满了绿色霉菌。"
    },
    {
      "pos": "noun",
      "explanation_en": "A hollow container or frame used to give a specific shape to a material as it hardens, such as molten metal, plastic, or concrete.",
      "explanation_cn": "一种空心容器或框架，用于在材料硬化时赋予其特定形状，如熔融金属、塑料或混凝土。",
      "example_en": "The artist used a clay mold to cast a bronze statue of a horse.",
      "example_cn": "这位艺术家使用陶土模具铸造了一匹青铜马雕像。"
    },
    {
      "pos": "verb",
      "explanation_en": "To shape or form something by pouring or pressing material into a mold, or to influence the development of something over time.",
      "explanation_cn": "通过将材料倒入或压入模具来塑造某物，或指长期影响某事物的发展过程。",
      "example_en": "The teacher's words molded the students' values over the course of the semester.",
      "example_cn": "老师的话语在本学期中塑造了学生的价值观。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fungus",
      "analysis": "“Fungus”（真菌）是生物学上的总称，包括酵母、霉菌、蘑菇等；而 “mold” 是真菌的一种特定类型，特指在潮湿表面生长的丝状菌类。因此，“mold” 是 “fungus” 的子集，但更具体、更常用于日常语境。"
    },
    {
      "word_to_compare": "cast",
      "analysis": "“Cast”（铸造）强调通过模具制造出最终产品，常用于金属或雕塑领域，是一个完成动作的动词；而 “mold” 作为动词时，既可以指物理塑形，也可引申为影响性格或习惯，语义范围更广。作为名词时，“cast” 通常指最终产物，而 “mold” 指的是塑造工具。"
    },
    {
      "word_to_compare": "shape",
      "analysis": "“Shape”（形状/塑造）是一个通用词，可指任何形式的外形或影响过程，不涉及具体工具或材料；而 “mold” 隐含了使用物理模具或长期环境影响的机制，更具技术性或隐喻性。例如，你可以说 ‘shape a child’s behavior’，但 ‘mold a child’s behavior’ 暗示更深层、更持久的塑造过程。"
    }
  ]
}