{
  "word": "molded",
  "pronunciation": "mohld",
  "concise_definition": "adj. 被塑形的, 成型的; v. 塑造, 塑形（mold 的过去式和过去分词）",
  "forms": {
    "base_form": "mold",
    "past_tense": "molded",
    "past_participle": "molded",
    "present_participle": "molding",
    "third_person_singular": "molds"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Shaped or formed by being pressed, cast, or shaped in a mold, often referring to materials like plastic, metal, or clay that have been given a specific form.",
      "explanation_cn": "指通过压模、铸造或在模具中成型而获得特定形状的，常用于描述塑料、金属或黏土等材料被赋予特定形态的状态。",
      "example_en": "The toy was made of molded plastic with intricate details.",
      "example_cn": "这个玩具由带有精细细节的模塑塑料制成。"
    },
    {
      "pos": "verb",
      "explanation_en": "To shape or form something by using a mold or by directing growth, often implying influence or conditioning over time.",
      "explanation_cn": "指使用模具塑造某物，或通过引导、影响使其逐渐形成某种形态或特性，常用于比喻性语境中描述性格、习惯或文化的形成。",
      "example_en": "Her parents molded her values through consistent discipline and example.",
      "example_cn": "她的父母通过一贯的纪律和榜样塑造了她的价值观。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to grow or develop in a particular direction, especially in biological or social contexts.",
      "explanation_cn": "指在生物或社会语境中，促使某物朝特定方向生长或发展，强调过程中的引导作用。",
      "example_en": "The teacher molded the young minds with patience and wisdom.",
      "example_cn": "这位老师以耐心和智慧塑造了孩子们的思维。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "shaped",
      "analysis": "“Shaped”（成形的）是更通用的词，泛指任何形式的外形改变，可以是手工、自然或机械作用的结果，不强调使用模具。而 “molded” 特指通过模具或模板进行的成型过程，具有更强的工业或技术语境。"
    },
    {
      "word_to_compare": "formed",
      "analysis": "“Formed”（形成的）强调从无到有或从一种状态转变为另一种状态的过程，适用范围极广，包括抽象概念（如形成习惯）。而 “molded” 更具体，常暗示外部力量（如模具或权威）对形态的主动塑造，尤其在比喻义中带有更强的控制或影响意味。"
    },
    {
      "word_to_compare": "cast",
      "analysis": "“Cast”（铸造）特指将熔化的金属或树脂倒入模具中冷却成型，多用于金属加工或雕塑领域，过程强调高温液态到固态的转变。而 “molded” 可用于固态或半固态材料（如塑料、黏土）的压制成型，工艺更广泛，也常用于非物理的比喻用法。"
    }
  ]
}