{
  "word": "molding",
  "pronunciation": "mohld·ing",
  "concise_definition": "n. 装饰线条, 模具, 成型; v. 成型, 塑造",
  "forms": {
    "plural": "moldings",
    "third_person_singular": "molds",
    "past_tense": "molded",
    "past_participle": "molded",
    "present_participle": "molding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A strip or strip-like decorative element, often made of wood, plaster, or plastic, used to cover transitions between surfaces such as walls and ceilings, or around doors and windows.",
      "explanation_cn": "指用于覆盖墙面与天花板、门或窗等表面交接处的条状装饰构件，通常由木材、石膏或塑料制成。",
      "example_en": "The room was enhanced by elegant crown molding that traced the ceiling's edge.",
      "example_cn": "房间因精致的顶角线装饰而显得更加优雅。"
    },
    {
      "pos": "noun",
      "explanation_en": "A hollow container or form used to give a specific shape to a material, especially when it is liquid or pliable, such as molten metal, plastic, or clay.",
      "explanation_cn": "指用于使液体或可塑材料（如熔融金属、塑料或黏土）成型的中空模具或模型。",
      "example_en": "The artist poured molten bronze into a clay molding to create the statue.",
      "example_cn": "艺术家将熔化的青铜倒入黏土模具中，以制作雕像。"
    },
    {
      "pos": "verb",
      "explanation_en": "To shape or form a material by pouring or pressing it into a mold, or by manipulating it while it is soft or pliable.",
      "explanation_cn": "指通过将柔软或可塑的材料倒入或压入模具中，或通过手工塑形使其获得特定形状。",
      "example_en": "Children love molding clay into animals at art class.",
      "example_cn": "孩子们在美术课上喜欢把黏土捏成各种动物。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cast",
      "analysis": "“Cast”（铸造）特指将熔融材料倒入模具中冷却成型的过程，多用于金属、石膏等硬质材料，强调最终产品的刚性与精确性。而 “molding” 更广泛，可指任何塑形过程，包括热塑性塑料、黏土等软材料的成型，不一定涉及高温或冷却固化。"
    },
    {
      "word_to_compare": "trim",
      "analysis": "“Trim”（装饰边条）通常指用于美化或收边的薄板或条状物，功能上更侧重于视觉修饰，而非结构过渡。而 “molding” 不仅具有装饰性，还常承担连接不同表面、隐藏接缝的实用功能，结构意义更强。"
    },
    {
      "word_to_compare": "shaping",
      "analysis": "“Shaping”（塑形）是更通用的动词，泛指任何形式的外形调整，可以是手工、机械或自然过程，不依赖模具。而 “molding” 特指借助模具进行的成型，具有重复性、标准化的特征，强调工具的介入。"
    }
  ]
}