{
  "word": "monkey",
  "pronunciation": "muhng·kee",
  "concise_definition": "n. 猴子, 顽皮的人; v. 模仿, 玩闹",
  "forms": {
    "plural": "monkeys"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small to medium-sized primate, typically with a long tail, found in tropical regions, known for its agility and playful behavior.",
      "explanation_cn": "一种体型较小至中等的灵长类动物，通常有长尾，生活在热带地区，以敏捷和爱玩的行为著称。",
      "example_en": "The monkeys in the zoo were swinging from branch to branch.",
      "example_cn": "动物园里的猴子正从一根树枝荡到另一根树枝上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who behaves in a silly, mischievous, or playful way, often used informally or affectionately.",
      "explanation_cn": "指行为愚蠢、顽皮或爱闹的人，常用于非正式或亲昵的语境中。",
      "example_en": "You little monkey, you hid my keys again!",
      "example_cn": "你这个小调皮鬼，又把我的钥匙藏起来了！"
    },
    {
      "pos": "verb",
      "explanation_en": "To imitate or mimic someone's actions, often in a silly or exaggerated way.",
      "explanation_cn": "以愚蠢或夸张的方式模仿他人的行为。",
      "example_en": "The children were monkeying around in the classroom, copying their teacher's gestures.",
      "example_cn": "孩子们在教室里模仿老师的动作，闹个不停。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fiddle with or tamper with something, often carelessly or without proper knowledge.",
      "explanation_cn": "指随意摆弄或干涉某物，常带有粗心或缺乏专业知识的意味。",
      "example_en": "He monkeyed with the engine until it finally broke down.",
      "example_cn": "他胡乱摆弄引擎，直到它彻底坏了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ape",
      "analysis": "“Ape”（猿）指无尾的灵长类动物，如大猩猩、黑猩猩，体型通常更大，智力更高，更接近人类。而 “monkey” 通常指有尾的灵长类动物，体型较小，行为更活泼、更外向。在非科学语境中，人们常误用 “ape” 来泛指所有猴子，但严格来说两者是不同的分类。"
    },
    {
      "word_to_compare": "chimp",
      "analysis": "“Chimp” 是 “chimpanzee” 的口语形式，属于猿类，与人类基因高度相似，具有复杂的社会行为和工具使用能力。而 “monkey” 是更广泛、更通俗的词，泛指多种有尾灵长类动物，不具备 “chimp” 所具有的高级认知特征。"
    },
    {
      "word_to_compare": "fool",
      "analysis": "“Fool”（傻瓜）强调智力或判断力的缺失，带有贬义；而 “monkey” 作为名词形容人时，更侧重行为的顽皮、淘气或滑稽，常不具恶意，甚至带有亲昵色彩。例如，说一个人是 “a monkey” 可能是笑骂，但说 “a fool” 则是严厉批评。"
    }
  ]
}