{
  "word": "mono",
  "pronunciation": "moh·noh",
  "concise_definition": "n. 单一, 单声道, 传染性单核细胞增多症",
  "forms": {
    "plural": "monos"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A system or recording that uses a single audio channel, as opposed to stereo, producing sound from one source rather than multiple directional sources.",
      "explanation_cn": "指使用单一音频通道的系统或录音方式，与立体声相对，声音从一个源头发出，而非多个方向。",
      "example_en": "The old vinyl record was recorded in mono, so the music sounds the same from both speakers.",
      "example_cn": "这张老黑胶唱片是单声道录制的，所以音乐从两个扬声器中听起来都一样。"
    },
    {
      "pos": "noun",
      "explanation_en": "Short for infectious mononucleosis, a viral illness commonly caused by the Epstein-Barr virus, characterized by fever, sore throat, swollen lymph nodes, and extreme fatigue.",
      "explanation_cn": "“传染性单核细胞增多症”的简称，一种由EB病毒（Epstein-Barr病毒）引起的病毒感染，症状包括发热、咽喉痛、淋巴结肿大和极度疲劳。",
      "example_en": "She was diagnosed with mono after a week of exhaustion and a persistent sore throat.",
      "example_cn": "她在持续一周的疲惫和咽喉疼痛后被诊断为患了传染性单核细胞增多症。"
    },
    {
      "pos": "noun",
      "explanation_en": "A prefix or term used to indicate singularity or oneness, often in scientific or technical contexts (e.g., monochrome, monolith).",
      "explanation_cn": "在科学或技术语境中，用于表示单一性或统一性的前缀或术语（如 monochrome 单色、monolith 单体）。",
      "example_en": "The artist preferred mono tones to create a minimalist aesthetic.",
      "example_cn": "这位艺术家偏好单色调，以营造极简主义的美学效果。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "stereo",
      "analysis": "“Stereo”（立体声）指使用两个或多个独立音频通道来模拟空间感和方向感的声音系统，与 “mono”（单声道）形成直接对比。Mono 强调统一、集中，而 stereo 强调空间分布和层次感。"
    },
    {
      "word_to_compare": "unilateral",
      "analysis": "“Unilateral”（单方面的）强调由一方单独做出的决定或行动，常用于政治或法律语境，如 unilateral decision。而 “mono” 更侧重于物理或技术上的单一性，如单声道或单色，不涉及主体意志。"
    },
    {
      "word_to_compare": "monochrome",
      "analysis": "“Monochrome”（单色）是 “mono” 的派生词，特指仅使用一种颜色或色调的视觉表现，如黑白照片。虽然两者都含“单一”之意，但 “mono” 本身是更广义的前缀，可应用于声音、医学、结构等多个领域，而 “monochrome” 仅限于色彩范畴。"
    }
  ]
}