{
  "word": "monroe",
  "pronunciation": "muh·rohn",
  "concise_definition": "n. 美国第五任总统詹姆斯·门罗；门罗主义；（俚语）门罗式姿势",
  "forms": {
    "plural": "monroes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "James Monroe (1758–1831), the fifth President of the United States (1817–1825), known for his foreign policy doctrine that opposed European colonialism in the Americas.",
      "explanation_cn": "美国第五任总统詹姆斯·门罗（1758–1831），以反对欧洲列强在美洲殖民扩张的外交政策而闻名。",
      "example_en": "The Monroe Doctrine, articulated by President Monroe in 1823, became a cornerstone of U.S. foreign policy.",
      "example_cn": "门罗总统于1823年提出的门罗主义，成为美国外交政策的基石。"
    },
    {
      "pos": "noun",
      "explanation_en": "The Monroe Doctrine, a U.S. policy asserting that any further efforts by European nations to colonize land or interfere with states in North or South America would be viewed as acts of aggression.",
      "explanation_cn": "门罗主义，一项美国外交政策，主张任何欧洲国家进一步在北美或南美殖民或干涉其国家事务的行为都将被视为敌对行为。",
      "example_en": "Throughout the 19th century, the Monroe Doctrine was invoked to justify American intervention in Latin America.",
      "example_cn": "整个19世纪，门罗主义被援引为美国干预拉丁美洲事务的正当理由。"
    },
    {
      "pos": "noun",
      "explanation_en": "Slang: A pose in which a person lies on their back with legs spread apart, often associated with the iconic pose of Marilyn Monroe in 'The Seven Year Itch'.",
      "explanation_cn": "俚语：一种仰卧、双腿分开的姿势，常与玛丽莲·梦露在电影《七年之痒》中的经典姿势相关联。",
      "example_en": "She struck a monroe on the beach, laughing as the wind lifted her dress.",
      "example_cn": "她在沙滩上摆出一个门罗式姿势，笑着任风吹起她的裙子。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "doctrine",
      "analysis": "“Doctrine”（教义/主义）泛指一套系统性的信念或原则，如“马克思主义”或“达尔文主义”。而 “Monroe” 作为专有名词特指美国的门罗主义，是“doctrine”的一个具体实例，具有历史和政治语境的唯一性。"
    },
    {
      "word_to_compare": "president",
      "analysis": "“President”（总统）是通用头衔，指任何国家的最高行政长官。而 “Monroe” 是特指美国第五任总统詹姆斯·门罗，是“president”的一个具体人物实例，承载了特定的历史政策与文化符号。"
    },
    {
      "word_to_compare": "pose",
      "analysis": "“Pose”（姿势）是通用词，指身体摆出的任何姿态。而 “monroe” 作为俚语特指玛丽莲·梦露在电影中标志性的裙摆飞扬姿势，具有强烈的文化意象和流行语境，是“pose”的一个高度具象化的子类。"
    }
  ]
}