{
  "word": "mop",
  "pronunciation": "mäp",
  "concise_definition": "n. 拖把, v. 拖地, 擦拭, 吸干",
  "forms": {
    "third_person_singular": "mops",
    "past_tense": "mopped",
    "past_participle": "mopped",
    "present_participle": "mopping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A cleaning tool consisting of a handle with an absorbent head, typically made of cloth, sponge, or fibers, used for washing or drying floors.",
      "explanation_cn": "一种清洁工具，由一根手柄和一个吸水性头部（通常由布、海绵或纤维制成）组成，用于清洗或擦干地板。",
      "example_en": "She grabbed the mop and started cleaning the spilled water.",
      "example_cn": "她拿起拖把，开始清理洒出的水。"
    },
    {
      "pos": "verb",
      "explanation_en": "To clean a floor or surface by wiping it with a mop, often after washing or to remove moisture.",
      "explanation_cn": "用拖把擦拭地板或表面，通常在清洗后或为去除水分时进行。",
      "example_en": "He mopped the kitchen floor after the flood from the broken pipe.",
      "example_cn": "水管破裂后，他把厨房地板拖了一遍。"
    },
    {
      "pos": "verb",
      "explanation_en": "To wipe or absorb liquid with a cloth or sponge, often in a sweeping or dabbing motion, not necessarily with a traditional mop.",
      "explanation_cn": "用布或海绵以扫动或轻拍的方式擦拭或吸干液体，不一定使用传统拖把。",
      "example_en": "The waiter mopped up the spilled wine with a napkin.",
      "example_cn": "服务员用纸巾擦掉了洒出的葡萄酒。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or sweep in a slow, heavy, or sluggish manner, often used figuratively to describe someone moving lethargically.",
      "explanation_cn": "缓慢、沉重或懒散地移动，常用于比喻形容人行动迟缓。",
      "example_en": "The tired child mopped along behind his parents, dragging his feet.",
      "example_cn": "疲惫的孩子拖着脚步，慢吞吞地跟在父母身后。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sweep",
      "analysis": "“Sweep”（扫）指用扫帚清除灰尘或碎屑，强调横向移动以移除固体杂物，通常不涉及液体。而 “mop” 专指用湿拖把清洁地面，主要处理液体或粘性污渍，动作更侧重于吸收而非清扫。"
    },
    {
      "word_to_compare": "wipe",
      "analysis": "“Wipe”（擦拭）泛指用布、纸等物体表面擦拭，动作范围小、力度轻，可用于桌面、玻璃、手等任何表面。而 “mop” 通常指大面积、重复性的清洁动作，尤其针对地面，且常伴随吸水功能。"
    },
    {
      "word_to_compare": "dab",
      "analysis": "“Dab”（轻拍）指用柔软物体轻轻点压以吸收液体，动作细微、局部，常用于化妆或处理小面积污渍。而 “mop” 是更全面、更用力的清洁动作，覆盖范围广，常用于大量液体清理。"
    }
  ]
}