{
  "word": "morphology",
  "pronunciation": "mawr·fol·uh·jee",
  "concise_definition": "n. 形态学, 形式结构, 词形变化",
  "forms": {
    "plural": "morphologies"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The scientific study of the forms and structures of organisms, especially the arrangement and development of their physical parts, such as bones, organs, or body shapes.",
      "explanation_cn": "对生物体形态与结构的科学研究，尤其关注其身体部位（如骨骼、器官或体型）的排列与发育方式。",
      "example_en": "The morphology of birds' wings varies significantly depending on their flight patterns and habitats.",
      "example_cn": "鸟类翅膀的形态因飞行方式和栖息地的不同而有显著差异。"
    },
    {
      "pos": "noun",
      "explanation_en": "In linguistics, the study of the internal structure of words and how they are formed from smaller units called morphemes, such as prefixes, suffixes, and roots.",
      "explanation_cn": "在语言学中，研究词语的内部结构及其如何由称为语素的最小意义单位（如前缀、后缀和词根）构成。",
      "example_en": "The morphology of the word 'unhappiness' includes the root 'happy', the prefix 'un-', and the suffix '-ness'.",
      "example_cn": "单词 'unhappiness' 的形态结构包括词根 'happy'、前缀 'un-' 和后缀 '-ness'。"
    },
    {
      "pos": "noun",
      "explanation_en": "The characteristic form or structure of a thing, especially when analyzed in terms of its component parts and their relationships.",
      "explanation_cn": "某事物的典型形态或结构，尤其指从其组成部分及其相互关系的角度进行分析时所呈现的样式。",
      "example_en": "The morphology of this ancient city reveals a highly organized urban layout with distinct residential and ceremonial zones.",
      "example_cn": "这座古城的形态揭示了其高度有序的城市布局，包含明确的居住区与仪式区。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "anatomy",
      "analysis": "“Anatomy” (解剖学) 侧重于生物体内部结构的详细分解，尤其是器官、组织和系统的物理构成，通常用于医学或生物学中。而 “morphology” 更广泛，涵盖外部形态、整体结构及其演化模式，不仅限于内部解剖。"
    },
    {
      "word_to_compare": "syntax",
      "analysis": "“Syntax” (句法) 是语言学中研究句子结构和词语排列规则的学科，关注的是词语如何组合成合乎语法的句子。而 “morphology” 关注的是单个词的内部构成（如词根、词缀），是比句法更基础的语言单位分析。"
    },
    {
      "word_to_compare": "structure",
      "analysis": "“Structure” (结构) 是一个通用词，泛指任何事物组成部分的组织方式，可用于建筑、社会、系统等广泛领域。而 “morphology” 是一个专业术语，特指形态或形式的系统性研究，尤其在生物学和语言学中具有特定含义。"
    }
  ]
}