{
  "word": "motions",
  "pronunciation": "mō·shənz",
  "concise_definition": "n. 动作, 举动, 提案, 运动",
  "forms": {
    "singular": "motion"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A physical movement or gesture made by a person or object, often to express an idea, emotion, or intention.",
      "explanation_cn": "指人或物体做出的物理性动作或姿态，常用于表达某种想法、情感或意图。",
      "example_en": "She made a subtle motion with her hand to signal that it was time to leave.",
      "example_cn": "她用手做了一个微妙的手势，示意该离开了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A formal proposal made in a meeting or legislative body for consideration and voting, often requiring a second and a majority to pass.",
      "explanation_cn": "指在会议或立法机构中提出的正式提案，需经他人附议并投票通过方可生效。",
      "example_en": "The chairman put the motion to adjourn the meeting to a vote.",
      "example_cn": "主席将休会的动议提交表决。"
    },
    {
      "pos": "noun",
      "explanation_en": "A legal procedure or application made to a court to obtain a specific order or ruling, such as a motion to dismiss or a motion for summary judgment.",
      "explanation_cn": "指在法律程序中向法院提出的正式申请，以获得特定的命令或裁决，例如驳回动议或即决判决动议。",
      "example_en": "The defense filed a motion to suppress the evidence obtained without a warrant.",
      "example_cn": "辩护方提交了一份动议，要求排除无搜查令获得的证据。"
    },
    {
      "pos": "noun",
      "explanation_en": "A mechanical or physical system that moves or causes movement, especially in the context of machinery or robotics.",
      "explanation_cn": "指机械或物理系统中产生或引起运动的部分，尤其用于机械或机器人领域。",
      "example_en": "The robot's motions were programmed to mimic human walking patterns.",
      "example_cn": "这个机器人的动作被编程为模仿人类的行走模式。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "gesture",
      "analysis": "“Gesture”（手势）特指用身体部位（尤其是手）表达情感或意图的非语言动作，通常具有象征性或社交性，范围较窄。而 “motion” 更广泛，可涵盖任何身体或物体的移动，包括非象征性的动作，如机械运动。"
    },
    {
      "word_to_compare": "proposal",
      "analysis": "“Proposal”（提议）泛指任何建议或计划，可用于日常语境或正式场合，但不局限于会议程序。而 “motion” 是法律或议会程序中的特定术语，具有严格的程序性要求（如附议、投票），语义更专业、更制度化。"
    },
    {
      "word_to_compare": "movement",
      "analysis": "“Movement”（运动/运动）通常指持续、有方向性的动作，或社会、政治层面的集体行动（如民权运动）。它强调过程、规模和影响力。而 “motion” 更侧重于单次、短暂的动作或程序性行为，常为瞬时性或仪式性。"
    }
  ]
}