{
  "word": "mould",
  "pronunciation": "mould",
  "concise_definition": "n. 模具, 霉菌; v. 塑造, 形成",
  "forms": {
    "plural": "moulds",
    "third_person_singular": "moulds",
    "past_tense": "moulded",
    "past_participle": "moulded",
    "present_participle": "moulding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A hollow container or frame used to give a particular shape to a material as it hardens or sets, such as metal, plastic, or concrete.",
      "explanation_cn": "一种空心容器或框架，用于在材料硬化或凝固时赋予其特定形状，如金属、塑料或混凝土。",
      "example_en": "The artist poured molten bronze into a clay mould to create the statue.",
      "example_cn": "艺术家将熔化的青铜倒入黏土模具中，以制作雕像。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of fungus that grows on damp or decaying organic matter, often appearing as a fuzzy or discoloured patch on surfaces.",
      "explanation_cn": "一种在潮湿或腐烂的有机物上生长的真菌，常表现为物体表面的绒毛状或变色斑块。",
      "example_en": "Black mould had formed on the bathroom walls due to poor ventilation.",
      "example_cn": "由于通风不良，浴室墙壁上长出了黑色霉菌。"
    },
    {
      "pos": "verb",
      "explanation_en": "To shape or form something by using a mould or by influencing its development over time.",
      "explanation_cn": "通过使用模具或通过长期影响其发展来塑造或形成某物。",
      "example_en": "The teacher moulded the young minds with patience and wisdom.",
      "example_cn": "老师以耐心和智慧塑造了孩子们的心灵。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a material to take a specific shape by pouring or pressing it into a mould.",
      "explanation_cn": "通过将材料倒入或压入模具中，使其形成特定形状。",
      "example_en": "The factory moulds plastic parts for automotive use.",
      "example_cn": "工厂用模具压制汽车用塑料零件。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "form",
      "analysis": "“Form” (形成) 是一个更广泛的词，泛指任何使事物具有特定结构或形态的过程，可以是自然的或抽象的（如形成习惯、形成观点）。而 “mould” 更强调通过外部容器（模具）或强烈影响（如教育）来塑造，带有更强的主动性和控制性。"
    },
    {
      "word_to_compare": "shape",
      "analysis": "“Shape” (塑造) 侧重于改变物体的外形或轮廓，常用于物理层面，也可用于比喻（如塑造性格）。但 “mould” 在比喻用法中更强调长期、细致、潜移默化的影响，尤其在教育或文化语境中，比 “shape” 更具深度和过程感。"
    },
    {
      "word_to_compare": "fungal growth",
      "analysis": "“Fungal growth” (真菌生长) 是一个科学术语，泛指所有真菌的繁殖和蔓延，而 “mould” 是真菌的一种具体类型，特指在潮湿环境中形成的绒毛状菌丝体。在日常语境中，“mould” 是更常用、更口语化的表达。"
    }
  ]
}