{
  "word": "mounted",
  "pronunciation": "mown·tɪd",
  "concise_definition": "adj. 骑乘的, 安装的, 固定的; v. 骑, 安装, 装置（mount 的过去式和过去分词）",
  "forms": {
    "base_form": "mount",
    "third_person_singular": "mounts",
    "present_participle": "mounting",
    "past_tense": "mounted",
    "past_participle": "mounted"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Fixed or attached securely to a surface or structure, often for functional or decorative purposes.",
      "explanation_cn": "牢固地固定或安装在表面或结构上，通常用于功能或装饰目的。",
      "example_en": "The mounted camera captured every detail of the event.",
      "example_cn": "安装好的摄像头记录下了活动的每一个细节。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Riding a horse or other animal, typically in a formal or ceremonial context.",
      "explanation_cn": "骑在马或其他动物上，通常用于正式或仪式性场合。",
      "example_en": "The mounted knights rode in procession during the medieval festival.",
      "example_cn": "骑在马上的骑士们在中世纪节日中列队行进。"
    },
    {
      "pos": "verb",
      "explanation_en": "To place or fix something firmly in position, especially on a surface or support.",
      "explanation_cn": "将某物牢固地放置或固定在某个位置，尤其是固定在表面或支撑物上。",
      "example_en": "They mounted the television on the wall to save space.",
      "example_cn": "他们把电视安装在墙上以节省空间。"
    },
    {
      "pos": "verb",
      "explanation_en": "To get on and ride a horse or other animal.",
      "explanation_cn": "跨上马或其他动物并骑行。",
      "example_en": "She mounted her horse and galloped toward the horizon.",
      "example_cn": "她跨上马背，朝地平线飞驰而去。"
    },
    {
      "pos": "verb",
      "explanation_en": "To organize or present something in a formal or impressive way, such as an exhibition or attack.",
      "explanation_cn": "以正式或令人印象深刻的方式组织或展示某事物，如展览或进攻。",
      "example_en": "The museum mounted a major exhibition of Renaissance art.",
      "example_cn": "博物馆举办了一场盛大的文艺复兴艺术展览。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "installed",
      "analysis": "“Installed”（安装）更强调将设备、系统或软件设置好以供使用，常用于技术或机械语境，如安装软件或暖气系统。而 “mounted” 更侧重于物理上的固定或悬挂，常用于视觉或结构上的安置，如挂画、装摄像头。"
    },
    {
      "word_to_compare": "horsed",
      "analysis": "“Horsed” 并非标准英语动词，虽然在口语中偶见用于表示“骑马”，但正式语境中应使用 “mounted”。“Mounted” 是唯一被广泛接受且具有多种语义层次的正确表达，涵盖骑乘、安装、组织等多重含义。"
    },
    {
      "word_to_compare": "affixed",
      "analysis": "“Affixed”（附着）指将某物粘贴、钉住或系在另一物体上，通常用于较小、较轻的物品，如贴标签、钉徽章。而 “mounted” 暗示更稳固、结构性的固定，常涉及支撑框架或承重结构，如挂画框、装武器架。"
    }
  ]
}