{
  "word": "mounts",
  "pronunciation": "mownts",
  "concise_definition": "n. 山脉, 山丘; 安装, 固定; 骑乘; v. 安装, 攀登, 骑上",
  "forms": {
    "singular": "mount",
    "third_person_singular": "mounts",
    "past_tense": "mounted",
    "past_participle": "mounted",
    "present_participle": "mounting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A large natural elevation of land, especially a mountain or a range of mountains; often used in plural to refer to a chain or group of such elevations.",
      "explanation_cn": "指陆地上较大的自然隆起，尤指山脉或山丘；常以复数形式出现，指一系列相连的山体。",
      "example_en": "The hikers crossed the snow-capped mounts before reaching the valley.",
      "example_cn": "徒步者在抵达山谷前穿越了白雪覆盖的群山。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device or structure used to hold, support, or fix an object in place, such as a camera mount, telescope mount, or bicycle mount.",
      "explanation_cn": "指用于固定或支撑某物的装置或结构，如相机支架、望远镜底座或自行车架。",
      "example_en": "The photographer adjusted the camera mounts to get the perfect angle.",
      "example_cn": "摄影师调整了相机支架以获得最佳角度。"
    },
    {
      "pos": "noun",
      "explanation_en": "A horse or other animal ridden by a person, especially in a formal or literary context.",
      "explanation_cn": "指供人骑乘的马或其他动物，多用于正式或文学语境。",
      "example_en": "The knight climbed onto his mount and rode toward the castle.",
      "example_cn": "骑士跨上他的坐骑，向城堡驰去。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fix, attach, or install something securely onto a surface or structure.",
      "explanation_cn": "指将某物牢固地安装或固定在表面或结构上。",
      "example_en": "They mounted the new television on the wall above the fireplace.",
      "example_cn": "他们将新电视安装在壁炉上方的墙上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To climb onto or get on top of something, especially an animal or a raised platform.",
      "explanation_cn": "指爬上或登上某物，尤指动物或高台。",
      "example_en": "She mounted the horse with ease and urged it forward.",
      "example_cn": "她轻松地跨上马背，催马前行。"
    },
    {
      "pos": "verb",
      "explanation_en": "To organize or initiate a large-scale effort, campaign, or attack, often with intensity or determination.",
      "explanation_cn": "指有组织地发起一场大规模的行动、运动或攻击，通常带有强烈决心。",
      "example_en": "The government mounted a massive campaign to reduce plastic waste.",
      "example_cn": "政府发起了大规模运动以减少塑料垃圾。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mountain",
      "analysis": "“Mountain” (山) 是一个具体的地理名词，指单座高耸的山体，而 “mounts” 作为名词复数时，常用于文学或正式语境中泛指山脉或群山，语气更庄重，有时作为专有名词的一部分（如 Mount Everest）。"
    },
    {
      "word_to_compare": "install",
      "analysis": "“Install” (安装) 更侧重于技术性或功能性设备的设置，如安装软件、电器，强调过程和功能实现；而 “mount” 在表示安装时，常隐含物理固定、承重或支撑的含义，如相机支架、显示器底座，更强调结构上的安置。"
    },
    {
      "word_to_compare": "ride",
      "analysis": "“Ride” (骑乘) 是一个更通用、日常的动词，泛指任何骑在动物或交通工具上的行为；而 “mount” 在表示骑乘时，更强调‘跨上’的动作本身，常用于描述正式、戏剧性或文学性的场景，如骑士上马，语气更庄重。"
    },
    {
      "word_to_compare": "raise",
      "analysis": "“Raise” (举起/提高) 指将某物从低处移至高处，强调垂直方向的位移；而 “mount” 在表示‘安装’或‘登上’时，不一定涉及高度变化，而是强调‘固定’或‘置于支撑物上’，如将画作装在墙上，不一定是抬高，而是固定。"
    }
  ]
}