{
  "word": "mount",
  "pronunciation": "mownt",
  "concise_definition": "v. 安装, 登上, 组织; n. 山, 山脉, 底座, 支架",
  "forms": {
    "third_person_singular": "mounts",
    "past_tense": "mounted",
    "past_participle": "mounted",
    "present_participle": "mounting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To fix or attach something firmly in place, especially a device, instrument, or piece of equipment onto a surface or structure.",
      "explanation_cn": "指将某物（如设备、仪器）牢固地安装或固定在表面或结构上。",
      "example_en": "They mounted the camera on a tripod to capture the sunset.",
      "example_cn": "他们将相机安装在三脚架上以拍摄日落。"
    },
    {
      "pos": "verb",
      "explanation_en": "To get on top of something, especially a horse, bicycle, or other vehicle, often with effort or formality.",
      "explanation_cn": "指骑上或登上某物（如马、自行车等），常带有用力或正式的意味。",
      "example_en": "The knight mounted his horse and rode toward the castle.",
      "example_cn": "骑士跨上马背，向城堡驰去。"
    },
    {
      "pos": "verb",
      "explanation_en": "To organize or initiate a large-scale effort, campaign, or event, especially one that requires planning and resources.",
      "explanation_cn": "指组织或发起一项大规模的行动、运动或活动，通常需要周密的计划和资源。",
      "example_en": "The government mounted a massive campaign to combat the epidemic.",
      "example_cn": "政府发起了大规模的运动以抗击疫情。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large natural elevation of the earth's surface, typically higher and steeper than a hill.",
      "explanation_cn": "指地球表面自然形成的高大隆起，通常比丘陵更高更陡峭。",
      "example_en": "They hiked to the summit of Mount Everest, the highest mountain in the world.",
      "example_cn": "他们徒步登上了世界最高峰——珠穆朗玛峰。"
    },
    {
      "pos": "noun",
      "explanation_en": "A support or frame used to hold or display an object, such as a picture, mirror, or telescope.",
      "explanation_cn": "指用于支撑或展示物体（如画作、镜子、望远镜）的支架或底座。",
      "example_en": "The antique mirror was displayed in an ornate wooden mount.",
      "example_cn": "这面古董镜子被安置在一个精美的木制底座上展示。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ascend",
      "analysis": "“Ascend” (攀登/上升) 强调从低处向高处移动的动作，通常用于描述人或物体在垂直方向上的移动，如登山、爬楼梯。它侧重于运动过程，而 “mount” 作为动词时，更强调‘登上’的动作本身，常用于骑马或安装设备的语境，不强调持续上升。"
    },
    {
      "word_to_compare": "install",
      "analysis": "“Install” (安装) 专指将设备、软件或系统设置好以便使用，强调技术性、功能性安装，如安装软件或水管。而 “mount” 在安装语境中更常用于物理固定，尤其指将物体置于支架或表面上，如挂画、装镜头，语义范围更广，也更形象。"
    },
    {
      "word_to_compare": "hill",
      "analysis": "“Hill” (小山) 指相对低矮、坡度平缓的自然地形，而 “mount” 作为名词时，通常指更高、更陡峭、更具规模的山体，常用于专有名词（如 Mount Fuji）。在地理描述中，mount 更具庄严感和高度感，常用于正式或文学语境。"
    }
  ]
}