{
  "word": "moves",
  "pronunciation": "muvz",
  "concise_definition": "n. 动作, 行动, 步骤, 搬家; v. 移动, 搬迁, 行动",
  "forms": {
    "singular": "move",
    "third_person_singular": "moves",
    "past_tense": "moved",
    "past_participle": "moved",
    "present_participle": "moving"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A physical action or gesture, especially one that is deliberate and purposeful, often used to describe body movement or strategic actions in games or competitions.",
      "explanation_cn": "指有意识、有目的的身体动作或姿态，常用于描述在游戏或竞赛中的策略性举动。",
      "example_en": "Her final move in the chess match was brilliant and won her the game.",
      "example_cn": "她在国际象棋比赛中的最后一步棋非常精彩，赢得了比赛。"
    },
    {
      "pos": "noun",
      "explanation_en": "A planned step or action taken to achieve a goal, especially in politics, business, or social situations.",
      "explanation_cn": "指为实现某一目标而采取的有计划的步骤或行动，尤其用于政治、商业或社交场合。",
      "example_en": "The company's latest move to expand into Asia has attracted widespread attention.",
      "example_cn": "该公司最近进军亚洲的举措引起了广泛关注。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of changing one's place of residence; relocation.",
      "explanation_cn": "指更换居住地的行为；搬迁。",
      "example_en": "We're planning our moves for next month and need to pack all the furniture.",
      "example_cn": "我们计划下个月搬家，需要把所有家具打包。"
    },
    {
      "pos": "verb",
      "explanation_en": "To change position or location, either physically or metaphorically, often implying motion from one place to another.",
      "explanation_cn": "指改变位置或地点，可以是物理上的，也可以是比喻性的，通常暗示从一处移动到另一处。",
      "example_en": "The cat moved silently across the room and curled up on the windowsill.",
      "example_cn": "猫悄无声息地穿过房间，蜷缩在窗台上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to change position or to initiate action, especially in a strategic or organized way.",
      "explanation_cn": "指使某物改变位置，或以有策略或有组织的方式启动行动。",
      "example_en": "The general moved his troops to the northern border overnight.",
      "example_cn": "将军连夜将部队调往北部边境。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "action",
      "analysis": "“Action” (行动) 是一个更广泛的术语，泛指任何有目的的行为或事件，可以是抽象的（如采取行动应对危机），也可以是具体的。而 “move” 更强调一个具体的、可观察的步骤或动作，尤其在策略性语境中，如棋局或政治博弈，常带有计划性和目的性。"
    },
    {
      "word_to_compare": "step",
      "analysis": "“Step” (步骤) 通常指实现目标过程中的一个阶段或环节，更侧重于程序性和顺序性，如‘第一步’、‘下一步’。而 ‘move’ 更强调动作本身，常用于竞争或对抗性情境，带有主动性甚至对抗意味，如‘出招’、‘应对’。"
    },
    {
      "word_to_compare": "shift",
      "analysis": "“Shift” (转移/转变) 强调位置、方向或状态的轻微或突然变化，常用于抽象概念（如态度转变、重心转移），语气较中性。而 ‘move’ 更具主动性，常暗示有意识的决策和意图，且可用于物理移动和抽象策略，适用范围更广。"
    }
  ]
}