{
  "word": "moved",
  "pronunciation": "muhvd",
  "concise_definition": "v. 移动, 搬家, 感动, 动摇",
  "forms": {
    "base_form": "move",
    "third_person_singular": "moves",
    "present_participle": "moving",
    "past_tense": "moved",
    "past_participle": "moved"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To change the position or location of something or someone from one place to another, either physically or metaphorically.",
      "explanation_cn": "指将某物或某人从一个地方移动到另一个地方，可以是物理上的位移，也可以是比喻性的转移。",
      "example_en": "She moved the chair closer to the window to get more sunlight.",
      "example_cn": "她把椅子移到窗边，以便获得更多的阳光。"
    },
    {
      "pos": "verb",
      "explanation_en": "To change one's place of residence; to relocate from one home or city to another.",
      "explanation_cn": "指更换居住地，从一个家或城市搬到另一个地方。",
      "example_en": "They moved to Vancouver last year and love the coastal lifestyle.",
      "example_cn": "他们去年搬到了温哥华，很喜欢这种沿海生活方式。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause someone to feel emotion, especially sympathy, pity, or admiration; to touch deeply.",
      "explanation_cn": "指引发某人的情感，尤其是同情、怜悯或钦佩；深深打动。",
      "example_en": "The soldier's letter moved everyone in the room to tears.",
      "example_cn": "那封士兵的信让在场的每个人都感动得落泪。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause someone to take action or change their opinion or decision, often through persuasion or influence.",
      "explanation_cn": "指通过劝说或影响，使某人采取行动或改变观点或决定。",
      "example_en": "His passionate speech moved the committee to approve the funding.",
      "example_cn": "他充满激情的演讲促使委员会批准了资金。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "shift",
      "analysis": "“Shift” (转移/转变) 通常指轻微、短暂或方向性的位置或状态变化，常用于抽象概念（如注意力、重心）或机械性移动。它比 “move” 更强调变化的非彻底性。例如：shift focus（转移注意力）。而 “move” 更通用，可指任何程度的位移，包括彻底搬迁。"
    },
    {
      "word_to_compare": "relocate",
      "analysis": "“Relocate” (重新安置) 是 “move” 在搬家语境下的正式同义词，但更强调系统性、长期性的迁移，常用于公司、机构或大规模人口迁移。它不用于情感或抽象意义，而 “move” 可用于多种语境，包括情感上的触动。"
    },
    {
      "word_to_compare": "stir",
      "analysis": "“Stir” (激起/煽动) 常用于情感或情绪上的激发，如 stir emotions（激起情感），但通常暗示一种更轻微、更间接的触动，有时带有负面或煽动性含义。而 “move” 在情感语境中更中性、更深刻，常用于表达真诚的感动。"
    }
  ]
}