{
  "word": "movements",
  "pronunciation": "moo·vuh·muhnts",
  "concise_definition": "n. 运动, 动作, 移动, 潮流",
  "forms": {
    "singular": "movement"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A physical action or change in position of a body or part of a body, often deliberate and controlled.",
      "explanation_cn": "指身体或身体某部分有意识、有控制的物理动作或位置变化。",
      "example_en": "The dancer's movements were graceful and precise.",
      "example_cn": "舞者的动作优雅而精准。"
    },
    {
      "pos": "noun",
      "explanation_en": "A coordinated effort by a group of people to achieve a social, political, or cultural goal, often involving widespread participation and advocacy.",
      "explanation_cn": "指一群人为了实现社会、政治或文化目标而进行的有组织的集体行动，通常涉及广泛参与和倡导。",
      "example_en": "The civil rights movement of the 1960s transformed American society.",
      "example_cn": "20世纪60年代的民权运动改变了美国社会。"
    },
    {
      "pos": "noun",
      "explanation_en": "A trend or tendency in art, music, literature, or thought that reflects a shared style, philosophy, or direction over a period of time.",
      "explanation_cn": "指在艺术、音乐、文学或思想领域中，一段时间内反映共同风格、哲学或方向的潮流或流派。",
      "example_en": "Impressionism was a revolutionary movement in 19th-century painting.",
      "example_cn": "印象派是19世纪绘画中一场革命性的艺术运动。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of moving or the capacity to move, especially in the context of machinery, music, or abstract systems.",
      "explanation_cn": "指移动的行为或能力，尤其用于机械、音乐或抽象系统中，如乐章、机械部件的运转。",
      "example_en": "The symphony has four distinct movements, each with its own tempo and mood.",
      "example_cn": "这首交响曲有四个不同的乐章，每个乐章都有其独特的节奏和情绪。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "action",
      "analysis": "“Action” (行动) 更广泛，泛指任何有目的的行为或事件，可以是单次的、短暂的，不一定是系统性的。而 “movement” 强调持续性、集体性或结构性，尤其在社会或艺术语境中具有组织性和方向性。"
    },
    {
      "word_to_compare": "gesture",
      "analysis": "“Gesture” (手势) 通常指身体的某个局部动作，尤其是手部或面部的，常用于表达情感或意图，规模小且具象征性。而 “movement” 可以是全身性的、更复杂或更持久的，且不一定具有象征意义。"
    },
    {
      "word_to_compare": "trend",
      "analysis": "“Trend” (趋势) 指某种流行或发展方向，通常是统计性或观察性的，不一定涉及有组织的行动。而 “movement” 不仅描述方向，还包含积极参与、动员和推动变革的主体，具有更强的能动性和意识形态色彩。"
    }
  ]
}