{
  "word": "mu",
  "pronunciation": "moo",
  "concise_definition": "n. 希腊字母μ, 无, 未定, 微（微小）",
  "forms": {
    "plural": "mus"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The fourteenth letter of the Greek alphabet, commonly used in mathematics, physics, and engineering to represent various quantities such as the coefficient of friction, magnetic permeability, or micro- (one millionth).",
      "explanation_cn": "希腊字母表中的第14个字母，常用于数学、物理和工程领域，表示各种量，如摩擦系数、磁导率，或作为词缀表示‘微’（百万分之一）。",
      "example_en": "The coefficient of friction is often denoted by the Greek letter mu (μ).",
      "example_cn": "摩擦系数通常用希腊字母μ表示。"
    },
    {
      "pos": "noun",
      "explanation_en": "In philosophy and logic, a term used to indicate that a statement is neither true nor false, or that the question is meaningless or undefined — often used to reject a binary assumption.",
      "explanation_cn": "在哲学和逻辑中，用于表示一个陈述既非真也非假，或该问题本身无意义、未定义，常用于否定二元对立的预设。",
      "example_en": "When asked if he had stopped beating his wife, he replied, 'Mu' — rejecting the false premise of the question.",
      "example_cn": "当被问及是否已停止殴打妻子时，他回答：‘Mu’——否定了问题中隐含的错误前提。"
    },
    {
      "pos": "noun",
      "explanation_en": "A prefix in the metric system meaning one millionth (10⁻⁶), derived from the Greek letter mu; used in units such as micrometer (μm) or microgram (μg).",
      "explanation_cn": "国际单位制中的前缀，表示百万分之一（10⁻⁶），源自希腊字母μ，用于如微米（μm）、微克（μg）等单位。",
      "example_en": "The thickness of a human hair is about 70 micrometers, or 70 μm.",
      "example_cn": "人类头发的厚度约为70微米，即70 μm。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "micro-",
      "analysis": "“Micro-” 是一个表示‘微小’的前缀，用于构成单位（如micrometer），其含义与希腊字母μ作为前缀时完全一致。但“micro-”是英语词缀，而“mu”是希腊字母本身，常用于符号表示而非词形构造。"
    },
    {
      "word_to_compare": "null",
      "analysis": "“Null”（空/无效）表示‘无值’或‘无效’，常用于编程或法律语境，强调缺失或无效性。而“mu”在哲学语境中更强调‘超越二元判断’，不是简单的‘无’，而是拒绝问题的前提本身。"
    },
    {
      "word_to_compare": "undefined",
      "analysis": "“Undefined”（未定义）是一个数学或逻辑术语，表示某个表达式没有意义或无法计算。它与“mu”在哲学中的用法相似，但“undefined”是描述状态，而“mu”是作为一种回应或符号，带有文化与语用色彩，尤其源自东方禅宗传统。"
    }
  ]
}