{
  "word": "muck",
  "pronunciation": "muhk",
  "concise_definition": "n. 粪肥, 污垢, 垃圾; v. 搞脏, 搅动粪肥",
  "forms": {
    "plural": "mucks",
    "third_person_singular": "mucks",
    "past_tense": "mucked",
    "past_participle": "mucked",
    "present_participle": "mucking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Dung or decaying organic matter used as fertilizer, especially in agricultural contexts; also refers to dirty, messy, or filthy material.",
      "explanation_cn": "指用作肥料的动物粪便或腐烂的有机物质，尤用于农业语境；也可泛指肮脏、杂乱或污秽的物质。",
      "example_en": "The farmer spread muck over the fields to enrich the soil.",
      "example_cn": "农夫把粪肥撒在田里以肥沃土壤。"
    },
    {
      "pos": "noun",
      "explanation_en": "A general term for dirt, grime, or rubbish, often implying something unpleasant or messy.",
      "explanation_cn": "泛指污垢、污渍或垃圾，常带有令人不快或杂乱的含义。",
      "example_en": "After the storm, the streets were covered in muck and debris.",
      "example_cn": "风暴过后，街道上覆盖着污垢和瓦砾。"
    },
    {
      "pos": "verb",
      "explanation_en": "To work with or spread muck, especially manure, typically in farming or gardening.",
      "explanation_cn": "指从事与粪肥相关的工作，如翻动或施撒粪肥，多用于农业或园艺场景。",
      "example_en": "He spent the morning mucking out the stables.",
      "example_cn": "他一上午都在清理马厩。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make something dirty or messy, often by handling or coming into contact with filth.",
      "explanation_cn": "指通过接触污物使某物变脏或凌乱。",
      "example_en": "The kids mucked up their clothes playing in the mud.",
      "example_cn": "孩子们在泥地里玩耍，把衣服弄脏了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "dirt",
      "analysis": "“Dirt” (污垢) 是更通用的词，泛指任何不干净的物质，如灰尘、泥土，通常不带有肥料或有机腐烂的含义。而 “muck” 更具体，常指潮湿、有臭味的有机污物，如粪肥或烂泥，语义更重、更粗俗。"
    },
    {
      "word_to_compare": "garbage",
      "analysis": "“Garbage” (垃圾) 指人类丢弃的废弃物，如食物残渣、包装等，通常是无机或非生物降解的。而 “muck” 更偏向自然产生的有机污物，如动物粪便或腐烂植物，语义更偏向农业或自然环境。"
    },
    {
      "word_to_compare": "sludge",
      "analysis": "“Sludge” (污泥) 指工业或污水处理中产生的粘稠、半固体废物，常含化学成分，语义更技术化、更现代。而 “muck” 是口语化、更原始的词，多用于农场或户外脏乱场景，不具专业性。"
    }
  ]
}