{
  "word": "mud",
  "pronunciation": "muhd",
  "concise_definition": "n. 泥土, 泥浆; v. 弄脏, 沾上泥",
  "forms": {
    "plural": "muds"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Wet, soft earth or soil that becomes sticky and slippery when mixed with water, often found on the ground after rain or in swampy areas.",
      "explanation_cn": "指与水混合后变得黏稠、滑腻的湿软泥土，常见于雨后或沼泽地带的地表。",
      "example_en": "The children played in the mud, laughing as their clothes became covered in dirt.",
      "example_cn": "孩子们在泥浆里玩耍，衣服沾满泥土，却笑个不停。"
    },
    {
      "pos": "noun",
      "explanation_en": "A metaphorical term for something dirty, vulgar, or morally corrupt, often used to describe offensive language or content.",
      "explanation_cn": "比喻用语，指肮脏、粗俗或道德败坏的事物，常用于形容粗鄙的语言或内容。",
      "example_en": "The politician dismissed the accusations as pure mud and refused to respond.",
      "example_cn": "这位政客将这些指控斥为无稽之谈，拒绝回应。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover or soil something with mud, especially unintentionally or through physical contact.",
      "explanation_cn": "指无意中或通过接触使某物沾上泥浆。",
      "example_en": "The dog mudded up the entire living room after running through the puddle.",
      "example_cn": "狗从水坑里跑过，把整个客厅都弄脏了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hinder or impede progress by making something messy, complicated, or emotionally draining, often used figuratively.",
      "explanation_cn": "比喻性地指使某事变得混乱、复杂或令人情绪疲惫，从而阻碍进展。",
      "example_en": "The investigation was muddied by conflicting testimonies and hidden agendas.",
      "example_cn": "调查因相互矛盾的证词和隐藏的动机而变得混乱不清。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "slime",
      "analysis": "“Slime”（黏液）指一种更黏稠、更液态、常具生物来源的胶状物（如蜗牛分泌物或腐烂有机物产生的黏液），通常带有负面或恶心的联想。而 “mud” 是泥土与水的混合物，更常见于自然环境，不必然带有生物性或病态感。"
    },
    {
      "word_to_compare": "dirt",
      "analysis": "“Dirt”（污垢）是更广义的术语，泛指任何不洁物质，包括灰尘、沙土、污渍等，不一定含水或呈糊状。而 “mud” 特指湿润、可塑、具黏性的泥土，强调其物理状态和流动性。"
    },
    {
      "word_to_compare": "filth",
      "analysis": "“Filth”（污秽）是道德或卫生层面的极端污垢，常用于形容极度肮脏或道德堕落的状态，具有强烈的贬义。而 “mud” 作为名词时多为中性物理描述，仅在比喻用法中才接近 “filth” 的道德含义，但语义强度较弱。"
    }
  ]
}