{
  "word": "muddy",
  "pronunciation": "muh·di",
  "concise_definition": "adj. 泥泞的, 混浊的; v. 使变泥泞, 使模糊",
  "forms": {
    "comparative": "muddier",
    "superlative": "muddiest",
    "third_person_singular": "muddies",
    "past_tense": "muddied",
    "past_participle": "muddied",
    "present_participle": "muddying"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Covered with or full of mud; describing ground, water, or surfaces that are wet, soft, and dirty from soil.",
      "explanation_cn": "被泥浆覆盖或充满泥浆的；形容地面、水体或表面因土壤湿润而变得松软肮脏。",
      "example_en": "The children came home with muddy boots after playing in the rain.",
      "example_cn": "孩子们在雨中玩耍后，穿着满是泥巴的靴子回家了。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Not clear or distinct; describing ideas, explanations, or situations that are confused, obscure, or unclear.",
      "explanation_cn": "不清晰、不明确的；形容思想、解释或情况模糊、混乱、难以理解。",
      "example_en": "His reasoning was muddy and failed to convince the jury.",
      "example_cn": "他的推理含糊不清，未能说服陪审团。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make something dirty with mud, especially by stepping in or coming into contact with wet soil.",
      "explanation_cn": "使某物沾上泥巴，通常指踩入或接触湿土而弄脏。",
      "example_en": "The dogs muddied the kitchen floor after running through the backyard.",
      "example_cn": "狗从后院跑进来，把厨房地板弄脏了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make something less clear or more confusing, especially an argument, explanation, or situation.",
      "explanation_cn": "使某事物（如论点、解释或情况）变得更模糊或更混乱。",
      "example_en": "The politician muddied the issue by introducing irrelevant facts.",
      "example_cn": "这位政客引入了无关的事实，使问题变得更加混乱。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "dirty",
      "analysis": "“Dirty”（脏的）是一个更广泛的词，泛指任何不洁净的状态，可能由灰尘、污垢、油渍等造成，不特指泥浆。“Muddy”则特指由湿土或泥浆造成的脏污，具有更具体的物质来源和视觉特征。"
    },
    {
      "word_to_compare": "cloudy",
      "analysis": "“Cloudy”（浑浊的）常用于描述液体（如水）或天空的视觉状态，强调光线被遮挡或透明度降低，但不一定涉及泥土。而 “muddy” 在描述水时，暗示含有悬浮的泥沙颗粒，具有物理沉淀和浑浊的双重含义，语义更具体、更物质化。"
    },
    {
      "word_to_compare": "confusing",
      "analysis": "“Confusing”（令人困惑的）是抽象概念中描述思维混乱的常用词，语气中性或偏负面。“Muddy” 作为动词或形容词用于抽象语境时，带有更强的贬义色彩，暗示人为或无意的故意模糊，常用于批评逻辑不清或故意误导的表达。"
    }
  ]
}