{
  "word": "mules",
  "pronunciation": "moo·lz",
  "concise_definition": "n. 骡子, 拐杖, 拖鞋, 走私者",
  "forms": {
    "singular": "mule"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A hybrid animal, typically the offspring of a male donkey and a female horse, known for its strength, endurance, and sure-footedness.",
      "explanation_cn": "一种杂交动物，通常是公驴和母马的后代，以力量大、耐力强和步履稳健著称。",
      "example_en": "The farmers relied on mules to carry heavy loads across the mountain trails.",
      "example_cn": "农民们依靠骡子在山间小道上运送重物。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of shoe or slipper that has no back or strap around the heel, designed to be easily slipped on and off.",
      "explanation_cn": "一种后跟无带、无后帮的鞋子或拖鞋，便于穿脱。",
      "example_en": "She wore elegant black mules to the cocktail party.",
      "example_cn": "她穿着一双优雅的黑色拖鞋参加鸡尾酒会。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who smuggles illegal goods, especially across borders, often using concealment or deception.",
      "explanation_cn": "指从事走私非法物品的人，尤其是跨越边境时，常使用隐蔽或欺骗手段。",
      "example_en": "Authorities arrested several mules transporting drugs across the border.",
      "example_cn": "当局逮捕了数名在边境走私毒品的走私者。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who stubbornly refuses to change their opinion or behavior, often despite evidence or persuasion.",
      "explanation_cn": "指固执己见、拒绝改变观点或行为的人，即使面对证据或劝说也毫不动摇。",
      "example_en": "He's such a mule—he won't listen to anyone, even when he's clearly wrong.",
      "example_cn": "他真是个倔驴——谁的话都听不进去，即使他明显错了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "donkey",
      "analysis": "“Donkey”（驴）是纯种动物，而 “mule” 是驴与马的杂交后代。骡子通常比驴更强壮、更耐劳，但不具备繁殖能力。两者外形相似，但骡子体型更大、耳朵更长、叫声更像马。"
    },
    {
      "word_to_compare": "slipper",
      "analysis": "“Slipper”（拖鞋）泛指任何便于穿脱的室内鞋，而 “mule” 是拖鞋的一种特定类型，特指后跟完全敞开、无后帮的设计。所有 mules 都是 slippers，但并非所有 slippers 都是 mules。"
    },
    {
      "word_to_compare": "smuggler",
      "analysis": "“Smuggler”（走私者）是泛指所有从事走私活动的人，而 “mule” 是其口语化、非正式的同义词，常用于强调走私者作为‘运输工具’的角色，暗示其被动性或被利用性，有时带有贬义。"
    }
  ]
}