{
  "word": "murder",
  "pronunciation": "murr·duhr",
  "concise_definition": "n. 谋杀, 故意杀人; v. 谋杀, 残忍地杀害",
  "forms": {
    "third_person_singular": "murders",
    "past_tense": "murdered",
    "past_participle": "murdered",
    "present_participle": "murdering"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The unlawful premeditated killing of one human being by another, typically with malice aforethought and often involving violence or cruelty.",
      "explanation_cn": "指有预谋地非法剥夺他人生命的行为，通常带有恶意，常伴随暴力或残忍手段。",
      "example_en": "The police are investigating the murder of a local businessman.",
      "example_cn": "警方正在调查一名本地商人被谋杀的案件。"
    },
    {
      "pos": "noun",
      "explanation_en": "A crime or act that is considered extremely cruel, senseless, or unjust, often used metaphorically to express outrage.",
      "explanation_cn": "指被认为极其残忍、无意义或不公的行为，常用于比喻性表达愤怒或惋惜。",
      "example_en": "It's a murder of justice that the real culprit went free.",
      "example_cn": "真正的罪犯逍遥法外，这简直是正义的毁灭。"
    },
    {
      "pos": "verb",
      "explanation_en": "To intentionally and unlawfully kill someone, especially with malice or premeditation.",
      "explanation_cn": "指故意且非法地杀害他人，通常带有恶意或预谋。",
      "example_en": "He was convicted of murdering his wife in their home.",
      "example_cn": "他因在家中谋杀妻子而被定罪。"
    },
    {
      "pos": "verb",
      "explanation_en": "To destroy or ruin something in a brutal or wasteful way, often used figuratively.",
      "explanation_cn": "指以残酷或浪费的方式摧毁或毁坏某物，常用于比喻意义。",
      "example_en": "The team murdered their chances of winning by making so many careless mistakes.",
      "example_cn": "球队因犯下太多粗心错误而葬送了获胜的机会。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "kill",
      "analysis": "“Kill” (杀死) 是一个中性、广泛的动词，泛指导致死亡的行为，无论是否故意、合法或有预谋。而 “murder” 特指非法且有恶意的故意杀人，具有明确的法律和道德谴责含义。"
    },
    {
      "word_to_compare": "assassinate",
      "analysis": "“Assassinate” (暗杀) 指针对政治人物、公众人物或有影响力者进行的有政治或意识形态动机的谋杀，通常具有隐蔽性和计划性。而 “murder” 是更通用的术语，不特指受害者身份或动机。"
    },
    {
      "word_to_compare": "manslaughter",
      "analysis": "“Manslaughter” (过失杀人) 指非预谋的、因疏忽、鲁莽或情绪冲动导致的杀人行为，缺乏“恶意预谋”这一关键要素。而 “murder” 必须证明行为人具有主观恶意或预谋，因此刑责更重。"
    }
  ]
}