{
  "word": "mystic",
  "pronunciation": "mis·tik",
  "concise_definition": "adj. 神秘的, 神秘主义的; n. 神秘主义者",
  "forms": {
    "comparative": "mystic",
    "superlative": "mystic",
    "plural": "mystics"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characterized by mysticism; involving spiritual or religious experiences that transcend ordinary understanding and are often considered ineffable or beyond rational explanation.",
      "explanation_cn": "与神秘主义相关或具有神秘主义特征的；指涉及超越普通理解的灵性或宗教体验，通常被认为是难以言喻、无法用理性解释的。",
      "example_en": "The mystic traditions of Sufism emphasize direct communion with the divine.",
      "example_cn": "苏菲派的神秘主义传统强调与神圣的直接沟通。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Having an air of mystery or obscurity; seemingly arcane or inaccessible to ordinary perception or logic.",
      "explanation_cn": "带有神秘或晦涩氛围的；看似深奥难解，超出了普通感知或逻辑的范畴。",
      "example_en": "The mystic symbols carved into the ancient stone puzzled archaeologists for decades.",
      "example_cn": "刻在古老石碑上的神秘符号让考古学家困惑了数十年。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who seeks direct, personal experience of the divine or ultimate reality through contemplation, meditation, or spiritual practices, often outside organized religion.",
      "explanation_cn": "指通过沉思、冥想或灵性实践寻求直接体验神圣或终极实在的人，通常超越有组织的宗教体系。",
      "example_en": "Rumi, the 13th-century Persian poet, is considered one of the greatest mystics in Islamic history.",
      "example_cn": "13世纪的波斯诗人鲁米被认为是伊斯兰历史上最伟大的神秘主义者之一。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mysterious",
      "analysis": "“Mysterious” (神秘的) 强调事物本身难以理解或解释，侧重于外在的未知性或谜团感，常用于描述事件、现象或行为。而 “mystic” 更强调内在的灵性维度，与宗教体验、超验认知直接相关，具有哲学和神学深度。"
    },
    {
      "word_to_compare": "esoteric",
      "analysis": "“Esoteric” (深奥的/秘传的) 指仅限于少数有特殊知识或训练的人理解的内容，强调知识的排他性和门槛性。而 “mystic” 不仅指知识的隐秘性，更强调通过内在体验获得的超越性真理，具有情感与灵性维度。"
    },
    {
      "word_to_compare": "magical",
      "analysis": "“Magical” (魔法的) 通常指超自然力量或奇迹般的效果，常与巫术、咒语或幻想相关，偏向于外在的、可操作的“奇迹”。而 “mystic” 关注的是内在的、不可言传的灵性觉醒，不依赖仪式或外力，更重于觉悟与合一。"
    }
  ]
}