{
  "word": "nail",
  "pronunciation": "nayl",
  "concise_definition": "n. 指甲, 钉子; v. 钉住, 准确做到, 成功完成",
  "forms": {
    "plural": "nails",
    "third_person_singular": "nails",
    "past_tense": "nailed",
    "past_participle": "nailed",
    "present_participle": "nailing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The hard, protective plate of keratin at the tip of fingers and toes in humans and other mammals, serving to protect the sensitive tips and aid in fine motor tasks.",
      "explanation_cn": "人类和其他哺乳动物手指和脚趾末端由角蛋白构成的坚硬保护板，用于保护敏感的指尖并辅助精细动作。",
      "example_en": "She painted her nails a bright red for the party.",
      "example_cn": "她为参加派对把指甲涂成了鲜红色。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, slender piece of metal with a flat head and a sharp point, used to fasten materials together, typically by being driven into wood or other substances.",
      "explanation_cn": "一种细长的金属制品，一端有扁平头部，另一端尖锐，用于通过钉入木材或其他材料来固定物体。",
      "example_en": "He hammered a nail into the wall to hang the picture.",
      "example_cn": "他把一颗钉子钉进墙里，好挂画。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fasten or attach something using nails, typically by driving them into a surface with a hammer.",
      "explanation_cn": "使用钉子将某物固定或连接到表面上，通常用锤子将其钉入。",
      "example_en": "They nailed the wooden planks together to build the shed.",
      "example_cn": "他们把木板钉在一起搭起了小棚子。"
    },
    {
      "pos": "verb",
      "explanation_en": "To achieve or accomplish something precisely or successfully, often used in the phrase 'to nail it' to mean performing flawlessly.",
      "explanation_cn": "指精确地完成或成功实现某事，常用于短语 'to nail it'，意为表现得完美无缺。",
      "example_en": "The actor nailed his monologue — the audience was completely silent afterward.",
      "example_cn": "这位演员完美地演绎了独白——观众 afterward 完全沉默了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To identify or pinpoint something exactly, especially a problem, cause, or truth.",
      "explanation_cn": "指准确地识别或确定某事物，尤其是问题、原因或真相。",
      "example_en": "The detective finally nailed the suspect to the crime scene.",
      "example_cn": "侦探终于将嫌疑人与犯罪现场联系了起来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "finger",
      "analysis": "“Finger”（手指）是身体的一部分，包含骨骼、肌肉和神经，而 “nail” 是其末端的角质覆盖物。两者虽常同时出现，但功能不同：手指用于触觉和操作，指甲则起保护和辅助作用。"
    },
    {
      "word_to_compare": "screw",
      "analysis": "“Screw”（螺丝）与 “nail”（钉子）都是紧固件，但螺丝有螺纹，需旋转拧入，提供更强的抗拉力和可拆卸性；钉子靠摩擦力固定，通常一次性使用，安装更快但牢固性较弱。"
    },
    {
      "word_to_compare": "pin",
      "analysis": "“Pin”（别针/销钉）通常更细小，用于临时固定轻质物品（如布料或纸张），而 “nail” 更粗壮，用于永久性固定较重材料（如木材）。此外，‘pin’ 常可拔出重复使用，‘nail’ 一般不可。"
    },
    {
      "word_to_compare": "hit",
      "analysis": "“Hit”（击中）泛指物理接触或打击，而 “nail” 在动词用法中特指‘精准完成’或‘准确锁定’，带有成功、精确的语义色彩。例如：‘He nailed the answer’ ≠ ‘He hit the answer’。后者无此含义。"
    }
  ]
}