{
  "word": "narratives",
  "pronunciation": "nær·ə·tɪvz",
  "concise_definition": "n. 叙事, 故事, 讲述方式",
  "forms": {
    "singular": "narrative"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A structured account of events, real or imagined, told in a particular way to convey meaning, emotion, or a point of view; often used to shape understanding or influence perception.",
      "explanation_cn": "一种有结构地讲述真实或虚构事件的方式，通过特定的叙述角度传达意义、情感或立场，常用于塑造理解或影响他人认知。",
      "example_en": "The media's narrative about the election shaped public opinion for months.",
      "example_cn": "媒体对选举的叙事在数月内塑造了公众舆论。"
    },
    {
      "pos": "noun",
      "explanation_en": "A personal or cultural story that individuals or groups use to make sense of their experiences, identity, or history, often serving as a framework for values and beliefs.",
      "explanation_cn": "个人或群体用来理解自身经历、身份或历史的个人故事或文化叙事，常作为价值观和信仰的框架。",
      "example_en": "Her personal narrative of overcoming adversity inspired many in her community.",
      "example_cn": "她克服逆境的个人故事激励了社区中的许多人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A literary or cinematic technique that organizes plot, characters, and themes through a specific perspective or voice, such as first-person or unreliable narration.",
      "explanation_cn": "文学或电影中通过特定视角或声音（如第一人称或不可靠叙述者）组织情节、人物和主题的叙述手法。",
      "example_en": "The novel’s unreliable narrative keeps readers questioning what is truly happening.",
      "example_cn": "这部小说中不可靠的叙述让读者不断质疑事件的真相。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "story",
      "analysis": "“Story”（故事）是更通用、更口语化的词，泛指任何有开端、发展和结局的事件序列，强调情节和娱乐性。而 “narrative” 更强调叙述的结构、视角和意图，常用于分析性语境，如社会、政治或学术讨论中，具有更强的意识形态色彩。"
    },
    {
      "word_to_compare": "account",
      "analysis": "“Account”（叙述/说明）侧重于对事件的客观陈述或记录，通常用于报告、证词或历史记录，强调事实性和准确性。而 “narrative” 更注重主观建构，可能包含选择性呈现、情感渲染或立场引导，不一定追求完全客观。"
    },
    {
      "word_to_compare": "tale",
      "analysis": "“Tale”（传说/寓言）通常指虚构的、带有道德寓意或奇幻色彩的故事，常用于儿童文学或民间传说，语气较轻松或传统。而 “narrative” 是中性术语，可涵盖真实与虚构，广泛用于现代语境，如新闻、心理学或文化研究中，不带有传统或童话色彩。"
    }
  ]
}