{
  "word": "nasty",
  "pronunciation": "nas·tee",
  "concise_definition": "adj. 令人不快的, 粗俗的, 恶毒的, 严重的",
  "forms": {
    "comparative": "nastier",
    "superlative": "nastiest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Unpleasant, offensive, or disgusting in taste, smell, appearance, or behavior; often used to describe something physically repulsive or morally objectionable.",
      "explanation_cn": "在味道、气味、外观或行为上令人不快、冒犯或令人作呕；常用于描述身体上令人反感或道德上不可接受的事物。",
      "example_en": "The garbage bin had a nasty smell that made everyone cover their noses.",
      "example_cn": "垃圾桶散发出一股恶臭，让所有人都捂住了鼻子。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Vulgar, obscene, or indecent in language or content, especially when referring to jokes, remarks, or media.",
      "explanation_cn": "语言或内容粗俗、下流或淫秽，尤其用于形容笑话、言论或媒体内容。",
      "example_en": "He told a nasty joke that made the whole room uncomfortable.",
      "example_cn": "他说了一个粗俗的笑话，让整个房间的人都感到不适。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Malicious, spiteful, or cruel in intent or action; describing behavior meant to harm or upset others.",
      "explanation_cn": "意图或行为上充满恶意、怨恨或残忍，指有意伤害或惹恼他人的行为。",
      "example_en": "She made a nasty comment about his appearance just to hurt his feelings.",
      "example_cn": "她为了伤害他的感情，说了句关于他外貌的恶毒话。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Severe, difficult, or unpleasant in degree, often used to describe conditions, weather, or situations.",
      "explanation_cn": "程度上严重、困难或不愉快，常用于描述天气、条件或状况。",
      "example_en": "They braved a nasty storm to get home last night.",
      "example_cn": "他们昨晚冒着恶劣的风暴赶回家。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ugly",
      "analysis": "“Ugly” (丑陋的) 主要指视觉上的不美观或令人反感，侧重于外观。而 “nasty” 的适用范围更广，可涵盖气味、行为、语言甚至天气，且常带有道德或情感上的负面评价，比 “ugly” 更具情感冲击力。"
    },
    {
      "word_to_compare": "horrible",
      "analysis": "“Horrible” (可怕的) 强调令人恐惧或极度不适，常用于表达强烈的负面情绪反应，语气更夸张。而 “nasty” 更日常、口语化，语气相对轻一些，但更具体地指向令人厌恶的细节，如脏污、粗俗或恶意。"
    },
    {
      "word_to_compare": "mean",
      "analysis": "“Mean” (刻薄的) 通常指性格或言语上的小气、不友善，侧重于缺乏同情心。而 “nasty” 更强调行为或言语的攻击性、侮辱性或令人作呕的特质，程度更深，常包含恶意或粗俗成分。"
    }
  ]
}