{
  "word": "nationalist",
  "pronunciation": "nash·uh·nlist",
  "concise_definition": "n. 民族主义者, 爱国者; adj. 民族主义的, 爱国的",
  "forms": {
    "plural": "nationalists",
    "adjective_form": "nationalistic"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who strongly supports or advocates for the interests, culture, and sovereignty of their own nation, often prioritizing national identity over international cooperation or minority groups.",
      "explanation_cn": "指强烈支持并倡导本国利益、文化和主权的人，通常将国家认同置于国际合作或少数群体利益之上。",
      "example_en": "The nationalist leader called for stricter immigration controls to protect national identity.",
      "example_cn": "这位民族主义领袖呼吁实施更严格的移民控制，以保护国家认同。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who believes that their nation is superior to others and should dominate or be independent from external influence.",
      "explanation_cn": "指认为本国优于其他国家，并应摆脱外部影响、实现主导地位的人。",
      "example_en": "Historically, extreme nationalists fueled conflicts by promoting racial purity and territorial expansion.",
      "example_cn": "历史上，极端民族主义者通过鼓吹种族纯洁和领土扩张引发了诸多冲突。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or promoting nationalism; characterized by strong patriotic feelings and a belief in national superiority.",
      "explanation_cn": "与民族主义相关或促进民族主义的；以强烈的爱国情感和对国家优越性的信念为特征。",
      "example_en": "The government adopted a nationalist policy to boost domestic industries.",
      "example_cn": "政府采取了民族主义政策以振兴国内产业。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "patriot",
      "analysis": "“Patriot”（爱国者）通常指热爱祖国、愿意为其福祉做出贡献的人，情感上更中性或正面，强调忠诚与奉献，不一定包含对其他国家的敌意或优越感。而 “nationalist” 常带有政治色彩，可能隐含排外、优越或扩张倾向，语义更强烈甚至负面。"
    },
    {
      "word_to_compare": "xenophobe",
      "analysis": "“Xenophobe”（仇外者）指对外国人或外来文化有恐惧或憎恨的人，其核心是对外来者的排斥。而 “nationalist” 的核心是对本国的推崇，虽然民族主义者常表现出仇外倾向，但并非所有民族主义者都是仇外者，有些仅强调文化保护而非敌视他人。"
    },
    {
      "word_to_compare": "chauvinist",
      "analysis": "“Chauvinist”（沙文主义者）原指极端爱国者，现多用于指性别沙文主义（如男性沙文主义），泛指对某一群体（国家、性别、种族等）抱有盲目优越感的人。与 “nationalist” 相比，chauvinist 更强调非理性的偏见和优越感，适用范围更广，而 nationalist 更聚焦于国家层面。"
    }
  ]
}