{
  "word": "navajo",
  "pronunciation": "nə·və·ˈhō",
  "concise_definition": "n. 纳瓦霍人, 纳瓦霍语; adj. 纳瓦霍人的",
  "forms": {
    "plural": "navajos"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A member of a Native American people originally from the southwestern United States, known for their rich cultural traditions, including weaving, silversmithing, and oral storytelling.",
      "explanation_cn": "指原住于美国西南部的美洲原住民族群成员，以其丰富的文化传统著称，包括编织、银饰工艺和口述故事。",
      "example_en": "The Navajo Nation is the largest Native American tribe in the United States.",
      "example_cn": "纳瓦霍族是美国最大的美洲原住民族群。"
    },
    {
      "pos": "noun",
      "explanation_en": "The language spoken by the Navajo people, a complex Athabaskan language with a unique tonal system and extensive verb morphology.",
      "explanation_cn": "纳瓦霍人所使用的语言，是一种结构复杂的阿萨巴斯卡语，具有独特的声调系统和丰富的动词形态。",
      "example_en": "During World War II, Navajo code talkers used their language to transmit unbreakable military codes.",
      "example_cn": "在第二次世界大战期间，纳瓦霍语传令兵利用他们的语言传递了无法破译的军事密码。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characteristic of the Navajo people, their culture, or their language.",
      "explanation_cn": "与纳瓦霍人、其文化或语言相关的或具有其特征的。",
      "example_en": "The museum features a stunning collection of Navajo textiles and jewelry.",
      "example_cn": "博物馆展出了令人惊叹的纳瓦霍纺织品和珠宝收藏。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "apache",
      "analysis": "“Apache”（阿帕奇人）是另一个美洲原住民族群，与纳瓦霍人同属阿萨巴斯卡语系，地理分布相近，但文化、语言和历史发展路径不同。纳瓦霍人以精细的编织和银饰闻名，而阿帕奇人传统上更以游牧和战士文化著称。两者虽常被并列提及，但并非同一族群。"
    },
    {
      "word_to_compare": "indian",
      "analysis": "“Indian”（印第安人）是历史上对美洲原住民的泛称，现已被视为过时甚至冒犯性术语。而 “Navajo” 是一个具体的民族名称，具有文化认同和政治实体意义。使用 “Navajo” 而非 “Indian” 更准确、更尊重其族群身份。"
    },
    {
      "word_to_compare": "tribe",
      "analysis": "“Tribe”（部落）是一个泛指原住民社会组织的通用词，而 “Navajo” 是一个具体的部落名称。虽然纳瓦霍人常被称为一个部落，但其正式名称为 “Navajo Nation”，强调其作为主权政治实体的地位，而不仅仅是文化群体。"
    }
  ]
}