{
  "word": "navigation",
  "pronunciation": "nav·uh·hey·shuhn",
  "concise_definition": "n. 航行, 导航, 航行术",
  "forms": {
    "plural": "navigations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of planning, recording, and controlling the movement of a ship, aircraft, or other vehicle from one place to another, often using maps, instruments, or digital systems.",
      "explanation_cn": "指规划、记录和控制船舶、飞机或其他交通工具从一地到另一地的移动过程，通常借助地图、仪器或数字系统进行。",
      "example_en": "Modern navigation systems rely on GPS technology to guide drivers accurately.",
      "example_cn": "现代导航系统依靠全球定位技术为驾驶员提供精准指引。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of finding one's way through a complex system, such as a website, software interface, or organizational structure, often by using menus, links, or cues.",
      "explanation_cn": "指在复杂系统（如网站、软件界面或组织结构）中通过菜单、链接或提示找到路径或获取信息的行为。",
      "example_en": "The website's navigation is intuitive, making it easy for users to find what they need.",
      "example_cn": "该网站的导航设计直观，用户能轻松找到所需内容。"
    },
    {
      "pos": "noun",
      "explanation_en": "The skill or art of determining position and course, especially in maritime or aerial contexts, often requiring knowledge of astronomy, cartography, and physics.",
      "explanation_cn": "指在航海或航空环境中确定位置与航向的技能或艺术，通常需要掌握天文学、地图学和物理学知识。",
      "example_en": "Ancient Polynesian navigators used stars and ocean currents to cross vast stretches of the Pacific.",
      "example_cn": "古代波利尼西亚航海者依靠星辰和洋流横跨广阔的太平洋。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "direction",
      "analysis": "“Direction” (方向) 指单一的方位或指引，如“向北走”或“请往右转”，是导航中的一个组成部分，但不包含整个路径规划与执行过程。而 “navigation” 是一个系统性、持续性的行为，涵盖定位、路线选择与动态调整。"
    },
    {
      "word_to_compare": "guidance",
      "analysis": "“Guidance” (指导) 是一个更宽泛的术语，泛指任何形式的引导或建议，可用于教育、心理、技术等多个领域。而 “navigation” 更具体地指向空间或系统中的移动与路径探索，具有更强的技术性和操作性。"
    },
    {
      "word_to_compare": "route",
      "analysis": "“Route” (路线) 指从起点到终点的特定路径或通道，是一个静态的名词。而 “navigation” 是动态的过程，包括选择、评估和调整路线，甚至在途中应对变化。例如，你可以规划一条 route，但 navigation 是你如何实际走完它。"
    }
  ]
}