{
  "word": "nazi",
  "pronunciation": "nah·zee",
  "concise_definition": "n. 纳粹分子, 纳粹党的成员; adj. 纳粹的, 纳粹主义的",
  "forms": {
    "plural": "nazis"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A member of the National Socialist German Workers' Party (NSDAP), the far-right political party led by Adolf Hitler that ruled Germany from 1933 to 1945 and was responsible for the Holocaust and World War II atrocities.",
      "explanation_cn": "指纳粹德国国家社会主义德国工人党（NSDAP）的成员，该极右翼政党由阿道夫·希特勒领导，1933年至1945年统治德国，对大屠杀和第二次世界大战中的暴行负有责任。",
      "example_en": "Many former Nazis were prosecuted after the war for crimes against humanity.",
      "example_cn": "战后，许多前纳粹分子因反人类罪被起诉。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characteristic of the ideology, policies, or practices of the Nazi Party, especially those involving extreme nationalism, racism, anti-Semitism, and totalitarian control.",
      "explanation_cn": "与纳粹党的意识形态、政策或实践相关或具有其特征的，尤其指涉及极端民族主义、种族主义、反犹主义和极权统治的特征。",
      "example_en": "The film depicts the brutal, nazi-style suppression of dissent in occupied territories.",
      "example_cn": "这部电影描绘了占领区纳粹式镇压异见的残酷手段。"
    },
    {
      "pos": "noun",
      "explanation_en": "A derogatory term used to describe someone who exhibits authoritarian, intolerant, or brutally oppressive behavior, often in a metaphorical or exaggerated sense.",
      "explanation_cn": "一种贬义词，用于形容表现出专制、不容忍或残酷压迫行为的人，常用于隐喻或夸张的语境中。",
      "example_en": "Don't be such a nazi about the office dress code—it's just casual Friday!",
      "example_cn": "别对办公室着装规定这么苛刻了——今天只是休闲星期五啊！"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fascist",
      "analysis": "“Fascist”（法西斯主义者）泛指支持法西斯主义的政治运动或个人，起源于意大利墨索里尼的政权，强调极权主义、民族主义和反共主义。而 “nazi” 特指德国纳粹党，其意识形态在种族主义（尤其是反犹主义）和极端民族主义方面更为极端和系统化。所有纳粹分子都是法西斯主义者，但并非所有法西斯主义者都是纳粹分子。"
    },
    {
      "word_to_compare": "totalitarian",
      "analysis": "“Totalitarian”（极权主义的）是一个描述政治体制的形容词，指国家对社会生活所有方面的绝对控制，包括思想、言论和私人生活。它是一个中性学术术语，不带有道德评判。而 “nazi” 是一个具体历史实体的名称，带有强烈的道德谴责和历史罪恶的内涵，不能简单等同于“极权主义”。"
    },
    {
      "word_to_compare": "racist",
      "analysis": "“Racist”（种族主义者）指基于种族偏见而歧视或贬低他人的人，是一个广泛使用的道德批判术语。虽然纳粹主义的核心是种族主义，但 “nazi” 不仅包含种族主义，还涵盖国家恐怖、战争侵略、极权统治和系统性灭绝等多重罪恶。因此，“nazi” 的含义远比 “racist” 更复杂、更严重。"
    }
  ]
}