{
  "word": "necks",
  "pronunciation": "nekz",
  "concise_definition": "n. 脖子, 颈部; (瓶)颈; 领部; (衣物)领子",
  "forms": {
    "singular": "neck"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The part of the body that connects the head to the torso, containing the spinal cord, trachea, and major blood vessels.",
      "explanation_cn": "连接头部与躯干的身体部位，包含脊髓、气管和主要血管。",
      "example_en": "She wore a gold necklace that rested gently on her neck.",
      "example_cn": "她戴着一条金项链，轻轻垂在脖子上。"
    },
    {
      "pos": "noun",
      "explanation_en": "The narrow, tapered part of an object, such as the neck of a bottle, guitar, or bottle, which connects a wider part to a narrower one.",
      "explanation_cn": "物体中较窄、呈锥形的部分，如瓶子、吉他或瓶子的颈部，连接较宽部分与较窄部分。",
      "example_en": "Be careful not to break the neck of the wine bottle when pouring.",
      "example_cn": "倒酒时小心别弄断酒瓶的瓶颈。"
    },
    {
      "pos": "noun",
      "explanation_en": "The part of a garment that surrounds or fits around the neck, such as a collar or neckline.",
      "explanation_cn": "衣物中围绕或贴合颈部的部分，如衣领或领口。",
      "example_en": "The sweater had a high neck that kept her warm in winter.",
      "example_cn": "这件毛衣有一个高领，冬天能让她保暖。"
    },
    {
      "pos": "noun",
      "explanation_en": "A narrow strip of land connecting two larger areas, such as a geographical neck (e.g., an isthmus).",
      "explanation_cn": "连接两个较大区域的狭窄地带，如地理上的地峡。",
      "example_en": "The isthmus acts as a neck of land between the two peninsulas.",
      "example_cn": "这个地峡是两个半岛之间的一块狭长陆地。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "throat",
      "analysis": "“Throat” (喉咙) 更侧重于指人体内部的咽部和喉部，是呼吸与吞咽的通道，具有生理功能；而 “neck” 指的是外部可见的整个颈部结构，包括皮肤、肌肉、骨骼等，范围更广。"
    },
    {
      "word_to_compare": "collar",
      "analysis": "“Collar” (衣领) 是衣物上直接围绕颈部的特定部分，是“neck”的附属结构；而 “neck” 本身是身体部位或物体的狭窄部分，两者属于不同范畴——前者是服装部件，后者是解剖或物体结构。"
    },
    {
      "word_to_compare": "stem",
      "analysis": "“Stem” (茎/柄) 常用于植物或器物的细长支撑部分，如花茎、酒杯柄，强调支撑与连接功能；而 “neck” 更强调从宽到窄的过渡形态，常用于瓶口、领口等具有明显收窄特征的部位，语义更具体于形态变化。"
    }
  ]
}