{
  "word": "neck",
  "pronunciation": "nek",
  "concise_definition": "n. 颈, 颈部; v. (非正式) 砍头, 拧断",
  "forms": {
    "plural": "necks"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The part of the body that connects the head to the torso, containing the spinal cord, trachea, and major blood vessels, and allowing movement of the head.",
      "explanation_cn": "连接头部与躯干的身体部位，包含脊髓、气管和主要血管，使头部能够活动。",
      "example_en": "She wore a delicate gold necklace around her neck.",
      "example_cn": "她脖子上戴着一条精致的金项链。"
    },
    {
      "pos": "noun",
      "explanation_en": "A narrow part of an object that connects two wider sections, such as the neck of a bottle, a guitar, or a landform.",
      "explanation_cn": "指物体中连接两个较宽部分的狭窄区域，如瓶子的瓶颈、吉他的琴颈或地理上的地峡。",
      "example_en": "The wine bottle had a long, slender neck to preserve the aroma.",
      "example_cn": "这个酒瓶的瓶颈细长，有助于保留香气。"
    },
    {
      "pos": "noun",
      "explanation_en": "A position or situation that is difficult to escape from, often used in the phrase 'in a tight neck' (less common) or more idiomatically 'in a tight spot'.",
      "explanation_cn": "指一种难以脱身的困境或处境，常用于比喻性语境（注：更常见表达为 'in a tight spot'，但 'neck' 可用于 'at the neck of' 等结构中表示关键位置）。",
      "example_en": "The army was caught in a neck of the valley with enemy forces on both sides.",
      "example_cn": "军队被困在山谷的狭窄处，敌军在两侧。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cut off someone's head, especially in a violent or informal context; sometimes used metaphorically to mean to remove or eliminate something abruptly.",
      "explanation_cn": "（非正式）指砍下某人的头；也可比喻性地表示突然移除或终止某事物。",
      "example_en": "The old system was necked in the first week of the new administration.",
      "example_cn": "新政府上任第一周就废除了旧制度。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "throat",
      "analysis": "“Throat” (喉咙) 更侧重于指咽部和喉部的内部通道，是呼吸和吞咽的通道，强调生理功能；而 “neck” 是指整个外部结构，包括肌肉、皮肤、骨骼和血管，是解剖学上的整体区域。"
    },
    {
      "word_to_compare": "collar",
      "analysis": "“Collar” (衣领) 是衣物的一部分，环绕在脖子周围，用于装饰或固定衣物；它不具有解剖学意义，而 “neck” 是身体的自然组成部分。两者常在语境中搭配使用，但功能和本质完全不同。"
    },
    {
      "word_to_compare": "stem",
      "analysis": "“Stem” (茎/柄) 与 “neck” 在比喻义上相似，都指连接主体与附属部分的细长结构，如花茎、笔杆。但 “stem” 更常用于植物或物体的自然/机械结构，而 “neck” 更多用于动物身体或人造物品（如瓶子、吉他）中具有弯曲或柔韧特征的狭窄部分。"
    }
  ]
}