{
  "word": "needles",
  "pronunciation": "nee·duhlz",
  "concise_definition": "n. 针, 针状物, (复数) 注射针, 缝纫针",
  "forms": {
    "singular": "needle"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small, slender, pointed object, typically made of metal, used for sewing, knitting, or administering injections.",
      "explanation_cn": "一种细长、尖锐的物体，通常由金属制成，用于缝纫、编织或注射药物。",
      "example_en": "She threaded the needle carefully before beginning to sew.",
      "example_cn": "她在开始缝纫前仔细地穿好了针。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sharp, pointed structure found in certain plants or animals, such as the spines of a cactus or the quills of a porcupine.",
      "explanation_cn": "某些植物或动物身上具有的尖刺状结构，例如仙人掌的刺或豪猪的棘刺。",
      "example_en": "The porcupine raised its needles defensively when threatened.",
      "example_cn": "当受到威胁时，豪猪竖起了它的棘刺进行防御。"
    },
    {
      "pos": "noun",
      "explanation_en": "A thin, pointed instrument used in medical procedures, especially for injecting drugs or drawing blood.",
      "explanation_cn": "用于医疗程序中的细长尖锐器械，常用于注射药物或抽血。",
      "example_en": "The nurse administered the vaccine with a sterile needle.",
      "example_cn": "护士用无菌针头接种了疫苗。"
    },
    {
      "pos": "noun",
      "explanation_en": "A thin, pointed part of a device or object that resembles a needle, such as the pointer on a dial or gauge.",
      "explanation_cn": "指某些设备或物体上形似针的细长指针部分，例如仪表盘上的指针。",
      "example_en": "The needle on the speedometer was trembling as the car approached its limit.",
      "example_cn": "当汽车接近极限速度时，速度表上的指针在颤抖。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pin",
      "analysis": "“Pin” (别针/图钉) 通常比 “needle” 更粗、更短，且一端有圆头或扁平头，主要用于固定布料或纸张，不具备穿刺缝纫线的功能。而 “needle” 更细长、尖锐，专为穿透和穿线设计，常用于精细操作。"
    },
    {
      "word_to_compare": "spike",
      "analysis": "“Spike” (尖桩/尖刺) 通常指粗大、坚硬、用于防御或固定结构的尖状物，如铁轨上的尖钉或建筑中的尖桩。它强调坚固和力量，而 “needle” 更强调纤细、精密和功能性，常用于医疗或手工领域。"
    },
    {
      "word_to_compare": "stylus",
      "analysis": "“Stylus” (触控笔/刻写笔) 是一种用于书写、绘画或操作触摸屏的工具，通常为圆柱形或锥形，但不用于穿刺。而 “needle” 的核心功能是穿透材料，如布料或皮肤，两者在用途和物理作用机制上有本质区别。"
    }
  ]
}