{
  "word": "needed",
  "pronunciation": "nee·dud",
  "concise_definition": "adj. 必需的, 必要的; v. 需要 (need 的过去式和过去分词)",
  "forms": {
    "base_form": "need",
    "third_person_singular": "needs",
    "past_tense": "needed",
    "past_participle": "needed",
    "present_participle": "needing"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Required or essential for a particular purpose, situation, or outcome; not optional or dispensable.",
      "explanation_cn": "为实现某一特定目的、情境或结果所必需的，不可省略或替代的。",
      "example_en": "Water is a needed resource in any desert survival plan.",
      "example_cn": "水是任何沙漠生存计划中必需的资源。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Expressing a sense of urgency or importance in a context where something is lacking or insufficient.",
      "explanation_cn": "在某种事物缺失或不足的语境中，表达紧迫性或重要性。",
      "example_en": "We are in needed of more volunteers for the charity event.",
      "example_cn": "我们急需更多志愿者参与这次慈善活动。"
    },
    {
      "pos": "verb",
      "explanation_en": "The past tense and past participle of 'need'; used to indicate that something was required or desired at a specific time in the past.",
      "explanation_cn": "“need”的过去式和过去分词，用于表示在过去某个时间点某事物被需要或被渴望。",
      "example_en": "She needed help with her homework last night.",
      "example_cn": "她昨晚需要帮助完成作业。"
    },
    {
      "pos": "verb",
      "explanation_en": "Used in conditional or hypothetical contexts to express a past requirement that was or was not fulfilled.",
      "explanation_cn": "用于条件或假设语境中，表达过去是否被满足的需求。",
      "example_en": "If he had needed more time, he would have asked for it.",
      "example_cn": "如果他当时需要更多时间，他本会提出来的。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "necessary",
      "analysis": "“Necessary” (必要的) 是一个更正式、更绝对的形容词，强调逻辑或客观上的不可或缺性，常用于法律、科学或正式语境。而 “needed” 更口语化，侧重于主观需求或实际情境中的迫切性，有时可被替代，但不一定是绝对必需的。"
    },
    {
      "word_to_compare": "required",
      "analysis": "“Required” (被要求的) 通常指由规则、制度或权威强制规定的，具有外在约束力。而 “needed” 更强调内在的、功能性的需求，不一定有强制性。例如：‘A passport is required for international travel’（强制规定），而 ‘You need a good map’（主观需求）。"
    },
    {
      "word_to_compare": "essential",
      "analysis": "“Essential” (本质的、至关重要的) 比 “needed” 程度更强，表示若缺少则会导致失败或根本无法运作。而 “needed” 可以是轻微或情境性的需求，不一定影响根本结果。例如：‘Oxygen is essential for life’（不可替代），而 ‘A coffee is needed to start my day’（习惯性需求）。"
    }
  ]
}