{
  "word": "needle",
  "pronunciation": "nee·dul",
  "concise_definition": "n. 针, 针状物; v. 刺, 挑逗, 嘲讽",
  "forms": {
    "plural": "needles"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small, slender, pointed object, typically made of metal, used for sewing, knitting, or medical injections.",
      "explanation_cn": "一种细长、尖锐的物体，通常由金属制成，用于缝纫、编织或医疗注射。",
      "example_en": "She threaded the needle carefully before beginning to sew.",
      "example_cn": "她在开始缝纫前仔细地穿好了针。"
    },
    {
      "pos": "noun",
      "explanation_en": "A pointer on a measuring instrument, such as a compass or speedometer, that indicates a value by moving across a scale.",
      "explanation_cn": "测量仪器（如指南针或速度表）上的指针，通过在刻度上移动来指示数值。",
      "example_en": "The needle on the fuel gauge was barely above empty.",
      "example_cn": "油量表上的指针几乎刚过空档。"
    },
    {
      "pos": "noun",
      "explanation_en": "Something very thin or pointed in shape, often used metaphorically to describe a sharp or acute feature.",
      "explanation_cn": "形状细长尖锐之物，常用于比喻描述尖锐或突出的特征。",
      "example_en": "The mountain peaks rose like needles into the sky.",
      "example_cn": "山峰如针般刺向天空。"
    },
    {
      "pos": "verb",
      "explanation_en": "To poke or stab with a sharp object, especially a needle; can also mean to provoke or tease someone persistently.",
      "explanation_cn": "用尖锐物体（尤其是针）刺或戳；也可引申为持续地挑衅或嘲讽某人。",
      "example_en": "He was needle by his coworkers for always being late.",
      "example_cn": "他因为总是迟到而被同事不断嘲讽。"
    },
    {
      "pos": "verb",
      "explanation_en": "To administer an injection using a needle, especially in a medical context.",
      "explanation_cn": "在医疗语境中，使用针头进行注射。",
      "example_en": "The nurse needled the patient with a flu vaccine.",
      "example_cn": "护士给病人注射了流感疫苗。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pin",
      "analysis": "“Pin” (别针) 通常较粗、有头，用于固定布料或纸张，不用于穿线或注射。而 “needle” 更细长、尖锐，专为穿透和穿线设计，功能更精密。两者虽都为尖状物，但用途和结构差异显著。"
    },
    {
      "word_to_compare": "spike",
      "analysis": "“Spike” (尖桩/尖刺) 通常指粗大、坚硬、用于防御或结构支撑的尖状物，如铁轨上的道钉或建筑尖顶。它强调坚固和威慑力，而 “needle” 更强调纤细、精确和功能性，常用于精细操作。"
    },
    {
      "word_to_compare": "tease",
      "analysis": "“Tease” (取笑) 是一个更广泛的心理行为动词，指通过言语或行为轻度嘲弄他人，不涉及物理动作。而 “needle” 作为动词时，特指带有持续性、轻微攻击性的言语挑衅，常带有一种顽皮或恼人的语气，语义更具体且隐含身体动作的隐喻。"
    }
  ]
}