{
  "word": "negative",
  "pronunciation": "neh·guh·tiv",
  "concise_definition": "adj. 负的, 消极的, 否定的; n. 负片, 否定",
  "forms": {
    "comparative": "more negative",
    "superlative": "most negative"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Expressing or indicating denial, refusal, or opposition; not positive or affirming.",
      "explanation_cn": "表达或表示否认、拒绝或反对；非肯定或正面的。",
      "example_en": "She gave a negative response to the proposal.",
      "example_cn": "她对这项提议给予了否定的答复。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Having a harmful, pessimistic, or discouraging quality; lacking optimism or constructive attitude.",
      "explanation_cn": "具有有害、悲观或令人沮丧的性质；缺乏乐观或建设性态度。",
      "example_en": "His negative attitude affected the whole team's morale.",
      "example_cn": "他的消极态度影响了整个团队的士气。"
    },
    {
      "pos": "adjective",
      "explanation_en": "In mathematics or physics, less than zero; representing a value below a defined reference point.",
      "explanation_cn": "在数学或物理中，小于零的；表示低于某一参考点的数值。",
      "example_en": "The temperature dropped to negative five degrees Celsius.",
      "example_cn": "温度降至零下五摄氏度。"
    },
    {
      "pos": "noun",
      "explanation_en": "A photographic film or print in which light and dark areas are reversed compared to the original scene.",
      "explanation_cn": "一种摄影胶片或照片，其明暗区域与原始场景相反。",
      "example_en": "The photographer developed the negative to produce the final print.",
      "example_cn": "摄影师冲洗了负片以制作最终的照片。"
    },
    {
      "pos": "noun",
      "explanation_en": "An absence or lack of something, especially in a context where it is expected or required.",
      "explanation_cn": "某种事物的缺失或缺乏，尤其在预期或需要该事物的情境中。",
      "example_en": "The report highlighted the negative of not having proper safety protocols.",
      "example_cn": "报告强调了缺乏适当安全规程所带来的负面影响。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "positive",
      "analysis": "“Positive”（积极的/肯定的）与 “negative” 形成直接对立。前者表示肯定、乐观、有益或高于零的数值，后者则表示否定、悲观、有害或低于零的数值。在逻辑、情绪和数学语境中，二者常作为反义词使用。"
    },
    {
      "word_to_compare": "pessimistic",
      "analysis": "“Pessimistic”（悲观的）侧重于对未来的预期持消极看法，强调心理倾向；而 “negative” 作为形容词时范围更广，可指态度、反应、数值或图像，不一定涉及对未来判断。一个悲观的人可能总是预期坏事，但一个负面的评论可能只是陈述事实而不含情绪。"
    },
    {
      "word_to_compare": "denial",
      "analysis": "“Denial”（否认）是名词，指拒绝承认事实或现实的行为，常用于心理或法律语境；而 “negative” 作为形容词或名词时，更广泛地表示否定性、负值或反面状态。例如，一个 “negative test result”（阴性检测结果）是医学术语，不等于 “denial of illness”（否认患病）。"
    }
  ]
}