{
  "word": "neighbourhoods",
  "pronunciation": "nee·bruh·hoods",
  "concise_definition": "n. 邻里, 社区, 街区",
  "forms": {
    "singular": "neighbourhood"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A geographically defined area within a city or town where people live, typically characterized by shared social, cultural, or economic features and a sense of community.",
      "explanation_cn": "指城市或城镇中一个地理上明确的区域，居民在此生活，通常具有共同的社会、文化或经济特征，并带有社区归属感。",
      "example_en": "She loves her neighbourhood because everyone knows each other and helps out in times of need.",
      "example_cn": "她喜欢自己的社区，因为这里人人都互相认识，有困难时都会互相帮助。"
    },
    {
      "pos": "noun",
      "explanation_en": "The immediate surrounding area of a particular place, often referring to the physical environment and local amenities such as shops, parks, and schools.",
      "explanation_cn": "指某一特定地点附近的区域，常指其物理环境及周边设施，如商店、公园和学校。",
      "example_en": "The new library has improved the quality of life in this neighbourhood.",
      "example_cn": "新图书馆的建成提升了这个社区的生活质量。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of people living in close proximity who share common interests, values, or experiences, even if not formally organized.",
      "explanation_cn": "指居住在相近区域、拥有共同兴趣、价值观或经历的一群人，即使未正式组织起来。",
      "example_en": "The neighbourhood around the park has become more active since the community garden was started.",
      "example_cn": "自从社区花园建立以来，公园周围的邻里关系变得更加活跃了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "district",
      "analysis": "“District”（行政区/区域）通常指由政府或行政机构划分的正式区域，具有明确的边界和管理职能，如商业区、学区。而 “neighbourhood” 更强调居民的日常生活和社区认同，是非正式的、以人际关系为基础的区域。"
    },
    {
      "word_to_compare": "community",
      "analysis": "“Community”（社区）侧重于人与人之间的社会联系、共同利益和互动关系，可以跨越地理界限（如网络社区、信仰社区）。而 “neighbourhood” 更强调物理空间上的邻近性，是社区的一种具体地理表现形式。"
    },
    {
      "word_to_compare": "area",
      "analysis": "“Area”（区域）是一个最宽泛的词，泛指任何地理空间，不带有社会或情感内涵。而 “neighbourhood” 隐含了人文属性，如归属感、互动和共同生活经验，比 “area” 更具生活气息和情感色彩。"
    }
  ]
}