{
  "word": "nests",
  "pronunciation": "nestz",
  "concise_definition": "n. 巢, 窝; v. (nest 的第三人称单数形式) 建巢, 安家",
  "forms": {
    "singular": "nest",
    "past_tense": "nested",
    "past_participle": "nested",
    "present_participle": "nesting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A structure built by birds, insects, or other animals to lay eggs and raise young, typically made of twigs, leaves, or other materials.",
      "explanation_cn": "鸟类、昆虫或其他动物为产卵和抚育幼崽而建造的结构，通常由树枝、树叶或其他材料构成。",
      "example_en": "The robin built a cozy nest in the branches of the oak tree.",
      "example_cn": "知更鸟在橡树的枝杈间筑了一个温暖的巢。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of things arranged in a series, each fitting inside the next, such as a set of nested boxes or containers.",
      "explanation_cn": "指一系列物品按大小顺序排列，每个都可放入下一个之中，如一套嵌套的盒子或容器。",
      "example_en": "She kept her jewelry in a set of beautifully crafted nested boxes.",
      "example_cn": "她把珠宝放在一套精工制作的嵌套盒子里。"
    },
    {
      "pos": "noun",
      "explanation_en": "A place or situation where something undesirable is concentrated or hidden, often used metaphorically (e.g., a nest of criminals).",
      "explanation_cn": "比喻性地指某种不良事物集中或隐藏的地方，如罪犯的窝点。",
      "example_en": "Police raided a nest of counterfeiters operating in the old warehouse.",
      "example_cn": "警方突袭了藏身于旧仓库的一处伪造者窝点。"
    },
    {
      "pos": "verb",
      "explanation_en": "To build or settle in a nest; to make a home or resting place, especially for animals.",
      "explanation_cn": "指建造或定居于巢中；尤指动物安家或栖息。",
      "example_en": "The eagles nested on the cliff ledge every spring.",
      "example_cn": "每年春天，鹰都在悬崖边缘筑巢。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fit or arrange one thing inside another, often repeatedly or systematically.",
      "explanation_cn": "指将一个物体系统性地或重复地放入另一个物体内部。",
      "example_en": "The storage containers are designed to nest neatly when not in use.",
      "example_cn": "这些储物容器在不使用时可以整齐地嵌套在一起。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "den",
      "analysis": "“Den”（兽穴）通常指哺乳动物（如熊、狼）居住的隐蔽洞穴，强调私密性和防御性，常用于陆地大型动物；而 “nest” 多用于鸟类、昆虫或小型动物，结构更轻巧、开放，常位于树上或地面表面。"
    },
    {
      "word_to_compare": "hive",
      "analysis": "“Hive”（蜂巢）特指蜜蜂等社会性昆虫建造的复杂多室结构，具有高度组织化和功能性；“nest” 则泛指任何动物的繁殖栖息地，结构更简单，不强调社会分工。"
    },
    {
      "word_to_compare": "lair",
      "analysis": "“Lair”（兽窝）多用于描述猛兽或危险生物的藏身之所，带有威胁性和神秘感，常用于文学语境；“nest” 则中性或温馨，多用于描述繁殖行为，情感色彩更正面。"
    }
  ]
}