{
  "word": "nightingale",
  "pronunciation": "nīt·iŋ·ɡāl",
  "concise_definition": "n. 夜莺, 诗人, 歌手",
  "forms": {
    "plural": "nightingales"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small, brownish European bird known for its beautiful and complex song, especially heard at night; often symbolizing poetry, love, or melancholy in literature.",
      "explanation_cn": "一种体型小巧、呈棕褐色的欧洲鸟类，以其优美而复杂的鸣叫声著称，尤其在夜间鸣唱；在文学中常象征诗歌、爱情或忧郁。",
      "example_en": "The nightingale's song echoed through the silent forest, filling the air with haunting beauty.",
      "example_cn": "夜莺的歌声在寂静的森林中回荡，空气中弥漫着令人心醉的美。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person with a beautiful singing voice, especially one who sings with emotional depth and artistry; often used metaphorically to praise a vocalist.",
      "explanation_cn": "指拥有优美歌喉的人，尤指那些以情感深度和艺术性演唱的人；常用于隐喻性地赞美歌手。",
      "example_en": "She was called the nightingale of the opera world for her soul-stirring performances.",
      "example_cn": "她因感人至深的表演被誉为歌剧界的夜莺。"
    },
    {
      "pos": "noun",
      "explanation_en": "A nickname for Florence Nightingale, the pioneering English nurse and statistician who revolutionized hospital care in the 19th century.",
      "explanation_cn": "指弗洛伦斯·南丁格尔的昵称，这位19世纪英国护理先驱和统计学家彻底革新了医院护理体系。",
      "example_en": "Known as the Lady with the Lamp, the nightingale laid the foundations of modern nursing.",
      "example_cn": "被称为‘提灯女士’的南丁格尔奠定了现代护理的基础。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "thrush",
      "analysis": "“Thrush”（鸫）是一类广泛分布的鸣禽，许多种类也会鸣唱，但它们的歌声通常不如夜莺那样复杂、持久或富有诗意。夜莺的鸣叫在文学和文化中具有更强烈的象征意义，而鸫更偏向于普通鸟类的自然存在。"
    },
    {
      "word_to_compare": "songbird",
      "analysis": "“Songbird”（鸣禽）是泛指所有善于鸣唱的鸟类，属于一个大类。而 “nightingale” 是一个具体物种，因其歌声的卓越和文化象征意义而被单独赋予特殊地位。使用 “songbird” 时更中性，而 “nightingale” 常带有赞美和浪漫色彩。"
    },
    {
      "word_to_compare": "bard",
      "analysis": "“Bard”（诗人/吟游诗人）指创作或吟诵诗歌的人，常与文学传统相关。虽然夜莺常被比喻为诗人，但 “bard” 是人类角色，而 “nightingale” 是自然生物，二者属于不同维度的隐喻：一个是真实的人，一个是被拟人化的自然之声。"
    }
  ]
}