{
  "word": "nitro",
  "pronunciation": "nī·trō",
  "concise_definition": "n. 硝基, 硝化物, 硝酸甘油",
  "forms": {
    "plural": "nitros"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A shortened form of 'nitrogen' or 'nitro compound', commonly used in chemistry and slang to refer to substances containing the nitro group (–NO₂), especially those used as explosives or performance enhancers.",
      "explanation_cn": "“nitrogen” 或 “硝基化合物” 的缩略形式，常用于化学领域或俚语中，指含有硝基（–NO₂）的物质，尤其是用作炸药或性能增强剂的化合物。",
      "example_en": "The race car was fueled with nitro to boost its acceleration.",
      "example_cn": "这辆赛车使用硝基燃料来提升加速性能。"
    },
    {
      "pos": "noun",
      "explanation_en": "Slang for nitroglycerin or other high-energy nitro compounds used in explosives or as medical vasodilators.",
      "explanation_cn": "俚语中指硝酸甘油或其他高能硝基化合物，用于制造炸药或作为医疗血管扩张剂。",
      "example_en": "Doctors use small doses of nitro to relieve chest pain in heart patients.",
      "example_cn": "医生使用少量硝化物来缓解心脏病患者的胸痛。"
    },
    {
      "pos": "noun",
      "explanation_en": "In automotive and racing contexts, a colloquial term for nitrous oxide (N₂O), used to increase engine power by injecting more oxygen into the combustion chamber.",
      "explanation_cn": "在汽车和赛车语境中，对一氧化二氮（N₂O）的俗称，通过向燃烧室注入更多氧气来提升发动机动力。",
      "example_en": "He installed a nitro system to gain an extra 200 horsepower on the drag strip.",
      "example_cn": "他在直线加速赛道上安装了一套硝基系统，以额外增加200马力的动力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "nitrogen",
      "analysis": "“Nitrogen”（氮）是化学元素 N，指纯净的气态氮元素，是大气的主要成分。而 “nitro” 是其缩略形式，特指含氮的化合物（如硝基或硝酸盐），并非元素本身，而是其化学衍生物。"
    },
    {
      "word_to_compare": "nitrous_oxide",
      "analysis": "“Nitrous oxide”（一氧化二氮）是化学名称，常用于医疗麻醉或赛车增压，而 “nitro” 是其在非正式语境中的简称。虽然在赛车语境中两者常互换，但 “nitrous oxide” 更准确，而 “nitro” 更口语化、泛化。"
    },
    {
      "word_to_compare": "explosive",
      "analysis": "“Explosive”（炸药）是泛指所有能剧烈爆炸的物质，而 “nitro” 特指含硝基的爆炸物（如TNT、硝化甘油），是爆炸物的一种子类。并非所有炸药都是硝基化合物，但大多数高性能炸药都含 “nitro”。"
    }
  ]
}