{
  "word": "nordic",
  "pronunciation": "nor·dik",
  "concise_definition": "adj. 北欧的, 北欧人的; n. 北欧人",
  "forms": {
    "comparative": "nordicer",
    "superlative": "nordicest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characteristic of the countries of northern Europe, especially Denmark, Finland, Iceland, Norway, and Sweden, including their cultures, languages, climates, and aesthetics.",
      "explanation_cn": "指与北欧国家（尤其是丹麦、芬兰、冰岛、挪威和瑞典）相关或具有其特征的，涵盖这些国家的文化、语言、气候和美学风格。",
      "example_en": "The minimalist design of the furniture reflects classic Nordic aesthetics.",
      "example_cn": "这款家具的极简设计体现了经典的北欧美学。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing the physical or cultural traits associated with the peoples of Scandinavia and the Nordic region, often implying fair skin, light hair, and a connection to nature and simplicity.",
      "explanation_cn": "形容与斯堪的纳维亚及北欧地区人民相关的身体或文化特征，常暗示肤色白皙、发色浅淡，以及与自然和简约生活方式的联系。",
      "example_en": "Nordic mythology has deeply influenced modern fantasy literature.",
      "example_cn": "北欧神话对现代奇幻文学产生了深远影响。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person native to or originating from the Nordic countries; often used to refer to individuals of Scandinavian descent.",
      "explanation_cn": "指来自北欧国家的原住民或后裔；常用于指具有斯堪的纳维亚血统的人。",
      "example_en": "Many Nordic athletes dominate winter sports at the Olympic Games.",
      "example_cn": "许多北欧运动员在奥运会上主导冬季运动项目。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "scandinavian",
      "analysis": "“Scandinavian”（斯堪的纳维亚的）通常仅指丹麦、挪威和瑞典三国，有时也包括芬兰和冰岛，但严格意义上不包含它们。而 “Nordic” 是一个更广义的地理和文化术语，明确包括芬兰、冰岛以及它们的自治领土（如格陵兰和法罗群岛），涵盖语言、政治和文化上的更广泛共同体。"
    },
    {
      "word_to_compare": "northern",
      "analysis": "“Northern”（北方的）是一个泛指地理方位的词，可指世界任何北部地区（如北美北部、中国北方），缺乏文化或民族特指性。而 “Nordic” 是一个具有明确文化、历史和政治内涵的专有名词，特指北欧五国及其共同价值观，如福利制度、环保意识和极简主义。"
    },
    {
      "word_to_compare": "baltic",
      "analysis": "“Baltic”（波罗的海的）指环绕波罗的海的国家，如爱沙尼亚、拉脱维亚、立陶宛，有时包括波兰和俄罗斯的加里宁格勒地区。这些国家虽在地理上邻近北欧，但语言、历史和文化传统与北欧国家有显著差异。Nordic 强调的是共同的北日耳曼/乌拉尔文化根基，而 Baltic 更强调地理和历史上的波罗的海联系。"
    }
  ]
}