{
  "word": "noses",
  "pronunciation": "noh·ziz",
  "concise_definition": "n. 鼻子, 鼻尖, 嗅觉, 直觉",
  "forms": {
    "singular": "nose"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The prominent facial organ used for breathing and smelling, consisting of cartilage, skin, and internal passages that connect to the nasal cavity.",
      "explanation_cn": "面部突出的器官，用于呼吸和嗅觉，由软骨、皮肤和连接鼻腔的内部通道组成。",
      "example_en": "She wiped her nose with a tissue after catching a cold.",
      "example_cn": "她感冒后用纸巾擦了擦鼻子。"
    },
    {
      "pos": "noun",
      "explanation_en": "A projecting or pointed part resembling a nose, such as the front end of a ship or a mountain ridge.",
      "explanation_cn": "指形状类似鼻子的突出部分，如船头或山脊的尖端。",
      "example_en": "The ship's nose cut through the waves with remarkable speed.",
      "example_cn": "船头以惊人的速度破浪前行。"
    },
    {
      "pos": "noun",
      "explanation_en": "The sense of smell; the ability to detect odors.",
      "explanation_cn": "指嗅觉；感知气味的能力。",
      "example_en": "A wine expert relies on his nose to detect subtle aromas.",
      "example_cn": "葡萄酒专家依靠他的嗅觉来辨别细微的香气。"
    },
    {
      "pos": "noun",
      "explanation_en": "A keen instinct or intuition, especially in detecting opportunities, trends, or deception.",
      "explanation_cn": "指敏锐的直觉，尤指察觉机会、趋势或欺骗的能力。",
      "example_en": "He has a nose for business—he always knows where the next big deal is.",
      "example_cn": "他有经商的直觉——总能知道下一个大单在哪里。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slang term for a person's attention or involvement in something, often used in the phrase 'keep your nose out of it'.",
      "explanation_cn": "俚语，指某人对某事的关注或介入，常用于短语 'keep your nose out of it'（别管闲事）。",
      "example_en": "Why are you always sticking your nose into other people's affairs?",
      "example_cn": "你为什么总是插手别人的事？"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "snout",
      "analysis": "“Snout”（吻部）通常用于动物，尤其是猪、狗等，强调其长而突出的口鼻部，带有更原始或动物性的联想。而 “nose” 是人类和动物通用的中性词，更常用于正式语境和比喻意义。"
    },
    {
      "word_to_compare": "olfaction",
      "analysis": "“Olfaction”（嗅觉）是科学术语，专指嗅觉的生理过程或系统，用于医学或生物学语境。而 “nose” 作为名词时，既可指器官本身，也可泛指嗅觉能力，更口语化、更广泛。"
    },
    {
      "word_to_compare": "sniff",
      "analysis": "“Sniff” 是动词，指用鼻子吸气以闻气味，也可引申为怀疑或探查。它描述的是动作，而 “nose” 是名词，指执行该动作的器官或能力。两者词性不同，但常在语义上关联。"
    }
  ]
}