{
  "word": "nosed",
  "pronunciation": "nozd",
  "concise_definition": "adj. 有鼻的, 用鼻的; v. (nose 的过去式和过去分词) 用鼻子嗅, 探索, 用鼻子推",
  "forms": {
    "base_form": "nose",
    "past_tense": "nosed",
    "past_participle": "nosed",
    "present_participle": "nosing",
    "third_person_singular": "noses"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move or push something using the nose, often in a tentative or probing manner.",
      "explanation_cn": "用鼻子推动或移动某物，通常带有试探性或探索性的动作。",
      "example_en": "The dog nosed the door open until it finally slipped inside.",
      "example_cn": "狗用鼻子把门顶开，直到终于溜了进去。"
    },
    {
      "pos": "verb",
      "explanation_en": "To search or investigate something by using the sense of smell or by poking around subtly.",
      "explanation_cn": "通过嗅觉或悄悄地探查来搜寻或调查某物。",
      "example_en": "The detective nosed around the old house for clues.",
      "example_cn": "侦探在老房子里四处探查线索。"
    },
    {
      "pos": "verb",
      "explanation_en": "To detect or discover something by intuition or subtle observation, often metaphorically using the sense of smell.",
      "explanation_cn": "通过直觉或细微观察来察觉或发现某物，常为比喻性地使用‘嗅觉’。",
      "example_en": "She nosed out the truth after weeks of quiet questioning.",
      "example_cn": "经过数周的低调询问，她终于发现了真相。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Having a nose or a nose-like feature; used in compound terms to describe something shaped like or associated with a nose.",
      "explanation_cn": "具有鼻子或类似鼻子特征的；用于复合词中描述形状或与鼻子相关的物体。",
      "example_en": "The nosed probe was designed to fit precisely into the narrow cavity.",
      "example_cn": "这个带鼻状探头被设计为精确嵌入狭窄的腔体中。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sniff",
      "analysis": "“Sniff” (嗅闻) 侧重于快速、短促地用鼻子吸气以感知气味，动作更短暂、更生理化。而 “nosed” 在动词用法中常包含持续的探索或推动动作，不仅限于嗅觉，还可指物理性地用鼻子移动物体或隐喻性地探查信息。"
    },
    {
      "word_to_compare": "probe",
      "analysis": "“Probe” (探查) 是一个更通用的词，指系统性地调查或探索，可使用工具或方法，不限于鼻子。而 “nosed” 是一种具象化、拟物化的探查方式，强调用鼻子作为工具，带有更生动、口语化的色彩。"
    },
    {
      "word_to_compare": "nose (noun)",
      "analysis": "作为名词的 “nose” 指面部器官或类似形状的物体，是静态的实体；而 “nosed” 是其动词形式的过去式/形容词形式，强调动作或特征，具有动态性或修饰性。例如：a nosed boat（有鼻状船首的船）与 the dog’s nose（狗的鼻子）形成动作与实体的对比。"
    }
  ]
}