{
  "word": "notes",
  "pronunciation": "noh·ts",
  "concise_definition": "n. 笔记, 音符, 纸币, 备注",
  "forms": {
    "singular": "note"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A written record of information, often brief and informal, made to aid memory or communication.",
      "explanation_cn": "指为辅助记忆或沟通而做的简短、非正式的文字记录。",
      "example_en": "She took detailed notes during the lecture to prepare for the exam.",
      "example_cn": "她上课时做了详细的笔记，以便为考试做准备。"
    },
    {
      "pos": "noun",
      "explanation_en": "A short written message, often left for someone, conveying a quick request, reminder, or comment.",
      "explanation_cn": "指留给某人的简短书面信息，用于传达请求、提醒或评论。",
      "example_en": "I left a note on the fridge reminding my roommate to buy milk.",
      "example_cn": "我在冰箱上留了一张便条，提醒室友去买牛奶。"
    },
    {
      "pos": "noun",
      "explanation_en": "A symbol used in musical notation to represent a specific pitch and duration.",
      "explanation_cn": "指在乐谱中用来表示特定音高和时值的音乐符号。",
      "example_en": "The pianist played the opening notes of Beethoven’s Fifth Symphony with great emotion.",
      "example_cn": "钢琴家充满感情地演奏了贝多芬第五交响曲的开头几个音符。"
    },
    {
      "pos": "noun",
      "explanation_en": "A banknote, a piece of paper money issued by a government or central bank.",
      "explanation_cn": "指由政府或中央银行发行的纸币。",
      "example_en": "He paid for the book with a fifty-dollar note.",
      "example_cn": "他用一张五十美元的纸币支付了这本书。"
    },
    {
      "pos": "noun",
      "explanation_en": "A comment or annotation added to a text, especially in academic or editorial contexts, to provide clarification or additional information.",
      "explanation_cn": "指在文本中添加的注释或评注，尤其在学术或编辑语境中，用于提供澄清或补充信息。",
      "example_en": "The editor added several footnotes to explain obscure references in the historical text.",
      "example_cn": "编辑在历史文本中添加了多个脚注，以解释其中晦涩的引用。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "memo",
      "analysis": "“Memo”（备忘录）通常指正式或半正式的内部书面沟通，用于组织或工作环境中传达指令或信息，结构更规范，目的更明确。而 “note” 更随意、简短，可用于个人或非正式场景。"
    },
    {
      "word_to_compare": "annotation",
      "analysis": "“Annotation”（注释）是学术或技术文本中系统性的解释性文字，通常更详尽、专业，常用于书籍、论文或代码中。而 “note” 可以是随手记录的简短内容，不一定具有学术严谨性。"
    },
    {
      "word_to_compare": "chord",
      "analysis": "“Chord”（和弦）是由多个音符同时发声构成的音乐组合，而 “note” 是单个音符。两者属于音乐术语中的不同层级：note 是基本单位，chord 是由多个 note 组成的结构。"
    },
    {
      "word_to_compare": "bill",
      "analysis": "“Bill”（钞票）在美式英语中常指纸币，与 “note”（英式英语中常用）意义相近，但 “bill” 更强调其作为支付工具的功能，而 “note” 在某些语境中还保留着‘书面记录’的含义，语义范围更广。"
    }
  ]
}