{
  "word": "notice",
  "pronunciation": "noh·tis",
  "concise_definition": "n. 通知, 注意, 常见; v. 注意到, 察觉, 通知",
  "forms": {
    "third_person_singular": "notices",
    "past_tense": "noticed",
    "past_participle": "noticed",
    "present_participle": "noticing",
    "plural": "notices"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A written or printed message informing people of something important, often posted publicly or sent officially.",
      "explanation_cn": "指以书面或印刷形式发布的重要信息，通常公开张贴或正式发送，用于告知公众或特定群体。",
      "example_en": "There was a notice on the door saying the library would close early today.",
      "example_cn": "门上贴着一张通知，说图书馆今天会提前关闭。"
    },
    {
      "pos": "noun",
      "explanation_en": "Attention or observation directed toward something, especially when it is unusual or significant.",
      "explanation_cn": "指对某事物的关注或觉察，尤其当该事物不寻常或具有重要意义时。",
      "example_en": "She didn't get much notice for her groundbreaking research until years later.",
      "example_cn": "她的开创性研究在多年后才引起人们的注意。"
    },
    {
      "pos": "verb",
      "explanation_en": "To become aware of something through the senses, especially when it is subtle or requires attention.",
      "explanation_cn": "指通过感官察觉到某事物，尤其当该事物较为细微或需要特别留意时。",
      "example_en": "Did you notice the slight change in his tone of voice?",
      "example_cn": "你注意到他语气的细微变化了吗？"
    },
    {
      "pos": "verb",
      "explanation_en": "To formally inform someone of something, often in writing or through an official announcement.",
      "explanation_cn": "指以书面或正式公告的形式通知某人某事。",
      "example_en": "The landlord gave the tenant two weeks' notice to vacate the apartment.",
      "example_cn": "房东通知租客在两周内搬离公寓。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "observe",
      "analysis": "“Observe” (观察) 强调有意识、系统性地使用感官或仪器来收集信息，常用于科学、学术或正式语境，带有更持久和深入的意味。而 “notice” 更偏向于偶然或瞬间的觉察，无需刻意投入精力。"
    },
    {
      "word_to_compare": "alert",
      "analysis": "“Alert” (警觉/提醒) 通常指主动发出警告或提醒，使他人注意到潜在危险或紧急情况，具有强烈的紧迫性和行动导向。而 “notice” 仅表示感知到某事，不包含提醒或干预的含义。"
    },
    {
      "word_to_compare": "announcement",
      "analysis": "“Announcement” (公告) 是一种正式发布的声明，通常由权威机构或组织发出，内容更广泛、更正式，且具有法律或程序效力。而 “notice” 虽也可正式，但更常用于简短、具体的信息传达，如告示、通知单等。"
    }
  ]
}