{
  "word": "nudge",
  "pronunciation": "nuj",
  "concise_definition": "v. 轻推, 暗示; n. 轻推, 暗示",
  "forms": {
    "third_person_singular": "nudges",
    "past_tense": "nudged",
    "past_participle": "nudged",
    "present_participle": "nudging"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To push someone or something slightly, often with the elbow or a gentle motion, to attract attention, prompt action, or convey a subtle hint.",
      "explanation_cn": "指用肘部或轻微的动作轻轻推某人或某物，以引起注意、促使行动或传达一种含蓄的暗示。",
      "example_en": "She nudged her friend to get his attention during the boring lecture.",
      "example_cn": "在枯燥的讲座中，她轻轻推了推朋友，想引起他的注意。"
    },
    {
      "pos": "verb",
      "explanation_en": "To influence someone's behavior or decision subtly, without force or direct instruction, often through small environmental changes or cues.",
      "explanation_cn": "指通过细微的环境改变或提示，以非强制、非直接指令的方式影响他人的行为或决策，常用于行为经济学中的‘助推’理论。",
      "example_en": "The government used a nudge by placing healthy food at eye level to encourage better eating habits.",
      "example_cn": "政府通过将健康食品放在视线水平位置来助推人们养成更好的饮食习惯。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slight physical push or movement, often intended to signal or prompt a reaction.",
      "explanation_cn": "指轻微的身体推动或移动，通常用于发出信号或引发反应。",
      "example_en": "He gave her a gentle nudge and whispered, 'It's your turn to speak.'",
      "example_cn": "他轻轻推了她一下，低声说：‘该你发言了。’"
    },
    {
      "pos": "noun",
      "explanation_en": "A subtle suggestion or indirect influence intended to guide someone toward a particular choice or behavior.",
      "explanation_cn": "指一种微妙的建议或间接影响，旨在引导某人做出特定选择或采取某种行为。",
      "example_en": "The new policy is a nudge toward sustainable living, not a mandatory regulation.",
      "example_cn": "这项新政策是对可持续生活方式的一种助推，而非强制性规定。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "push",
      "analysis": "“Push”（推）通常指更明显、更有力的推动，可能带有强制性或直接施压的意味；而 “nudge” 强调轻柔、间接、非侵入性的影响，常用于心理或行为层面的引导，而非物理力量。"
    },
    {
      "word_to_compare": "prompt",
      "analysis": "“Prompt”（促使）更侧重于通过明确的信号、提醒或指令激发行动，常用于技术或语言语境（如系统提示）；而 “nudge” 更强调无意识或潜移默化的影响，往往不直接说明意图，更隐蔽、更温和。"
    },
    {
      "word_to_compare": "hint",
      "analysis": "“Hint”（暗示）主要通过语言或间接信息传递意图，依赖听者解读；而 “nudge” 可以是物理动作，也可以是环境设计，其影响更偏向行为引导而非语义传达，常用于行为科学中的‘非语言干预’。"
    }
  ]
}