{
  "word": "numbers",
  "pronunciation": "nuhm·buhrz",
  "concise_definition": "n. 数字, 数量, 数目, 编号",
  "forms": {
    "singular": "number"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A mathematical object used to count, measure, and label, represented by symbols such as 1, 2, 3, etc., and forming the basis of arithmetic and quantitative reasoning.",
      "explanation_cn": "用于计数、测量和标记的数学对象，用符号如 1、2、3 等表示，是算术和定量推理的基础。",
      "example_en": "The number of students in the class has increased to thirty-five.",
      "example_cn": "班上的学生人数已增加到三十五人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A numerical identifier assigned to something for organization or reference, such as house numbers, phone numbers, or jersey numbers.",
      "explanation_cn": "为便于组织或识别而分配给某物的数字编号，如门牌号、电话号码或球衣号码。",
      "example_en": "Please call me at my office number: 555-1234.",
      "example_cn": "请拨打我的办公室号码：555-1234。"
    },
    {
      "pos": "noun",
      "explanation_en": "A performance or routine, especially in entertainment, such as a musical number or a dance number.",
      "explanation_cn": "指娱乐表演中的一个节目或段落，如一首歌曲、一段舞蹈。",
      "example_en": "The highlight of the show was a dazzling dance number performed by the troupe.",
      "example_cn": "演出的亮点是剧团表演的一段精彩舞蹈节目。"
    },
    {
      "pos": "noun",
      "explanation_en": "An abstract concept representing quantity or magnitude, often used in statistics, science, and finance to express values or trends.",
      "explanation_cn": "指在统计学、科学和金融中用于表达数值或趋势的抽象数量概念。",
      "example_en": "The latest numbers show a 12% rise in unemployment rates.",
      "example_cn": "最新数据显示失业率上升了12%。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "numerals",
      "analysis": "“Numerals”（数字符号）特指表示数字的符号本身，如阿拉伯数字“1、2、3”或罗马数字“I、II、III”，是数字的书写形式；而 “numbers” 指的是这些符号所代表的抽象概念或实际数量，更侧重于语义而非形式。"
    },
    {
      "word_to_compare": "amount",
      "analysis": "“Amount”（数量）通常用于不可数名词，如水、金钱，强调总量而非具体数字；而 “numbers” 多用于可数事物，强调具体的数值或个体计数。例如：a large amount of water（大量水） vs. a high number of people（大量的人）。"
    },
    {
      "word_to_compare": "figures",
      "analysis": "“Figures”（数字、数据）常用于正式语境，指统计或财务数据，有时可与 “numbers” 互换，但更强调数据的呈现形式（如图表、报表）；而 “numbers” 更通用，涵盖从基本计数到抽象数学概念的广泛含义。"
    }
  ]
}