{
  "word": "numb",
  "pronunciation": "nuhm",
  "concise_definition": "adj. 麻木的, 无感觉的; v. 使麻木, 使迟钝",
  "forms": {
    "third_person_singular": "numbs",
    "past_tense": "numbed",
    "past_participle": "numbed",
    "present_participle": "numbing"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Lacking physical sensation or feeling, often due to cold, injury, or anesthesia; unable to perceive touch, pain, or temperature normally.",
      "explanation_cn": "因寒冷、受伤或麻醉而失去身体感觉，无法正常感知触觉、疼痛或温度。",
      "example_en": "Her fingers were numb from the freezing wind.",
      "example_cn": "她的手指被寒风冻得麻木了。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Emotionally unresponsive or detached; unable to feel or express emotions due to shock, trauma, or prolonged stress.",
      "explanation_cn": "情感上无反应或疏离，因震惊、创伤或长期压力而无法感受或表达情绪。",
      "example_en": "After the accident, he was numb with grief and couldn't cry.",
      "example_cn": "事故发生后，他因悲痛而麻木，连哭都哭不出来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause someone to lose physical sensation, typically through cold, pressure, or medication.",
      "explanation_cn": "通过寒冷、压力或药物使某人失去身体感觉。",
      "example_en": "The local anesthetic numbed the area before the dentist began the procedure.",
      "example_cn": "牙医在开始治疗前用局部麻醉剂使该区域麻木。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause someone to become emotionally insensitive or unresponsive, often as a defense mechanism against pain or distress.",
      "explanation_cn": "使某人变得情感迟钝或无反应，通常作为一种应对痛苦或压力的防御机制。",
      "example_en": "The constant noise of the city numbed her to the suffering around her.",
      "example_cn": "城市的持续喧嚣使她对周围的苦难变得麻木。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tingle",
      "analysis": "“Tingle” (刺痛感) 指一种轻微、短暂、针刺般的感官反应，常伴随血液循环恢复或神经刺激，是感觉正在恢复的信号。而 “numb” 表示完全缺乏感觉，是感官功能的抑制或丧失，两者状态相反。"
    },
    {
      "word_to_compare": "insensitive",
      "analysis": "“Insensitive” (迟钝的/无同情心的) 通常用于描述人对他人情感或社会规范缺乏反应或关心，带有道德或性格评价色彩。而 “numb” 更侧重于生理或心理上的被动状态，不一定是性格缺陷，可能是创伤或环境导致的暂时反应。"
    },
    {
      "word_to_compare": "paralyze",
      "analysis": "“Paralyze” (使瘫痪) 指完全丧失运动能力或功能，常涉及肌肉或神经系统严重受损，是生理层面的彻底失效。而 “numb” 仅指感觉丧失，运动能力可能仍保留，如手脚麻木但仍能移动。"
    }
  ]
}