{
  "word": "nursery",
  "pronunciation": "nur·se·ree",
  "concise_definition": "n. 托儿所, 苗圃, 育儿室",
  "forms": {
    "plural": "nurseries"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A place where young children are cared for during the day while their parents are at work, typically staffed by trained caregivers and providing structured activities for early development.",
      "explanation_cn": "指父母上班期间照看幼儿的场所，通常由受过训练的保育人员管理，并提供促进儿童早期发展的结构化活动。",
      "example_en": "The children go to nursery every morning from 8 a.m. to 4 p.m.",
      "example_cn": "孩子们每天早上8点到下午4点都在托儿所。"
    },
    {
      "pos": "noun",
      "explanation_en": "A place where plants, especially young trees or flowers, are grown and nurtured before being transplanted elsewhere, often for commercial or landscaping purposes.",
      "explanation_cn": "指培育幼苗（尤其是树木或花卉）的地方，待其成长后再移植到其他地方，常用于商业种植或园林绿化。",
      "example_en": "The garden center sources its roses from a local nursery.",
      "example_cn": "这个园艺中心的玫瑰来自一家本地苗圃。"
    },
    {
      "pos": "noun",
      "explanation_en": "A room in a house designated for the care and sleeping of an infant or young child, often equipped with a crib, changing table, and child-safe furnishings.",
      "explanation_cn": "指住宅中专为婴儿或幼儿提供照料和睡眠的房间，通常配备婴儿床、换尿布台和儿童安全家具。",
      "example_en": "They painted the nursery a soft blue and installed a cozy rocking chair.",
      "example_cn": "他们把育儿室刷成了柔和的蓝色，并安放了一把舒适的摇椅。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "daycare",
      "analysis": "“Daycare”（日托中心）与 “nursery” 在照顾幼儿方面高度重叠，但 “daycare” 更强调全天候的托管服务，涵盖年龄范围更广（通常包括学龄前儿童），且可能更偏重看护而非教育；而 “nursery” 常带有更强的早期教育和发育支持色彩，尤其在英式英语中更常用。"
    },
    {
      "word_to_compare": "greenhouse",
      "analysis": "“Greenhouse”（温室）是用于在受控环境中培育植物的结构，主要功能是保温和调节气候，通常不涉及植物的长期培育或移植准备。而 “nursery”（苗圃）不仅提供生长环境，还包含育苗、移栽、分级等系统性园艺流程，更侧重于植物的生命周期管理。"
    },
    {
      "word_to_compare": "crèche",
      "analysis": "“Crèche”（婴儿室）是 “nursery” 的同义词，尤其在法语影响较强的地区或正式语境中使用，多指临时性的婴儿看护场所，如在剧院、会议中心或医院内设置的临时托婴室。而 “nursery” 更常用于长期、常规性的儿童照护机构，语义范围更广。"
    }
  ]
}