{
  "word": "nurse",
  "pronunciation": "nurs",
  "concise_definition": "n. 护士, 照顾者; v. 护理, 照料",
  "forms": {
    "third_person_singular": "nurses",
    "past_tense": "nursed",
    "past_participle": "nursed",
    "present_participle": "nursing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A trained professional who provides medical care and support to patients in hospitals, clinics, or homes, often under the supervision of a physician.",
      "explanation_cn": "指在医院、诊所或家中为病人提供医疗护理与支持的受过专业训练的人员，通常在医生指导下工作。",
      "example_en": "The nurse checked the patient's vital signs every hour.",
      "example_cn": "护士每小时检查一次病人的生命体征。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that nurtures, protects, or fosters the growth or development of something, often metaphorically.",
      "explanation_cn": "指以比喻方式滋养、保护或促进某事物成长或发展的人或事物，如‘自然的摇篮’或‘文化的培育者’。",
      "example_en": "The river valley has been a nurse of civilizations for thousands of years.",
      "example_cn": "这条河谷几千年来一直是文明的摇篮。"
    },
    {
      "pos": "verb",
      "explanation_en": "To care for someone who is ill, injured, or weak, often with patience and attention to detail.",
      "explanation_cn": "指耐心细致地照料病人、伤者或体弱者。",
      "example_en": "She nursed her father through his long illness.",
      "example_cn": "她悉心照料病重的父亲度过了漫长的病期。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hold or carry something gently, often to soothe or protect it, especially in the context of breastfeeding or emotional comfort.",
      "explanation_cn": "指轻柔地抱着或托着某物，常用于哺乳或提供情感安慰的情境。",
      "example_en": "He nursed the baby in his arms until it fell asleep.",
      "example_cn": "他抱着婴儿直到它睡着。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "caregiver",
      "analysis": "“Caregiver”（照料者）是一个更广泛、更中性的术语，泛指任何为他人提供日常照料的人，包括家人、朋友或专业人员，不特指医疗背景。而 “nurse” 强调专业医疗训练和临床职责，具有职业身份的特定性。"
    },
    {
      "word_to_compare": "attendant",
      "analysis": "“Attendant”（看护者）通常指提供基本协助或服务的人，如在医院或公共场所协助行动不便者，但不一定具备医疗技能。而 “nurse” 必须经过专业培训，能执行医疗操作，如注射、换药等，职责更专业、更深入。"
    },
    {
      "word_to_compare": "tend",
      "analysis": "“Tend”（照料）是一个更通用的动词，可指照料植物、动物或人，语气较温和，不强调专业性或持续性。而 “nurse” 作为动词时，隐含更长时间、更细致、更富同情心的护理过程，常用于严重病患或康复阶段。"
    }
  ]
}