{
  "word": "nursing",
  "pronunciation": "nur·sing",
  "concise_definition": "n. 护理, 抚养; v. 护理, 照料, 哺乳",
  "forms": {
    "noun": "nursing",
    "verb_third_person_singular": "nurses",
    "verb_past_tense": "nursed",
    "verb_past_participle": "nursed",
    "verb_present_participle": "nursing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The profession or practice of providing care for the sick, injured, or infirm, typically performed by trained professionals called nurses, involving monitoring health, administering treatment, and offering emotional support.",
      "explanation_cn": "指为病人、伤者或体弱者提供护理的专业或实践，通常由受过训练的护士执行，包括监测健康状况、实施治疗和提供情感支持。",
      "example_en": "She pursued a career in nursing after graduating from medical school.",
      "example_cn": "她从医学院毕业后选择了护理作为职业。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of feeding an infant with breast milk or formula, often involving close physical contact and bonding between caregiver and child.",
      "explanation_cn": "指用母乳或配方奶喂养婴儿的行为，通常伴随着照顾者与婴儿之间的亲密身体接触和情感联结。",
      "example_en": "Breastfeeding is encouraged for the first six months of a baby's life as optimal nursing.",
      "example_cn": "建议在婴儿出生后的前六个月进行母乳喂养，这是最理想的哺乳方式。"
    },
    {
      "pos": "verb",
      "explanation_en": "To care for someone who is ill, injured, or weak, often over an extended period, with attention to their physical and emotional needs.",
      "explanation_cn": "指长期照料病患、伤者或体弱者，关注其身体和情感需求。",
      "example_en": "He nursed his mother through her long illness with patience and devotion.",
      "example_cn": "他耐心而虔诚地照料了母亲漫长的病程。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hold or cradle something gently, especially in the arms, often implying protection or careful handling.",
      "explanation_cn": "指温柔地抱着或托着某物，尤其指用双臂抱着，常暗示保护或小心对待。",
      "example_en": "She nursed the injured bird in her hands until it could fly again.",
      "example_cn": "她用手托着这只受伤的鸟，直到它能再次飞翔。"
    },
    {
      "pos": "verb",
      "explanation_en": "To drink slowly or sip, especially in a relaxed or deliberate manner.",
      "explanation_cn": "指缓慢地啜饮，尤其以放松或刻意的方式。",
      "example_en": "They nursed their coffee for hours, talking quietly by the window.",
      "example_cn": "他们坐在窗边，慢慢啜饮着咖啡，轻声交谈了几个小时。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "care",
      "analysis": "“Care” (照料) 是一个更广泛、更通用的词，涵盖任何类型的关心或照顾，包括情感支持、日常协助或监护，不限于医疗或身体需求。而 “nursing” 特指专业或持续性的医疗护理，常涉及医学技能和临床操作，语义范围更窄、更专业。"
    },
    {
      "word_to_compare": "tend",
      "analysis": "“Tend” (照料/看护) 强调定期或持续地关注某人或某物，常用于植物、动物或病人，语气较温和，不一定需要专业训练。而 “nursing” 更强调系统性、专业性和情感投入，尤其在医疗语境中具有制度性含义。"
    },
    {
      "word_to_compare": "breastfeed",
      "analysis": "“Breastfeed” (母乳喂养) 是 “nursing” 在婴儿喂养语境下的一个具体子义项，专指母亲用乳房喂养婴儿。而 “nursing” 作为动词或名词时，含义更广，既可指母乳喂养，也可指对病人或伤者的全面护理，甚至可引申为“啜饮”。"
    }
  ]
}