{
  "word": "nurtured",
  "pronunciation": "nur·cherd",
  "concise_definition": "v. 培养, 抚育, 滋养",
  "forms": {
    "base_form": "nurture",
    "third_person_singular": "nurtures",
    "past_tense": "nurtured",
    "past_participle": "nurtured",
    "present_participle": "nurturing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To care for and encourage the growth or development of someone or something, especially over a long period, often with emotional support, guidance, and resources.",
      "explanation_cn": "指长期给予关爱、支持与资源，以促进某人或某物的成长与发展，常包含情感上的抚育与引导。",
      "example_en": "She nurtured her children with love and patience, helping them become confident adults.",
      "example_cn": "她以爱与耐心抚育孩子，帮助他们成长为自信的成年人。"
    },
    {
      "pos": "verb",
      "explanation_en": "To foster the development of an idea, skill, or relationship by providing the right conditions and consistent attention.",
      "explanation_cn": "指通过提供适宜的环境与持续关注，促进某种想法、技能或关系的培育与发展。",
      "example_en": "The mentor nurtured his protégé’s talent by offering regular feedback and opportunities to lead.",
      "example_cn": "导师通过定期反馈和提供领导机会，培养了弟子的才能。"
    },
    {
      "pos": "verb",
      "explanation_en": "To sustain or maintain something in a healthy or thriving state, often by providing nourishment or protection.",
      "explanation_cn": "指通过提供养分或保护，使某物保持健康或繁荣的状态。",
      "example_en": "The fertile soil nurtured the crops through the dry season.",
      "example_cn": "肥沃的土壤在干旱季节滋养了庄稼。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "raised",
      "analysis": "“Raised” (抚养) 通常用于描述将孩子养育成人，强调从幼年到成年的全过程，尤其侧重于日常照料和纪律。而 “nurtured” 更强调情感支持、鼓励与内在潜能的激发，适用范围更广，可用于思想、技能或关系的培育。"
    },
    {
      "word_to_compare": "fostered",
      "analysis": "“Fostered” (促进/培育) 与 “nurtured” 非常接近，常可互换，但 “fostered” 更常用于制度性或临时性的支持环境，如寄养家庭、政策扶持等，带有一定外部干预的意味；而 “nurtured” 更强调持续、亲密、充满关怀的个人化过程。"
    },
    {
      "word_to_compare": "cultivated",
      "analysis": "“Cultivated” (培养) 常用于抽象事物，如修养、关系、品味，带有刻意经营、精心雕琢的意味，常用于上层社会或学术语境。而 “nurtured” 更温暖、更自然，强调生命体或情感的内在成长，更具人情味。"
    }
  ]
}