{
  "word": "nuts",
  "pronunciation": "nuhts",
  "concise_definition": "n. 坚果, 木匠的螺母; adj. 疯狂的, 着迷的",
  "forms": {
    "singular": "nut"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A hard-shelled seed or fruit, typically with an edible kernel, such as an almond, walnut, or peanut; often used in cooking and snacking.",
      "explanation_cn": "指一种外壳坚硬、内含可食用果仁的种子或果实，如杏仁、核桃或花生；常用于烹饪和零食。",
      "example_en": "She added a handful of chopped walnuts to the salad for extra crunch.",
      "example_cn": "她往沙拉里加了一把切碎的核桃，增加口感。"
    },
    {
      "pos": "noun",
      "explanation_en": "A fastener with a threaded hole, typically used with a bolt to secure two or more parts together in mechanical applications.",
      "explanation_cn": "一种带有内螺纹的紧固件，通常与螺栓配合使用，以固定两个或多个机械部件。",
      "example_en": "The mechanic tightened the nuts on the wheel to ensure safety.",
      "example_cn": "机械师拧紧了车轮上的螺母以确保安全。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Informal term describing someone who is crazy, eccentric, or mentally unstable; often used humorously or affectionately.",
      "explanation_cn": "非正式用语，形容某人疯狂、古怪或精神不稳定；常用于幽默或亲昵的语境。",
      "example_en": "He’s completely nuts if he thinks he can win the race without training.",
      "example_cn": "他要是以为不训练就能赢比赛，那真是疯了。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Extremely enthusiastic or obsessed about something; often used in phrases like 'nuts about' or 'nuts over'.",
      "explanation_cn": "对某事物极度热衷或着迷；常用于短语如 'nuts about' 或 'nuts over'。",
      "example_en": "She’s nuts about classical music and attends concerts every weekend.",
      "example_cn": "她对古典音乐着了迷，每个周末都去听音乐会。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "seeds",
      "analysis": "“Seeds”（种子）泛指植物繁殖的最小单位，不一定有坚硬外壳或可食用果仁，如向日葵籽、南瓜籽。而 “nuts” 特指外壳坚硬、果仁可食的植物果实，如核桃、杏仁，且常被归为“坚果类”食品。"
    },
    {
      "word_to_compare": "bolts",
      "analysis": "“Bolts”（螺栓）是与 “nuts”（螺母）配套使用的紧固件，螺栓有外螺纹，螺母有内螺纹。两者常并列出现，但 “nuts” 专指螺母部分，而 “bolts” 是主动穿入的杆状部件。"
    },
    {
      "word_to_compare": "crazy",
      "analysis": "“Crazy”（疯狂的）是更通用的形容词，可形容情绪、行为或精神状态，语义范围更广；而 “nuts” 是更口语化、俚语化的表达，语气更轻松甚至带点幽默，常用于非正式场合，如 ‘You’re nuts!’ 比 ‘You’re crazy!’ 更具口语色彩。"
    }
  ]
}