{
  "word": "obsession",
  "pronunciation": "ob·sesh·uhn",
  "concise_definition": "n. 着迷, 痴迷, 强迫性想法",
  "forms": {
    "plural": "obsessions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A persistent and overwhelming preoccupation with a particular idea, person, or activity, often to the point of disrupting normal functioning or mental well-being.",
      "explanation_cn": "指对某个特定想法、人或活动持续且强烈的沉迷，常常达到干扰正常生活或心理健康的程度。",
      "example_en": "His obsession with perfection made it impossible for him to finish any project.",
      "example_cn": "他对完美的痴迷使他无法完成任何项目。"
    },
    {
      "pos": "noun",
      "explanation_en": "A fixed idea or thought that repeatedly intrudes into a person's mind, often associated with obsessive-compulsive disorder (OCD), but can also describe intense non-clinical fixation.",
      "explanation_cn": "指反复侵入人脑的固定想法或念头，常与强迫症（OCD）相关，但也用于描述非临床性的强烈执念。",
      "example_en": "She had an obsession with checking the door lock ten times before bed.",
      "example_cn": "她每晚睡觉前都要反复检查门锁十次，对此着迷不已。"
    },
    {
      "pos": "noun",
      "explanation_en": "An intense and all-consuming interest or passion, sometimes used in a less pathological context to describe deep enthusiasm.",
      "explanation_cn": "指一种强烈且全神贯注的兴趣或热情，有时在非病理语境中用于形容极度热衷的事物。",
      "example_en": "Her obsession with vintage cameras led her to collect over two hundred models.",
      "example_cn": "她对复古相机的痴迷使她收藏了两百多台。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "passion",
      "analysis": "“Passion”（热情）指强烈而积极的情感投入，通常带有建设性、创造性或愉悦感，如对艺术、运动的热爱。而 “obsession” 更强调失控、强迫和侵入性，常伴随焦虑或功能损害，情感色彩更负面。"
    },
    {
      "word_to_compare": "fixation",
      "analysis": "“Fixation”（固着）在心理学中指对某物或某人持续的、非理性的关注，常用于描述童年心理发展阶段的残留倾向。它比 “obsession” 更中性，不一定伴随痛苦或行为干扰；而 “obsession” 更常用于描述当前的、干扰性的思维循环。"
    },
    {
      "word_to_compare": "addiction",
      "analysis": "“Addiction”（成瘾）通常指对物质（如药物、酒精）或行为（如赌博、上网）的生理或心理依赖，强调行为的重复性和戒断反应。而 “obsession” 更侧重于思维层面的反复侵入，不一定伴随外显行为或生理依赖，但常与成瘾共存。"
    }
  ]
}