{
  "word": "obsessive",
  "pronunciation": "uhb·sehs·iv",
  "concise_definition": "adj. 着迷的, 强迫性的, 过度专注的",
  "forms": {
    "comparative": "more obsessive",
    "superlative": "most obsessive",
    "adverb": "obsessively"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Characterized by persistent and unwanted thoughts or impulses that dominate a person's mind, often leading to compulsive behaviors; typically associated with obsessive-compulsive tendencies.",
      "explanation_cn": "指被持续且不受欢迎的想法或冲动所占据，常导致强迫性行为；通常与强迫症倾向相关。",
      "example_en": "He has an obsessive need to check the locks on every door before leaving the house.",
      "example_cn": "他有一种强迫性的需求，每次离家前都要检查每一扇门的锁。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Exhibiting excessive or unhealthy fixation on a particular subject, person, or activity, often to the detriment of other aspects of life.",
      "explanation_cn": "对某一特定主题、人物或活动表现出过度或不健康的沉迷，常常损害生活的其他方面。",
      "example_en": "Her obsessive focus on perfection made it difficult for her to finish any project.",
      "example_cn": "她对完美的过度执着使她难以完成任何项目。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used to describe behavior or attitudes that are intensely preoccupied or fixated, sometimes in a way that seems irrational or extreme.",
      "explanation_cn": "用于描述一种极度专注或执念的行为或态度，有时显得非理性或极端。",
      "example_en": "The fan's obsessive collection of celebrity memorabilia filled an entire room.",
      "example_cn": "这位粉丝对名人纪念品的痴迷收藏占满了整整一个房间。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "compulsive",
      "analysis": "“Compulsive”（强迫性的）强调行为的不可控性，通常指因内在压力而重复进行某种动作，如反复洗手、检查。它更侧重于行为表现，而 “obsessive” 更强调思维层面的侵入性念头。两者常同时出现，但 “obsessive” 是心理内容，”compulsive“ 是外在行为。"
    },
    {
      "word_to_compare": "fixated",
      "analysis": "“Fixated”（固着的）指对某事物长期专注或难以转移注意力，但不一定带有焦虑或病理性质。它比 “obsessive” 程度更轻，常用于描述兴趣或偏好，如孩子对某动画片的 fixated 爱好。而 “obsessive” 暗示了心理负担和功能损害。"
    },
    {
      "word_to_compare": "fanatical",
      "analysis": "“Fanatical”（狂热的）指对信仰、事业或观点表现出极端、非理性的热情，常带有意识形态或宗教色彩。它强调的是激情和忠诚，而 “obsessive” 更强调内心的困扰和重复性思维，不一定涉及信仰或立场。"
    }
  ]
}