{
  "word": "occult",
  "pronunciation": "uh·kult",
  "concise_definition": "adj. 神秘的, 超自然的; n. 奥秘, 超自然现象",
  "forms": {
    "comparative": "more occult",
    "superlative": "most occult",
    "plural": "occults"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to practices, phenomena, or knowledge that are beyond scientific understanding and often associated with magic, spirits, or hidden forces of nature.",
      "explanation_cn": "指与超越科学理解的实践、现象或知识相关，通常涉及魔法、灵体或自然界的隐秘力量。",
      "example_en": "The ancient manuscript contained occult symbols believed to summon spirits.",
      "example_cn": "这本古籍中包含着被认为能召唤灵体的神秘符号。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Not openly displayed; hidden, secret, or concealed from ordinary perception or knowledge.",
      "explanation_cn": "指未公开显露的；隐藏的、秘密的，或超出普通感知与认知范围的。",
      "example_en": "He had an occult influence over the political decisions of the court.",
      "example_cn": "他对宫廷的政治决策有着一种隐秘的影响力。"
    },
    {
      "pos": "noun",
      "explanation_en": "The study or practice of supernatural forces, including magic, astrology, alchemy, and divination; collectively, the body of beliefs and rituals associated with such practices.",
      "explanation_cn": "指对超自然力量的研究或实践，包括魔法、占星术、炼金术和占卜；泛指与这些实践相关的信仰与仪式体系。",
      "example_en": "She devoted her life to the study of the occult and wrote several books on esoteric traditions.",
      "example_cn": "她毕生致力于研究神秘学，并撰写了多部关于隐秘传统的著作。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mystical",
      "analysis": "“Mystical”（神秘的）强调与神圣、灵性或超越性体验相关的主观感受，常用于宗教或哲学语境，如“神秘体验”。而 “occult” 更侧重于具体的超自然实践、仪式或隐藏知识，具有更强的实操性和系统性。"
    },
    {
      "word_to_compare": "esoteric",
      "analysis": "“Esoteric”（深奥的）指仅限于少数有特殊知识或训练的人理解的内容，强调知识的排他性和门槛，但不一定涉及超自然。而 “occult” 必然包含超自然或神秘力量的元素，范围更窄但更具体。"
    },
    {
      "word_to_compare": "supernatural",
      "analysis": "“Supernatural”（超自然的）是一个更宽泛的术语，泛指违反自然法则的现象，如鬼魂、神迹等。而 “occult” 是其子集，特指人类主动研究、运用或操控这些力量的体系与实践，如巫术、符咒等。"
    }
  ]
}