{
  "word": "oculus",
  "pronunciation": "oh·kew·luhs",
  "concise_definition": "n. 眼睛, 圆形开口, 瞭望孔",
  "forms": {
    "plural": "oculi"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The eye, especially in a literal or poetic sense, often used in classical or anatomical contexts to refer to the organ of sight.",
      "explanation_cn": "眼睛，尤其在字面或诗意语境中使用，常用于古典或解剖学语境中指代视觉器官。",
      "example_en": "In ancient Roman art, the oculus of the god was depicted as all-seeing and wise.",
      "example_cn": "在古罗马艺术中，神的眼睛被描绘为全知而睿智。"
    },
    {
      "pos": "noun",
      "explanation_en": "A circular opening, especially in the dome of a building, designed to admit light and air; commonly found in classical and Renaissance architecture.",
      "explanation_cn": "一种圆形开口，尤其指建筑物穹顶上的开口，用于引入光线和空气；常见于古典和文艺复兴时期的建筑中。",
      "example_en": "The Pantheon in Rome features a famous oculus at the top of its dome, allowing sunlight to stream into the interior.",
      "example_cn": "罗马的万神殿在其穹顶顶部有一个著名的圆形天窗，使阳光倾泻而入。"
    },
    {
      "pos": "noun",
      "explanation_en": "In modern technology, a small circular lens or sensor used in virtual reality headsets to track eye movement or provide immersive visual input.",
      "explanation_cn": "在现代科技中，指虚拟现实头盔中用于追踪眼球运动或提供沉浸式视觉输入的小型圆形镜头或传感器。",
      "example_en": "The Oculus Quest 2 headset uses advanced ocular sensors to enhance user interaction in virtual environments.",
      "example_cn": "Oculus Quest 2 头盔使用先进的眼部传感器，以增强用户在虚拟环境中的互动体验。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "eye",
      "analysis": "“Eye” 是最通用的词，泛指所有生物的视觉器官，日常使用广泛。而 “oculus” 更具学术性、文学性或建筑学语境中的正式用法，常用于强调其古典或象征意义，而非日常交流。"
    },
    {
      "word_to_compare": "aperture",
      "analysis": "“Aperture” (孔径) 是一个更广泛的术语，指任何允许光线或物质通过的开口，形状可以是圆形、方形或其他。而 “oculus” 特指圆形的开口，尤其在建筑中具有特定美学和功能传统，语义范围更窄、更专指。"
    },
    {
      "word_to_compare": "lens",
      "analysis": "“Lens” (透镜) 是一种光学元件，用于聚焦或折射光线，通常有曲面结构，用于眼镜、相机等设备中。而 “oculus” 在科技语境中虽可指传感器，但本质上是开口或观察窗口，不一定具备光学聚焦功能，其核心是“观察孔”而非“光学元件”。"
    }
  ]
}