{
  "word": "offer",
  "pronunciation": "of·fer",
  "concise_definition": "v. 提供, 提议, 出价; n. 提供, 提议, 优惠",
  "forms": {
    "third_person_singular": "offers",
    "past_tense": "offered",
    "past_participle": "offered",
    "present_participle": "offering"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To present something for acceptance or rejection, such as a proposal, service, or item, often with the intention of helping or benefiting someone.",
      "explanation_cn": "指提出某事物供他人接受或拒绝，如建议、服务或物品，通常带有帮助或使对方受益的意图。",
      "example_en": "The university offers scholarships to international students.",
      "example_cn": "这所大学为国际学生提供奖学金。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a bid or propose a price for something, especially in a competitive or commercial context.",
      "explanation_cn": "指在竞争性或商业环境中对某物提出报价或出价。",
      "example_en": "Three companies offered different prices for the contract.",
      "example_cn": "三家公司为这份合同提出了不同的报价。"
    },
    {
      "pos": "noun",
      "explanation_en": "A proposal or arrangement presented to someone, often with favorable terms, such as a job, deal, or discount.",
      "explanation_cn": "指向某人提出的建议或安排，通常带有优惠条件，如工作机会、交易或折扣。",
      "example_en": "She received a job offer from a top tech firm.",
      "example_cn": "她收到了一家顶尖科技公司的录用通知。"
    },
    {
      "pos": "noun",
      "explanation_en": "An act of presenting something voluntarily, especially something desirable or helpful, without being asked.",
      "explanation_cn": "指自愿提供某物，尤其是令人向往或有帮助的事物，而不被要求。",
      "example_en": "His offer to help with the move was greatly appreciated.",
      "example_cn": "他主动提出帮忙搬家，这得到了大家的衷心感谢。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "propose",
      "analysis": "“Propose” (提议) 更侧重于正式或理性地提出一个计划、想法或方案，常用于会议、谈判或学术语境，语气较中性或严肃。而 “offer” 更强调主动提供某种具体利益或服务，带有给予或帮助的意味，情感色彩更积极。"
    },
    {
      "word_to_compare": "supply",
      "analysis": "“Supply” (供应) 强调从资源或商品角度提供所需物品，通常是持续性、系统性的行为，如供应链中的物资供应。而 “offer” 更强调一次性、意愿性的提供，可能包含选择权（对方可接受或拒绝），不一定是实物。"
    },
    {
      "word_to_compare": "extend",
      "analysis": "“Extend” (伸出/给予) 常用于抽象事物的给予，如“extend an offer”（发出提议）、“extend an invitation”（发出邀请），与 “offer” 在某些语境中可互换，但 “extend” 更正式，且常隐含“主动伸出”的动作意象，而 “offer” 更直接、口语化。"
    }
  ]
}