{
  "word": "offices",
  "pronunciation": "of·fis·iz",
  "concise_definition": "n. 办公室, 职务, 职责, 服务",
  "forms": {
    "singular": "office"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A room, set of rooms, or building where administrative, professional, or business work is conducted.",
      "explanation_cn": "指进行行政、专业或商业工作的房间、一组房间或建筑物。",
      "example_en": "She works in a modern office building downtown.",
      "example_cn": "她在市中心的一座现代化办公楼里工作。"
    },
    {
      "pos": "noun",
      "explanation_en": "A position of authority, responsibility, or service within an organization or government, often held for a specific term.",
      "explanation_cn": "指在组织或政府中担任的具有权威、责任或服务性质的职位，通常有特定任期。",
      "example_en": "He held several public offices before becoming mayor.",
      "example_cn": "他在成为市长之前曾担任过多个公职。"
    },
    {
      "pos": "noun",
      "explanation_en": "A duty or function performed, especially one of a formal or ceremonial nature.",
      "explanation_cn": "指履行的职责或功能，尤指具有正式或礼仪性质的职责。",
      "example_en": "The president performed the ceremonial offices of state.",
      "example_cn": "总统履行了国家仪式性的职责。"
    },
    {
      "pos": "noun",
      "explanation_en": "Acts of kindness or service rendered to others, especially in a religious or charitable context.",
      "explanation_cn": "指为他人所行的善举或服务，尤指在宗教或慈善语境中。",
      "example_en": "The church provides offices for the poor and elderly in the community.",
      "example_cn": "这座教堂为社区中的穷人和老人提供服务。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "workspace",
      "analysis": "“Workspace”（工作空间）泛指任何用于工作的物理或虚拟环境，强调功能性和使用场景，不必然包含管理或职务含义。而 “office” 通常指有组织结构、正式职能的场所或职位，更具制度性。"
    },
    {
      "word_to_compare": "position",
      "analysis": "“Position”（职位）更侧重于一个人在组织层级中的相对地位或角色，可抽象使用（如“我在这个团队中的位置”）。而 “office” 强调该职位所附带的正式权力、职责或公共职能，常用于政府或机构语境。"
    },
    {
      "word_to_compare": "role",
      "analysis": "“Role”（角色）强调行为模式或社会功能，常用于心理学、戏剧或社会学语境，具有高度抽象性。而 “office” 是制度化的实体，通常有明确的头衔、权限和工作内容，如‘市长办公室’。"
    }
  ]
}