{
  "word": "offshore",
  "pronunciation": "of·shore",
  "concise_definition": "adj. 海外的, 远洋的; adv. 在海上, 向海外; n. 远洋作业区",
  "forms": {
    "comparative": "offshorer",
    "superlative": "offshorest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Located or operating in a country other than one's own, especially in a jurisdiction with lower taxes or less regulation, often used in financial or business contexts.",
      "explanation_cn": "指位于本国以外的国家，通常用于金融或商业语境，指在税收较低或监管较宽松的司法管辖区进行的活动。",
      "example_en": "The company moved its headquarters offshore to reduce its tax burden.",
      "example_cn": "该公司将总部迁至海外以降低税负。"
    },
    {
      "pos": "adverb",
      "explanation_en": "At or to a location out at sea, away from the coast; often referring to activities such as drilling, fishing, or transportation conducted in marine environments.",
      "explanation_cn": "指在海上、远离海岸的位置，常用于描述在海洋环境中进行的钻探、捕鱼或运输等活动。",
      "example_en": "The oil rig is operating offshore, about 50 miles from the coastline.",
      "example_cn": "这个石油钻井平台正在距海岸约50英里的海上作业。"
    },
    {
      "pos": "noun",
      "explanation_en": "A region or area located offshore, especially one used for industrial or commercial activities such as oil extraction or wind energy generation.",
      "explanation_cn": "指位于海上的区域，尤指用于石油开采、风能发电等工业或商业活动的海域。",
      "example_en": "The government is investing heavily in offshore development to boost renewable energy production.",
      "example_cn": "政府正大力投资海上开发，以促进可再生能源生产。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "overseas",
      "analysis": "“Overseas”（海外的）泛指任何位于海洋另一侧的国家或地区，强调地理上的跨海属性，常用于移民、贸易或旅游语境。而 “offshore” 更侧重于“在海上”或“在境外的金融/工业活动”，具有更强的经济或操作性含义，常与避税、离岸金融或海上工程直接关联。"
    },
    {
      "word_to_compare": "foreign",
      "analysis": "“Foreign”（外国的）是一个广义词，泛指任何不属于本国的事物，如外国法律、外国文化等，不涉及地理位置是否临海。而 “offshore” 通常隐含“通过海洋与本国分隔”这一空间特征，且多用于经济、法律或工程领域，语义范围更窄、更专业。"
    },
    {
      "word_to_compare": "marine",
      "analysis": "“Marine”（海洋的）强调与海洋生态系统、生物或环境直接相关，如 marine biology（海洋生物学）。而 “offshore” 虽然也涉及海洋，但更侧重于人类在海洋中的经济或技术活动（如钻井、风电），而非自然属性。两者语义焦点不同：marine 是自然属性，offshore 是人为活动。"
    }
  ]
}