{
  "word": "old",
  "pronunciation": "ōld",
  "concise_definition": "adj. 年老的, 旧的, 长期的, 以前的",
  "forms": {
    "comparative": "older",
    "superlative": "oldest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having lived for a long time; having existed for a considerable period, often implying advanced age or wear.",
      "explanation_cn": "指活了很长时间，或存在了相当长的时期，常暗示年龄较大或已磨损、陈旧。",
      "example_en": "My grandfather is an old man who remembers life before the internet.",
      "example_cn": "我祖父是一位老人，记得互联网出现之前的生活。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Not new; having been used, owned, or existed for a long time, often implying deterioration or obsolescence.",
      "explanation_cn": "指不是新的，已使用、拥有或存在很长时间，常暗示已破损、过时或不再适用。",
      "example_en": "She drove an old car that frequently broke down.",
      "example_cn": "她开的是一辆经常出故障的旧车。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Referring to a time in the past; previously existing or known, often used to contrast with the current state.",
      "explanation_cn": "指过去的时间或状态，常用于与当前状况形成对比。",
      "example_en": "He is my old friend from college.",
      "example_cn": "他是我大学时的老朋友。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used to describe something traditional, established, or long-standing, especially in contrast to modern or new versions.",
      "explanation_cn": "用于描述传统、已确立或长期存在的事物，常与现代或新版本形成对比。",
      "example_en": "The old ways of farming are being replaced by modern technology.",
      "example_cn": "传统的耕作方式正被现代技术取代。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ancient",
      "analysis": "“Ancient”（古老的）强调极其久远的历史，通常用于描述文明、建筑或事件，时间跨度以数百年甚至上千年计，带有历史厚重感。而 “old” 更通用，可指任何较长时间的存在，从几天到几十年不等，语义范围更广。"
    },
    {
      "word_to_compare": "elderly",
      "analysis": "“Elderly”（年迈的）专指人类年龄较大，是礼貌、中性的表达，常用于正式语境，强调尊重。而 “old” 在描述人时可能带有贬义或刻板印象，如 ‘an old man’ 可能显得不敬，而 ‘an elderly man’ 则更得体。"
    },
    {
      "word_to_compare": "former",
      "analysis": "“Former”（以前的）专指曾经存在但已不再存在的状态、身份或关系，强调时间上的断绝，如 former president。而 “old” 可指时间上的久远，但不一定意味着当前已不存在，如 old friend 仍可能是现在的友人。"
    }
  ]
}