{
  "word": "oldest",
  "pronunciation": "ohl·dest",
  "concise_definition": "adj. 最老的, 最年长的, 最早的",
  "forms": {
    "base_form": "old",
    "comparative": "older",
    "superlative": "oldest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having existed for the greatest length of time among a group; referring to age in a comparative sense, often used to identify the person or thing with the earliest origin or longest duration.",
      "explanation_cn": "在一组事物中存在时间最长的；用于比较意义上指年龄最大、起源最早或持续时间最长的人或物。",
      "example_en": "She is the oldest member of the team, having worked here for over 40 years.",
      "example_cn": "她是团队中最年长的成员，在这里工作了四十多年。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Referring to the earliest in a sequence or historical order, especially when describing traditions, buildings, or systems that have endured over time.",
      "explanation_cn": "指在序列或历史顺序中最早的，常用于描述延续至今的传统、建筑或制度。",
      "example_en": "The oldest known written language is Sumerian, dating back to around 3200 BCE.",
      "example_cn": "已知最古老的文字语言是苏美尔语，可追溯至公元前3200年左右。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used informally to emphasize familiarity or long-standing use, often with a sense of affection or weariness.",
      "explanation_cn": "非正式用法，强调熟悉或长期使用，常带有亲切或厌倦的语气。",
      "example_en": "This is my oldest pair of shoes—I’ve worn them everywhere!",
      "example_cn": "这是我最旧的一双鞋——我哪儿都穿着它！"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "elder",
      "analysis": "“Elder”（年长的）仅用于指人，且通常用于家庭或正式语境中，强调辈分而非绝对年龄，不能用于比较级或最高级形式（如不能说 “the elder of three”）。而 “oldest” 可用于人、物、抽象概念，且是 “old” 的标准最高级形式，适用范围更广。"
    },
    {
      "word_to_compare": "earliest",
      "analysis": "“Earliest”（最早的）侧重于时间顺序或事件发生的先后，常用于描述时间点、阶段或序列中的第一项（如 earliest arrival, earliest version）。而 “oldest” 更强调持续存在的时间长度，适用于有生命或无生命实体的存续时长。两者有时可互换，但语义重心不同。"
    },
    {
      "word_to_compare": "ancient",
      "analysis": "“Ancient”（远古的）带有强烈的历史感和文化色彩，通常指距今非常久远、属于文明早期阶段的事物（如 ancient Egypt, ancient texts），常用于学术或文学语境。而 “oldest” 是一个中性、客观的比较级表达，可用于任何时间跨度，包括近现代的语境（如 the oldest living person）。"
    }
  ]
}