{
  "word": "olympia",
  "pronunciation": "oh·lim·pee·uh",
  "concise_definition": "n. 奥林匹亚, 奥林匹克运动会, 女子名",
  "forms": {
    "plural": "Olympias"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An ancient Greek city in Elis, located in the Peloponnese, which was the sacred site of the original Olympic Games held in honor of Zeus from 776 BCE onwards.",
      "explanation_cn": "古希腊埃利斯地区的一个城市，位于伯罗奔尼撒半岛，是自公元前776年起为纪念宙斯而举行的古代奥林匹克运动会的圣地。",
      "example_en": "The ancient Olympic Games were held in Olympia every four years for over a thousand years.",
      "example_cn": "古代奥林匹克运动会每四年在奥林匹亚举行，持续了一千多年。"
    },
    {
      "pos": "noun",
      "explanation_en": "A modern term used to refer to the Olympic Games or the spirit of the Olympics, especially in artistic, literary, or promotional contexts.",
      "explanation_cn": "现代语境中常用于指代奥林匹克运动会或奥林匹克精神，尤其在艺术、文学或宣传语境中。",
      "example_en": "The film captures the grace and determination of athletes in the spirit of Olympia.",
      "example_cn": "这部电影捕捉了运动员在奥林匹克精神下的优雅与决心。"
    },
    {
      "pos": "noun",
      "explanation_en": "A feminine given name, often used in reference to the ancient city or as a symbol of beauty and athletic excellence, notably associated with the statue of Zeus at Olympia.",
      "explanation_cn": "一个女性名字，常源于古代城市之名，象征着美与体育卓越，尤其与奥林匹亚的宙斯巨像相关联。",
      "example_en": "She was named Olympia after her grandmother, who admired the classical ideals of strength and beauty.",
      "example_cn": "她以奥林匹亚为名，纪念她的祖母，后者钦佩古典文化中力量与美的理想。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "Olympics",
      "analysis": "“Olympics”（奥林匹克运动会）是现代或泛指的国际综合性体育赛事的总称，涵盖夏季和冬季奥运会，是一个制度化的全球性事件。而 “Olympia” 特指古希腊的发源地，是历史与文化意义上的原点，具有神圣性和地域性。"
    },
    {
      "word_to_compare": "Athens",
      "analysis": "“Athens”（雅典）是现代奥运会的复兴地（1896年首届现代奥运会举办地），代表现代奥林匹克运动的起点；而 “Olympia” 是古代奥运会的发源地，代表其宗教与神话根源。两者在历史脉络上是互补的，但文化象征不同：雅典象征复兴，奥林匹亚象征起源。"
    },
    {
      "word_to_compare": "Parnassus",
      "analysis": "“Parnassus”（帕纳索斯山）是古希腊神话中阿波罗与缪斯女神的圣地，象征文学与艺术的灵感之源；而 “Olympia” 是宙斯的圣地，象征体育、力量与竞技精神。两者均为古希腊神圣之地，但前者关联艺术，后者关联体育。"
    }
  ]
}