{
  "word": "olympus",
  "pronunciation": "oh·lim·pəs",
  "concise_definition": "n. 奥林匹斯山, 奥林匹斯众神, 至高无上的地方",
  "forms": {
    "plural": "Olympuses"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The highest mountain in Greece, considered in ancient Greek religion and mythology as the home of the twelve major gods and goddesses, including Zeus, Hera, and Athena.",
      "explanation_cn": "希腊最高的山脉，在古希腊宗教与神话中被视为十二位主要神祇（如宙斯、赫拉和雅典娜）的居所。",
      "example_en": "In Greek myth, the gods held their councils on Mount Olympus.",
      "example_cn": "在希腊神话中，众神在奥林匹斯山上召开会议。"
    },
    {
      "pos": "noun",
      "explanation_en": "A metaphorical term for a place of supreme power, prestige, or perfection, often used to describe the highest echelons of society, politics, or culture.",
      "explanation_cn": "比喻用语，指权力、声望或完美的至高之地，常用于形容社会、政治或文化领域的最高阶层。",
      "example_en": "The tech billionaire was seen as a resident of the digital Olympus.",
      "example_cn": "这位科技亿万富翁被视为数字世界奥林匹斯山的居民。"
    },
    {
      "pos": "noun",
      "explanation_en": "A brand name for a Japanese manufacturer known for its cameras, lenses, and optical equipment, particularly popular among photographers for its Micro Four Thirds system.",
      "explanation_cn": "日本一家知名制造商的品牌名称，以生产相机、镜头和光学设备而闻名，尤其受摄影师青睐，因其微四三系统（Micro Four Thirds）。",
      "example_en": "She switched to an Olympus camera for its lightweight design and excellent image stabilization.",
      "example_cn": "她换用了奥林巴斯相机，因其轻巧的设计和出色的防抖功能。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "heaven",
      "analysis": "“Heaven”（天堂）是宗教语境中灵魂归宿的抽象概念，强调神圣性与永恒性，常用于基督教、伊斯兰教等一神教体系。而 “Olympus” 是古希腊多神信仰中神祇的物理居所，更具神话色彩和地理象征性，不涉及救赎或道德审判。"
    },
    {
      "word_to_compare": "pinnacle",
      "analysis": "“Pinnacle”（顶峰）泛指任何事物发展的最高点，可用于抽象领域如事业、艺术或成就，强调的是“最高水平”而非“神圣性”或“居所”。而 “Olympus” 不仅表示最高，还隐含了权力中心、神域或精英圈子的集体意象。"
    },
    {
      "word_to_compare": "academy",
      "analysis": "“Academy”（学院/学术机构）指知识、艺术或专业训练的正式组织，如柏拉图学园或美国国家科学院。它强调教育与制度，而 “Olympus” 是神话中的神居，象征权威与超凡，不具组织性或教学功能。"
    }
  ]
}