{
  "word": "onboard",
  "pronunciation": "on·bɔːrd",
  "concise_definition": "v. 接收, 吸纳, 使适应; adj. 在职的, 已加入的",
  "forms": {
    "third_person_singular": "onboards",
    "past_tense": "onboarded",
    "past_participle": "onboarded",
    "present_participle": "onboarding"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To integrate a new person (such as an employee, client, or user) into an organization, system, or process by providing training, information, and support to ensure smooth adaptation and engagement.",
      "explanation_cn": "指通过提供培训、信息和支持，将新人（如员工、客户或用户）融入组织、系统或流程中，以确保其顺利适应并积极参与。",
      "example_en": "The HR team spent two weeks onboarded the new interns with orientation sessions and mentorship programs.",
      "example_cn": "人力资源团队花了两周时间通过入职培训和导师计划帮助新实习生顺利融入。"
    },
    {
      "pos": "verb",
      "explanation_en": "To bring someone into agreement or participation in a plan, project, or initiative, often by gaining their support or buy-in.",
      "explanation_cn": "指通过争取支持或认同，使某人参与或同意某项计划、项目或倡议。",
      "example_en": "Before launching the campaign, we need to onboard all department heads to ensure their cooperation.",
      "example_cn": "在推出活动之前，我们需要让所有部门负责人参与进来，以确保他们的配合。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Already integrated or included in a team, system, or process; currently participating or engaged.",
      "explanation_cn": "指已融入团队、系统或流程中，目前正在参与或投入状态的。",
      "example_en": "All onboard team members received the updated guidelines yesterday.",
      "example_cn": "所有在职团队成员昨天都收到了更新的指南。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hire",
      "analysis": "“Hire”（雇佣）仅指正式聘用某人加入组织，是一个法律或人事上的动作，不涉及后续适应过程。而 “onboard” 强调的是聘用之后的引导、培训和融入过程，是更全面的整合行为。"
    },
    {
      "word_to_compare": "train",
      "analysis": "“Train”（培训）侧重于技能或知识的传授，通常是 onboard 过程中的一个组成部分。但 “onboard” 的范围更广，包括文化适应、系统使用、人际关系建立等非技术性内容，是培训的上位概念。"
    },
    {
      "word_to_compare": "enroll",
      "analysis": "“Enroll”（注册/登记）通常用于加入课程、计划或组织，强调的是形式上的登记行为，如报名参加课程。而 “onboard” 更强调实际的参与、适应和融入，常用于企业或技术场景，具有更强的互动性和持续性。"
    }
  ]
}