{
  "word": "op",
  "pronunciation": "op",
  "concise_definition": "n. 操作, 行动, 计划; v. 操作, 动手术",
  "forms": {
    "plural": "ops",
    "third_person_singular": "ops",
    "past_tense": "oped",
    "past_participle": "oped",
    "present_participle": "oping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A military or law enforcement operation, especially a covert or strategic action carried out to achieve a specific objective.",
      "explanation_cn": "指军事或执法行动，尤指为实现特定目标而执行的秘密或战略性行动。",
      "example_en": "The special forces launched a covert op to rescue the hostages.",
      "example_cn": "特种部队发起了一次秘密行动，营救人质。"
    },
    {
      "pos": "noun",
      "explanation_en": "A business or financial transaction, especially one that is informal, clever, or potentially unethical.",
      "explanation_cn": "指一项商业或金融交易，尤指非正式、机智或可能不道德的交易。",
      "example_en": "He made a quick op buying the property and flipping it for double the price.",
      "example_cn": "他通过低价购入房产再转手卖出，赚了双倍利润。"
    },
    {
      "pos": "verb",
      "explanation_en": "To perform a surgical procedure on a patient.",
      "explanation_cn": "指对患者实施外科手术。",
      "example_en": "The surgeon will op on the patient tomorrow morning.",
      "example_cn": "外科医生将在明天早上为患者动手术。"
    },
    {
      "pos": "verb",
      "explanation_en": "To operate or manage a system, machine, or process, especially in informal or technical contexts.",
      "explanation_cn": "指操作或管理某个系统、机器或流程，常用于非正式或技术语境中。",
      "example_en": "She ops the radar system from the control room.",
      "example_cn": "她从控制室操作雷达系统。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "operation",
      "analysis": "“Operation” 是 “op” 的完整形式，语义更正式、全面，常用于官方文件或军事报告中，涵盖计划、执行、后勤等全过程。而 “op” 是其口语化、缩略形式，多用于新闻、影视或军方内部交流，更简洁、更具行动感。"
    },
    {
      "word_to_compare": "task",
      "analysis": "“Task” (任务) 指一项需要完成的具体工作，通常不涉及复杂计划或风险，而 “op” 暗示着有组织、有策略、甚至带有危险性的行动，常包含多个步骤和团队协作。"
    },
    {
      "word_to_compare": "surgery",
      "analysis": "“Surgery” (外科手术) 是医学术语，指整个手术过程或专业领域，而 “op” 是其口语化动词用法，强调动作本身而非专业背景。例如医生说 “We’re op’ing him” 比 “We’re performing surgery on him” 更口语化、更直接。"
    }
  ]
}