{
  "word": "operations",
  "pronunciation": "op·uh·ray·shuhnz",
  "concise_definition": "n. 操作, 运作, 手术, 军事行动",
  "forms": {
    "singular": "operation"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of functioning or being carried out, especially in a business, system, or organization, involving a series of actions or procedures to achieve a specific goal.",
      "explanation_cn": "指在企业、系统或组织中为实现特定目标而进行的一系列行动或程序，强调功能的执行与运作。",
      "example_en": "The company's daily operations include customer service, inventory management, and payroll processing.",
      "example_cn": "公司的日常运作包括客户服务、库存管理和工资处理。"
    },
    {
      "pos": "noun",
      "explanation_en": "A surgical procedure performed by a medical professional to treat or diagnose a condition, often involving incision or manipulation of body tissues.",
      "explanation_cn": "指由医疗专业人员执行的外科手术，用于治疗或诊断疾病，通常涉及切开或操作身体组织。",
      "example_en": "She underwent an operation to remove her appendix last week.",
      "example_cn": "她上周接受了阑尾切除手术。"
    },
    {
      "pos": "noun",
      "explanation_en": "A planned military activity or campaign, often involving coordinated forces and strategic objectives.",
      "explanation_cn": "指有计划的军事活动或战役，通常涉及协同作战部队和战略目标。",
      "example_en": "The special forces launched a covert operation to rescue the hostages.",
      "example_cn": "特种部队发起了一次秘密行动以营救人质。"
    },
    {
      "pos": "noun",
      "explanation_en": "The mathematical process of combining numbers or quantities according to specific rules, such as addition, subtraction, multiplication, or division.",
      "explanation_cn": "指数学中根据特定规则对数字或量进行的运算，如加法、减法、乘法或除法。",
      "example_en": "In algebra, the basic operations include addition, subtraction, multiplication, and division.",
      "example_cn": "在代数中，基本运算包括加法、减法、乘法和除法。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "activity",
      "analysis": "“Activity” (活动) 是一个更宽泛的词，泛指任何正在发生的行为或事件，可以是随意的、非结构化的。而 “operation” 强调有组织、有目的、通常有系统性流程的行动，尤其在商业、军事或医疗语境中。"
    },
    {
      "word_to_compare": "procedure",
      "analysis": "“Procedure” (程序/步骤) 指完成某事的一系列规定步骤，侧重于方法和顺序，常用于医疗或行政场景。而 “operation” 可以包含多个 procedure，且更强调整体执行过程或结果，尤其在军事或商业中，它往往具有更宏观的规模和战略意义。"
    },
    {
      "word_to_compare": "function",
      "analysis": "“Function” (功能/作用) 指某物或某系统所承担的角色或目的，强调‘是什么’或‘能做什么’。而 “operation” 强调‘如何做’，即实际执行的过程。例如，心脏的功能是泵血，而它的运作（operation）涉及收缩、舒张等具体生理过程。"
    }
  ]
}