{
  "word": "operated",
  "pronunciation": "op·uh·rey·tɪd",
  "concise_definition": "v. 操作, 经营, 动手术, 运行",
  "forms": {
    "base_form": "operate",
    "third_person_singular": "operates",
    "present_participle": "operating",
    "past_tense": "operated",
    "past_participle": "operated"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To control or manage the functioning of a machine, system, or device, typically by using controls or inputs.",
      "explanation_cn": "指通过使用控制装置或输入来操控或管理机器、系统或设备的运行。",
      "example_en": "She operated the crane with great precision during the construction project.",
      "example_cn": "她在施工过程中精准地操作了起重机。"
    },
    {
      "pos": "verb",
      "explanation_en": "To run or manage a business, organization, or service, often as an owner or responsible party.",
      "explanation_cn": "指作为所有者或负责人经营一家企业、组织或服务。",
      "example_en": "The family has operated this restaurant for three generations.",
      "example_cn": "这个家族已经经营这家餐厅三代了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To perform a surgical procedure on a patient, typically by a medical professional.",
      "explanation_cn": "指由医疗专业人员对患者实施外科手术。",
      "example_en": "The surgeon operated on his knee to repair the torn ligament.",
      "example_cn": "外科医生为他做了膝关节手术，以修复撕裂的韧带。"
    },
    {
      "pos": "verb",
      "explanation_en": "To function or work in a particular way, especially in the context of systems, processes, or organizations.",
      "explanation_cn": "指（系统、流程或组织）以某种方式运行或发挥作用。",
      "example_en": "The new traffic light system operates automatically based on sensor data.",
      "example_cn": "新的交通信号系统根据传感器数据自动运行。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "run",
      "analysis": "“Run” (运行/管理) 更通用，可用于描述组织、机器、程序或活动的持续运作，语气较口语化。而 “operated” 更强调对设备或系统的直接操控或专业性操作，常用于技术或医疗语境，语义更精确。"
    },
    {
      "word_to_compare": "managed",
      "analysis": "“Managed” (管理) 侧重于规划、协调和监督，通常涉及人员、资源或战略层面，不强调直接操作。而 “operated” 更关注执行层面的物理或技术性动作，如按下按钮、启动设备或实施手术。"
    },
    {
      "word_to_compare": "functioned",
      "analysis": "“Functioned” (运作) 强调系统或部件是否正常工作，常用于描述状态而非主动行为。例如：'The machine functioned well.' 而 “operated” 暗示有人或系统主动控制其运行，具有施动性。"
    }
  ]
}