{
  "word": "operation",
  "pronunciation": "op·uh·ray·shun",
  "concise_definition": "n. 操作, 运作, 手术, 军事行动",
  "forms": {
    "plural": "operations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of performing a specific task or function, especially in a systematic, organized, or technical manner, such as running a machine, managing a business, or executing a procedure.",
      "explanation_cn": "指以系统化、有组织或技术性的方式执行特定任务或功能的过程，例如操作机器、管理企业或执行程序。",
      "example_en": "The operation of the new factory has significantly increased production efficiency.",
      "example_cn": "新工厂的运作显著提高了生产效率。"
    },
    {
      "pos": "noun",
      "explanation_en": "A surgical procedure performed by a medical professional to treat an injury, disease, or other medical condition.",
      "explanation_cn": "指由医疗专业人员执行的外科手术，用于治疗损伤、疾病或其他医疗状况。",
      "example_en": "She underwent an operation to remove her appendix last week.",
      "example_cn": "她上周接受了阑尾切除手术。"
    },
    {
      "pos": "noun",
      "explanation_en": "A planned and coordinated military or strategic action, often involving multiple units or resources, aimed at achieving a specific objective.",
      "explanation_cn": "指为实现特定目标而计划并协调的军事或战略行动，通常涉及多个单位或资源。",
      "example_en": "The special forces launched a covert operation to rescue the hostages.",
      "example_cn": "特种部队发起了一次秘密行动，营救被劫持的人质。"
    },
    {
      "pos": "noun",
      "explanation_en": "The state or manner in which a system, organization, or mechanism functions or works.",
      "explanation_cn": "指一个系统、组织或机制运行或工作的状态或方式。",
      "example_en": "The operation of the subway system is smooth during off-peak hours.",
      "example_cn": "在非高峰时段，地铁系统的运行非常顺畅。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "procedure",
      "analysis": "“Procedure”（程序/步骤）强调完成某事所遵循的一系列固定步骤或规则，通常用于医疗、行政或法律语境，侧重于规范性和顺序性。而 “operation” 更强调实际执行的过程或整体行为，可能包含多个程序，且常用于技术、军事或外科场景。"
    },
    {
      "word_to_compare": "action",
      "analysis": "“Action”（行动）是一个更广泛、更笼统的词，泛指任何有意识的行为或事件，可以是短暂的、情绪化的或非计划的。而 “operation” 通常指经过周密策划、有组织、持续进行的系统性活动，尤其在军事或商业语境中更具结构性。"
    },
    {
      "word_to_compare": "function",
      "analysis": "“Function”（功能/作用）侧重于某物或某系统所承担的角色或目的，是静态的描述（如‘心脏的功能是泵血’）。而 “operation” 强调动态的执行过程，是功能如何被实现的具体行为。"
    }
  ]
}