{
  "word": "opposes",
  "pronunciation": "uhp·ohyz",
  "concise_definition": "v. 反对, 抵制, 对立",
  "forms": {
    "base_form": "oppose",
    "third_person_singular": "opposes",
    "past_tense": "opposed",
    "past_participle": "opposed",
    "present_participle": "opposing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To act or speak against something, especially a proposal, policy, or action, with the intention of preventing or resisting it.",
      "explanation_cn": "针对某项提议、政策或行动采取反对立场，意图阻止或抵制其实施。",
      "example_en": "Many citizens oppose the new tax law because they believe it unfairly targets low-income families.",
      "example_cn": "许多公民反对这项新税法，因为他们认为它不公平地针对低收入家庭。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be in direct conflict or contrast with something, often in terms of beliefs, values, or interests.",
      "explanation_cn": "在信念、价值观或利益上与某事物直接冲突或形成鲜明对比。",
      "example_en": "Her personal ethics oppose the company's practice of outsourcing labor to countries with weak worker protections.",
      "example_cn": "她的个人道德观与该公司将劳动力外包到劳工保护薄弱国家的做法相抵触。"
    },
    {
      "pos": "verb",
      "explanation_en": "To compete against someone in a contest, election, or rivalry, especially as an antagonist or challenger.",
      "explanation_cn": "在竞赛、选举或竞争中作为对手与某人对抗。",
      "example_en": "In the upcoming election, she will oppose the incumbent mayor for the second time.",
      "example_cn": "在即将到来的选举中，她将第二次与现任市长竞争。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "resist",
      "analysis": "“Resist” (抵抗) 强调在面对压力、影响或变化时采取防御性行动，常用于身体、心理或外力的对抗，如抵抗诱惑或疾病。而 “oppose” 更侧重于表达立场上的反对，尤其在政治、政策或观点层面，更具主动性和公开性。"
    },
    {
      "word_to_compare": "object",
      "analysis": "“Object” (反对) 通常用于表达对某事的异议，语气较温和，常用于正式场合中提出不同意见，如 “I object to this motion.” 它多用于单次、具体的反对，而 “oppose” 更具持续性和系统性，常用于长期立场或组织性对抗。"
    },
    {
      "word_to_compare": "contradict",
      "analysis": "“Contradict” (反驳/自相矛盾) 指直接否定某人的说法或事实，强调逻辑或陈述上的不一致，如 “His testimony contradicts the evidence.” 而 “oppose” 不一定是否定事实，而是反对立场、行动或政策，不必然涉及逻辑冲突。"
    }
  ]
}