{
  "word": "oracle",
  "pronunciation": "or·uh·kuhl",
  "concise_definition": "n. 神谕, 预言者, 权威人士",
  "forms": {
    "plural": "oracles"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "In ancient times, a person or place through which a god or deity was believed to communicate divine guidance or prophecy, often in cryptic or ambiguous terms.",
      "explanation_cn": "在古代，指被认为能传达神灵旨意或预言的人或场所，其信息通常以隐晦或模棱两可的方式表达。",
      "example_en": "The priestess at Delphi was considered the most powerful oracle in ancient Greece.",
      "example_cn": "德尔斐的女祭司被认为是古希腊最强大的神谕者。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or source regarded as an authoritative expert or highly reliable source of information, especially in a specialized field.",
      "explanation_cn": "指在某一专业领域中被视为权威专家或极其可靠信息来源的人或机构。",
      "example_en": "He is an oracle on classical music and can identify any symphony after hearing just a few notes.",
      "example_cn": "他是古典音乐的权威，仅听几小节就能辨认出任何一首交响曲。"
    },
    {
      "pos": "noun",
      "explanation_en": "A computer software company or its flagship database product, known for its enterprise-level reliability and scalability.",
      "explanation_cn": "指一家计算机软件公司，或其以企业级可靠性与可扩展性著称的核心数据库产品。",
      "example_en": "The company migrated its entire data system to Oracle to improve performance and security.",
      "example_cn": "该公司将整个数据系统迁移到 Oracle，以提升性能和安全性。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "prophet",
      "analysis": "“Prophet”（先知）通常指宗教中受神启示、传达未来或道德训诫的人，强调神圣使命和道德教导，常带有宗教或末世论色彩。而 “oracle” 更侧重于传达神的模糊预言，常通过仪式或中介（如祭司）传递，不一定包含道德劝诫。"
    },
    {
      "word_to_compare": "authority",
      "analysis": "“Authority”（权威）泛指在某领域拥有合法或公认影响力的人或机构，语义更广泛，可指法律、学术或行政权威。而 “oracle” 在比喻义中带有神秘、近乎不可质疑的智慧色彩，常用于形容个人的非凡洞察力，而非制度性权力。"
    },
    {
      "word_to_compare": "seer",
      "analysis": "“Seer”（预言家）与 “oracle” 非常接近，都指能预见未来的人，但 “seer” 更强调个人的直觉或超自然感知能力，常用于文学或奇幻语境；而 “oracle” 通常关联特定地点（如神庙）或制度化仪式，更具历史与文化语境。"
    }
  ]
}