{
  "word": "ordered",
  "pronunciation": "uhr·durd",
  "concise_definition": "adj. 有条理的, 有序的; v. 命令, 订购 (order 的过去式和过去分词)",
  "forms": {
    "base_form": "order",
    "third_person_singular": "orders",
    "past_tense": "ordered",
    "past_participle": "ordered",
    "present_participle": "ordering",
    "plural_noun": "orders"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Arranged in a systematic, logical, or neat manner; characterized by organization and clarity.",
      "explanation_cn": "以系统、合乎逻辑或整洁的方式排列的；具有条理性和清晰性的。",
      "example_en": "She kept her desk in an ordered fashion, with everything in its proper place.",
      "example_cn": "她把办公桌整理得井井有条，每样东西都放在该放的位置。"
    },
    {
      "pos": "adjective",
      "explanation_en": "In mathematics or logic, arranged according to a specific sequence or relation, such as ascending or descending order.",
      "explanation_cn": "在数学或逻辑中，按照特定序列或关系排列的，如升序或降序。",
      "example_en": "The numbers were listed in ordered pairs to represent coordinates on the graph.",
      "example_cn": "这些数字以有序对的形式列出，以表示图上的坐标。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give a command or instruction, especially with authority; to direct someone to do something.",
      "explanation_cn": "以权威的方式下达命令或指示；要求某人做某事。",
      "example_en": "The general ordered his troops to advance at dawn.",
      "example_cn": "将军命令部队在黎明时发起进攻。"
    },
    {
      "pos": "verb",
      "explanation_en": "To request and pay for goods or services to be delivered or provided, typically in advance.",
      "explanation_cn": "请求并支付商品或服务，以便其被递送或提供，通常为预先订购。",
      "example_en": "I ordered a new laptop online last week and it arrived today.",
      "example_cn": "我上周在网上订购了一台新笔记本电脑，今天到了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "arranged",
      "analysis": "“Arranged” (安排的) 强调人为地将事物放置或组织起来，但不一定隐含逻辑性或系统性。例如，花束被“arranged”得很美，但未必是“ordered”的。而 “ordered” 更强调内在的结构、序列或规则性，尤其在数学或抽象系统中。"
    },
    {
      "word_to_compare": "commanded",
      "analysis": "“Commanded” (命令) 与 “ordered” 在动词义项上高度重合，但 “commanded” 更具军事或权威色彩，常用于上级对下级的强制性指令，语气更强；而 “ordered” 更通用，可用于日常语境，如点餐、要求服务等。"
    },
    {
      "word_to_compare": "sorted",
      "analysis": "“Sorted” (分类的) 指根据类别或属性将事物分组，如将邮件按收件人分类。它关注的是分组而非序列。而 “ordered” 强调的是线性序列，如数字按大小排列，强调前后关系，而不仅仅是归类。"
    }
  ]
}