{
  "word": "orders",
  "pronunciation": "awr·duhrs",
  "concise_definition": "n. 命令, 订单, 等级, 规则; v. 命令, 订购",
  "forms": {
    "singular": "order"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A formal command or instruction given by someone in authority, requiring compliance or action.",
      "explanation_cn": "由权威人士发出的正式命令或指示，要求他人服从或采取行动。",
      "example_en": "The general gave the order to advance at dawn.",
      "example_cn": "将军下达了黎明时分进攻的命令。"
    },
    {
      "pos": "noun",
      "explanation_en": "A request to buy or supply goods or services, typically placed by a customer or client.",
      "explanation_cn": "客户或顾客提出的购买或供应商品或服务的请求。",
      "example_en": "She placed an order for two books and a coffee maker.",
      "example_cn": "她订购了两本书和一台咖啡机。"
    },
    {
      "pos": "noun",
      "explanation_en": "A system of ranking or hierarchy, especially in social, religious, or institutional contexts.",
      "explanation_cn": "一种等级或层级体系，尤其用于社会、宗教或机构背景中。",
      "example_en": "The monastic order follows strict daily routines.",
      "example_cn": "修道院的教规遵循严格的日常作息。"
    },
    {
      "pos": "noun",
      "explanation_en": "A state of tidiness, organization, or proper arrangement; the opposite of chaos.",
      "explanation_cn": "一种整洁、有序或恰当安排的状态，与混乱相对。",
      "example_en": "She keeps her desk in perfect order.",
      "example_cn": "她的办公桌始终保持井然有序。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give a formal command or instruction to someone, especially in a position of authority.",
      "explanation_cn": "以权威身份向他人下达正式命令或指示。",
      "example_en": "The judge ordered the defendant to appear in court next week.",
      "example_cn": "法官命令被告下周出庭。"
    },
    {
      "pos": "verb",
      "explanation_en": "To request and pay for goods or services to be delivered or provided.",
      "explanation_cn": "请求并支付商品或服务，以获得交付或提供。",
      "example_en": "We ordered pizza for dinner last night.",
      "example_cn": "我们昨晚点了披萨当晚餐。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "command",
      "analysis": "“Command”（命令）更强调权威性和强制性，常用于军事或紧急情境，带有不容置疑的语气。而 “order” 用途更广，既可用于正式命令，也可用于日常订购行为，语义范围更宽泛。"
    },
    {
      "word_to_compare": "request",
      "analysis": "“Request”（请求）是礼貌、非强制性的表达，不包含权力或服从的含义。而 “order” 暗示了上下级关系或必须执行的义务，语气更强硬。例如：I request your help（我请求你的帮助） vs. I order you to leave（我命令你离开）。"
    },
    {
      "word_to_compare": "directive",
      "analysis": "“Directive”（指示）通常用于官方、行政或组织语境中，是系统性、书面化的指导方针，强调程序性和规范性。而 “order” 更偏向于具体、即时的行动指令，可能口头下达，更具操作性。"
    },
    {
      "word_to_compare": "arrangement",
      "analysis": "“Arrangement”（安排）侧重于事物的组织或协调，不包含强制性或权威性，常用于中性或合作语境。而 “order” 在表示“秩序”时，隐含了规则、层级或控制，如 “law and order”（法律与秩序）。"
    }
  ]
}