{
  "word": "orientation",
  "pronunciation": "or·en·tey·shun",
  "concise_definition": "n. 方向, 定向, 介绍, 朝向",
  "forms": {
    "plural": "orientations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of determining or adjusting one's position in relation to a particular environment, situation, or set of circumstances, often involving spatial awareness or understanding of context.",
      "explanation_cn": "指确定或调整自己在特定环境、情境或条件中的位置的过程，通常涉及对空间位置或背景的理解。",
      "example_en": "The hikers used a compass and map to find their orientation in the forest.",
      "example_cn": "徒步者使用指南针和地图来确定自己在森林中的方位。"
    },
    {
      "pos": "noun",
      "explanation_en": "A program or event designed to introduce new members (such as students or employees) to an organization, its culture, rules, and expectations.",
      "explanation_cn": "指为新成员（如学生或员工）介绍组织、其文化、规则和期望而设计的项目或活动。",
      "example_en": "All new employees must attend the company's orientation next Monday.",
      "example_cn": "所有新员工必须参加下周一的公司入职培训。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person's sexual, romantic, or emotional attraction to others, typically categorized as heterosexual, homosexual, bisexual, or asexual.",
      "explanation_cn": "指一个人对他人在性、浪漫或情感上的吸引倾向，通常分为异性恋、同性恋、双性恋或无性恋等类别。",
      "example_en": "She spoke openly about her sexual orientation during the workshop on diversity.",
      "example_cn": "她在关于多样性的研讨会上坦诚地谈到了自己的性取向。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "direction",
      "analysis": "“Direction” (方向) 通常指物理上的移动路径或目标，如“向北走”；它更强调行动的轨迹或目标，而 “orientation” 更侧重于对自身所处位置或环境的整体认知和定位，是静态的、认知性的。"
    },
    {
      "word_to_compare": "induction",
      "analysis": "“Induction” (入职引导) 与 “orientation” 在新员工培训语境中常可互换，但 “induction” 更强调正式的程序性流程和制度性融入，常用于英国英语；而 “orientation” 更广泛，包含文化适应、社交介绍等非正式内容，语义更丰富。"
    },
    {
      "word_to_compare": "alignment",
      "analysis": "“Alignment” (对齐/协调) 指多个事物在结构、目标或方向上达成一致，常用于机械、战略或组织层面；而 “orientation” 更关注个体对自身位置或身份的感知与调整，具有主观性和心理维度。"
    }
  ]
}