{
  "word": "original",
  "pronunciation": "uh·rij·uh·nuhl",
  "concise_definition": "adj. 原始的, 原创的, 独创的; n. 原件, 原作",
  "forms": {
    "comparative": "more original",
    "superlative": "most original"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Not derived from something else; created independently and uniquely, often with innovation or creativity.",
      "explanation_cn": "非源自其他事物；独立创造且具有独特性，通常包含创新或创造力。",
      "example_en": "Her original design won first prize in the architecture competition.",
      "example_cn": "她的原创设计在建筑竞赛中获得了一等奖。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Being the first of its kind; not a copy, reproduction, or adaptation.",
      "explanation_cn": "指某种事物的最初形态，非复制品、仿制品或改编品。",
      "example_en": "Only the original manuscript of the novel survives today.",
      "example_cn": "这部小说的原始手稿如今仅存一份。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Belonging to the beginning or earliest stage of something; not altered or modified.",
      "explanation_cn": "指属于某事物最初阶段的，未被更改或修饰的。",
      "example_en": "The original purpose of the building was to serve as a library.",
      "example_cn": "这座建筑最初的用途是作为图书馆。"
    },
    {
      "pos": "noun",
      "explanation_en": "The first or primary version of something, especially an artwork, document, or creation, as opposed to copies or reproductions.",
      "explanation_cn": "指某物的最初或主要版本，尤指艺术品、文件或创作的原件，区别于复制品或印刷品。",
      "example_en": "The museum displays the original painting, not a replica.",
      "example_cn": "博物馆展出的是原画，而非复制品。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "novel",
      "analysis": "“Novel”（新颖的）强调前所未见或令人惊讶的新颖性，常用于描述想法、方法或技术的创新性，但不一定强调其为“最初版本”。而 “original” 更侧重于“源头性”和“非复制性”，可能并不新奇，但一定是最初的。"
    },
    {
      "word_to_compare": "authentic",
      "analysis": "“Authentic”（真实的、正宗的）强调真实性与来源的可靠性，常用于验证某物是否为真品（如古董、签名），但不一定是原创的。例如，一件复制品可以是“authentic”（按原样制作），但绝不是“original”。"
    },
    {
      "word_to_compare": "primary",
      "analysis": "“Primary”（主要的、首要的）强调重要性或优先级，如“primary source”（第一手资料），但不一定是“最初创作”的版本。一个“primary”版本可能是后来整理的权威版本，而“original”则一定是最早的原始形态。"
    }
  ]
}