{
  "word": "orleans",
  "pronunciation": "awr·lee·uhnz",
  "concise_definition": "n. 奥尔良（法国城市名；亦用于地名、品牌名等）",
  "forms": {
    "plural": "orleans"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A city in north-central France, located on the Loire River, historically significant as a center of French royalty and the site of Joan of Arc's pivotal military victories during the Hundred Years' War.",
      "explanation_cn": "法国中部偏北的一座城市，位于卢瓦尔河畔，历史上是法国王室的重要中心，也是圣女贞德在百年战争中取得关键军事胜利的地点。",
      "example_en": "The city of Orleans played a crucial role in turning the tide of the Hundred Years' War.",
      "example_cn": "奥尔良城在百年战争中扭转战局发挥了关键作用。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of sweet, spiced wine or liqueur originally produced in or associated with the city of Orleans, France, though now more commonly linked to American variants like 'Orleans sauce' or 'Orleans dressing'.",
      "explanation_cn": "一种最初产自或与法国奥尔良市相关的甜味香料葡萄酒或利口酒，如今更常与美国变体（如‘奥尔良酱’或‘奥尔良调味汁’）相关联。",
      "example_en": "The chicken was glazed with a tangy Orleans-style sauce.",
      "example_cn": "鸡肉上淋着一种酸爽的奥尔良风味酱汁。"
    },
    {
      "pos": "noun",
      "explanation_en": "A place name used in various contexts outside France, such as New Orleans in Louisiana, USA, named after the French city and reflecting its colonial heritage.",
      "explanation_cn": "用于法国以外的多种地名，如美国路易斯安那州的新奥尔良，该地以法国奥尔良命名，反映其殖民历史。",
      "example_en": "New Orleans is famous for its jazz music, Mardi Gras celebrations, and Creole cuisine.",
      "example_cn": "新奥尔良以其爵士乐、狂欢节和克里奥尔美食而闻名。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "Paris",
      "analysis": "“Paris”（巴黎）是法国的首都和最大城市，象征政治、文化与时尚中心；而 “Orleans” 是一座具有重要历史意义但规模较小的城市，以军事转折点和地方特产闻名，两者在国家地位和国际影响力上存在显著差异。"
    },
    {
      "word_to_compare": "Normandy",
      "analysis": "“Normandy”（诺曼底）是法国西北部的历史地区，以维京人后裔、诺曼征服和二战登陆战著称；而 “Orleans” 位于中部，以圣女贞德和卢瓦尔河谷城堡群闻名，地理、历史背景和文化象征均不相同。"
    },
    {
      "word_to_compare": "New Orleans",
      "analysis": "“New Orleans” 是美国路易斯安那州的一座城市，直接以法国奥尔良命名，是法裔文化在北美的重要遗存；而 “Orleans” 本身是其欧洲源头，两者是命名关系，但文化表现（如音乐、饮食、语言）已发展出截然不同的地方特色。"
    }
  ]
}