{
  "word": "orphan",
  "pronunciation": "or·fən",
  "concise_definition": "n. 孤儿, 无父母的孩子; v. 使成为孤儿, 遗弃",
  "forms": {
    "plural": "orphans",
    "third_person_singular": "orphan",
    "past_tense": "orphaned",
    "past_participle": "orphaned",
    "present_participle": "orphaning"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A child who has lost both parents through death, and is typically without immediate family support or care.",
      "explanation_cn": "指因父母双亡而失去依靠的儿童，通常缺乏近亲的照料或支持。",
      "example_en": "The charity provides shelter and education for orphans in rural areas.",
      "example_cn": "该慈善机构为农村地区的孤儿提供住所和教育。"
    },
    {
      "pos": "noun",
      "explanation_en": "Something that has been abandoned or left without its usual support system, such as a project, idea, or institution.",
      "explanation_cn": "指被遗弃或失去原有支持体系的事物，如项目、理念或机构。",
      "example_en": "After the department was dissolved, the research project became an orphan.",
      "example_cn": "该部门解散后，这个研究项目便被遗弃了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a child to lose both parents, typically through death or abandonment.",
      "explanation_cn": "指因死亡或遗弃而导致孩子失去双亲。",
      "example_en": "The war orphaned thousands of children across the region.",
      "example_cn": "这场战争使该地区成千上万的孩子成为孤儿。"
    },
    {
      "pos": "verb",
      "explanation_en": "To abandon or leave something without support, care, or maintenance.",
      "explanation_cn": "指遗弃某物，使其失去支持、照料或维护。",
      "example_en": "The company orphaned its old software when it switched to a new platform.",
      "example_cn": "该公司在转向新平台后，便遗弃了旧软件。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "child",
      "analysis": "“Child” (孩子) 是一个中性、泛指的词，指任何未满成年的个体，不涉及父母状况。而 “orphan” 特指父母双亡或被遗弃的孩子，具有明确的社会和情感语境，带有强烈的脆弱性和依赖性含义。"
    },
    {
      "word_to_compare": "abandon",
      "analysis": "“Abandon” (遗弃) 是一个更广泛的动词，可指遗弃人、物、计划等，强调主动放弃责任。而 “orphan” 作为动词时，特指使某人成为孤儿或使某物失去支持，语义更具体，常用于比喻性语境，如技术或制度的遗弃。"
    },
    {
      "word_to_compare": "ward",
      "analysis": "“Ward” (受监护人) 指被法律或他人正式监护的未成年人，可能父母健在但无能力抚养，或父母已故。而 “orphan” 仅指父母双亡者，不必然处于法律监护之下。因此，所有孤儿都可能是受监护人，但并非所有受监护人都是孤儿。"
    }
  ]
}