{
  "word": "outlaw",
  "pronunciation": "owt·law",
  "concise_definition": "n. 法外之徒, 不法之徒; v. 宣布为非法",
  "forms": {
    "plural": "outlaws",
    "third_person_singular": "outlaws",
    "past_tense": "outlawed",
    "past_participle": "outlawed",
    "present_participle": "outlawing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who has broken the law and is outside the protection of the law, often living in hiding and engaging in criminal activities.",
      "explanation_cn": "指违反法律、不受法律保护的人，通常隐匿行踪并从事犯罪活动。",
      "example_en": "The famous outlaw Jesse James robbed trains across the American West.",
      "example_cn": "著名的法外之徒杰西·詹姆斯曾在美洲西部抢劫火车。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that is rejected or excluded by society or a group, often due to nonconformity or controversial behavior.",
      "explanation_cn": "指因不遵从规范或行为有争议而被社会或群体排斥的人或事物。",
      "example_en": "In some circles, he became an outlaw for refusing to follow traditional business practices.",
      "example_cn": "在某些圈子里，他因拒绝遵循传统商业做法而被视为异类。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make something illegal by official decree or legal action, especially by removing its legal status or protection.",
      "explanation_cn": "通过官方命令或法律行动将某事物宣布为非法，尤其是撤销其合法地位或保护。",
      "example_en": "The government outlawed the use of plastic bags to reduce environmental pollution.",
      "example_cn": "政府禁止使用塑料袋以减少环境污染。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "criminal",
      "analysis": "“Criminal” (罪犯) 是一个中性法律术语，泛指任何实施了犯罪行为的人，无论是否被通缉或是否被法律系统追诉。而 “outlaw” 更强调被法律系统彻底排斥、处于法律保护之外的状态，常带有浪漫化或历史色彩，如西部片中的亡命之徒。"
    },
    {
      "word_to_compare": "bandit",
      "analysis": "“Bandit” (强盗) 通常特指以暴力手段抢劫的武装匪徒，尤其在乡村或边远地区活动，强调其暴力和劫掠行为。而 “outlaw” 范围更广，可包括逃犯、叛逆者或被社会排斥者，不一定涉及暴力抢劫。"
    },
    {
      "word_to_compare": "prohibit",
      "analysis": "“Prohibit” (禁止) 是一个更正式、更通用的动词，指通过规则、法律或权威命令阻止某行为发生，不带有“将人置于法律之外”的含义。而 “outlaw” 不仅禁止行为，还暗示剥夺其合法性与社会认可，语义更强烈且具社会排斥意味。"
    }
  ]
}