{
  "word": "outlined",
  "pronunciation": "owt·laɪnd",
  "concise_definition": "adj. 轮廓的, 概要的, 粗略的 v. 描绘轮廓, 概述",
  "forms": {
    "base_form": "outline",
    "past_tense": "outlined",
    "past_participle": "outlined",
    "present_participle": "outlining",
    "plural_noun": "outlines"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing something that is presented in a simplified, general, or skeletal form, without detailed elaboration or refinement.",
      "explanation_cn": "指以简化、概括或骨架形式呈现的事物，未作详细展开或精细修饰。",
      "example_en": "She gave us an outlined plan for the project, highlighting only the main phases.",
      "example_cn": "她向我们提供了一个项目的概要计划，仅突出了主要阶段。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Referring to something that has a clearly defined boundary or shape, often visually represented by lines.",
      "explanation_cn": "指具有清晰边界或形状的事物，通常通过线条在视觉上表现出来。",
      "example_en": "The artist used dark ink to create an outlined sketch of the landscape.",
      "example_cn": "艺术家用深色墨水绘制了风景的轮廓草图。"
    },
    {
      "pos": "verb",
      "explanation_en": "To describe or present the main points or structure of something in a brief and organized way, without going into full detail.",
      "explanation_cn": "以简明、有条理的方式描述或呈现某事物的主要要点或结构，而不深入细节。",
      "example_en": "The manager outlined the company’s goals for the next fiscal year.",
      "example_cn": "经理概述了公司下一财年的目标。"
    },
    {
      "pos": "verb",
      "explanation_en": "To draw the outer lines or edges of something, especially to define its shape clearly.",
      "explanation_cn": "描绘某物的外轮廓或边缘，尤其为了清晰界定其形状。",
      "example_en": "The children outlined the shape of their hands with crayons on the paper.",
      "example_cn": "孩子们用蜡笔在纸上描出了自己手的轮廓。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "summarized",
      "analysis": "“Summarized”（总结）强调将内容压缩为最核心的信息，通常省略所有非必要细节，侧重信息的提炼与浓缩。而 “outlined” 更强调结构的呈现，可能保留较多的框架性内容，但不深入展开，更像‘搭骨架’而非‘抽精华’。"
    },
    {
      "word_to_compare": "sketched",
      "analysis": "“Sketched”（草绘）常用于视觉艺术或非正式表达，指快速、随意地勾勒出大致形状或想法，带有临时性和不完整感。而 “outlined” 更正式，常用于书面或计划性语境，结构更严谨，目的性更强。"
    },
    {
      "word_to_compare": "described",
      "analysis": "“Described”（描述）可以包含大量细节、感官信息和修饰性语言，目的是全面呈现事物的特征。而 “outlined” 仅提供基本结构或要点，信息密度低，但逻辑清晰，常用于提纲或框架性沟通。"
    }
  ]
}