{
  "word": "outlining",
  "pronunciation": "owt·layn·iŋ",
  "concise_definition": "n. 提纲, 概要; v. 拟提纲, 概述",
  "forms": {
    "base_form": "outline",
    "third_person_singular": "outlines",
    "past_tense": "outlined",
    "past_participle": "outlined",
    "present_participle": "outlining"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A structured summary of the main points or sections of a topic, document, or presentation, typically arranged in hierarchical order to show relationships between ideas.",
      "explanation_cn": "指一个主题、文件或演讲的主要要点或部分的结构化摘要，通常以层级方式排列，以显示各观点之间的逻辑关系。",
      "example_en": "She submitted an outlining of her research paper before beginning the full draft.",
      "example_cn": "她在撰写完整初稿之前提交了论文的提纲。"
    },
    {
      "pos": "verb",
      "explanation_en": "To create a structured summary that captures the essential structure and key points of a subject, often as a preliminary step in writing or planning.",
      "explanation_cn": "指通过创建结构化摘要来捕捉某个主题的核心结构和关键要点，通常作为写作或规划的初步步骤。",
      "example_en": "The professor asked students to outline their essays before submitting the final versions.",
      "example_cn": "教授要求学生在提交最终版本前先拟好论文提纲。"
    },
    {
      "pos": "verb",
      "explanation_en": "To describe or present the main features of something in a concise and organized manner, without going into detailed elaboration.",
      "explanation_cn": "指以简洁有序的方式描述或呈现某事物的主要特征，而不深入展开细节。",
      "example_en": "He outlined the company’s new strategy in a single meeting.",
      "example_cn": "他在一次会议中概述了公司的新战略。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "summary",
      "analysis": "“Summary”（摘要）是对内容的全面浓缩，强调信息的完整性与精炼性，通常不保留原始结构。而 “outlining” 更注重逻辑结构和层级关系，常用于写作前的规划阶段，是骨架而非内容的压缩。"
    },
    {
      "word_to_compare": "synopsis",
      "analysis": "“Synopsis”（梗概）多用于文学、影视作品，是对情节或核心内容的简要叙述，侧重叙事连贯性。而 “outlining” 更适用于学术、技术或写作场景，强调条理性和组织性，常以项目符号或编号形式呈现。"
    },
    {
      "word_to_compare": "sketch",
      "analysis": "“Sketch”（草图）在抽象意义上可指粗略的构思，但更常用于视觉艺术或非正式场合，缺乏系统性。而 “outlining” 是一种有意识、有结构的组织行为，通常包含明确的标题、子标题和逻辑顺序，更具计划性和专业性。"
    }
  ]
}