{
  "word": "overwatch",
  "pronunciation": "oh·ver·wotch",
  "concise_definition": "n. 监视, 监控; v. 监视, 监管",
  "forms": {
    "third_person_singular": "overwatches",
    "past_tense": "overwatched",
    "past_participle": "overwatched",
    "present_participle": "overwatching"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of watching over a person, place, or situation to ensure safety, compliance, or control, often in a military, security, or supervisory context.",
      "explanation_cn": "指为确保安全、合规或控制而对某人、某地或某种情况实施的监视行为，常用于军事、安保或监管语境中。",
      "example_en": "The soldiers maintained overwatch from the hilltop while the patrol moved through the valley.",
      "example_cn": "士兵们在山顶上进行监视，而巡逻队则穿过山谷。"
    },
    {
      "pos": "noun",
      "explanation_en": "A popular team-based first-person shooter video game developed by Blizzard Entertainment, in which players choose heroes with unique abilities to compete in objective-based matches.",
      "explanation_cn": "由暴雪娱乐开发的一款热门团队第一人称射击电子游戏，玩家选择拥有独特技能的英雄，在以完成目标为核心的对战中进行竞技。",
      "example_en": "I’ve been playing Overwatch for three years and still love the strategic depth of the game.",
      "example_cn": "我玩《守望先锋》已经三年了，依然喜欢这款游戏的战略深度。"
    },
    {
      "pos": "verb",
      "explanation_en": "To watch over someone or something closely, especially to protect, guide, or prevent danger or misconduct.",
      "explanation_cn": "密切监视某人或某物，尤其为了保护、引导或防止危险或不当行为的发生。",
      "example_en": "The security camera overwatches the entrance 24 hours a day.",
      "example_cn": "这台安保摄像头全天候监控着入口。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "surveillance",
      "analysis": "“Surveillance”（监控）是一个更广泛、更技术性的术语，通常指系统性、持续性的观察，常用于政府、执法或商业场景，强调技术手段（如摄像头、监听）。而 “overwatch” 更强调主动的、有目的的守护或监督，常带有保护性或战术性含义，语义更具体、更人性化。"
    },
    {
      "word_to_compare": "supervise",
      "analysis": "“Supervise”（监督）侧重于管理、指导或确保任务按标准完成，常用于工作或教育环境，强调权威与责任。而 “overwatch” 更强调观察与预警，不一定包含指导或管理职能，更偏向于安全防范层面。"
    },
    {
      "word_to_compare": "guard",
      "analysis": "“Guard”（守卫）通常指物理上的保护，如站岗、持械防御，强调直接干预能力。而 “overwatch” 更多是远程或间接的监视，目的是在必要时提供支援或预警，而非直接对抗。在军事语境中，overwatch 常是 guard 的战术配合角色。"
    }
  ]
}