{
  "word": "overdrive",
  "pronunciation": "oh·vur·drahv",
  "concise_definition": "n. 超速挡, 过度兴奋状态; v. 使进入超速挡, 过度运转",
  "forms": {
    "third_person_singular": "overdrives",
    "past_tense": "overdrove",
    "past_participle": "overdriven",
    "present_participle": "overdriving"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A gear in a vehicle's transmission that allows the engine to run at a lower RPM while maintaining higher road speed, improving fuel efficiency and reducing engine wear during highway driving.",
      "explanation_cn": "车辆传动系统中的一种挡位，使发动机在保持较高车速的同时以更低的转速运转，从而提高燃油效率并减少高速公路行驶时的发动机磨损。",
      "example_en": "Engaging the overdrive on the highway helped reduce our fuel consumption significantly.",
      "example_cn": "在高速公路上启用超速挡显著降低了我们的油耗。"
    },
    {
      "pos": "noun",
      "explanation_en": "A state of excessive or unsustainable activity, often characterized by intense energy, stress, or emotional overload, typically leading to burnout.",
      "explanation_cn": "一种过度活跃或不可持续的状态，常表现为精力极度旺盛、压力过大或情绪超载，通常会导致身心耗竭。",
      "example_en": "She’s been in overdrive since the project deadline, working 16-hour days and neglecting her health.",
      "example_cn": "自从项目截止日期临近，她一直处于超负荷运转状态，每天工作16小时，忽视了健康。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a vehicle to shift into its highest gear (overdrive) to optimize speed and fuel economy.",
      "explanation_cn": "使车辆换入最高挡位（超速挡），以优化车速和燃油经济性。",
      "example_en": "The car automatically overdrives when cruising above 60 mph.",
      "example_cn": "当车速超过每小时60英里时，汽车会自动进入超速挡。"
    },
    {
      "pos": "verb",
      "explanation_en": "To operate or push someone or something beyond normal or healthy limits, often resulting in exhaustion or damage.",
      "explanation_cn": "使某人或某物超出正常或健康的极限运转，常导致疲惫或损坏。",
      "example_en": "The manager overdrove his team during the quarter, and several employees quit from burnout.",
      "example_cn": "经理在本季度过度压榨团队，导致多名员工因精疲力竭而辞职。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "high gear",
      "analysis": "“High gear”（高速挡）是描述传动系统中较高挡位的通用说法，泛指任何提高速度的挡位；而 “overdrive” 是特指比最高常规挡位更高的一个挡位，专用于降低发动机转速以提升效率，具有技术性含义。"
    },
    {
      "word_to_compare": "overwork",
      "analysis": "“Overwork”（过度工作）强调人因长时间或高强度劳动而超负荷，侧重于体力或脑力消耗；而 “overdrive” 既可用于机械（如汽车），也可隐喻人或系统处于非自然的高速运转状态，语义更广，且常带有‘超出设计极限’的隐含批评。"
    },
    {
      "word_to_compare": "boost",
      "analysis": "“Boost”（提升/增强）指通过外部手段增加性能、动力或效率，通常是短暂或主动的干预；而 “overdrive” 是系统内部的一种运行模式，强调持续性的超常运转，可能带来副作用（如损耗或耗竭），不一定是主动选择的结果。"
    }
  ]
}