{
  "word": "overriding",
  "pronunciation": "oh·ver·rahy·ding",
  "concise_definition": "adj. 优先的, 最重要的, 起决定作用的; v. (override 的现在分词) 推翻, 压倒, 取代",
  "forms": {
    "base_form": "override",
    "past_tense": "overrode",
    "past_participle": "overridden",
    "present_participle": "overriding"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Of supreme importance or authority; so significant that it takes precedence over all other considerations, rules, or factors.",
      "explanation_cn": "具有最高重要性或权威性的；如此重要，以至于优先于所有其他考虑、规则或因素。",
      "example_en": "The overriding concern of the government is public safety.",
      "example_cn": "政府最优先考虑的是公共安全。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used to describe a principle, rule, or factor that supersedes or cancels out others, especially in legal, technical, or procedural contexts.",
      "explanation_cn": "用于描述在法律、技术或程序语境中取代或废除其他规则或因素的原则或因素。",
      "example_en": "The overriding clause in the contract nullifies all previous agreements.",
      "example_cn": "合同中的优先条款使所有先前协议失效。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cancel or set aside a decision, rule, or vote made by another person or body, typically by using superior authority.",
      "explanation_cn": "利用更高权威取消或推翻他人或机构所作的决定、规则或投票。",
      "example_en": "The president overridden the committee's recommendation and approved the bill anyway.",
      "example_cn": "总统推翻了委员会的建议，仍然批准了该法案。"
    },
    {
      "pos": "verb",
      "explanation_en": "To dominate or overshadow something else, especially in terms of influence, emotion, or importance.",
      "explanation_cn": "在影响力、情感或重要性上压倒或掩盖其他事物。",
      "example_en": "Her fear of failure was overriding her desire to succeed.",
      "example_cn": "她对失败的恐惧压倒了她成功的愿望。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "dominant",
      "analysis": "“Dominant”（占主导地位的）强调在多个因素中处于最突出或最有力的位置，但不一定具有强制取消其他因素的权力。而 “overriding” 不仅表示主导，更隐含了“推翻”或“取代”的强制性含义，常用于规则、法律或决策语境。"
    },
    {
      "word_to_compare": "superseding",
      "analysis": "“Superseding”（取代）与 “overriding” 在法律和技术语境中常可互换，但 “superseding” 更中性，仅表示“被更新或替代”，不强调权威的强制性；而 “overriding” 更常带有权力层级上的压制意味，如上级推翻下级决定。"
    },
    {
      "word_to_compare": "prevailing",
      "analysis": "“Prevailing”（普遍的、占上风的）描述的是当前最广泛存在或被接受的状态，通常是描述性而非规范性的。而 “overriding” 是规范性的，表示“应当优先执行”，即使存在其他意见或规则。"
    }
  ]
}