{
  "word": "overhaul",
  "pronunciation": "oh·vur·hawl",
  "concise_definition": "v. 彻底检修, 全面改革; n. 彻底检修, 全面改革",
  "forms": {
    "third_person_singular": "overhauls",
    "past_tense": "overhauled",
    "past_participle": "overhauled",
    "present_participle": "overhauling"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To examine and repair or improve something thoroughly, especially a machine, system, or process, to restore it to good working condition or enhance its performance.",
      "explanation_cn": "指对机器、系统或流程进行彻底检查、修理或改进，以恢复其良好运行状态或提升其性能。",
      "example_en": "The airline is overhauling its entire fleet to meet new safety standards.",
      "example_cn": "这家航空公司正在全面检修其整个机队，以符合新的安全标准。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make sweeping changes to a system, organization, or policy in order to improve its efficiency, fairness, or effectiveness.",
      "explanation_cn": "指对制度、组织或政策进行彻底改革，以提高其效率、公平性或有效性。",
      "example_en": "The government plans to overhaul the education system to reduce inequality.",
      "example_cn": "政府计划全面改革教育体系，以减少不平等。"
    },
    {
      "pos": "noun",
      "explanation_en": "A thorough examination and repair or reorganization of something, especially a machine, system, or policy.",
      "explanation_cn": "指对某物（尤其是机器、系统或政策）进行的彻底检查、修理或重组。",
      "example_en": "After the accident, the car needed a complete overhaul before it could be driven again.",
      "example_cn": "事故发生后，这辆车在能再次上路前需要进行全面检修。"
    },
    {
      "pos": "noun",
      "explanation_en": "A comprehensive reform or restructuring aimed at improving a system or process.",
      "explanation_cn": "指旨在改进系统或流程的全面改革或重组。",
      "example_en": "The company's recent overhaul of its HR department led to higher employee satisfaction.",
      "example_cn": "公司最近对人力资源部门的全面改革提高了员工满意度。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "repair",
      "analysis": "“Repair”（修理）通常指针对具体损坏部分进行修复，范围较小、程度较轻，不涉及整体结构或功能的改变。而 “overhaul” 强调全面、系统性的检修或改革，往往包含更换部件、优化设计等深度调整。"
    },
    {
      "word_to_compare": "reform",
      "analysis": "“Reform”（改革）多用于制度、政策或社会结构的改进，强调理念和规则的更新，但不一定包含物理或技术层面的彻底重做。而 “overhaul” 既可以用于抽象系统（如政策），也可用于实体设备，且更强调从头到尾的彻底重构。"
    },
    {
      "word_to_compare": "renovate",
      "analysis": "“Renovate”（翻新）通常用于建筑、室内空间或外观的美化与更新，侧重于外观改善和现代化，不一定涉及功能或内部机制的根本性改进。而 “overhaul” 更关注功能恢复与性能提升，常包含内部结构的彻底检修，语义范围更广、更技术化。"
    }
  ]
}