{
  "word": "pac",
  "pronunciation": "pæs",
  "concise_definition": "n. （缩写）个人援助计划；（美式俚语）警察；（计算机）个人访问代码",
  "forms": {
    "plural": "pacs"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An abbreviation for 'Personal Assistance Program' or 'Personal Aid Committee', typically referring to a government or organizational program that provides financial or social support to individuals in need.",
      "explanation_cn": "‘Personal Assistance Program’（个人援助计划）或‘Personal Aid Committee’（个人援助委员会）的缩写，通常指政府或组织为有需要的个人提供经济或社会支持的项目。",
      "example_en": "She qualified for the PAC program that helps low-income families with childcare expenses.",
      "example_cn": "她符合个人援助计划的资格，该计划帮助低收入家庭支付托儿费用。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slang term in American English, especially in older usage, referring to a police officer, often used in informal or humorous contexts.",
      "explanation_cn": "美式英语中的俚语，尤其在较早用法中，指警察，常用于非正式或幽默语境。",
      "example_en": "Watch out, the pacs are patrolling the neighborhood tonight.",
      "example_cn": "小心点，今晚警察在社区巡逻。"
    },
    {
      "pos": "noun",
      "explanation_en": "In computing and security contexts, an abbreviation for 'Personal Access Code', a numeric or alphanumeric code used to authenticate a user’s identity, often for banking or system login.",
      "explanation_cn": "在计算和安全语境中，指‘Personal Access Code’（个人访问代码），用于验证用户身份的数字或字母数字代码，常用于银行或系统登录。",
      "example_en": "Enter your PAC to access your online banking account.",
      "example_cn": "输入你的个人访问代码以登录网上银行账户。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cop",
      "analysis": "“Cop” 是更广泛使用的俚语，指警察，语气更口语化且普遍，而 “pac” 作为警察的俚语用法较为过时、地域性强，且使用频率极低，多见于特定年代的文学或影视作品中。"
    },
    {
      "word_to_compare": "PIN",
      "analysis": "“PIN”（个人识别码）是现代金融和数字系统中更标准的术语，专指用于身份验证的四位数字密码。而 “PAC” 虽在某些系统中可作同义词，但其含义更广，可能包含字母或用于非金融场景，且不如 PIN 普遍。"
    },
    {
      "word_to_compare": "benefit",
      "analysis": "“Benefit”（福利）泛指任何形式的援助或优惠，是抽象名词；而 “PAC” 作为个人援助计划的缩写，特指一种有组织、制度化的支持项目，具有明确的程序和资格标准，语义更具体、结构化。"
    }
  ]
}