{
  "word": "pace",
  "pronunciation": "peys",
  "concise_definition": "n. 步速, 节奏; v. 以一定步速行走",
  "forms": {
    "plural": "paces",
    "third_person_singular": "paces",
    "past_tense": "paced",
    "past_participle": "paced",
    "present_participle": "pacing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The speed at which someone or something moves or progresses, especially in walking or running; can also refer to the rate of activity or development in a broader context.",
      "explanation_cn": "指某人或某物移动或进展的速度，尤指步行或跑步时的步速；也可泛指更广泛情境中的活动或发展速率。",
      "example_en": "She set a brisk pace for the hike, leaving the others behind.",
      "example_cn": "她为徒步旅行设定了快速的步速，把其他人甩在了后面。"
    },
    {
      "pos": "noun",
      "explanation_en": "The rhythm or tempo of an activity, process, or event, often used metaphorically to describe how quickly things happen.",
      "explanation_cn": "指某项活动、过程或事件的节奏或节拍，常用于比喻描述事物发生的快慢程度。",
      "example_en": "The pace of technological change is accelerating faster than ever.",
      "example_cn": "技术变革的步伐比以往任何时候都更快。"
    },
    {
      "pos": "verb",
      "explanation_en": "To walk back and forth, especially when nervous, impatient, or deep in thought.",
      "explanation_cn": "指来回踱步，尤其在感到紧张、不耐烦或深思时。",
      "example_en": "He paced the room while waiting for the test results.",
      "example_cn": "他在等待检测结果时在房间里来回踱步。"
    },
    {
      "pos": "verb",
      "explanation_en": "To set or adjust the speed or rate of something, often to match a desired or required level.",
      "explanation_cn": "指设定或调整某事物的速度或节奏，使其符合期望或要求的水平。",
      "example_en": "The teacher paced the lesson to ensure all students could follow.",
      "example_cn": "老师调整了课程节奏，以确保所有学生都能跟上。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "speed",
      "analysis": "“Speed” (速度) 是一个更通用、更物理化的术语，强调单位时间内移动的距离，通常用于精确测量（如公里/小时）。而 “pace” 更侧重于主观感受的节奏，常用于描述步行、跑步或抽象进程的舒适度与可持续性，尤其在非技术语境中更常见。"
    },
    {
      "word_to_compare": "rhythm",
      "analysis": "“Rhythm” (节奏) 强调规律性、重复性和韵律感，常用于音乐、舞蹈或自然循环（如心跳）。而 “pace” 更关注速度和进展的快慢，不一定具有周期性。例如，会议可以有快慢的 pace，但未必有 rhythm。"
    },
    {
      "word_to_compare": "tempo",
      "analysis": "“Tempo” (节奏/速度) 源自音乐术语，专指音乐演奏的快慢，也用于比喻性语境，如工作节奏。它比 “pace” 更正式、更精确，常用于艺术或专业领域。而 “pace” 更口语化，适用范围更广，包括日常活动和抽象发展。"
    }
  ]
}