{
  "word": "packed",
  "pronunciation": "pak·t",
  "concise_definition": "adj. 拥挤的, 装满的, 紧密的; v. (pack 的过去式和过去分词) 装箱, 填满, 拥挤",
  "forms": {
    "base_form": "pack",
    "third_person_singular": "packs",
    "past_tense": "packed",
    "past_participle": "packed",
    "present_participle": "packing"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Filled tightly or to capacity with people, objects, or things, often to the point of being crowded or overloaded.",
      "explanation_cn": "指被人、物或事物紧密填满，甚至达到拥挤或超载的程度。",
      "example_en": "The stadium was packed with fans cheering for their team.",
      "example_cn": "体育场里挤满了为球队加油的球迷。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Containing a large amount of information, activity, or events in a short space of time or within a limited area.",
      "explanation_cn": "指在短时间内或有限空间内包含大量信息、活动或事件，内容密集。",
      "example_en": "It was a packed schedule with back-to-back meetings all day.",
      "example_cn": "他的日程排得满满当当，一整天都是接连不断的会议。"
    },
    {
      "pos": "verb",
      "explanation_en": "To put things tightly or efficiently into a container, space, or group, often to maximize capacity.",
      "explanation_cn": "指将物品紧密或高效地放入容器、空间或群体中，通常是为了最大化利用容量。",
      "example_en": "She packed her suitcase with clothes for the week-long trip.",
      "example_cn": "她把一周旅行所需的衣物整齐地塞进了行李箱。"
    },
    {
      "pos": "verb",
      "explanation_en": "To gather or assemble a large number of people or things in a confined area, often implying density or intensity.",
      "explanation_cn": "指在有限区域内聚集大量的人或物，常暗示密度高或强度大。",
      "example_en": "The concert venue was packed before the show even started.",
      "example_cn": "演出还没开始，演唱会场地就已经挤满了人。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "crowded",
      "analysis": "“Crowded” (拥挤的) 侧重于人或动物过多导致空间紧张、行动不便，通常带有负面含义，强调主观不适感。而 “packed” 更强调物理上的完全填满，可能中性或积极（如“packed house”表示演出火爆），不一定有不适感。"
    },
    {
      "word_to_compare": "filled",
      "analysis": "“Filled” (装满的) 是一个通用词，仅表示某物被内容占据，但不强调紧密程度。例如“a filled bottle”只是有液体，而 “a packed suitcase” 意味着塞得严丝合缝、毫无空隙。因此 “packed” 比 “filled” 更具密集性和压迫感。"
    },
    {
      "word_to_compare": "stuffed",
      "analysis": "“Stuffed” (塞满的) 常用于非正式语境，带有轻微夸张或随意的意味，常用于食物（如 stuffed turkey）或柔软物体（如 stuffed animal）。而 “packed” 更正式、更广泛，适用于人、物、时间、信息等多种语境，且不带情感色彩。"
    }
  ]
}