{
  "word": "packs",
  "pronunciation": "pakz",
  "concise_definition": "n. 包, 一包, 群体; v. 打包, 装载, 拥挤",
  "forms": {
    "singular": "pack",
    "third_person_singular": "packs",
    "past_tense": "packed",
    "past_participle": "packed",
    "present_participle": "packing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A group of animals, especially wolves or dogs, that live and hunt together.",
      "explanation_cn": "指一群共同生活和捕猎的动物，尤指狼群或狗群。",
      "example_en": "The pack of wolves howled under the full moon.",
      "example_cn": "狼群在满月下嚎叫。"
    },
    {
      "pos": "noun",
      "explanation_en": "A bundle or container of items wrapped or tied together for transport or storage.",
      "explanation_cn": "指为运输或储存而捆绑或包装在一起的一捆物品。",
      "example_en": "She bought a pack of printer paper for the office.",
      "example_cn": "她为办公室买了一包打印纸。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of people or things gathered closely together, often in a crowded or compact formation.",
      "explanation_cn": "指紧密聚集在一起的一群人或物，常用于形容拥挤的状态。",
      "example_en": "A pack of tourists crowded around the guide.",
      "example_cn": "一群游客围在导游身边。"
    },
    {
      "pos": "verb",
      "explanation_en": "To put items tightly or efficiently into a container or space, often for travel or storage.",
      "explanation_cn": "指将物品紧密或高效地放入容器或空间中，通常用于旅行或储存。",
      "example_en": "He packed his suitcase before the flight.",
      "example_cn": "他在航班前收拾好了行李箱。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fill a space densely with people or things, often to capacity.",
      "explanation_cn": "指将空间塞满人或物，常达到极限容量。",
      "example_en": "The stadium was packed with fans cheering for their team.",
      "example_cn": "体育场里挤满了为球队加油的球迷。"
    },
    {
      "pos": "verb",
      "explanation_en": "To include or contain a large amount of something in a small space or time, often implying intensity or impact.",
      "explanation_cn": "指在小空间或短时间内包含大量内容，常暗示强度或影响力。",
      "example_en": "This movie pack a powerful emotional punch.",
      "example_cn": "这部电影情感冲击力极强。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bundle",
      "analysis": "“Bundle” (捆) 通常指用绳子或布条将物品简单地绑在一起，强调物理上的捆绑，常用于轻便或临时性物品，如一捆报纸或一束花。而 “pack” 更强调有组织地装载或打包，常用于旅行、运输或商业场景，且可能包含更复杂的结构（如背包、包装盒）。"
    },
    {
      "word_to_compare": "group",
      "analysis": "“Group” (群体) 是一个中性词，泛指任何聚集在一起的人或物，不隐含组织性或行为一致性。而 “pack” 特指具有共同目标、协作行为或社会结构的群体，尤其用于动物（如狼群）或高度密集的人群，带有更强的动态和集体性含义。"
    },
    {
      "word_to_compare": "load",
      "analysis": "“Load” (装载) 强调将重物或大量物品放入运输工具中，常用于机械或物流语境，如装载卡车。它更侧重于重量和容量的物理转移。而 “pack” 更强调空间的高效利用和物品的有序排列，不一定涉及重型运输，也可用于抽象意义（如信息密集）。"
    }
  ]
}