{
  "word": "pack",
  "pronunciation": "pak",
  "concise_definition": "v. 打包, 装箱, 拥挤; n. 包, 一群, 兽群",
  "forms": {
    "third_person_singular": "packs",
    "past_tense": "packed",
    "past_participle": "packed",
    "present_participle": "packing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To put items together tightly into a container, such as a suitcase, box, or bag, typically for transport or storage.",
      "explanation_cn": "指将物品紧密地放入箱子、手提箱或袋子等容器中，通常是为了运输或储存。",
      "example_en": "She packed her clothes carefully before the trip.",
      "example_cn": "她在旅行前仔细地把衣服打包好了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fill a space tightly with people or things, often beyond normal capacity.",
      "explanation_cn": "指将人或物塞满一个空间，通常超过正常容量。",
      "example_en": "The stadium was packed with fans cheering for their team.",
      "example_cn": "体育场里挤满了为球队加油的球迷。"
    },
    {
      "pos": "verb",
      "explanation_en": "To carry or transport something, especially in a group or as a collective unit (often used with 'up' or 'away').",
      "explanation_cn": "指携带或运输某物，尤指以群体或集体形式进行（常与 'up' 或 'away' 连用）。",
      "example_en": "The wolves packed up their prey and dragged it to their den.",
      "example_cn": "狼群把猎物打包拖回了它们的洞穴。"
    },
    {
      "pos": "noun",
      "explanation_en": "A bundle or container of items that have been packed together, especially for travel or shipment.",
      "explanation_cn": "指被一起打包好的物品捆或容器，尤指用于旅行或运输的包裹。",
      "example_en": "He left his pack by the door before heading out.",
      "example_cn": "他出门前把背包放在了门口。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of animals, especially wolves or dogs, that live and hunt together.",
      "explanation_cn": "指一群生活和捕猎在一起的动物，尤指狼或狗。",
      "example_en": "The pack of wolves howled under the full moon.",
      "example_cn": "狼群在满月下嚎叫。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large group of people or things moving or acting together, often in a crowded or overwhelming way.",
      "explanation_cn": "指一群行动或移动在一起的人或物，常带有拥挤或压倒性的意味。",
      "example_en": "A pack of reporters surrounded the celebrity as she exited the building.",
      "example_cn": "一群记者围住了这位名人，当她走出大楼时。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bundle",
      "analysis": "“Bundle” (捆) 指将物品用绳子、布等绑在一起，强调物理上的捆绑，通常不涉及容器或运输目的。而 “pack” 更强调将物品有序地放入容器中，常用于旅行或运输场景，且可引申为人群密集。"
    },
    {
      "word_to_compare": "group",
      "analysis": "“Group” (群体) 是一个中性词，泛指任何聚集在一起的人或物，无特定组织或行为模式。而 “pack” 作为名词时，特指具有协作行为（如捕猎）的动物群体，或带有拥挤、压迫感的人群，语义更具体、更具动态性。"
    },
    {
      "word_to_compare": "load",
      "analysis": "“Load” (装载) 强调将重物或大量物品放入运输工具中，侧重重量和容量，常用于机械或物流语境。而 “pack” 更强调紧凑、有序地整理，可指人或物，且常用于非正式或个人场景，如打包行李。"
    }
  ]
}