{
  "word": "pagan",
  "pronunciation": "pay·juhn",
  "concise_definition": "n. 异教徒, 信奉多神教者; adj. 异教的, 非基督教的",
  "forms": {
    "plural": "pagans"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who worships multiple gods or deities, especially in pre-Christian or non-Abrahamic religious traditions, or someone who does not follow a major monotheistic religion such as Christianity, Islam, or Judaism.",
      "explanation_cn": "指信奉多神或多种神灵的人，尤其指基督教传入前或非亚伯拉罕宗教传统中的信徒；也可泛指不信仰基督教、伊斯兰教或犹太教等主要一神教的人。",
      "example_en": "In ancient Rome, many citizens were pagans who honored gods like Jupiter and Venus.",
      "example_cn": "在古罗马，许多公民是异教徒，崇拜朱庇特和维纳斯等神祇。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is perceived as having worldly or unrestrained pleasures, especially in modern contexts where the term is used loosely to describe someone who enjoys nature, seasonal festivals, or non-religious spiritual practices.",
      "explanation_cn": "在现代语境中，有时被宽松地用来形容热衷于自然、季节性节日或非宗教性灵性实践、生活态度自由奔放的人。",
      "example_en": "She identifies as a modern pagan, celebrating solstices and honoring the earth through rituals.",
      "example_cn": "她自认为是现代异教徒，通过仪式庆祝至日并敬奉大地。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characteristic of polytheistic or pre-Christian religions; not Christian, Jewish, or Muslim.",
      "explanation_cn": "与多神教或基督教传入前的宗教有关的；非基督教、犹太教或伊斯兰教的。",
      "example_en": "The ruins contain pagan carvings of fertility gods from the Iron Age.",
      "example_cn": "这些遗迹中包含铁器时代崇拜生育之神的异教雕刻。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Concerned with worldly or sensual pleasures rather than spiritual or moral values; sometimes used pejoratively to describe materialism or hedonism.",
      "explanation_cn": "关注世俗或感官享乐，而非精神或道德价值；有时带有贬义，形容物质主义或享乐主义。",
      "example_en": "The novel critiques the pagan excesses of the Gilded Age aristocracy.",
      "example_cn": "这部小说批判了镀金时代贵族的异教式奢靡。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "heathen",
      "analysis": "“Heathen”（异教徒）与 “pagan” 非常接近，常可互换，但 “heathen” 更具贬义，常用于基督教语境中指未皈依者，带有道德或文明上的优越感；而 “pagan” 更中性，尤其在现代新异教运动中被积极使用。"
    },
    {
      "word_to_compare": "infidel",
      "analysis": "“Infidel”（不信教者）特指拒绝或反对一神教信仰（尤其是基督教或伊斯兰教）的人，常用于宗教冲突语境，具有强烈敌意或贬义；而 “pagan” 仅指信仰不同体系的宗教，不必然包含敌对含义。"
    },
    {
      "word_to_compare": "secular",
      "analysis": "“Secular”（世俗的）指与宗教无关，强调非宗教性，但不等于信仰多神教；它描述的是中立状态，如世俗政府或世俗教育。而 “pagan” 明确指向一种替代性的宗教信仰体系，具有神灵崇拜和仪式实践。"
    }
  ]
}