{
  "word": "painted",
  "pronunciation": "peynt·id",
  "concise_definition": "adj. 被涂漆的, 有绘画的; v. 涂漆, 绘画（past tense and past participle of paint）",
  "forms": {
    "base_form": "paint",
    "third_person_singular": "paints",
    "present_participle": "painting",
    "past_tense": "painted",
    "past_participle": "painted"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Covered with or decorated by paint, often referring to a surface that has been colored or adorned with pigment for aesthetic or protective purposes.",
      "explanation_cn": "被油漆覆盖或装饰的，通常指表面通过颜料进行着色或美化，以达到美观或保护的目的。",
      "example_en": "The painted walls of the cottage glowed warmly in the afternoon sun.",
      "example_cn": "小屋的涂漆墙壁在午后阳光下泛着温暖的光泽。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Depicting or representing something through the art of painting; used to describe images or portraits created with paint rather than photography or digital media.",
      "explanation_cn": "通过绘画艺术表现或呈现事物的；用于描述以颜料创作的图像或肖像，而非摄影或数字媒介。",
      "example_en": "She admired the painted portrait of her great-grandmother, its brushstrokes full of emotion.",
      "example_cn": "她欣赏着曾祖母的油画肖像，笔触中充满情感。"
    },
    {
      "pos": "verb",
      "explanation_en": "The past tense and past participle of 'paint'; used to describe the completed action of applying paint to a surface or creating an image with pigments.",
      "explanation_cn": "动词 'paint' 的过去式和过去分词形式，用于描述已完成的涂漆或用颜料创作图像的行为。",
      "example_en": "The artist painted the landscape last summer, capturing every detail of the mountains and lakes.",
      "example_cn": "这位艺术家去年夏天画下了这幅风景，捕捉了山脉与湖泊的每一个细节。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "colored",
      "analysis": "“Colored”（着色的）泛指任何添加颜色的行为或状态，可以是染料、墨水、蜡笔等，不特指油漆或艺术创作。而 “painted” 通常暗示使用液体颜料（如油漆）进行覆盖或艺术表现，更具技术性和视觉质感。"
    },
    {
      "word_to_compare": "decorated",
      "analysis": "“Decorated”（装饰的）含义更广，可包括贴纸、花纹、灯光、织物等多种装饰方式，不一定涉及颜料。“Painted” 是 “decorated” 的一种具体手段，强调通过绘画实现装饰效果。"
    },
    {
      "word_to_compare": "illustrated",
      "analysis": "“Illustrated”（附插图的）强调为文本或概念提供视觉说明，常用于书籍、教育材料中，其目的为解释而非审美。“Painted” 更侧重于艺术表达和视觉美感，即使没有文字说明，一幅 painted 作品本身即可独立存在。"
    }
  ]
}