{
  "word": "paints",
  "pronunciation": "peynts",
  "concise_definition": "n. 油画, 油彩, 涂料; v. (第三人称单数) 画, 涂, 描绘",
  "forms": {
    "base_form": "paint",
    "plural": "paints",
    "third_person_singular": "paints",
    "past_tense": "painted",
    "past_participle": "painted",
    "present_participle": "painting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Colored substances used for coating surfaces, typically to protect or decorate them; includes oil, acrylic, watercolor, and other types of pigmented liquids or pastes.",
      "explanation_cn": "用于覆盖表面的着色物质，通常用于保护或装饰，包括油画颜料、丙烯颜料、水彩颜料等各类含色素的液体或膏状物。",
      "example_en": "She bought a new set of acrylic paints for her art class.",
      "example_cn": "她为美术课买了一套新的丙烯颜料。"
    },
    {
      "pos": "noun",
      "explanation_en": "A painting or artwork created using paint, especially when referring to multiple works or a collection.",
      "explanation_cn": "指用颜料创作的绘画作品，尤用于复数形式时指多幅画作或一个画作收藏。",
      "example_en": "The museum displays over 200 modern paints from the 20th century.",
      "example_cn": "博物馆展出了200多幅20世纪的现代油画。"
    },
    {
      "pos": "verb",
      "explanation_en": "To apply paint to a surface, typically with a brush or other tool, to cover, decorate, or protect it.",
      "explanation_cn": "用画笔或其他工具将颜料涂抹在表面上，以覆盖、装饰或保护该表面。",
      "example_en": "He paints his house every spring to keep the wood from rotting.",
      "example_cn": "他每年春天都会给房子重新刷漆，以防木材腐烂。"
    },
    {
      "pos": "verb",
      "explanation_en": "To create a picture or image using paint; to depict or represent something artistically.",
      "explanation_cn": "用颜料创作图画或图像；以艺术方式描绘或表现某事物。",
      "example_en": "The artist paints landscapes inspired by her childhood in the countryside.",
      "example_cn": "这位艺术家以童年乡村生活为灵感创作风景画。"
    },
    {
      "pos": "verb",
      "explanation_en": "To describe or portray something in vivid or exaggerated terms, often to emphasize a quality or emotion.",
      "explanation_cn": "用生动或夸张的语言描述或描绘某事物，常用于强调某种特质或情感。",
      "example_en": "The journalist paints a grim picture of life in the war-torn region.",
      "example_cn": "这位记者描绘了战乱地区生活的凄惨图景。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pigments",
      "analysis": "“Pigments”（颜料成分）指颜料中的着色粉末，是构成 paint 的基本化学成分，属于原材料；而 “paints” 是包含颜料、溶剂、粘合剂等混合而成的成品涂料，是可直接使用的物质。"
    },
    {
      "word_to_compare": "murals",
      "analysis": "“Murals”（壁画）是绘制在墙壁或大型表面上的绘画作品，是 paint 的一种应用形式或结果；而 “paints” 是用于创作壁画的材料本身。前者是成品，后者是工具。"
    },
    {
      "word_to_compare": "brushes",
      "analysis": "“Brushes”（画笔）是用于施加 paint 的工具，属于辅助设备；而 “paints” 是被施加的介质。二者是动作中的施与受关系，不可互换。"
    }
  ]
}