{
  "word": "paint",
  "pronunciation": "peynt",
  "concise_definition": "v. 绘画, 涂漆, 描绘; n. 油漆, 绘画, 色彩",
  "forms": {
    "third_person_singular": "paints",
    "past_tense": "painted",
    "past_participle": "painted",
    "present_participle": "painting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To apply pigment, typically in liquid form, onto a surface to create a picture, pattern, or protective coating.",
      "explanation_cn": "将颜料（通常为液态）涂抹在表面上，以创作图像、图案或形成保护层。",
      "example_en": "She painted a beautiful landscape of the mountains last summer.",
      "example_cn": "去年夏天，她画了一幅美丽的山景画。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover or coat a surface with a layer of paint for protection or decoration.",
      "explanation_cn": "用油漆覆盖或涂覆表面，以起到保护或装饰作用。",
      "example_en": "They painted the fence white to make it look more modern.",
      "example_cn": "他们把篱笆刷成白色，让它看起来更现代。"
    },
    {
      "pos": "verb",
      "explanation_en": "To describe or depict something in vivid or figurative language, often to create a mental image.",
      "explanation_cn": "用生动或比喻性的语言描述或描绘某事物，以在脑海中形成图像。",
      "example_en": "The novelist painted a haunting picture of life during the war.",
      "example_cn": "这位小说家用生动的笔触描绘了战争时期的生活图景。"
    },
    {
      "pos": "noun",
      "explanation_en": "A substance consisting of pigments suspended in a liquid medium, used for coating surfaces to add color or protection.",
      "explanation_cn": "由颜料悬浮在液体介质中组成的物质，用于为表面增添颜色或提供保护。",
      "example_en": "The hardware store sells several types of exterior paint for houses.",
      "example_cn": "五金店出售多种用于房屋外墙的油漆。"
    },
    {
      "pos": "noun",
      "explanation_en": "A work of art created by applying paint to a surface, especially canvas or paper.",
      "explanation_cn": "通过在表面（尤其是画布或纸张）上涂抹颜料而创作的艺术作品。",
      "example_en": "The museum's collection includes a rare Picasso paint from his blue period.",
      "example_cn": "该博物馆的收藏中包括一幅来自毕加索蓝色时期的稀有油画。"
    },
    {
      "pos": "noun",
      "explanation_en": "The color or hue of something, especially when used to describe appearance or style.",
      "explanation_cn": "某物的颜色或色调，尤用于描述外观或风格。",
      "example_en": "The car was in a brilliant shade of red paint.",
      "example_cn": "这辆车是鲜艳的红色。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "draw",
      "analysis": "“Draw”（绘画/素描）通常指用铅笔、钢笔或炭笔等工具勾勒线条和轮廓，强调线条和结构，常为单色或草图；而 “paint” 强调使用颜料进行着色和覆盖，注重色彩、质感和层次，更偏向于完成性的艺术表现。"
    },
    {
      "word_to_compare": "color",
      "analysis": "“Color”（着色）是一个更宽泛的词，泛指赋予物体颜色的行为或状态，可以是任何方式（如染色、喷色、贴纸）；而 “paint” 特指使用油漆或颜料进行涂覆，具有明确的媒介和技法，语义更具体。"
    },
    {
      "word_to_compare": "depict",
      "analysis": "“Depict”（描绘）是抽象意义上的表现，常用于语言、文字、图像或符号中传达形象或情感，不涉及物理材料；而 “paint” 既可以指物理涂色行为，也可比喻性地用于语言描述，但其本义始终与物质媒介（颜料）相关，更具感官具体性。"
    }
  ]
}