{
  "word": "pallet",
  "pronunciation": "pal·it",
  "concise_definition": "n. 托盘, 木板, 色彩, 一 pallet 的数量",
  "forms": {
    "plural": "pallets"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A flat portable structure, typically made of wood or plastic, used for stacking, storing, and moving goods as a unit in warehouses and during transportation.",
      "explanation_cn": "一种扁平的可移动结构，通常由木材或塑料制成，用于在仓库和运输过程中将货物作为整体进行堆叠、存放和搬运。",
      "example_en": "The warehouse workers loaded the boxes onto a wooden pallet for shipment.",
      "example_cn": "仓库工人将箱子装上木制托盘，准备发货。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, flat board or slab, especially one used as a bed or sleeping surface for a baby or in a prison cell.",
      "explanation_cn": "一块小而扁平的木板或石板，尤指用作婴儿床或监狱牢房中的睡板。",
      "example_en": "The prisoner slept on a thin pallet laid on the concrete floor.",
      "example_cn": "囚犯睡在铺在混凝土地板上的薄木板上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A range or selection of colors used in a particular context, such as in painting, design, or digital media.",
      "explanation_cn": "在特定语境（如绘画、设计或数字媒体）中使用的一组色彩组合。",
      "example_en": "The artist chose a muted pallet of grays and blues for the winter landscape.",
      "example_cn": "艺术家为冬季风景选用了一组柔和的灰蓝色调。"
    },
    {
      "pos": "noun",
      "explanation_en": "A quantity of goods that fits on one pallet, often used as a unit of measurement in logistics and inventory.",
      "explanation_cn": "能装满一个托盘的货物数量，常用于物流和库存管理中的计量单位。",
      "example_en": "We ordered five pallets of bottled water for the event.",
      "example_cn": "我们为此次活动订购了五托盘瓶装水。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "crate",
      "analysis": "“Crate” (木箱) 通常指有侧壁和顶部的刚性容器，用于保护易碎或贵重物品，强调封闭性和防护性；而 “pallet” 是开放式的承载平台，本身不提供围护，需配合纸箱、塑料膜等使用。"
    },
    {
      "word_to_compare": "palette",
      "analysis": "“Palette” (调色板) 与 “pallet” 在表示色彩时发音相同，但拼写不同，含义也不同。‘Palette’ 专指画家调色用的板或一组色彩，是艺术术语；‘pallet’ 作为色彩义项是其非正式变体，多见于设计领域，但标准用法仍推荐用 ‘palette’。"
    },
    {
      "word_to_compare": "platform",
      "analysis": "“Platform” (平台) 指更广泛意义上的支撑结构，可以是物理的（如火车站台）或抽象的（如技术平台），通常更大、更固定；而 “pallet” 是小型、可移动、专为物流设计的承载工具，功能更具体。"
    }
  ]
}