{
  "word": "palsy",
  "pronunciation": "pawl·zee",
  "concise_definition": "n. 瘫痪, 麻痹, 震颤",
  "forms": {
    "plural": "palsies"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A medical condition characterized by the loss of voluntary muscle movement, often due to damage to the nervous system, resulting in paralysis or weakness in a part of the body.",
      "explanation_cn": "一种医学状况，表现为由于神经系统受损而导致的随意肌肉运动丧失，常引起身体某部分的瘫痪或无力。",
      "example_en": "Stroke can lead to hemiplegia, a type of palsy affecting one side of the body.",
      "example_cn": "中风可能导致偏瘫，这是一种影响身体一侧的瘫痪类型。"
    },
    {
      "pos": "noun",
      "explanation_en": "A neurological disorder involving involuntary tremors or shaking, especially in the hands or head, often associated with aging or disease.",
      "explanation_cn": "一种神经性疾病，表现为手部或头部不自主的震颤或抖动，常与衰老或疾病相关。",
      "example_en": "He developed a slight palsy in his right hand after years of repetitive motion.",
      "example_cn": "由于多年重复性动作，他的右手出现了轻微震颤。"
    },
    {
      "pos": "noun",
      "explanation_en": "A historical or literary term for any form of paralysis or loss of motor control, often used in older medical texts or dramatic contexts.",
      "explanation_cn": "一个历史或文学术语，泛指任何形式的瘫痪或运动控制丧失，常见于旧时医学文献或戏剧性语境中。",
      "example_en": "In Shakespeare’s time, palsy was often attributed to divine punishment or humoral imbalance.",
      "example_cn": "在莎士比亚时代，瘫痪常被归因于神的惩罚或体液失衡。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "paralysis",
      "analysis": "“Paralysis”（瘫痪）是更广泛、更中性的医学术语，泛指任何肌肉功能的完全丧失，可由多种原因引起，不特指神经退行性病变。而 “palsy” 更常用于描述特定类型的神经性运动障碍，尤其是伴有震颤或慢性进展的瘫痪，语义上更具临床或历史色彩。"
    },
    {
      "word_to_compare": "tremor",
      "analysis": "“Tremor”（震颤）仅指不自主的、节律性的肌肉抖动，是“palsy”的一个可能症状，但不等于瘫痪。例如，帕金森病患者有震颤，但未必有瘫痪；而“palsy”可包含震颤，也可能伴随完全无力。因此，“tremor”是“palsy”的子集，而非同义词。"
    },
    {
      "word_to_compare": "weakness",
      "analysis": "“Weakness”（无力）指肌肉力量减弱，但不一定导致运动完全丧失，属于轻度功能障碍。而“palsy”通常意味着更严重的运动控制障碍，可能包括完全瘫痪或不可控的震颤，程度更深、更系统化。"
    }
  ]
}