{
  "word": "pan",
  "pronunciation": "pan",
  "concise_definition": "n. 平底锅, 深盘; v. 横移, 批评, 拍摄",
  "forms": {
    "plural": "pans",
    "third_person_singular": "pans",
    "past_tense": "panned",
    "past_participle": "panned",
    "present_participle": "panning"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A shallow, wide container, typically made of metal, used for cooking food over a stove or in an oven.",
      "explanation_cn": "一种浅而宽的容器，通常由金属制成，用于在炉灶或烤箱中烹饪食物。",
      "example_en": "She stirred the soup in a large cast-iron pan.",
      "example_cn": "她用一个大铸铁锅搅拌着汤。"
    },
    {
      "pos": "noun",
      "explanation_en": "A shallow tray or mold used for washing gold or other minerals from sediment, especially in placer mining.",
      "explanation_cn": "一种浅盘或模具，用于从沉积物中淘洗黄金或其他矿物，尤指在砂金矿开采中使用。",
      "example_en": "The prospector panned for gold in the riverbed.",
      "example_cn": "淘金者在河床中用淘金盘寻找黄金。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move a camera or film device horizontally from side to side to capture a wider view.",
      "explanation_cn": "指将摄像机或摄影设备水平地左右移动，以拍摄更宽广的景物。",
      "example_en": "The director panned the camera across the battlefield to show the scale of the destruction.",
      "example_cn": "导演将摄像机从左到右横移，以展现战场破坏的规模。"
    },
    {
      "pos": "verb",
      "explanation_en": "To criticize severely or harshly, often in a public or written review.",
      "explanation_cn": "指严厉批评，通常用于公开或书面评论中。",
      "example_en": "The new movie was panned by critics for its weak plot and poor acting.",
      "example_cn": "这部新电影因情节薄弱和表演拙劣而遭到影评人的严厉批评。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "frypan",
      "analysis": "“Frypan” 是 “pan” 的一个具体子类，特指用于煎炸食物的平底锅，通常有长柄。而 “pan” 是更广泛的术语，可指任何浅容器，包括烤盘、淘金盘等。因此，所有 frypan 都是 pan，但并非所有 pan 都是 frypan。"
    },
    {
      "word_to_compare": "tilt",
      "analysis": "“Tilt” (倾斜) 指设备或物体在垂直平面上的前后或侧向倾斜，常用于描述摄像机上下移动（如仰拍或俯拍）。而 “pan” 专指水平方向的左右移动，两者是摄像机运动中互补的两种基本动作。"
    },
    {
      "word_to_compare": "criticize",
      "analysis": "“Criticize” 是一个通用词，泛指指出缺点或错误，语气可中性或温和。“Pan” 作为动词时语气更强烈、更负面，常带有公开贬低、毫不留情的意味，多用于娱乐评论语境，具有更强的口语化和情绪色彩。"
    }
  ]
}