{
  "word": "pans",
  "pronunciation": "panz",
  "concise_definition": "n. 平底锅, 盘子, 容器; v. 批评, 严厉指责, 横向移动",
  "forms": {
    "singular": "pan"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A shallow, typically round container with a handle, used for cooking food over direct heat, often made of metal.",
      "explanation_cn": "一种浅而通常为圆形的带柄容器，用于在直接热源上烹饪食物，通常由金属制成。",
      "example_en": "She stirred the sauce in a nonstick pan.",
      "example_cn": "她在一个不粘锅里搅拌着酱汁。"
    },
    {
      "pos": "noun",
      "explanation_en": "A long, narrow container used for washing or separating materials, especially gold, by swirling water in it.",
      "explanation_cn": "一种长而窄的容器，用于通过在其中摇晃水来清洗或分离物质，尤指淘金。",
      "example_en": "The prospector panned for gold in the riverbed.",
      "example_cn": "淘金者在河床中用淘金盘寻找黄金。"
    },
    {
      "pos": "noun",
      "explanation_en": "A shallow dish or tray, often used for serving food or holding objects.",
      "explanation_cn": "一种浅盘或托盘，常用于盛放食物或摆放物品。",
      "example_en": "The waiter placed the dessert on a decorative pan.",
      "example_cn": "服务员把甜点放在一个装饰性的盘子上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To criticize severely or harshly, especially in reviews or public opinion.",
      "explanation_cn": "严厉批评，尤指在评论或公众舆论中对某事物进行负面评价。",
      "example_en": "The new movie was panned by critics for its weak plot.",
      "example_cn": "这部新电影因情节薄弱而遭到影评人的严厉批评。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or turn something horizontally, especially a camera or a person's head.",
      "explanation_cn": "水平移动或转动某物，尤指摄像机或人的头部。",
      "example_en": "The camera panned slowly across the landscape.",
      "example_cn": "摄像机缓缓地横向扫过风景。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "frypan",
      "analysis": "“Frypan” 是 “pan” 的一个具体子类，专指用于煎炸食物的平底锅，通常有深边和长柄。而 “pan” 是更广泛的术语，可指任何浅容器，包括烤盘、淘金盘或托盘，不限于烹饪用途。"
    },
    {
      "word_to_compare": "criticize",
      "analysis": "“Criticize” 是一个通用词，泛指指出缺点或表达不满，语气可轻可重。而 “pan” 作为动词时，特指强烈、公开、往往带有贬损性质的批评，多用于娱乐评论语境，语气更尖锐、更具情绪色彩。"
    },
    {
      "word_to_compare": "tilt",
      "analysis": "“Tilt” 指物体向某一方向倾斜或翘起，通常是围绕一个轴心的纵向或角度变化。而 “pan” 专指水平方向的旋转或移动，如摄像机左右扫视，强调的是横向运动而非倾斜。"
    }
  ]
}