{
  "word": "papers",
  "pronunciation": "pey·puhrz",
  "concise_definition": "n. 纸张, 文件, 论文, 报纸",
  "forms": {
    "singular": "paper"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A written or printed document, especially one that contains official, academic, or informational content, such as an essay, report, or research study.",
      "explanation_cn": "指包含官方、学术或信息内容的书面或印刷文件，如论文、报告或研究报告。",
      "example_en": "She submitted her research papers to the academic journal last week.",
      "example_cn": "她上周将她的研究论文提交给了学术期刊。"
    },
    {
      "pos": "noun",
      "explanation_en": "Newspapers or printed news publications, often used collectively to refer to the press or media.",
      "explanation_cn": "指报纸或印刷新闻出版物，常用于集体指代新闻媒体。",
      "example_en": "The morning papers reported the latest developments in the election.",
      "example_cn": "早报报道了选举的最新进展。"
    },
    {
      "pos": "noun",
      "explanation_en": "Sheets of thin material made from cellulose pulp, used for writing, printing, or packaging.",
      "explanation_cn": "指由纤维素浆制成的薄片材料，用于书写、印刷或包装。",
      "example_en": "He bought a ream of white papers for his printer.",
      "example_cn": "他为打印机买了一令白纸。"
    },
    {
      "pos": "noun",
      "explanation_en": "Official documents or certificates, such as identification, licenses, or legal forms.",
      "explanation_cn": "指官方文件或证书，如身份证、执照或法律表格。",
      "example_en": "You'll need to bring your passport and other papers to the embassy.",
      "example_cn": "你需要携带护照和其他文件去大使馆。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "document",
      "analysis": "“Document”（文件）是一个更广泛、更正式的术语，泛指任何记录信息的书面材料，包括电子形式。而 “papers” 更常用于指具体的、物理的、有时是临时或非正式的文件集合，如作业、报表或证件。"
    },
    {
      "word_to_compare": "article",
      "analysis": "“Article”（文章）特指发表在报刊、杂志或网站上的独立文本，通常具有新闻性、评论性或说明性。而 “papers” 可以包含文章，但范围更广，还包括非发表的学术论文、官方表格等。"
    },
    {
      "word_to_compare": "sheet",
      "analysis": "“Sheet”（一张纸）仅指物理上的一张纸，强调其形态和数量，不涉及内容。而 “papers” 强调的是纸张承载的信息或用途，如论文、文件或报纸，具有功能性含义。"
    }
  ]
}