{
  "word": "parades",
  "pronunciation": "puh·reidz",
  "concise_definition": "n. 游行, 庆典游行, 排列展示",
  "forms": {
    "singular": "parade"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A public procession, often organized for celebration, commemoration, or demonstration, featuring marching groups, floats, music, and costumes, typically held along a street or public route.",
      "explanation_cn": "一种为庆祝、纪念或示威而组织的公开游行，通常包括行进队伍、彩车、音乐和服饰，沿街道或公共路线进行。",
      "example_en": "The city held a grand parade to celebrate the national holiday.",
      "example_cn": "这座城市举行了盛大的游行来庆祝国庆节。"
    },
    {
      "pos": "noun",
      "explanation_en": "A display or show of something, often in a way that is intended to impress or attract attention, sometimes with an element of pretense or exaggeration.",
      "explanation_cn": "指对某事物的展示或表演，常带有炫耀、吸引注意的意图，有时含有虚张声势或夸张的成分。",
      "example_en": "The politician's concern for the poor was just a parade of empty promises.",
      "example_cn": "这位政客对穷人的关心不过是一场空头承诺的表演。"
    },
    {
      "pos": "verb",
      "explanation_en": "To walk or march in a public procession, especially in a formal, ceremonial, or showy manner.",
      "explanation_cn": "以公开游行的方式行走或列队行进，尤其以正式、仪式性或炫耀性的方式进行。",
      "example_en": "The veterans paraded through the town square, wearing their medals with pride.",
      "example_cn": "退伍军人列队经过镇广场，自豪地佩戴着他们的勋章。"
    },
    {
      "pos": "verb",
      "explanation_en": "To display something ostentatiously or in a way meant to impress others, often unnecessarily.",
      "explanation_cn": "以炫耀或刻意引人注目的方式展示某物，有时是不必要的。",
      "example_en": "He paraded his new car around the neighborhood to show off.",
      "example_cn": "他开着新车在社区里转悠，炫耀自己的财富。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "march",
      "analysis": "“March” (行进) 通常指有组织、有节奏地步行，常用于军事或抗议场合，强调纪律性和目的性，但不一定具有表演或庆祝性质。而 “parade” 更强调视觉效果、娱乐性或公众展示，常包含音乐、装饰和娱乐元素。"
    },
    {
      "word_to_compare": "procession",
      "analysis": "“Procession” (行列) 与 “parade” 相近，但更正式、庄重，常用于宗教、葬礼或官方仪式中，节奏缓慢，气氛肃穆。而 “parade” 更欢快、热闹，常用于节日或庆典，强调娱乐性和公众参与。"
    },
    {
      "word_to_compare": "showcase",
      "analysis": "“Showcase” (展示) 是一个更广泛的词，指通过展览、表演或宣传来突出某物的优点，可以是静态的（如橱窗展示）或动态的（如产品发布会）。而 “parade” 强调动态的、行进式的展示，通常在公共空间中进行，具有表演性和仪式感。"
    }
  ]
}