{
  "word": "parachute",
  "pronunciation": "pae·ruh·shüt",
  "concise_definition": "n. 降落伞, v. 跳伞, 用降落伞降落",
  "forms": {
    "plural": "parachutes",
    "third_person_singular": "parachutes",
    "past_tense": "parachuted",
    "past_participle": "parachuted",
    "present_participle": "parachuting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A device made of fabric that opens like an umbrella to slow the descent of a person or object falling through the air, typically used for safe landing from aircraft or high altitudes.",
      "explanation_cn": "一种由织物制成的装置，展开时形似雨伞，用于减缓从空中坠落的人或物体的下降速度，通常用于从飞机或高处安全着陆。",
      "example_en": "The skydiver deployed his parachute at 2,000 feet above the ground.",
      "example_cn": "跳伞者在离地2000英尺时打开了降落伞。"
    },
    {
      "pos": "verb",
      "explanation_en": "To jump from an aircraft or high place using a parachute to descend safely to the ground.",
      "explanation_cn": "指从飞机或高处跳下，借助降落伞安全降落到地面。",
      "example_en": "The soldiers parachuted into enemy territory during the covert operation.",
      "example_cn": "士兵们在秘密行动中跳伞进入敌方领土。"
    },
    {
      "pos": "verb",
      "explanation_en": "To land or be delivered by parachute, often used metaphorically to describe someone being suddenly placed into a new or unexpected situation.",
      "explanation_cn": "指通过降落伞着陆，也可用于比喻某人被突然置于一个新或意想不到的情境中。",
      "example_en": "After the merger, she was parachuted in as CEO without prior experience in the industry.",
      "example_cn": "合并后，她被空降为首席执行官，却没有任何该行业的经验。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "paraglider",
      "analysis": "“Paraglider”（滑翔伞）是一种无框架、轻便的飞行装置，依靠空气动力学原理滑翔，通常从山坡起飞，可长时间飞行；而 “parachute” 主要用于减速下降，不具备滑翔能力，飞行时间短，目的仅为安全着陆。"
    },
    {
      "word_to_compare": "umbrella",
      "analysis": "“Umbrella”（雨伞）是用于遮挡雨水或阳光的日常工具，结构简单，不用于空中减速；虽然降落伞在形态上类似伞，但其材料强度、空气动力学设计和功能目的完全不同，前者用于防护，后者用于减缓重力加速度。"
    },
    {
      "word_to_compare": "eject",
      "analysis": "“Eject”（弹射）指通过机械装置将飞行员或物体从飞机中迅速推出，常用于紧急情况；而 “parachute” 是弹射后实现安全着陆的工具。两者常配合使用，但 “eject” 是动作，而 “parachute” 是设备或降落行为。"
    }
  ]
}