{
  "word": "parade",
  "pronunciation": "puh·reid",
  "concise_definition": "n. 游行, 庆典游行; v. 游行, 示范, 展示",
  "forms": {
    "third_person_singular": "parades",
    "past_tense": "paraded",
    "past_participle": "paraded",
    "present_participle": "parading"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A public procession, typically organized for celebration or demonstration, featuring marching groups, floats, music, and often costumes or military units.",
      "explanation_cn": "一种为庆祝或示威而组织的公开游行，通常包括行进队伍、彩车、音乐，以及服装或军方单位的参与。",
      "example_en": "The city held a grand parade to celebrate the national holiday.",
      "example_cn": "这座城市举行了盛大的游行来庆祝国庆节。"
    },
    {
      "pos": "noun",
      "explanation_en": "A display or show of something, often in a way that is intended to impress or attract attention, sometimes with an element of pretense.",
      "explanation_cn": "指某种事物的展示或表演，常带有炫耀或吸引注意的意图，有时含有虚张声势的成分。",
      "example_en": "It was just a parade of wealth and privilege, with little real concern for the poor.",
      "example_cn": "这不过是一场财富与特权的炫耀，对穷人却毫无真正的关切。"
    },
    {
      "pos": "verb",
      "explanation_en": "To walk or march in a public procession, especially in a ceremonial or celebratory context.",
      "explanation_cn": "指在公共场合列队行进，尤其在仪式性或庆祝性的场合中。",
      "example_en": "Soldiers paraded through the streets in full uniform.",
      "example_cn": "士兵们身着全套制服在街道上列队行进。"
    },
    {
      "pos": "verb",
      "explanation_en": "To display something ostentatiously or in a way that draws attention, often to impress others.",
      "explanation_cn": "指炫耀性地展示某物，以吸引他人注意，常为博取赞赏或敬畏。",
      "example_en": "He paraded his new car around town to show off.",
      "example_cn": "他开着新车在城里兜风，以示炫耀。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "march",
      "analysis": "“March” (行军/行进) 通常指有组织、有节奏的步行，常用于军事或抗议场合，强调纪律性和目的性，但不一定具有表演或庆祝性质。而 “parade” 更强调视觉效果、娱乐性或公众展示，常包含音乐、装饰和娱乐元素。"
    },
    {
      "word_to_compare": "procession",
      "analysis": "“Procession” (行列/仪仗队) 与 “parade” 相近，但更正式、庄重，常用于宗教、葬礼或官方仪式中，节奏缓慢，气氛肃穆。而 “parade” 更偏向欢快、热闹和大众参与，具有更强的娱乐性。"
    },
    {
      "word_to_compare": "showcase",
      "analysis": "“Showcase” (展示/展览) 是一个更广泛的词，指通过展览、表演或平台来突出某物的优点，可以是静态的（如橱窗展示）或非游行形式的（如产品发布会）。而 “parade” 特指通过移动的、集体的、公开的游行方式来展示，具有动态性和仪式感。"
    }
  ]
}