{
  "word": "parks",
  "pronunciation": "pahrks",
  "concise_definition": "n. 公园, 停车场; v. 停车, 停放",
  "forms": {
    "singular": "park"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A public area of land, typically maintained for recreational use, featuring grass, trees, paths, and sometimes playgrounds, sports facilities, or monuments.",
      "explanation_cn": "指为公众提供休闲用途而维护的公共土地，通常包含草地、树木、步道，有时还有游乐设施、运动场地或纪念碑。",
      "example_en": "We spent the afternoon walking through Central Park and enjoying the cherry blossoms.",
      "example_cn": "我们下午在中央公园散步，欣赏樱花。"
    },
    {
      "pos": "noun",
      "explanation_en": "A designated area for parking vehicles, often managed by a city or private entity, with marked spaces and sometimes fees.",
      "explanation_cn": "指为停放车辆而划定的区域，通常由城市或私人机构管理，设有标线停车位，有时需付费。",
      "example_en": "The hotel offers free parking in the underground garage, but street parks are limited.",
      "example_cn": "酒店提供地下车库免费停车，但路边停车位有限。"
    },
    {
      "pos": "verb",
      "explanation_en": "To leave a vehicle in a designated parking area, often temporarily.",
      "explanation_cn": "指将车辆停放在指定的停车区域，通常是暂时性的。",
      "example_en": "I parked my car near the entrance before heading into the museum.",
      "example_cn": "我先把车停在入口附近，然后进博物馆。"
    },
    {
      "pos": "verb",
      "explanation_en": "To set something aside temporarily for future use, especially in contexts like sports, computing, or business.",
      "explanation_cn": "指暂时搁置某物以备将来使用，常用于体育、计算机或商业语境。",
      "example_en": "The team decided to park the project until funding becomes available.",
      "example_cn": "团队决定暂时搁置该项目，直到资金到位。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "garden",
      "analysis": "“Garden”（花园）通常指私人或精心设计的种植区域，强调植物栽培和美学布局，多用于住宅或机构内部；而 “park” 是公共开放空间，功能更广泛，包含休闲、运动、社交等多种用途，规模通常更大。"
    },
    {
      "word_to_compare": "lot",
      "analysis": "“Lot”（空地/停车场）常指未开发或临时使用的土地，尤其在美式英语中可指停车场，但缺乏公园的绿化和公共设施；而 “park” 明确包含景观设计、公共维护和休闲功能，语义更丰富。"
    },
    {
      "word_to_compare": "store",
      "analysis": "“Store”（储存/存放）作为动词时，强调长期保存物品，如存储数据或货物；而 “park” 作为动词时，强调的是临时性搁置，常带有‘稍后继续处理’的语义，如‘park a ticket’或‘park a car’，更具情境性和短暂性。"
    }
  ]
}