{
  "word": "party",
  "pronunciation": "pahr·tee",
  "concise_definition": "n. 党派, 聚会, 当事人; v. 举行派对",
  "forms": {
    "plural": "parties",
    "third_person_singular": "parties",
    "past_tense": "partied",
    "past_participle": "partied",
    "present_participle": "partying"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A group of people organized for political purposes, typically with shared ideologies, goals, and structures to gain and exercise power.",
      "explanation_cn": "指为政治目的而组织的团体，通常具有共同的意识形态、目标和结构，旨在获取和行使权力。",
      "example_en": "The Democratic Party and the Republican Party are the two major political parties in the United States.",
      "example_cn": "民主党与共和党是美国的两大主要政党。"
    },
    {
      "pos": "noun",
      "explanation_en": "A social gathering, especially one held for entertainment, celebration, or enjoyment, often involving food, music, and dancing.",
      "explanation_cn": "指为娱乐、庆祝或享受而举行的社交聚会，通常包括食物、音乐和舞蹈。",
      "example_en": "We're throwing a birthday party for Sarah this Saturday.",
      "example_cn": "这个周六我们要为莎拉举办一个生日派对。"
    },
    {
      "pos": "noun",
      "explanation_en": "One of the individuals or groups involved in a legal agreement, contract, or dispute; a participant in a transaction or situation.",
      "explanation_cn": "指在法律协议、合同或纠纷中涉及的个人或团体；交易或情境中的参与方。",
      "example_en": "Both parties signed the contract before the deal was finalized.",
      "example_cn": "双方在交易最终确定前签署了合同。"
    },
    {
      "pos": "verb",
      "explanation_en": "To celebrate or enjoy oneself socially, especially by attending or hosting a party.",
      "explanation_cn": "指通过参加或举办派对来庆祝或享受社交活动。",
      "example_en": "They partied all night after the concert ended.",
      "example_cn": "音乐会结束后，他们彻夜狂欢。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "faction",
      "analysis": "“Faction”（派系）指一个组织内部的小团体，通常因意见分歧或利益冲突而形成，规模较小且常具对抗性。而 “party” 是更正式、更广泛的政治组织，有明确的纲领和制度，代表更广泛的群体利益。"
    },
    {
      "word_to_compare": "gathering",
      "analysis": "“Gathering”（聚集）是一个中性词，泛指任何人群的集合，可以是正式的（如会议）或非正式的（如朋友小聚），不强调娱乐性或目的性。而 “party” 特指以娱乐和庆祝为目的的社交聚会，氛围更轻松、更具仪式感。"
    },
    {
      "word_to_compare": "participant",
      "analysis": "“Participant”（参与者）强调个体在某项活动或事件中的参与角色，是中性、客观的术语，不隐含组织性或法律地位。而 “party” 在法律语境中特指具有权利义务关系的主体，具有明确的法律身份，如合同当事人。"
    }
  ]
}