{
  "word": "part",
  "pronunciation": "pahrt",
  "concise_definition": "n. 部分, 角色, 职责, 一部分; v. 分离, 分开",
  "forms": {
    "plural": "parts"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A portion or segment of a whole, whether physical, abstract, or conceptual, that contributes to the function or structure of the larger entity.",
      "explanation_cn": "指整体中的一个部分或片段，可以是物理的、抽象的或概念性的，对更大实体的功能或结构有所贡献。",
      "example_en": "The engine is a crucial part of any car.",
      "example_cn": "发动机是任何汽车的关键部分。"
    },
    {
      "pos": "noun",
      "explanation_en": "A role or function assumed by a person in a performance, event, or social context, especially in theater, film, or organizational settings.",
      "explanation_cn": "指个人在表演、事件或社会情境中所承担的角色或职能，尤指在戏剧、电影或组织环境中的角色。",
      "example_en": "She played the part of Hamlet with remarkable depth.",
      "example_cn": "她以非凡的深度扮演了哈姆雷特这一角色。"
    },
    {
      "pos": "noun",
      "explanation_en": "A share or involvement in something, such as an activity, responsibility, or ownership.",
      "explanation_cn": "指对某事物的参与、责任或所有权份额。",
      "example_en": "He has no part in the decision-making process.",
      "example_cn": "他不参与决策过程。"
    },
    {
      "pos": "verb",
      "explanation_en": "To separate or divide into distinct sections, often by breaking or disconnecting something that was previously joined.",
      "explanation_cn": "指将原本连接在一起的事物分离或划分为不同的部分。",
      "example_en": "The couple decided to part ways after ten years of marriage.",
      "example_cn": "这对夫妇在十年婚姻后决定分道扬镳。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "piece",
      "analysis": "“Piece”（一片、一块）通常指从整体中分离出来的、有形的、可数的独立单元，强调物理形态的完整性，如一块蛋糕、一片纸。而 “part” 更抽象，可以指功能、角色或非实体的组成部分，不一定可单独存在。"
    },
    {
      "word_to_compare": "section",
      "analysis": "“Section”（部分、章节）常用于指按逻辑、结构或空间划分的明确区域，如书的章节、报纸的版面，具有较强的组织性和边界感。而 “part” 更通用，可指任何构成整体的成分，不强调划分的系统性。"
    },
    {
      "word_to_compare": "role",
      "analysis": "“Role”（角色）特指社会、戏剧或组织中所承担的职责或行为模式，是 “part” 在表演或社会功能语境下的具体化。虽然在某些语境中可互换（如 play a part/role），但 “role” 更强调规范性和社会期待，而 “part” 更中性、泛化。"
    },
    {
      "word_to_compare": "divide",
      "analysis": "“Divide”（分割）是动作性动词，强调将整体拆分成多个部分的过程，常用于数学、物理或组织场景。而 “part” 作为动词时语气更文学化或情感化，常用于描述人与人之间的分离，如 ‘part ways’，带有告别或终结的意味。"
    }
  ]
}