{
  "word": "partnership",
  "pronunciation": "pahrtnur·ship",
  "concise_definition": "n. 合伙关系, 合作, 合资企业",
  "forms": {
    "plural": "partnerships"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A legal or formal relationship between two or more parties who agree to collaborate toward a common goal, often sharing resources, responsibilities, and profits.",
      "explanation_cn": "指两个或多个主体为实现共同目标而达成的法律或正式合作关系，通常涉及资源共享、责任分担和利润分配。",
      "example_en": "The two companies formed a strategic partnership to enter the Asian market.",
      "example_cn": "两家公司建立了战略伙伴关系，以进入亚洲市场。"
    },
    {
      "pos": "noun",
      "explanation_en": "A personal or professional relationship characterized by mutual trust, cooperation, and shared interests, often extending beyond formal business arrangements.",
      "explanation_cn": "指基于相互信任、合作与共同利益而建立的个人或职业关系，常超越正式的商业协议。",
      "example_en": "Their decades-long partnership in both business and life has been an inspiration to many.",
      "example_cn": "他们在事业和生活中长达数十年的伙伴关系激励了很多人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of business structure in which two or more individuals manage and operate a business together, with shared liability and ownership.",
      "explanation_cn": "指一种商业组织形式，由两个或更多个人共同管理与经营企业，共同承担法律责任与所有权。",
      "example_en": "They opened a law firm as a general partnership, each contributing capital and expertise.",
      "example_cn": "他们以普通合伙的形式开设了一家律师事务所，各自投入资金和专业技能。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "alliance",
      "analysis": "“Alliance”（联盟）通常指国家、组织或群体之间为实现共同政治、军事或战略目标而建立的较广泛、较松散的合作关系，强调集体利益而非经济共享。而 “partnership” 更侧重于具体的合作关系，常涉及资源、责任和利润的直接共享，更具契约性和操作性。"
    },
    {
      "word_to_compare": "collaboration",
      "analysis": "“Collaboration”（协作）强调共同参与、协同工作以完成某项任务或项目，通常不涉及法律结构或财务共享，更偏向过程性合作。而 “partnership” 通常具有更正式的法律或商业框架，包含权利义务的明确分配。"
    },
    {
      "word_to_compare": "joint venture",
      "analysis": "“Joint venture”（合资企业）是 “partnership” 的一种具体形式，特指为完成特定项目或进入特定市场而设立的独立实体，通常有明确的期限和法律注册。而 “partnership” 范围更广，可指非正式的长期合作关系，不一定成立独立法人。"
    }
  ]
}