{
  "word": "parties",
  "pronunciation": "pahr·tiz",
  "concise_definition": "n. 党派, 一方, 聚会, 当事人",
  "forms": {
    "singular": "party"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A group of people organized to pursue common political goals, especially one that seeks to gain power through elections.",
      "explanation_cn": "指为追求共同政治目标而组织起来的团体，尤指通过选举争取权力的政治党派。",
      "example_en": "The two major political parties in the United States are the Democrats and the Republicans.",
      "example_cn": "美国两大主要政党是民主党与共和党。"
    },
    {
      "pos": "noun",
      "explanation_en": "One of the individuals or groups involved in a legal agreement, contract, or dispute; a participant in a formal arrangement.",
      "explanation_cn": "指在法律协议、合同或纠纷中涉及的一方或多个主体，即正式安排中的参与者。",
      "example_en": "Both parties signed the contract before the transaction was finalized.",
      "example_cn": "双方在交易最终完成前签署了合同。"
    },
    {
      "pos": "noun",
      "explanation_en": "A social gathering, especially one held for entertainment or celebration, such as a birthday party or holiday party.",
      "explanation_cn": "指为娱乐或庆祝而举行的社交聚会，如生日派对或节日聚会。",
      "example_en": "We're having a small party this weekend to celebrate Sarah's promotion.",
      "example_cn": "这个周末我们将举办一个小派对，庆祝萨拉的晋升。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or group taking part in an activity or event, often in contrast to others involved; can refer to any participant in a broader context.",
      "explanation_cn": "泛指参与某项活动或事件的个人或团体，常与其他参与者形成对比。",
      "example_en": "The buyer and seller are both parties to the deal.",
      "example_cn": "买方和卖方都是这笔交易的当事方。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "group",
      "analysis": "“Group”（群体）是一个中性、泛指的词，指任何聚集在一起的人，不强调组织性、目的性或法律地位。而 “parties” 在政治、法律或正式语境中具有明确的角色和权利义务，更具结构性和功能性。"
    },
    {
      "word_to_compare": "assembly",
      "analysis": "“Assembly”（集会、议会）强调人员的物理聚集或正式会议，常用于立法机构或大型集会，如“the General Assembly”。它侧重于空间和形式上的集合，而 “parties” 更强调成员间的共同利益、立场或法律身份。"
    },
    {
      "word_to_compare": "celebration",
      "analysis": "“Celebration”（庆祝活动）仅指庆祝性质的聚会，是 “parties” 在社交语境中的一种子类。但 “parties” 还可指政治团体或法律主体，含义远比 “celebration” 广泛。"
    }
  ]
}