{
  "word": "partner",
  "pronunciation": "pahrn·tner",
  "concise_definition": "n. 合伙人, 伴侣, 合作方; v. 与...合作",
  "forms": {
    "plural": "partners",
    "third_person_singular": "partners",
    "past_tense": "partnered",
    "past_participle": "partnered",
    "present_participle": "partnering"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person or organization that joins with another in a business, project, or activity, sharing responsibilities, risks, and rewards.",
      "explanation_cn": "指与他人或组织在商业、项目或活动中联合，共同承担责任、风险与收益的人或机构。",
      "example_en": "She is my business partner in the new startup.",
      "example_cn": "她是我在新创公司中的商业合伙人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person with whom one has a close personal or romantic relationship, often implying mutual commitment and companionship.",
      "explanation_cn": "指与某人有亲密个人或浪漫关系的人，通常暗示相互承诺与陪伴。",
      "example_en": "He introduced his life partner at the family gathering.",
      "example_cn": "他在家庭聚会上介绍了他的终身伴侣。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or entity that collaborates with another in a specific context, such as sports, dance, or negotiation, often in a complementary role.",
      "explanation_cn": "指在特定情境下（如体育、舞蹈或谈判）与他人协作的伙伴，通常扮演互补的角色。",
      "example_en": "Her dance partner moved in perfect sync with her.",
      "example_cn": "她的舞伴与她动作完美同步。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form a partnership or collaborate with someone, especially for mutual benefit or to achieve a common goal.",
      "explanation_cn": "指与某人建立合作关系或共同协作，通常为了互利或实现共同目标。",
      "example_en": "The two companies partnered to launch a joint marketing campaign.",
      "example_cn": "两家公司合作发起了一项联合营销活动。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "companion",
      "analysis": "“Companion”（同伴）强调陪伴与同行，多用于非正式或情感层面的联结，如旅行同伴、日常陪伴者，不一定涉及责任、利益或正式关系。而 “partner” 更常暗示一种结构性、功能性或制度性的合作关系，如商业、婚姻或项目中的搭档。"
    },
    {
      "word_to_compare": "collaborator",
      "analysis": "“Collaborator”（合作者）侧重于共同完成某项任务或创作，常用于学术、艺术或专业领域，语义更中性甚至可含贬义（如与敌人合作）。而 “partner” 更强调平等、长期和互惠的关系，带有更强的情感或制度认同。"
    },
    {
      "word_to_compare": "spouse",
      "analysis": "“Spouse”（配偶）是法律和婚姻关系中的专有术语，仅指合法结婚的丈夫或妻子，语义范围狭窄且正式。而 “partner” 可涵盖婚姻配偶，也可用于同居、同性伴侣或非婚关系，更具包容性和现代语用特征。"
    }
  ]
}