{
  "word": "passage",
  "pronunciation": "pas·ij",
  "concise_definition": "n. 段落, 通道, 通过, 航行",
  "forms": {
    "plural": "passages"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A section of text, especially one taken from a longer written work, used to illustrate a point, provide evidence, or be analyzed.",
      "explanation_cn": "指一段文字，尤其是从较长著作中摘录出来，用于说明观点、提供证据或进行分析的部分。",
      "example_en": "The teacher asked the students to analyze this passage from Shakespeare's Hamlet.",
      "example_cn": "老师让学生们分析这段来自莎士比亚《哈姆雷特》的文字。"
    },
    {
      "pos": "noun",
      "explanation_en": "A narrow route or corridor that connects two places, often enclosed or confined, such as a hallway, tunnel, or walkway.",
      "explanation_cn": "指连接两个地点的狭窄通道，通常是封闭或受限的，如走廊、隧道或走道。",
      "example_en": "We walked through a dark passage beneath the old castle.",
      "example_cn": "我们穿过了一条位于古堡下方的黑暗通道。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of moving from one place to another, especially across a boundary or obstacle; often used in contexts of travel, immigration, or transition.",
      "explanation_cn": "指从一个地方移动到另一个地方的行为，尤其指跨越边界或障碍，常用于旅行、移民或过渡的语境中。",
      "example_en": "The passage of time changed everything.",
      "example_cn": "时光流逝，一切都已改变。"
    },
    {
      "pos": "noun",
      "explanation_en": "A route taken by ships or aircraft, especially through water or air, such as a sea lane or air corridor.",
      "explanation_cn": "指船舶或飞机所经过的路线，尤其是水路或空域中的航道或航线。",
      "example_en": "The cargo ship followed the designated passage through the Strait of Malacca.",
      "example_cn": "这艘货轮沿着指定的航道通过了马六甲海峡。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "paragraph",
      "analysis": "“Paragraph”（段落）是写作结构中的一个单位，通常围绕一个中心思想展开，有明确的起始和结束，强调组织性和逻辑性。而 “passage” 更广泛，可以是任何一段文字，不一定有完整结构，常用于引用或分析，范围更广。"
    },
    {
      "word_to_compare": "corridor",
      "analysis": "“Corridor”（走廊）特指建筑物内连接房间的狭长通道，强调物理空间和建筑结构。而 “passage” 可以是自然或人工的通道，包括隧道、水道、甚至抽象的过渡过程，语义范围更广。"
    },
    {
      "word_to_compare": "excerpt",
      "analysis": "“Excerpt”（摘录）是特意从作品中选取的片段，通常用于展示风格、内容或引用，具有明确的出处和目的性。而 “passage” 可以是任意一段文字，不一定经过刻意挑选，用途更灵活，不一定用于引用。"
    },
    {
      "word_to_compare": "journey",
      "analysis": "“Journey”（旅程）强调从起点到终点的完整过程，常带有情感、象征或叙事色彩，如人生旅程。而 “passage” 更侧重于移动本身或所经之路，可以是物理的、时间的或抽象的，语义更中性、更广泛。"
    }
  ]
}