{
  "word": "passages",
  "pronunciation": "pas·ij·iz",
  "concise_definition": "n. 段落, 通道, 经过, 旅途",
  "forms": {
    "singular": "passage"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A section of written text, especially one that is quoted or studied for its meaning, style, or content.",
      "explanation_cn": "指书面文字中的一段，尤其指被引用或用于分析其意义、风格或内容的段落。",
      "example_en": "The teacher asked the students to analyze the key passages from Shakespeare's Hamlet.",
      "example_cn": "老师让学生们分析《哈姆雷特》中的关键段落。"
    },
    {
      "pos": "noun",
      "explanation_en": "A narrow route or corridor that connects two places, often enclosed or confined, such as in a building, ship, or underground system.",
      "explanation_cn": "指连接两个地点的狭窄通道或走廊，通常为封闭或受限的空间，如建筑物、船舶或地下系统中的通道。",
      "example_en": "We walked through a dark passage that led to the basement.",
      "example_cn": "我们穿过一条通向地下室的黑暗通道。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of moving from one place to another, especially through a particular route or area; often used in the context of travel or transition.",
      "explanation_cn": "指从一个地方移动到另一个地方的行为，尤其指通过特定路线或区域的移动；常用于描述旅行或过渡过程。",
      "example_en": "The passage of time changed everything.",
      "example_cn": "时光流逝，一切都已改变。"
    },
    {
      "pos": "noun",
      "explanation_en": "A route or path taken by a river, animal, or vehicle, especially one that is regularly used or naturally formed.",
      "explanation_cn": "指河流、动物或车辆所经过的路线，尤其是那些经常使用或自然形成的路径。",
      "example_en": "The migration passage of the wildebeests crosses the Serengeti plains.",
      "example_cn": "角马的迁徙通道穿越了塞伦盖蒂平原。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "paragraph",
      "analysis": "“Paragraph”（段落）是写作结构中的一个单位，通常围绕一个主题展开，有明确的起始和结束，用于组织思想。而 “passage” 更广泛，可以指任何一段文字，不一定是完整结构的段落，也常用于引用或分析语境中，范围更广。"
    },
    {
      "word_to_compare": "corridor",
      "analysis": "“Corridor”（走廊）特指建筑物中连接房间或区域的狭长通道，强调物理空间结构。而 “passage” 除了指物理通道外，还可用于抽象意义（如时间的流逝、迁徙路径），语义范围更广，且常用于文学或正式语境。"
    },
    {
      "word_to_compare": "excerpt",
      "analysis": "“Excerpt”（节选）是从较长作品中摘录出的片段，通常用于展示代表性内容，具有明确的“选取”意图。而 “passage” 可以是原文中自然存在的段落，不一定经过人为摘录，更强调其作为文本组成部分的完整性。"
    }
  ]
}