{
  "word": "passes",
  "pronunciation": "pæs·ɪz",
  "concise_definition": "n. 通过, 通行证, 一传, 轮次; v. 经过, 传递, 通过, 度过",
  "forms": {
    "base_form": "pass",
    "third_person_singular": "passes",
    "past_tense": "passed",
    "past_participle": "passed",
    "present_participle": "passing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An act of moving or transferring something from one person or place to another, especially in sports or transportation.",
      "explanation_cn": "指在运动或交通中，将某物从一个人或地方转移到另一个人或地方的行为。",
      "example_en": "The soccer player made a perfect pass to his teammate, leading to a goal.",
      "example_cn": "这名足球运动员精准地将球传给队友，助攻得分。"
    },
    {
      "pos": "noun",
      "explanation_en": "A document or ticket granting permission to enter a place, use a service, or travel on a route.",
      "explanation_cn": "指允许进入某地、使用某项服务或沿某路线通行的证件或票证。",
      "example_en": "She showed her season pass to enter the amusement park without paying again.",
      "example_cn": "她出示了季票，无需再次付费即可进入游乐园。"
    },
    {
      "pos": "noun",
      "explanation_en": "A single attempt or opportunity to do something, especially in a test or evaluation.",
      "explanation_cn": "指在测试或评估中的一次尝试或机会。",
      "example_en": "He failed the driving test on his first pass but passed on the second.",
      "example_cn": "他第一次考驾照没通过，第二次才通过。"
    },
    {
      "pos": "noun",
      "explanation_en": "A route or path, especially one that goes through a difficult or narrow area such as a mountain pass.",
      "explanation_cn": "指一条路径，尤指穿越困难或狭窄地带（如山口）的通道。",
      "example_en": "The climbers crossed the mountain pass just before sunset.",
      "example_cn": "登山者在日落前穿越了山口。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move past or go by something or someone, often in space or time.",
      "explanation_cn": "指在空间或时间上经过或越过某物或某人。",
      "example_en": "The train passed the station without stopping.",
      "example_cn": "火车没有停靠就驶过了车站。"
    },
    {
      "pos": "verb",
      "explanation_en": "To transfer something to another person, often by hand or in a game.",
      "explanation_cn": "指通过手或在比赛中将某物转交给另一个人。",
      "example_en": "He passed the salt to his dinner partner.",
      "example_cn": "他把盐递给了用餐的同伴。"
    },
    {
      "pos": "verb",
      "explanation_en": "To successfully complete a test, examination, or requirement.",
      "explanation_cn": "指成功通过考试、测试或要求。",
      "example_en": "She passed her final exams with honors.",
      "example_cn": "她以优异成绩通过了期末考试。"
    },
    {
      "pos": "verb",
      "explanation_en": "To spend or elapse, especially referring to time.",
      "explanation_cn": "指度过、消磨（尤指时间）。",
      "example_en": "They passed the afternoon chatting on the porch.",
      "example_cn": "他们坐在门廊上聊天，度过了下午时光。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "transfers",
      "analysis": "“Transfers”（转移）强调所有权或控制权的正式变更，常用于资金、职位或资产的移交，具有法律或制度性含义。而 “passes” 更侧重于物理或动作上的传递，不一定涉及所有权变更，如传球、递东西。"
    },
    {
      "word_to_compare": "routes",
      "analysis": "“Routes”（路线）泛指从一地到另一地的路径，是抽象或规划性的概念，如公交路线、飞行路线。而 “pass” 作为名词时特指穿越障碍（如山脉、关隘）的通道，具有地理和地形上的具体性。"
    },
    {
      "word_to_compare": "attempts",
      "analysis": "“Attempts”（尝试）强调努力或尝试做某事，无论成功与否。而 “pass” 作为名词时特指一次成功的尝试，尤其在考试或测试语境中，隐含了结果的肯定性。"
    }
  ]
}