{
  "word": "pastoral",
  "pronunciation": "pahs·toral",
  "concise_definition": "adj. 田园的, 农村的, 牧师的",
  "forms": {
    "comparative": "more pastoral",
    "superlative": "most pastoral"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to the countryside, especially in an idealized, peaceful, and picturesque way, often depicting simple, serene rural life with shepherds, livestock, and natural landscapes.",
      "explanation_cn": "指与乡村有关的，尤其以理想化、宁静而如画的方式描绘田园生活，常包含牧羊人、牲畜和自然景观。",
      "example_en": "The painting features a pastoral scene with sheep grazing under a shady tree.",
      "example_cn": "这幅画描绘了一幅田园风光，羊群在树荫下吃草。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Concerned with the spiritual care of a congregation, typically referring to the duties of a priest or minister.",
      "explanation_cn": "指与教区信徒的精神关怀有关的，通常用于描述牧师或神职人员的职责。",
      "example_en": "She provided pastoral care to families grieving the loss of a loved one.",
      "example_cn": "她为失去亲人的家庭提供了精神慰藉。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by simplicity, innocence, and harmony with nature, often used to describe literature, music, or art that contrasts with urban complexity.",
      "explanation_cn": "以简朴、纯真和与自然的和谐为特征，常用于描述与城市复杂性形成对比的文学、音乐或艺术作品。",
      "example_en": "The poet's pastoral tone offered a soothing escape from the noise of modern city life.",
      "example_cn": "这位诗人的田园风格为人们提供了一种逃离现代都市喧嚣的宁静慰藉。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rural",
      "analysis": "“Rural”（乡村的）是一个中性、客观的地理术语，仅指位于城市以外的地区，不带有情感或美学色彩。而 “pastoral” 不仅描述地理位置，更强调一种理想化、诗意化的乡村生活图景，常带有怀旧或浪漫的审美倾向。"
    },
    {
      "word_to_compare": "countryside",
      "analysis": "“Countryside” 是一个名词，泛指乡村地区本身，而 “pastoral” 是形容词，用于修饰或描述该地区的氛围、风格或艺术表现。例如，你可以生活在 countryside，但只有当它被描绘得宁静如画时，才称得上 pastoral。"
    },
    {
      "word_to_compare": "ecclesiastical",
      "analysis": "“Ecclesiastical”（教会的）专指与宗教机构、教义或教会体制相关的事物，范围更广、更正式。而 “pastoral” 在宗教语境中特指牧师对信徒的个人关怀与精神指导，更侧重于人与人之间的关怀行为，而非制度或仪式。"
    }
  ]
}