{
  "word": "pastel",
  "pronunciation": "pah·stel",
  "concise_definition": "n. 柔和的色彩, 色粉画; adj. 柔和的, 淡雅的",
  "forms": {
    "plural": "pastels"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A soft, pale color, often associated with lightness and gentleness, such as baby blue, lavender, or mint green, typically used in design and fashion to convey calmness or elegance.",
      "explanation_cn": "一种柔和、淡雅的色彩，常与轻盈和温柔相关，如婴儿蓝、薰衣草紫或薄荷绿，常用于设计和时尚中以传达宁静或优雅的感觉。",
      "example_en": "She chose a pastel yellow dress for the spring wedding.",
      "example_cn": "她为这场春季婚礼挑选了一条淡黄色的连衣裙。"
    },
    {
      "pos": "noun",
      "explanation_en": "A drawing medium made of powdered pigments mixed with a binder, formed into sticks and used for creating soft, blended artworks with a matte finish.",
      "explanation_cn": "一种绘画媒介，由颜料粉末与粘合剂混合制成条状，用于创作具有哑光效果的柔和、渐变的绘画作品。",
      "example_en": "The artist used pastels to capture the delicate light of dawn on the mountains.",
      "example_cn": "这位艺术家使用色粉笔捕捉了晨光洒在山峦上的细腻光影。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that has a soft, light, and muted color tone, often perceived as soothing or delicate.",
      "explanation_cn": "形容某物具有柔和、浅淡且低饱和度的色调，通常给人以舒缓或精致的感觉。",
      "example_en": "The nursery was decorated in pastel tones to create a calming atmosphere.",
      "example_cn": "婴儿房以淡雅的色调装饰，以营造宁静的氛围。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pale",
      "analysis": "“Pale”（苍白的）强调颜色的浅淡或缺乏饱和度，常带有虚弱、病态或褪色的负面联想，如‘pale skin’。而 ‘pastel’ 是一种有意识选择的、美学上的柔和色调，带有积极、优雅的意味，专指设计中精心调配的淡色系。"
    },
    {
      "word_to_compare": "tint",
      "analysis": "“Tint”（浅色）指在纯色中加入白色后形成的变浅颜色，是一个技术性术语，常用于色彩理论。而 ‘pastel’ 不仅指颜色的浅淡，更强调一种特定的视觉风格和情感氛围，常用于艺术、时尚和室内设计语境中，范围比 ‘tint’ 更广且更具审美导向。"
    },
    {
      "word_to_compare": "watercolor",
      "analysis": "“Watercolor”（水彩）是一种绘画技法和媒介，使用水溶性颜料，强调透明感和流动性。而 ‘pastel’ 是一种固体颜料棒，不依赖水，能产生更浓烈、更直接的色彩覆盖和纹理。虽然两者都可产生柔和效果，但媒介和技法本质不同。"
    }
  ]
}