{
  "word": "pat",
  "pronunciation": "pat",
  "concise_definition": "n. 轻拍, 轻敲; v. 轻拍, 轻敲",
  "forms": {
    "third_person_singular": "pats",
    "past_tense": "patted",
    "past_participle": "patted",
    "present_participle": "pattering"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A light, quick tap or strike, often with the hand, typically expressing affection, reassurance, or casual attention.",
      "explanation_cn": "指用手轻轻、快速地拍打或敲击，通常表达喜爱、安慰或随意的关注。",
      "example_en": "She gave the dog a gentle pat on the head.",
      "example_cn": "她轻轻拍了拍狗的头。"
    },
    {
      "pos": "noun",
      "explanation_en": "A formulaic, overly simplistic, or clichéd remark, often used to describe speech that sounds insincere or overly comforting.",
      "explanation_cn": "指一种公式化、过于简单化或陈词滥调的言论，常用来形容听起来虚伪或过度安慰的话。",
      "example_en": "His speech was full of pat answers to complex problems.",
      "example_cn": "他的演讲充斥着对复杂问题的陈词滥调式回答。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strike something lightly and repeatedly with the hand or a flat object, especially to show affection or comfort.",
      "explanation_cn": "用手或扁平物体轻柔而重复地拍打某物，尤指表达喜爱或安慰。",
      "example_en": "He patted his pockets to make sure he had his keys.",
      "example_cn": "他拍了拍口袋，确认钥匙还在。"
    },
    {
      "pos": "verb",
      "explanation_en": "To apply something with a light, even motion, such as spreading a substance or pressing it gently onto a surface.",
      "explanation_cn": "以轻柔、均匀的动作涂抹或按压某物，如将物质轻敷于表面。",
      "example_en": "She patted the moisturizer onto her face.",
      "example_cn": "她将保湿霜轻轻拍在脸上。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tap",
      "analysis": "“Tap”（轻敲）更强调短暂、轻微的接触，常用于机械或节奏性动作，如敲击键盘或水龙头滴水；而 “pat” 更具情感色彩，常用于人际互动，带有温柔或安抚的意味。"
    },
    {
      "word_to_compare": "stroke",
      "analysis": "“Stroke”（抚摸）指连续、滑动式的轻触，通常更缓慢、更温柔，常用于表达亲密或安抚，如抚摸头发；而 “pat” 是短促、断续的拍打，动作更机械、更表面，情感浓度较低。"
    },
    {
      "word_to_compare": "pamper",
      "analysis": "“Pamper”（宠溺）指通过大量照顾或提供舒适来取悦某人，是一种持续性的行为；而 “pat” 是一个瞬间动作，即使带有情感，也不代表持续的关怀，仅是象征性的表达。"
    }
  ]
}