{
  "word": "pathological",
  "pronunciation": "path·uh·loj·i·kuhl",
  "concise_definition": "adj. 病理的, 病态的, 过度的, 失控的",
  "forms": {
    "comparative": "pathological",
    "superlative": "pathological"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to pathology; caused by or associated with a physical disease or abnormal condition in the body, especially as studied in medical science.",
      "explanation_cn": "与病理学相关的；由身体的疾病或异常状况引起或与其相关的，尤指在医学科学中研究的病变状态。",
      "example_en": "The patient showed pathological changes in liver tissue under microscopic examination.",
      "example_cn": "显微镜检查显示该患者肝脏组织出现了病理性改变。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by extreme, irrational, or compulsive behavior that resembles a mental or emotional disorder, often beyond normal limits of reason or control.",
      "explanation_cn": "指表现出极端、非理性或强迫性的行为，类似于精神或情绪障碍，往往超出理性和控制的正常界限。",
      "example_en": "His pathological need for approval made it impossible for him to make independent decisions.",
      "example_cn": "他对认可的病态需求使他无法做出独立的决定。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Excessively intense or exaggerated to the point of being abnormal or dysfunctional, often used metaphorically to describe behaviors or tendencies.",
      "explanation_cn": "指强度或程度过度夸张，达到异常或功能失调的地步，常用于隐喻性地描述某种行为或倾向。",
      "example_en": "The company had a pathological fear of taking any financial risk.",
      "example_cn": "这家公司对承担任何财务风险有着病态的恐惧。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "clinical",
      "analysis": "“Clinical”（临床的）强调客观、科学、基于医学观察的特性，常用于描述诊断、数据或态度的中立性，如“clinical detachment”（临床的超然）。而 “pathological” 强调的是异常、病变或功能失调的本质，带有负面或失常的含义，不仅限于医学语境，也可用于心理或行为层面。"
    },
    {
      "word_to_compare": "abnormal",
      "analysis": "“Abnormal”（异常的）是一个广泛使用的中性词，泛指偏离常态，不一定是病理性的，如“abnormal weather”（异常天气）。“Pathological” 则特指由疾病、损伤或深层心理障碍引起的异常，具有更强的医学或心理学内涵，暗示更严重、更系统性的失常。"
    },
    {
      "word_to_compare": "compulsive",
      "analysis": "“Compulsive”（强迫性的）描述的是无法控制的冲动或行为，常用于心理学术语如“compulsive behavior”。“Pathological” 可包含“compulsive”的含义，但范围更广，不仅指行为冲动，还可指生理病变、情绪失调或系统性失衡，是更上位的术语。一个行为可以是病理性的，但不一定表现为强迫性。"
    }
  ]
}