{
  "word": "pathology",
  "pronunciation": "puh·thol·uh·jee",
  "concise_definition": "n. 病理学, 病理状态, 病变",
  "forms": {
    "plural": "pathologies"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The scientific study of the causes, mechanisms, and effects of diseases, including the structural and functional changes in tissues and organs caused by disease.",
      "explanation_cn": "指研究疾病的原因、机制及其影响的科学，包括疾病引起的组织和器官在结构与功能上的变化。",
      "example_en": "She pursued a career in pathology after completing her medical degree.",
      "example_cn": "她在完成医学学位后投身于病理学领域。"
    },
    {
      "pos": "noun",
      "explanation_en": "The specific nature or pattern of a disease process in a particular organ or system, often used to describe abnormal physiological or structural changes.",
      "explanation_cn": "指某一器官或系统中疾病过程的具体性质或模式，常用于描述异常的生理或结构变化。",
      "example_en": "The pathology of Alzheimer’s disease involves the accumulation of amyloid plaques in the brain.",
      "example_cn": "阿尔茨海默病的病理特征是大脑中淀粉样斑块的积累。"
    },
    {
      "pos": "noun",
      "explanation_en": "A condition or process characterized by abnormal or diseased functioning, often used metaphorically to describe systemic dysfunction in social, political, or organizational contexts.",
      "explanation_cn": "指一种异常或病态的运行状态，常用于隐喻性地描述社会、政治或组织体系中的系统性 dysfunction。",
      "example_en": "The pathology of corruption has undermined public trust in government institutions.",
      "example_cn": "腐败的病态机制已经削弱了公众对政府机构的信任。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "disease",
      "analysis": "“Disease” (疾病) 指具体的健康异常状态或病症，如糖尿病、肺炎，是病理学研究的对象；而 “pathology” 是研究这些疾病的科学本身，或指疾病所引发的结构与功能变化，是更抽象、更学术的概念。"
    },
    {
      "word_to_compare": "syndrome",
      "analysis": "“Syndrome” (综合征) 指一组同时出现的症状和体征，通常有共同的病因，但不一定明确病理机制；而 “pathology” 关注的是这些症状背后的组织和细胞层面的生物学变化，是更深层的机制解释。"
    },
    {
      "word_to_compare": "morphology",
      "analysis": "“Morphology” (形态学) 仅研究生物体的形态结构，如细胞形状、组织排列；而 “pathology” 包含形态学，但更广泛，还包括功能变化、病因和发病机制，是形态学与生理学、病因学的综合。"
    }
  ]
}