{
  "word": "patrol",
  "pronunciation": "puh·trohl",
  "concise_definition": "n. 巡逻, 巡视; v. 巡逻, 巡视",
  "forms": {
    "third_person_singular": "patrols",
    "past_tense": "patrolled",
    "past_participle": "patrolled",
    "present_participle": "patrolling",
    "plural": "patrols"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A regular, systematic movement or circuit made by police, military personnel, or security staff to monitor an area, ensure safety, and deter crime or unauthorized activity.",
      "explanation_cn": "指警察、军人或安保人员为监控区域、确保安全并阻止犯罪或未经授权的活动而进行的有规律、系统性的巡视路线或行动。",
      "example_en": "The police conducted a nightly patrol around the neighborhood to prevent burglaries.",
      "example_cn": "警察每晚在社区周围巡逻，以防止入室盗窃。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of personnel assigned to carry out such a movement, or the specific route they follow.",
      "explanation_cn": "指被指派执行巡逻任务的人员群体，或他们所遵循的特定路线。",
      "example_en": "The border patrol was alerted when the sensors detected movement near the fence.",
      "example_cn": "当传感器检测到围栏附近有移动时，边境巡逻队被警报触发。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move regularly through an area, especially for the purpose of maintaining order, security, or surveillance.",
      "explanation_cn": "指为了维持秩序、安全或监控而有规律地在某一区域移动。",
      "example_en": "Security guards patrol the building every hour to check for intruders.",
      "example_cn": "保安每小时巡逻一次大楼，检查是否有入侵者。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a routine inspection or journey, often in a vehicle or on foot, to observe conditions or enforce rules.",
      "explanation_cn": "指以常规方式（通常步行或乘车）进行检查或行程，以观察状况或执行规则。",
      "example_en": "The coast guard patrols the shoreline to prevent illegal fishing.",
      "example_cn": "海岸警卫队沿海岸线巡逻，以防止非法捕鱼。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "inspect",
      "analysis": "“Inspect” (检查) 强调对某物或某地进行仔细、正式的查看，通常是为了评估状态、合规性或缺陷，不一定涉及移动或持续监控。而 “patrol” 强调在空间中持续移动的监控行为，目的是预防而非事后评估。"
    },
    {
      "word_to_compare": "guard",
      "analysis": "“Guard” (守卫) 指固定或半固定地保护某个地点、人物或物品，通常停留在一个位置。而 “patrol” 是动态的，涉及在多个地点之间移动，覆盖更广的区域。"
    },
    {
      "word_to_compare": "monitor",
      "analysis": "“Monitor” (监控) 通常指通过技术手段（如摄像头、传感器）持续观察，不一定需要人员亲自移动。而 “patrol” 强调人员亲自在实地进行巡视，具有更强的威慑力和现场响应能力。"
    }
  ]
}