{
  "word": "patrols",
  "pronunciation": "puh·trohls",
  "concise_definition": "n. 巡逻, 巡视; v. 巡逻, 巡视",
  "forms": {
    "singular": "patrol",
    "third_person_singular": "patrols",
    "past_tense": "patrolled",
    "past_participle": "patrolled",
    "present_participle": "patrolling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A systematic movement or circuit made by police, military personnel, or security guards to monitor an area, ensure safety, and deter criminal or unauthorized activity.",
      "explanation_cn": "指警察、军人或安保人员为监控区域、确保安全并阻止犯罪或未经授权行为而进行的系统性巡视或巡逻。",
      "example_en": "The police increased night patrols after a series of burglaries.",
      "example_cn": "在一系列入室盗窃案发生后，警方加强了夜间巡逻。"
    },
    {
      "pos": "noun",
      "explanation_en": "The area or route that is regularly monitored by a patrol unit, often defined by boundaries or checkpoints.",
      "explanation_cn": "指由巡逻单位定期监控的特定区域或路线，通常由边界或检查点界定。",
      "example_en": "The soldiers were assigned to patrol the northern border.",
      "example_cn": "士兵们被派往北部边境执行巡逻任务。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move regularly through an area, especially for the purpose of maintaining order, security, or surveillance.",
      "explanation_cn": "指为了维持秩序、安全或监控目的而定期在某一区域移动。",
      "example_en": "Security guards patrol the building every hour.",
      "example_cn": "保安人员每小时在大楼内巡逻一次。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a routine inspection or surveillance of a territory, often in a military or law enforcement context.",
      "explanation_cn": "指在军事或执法背景下对某一领土进行例行检查或监视。",
      "example_en": "The coast guard patrols the waters to prevent smuggling.",
      "example_cn": "海岸警卫队在海上巡逻以防止走私。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rounds",
      "analysis": "“Rounds” (巡视) 通常指在固定路线或区域内进行的例行检查，常用于医疗、监狱或工厂环境，强调周期性和程序性，但不一定具有执法或安全威慑目的。而 “patrols” 更强调动态监控、安全防范和对外部威胁的响应，常与警察或军队相关。"
    },
    {
      "word_to_compare": "surveillance",
      "analysis": "“Surveillance” (监视) 指通过技术手段（如摄像头、监听）或隐蔽方式持续观察目标，通常不涉及人员移动。而 “patrols” 是主动的、物理性的移动巡视，强调人员在场和直接干预的可能性。"
    },
    {
      "word_to_compare": "inspection",
      "analysis": "“Inspection” (检查) 是一次性的、目的明确的正式审查，如建筑安全检查或产品质量检验，通常有预设标准和报告要求。而 “patrols” 是持续性、非特定目标的日常监控行为，更注重预防而非评估。"
    }
  ]
}