{
  "word": "paving",
  "pronunciation": "pey·ving",
  "concise_definition": "n. 铺路, 铺设; v. 铺设, 为...铺路",
  "forms": {
    "base_form": "pave",
    "third_person_singular": "paves",
    "past_tense": "paved",
    "past_participle": "paved",
    "present_participle": "paving"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The surface or material used to cover a road, path, or other area with a hard, durable layer, typically made of asphalt, concrete, or stone.",
      "explanation_cn": "指用于覆盖道路、小径或其他区域的坚硬、耐用表面材料，通常由沥青、混凝土或石料制成。",
      "example_en": "The city invested millions in new paving for the downtown streets.",
      "example_cn": "市政府投资数百万美元用于市中心街道的新铺装。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process of laying down a hard surface on a road or path; the act of preparing a foundation for future progress or development.",
      "explanation_cn": "指铺设硬质表面的过程；也可比喻为为未来的进展或发展奠定基础。",
      "example_en": "The paving of the highway took two years to complete.",
      "example_cn": "这条高速公路的铺设花了两年时间才完成。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover a surface, especially a road or path, with a hard, flat material such as asphalt or concrete.",
      "explanation_cn": "指用沥青、混凝土等坚硬平整的材料覆盖表面，尤其是道路或小径。",
      "example_en": "Workers are paving the sidewalk in front of the library.",
      "example_cn": "工人们正在图书馆前的人行道上铺设路面。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make it easier for something to happen by preparing the way or removing obstacles; to lay the groundwork for a future event or development.",
      "explanation_cn": "指通过扫清障碍或为某事做好准备，使某事更容易发生；比喻为未来的事件或发展奠定基础。",
      "example_en": "The new policy is paving the way for greater economic cooperation between the two countries.",
      "example_cn": "这项新政策为两国之间更大的经济合作铺平了道路。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "surfacing",
      "analysis": "“Surfacing”（表面处理）是一个更广泛的术语，泛指为任何表面添加覆盖层，可能包括草地、沙地或软质材料，不一定要求坚硬或耐久。而 “paving” 特指使用坚硬材料（如石料、沥青）进行永久性、承重性铺设，强调功能性和结构强度。"
    },
    {
      "word_to_compare": "cobble",
      "analysis": "“Cobble”（铺鹅卵石）是“paving”的一种具体形式，特指用不规则的石块（鹅卵石）铺设路面，常见于历史街道。而 “paving” 是一个更通用的术语，涵盖现代材料如混凝土和沥青，结构更统一、平整。"
    },
    {
      "word_to_compare": "lay",
      "analysis": "“Lay”（铺设）是一个通用动词，可用于铺设地毯、电缆、管道等，语义范围远大于 “pave”。而 “pave” 专指铺设硬质道路表面，具有明确的工程和建筑语境，不能用于非道路场景。"
    }
  ]
}