{
  "word": "peacock",
  "pronunciation": "pee·kawk",
  "concise_definition": "n. 孔雀, 雄孔雀; v. 耀武扬威, 炫耀",
  "forms": {
    "plural": "peacocks",
    "third_person_singular": "peacocks",
    "past_tense": "peacocked",
    "past_participle": "peacocked",
    "present_participle": "peacocking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A male peafowl, known for its strikingly colorful and elaborate tail feathers that it displays in a fan-like shape, especially during courtship.",
      "explanation_cn": "雄性孔雀，以其鲜艳夺目、华丽繁复的尾羽著称，尤其在求偶时会展开成扇形展示。",
      "example_en": "The peacock spread its iridescent tail feathers to attract a mate.",
      "example_cn": "那只孔雀展开它彩虹般的尾羽以吸引配偶。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who behaves in a showy, ostentatious, or self-admiring way, often to attract attention or impress others.",
      "explanation_cn": "指行为浮夸、炫耀或自我陶醉的人，常为了吸引注意或给他人留下印象。",
      "example_en": "He's such a peacock at parties, always wearing the brightest clothes and talking the loudest.",
      "example_cn": "他在派对上总是个爱炫耀的人，总是穿着最鲜艳的衣服，说话声音最大。"
    },
    {
      "pos": "verb",
      "explanation_en": "To behave in a proud, showy, or boastful manner, especially by displaying one's abilities, possessions, or appearance to gain admiration.",
      "explanation_cn": "以骄傲、炫耀或自夸的方式行事，尤其通过展示自己的能力、财产或外表来博取钦佩。",
      "example_en": "She peacocks around in her new designer clothes, hoping everyone will notice.",
      "example_cn": "她穿着新买的设计师服装到处炫耀，希望人人都注意到她。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "proud",
      "analysis": "“Proud” (骄傲的) 是一个形容词，描述一种内在的情感状态，可能带有积极或消极的含义，如因成就而自豪或因自负而傲慢。而 “peacock” 作为动词或名词时，更强调外在的、表演性的炫耀行为，带有明显的贬义色彩。"
    },
    {
      "word_to_compare": "showoff",
      "analysis": "“Showoff” (爱炫耀的人) 与 “peacock” 作为名词时含义非常接近，都指通过夸张行为吸引注意的人。但 “showoff” 更口语化、更直接，且不涉及视觉形象；而 “peacock” 因其源于孔雀开屏的意象，自带强烈的视觉和美学联想，更具文学性和讽刺意味。"
    },
    {
      "word_to_compare": "flaunt",
      "analysis": "“Flaunt” (炫耀) 是一个动词，强调故意展示某物（如财富、美貌）以引起他人注意，常用于物质层面。而 “peacock” 不仅指展示，还隐含一种自我陶醉、姿态夸张的表演性质，更侧重行为方式而非展示对象本身。"
    }
  ]
}