{
  "word": "peeling",
  "pronunciation": "peel·ing",
  "concise_definition": "n. 剥落, 剥皮; v. 剥离, 剥皮",
  "forms": {
    "base_form": "peel",
    "third_person_singular": "peels",
    "past_tense": "peeled",
    "past_participle": "peeled",
    "present_participle": "peeling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act or process of removing the outer layer or skin from something, such as fruit, vegetables, or paint.",
      "explanation_cn": "指从某物（如水果、蔬菜或油漆）表面移除外层或表皮的行为或过程。",
      "example_en": "The peeling of the orange revealed the juicy segments inside.",
      "example_cn": "剥开橙子的外皮，露出了里面多汁的果瓣。"
    },
    {
      "pos": "noun",
      "explanation_en": "The condition or result of a surface losing its outer layer, especially due to weathering, aging, or damage (e.g., paint peeling from a wall).",
      "explanation_cn": "指表面因风化、老化或损坏而失去外层的状态或结果（例如墙壁上的油漆剥落）。",
      "example_en": "The old house had extensive peeling on its exterior walls.",
      "example_cn": "这栋老房子的外墙有大面积的剥落。"
    },
    {
      "pos": "noun",
      "explanation_en": "The shedding of dead skin cells from the surface of the skin, often after sunburn or chemical treatment.",
      "explanation_cn": "指皮肤表面死皮细胞的脱落，常发生在晒伤或化学处理后。",
      "example_en": "After the chemical peel, she experienced mild peeling for several days.",
      "example_cn": "化学换肤后，她连续几天出现了轻微的脱皮。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove the outer layer or skin from something, typically using hands or a tool.",
      "explanation_cn": "指用手或工具移除某物的外层或表皮。",
      "example_en": "He was peeling potatoes for the stew.",
      "example_cn": "他正在为炖菜削土豆皮。"
    },
    {
      "pos": "verb",
      "explanation_en": "To come off in layers or strips, especially due to deterioration or exposure.",
      "explanation_cn": "指因劣化或暴露而以层状或条状脱落。",
      "example_en": "The wallpaper is peeling away from the damp wall.",
      "example_cn": "墙纸正从潮湿的墙上剥落。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "shedding",
      "analysis": "“Shedding”（脱落）泛指任何物体自然或非自然地失去外层物质，常用于毛发、羽毛、鳞片等生物组织的脱落，语义更广泛。而 “peeling” 更强调以层状、片状方式剥离，通常用于非生物表面，如油漆、皮肤或果皮。"
    },
    {
      "word_to_compare": "scraping",
      "analysis": "“Scraping”（刮除）指用硬物（如刀片、刷子）主动刮掉表面物质，动作更具机械性和强制性。而 “peeling” 通常是较轻柔、分层地剥离，有时是自然发生的，不一定需要工具。"
    },
    {
      "word_to_compare": "stripping",
      "analysis": "“Stripping”（剥离）常用于工业或技术语境，指系统性地移除涂层、覆盖物或装饰层（如剥漆、剥线），强调目的性和完整性。而 “peeling” 更偏向描述一种渐进、不规则、甚至意外的脱落过程，语气更生活化。"
    }
  ]
}