{
  "word": "peg",
  "pronunciation": "peg",
  "concise_definition": "n. 木钉, 挂钩; v. 挂, 固定, 使固定",
  "forms": {
    "plural": "pegs",
    "third_person_singular": "pegs",
    "past_tense": "pegged",
    "past_participle": "pegged",
    "present_participle": "pegging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small, usually cylindrical piece of wood, metal, or plastic used to fasten, support, or hang objects, such as clothes on a clothesline or a picture on a wall.",
      "explanation_cn": "一种小的、通常为圆柱形的木制、金属或塑料制品，用于固定、支撑或悬挂物体，例如挂在衣绳上的衣物或墙上的画框。",
      "example_en": "She hung her coat on a wooden peg beside the door.",
      "example_cn": "她把外套挂在门边的一个木钉上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A fixed position or level used as a reference point, especially in expressions like 'on a peg' or 'set the pegs'.",
      "explanation_cn": "用作参考点的固定位置或水平，常用于表达如 'on a peg' 或 'set the pegs'，表示某种标准或等级。",
      "example_en": "The company's profits are pegged to the inflation rate.",
      "example_cn": "该公司的利润与通货膨胀率挂钩。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fasten or attach something using a peg, or to fix something firmly in place.",
      "explanation_cn": "使用木钉或挂钩将某物固定或挂住，或使某物牢固地处于某一位置。",
      "example_en": "He pegged the laundry to the line with clothespins.",
      "example_cn": "他用衣夹把衣服晾在绳子上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To assign or fix something to a particular level, category, or value, often in a limiting or oversimplified way.",
      "explanation_cn": "将某物限定或固定在某一特定水平、类别或价值上，常带有简化或局限的意味。",
      "example_en": "The media tends to peg celebrities as either heroes or villains.",
      "example_cn": "媒体往往把名人简单地定性为英雄或恶棍。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "nail",
      "analysis": "“Nail”（钉子）通常指金属制成、靠敲击固定的尖头紧固件，用于结构性连接，如钉入木材。而 “peg” 多为圆柱形，常通过插入孔洞实现固定，不依赖敲击，更常用于轻型悬挂或临时固定，如衣架或游戏中的木钉。"
    },
    {
      "word_to_compare": "hook",
      "analysis": "“Hook”（钩子）是弯曲的金属或塑料装置，用于悬挂物体，依靠其弧形结构承载重量。而 “peg” 是直的、通常为圆柱形，依靠摩擦力或插入孔洞固定，结构更简单，多用于平面固定，如墙上的挂钉。"
    },
    {
      "word_to_compare": "pin",
      "analysis": "“Pin”（别针/销钉）通常细长、有尖端，用于临时穿刺固定，如别领针或缝纫针。而 “peg” 更粗壮，多用于承重悬挂或结构性定位，如高尔夫球洞中的木桩，其固定方式更依赖插入而非穿刺。"
    }
  ]
}