{
  "word": "pegasus",
  "pronunciation": "peh·gah·suhs",
  "concise_definition": "n. 天马, 飞马 (希腊神话中的有翼神马)",
  "forms": {
    "plural": "pegasi"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A mythical winged horse from Greek mythology, born from the blood of Medusa after her death, known for its ability to fly and for creating springs by striking the ground with its hooves.",
      "explanation_cn": "希腊神话中一只长有翅膀的神马，由美杜莎被杀后流出的血液所生，以其飞行能力著称，并能用蹄子击地创造出泉水。",
      "example_en": "According to legend, Pegasus was tamed by the hero Bellerophon, who rode him to defeat the Chimera.",
      "example_cn": "据传说，英雄柏勒洛丰驯服了天马佩加索斯，并骑着它击败了奇美拉。"
    },
    {
      "pos": "noun",
      "explanation_en": "A symbol of poetic inspiration and artistic creativity, often associated with the Muses and the spring Hippocrene on Mount Helicon.",
      "explanation_cn": "象征诗歌灵感与艺术创造力，常与缪斯女神及赫利孔山上的希波克瑞涅泉联系在一起。",
      "example_en": "The poet invoked Pegasus to help him find the words that would move the hearts of his readers.",
      "example_cn": "这位诗人祈求佩加索斯赐予他能打动读者心灵的词句。"
    },
    {
      "pos": "noun",
      "explanation_en": "A name used for various modern entities, such as satellites, aircraft, or companies, often to evoke qualities of speed, freedom, or celestial power.",
      "explanation_cn": "用于指代现代各种实体（如卫星、飞机或公司）的名称，常为唤起速度、自由或天界力量的意象。",
      "example_en": "NASA named one of its space missions Pegasus to reflect its swift and agile launch capabilities.",
      "example_cn": "美国宇航局将一项太空任务命名为‘天马’，以体现其快速而灵活的发射能力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "unicorn",
      "analysis": "“Unicorn”（独角兽）是神话中一种单角马形生物，象征纯洁、稀有与神秘，通常与女性、魔法或神圣力量相关；而 “Pegasus” 是有翼马，象征自由、灵感与英雄气概，更强调动态与行动力。两者虽均为神话生物，但文化寓意和视觉特征截然不同。"
    },
    {
      "word_to_compare": "griffin",
      "analysis": "“Griffin”（狮鹫）是狮身鹰首的混合生物，象征力量与警觉，常作为守护者出现在徽章与建筑中；而 “Pegasus” 是纯粹的马形生物，仅具翅膀，代表优雅、灵性与艺术灵感，其形象更偏向于飞翔与升华，而非防御或威严。"
    },
    {
      "word_to_compare": "hippocampus",
      "analysis": "“Hippocampus”（海马）是希腊神话中一种半马半鱼的海兽，常作为海神波塞冬的坐骑，象征海洋的力量与神秘；而 “Pegasus” 是陆地与天空的生物，象征精神的超越与诗歌的升华。两者虽都与马有关，但栖息环境与象征体系完全不同。"
    }
  ]
}