{
  "word": "pen",
  "pronunciation": "pen",
  "concise_definition": "n. 笔, 笔记本, 笼子; v. 写, 关进笼子",
  "forms": {
    "plural": "pens",
    "third_person_singular": "pens",
    "past_tense": "penned",
    "past_participle": "penned",
    "present_participle": "penning"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A writing instrument, typically with a pointed tip and ink, used to apply ink to a surface such as paper.",
      "explanation_cn": "一种书写工具，通常带有尖头和墨水，用于将墨水施加在纸张等表面上。",
      "example_en": "She signed the contract with a sleek black pen.",
      "example_cn": "她用一支精致的黑色钢笔签了合同。"
    },
    {
      "pos": "noun",
      "explanation_en": "An enclosure, usually made of wire or wood, for confining animals such as pigs, sheep, or rabbits.",
      "explanation_cn": "一种由金属丝或木材制成的围栏，用于圈养猪、羊或兔子等动物。",
      "example_en": "The farmer built a new pen for his goats near the barn.",
      "example_cn": "农夫在谷仓旁为他的山羊建了一个新围栏。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small notebook or booklet, especially one used for writing notes or sketches.",
      "explanation_cn": "一本小笔记本或小册子，尤指用于记笔记或素描的。",
      "example_en": "He kept a leather-bound pen in his jacket pocket for quick ideas.",
      "example_cn": "他总在夹克口袋里放一本皮面笔记本，以便随时记录灵感。"
    },
    {
      "pos": "verb",
      "explanation_en": "To write or compose something, especially in a thoughtful or artistic way.",
      "explanation_cn": "指以深思熟虑或富有艺术性的方式写作或创作。",
      "example_en": "She penned a heartfelt letter to her childhood friend.",
      "example_cn": "她给儿时的朋友写了一封真挚的信。"
    },
    {
      "pos": "verb",
      "explanation_en": "To confine or enclose animals in a pen.",
      "explanation_cn": "指将动物关进围栏中。",
      "example_en": "The rancher penned the sheep before sunset.",
      "example_cn": "牧民在日落前把羊群赶进了围栏。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pencil",
      "analysis": "“Pencil”（铅笔）使用石墨芯，可擦除，常用于草稿或绘图；而 “pen” 使用墨水，书写更持久、清晰，常用于正式文件。两者都是书写工具，但 “pen” 更强调不可逆性和正式性。"
    },
    {
      "word_to_compare": "enclosure",
      "analysis": "“Enclosure”（围栏/封闭区域）是更广泛的术语，泛指任何封闭空间，包括围墙、栅栏、保护区等；而 “pen” 是特指用于圈养动物的小型围栏，语义更具体、常用于农业或动物管理语境。"
    },
    {
      "word_to_compare": "write",
      "analysis": "“Write”（写）是通用动词，泛指任何书写行为；而 “pen” 作为动词时带有文学性或艺术性色彩，暗示精心创作，常用于描述文学作品、信件或诗歌的创作，语体更正式、优雅。"
    }
  ]
}