{
  "word": "pension",
  "pronunciation": "pen·shən",
  "concise_definition": "n. 养老金, 退休金; v. 给予退休金",
  "forms": {
    "plural": "pensions",
    "third_person_singular": "pensions",
    "past_tense": "pensioned",
    "past_participle": "pensioned",
    "present_participle": "pensioning"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A regular payment made to a person after they retire from work, typically funded by an employer, government, or personal savings plan, intended to support their living expenses in old age.",
      "explanation_cn": "指个人退休后定期领取的款项，通常由雇主、政府或个人储蓄计划提供，用于支持其老年时期的生活开支。",
      "example_en": "After 40 years of service, he received a generous pension from his former company.",
      "example_cn": "在服务了四十年后，他从以前的公司领到了一笔丰厚的退休金。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sum of money paid regularly to someone as a benefit, especially in recognition of past service, even if not related to retirement (e.g., military or disability pension).",
      "explanation_cn": "指为表彰过去的服务而定期支付的一笔款项，即使与退休无关（如军职退休金或残疾抚恤金）。",
      "example_en": "She receives a disability pension due to injuries sustained during her military service.",
      "example_cn": "她因服役期间受伤而领取残疾抚恤金。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provide someone with a pension, especially upon retirement or due to long service or disability.",
      "explanation_cn": "指向某人发放退休金，通常是在其退休、长期服务或因残疾时。",
      "example_en": "The government pensioned off the veteran after 35 years of active duty.",
      "example_cn": "政府在那位老兵服役三十五年后为他办理了退休并发放养老金。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "salary",
      "analysis": "“Salary”（薪水）是员工在任职期间定期获得的报酬，通常按月支付，与当前工作直接相关。而 “pension” 是退休后才开始领取的长期福利，与过去的服务挂钩，不再依赖于当前劳动。"
    },
    {
      "word_to_compare": "allowance",
      "analysis": "“Allowance”（津贴）通常指为特定用途（如儿童零花钱、交通补贴）发放的定期小额款项，范围更广、用途更灵活，不一定与退休或长期服务相关。而 “pension” 是一种制度化的、以养老或服务补偿为目的的正式支付。"
    },
    {
      "word_to_compare": "benefit",
      "analysis": "“Benefit”（福利）是一个广义词，涵盖各种社会保障或公司提供的援助，如医疗保险、失业救济等。而 “pension” 是 “benefit” 的一种具体形式，特指退休后定期支付的经济支持，具有更强的专指性和长期性。"
    }
  ]
}