{
  "word": "pepper",
  "pronunciation": "pep·er",
  "concise_definition": "n. 胡椒, 辣椒; v. 撒上胡椒, 密集分布",
  "forms": {
    "plural": "peppers",
    "third_person_singular": "peppers",
    "past_tense": "peppered",
    "past_participle": "peppered",
    "present_participle": "peppering"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A pungent spice made from the dried berries of the Piper nigrum plant, commonly used to season food; can refer to black, white, green, or red pepper.",
      "explanation_cn": "一种由胡椒植物（Piper nigrum）干燥浆果制成的辛辣香料，常用于调味食物；可指黑胡椒、白胡椒、青胡椒或红胡椒。",
      "example_en": "She added a pinch of black pepper to the soup for extra flavor.",
      "example_cn": "她往汤里撒了一小撮黑胡椒以增添风味。"
    },
    {
      "pos": "noun",
      "explanation_en": "A fruit or vegetable from the Capsicum genus, typically spicy or sweet, used in cooking; commonly known as bell pepper or chili pepper.",
      "explanation_cn": "茄科辣椒属植物的果实，通常味道辛辣或甜味，常用于烹饪；俗称甜椒或辣椒。",
      "example_en": "He chopped up some red peppers and added them to the stir-fry.",
      "example_cn": "他切了一些红辣椒，加入炒菜中。"
    },
    {
      "pos": "verb",
      "explanation_en": "To sprinkle or scatter something, especially small objects or elements, over a surface or area in a random or dense pattern.",
      "explanation_cn": "将某物（尤指小物件或元素）随机或密集地撒布在表面或区域上。",
      "example_en": "The field was peppered with bullet holes after the shootout.",
      "example_cn": "枪战过后，这片田野上布满了弹孔。"
    },
    {
      "pos": "verb",
      "explanation_en": "To season food with pepper, especially black pepper, to enhance its flavor.",
      "explanation_cn": "用胡椒（尤指黑胡椒）给食物调味，以增强其风味。",
      "example_en": "Don't forget to pepper the steak before grilling it.",
      "example_cn": "烤牛排前别忘了撒上胡椒。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "spice",
      "analysis": "“Spice”（香料）是更广泛的类别，泛指所有用于调味的植物性物质，如肉桂、姜、丁香等。而 “pepper” 是一种具体的香料，特指胡椒类，是 spice 的子集。所有 pepper 都是 spice，但并非所有 spice 都是 pepper。"
    },
    {
      "word_to_compare": "sprinkle",
      "analysis": "“Sprinkle”（撒）强调轻柔、均匀地散布少量物质，常用于糖、盐、面粉等，语气较温和。而 “pepper” 作为动词时，暗示密集、随机、甚至杂乱的散布，常用于负面或强烈语境，如弹孔、问题、批评等，带有更强的视觉冲击力。"
    },
    {
      "word_to_compare": "dot",
      "analysis": "“Dot”（点状分布）指零星、稀疏、有间隔地分布，如地图上的点或星星点点的灯光。而 “pepper” 指密集、连续、几乎覆盖式的分布，数量远多于 “dot”，更强调数量和无规律性。"
    }
  ]
}