{
  "word": "perch",
  "pronunciation": "pɜrch",
  "concise_definition": "n. 栖木, 高处; v. 停歇, 栖息",
  "forms": {
    "third_person_singular": "perches",
    "past_tense": "perched",
    "past_participle": "perched",
    "present_participle": "perching"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A narrow horizontal bar or branch on which a bird rests or sits, especially one placed for that purpose in a cage or aviary.",
      "explanation_cn": "指鸟类栖息的狭窄水平杆或树枝，尤指为鸟类栖息而设置在笼子或鸟舍中的木条。",
      "example_en": "The robin sat quietly on its perch, singing a sweet melody.",
      "example_cn": "知更鸟安静地停在栖木上，唱着甜美的歌。"
    },
    {
      "pos": "noun",
      "explanation_en": "A high or elevated position from which one can observe or have a commanding view, often used metaphorically.",
      "explanation_cn": "指一个高处或突出的位置，可用于观察或拥有主导视野，常用于比喻意义。",
      "example_en": "From his perch on the hilltop, he could see the entire valley.",
      "example_cn": "从山顶的高处，他可以俯瞰整个山谷。"
    },
    {
      "pos": "verb",
      "explanation_en": "To sit or rest on a narrow or elevated surface, especially in a balanced or precarious way, as a bird does.",
      "explanation_cn": "指像鸟一样停歇或坐在狭窄或高处的表面上，通常呈平衡或不稳定的姿态。",
      "example_en": "The cat perched on the windowsill, watching the birds outside.",
      "example_cn": "猫蹲在窗台上，注视着外面的鸟儿。"
    },
    {
      "pos": "verb",
      "explanation_en": "To place or position oneself in a high or prominent location, often to observe or assert authority.",
      "explanation_cn": "指将自己置于高处或显著位置，通常是为了观察或彰显权威。",
      "example_en": "She perched herself on the edge of the desk to address the team.",
      "example_cn": "她坐在办公桌边缘，向团队发表讲话。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "roost",
      "analysis": "“Roost”（栖息）通常特指鸟类夜间休息或过夜的场所，强调安全和集体性，常用于复数形式（roosts）。而 “perch” 更泛指任何短暂停歇的支撑物，不限于夜间，也不一定涉及群体行为。"
    },
    {
      "word_to_compare": "sit",
      "analysis": "“Sit”（坐）是最通用的动词，泛指任何坐下动作，无位置限制；而 “perch” 强调在狭窄、高处或不稳定表面上的轻盈、警觉性坐姿，带有动态和视觉上的特殊意象，语义更具体、生动。"
    },
    {
      "word_to_compare": "vantage point",
      "analysis": "“Vantage point”（制高点）是名词，专指观察或监视的有利位置，强调视角优势，是抽象概念；而 “perch” 作为名词时，既可指物理的栖木，也可比喻性地指高处位置，但更强调身体的停驻状态，更具画面感和动作关联性。"
    }
  ]
}