{
  "word": "performing",
  "pronunciation": "pər·fɔr·mɪŋ",
  "concise_definition": "v. 表演, 执行, 履行; adj. 表演的, 演出的",
  "forms": {
    "base_form": "perform",
    "third_person_singular": "performs",
    "past_tense": "performed",
    "past_participle": "performed",
    "present_participle": "performing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To carry out an action, task, or function, especially in a skillful, effective, or noticeable way; often used in contexts of duty, responsibility, or technical operation.",
      "explanation_cn": "指以熟练、有效或显著的方式执行一项行动、任务或职能，常用于描述职责履行或技术操作。",
      "example_en": "The athlete performed exceptionally well under pressure.",
      "example_cn": "这位运动员在压力下表现出色。"
    },
    {
      "pos": "verb",
      "explanation_en": "To present a theatrical, musical, or artistic work before an audience; to act, sing, dance, or play music in a public show.",
      "explanation_cn": "指在观众面前呈现戏剧、音乐或艺术作品；在公开演出中表演、歌唱、跳舞或演奏音乐。",
      "example_en": "She is performing Shakespeare's Hamlet at the Royal Theatre this month.",
      "example_cn": "本月她将在皇家剧院出演莎士比亚的《哈姆雷特》。"
    },
    {
      "pos": "verb",
      "explanation_en": "To function or operate in a specified manner, especially of machines, systems, or software.",
      "explanation_cn": "指（机器、系统或软件）以某种特定方式运行或运作。",
      "example_en": "The new software is performing faster than the previous version.",
      "example_cn": "新软件的运行速度比旧版本更快。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or involved in a performance, especially in the context of arts or entertainment.",
      "explanation_cn": "与表演或演出相关的，尤指艺术或娱乐领域。",
      "example_en": "He is a performing artist with years of stage experience.",
      "example_cn": "他是一位拥有多年舞台经验的表演艺术家。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "execute",
      "analysis": "“Execute” (执行) 更强调精确、正式或程序化地完成一项任务，常用于法律、军事或技术语境，如执行命令或代码。而 “performing” 更广泛，可包含情感表达、艺术呈现或非正式操作，语义更丰富、更具表现力。"
    },
    {
      "word_to_compare": "act",
      "analysis": "“Act” (表演/行动) 在艺术语境中与 “performing” 可互换，但 “act” 更侧重于扮演角色或模仿行为，而 “performing” 可涵盖更广的演出形式，如演奏乐器、舞蹈或杂技，不限于角色扮演。在非艺术语境中，“act” 常含“假装”之意，而 “performing” 无此贬义。"
    },
    {
      "word_to_compare": "operate",
      "analysis": "“Operate” (操作) 专指对机器、系统或设备的控制与运行，强调功能性与技术性，如操作机床或手术。而 “performing” 在此语境下虽可指系统运行，但更常用于描述整体表现效果，而非具体操控过程。"
    }
  ]
}