{
  "word": "permits",
  "pronunciation": "pər·mɪts",
  "concise_definition": "n. 许可证, 批准; v. 允许, 许可",
  "forms": {
    "singular": "permit",
    "third_person_singular": "permits",
    "past_tense": "permitted",
    "past_participle": "permitted",
    "present_participle": "permitting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An official document or authorization issued by an authority that allows a specific action, activity, or use to take place, often regulated by law or policy.",
      "explanation_cn": "指由权威机构签发的正式文件或授权，允许某项特定行为、活动或用途发生，通常受法律或政策规范。",
      "example_en": "You need a building permit before starting construction on your house.",
      "example_cn": "在开始建造房屋之前，你需要获得建筑许可证。"
    },
    {
      "pos": "noun",
      "explanation_en": "A formal right or privilege granted to someone to do something, often in a controlled or restricted context.",
      "explanation_cn": "指在受控或受限情境下，授予某人做某事的正式权利或特权。",
      "example_en": "The fishing permit allows you to catch up to five trout per day.",
      "example_cn": "这个钓鱼许可证允许你每天捕捞最多五条鳟鱼。"
    },
    {
      "pos": "verb",
      "explanation_en": "To allow or authorize something to happen, often by formal rule or policy, sometimes reluctantly or conditionally.",
      "explanation_cn": "指根据正式规则或政策允许某事发生，有时是勉强或附条件地准许。",
      "example_en": "The school does not permit the use of mobile phones during class.",
      "example_cn": "学校不允许学生在上课期间使用手机。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make something possible or feasible, often by removing restrictions or creating conditions for an outcome.",
      "explanation_cn": "指通过消除限制或创造有利条件，使某事成为可能或可行。",
      "example_en": "The new policy permits greater flexibility in work hours.",
      "example_cn": "这项新政策使工作时间更具弹性。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "license",
      "analysis": "“License”（许可证）与 “permit” 非常接近，常可互换，但 “license” 更常用于商业、专业资格或技术领域（如驾驶执照、软件许可证），带有更强的官方认证意味；而 “permit” 更广泛用于行政管理或日常活动的授权（如施工许可、活动许可），语气更中性。"
    },
    {
      "word_to_compare": "allow",
      "analysis": "“Allow”（允许）是更通用、非正式的动词，强调主观或日常的许可，不必然涉及正式文件或制度；而 “permit” 更正式，常用于法律、规章或官方语境，隐含制度性授权。例如：妈妈允许孩子看电视（allow），但政府许可建房（permit）。"
    },
    {
      "word_to_compare": "authorize",
      "analysis": "“Authorize”（授权）强调赋予某人权力或资格去执行某事，通常由上级或机构做出决定，侧重于权力的转移；而 “permit” 更侧重于“准许行为发生”，不一定涉及权力授予，仅表示不禁止。例如：经理授权员工签字（authorize），但公园允许野餐（permit）。"
    }
  ]
}