{
  "word": "persia",
  "pronunciation": "pur·zee·uh",
  "concise_definition": "n. 波斯（古代帝国），波斯人，波斯语",
  "forms": {
    "adjective": "Persian"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An ancient empire in southwestern Asia, centered in modern-day Iran, which flourished from around 550 BCE to 330 BCE under dynasties such as the Achaemenids, and later revived under the Parthians and Sassanids.",
      "explanation_cn": "位于西亚（今伊朗境内）的古代帝国，公元前550年至公元前330年间在阿契美尼德王朝等统治下达到鼎盛，后由帕提亚和萨珊王朝复兴。",
      "example_en": "The Persian Empire was one of the largest and most powerful empires in ancient history.",
      "example_cn": "波斯帝国是古代历史上最大、最强大的帝国之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person originating from Persia or modern-day Iran; also used historically to refer to the ethnic Persian population.",
      "explanation_cn": "指来自波斯或现代伊朗的人；历史上也用于指波斯民族。",
      "example_en": "Many Persian poets, such as Rumi and Hafez, have had a profound influence on world literature.",
      "example_cn": "许多波斯诗人，如鲁米和哈菲兹，对世界文学产生了深远影响。"
    },
    {
      "pos": "noun",
      "explanation_en": "The official language of Iran, also known as Farsi, which belongs to the Indo-Iranian branch of the Indo-European language family.",
      "explanation_cn": "伊朗的官方语言，又称波斯语（Farsi），属于印欧语系印度-伊朗语族。",
      "example_en": "She studied Persian for three years to read classical poetry in its original form.",
      "example_cn": "她学习了三年波斯语，以便阅读古典诗歌的原文。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "iran",
      "analysis": "“Iran” 是现代国家的名称，自1935年起正式取代“Persia”作为国名，指当代的政治地理实体；而 “Persia” 是历史术语，主要指古代帝国及其文化传统。两者地理范围大致重叠，但语义重心不同：Iran 强调现代国家，Persia 强调历史文化。"
    },
    {
      "word_to_compare": "middle_east",
      "analysis": "“Middle East”（中东）是一个现代地理和政治术语，涵盖从埃及到阿富汗的广大地区，包括多个民族和国家；而 “Persia” 仅特指以波斯文化为核心的古代帝国及其后裔，范围更小、文化更单一。Persia 是 Middle East 的一部分，但 Middle East 不等于 Persia。"
    },
    {
      "word_to_compare": "farsi",
      "analysis": "“Farsi” 是波斯语的本地名称，是波斯语的母语者使用的术语；而 “Persian” 是英语中对该语言的正式称呼，也用于指代文化、民族和历史背景。两者指同一种语言，但 “Persian” 的语义范围更广，可涵盖历史、文学和民族身份，而 “Farsi” 仅指语言本身。"
    }
  ]
}