{
  "word": "petition",
  "pronunciation": "pə·tish·ən",
  "concise_definition": "n. 请愿, 请愿书; v. 请愿, 请求",
  "forms": {
    "third_person_singular": "petitions",
    "past_tense": "petitioned",
    "past_participle": "petitioned",
    "present_participle": "petitioning"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A formal written request, typically signed by many people, addressed to an authority or organization, asking for a specific action or change.",
      "explanation_cn": "指由多人签署的正式书面请求，提交给权威机构或组织，要求采取特定行动或实现某种改变。",
      "example_en": "The residents submitted a petition to the city council demanding better public transportation.",
      "example_cn": "居民们向市议会提交了一份请愿书，要求改善公共交通。"
    },
    {
      "pos": "noun",
      "explanation_en": "A legal document filed in court to request a specific judicial action or remedy.",
      "explanation_cn": "指在法庭上提交的正式法律文件，请求法院采取特定的司法行动或提供救济。",
      "example_en": "The lawyer filed a petition for habeas corpus on behalf of the detained client.",
      "example_cn": "律师代表被拘留的客户提交了人身保护令申请。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a formal request, especially in writing or through organized effort, to an authority or institution.",
      "explanation_cn": "指以正式方式（通常为书面或通过有组织的努力）向权威机构或组织提出请求。",
      "example_en": "Activists petitioned the government to reduce carbon emissions.",
      "example_cn": "活动人士向政府请愿，要求减少碳排放。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a humble or earnest appeal, often in a personal or emotional context.",
      "explanation_cn": "指以谦卑或诚恳的方式提出请求，常用于个人或情感语境中。",
      "example_en": "She petitioned her parents for permission to study abroad.",
      "example_cn": "她恳求父母允许她出国留学。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "request",
      "analysis": "“Request”（请求）是一个通用词，指任何表达愿望或需要的行为，可以是口头或书面、正式或非正式的。而 “petition” 特指有组织、正式、通常有签名支持的书面请求，尤其针对权威机构，具有更强的集体性和程序性。"
    },
    {
      "word_to_compare": "appeal",
      "analysis": "“Appeal”（上诉/呼吁）可指对法律裁决的正式申诉，也可指情感上的恳求。它更侧重于对已做决定的挑战或情感上的打动，而 “petition” 更强调主动提出一项新的诉求，通常不涉及推翻既有决定。"
    },
    {
      "word_to_compare": "application",
      "analysis": "“Application”（申请）通常用于正式程序中，如申请学校、工作或签证，强调符合既定规则和流程的提交行为。而 “petition” 更侧重于争取改变或纠正不公，常带有社会或政治诉求的色彩，不一定遵循标准化流程。"
    }
  ]
}