{
  "word": "physiological",
  "pronunciation": "fiz·ee·uh·lol·uh·jih·kuhl",
  "concise_definition": "adj. 生理的, 生理学的",
  "forms": {
    "comparative": "more physiological",
    "superlative": "most physiological"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to physiology, which is the branch of biology that studies the normal functions and processes of living organisms and their parts.",
      "explanation_cn": "与生理学相关的，即生物学中研究生物体及其组成部分正常功能和过程的分支。",
      "example_en": "The drug affects physiological processes such as heart rate and blood pressure.",
      "example_cn": "这种药物会影响心率和血压等生理过程。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing bodily functions or responses that occur naturally and involuntarily, as opposed to psychological or emotional ones.",
      "explanation_cn": "描述那些自然发生、非自愿的身体功能或反应，与心理或情绪反应相对。",
      "example_en": "Her physiological response to stress included increased sweating and a rapid heartbeat.",
      "example_cn": "她对压力的生理反应包括出汗增多和心跳加速。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Based on or derived from the physical and biological mechanisms of the body, often used to distinguish from psychological, social, or cultural factors.",
      "explanation_cn": "基于或源自身体的物理和生物机制，常用于区别于心理、社会或文化因素。",
      "example_en": "The study distinguishes between physiological hunger and emotional eating.",
      "example_cn": "这项研究区分了生理性的饥饿和情绪性进食。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "biological",
      "analysis": "“Biological”（生物的）范围更广，涵盖所有与生命体相关的特征，包括遗传、进化、生态等；而 “physiological” 专指生物体内部的功能性运作，如代谢、循环、神经传导等，更侧重于动态过程而非结构或类别。"
    },
    {
      "word_to_compare": "anatomical",
      "analysis": "“Anatomical”（解剖的）描述的是身体的结构和组织形态，如器官位置、肌肉分布；而 “physiological” 关注的是这些结构如何运作，即功能而非形态。例如：心脏的解剖结构 vs. 心脏的生理泵血功能。"
    },
    {
      "word_to_compare": "psychological",
      "analysis": "“Psychological”（心理的）指与思维、情绪、认知相关的内在过程；而 “physiological” 指身体层面的、可测量的生物反应。两者常被对比，如：焦虑的心理体验 vs. 焦虑引发的肾上腺素升高这一生理反应。"
    }
  ]
}