{
  "word": "physical",
  "pronunciation": "fiz·i·kuhl",
  "concise_definition": "adj. 物理的, 肉体的, 物质的, 体力的",
  "forms": {
    "comparative": "more physical",
    "superlative": "most physical"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to the body or to material things as opposed to the mind or spirit; concerned with the material world and tangible properties.",
      "explanation_cn": "指与身体或物质实体相关，而非与思想或精神相关；涉及物质世界和可感知的属性。",
      "example_en": "She recovered quickly after the physical injury to her leg.",
      "example_cn": "她的腿部受到物理性损伤后很快康复了。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Concerned with the laws and properties of matter and energy, as in physics; describing phenomena governed by natural science rather than abstract thought.",
      "explanation_cn": "指与物质和能量的规律及性质相关，即物理学范畴的；描述由自然科学而非抽象思维所支配的现象。",
      "example_en": "The physical properties of water include its boiling point and density.",
      "example_cn": "水的物理性质包括其沸点和密度。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Involving bodily activity or exertion, especially in contrast to mental or emotional effort.",
      "explanation_cn": "指涉及身体活动或体力消耗，尤其与脑力或情感努力相对。",
      "example_en": "He prefers physical activities like hiking and swimming over sedentary hobbies.",
      "example_cn": "他更喜欢徒步和游泳这类体力活动，而不是久坐的爱好。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Perceptible by the senses; real and tangible rather than imaginary or abstract.",
      "explanation_cn": "指能被感官察觉的；真实可触的，而非想象或抽象的。",
      "example_en": "There was no physical evidence linking him to the crime scene.",
      "example_cn": "没有任何实物证据将他与犯罪现场联系起来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "material",
      "analysis": "“Material”（物质的）强调由具体物质构成，常用于哲学或法律语境中，指可被占有或衡量的实体，如财产。而 “physical” 更广泛地涵盖所有可感知的、符合自然规律的属性，包括运动、能量、力等，范围更广。"
    },
    {
      "word_to_compare": "bodily",
      "analysis": "“Bodily”（身体的）专指与人体直接相关的，如 bodily harm（身体伤害），语义范围较窄，仅限于人体。而 “physical” 不仅可指人体，还可指物质世界、物理现象，适用范围更广。"
    },
    {
      "word_to_compare": "tangible",
      "analysis": "“Tangible”（有形的）强调可触摸或可明确感知的现实性，常用于抽象概念的对比（如 tangible benefits）。它侧重于“可感知性”，而 “physical” 更强调符合物理学规律的客观存在，包含不可触摸但可测量的属性（如磁场、重力）。"
    }
  ]
}