{
  "word": "picasso",
  "pronunciation": "pee·kah·soh",
  "concise_definition": "n. 毕加索（西班牙著名画家），引申为天才艺术家或现代艺术的象征",
  "forms": {
    "proper_noun": true
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Pablo Picasso (1881–1973), a Spanish painter, sculptor, and printmaker, widely regarded as one of the most influential artists of the 20th century and a co-founder of Cubism.",
      "explanation_cn": "巴勃罗·毕加索（1881–1973），西班牙画家、雕塑家和版画家，被广泛认为是20世纪最具影响力的艺术家之一，立体主义的创始人之一。",
      "example_en": "The museum's latest exhibition features over 200 works by Picasso.",
      "example_cn": "该博物馆的最新展览展出了超过200件毕加索的作品。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is exceptionally creative or innovative in art or design, often used metaphorically to describe someone with extraordinary artistic talent.",
      "explanation_cn": "指在艺术或设计方面具有非凡创造力或创新力的人，常用于隐喻，形容拥有超凡艺术才华的人。",
      "example_en": "She’s a Picasso when it comes to arranging flowers—every bouquet looks like a masterpiece.",
      "example_cn": "她在插花方面是个毕加索——每一束花都像一件杰作。"
    },
    {
      "pos": "noun",
      "explanation_en": "A symbol or shorthand reference to modern art, especially abstract or avant-garde styles associated with Picasso’s revolutionary techniques.",
      "explanation_cn": "指现代艺术的象征，尤其是与毕加索革命性技法相关的抽象或前卫风格。",
      "example_en": "The gallery’s collection leans heavily toward Picasso—bold shapes, fractured perspectives, and emotional intensity.",
      "example_cn": "这家画廊的收藏以‘毕加索风格’为主——大胆的造型、破碎的视角和强烈的情感表达。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "monet",
      "analysis": "“Monet”（莫奈）代表印象派的光影与自然氛围，强调瞬间的视觉感受与柔和的色彩过渡；而 “Picasso” 则象征现代艺术的解构与重构，强调形式的颠覆与情感的抽象表达。前者是自然的诗意记录，后者是理性的视觉革命。"
    },
    {
      "word_to_compare": "da Vinci",
      "analysis": "“Da Vinci”（达·芬奇）代表文艺复兴时期科学与艺术的完美融合，追求精确比例、解剖真实与和谐美感；而 “Picasso” 打破传统透视与写实，拥抱主观表达与多视角并置。前者是古典理性的巅峰，后者是现代感性的宣言。"
    },
    {
      "word_to_compare": "artist",
      "analysis": "“Artist”（艺术家）是泛指从事艺术创作的人，中性且广泛；而 “Picasso” 作为专有名词，承载了特定的历史地位、风格标签与文化象征，具有强烈的个性与权威性。用 “Picasso” 代替 “artist” 是一种修辞上的升格，暗示超凡的原创性与影响力。"
    }
  ]
}