{
  "word": "pickup",
  "pronunciation": "pik·up",
  "concise_definition": "n. 拾起, 接载, 临时搬运; v. 拾起, 接载, 购买, 恢复",
  "forms": {
    "third_person_singular": "pickups",
    "past_tense": "picked up",
    "past_participle": "picked up",
    "present_participle": "picking up"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A vehicle, especially a light truck with an open cargo bed, designed for transporting goods or equipment.",
      "explanation_cn": "指一种轻型卡车，通常带有开放式货箱，用于运输货物或设备。",
      "example_en": "He drives a red pickup truck to carry tools to job sites.",
      "example_cn": "他开一辆红色皮卡去工地运送工具。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of collecting or taking someone or something up, especially from a designated location (e.g., a person from a place or goods from a warehouse).",
      "explanation_cn": "指从指定地点接载某人或取走某物的行为（如从车站接人或从仓库提货）。",
      "example_en": "The airport shuttle offers a free pickup service for hotel guests.",
      "example_cn": "机场班车为酒店客人提供免费接机服务。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden improvement or increase in something, especially after a period of decline or inactivity.",
      "explanation_cn": "指在经历衰退或停滞之后出现的突然改善或增长。",
      "example_en": "There’s been a pickup in sales since the new advertising campaign launched.",
      "example_cn": "自从新广告活动推出以来，销售额有所回升。"
    },
    {
      "pos": "verb",
      "explanation_en": "To lift or take up something from a surface or location, often with the hands.",
      "explanation_cn": "指用手将某物从表面或地点拿起或拾起。",
      "example_en": "She picked up the fallen pen and returned it to the desk.",
      "example_cn": "她捡起掉在地上的笔，放回了桌上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To collect or transport someone from a place, typically by vehicle.",
      "explanation_cn": "指用车辆从某地接载某人。",
      "example_en": "I’ll pick you up at 7 p.m. outside your apartment.",
      "example_cn": "我晚上七点在你公寓外接你。"
    },
    {
      "pos": "verb",
      "explanation_en": "To acquire or obtain something casually or quickly, often without much effort or planning.",
      "explanation_cn": "指轻松或随意地获得某物，通常无需太多努力或计划。",
      "example_en": "He picked up a few Spanish phrases during his trip to Mexico.",
      "example_cn": "他在墨西哥旅行期间学了几句西班牙语。"
    },
    {
      "pos": "verb",
      "explanation_en": "To resume or revive something that had been paused or declined, such as a conversation, activity, or performance.",
      "explanation_cn": "指重新开始或恢复曾暂停或衰退的事物，如对话、活动或表现。",
      "example_en": "After the break, the band picked up where they left off.",
      "example_cn": "休息后，乐队接着之前的地方继续演奏。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "collect",
      "analysis": "“Collect”（收集）强调系统性地聚集或汇集多个物品或信息，通常有明确的目的和计划，如收集邮票或数据。而 “pickup” 更侧重于一次性、临时性或顺路的取物行为，动作更随意、非正式。"
    },
    {
      "word_to_compare": "retrieve",
      "analysis": "“Retrieve”（取回）强调找回曾经丢失或存放起来的东西，常带有恢复、找回的语义，如 retrieve a file 或 retrieve a lost item。而 “pickup” 不一定涉及‘曾经拥有’的前提，更多是主动去接或拿取当前可见或可接触的物品。"
    },
    {
      "word_to_compare": "acquire",
      "analysis": "“Acquire”（获得）是更正式、广泛的词，可指通过购买、学习、继承等方式长期获得能力、财产或特质。而 “pickup” 作为动词时，常用于非正式语境，强调轻松、偶然或快速地获得，如语言、习惯或物品，带有‘无意中学会’的意味。"
    }
  ]
}