{
  "word": "picket",
  "pronunciation": "pik·it",
  "concise_definition": "n. 罢工纠察队; v. 组织纠察, 围堵抗议",
  "forms": {
    "third_person_singular": "pickets",
    "past_tense": "picketed",
    "past_participle": "picketed",
    "present_participle": "picketing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person or group of people who stand outside a workplace or venue to protest, often during a strike, in order to discourage others from entering or working.",
      "explanation_cn": "指在工作场所或场所外站立抗议的人或群体，通常在罢工期间，旨在阻止他人进入或继续工作。",
      "example_en": "The union members formed a picket line outside the factory to demand better wages.",
      "example_cn": "工会成员在工厂外组成纠察线，要求提高工资。"
    },
    {
      "pos": "noun",
      "explanation_en": "A long, pointed wooden or metal stake used for fencing or as a barrier, often driven into the ground.",
      "explanation_cn": "指一根长而尖的木桩或金属桩，用于围栏或作为屏障，通常被钉入地面。",
      "example_en": "The garden was enclosed by a wooden picket fence.",
      "example_cn": "花园被一道木制栅栏围了起来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To stand in a group outside a place as a form of protest, especially during a labor strike, to pressure employers or discourage others from crossing the line.",
      "explanation_cn": "指在某地外组成群体进行抗议，尤其在劳资罢工期间，以向雇主施压或阻止他人越过纠察线。",
      "example_en": "Workers picketed the headquarters to protest the company's decision to outsource jobs.",
      "example_cn": "工人在公司总部外举行纠察，抗议公司将工作外包的决定。"
    },
    {
      "pos": "verb",
      "explanation_en": "To surround or block access to a place with a line of protesters or barriers.",
      "explanation_cn": "指用抗议者或障碍物包围或封锁某地的入口。",
      "example_en": "Activists picketed the embassy to demand justice for political prisoners.",
      "example_cn": "活动人士在大使馆外举行抗议，要求为政治犯伸张正义。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "strike",
      "analysis": "“Strike” (罢工) 指工人集体停止工作以施压雇主，是行为本身；而 “picket” 是罢工期间的外在表现形式，即在场所外设立纠察线进行抗议。一个罢工可以没有纠察，但纠察通常伴随罢工发生。"
    },
    {
      "word_to_compare": "protest",
      "analysis": "“Protest” (抗议) 是一个更广泛的术语，泛指任何形式的公开反对行为，包括集会、游行、静坐等；而 “picket” 是一种特定类型的抗议，特指在工作场所或机构门口站岗示威，具有明确的物理位置和围堵意图。"
    },
    {
      "word_to_compare": "fence",
      "analysis": "“Fence” (围栏) 是一个通用词，泛指任何用于划分边界或提供屏障的结构；而 “picket” 作为名词时特指一种由尖桩组成的栅栏样式，常用于住宅花园，具有特定的外观和结构特征，是 fence 的一种子类型。"
    }
  ]
}