{
  "word": "picked",
  "pronunciation": "pikt",
  "concise_definition": "adj. 精选的, 挑选的; v. 挑选, 采摘, 拾起 (pick 的过去式和过去分词)",
  "forms": {
    "base_form": "pick",
    "third_person_singular": "picks",
    "present_participle": "picking",
    "past_tense": "picked",
    "past_participle": "picked"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Carefully selected or chosen as the best or most suitable from a group; implying high quality or exclusivity.",
      "explanation_cn": "从一组中精心挑选出来的，被认为是最好的或最合适的；暗示高品质或独特性。",
      "example_en": "She wore a picked outfit for the gala — every detail was perfect.",
      "example_cn": "她为晚宴穿了一套精心挑选的服装——每个细节都完美无瑕。"
    },
    {
      "pos": "verb",
      "explanation_en": "To choose or select something, often with care or preference, from among several options.",
      "explanation_cn": "从多个选项中仔细挑选或选择某物，通常带有偏好或特定标准。",
      "example_en": "He picked the red tie because it matched his shirt.",
      "example_cn": "他选了红色领带，因为这与他的衬衫相配。"
    },
    {
      "pos": "verb",
      "explanation_en": "To gather or harvest something, especially fruit, flowers, or crops, by hand.",
      "explanation_cn": "用手采摘或收获某物，尤指水果、花朵或农作物。",
      "example_en": "Farmers pick apples in the early autumn when they are ripe.",
      "example_cn": "农民在初秋果实成熟时采摘苹果。"
    },
    {
      "pos": "verb",
      "explanation_en": "To take something up or collect it from a surface, often with the fingers or a tool.",
      "explanation_cn": "用手指或工具从表面拾起或拿取某物。",
      "example_en": "She picked up her keys from the table before leaving.",
      "example_cn": "她离开前从桌上拾起了钥匙。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove or extract something, often in a quick or forceful manner (e.g., picking a lock or a wound).",
      "explanation_cn": "以迅速或用力的方式移除或取出某物（如开锁或抠伤口）。",
      "example_en": "The doctor warned him not to pick at the scab.",
      "example_cn": "医生警告他不要抠痂。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "selected",
      "analysis": "“Selected” (被选中的) 更强调经过正式或系统性筛选的过程，常用于书面语或正式语境，语气更中性；而 “picked” 更口语化，常暗示个人偏好、直觉或随意性，有时带有主观色彩。"
    },
    {
      "word_to_compare": "chosen",
      "analysis": "“Chosen” (被选中的) 与 “picked” 在很多语境中可互换，但 “chosen” 更常用于表达具有重大意义或情感分量的选择（如命运、伴侣），带有庄重感；而 “picked” 更日常、轻快，适用于普通选择。"
    },
    {
      "word_to_compare": "gathered",
      "analysis": "“Gathered” (收集) 强调将分散的物品聚集在一起，不一定涉及挑选，可能包含大量无差别收集；而 “picked” 在采摘或收集时隐含了选择性，只取其中一部分优质或所需之物。"
    }
  ]
}