{
  "word": "pickle",
  "pronunciation": "pik·l",
  "concise_definition": "n. 腌菜, 困境; v. 腌制, 使陷入困境",
  "forms": {
    "plural": "pickles",
    "third_person_singular": "pickles",
    "past_tense": "pickled",
    "past_participle": "pickled",
    "present_participle": "pickling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A food item, typically vegetables like cucumbers, preserved in vinegar or brine, often with spices, to enhance flavor and extend shelf life.",
      "explanation_cn": "指通过醋或盐水（常加香料）腌制保存的食物，通常是黄瓜等蔬菜，以增强风味并延长保质期。",
      "example_en": "She added a few dill pickles to her sandwich for extra tang.",
      "example_cn": "她在三明治里加了几根莳萝腌黄瓜，增添酸味。"
    },
    {
      "pos": "noun",
      "explanation_en": "A difficult or awkward situation, especially one from which it is hard to escape; often used in the phrase 'in a pickle'.",
      "explanation_cn": "指一种困难或尴尬的处境，尤其是难以摆脱的困境；常用于短语 'in a pickle'（陷入困境）。",
      "example_en": "After forgetting his keys and missing the bus, he was really in a pickle.",
      "example_cn": "他忘了带钥匙，又错过了公交车，真是陷入了困境。"
    },
    {
      "pos": "verb",
      "explanation_en": "To preserve food by soaking it in vinegar, brine, or a similar solution, often to impart flavor or prevent spoilage.",
      "explanation_cn": "指将食物浸泡在醋、盐水或类似溶液中以保存并赋予风味，防止变质。",
      "example_en": "They pickled radishes and carrots to enjoy during the winter months.",
      "example_cn": "他们腌制了萝卜和胡萝卜，以便在冬季食用。"
    },
    {
      "pos": "verb",
      "explanation_en": "To place someone in a difficult or problematic situation, often unintentionally.",
      "explanation_cn": "指使某人陷入困难或麻烦的境地，通常是无意中造成的。",
      "example_en": "His reckless spending pickled the entire family in debt.",
      "example_cn": "他挥霍无度，让全家陷入了债务困境。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "preserve",
      "analysis": "“Preserve” (保存) 是一个更广泛的术语，泛指通过各种方法（如冷藏、罐装、干燥）防止食物腐坏，不特指用酸性液体浸泡。而 “pickle” 是一种具体的保存方式，强调使用醋或盐水腌制，具有独特的风味转化效果。"
    },
    {
      "word_to_compare": "jam",
      "analysis": "“Jam” (困境) 与 “pickle” 在表示‘困境’时语义接近，但 ‘jam’ 更口语化且常用于英式英语，如 'in a jam'；而 ‘pickle’ 在美式英语中更常见，且带有更强烈的‘尴尬’或‘进退两难’的意味。两者都可互换，但 ‘pickle’ 更具形象性，暗示像腌菜一样被‘泡’在问题中。"
    },
    {
      "word_to_compare": "marinate",
      "analysis": "“Marinate” (腌渍) 指将食物浸泡在调味液中以增加风味，通常用于烹饪前的准备，时间较短，且不以长期保存为目的。而 ‘pickle’ 的核心目的是保存，腌制时间长，溶液酸性强，最终产物是可长期存放的食品。"
    }
  ]
}