{
  "word": "pickups",
  "pronunciation": "pik·ups",
  "concise_definition": "n. 拾起, 接载, 皮卡货车, 拾音器",
  "forms": {
    "singular": "pickup"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A vehicle with an open cargo bed at the rear, typically based on a truck chassis, used for transporting goods or equipment.",
      "explanation_cn": "一种后部带有开放式货箱的车辆，通常基于卡车底盘制造，用于运输货物或设备。",
      "example_en": "He drove his red pickup to the hardware store to buy lumber.",
      "example_cn": "他开着红色的皮卡去五金店买木料。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of picking up someone or something, especially in the context of transportation or collection.",
      "explanation_cn": "指接载某人或拾起某物的行为，尤其在交通或收集的语境中。",
      "example_en": "The airport shuttle offers free pickups from downtown hotels.",
      "example_cn": "机场班车提供从市中心酒店的免费接载服务。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device that converts vibrations from musical instruments (especially guitars) into electrical signals for amplification.",
      "explanation_cn": "一种将乐器（尤其是吉他）的振动转化为电信号以供放大播放的装置。",
      "example_en": "The guitarist replaced his old pickups to get a richer tone.",
      "example_cn": "这位吉他手更换了旧的拾音器，以获得更丰富的音色。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden increase or improvement, especially in sales, performance, or morale.",
      "explanation_cn": "指销售、表现或士气的突然上升或改善。",
      "example_en": "There was a noticeable pickup in customer traffic after the holiday sale.",
      "example_cn": "节假日促销后，顾客流量明显增加。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "truck",
      "analysis": "“Truck”（卡车）是更广泛的术语，泛指所有用于运输货物的大型车辆，包括厢式货车、拖车等。而 “pickup” 是卡车的一种特定类型，特指带有开放式货箱、兼具载人与载货功能的轻型卡车，通常更偏向个人或小型商业用途。"
    },
    {
      "word_to_compare": "collection",
      "analysis": "“Collection”（收集）强调系统性地聚集或收纳物品或人员，常用于抽象或组织行为（如邮票收藏、账款催收）。而 “pickup” 更侧重于一次性的、即时的接载或拾取动作，具有更强的物理性和即时性。"
    },
    {
      "word_to_compare": "sensor",
      "analysis": "“Sensor”（传感器）是泛指所有检测物理量并转换为信号的电子装置，如温度、压力传感器。而 “pickup” 是传感器的一种特殊类型，专用于音乐设备中捕捉机械振动，其功能和应用场景高度专业化，不适用于其他传感领域。"
    },
    {
      "word_to_compare": "boost",
      "analysis": "“Boost”（提升）是一个通用动词或名词，泛指任何形式的增强或促进，如信心提升、性能增强。而 “pickup” 在表示“增长”时，特指从低点开始的、可观察到的积极变化，常用于商业或经济语境，语气更具体、更口语化。"
    }
  ]
}