{
  "word": "picture",
  "pronunciation": "pik·chər",
  "concise_definition": "n. 图片, 照片, 画面, 情景; v. 描绘, 想象",
  "forms": {
    "plural": "pictures",
    "third_person_singular": "pictures",
    "past_tense": "pictured",
    "past_participle": "pictured",
    "present_participle": "picturing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A visual representation of a person, place, object, or scene, created by drawing, painting, photography, or digital means.",
      "explanation_cn": "指通过绘画、摄影、绘画或数字方式创作的对人物、地点、物体或场景的视觉表现。",
      "example_en": "She hung a beautiful picture of the mountains above the fireplace.",
      "example_cn": "她在壁炉上方挂了一幅美丽的群山图片。"
    },
    {
      "pos": "noun",
      "explanation_en": "A mental image or impression of something, often formed from description or imagination.",
      "explanation_cn": "指通过描述或想象形成的对某事物的心理图像或印象。",
      "example_en": "I can't picture what life was like in the 1800s without modern technology.",
      "example_cn": "我无法想象没有现代科技的19世纪生活是什么样子。"
    },
    {
      "pos": "noun",
      "explanation_en": "A situation or overall view of a circumstance, often used in the phrase 'the big picture' to refer to the complete context.",
      "explanation_cn": "指某种情况的整体状况或全貌，常用于短语 'the big picture' 中，表示完整的背景或全局。",
      "example_en": "We need to look at the bigger picture before making a final decision.",
      "example_cn": "在做出最终决定之前，我们需要从大局出发。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form a mental image of something; to imagine or visualize a scenario or concept.",
      "explanation_cn": "指在脑海中形成某事物的图像；想象或可视化一种情景或概念。",
      "example_en": "Can you picture yourself living on a remote island?",
      "example_cn": "你能想象自己住在一座偏远的岛上吗？"
    },
    {
      "pos": "verb",
      "explanation_en": "To depict or represent something visually, especially in art or media.",
      "explanation_cn": "指以视觉方式描绘或表现某事物，尤其在艺术或媒体中。",
      "example_en": "The artist pictured the storm in vivid colors on the canvas.",
      "example_cn": "这位艺术家用鲜明的色彩在画布上描绘了风暴的景象。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "image",
      "analysis": "“Image” (图像/形象) 更广泛，可指视觉图像、心理印象、公众形象等，常用于抽象语境（如品牌形象）。而 “picture” 更具体，通常指可看见的实体图像，如照片或绘画，也更常用于口语化的心理想象表达。"
    },
    {
      "word_to_compare": "photo",
      "analysis": "“Photo” (照片) 是 “picture” 的一种具体类型，特指通过摄影技术捕捉的图像。所有照片都是图片，但并非所有图片都是照片。 “Picture” 的范围更广，包括绘画、插图、数字图像等。"
    },
    {
      "word_to_compare": "scene",
      "analysis": "“Scene” (场景) 指特定时间或地点发生的事件或环境，强调动态或情境性，如戏剧场景、车祸现场。而 “picture” 更侧重静态的视觉呈现，即使用于比喻（如 'the picture of health'），也强调状态而非过程。"
    }
  ]
}