{
  "word": "pike",
  "pronunciation": "paɪk",
  "concise_definition": "n. 长矛, 尖峰, 高速公路收费口; v. 用长矛刺, 用尖物戳",
  "forms": {
    "third_person_singular": "pikes",
    "past_tense": "piked",
    "past_participle": "piked",
    "present_participle": "piking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long spear with a pointed metal head, historically used by infantry soldiers, especially in medieval and early modern warfare.",
      "explanation_cn": "一种带有金属尖头的长矛，历史上常用于步兵，尤其在中世纪和近代战争中。",
      "example_en": "The medieval soldiers formed a wall of pikes to repel the cavalry charge.",
      "example_cn": "中世纪士兵们组成一堵长矛之墙，以击退骑兵冲锋。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sharp, pointed peak or projection, especially of a mountain or rock formation.",
      "explanation_cn": "指山峰或岩石构造中的尖锐突出部分，尤指山巅或尖峰。",
      "example_en": "The hikers reached the pike of the mountain just as the sun rose.",
      "example_cn": "徒步者们在日出时分抵达了山峰之巅。"
    },
    {
      "pos": "noun",
      "explanation_en": "A toll road or a section of road where a fee is collected for passage, especially in North America.",
      "explanation_cn": "指收费公路，或北美地区收取通行费的道路路段。",
      "example_en": "We took the turnpike to avoid the congested city streets.",
      "example_cn": "我们上了收费公路，以避开拥堵的城市街道。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of freshwater fish with a long, slender body and a large mouth filled with sharp teeth, known for its aggressive predatory behavior.",
      "explanation_cn": "一种淡水鱼，身体细长，口大且布满尖牙，以凶猛的捕食习性著称。",
      "example_en": "The lake is famous for its large pike, which can grow over a meter in length.",
      "example_cn": "这个湖以体型巨大的梭鱼闻名，有些可长到一米以上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pierce or stab with a pike or similar pointed object.",
      "explanation_cn": "用长矛或类似的尖锐物体刺穿或戳刺。",
      "example_en": "The knight piked the enemy’s shield to break its defense.",
      "example_cn": "骑士用长矛刺穿了敌人的盾牌，以击破其防御。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "spear",
      "analysis": "“Spear”（矛）是更通用的术语，泛指任何类型的投掷或刺击长柄武器，而 “pike” 特指一种特别长、主要用于步兵方阵的重型长矛，通常长度超过三米，强调其战术用途和规模。"
    },
    {
      "word_to_compare": "peak",
      "analysis": "“Peak”（山峰）与 “pike” 在指山巅时可互换，但 “peak” 更常用于正式地理描述，而 “pike” 带有更尖锐、陡峭的视觉意象，多用于文学或口语中，且在北美英语中更常用于指收费公路。"
    },
    {
      "word_to_compare": "turnpike",
      "analysis": "“Turnpike” 是 “pike” 的一个复合词，特指收费公路，源于早期通过旋转栅门（turnpike）收费的机制。单独使用 “pike” 时，可作为 “turnpike” 的简略形式，尤其在美式英语中，如 “the Mass Pike”。"
    },
    {
      "word_to_compare": "bass",
      "analysis": "“Bass”（鲈鱼）是另一种常见的淡水鱼，体型较宽、口较小，性情相对温和；而 “pike”（梭鱼）体型细长、口大齿利，是顶级掠食者，两者在生态位和外形上截然不同，常被钓鱼者区分对待。"
    }
  ]
}