{
  "word": "piles",
  "pronunciation": "pīlz",
  "concise_definition": "n. 堆, 堆积物; v. 堆叠, 堆积 (第三人称单数形式)",
  "forms": {
    "singular": "pile",
    "past_tense": "piled",
    "past_participle": "piled",
    "present_participle": "piling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A large, untidy heap or stack of objects, often accumulated without order or arrangement.",
      "explanation_cn": "指大量无序堆积在一起的物品，通常杂乱无章地堆叠而成。",
      "example_en": "There were piles of books on the floor, making it hard to walk through the room.",
      "example_cn": "地板上堆着一大堆书，让人很难在房间里走动。"
    },
    {
      "pos": "noun",
      "explanation_en": "A long, sturdy post driven into the ground to support structures such as bridges, piers, or buildings, especially in soft or wet soil.",
      "explanation_cn": "指一根长而坚固的柱子，被打入地面以支撑桥梁、码头或建筑物，尤其用于松软或潮湿的土壤中。",
      "example_en": "The old pier was supported by wooden piles driven deep into the seabed.",
      "example_cn": "这座旧码头由深入海底的木桩支撑。"
    },
    {
      "pos": "verb",
      "explanation_en": "To stack or accumulate things in a large, often untidy, heap.",
      "explanation_cn": "指将物品堆叠或堆积成大量、常杂乱无章的一堆。",
      "example_en": "She piled her clothes on the bed before packing for the trip.",
      "example_cn": "她在打包旅行前把衣服堆在床上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To drive or force something into a position, especially a post or stake into the ground.",
      "explanation_cn": "指将某物（尤其是柱子或木桩）强行打入某处，特别是地面中。",
      "example_en": "Workers piled the concrete supports into the riverbed to build the new bridge.",
      "example_cn": "工人们将混凝土支撑桩打入河床，以建造新桥。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "heap",
      "analysis": "“Heap” (堆) 与 “pile” 非常接近，都指杂乱堆积的物体，但 “heap” 更强调无序和松散的状态，常带有负面含义；而 “pile” 可以是中性或正式用语，尤其在工程语境中专指结构支撑桩，这是 “heap” 所不具备的含义。"
    },
    {
      "word_to_compare": "stack",
      "analysis": "“Stack” (整齐的堆) 指有序、规则地叠放的物品，如书本、箱子，强调整齐性；而 “pile” 更常暗示杂乱、随意的堆积，两者在组织性上形成对比。"
    },
    {
      "word_to_compare": "mound",
      "analysis": "“Mound” (土丘) 通常指自然形成或人工堆起的隆起土堆，多用于地形描述，如坟墓或防御工事；而 “pile” 更广泛用于人造物的堆积，且可作动词使用，语义范围更广。"
    }
  ]
}