{
  "word": "pin",
  "pronunciation": "pin",
  "concise_definition": "n. 别针, 钉子, 针; v. 别住, 固定, 使不能动",
  "forms": {
    "plural": "pins",
    "third_person_singular": "pins",
    "past_tense": "pinned",
    "past_participle": "pinned",
    "present_participle": "pinning"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small, slender piece of metal with a sharp point and a head, used to fasten pieces of fabric or paper together, or to attach something to a surface.",
      "explanation_cn": "一种细长的金属制品，一端尖锐，另一端有头，用于将布料或纸张固定在一起，或将物品附着在表面上。",
      "example_en": "She fastened the badge to her jacket with a safety pin.",
      "example_cn": "她用一个安全别针把徽章别在夹克上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, pointed object used in games such as bowling or pinball, or as a target in sports.",
      "explanation_cn": "用于保龄球、弹珠机或体育运动中的小型尖状物体，通常作为目标物。",
      "example_en": "The bowler knocked down nine pins with one throw.",
      "example_cn": "这位保龄球手一掷就击倒了九个球瓶。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fasten or secure something with a pin or pins, often temporarily.",
      "explanation_cn": "用别针或钉子将某物固定或夹住，通常是暂时性的。",
      "example_en": "He pinned the flyer to the bulletin board.",
      "example_cn": "他把传单钉在布告栏上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hold someone or something firmly in place, often physically or metaphorically, preventing movement or escape.",
      "explanation_cn": "将某人或某物牢牢固定在原地，常指物理上或隐喻性地使其无法移动或逃脱。",
      "example_en": "The wrestler pinned his opponent to the mat.",
      "example_cn": "摔跤手把对手压在垫子上动弹不得。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fix or establish something firmly in the mind or memory, often through repetition or emphasis.",
      "explanation_cn": "通过重复或强调，将某事牢固地印在脑海或记忆中。",
      "example_en": "The teacher pinned the importance of grammar in students' minds.",
      "example_cn": "老师反复强调语法的重要性，使学生牢牢记住。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "clip",
      "analysis": "“Clip”（夹子）通常指一种利用弹簧或卡扣机制夹住物品的工具，如回形针或发夹，强调便捷性和可重复使用性，一般不刺穿材料。而 “pin” 通常通过尖端穿透材料实现固定，更强调穿透和临时固定的功能。"
    },
    {
      "word_to_compare": "nail",
      "analysis": "“Nail”（钉子）是用于建筑或木工中永久性固定的金属长钉，通常用锤子敲入，结构更坚固，不可轻易移除。而 “pin” 更小、更轻，多用于临时或装饰性固定，如别针或图钉。"
    },
    {
      "word_to_compare": "stake",
      "analysis": "“Stake”（木桩/桩子）是粗大的木制或金属杆，用于标记边界、支撑植物或固定帐篷，强调结构支撑和长期固定。而 “pin” 体积小、用途更灵活，常用于轻质材料或抽象意义上的‘固定’（如‘pin down a theory’）。"
    }
  ]
}