{
  "word": "pinched",
  "pronunciation": "pincht",
  "concise_definition": "adj. 紧缩的, 紧张的, 瘦削的, 吝啬的",
  "forms": {
    "base_form": "pinch",
    "present_participle": "pinching",
    "past_tense": "pinched",
    "past_participle": "pinched"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having a tight, drawn, or constricted appearance, often due to cold, hunger, pain, or stress; showing physical discomfort or strain.",
      "explanation_cn": "因寒冷、饥饿、疼痛或压力而显得紧绷、凹陷或收缩的外观，常表现出身体上的不适或紧张。",
      "example_en": "Her face looked pinched after days without sleep.",
      "example_cn": "连续几天没睡觉后，她的脸显得憔悴而紧绷。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Thin or emaciated, especially in a way that suggests poor health or lack of nourishment.",
      "explanation_cn": "瘦削的，尤其指因营养不良或健康状况不佳而显得消瘦。",
      "example_en": "The children had pinched faces and hollow eyes from malnutrition.",
      "example_cn": "这些孩子因营养不良而面容消瘦，双眼凹陷。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Stingy or miserly in spending money; characterized by excessive frugality or unwillingness to spend.",
      "explanation_cn": "在花钱上吝啬或小气的；表现出过度节俭或不愿支出的特征。",
      "example_en": "He gave a pinched smile when asked to donate to the charity.",
      "example_cn": "当被要求向慈善机构捐款时，他露出了一副吝啬的微笑。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Sounding tight, strained, or high-pitched, often due to emotion or physical tension.",
      "explanation_cn": "声音紧绷、紧张或尖细，通常因情绪或身体紧张所致。",
      "example_en": "She spoke in a pinched voice, trying to hide her fear.",
      "example_cn": "她用紧绷的声音说话，试图掩饰自己的恐惧。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "thin",
      "analysis": "“Thin” (瘦的) 是一个中性词，仅描述身体或物体的厚度或宽度较小，不带有情感色彩。而 “pinched” 强调因外部压力（如饥饿、寒冷、焦虑）导致的异常瘦削或紧缩，隐含负面或痛苦的意味。"
    },
    {
      "word_to_compare": "tight",
      "analysis": "“Tight” (紧的) 可用于描述物理上的紧绷（如衣服太紧）或情绪上的压抑，但不特指面部或声音的憔悴感。“Pinched” 更具体地指向因痛苦或吝啬而产生的面部表情或语调，具有更强的视觉和听觉意象。"
    },
    {
      "word_to_compare": "miserly",
      "analysis": "“Miserly” (吝啬的) 是一个纯粹描述金钱态度的形容词，专指极度不愿花钱。“Pinched” 在此语境下是其口语化、形象化的同义词，但还额外带有面部表情或语气上的表现，使吝啬显得更外显、更生动。"
    }
  ]
}