{
  "word": "pinch",
  "pronunciation": "pinch",
  "concise_definition": "n. 捏, 夹, 紧张; v. 捏, 夹, 偷窃, 紧缺",
  "forms": {
    "third_person_singular": "pinches",
    "past_tense": "pinched",
    "past_participle": "pinched",
    "present_participle": "pinching"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small amount of something, especially when scarce or hard to obtain; often used in the phrase 'in a pinch' to mean during a time of need.",
      "explanation_cn": "指少量的某物，尤其在稀缺或难以获得时；常用于短语 'in a pinch'（在紧要关头）表示在困难或紧急时刻。",
      "example_en": "Can you lend me a pinch of salt? I'm out.",
      "example_cn": "你能借我一点盐吗？我用完了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sharp, sudden pain caused by squeezing or pressing something between two surfaces, typically with the fingers or a tool.",
      "explanation_cn": "指用手指或工具夹压某物时产生的尖锐、突然的疼痛。",
      "example_en": "She felt a painful pinch on her finger when the door closed.",
      "example_cn": "门关上时，她的手指被夹了一下，疼得厉害。"
    },
    {
      "pos": "verb",
      "explanation_en": "To squeeze or press something between two surfaces, especially the thumb and one or two fingers.",
      "explanation_cn": "指用拇指和一个或两个手指夹住或挤压某物。",
      "example_en": "He pinched the candle wick to extinguish the flame.",
      "example_cn": "他捏住蜡烛的灯芯以熄灭火焰。"
    },
    {
      "pos": "verb",
      "explanation_en": "To steal or take something, especially in a small or sneaky way.",
      "explanation_cn": "指偷偷摸摸地偷走或拿走某物，通常是少量的。",
      "example_en": "Someone pinched my wallet during the concert.",
      "example_cn": "有人在音乐会上偷走了我的钱包。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make something tighter or more constricted, often to save money or resources.",
      "explanation_cn": "指使某物变得更紧或更受限制，通常是为了节省金钱或资源。",
      "example_en": "The company had to pinch pennies to survive the economic downturn.",
      "example_cn": "为了在经济衰退中生存，公司不得不精打细算。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "squeeze",
      "analysis": "“Squeeze”（挤压）强调施加压力使物体变形或从中挤出内容，范围更广，可用于液体、空间或抽象压力（如时间压力）。而 “pinch” 更具体地指用指尖夹压，动作更小、更集中，常伴随疼痛或轻微伤害。"
    },
    {
      "word_to_compare": "nibble",
      "analysis": "“Nibble”（啃咬）指小口地咬或吃，常用于食物，带有温和、试探性的动作。而 “pinch” 是夹捏，不涉及口腔或进食，更多用于物理动作或偷窃行为。两者动作部位和目的完全不同。"
    },
    {
      "word_to_compare": "steal",
      "analysis": "“Steal”（偷窃）是正式、通用的法律术语，指非法占有他人财物，程度严重。而 “pinch” 作为偷窃的同义词时，语气更口语化、轻描淡写，常用于非正式语境，暗示偷的量小或不严重，如 ‘pinch a cookie’。"
    }
  ]
}