{
  "word": "pinning",
  "pronunciation": "pin·ing",
  "concise_definition": "n. 别针, 别针固定, 钉住; v. 固定, 钉住, 使无法移动 (pin 的现在分词)",
  "forms": {
    "base_form": "pin",
    "third_person_singular": "pins",
    "past_tense": "pinned",
    "past_participle": "pinned",
    "present_participle": "pinning"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small, usually metal, fastener with a sharp point and a head, used to attach one thing to another, especially fabric or paper.",
      "explanation_cn": "一种通常由金属制成的小型固定物，带有尖头和头部，用于将一件物品（如布料或纸张）固定在另一件物品上。",
      "example_en": "She used a decorative pinning to hold her scarf in place.",
      "example_cn": "她用一枚装饰性别针将围巾固定住。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of securing or fastening something with a pin, or the state of being pinned down.",
      "explanation_cn": "使用别针进行固定的行为，或被别针固定住的状态。",
      "example_en": "The pinning of the poster to the bulletin board was done carefully to avoid tearing.",
      "example_cn": "为了不撕破海报，她小心地将它钉在公告板上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hold or fix something firmly in place, often physically with a pin or metaphorically by limiting movement or options.",
      "explanation_cn": "用别针或其他方式将某物牢固地固定在原位，也可比喻性地指限制某人的行动或选择。",
      "example_en": "The coach was pinning the opponent’s star player to the sideline.",
      "example_cn": "教练将对方的明星球员牢牢限制在边线附近。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause someone to be held accountable or blamed for something, often unfairly.",
      "explanation_cn": "将责任或指责强加于某人，通常带有不公平的意味。",
      "example_en": "The media was pinning the entire scandal on the junior official.",
      "example_cn": "媒体将整个丑闻的责任全推到了这位初级官员身上。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fastening",
      "analysis": "“Fastening”（固定）是一个更广泛的术语，泛指任何将物体连接或固定在一起的方法（如拉链、纽扣、胶水等），而 “pinning” 特指使用别针进行的固定，具有更具体的工具和动作含义。"
    },
    {
      "word_to_compare": "sticking",
      "analysis": "“Sticking”（粘贴）通常指通过粘性物质（如胶带、胶水）使物体附着，是化学或物理粘附；而 “pinning” 是通过物理穿刺和机械固定实现，通常可移除且不留下残留物。"
    },
    {
      "word_to_compare": "anchoring",
      "analysis": "“Anchoring”（锚定）强调在动态或不稳定环境中提供稳定支撑，常用于航海、金融或心理语境，具有更强的隐喻性和持久性；而 “pinning” 更偏向于临时性、物理性的固定，动作更直接、具体。"
    }
  ]
}