{
  "word": "pins",
  "pronunciation": "pɪnz",
  "concise_definition": "n. 别针, 钉子, 针, 保龄球瓶",
  "forms": {
    "singular": "pin"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small, slender, usually metal fastener with a sharp point at one end and a head or knob at the other, used to hold fabric, paper, or other materials together.",
      "explanation_cn": "一种细长、通常由金属制成的紧固件，一端为尖锐的针尖，另一端为头部或圆球，用于固定布料、纸张或其他材料。",
      "example_en": "She fastened the scarf with a decorative brooch pin.",
      "example_cn": "她用一枚装饰性胸针别住了围巾。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, upright object used as a target in the game of bowling, typically arranged in a triangular formation.",
      "explanation_cn": "一种直立的物体，用作保龄球游戏中的目标，通常呈三角形排列。",
      "example_en": "He knocked down nine pins with a single throw.",
      "example_cn": "他一次投球击倒了九个保龄球瓶。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small metal or plastic spike used to connect components in electronics, such as the terminals on a microchip or a plug.",
      "explanation_cn": "一种用于电子设备中连接元件的小型金属或塑料销钉，如芯片的引脚或插头的触点。",
      "example_en": "The CPU has over 1,000 pins that connect it to the motherboard.",
      "example_cn": "这颗CPU有超过1000个引脚，用于连接主板。"
    },
    {
      "pos": "noun",
      "explanation_en": "A digital bookmark or saved item on social media platforms such as Pinterest, used to collect and organize content.",
      "explanation_cn": "在社交媒体平台（如Pinterest）上保存的内容链接或收藏项，用于收集和整理信息。",
      "example_en": "I pinned this recipe to my 'Healthy Meals' board for later.",
      "example_cn": "我把这个食谱收藏到了我的'健康餐食'面板上，以便日后参考。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "nail",
      "analysis": "“Nail”（钉子）通常指较粗、较长、用于固定木材或建筑材料的金属件，需用锤子敲入，强调结构性固定；而 “pin” 更细小、轻便，常用于临时或装饰性固定，如别针或电子引脚，不依赖强力冲击。"
    },
    {
      "word_to_compare": "stitch",
      "analysis": "“Stitch”（针脚/缝线）指通过线将材料缝合在一起的工艺动作或结果，是连续的线性连接；而 “pin” 是物理的、独立的金属件，仅起到临时固定作用，不涉及缝合过程。"
    },
    {
      "word_to_compare": "peg",
      "analysis": "“Peg”（木钉/插销）通常是圆柱形的木质或塑料件，用于插入孔中以固定或悬挂物品，如晾衣夹或家具连接件；而 “pin” 通常更细长，带尖头，强调穿透性固定，且多为金属材质。"
    }
  ]
}