{
  "word": "pipe",
  "pronunciation": "paip",
  "concise_definition": "n. 管子, 烟斗; v. 用管输送, 发出声音",
  "forms": {
    "plural": "pipes",
    "third_person_singular": "pipes",
    "past_tense": "piped",
    "past_participle": "piped",
    "present_participle": "piping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A hollow cylindrical structure, typically made of metal, plastic, or clay, used to convey liquids, gases, or other substances from one place to another.",
      "explanation_cn": "一种中空的圆柱形结构，通常由金属、塑料或陶土制成，用于将液体、气体或其他物质从一处输送到另一处。",
      "example_en": "The plumber replaced the old copper pipe under the sink.",
      "example_cn": "水管工更换了水槽下方的老铜管。"
    },
    {
      "pos": "noun",
      "explanation_en": "A smoking device consisting of a bowl and a stem, used to smoke tobacco or other substances.",
      "explanation_cn": "一种用于吸烟草或其他物质的吸烟器具，通常由烟斗碗和烟杆组成。",
      "example_en": "He sat by the fire, quietly smoking his clay pipe.",
      "example_cn": "他坐在火炉旁，静静地抽着他的陶土烟斗。"
    },
    {
      "pos": "verb",
      "explanation_en": "To transport or convey something, especially a liquid or gas, through a pipe or pipeline.",
      "explanation_cn": "通过管道输送某物，尤指液体或气体。",
      "example_en": "The city pipes fresh water from the reservoir to households.",
      "example_cn": "这座城市通过管道将淡水从水库输送到各家各户。"
    },
    {
      "pos": "verb",
      "explanation_en": "To produce a high-pitched, continuous sound, often associated with birds or musical instruments like a flute.",
      "explanation_cn": "发出高音、持续的声音，常用于描述鸟类鸣叫或长笛等乐器的声音。",
      "example_en": "The birds were piping sweetly in the trees at dawn.",
      "example_cn": "黎明时分，鸟儿在树上婉转鸣叫。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tube",
      "analysis": "“Tube”（管状物）通常指更细、更柔软或更短的中空结构，常用于非工业语境，如吸管、电视显像管或地铁隧道。而 “pipe” 更强调功能性输送，多用于工程、建筑或公共设施中，结构更坚固，承压能力更强。"
    },
    {
      "word_to_compare": "hose",
      "analysis": "“Hose”（软管）是柔性的、可弯曲的管道，常用于临时输送液体（如浇水、消防），通常由橡胶或塑料制成。而 “pipe” 通常是刚性的、永久安装的，用于固定系统中的持续输送。"
    },
    {
      "word_to_compare": "flute",
      "analysis": "“Flute”（长笛）是一种乐器，通过吹气产生音乐音调，而 “pipe” 作为动词时仅指发出类似长笛的高音，不一定是乐器本身。在名词中，pipe 可指烟斗或输水管，而 flute 专指乐器，语义范围更窄。"
    }
  ]
}