{
  "word": "pipes",
  "pronunciation": "paɪps",
  "concise_definition": "n. 管子, 管道; 吸烟用的烟斗; v. 用管道输送; 发出尖锐声",
  "forms": {
    "singular": "pipe"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A hollow cylindrical structure, typically made of metal, plastic, or clay, used to convey fluids or gases from one place to another.",
      "explanation_cn": "一种中空的圆柱形结构，通常由金属、塑料或陶土制成，用于将液体或气体从一处输送到另一处。",
      "example_en": "The plumber replaced the old copper pipes in the kitchen.",
      "example_cn": "水管工更换了厨房里老旧的铜管。"
    },
    {
      "pos": "noun",
      "explanation_en": "A smoking device consisting of a bowl, a stem, and a mouthpiece, used to smoke tobacco or other substances.",
      "explanation_cn": "一种用于吸烟的装置，通常由烟斗碗、烟杆和烟嘴组成，用于吸食烟草或其他物质。",
      "example_en": "He sat by the fire, quietly smoking his clay pipe.",
      "example_cn": "他坐在火炉旁，静静地抽着他的陶土烟斗。"
    },
    {
      "pos": "verb",
      "explanation_en": "To transport or convey something, especially liquids or gases, through a pipe or pipeline.",
      "explanation_cn": "通过管道输送或传送某物，尤指液体或气体。",
      "example_en": "The city pipes fresh water to every household.",
      "example_cn": "这座城市通过管道向每户家庭输送自来水。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a high-pitched, shrill sound, often associated with birds or whistles.",
      "explanation_cn": "发出高音、尖锐的声音，常用于形容鸟类鸣叫或哨声。",
      "example_en": "The birds were piping sweetly in the trees at dawn.",
      "example_cn": "黎明时分，鸟儿在树上婉转鸣叫。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tubes",
      "analysis": "“Tubes”（管状物）通常指更柔软、更细或更灵活的中空结构，如牙膏管、静脉输液管，常用于医疗或日常用品；而 “pipes” 更强调刚性、用于工程或基础设施中的流体输送系统，结构更坚固，用途更正式。"
    },
    {
      "word_to_compare": "ducts",
      "analysis": "“Ducts”（风管/导管）主要用于空气、通风或气体的输送，常见于暖通空调系统；而 “pipes” 主要用于液体或高压气体，材料更耐压，用途更广泛。两者虽都为输送通道，但 “ducts” 更侧重空气动力学，而 “pipes” 更侧重流体力学。"
    },
    {
      "word_to_compare": "hoses",
      "analysis": "“Hoses”（软管）是柔性的、可弯曲的输送工具，常用于临时连接，如花园浇水、消防水管；而 “pipes” 是永久性安装的刚性结构，用于固定系统。软管强调可移动性，管道强调稳定性和耐久性。"
    }
  ]
}