{
  "word": "piping",
  "pronunciation": "pahy·ping",
  "concise_definition": "n. 管道系统, 管线, 管状物; adj. 管状的, 用管道输送的",
  "forms": {
    "noun_plural": "pipings",
    "adjective_form": "piping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A system of pipes used to convey fluids or gases, especially in industrial, plumbing, or HVAC contexts.",
      "explanation_cn": "用于输送液体或气体的管道系统，尤其在工业、管道工程或暖通空调（HVAC）环境中。",
      "example_en": "The factory's piping system was upgraded to handle higher pressure and corrosive chemicals.",
      "example_cn": "工厂的管道系统已升级，以承受更高的压力和腐蚀性化学品。"
    },
    {
      "pos": "noun",
      "explanation_en": "A single pipe or tubular structure, often made of metal, plastic, or other rigid materials, used for transport or structural purposes.",
      "explanation_cn": "单根管道或管状结构，通常由金属、塑料或其他刚性材料制成，用于输送或结构支撑。",
      "example_en": "Copper piping is commonly used in residential water supply systems.",
      "example_cn": "铜管常用于住宅供水系统。"
    },
    {
      "pos": "noun",
      "explanation_en": "A decorative strip of fabric sewn in a tubular shape, often used in clothing or upholstery for trim or detail.",
      "explanation_cn": "一种以管状缝制的装饰性布条，常用于服装或家具 upholstery 上作为镶边或细节装饰。",
      "example_en": "The dress featured delicate piping along the neckline and cuffs.",
      "example_cn": "这件连衣裙的领口和袖口饰有精致的管状镶边。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or designed for use with pipes; describing something that is tubular in form or function.",
      "explanation_cn": "与管道相关或专为管道使用而设计的；形容呈管状形态或具有管状功能的。",
      "example_en": "The piping system was designed with minimal bends to reduce friction loss.",
      "example_cn": "该管道系统设计为尽量减少弯折，以降低摩擦损失。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pipeline",
      "analysis": "“Pipeline”（管道系统）通常指一个完整的、连续的输送系统，尤其用于石油、天然气或数据传输，强调流程性和系统性。而 “piping” 更侧重于构成该系统的物理管道本身，可以是局部或零散的管段。"
    },
    {
      "word_to_compare": "tube",
      "analysis": "“Tube”（管子）是一个更通用的词，指任何中空的圆柱形物体，无论材质或用途，如吸管、血管或电子管。而 “piping” 通常特指用于流体输送的工程性管道，具有更强的工业或建筑语境。"
    },
    {
      "word_to_compare": "hose",
      "analysis": "“Hose”（软管）指柔韧、可弯曲的管道，常用于临时或移动用途，如浇水、消防或汽车维修。而 “piping” 通常指刚性、固定安装的管道系统，强调永久性和结构完整性。"
    }
  ]
}