{
  "word": "piracy",
  "pronunciation": "pahy·ruh·see",
  "concise_definition": "n. 海盗行为, 盗版, 抄袭",
  "forms": {
    "plural": "piracies"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of committing robbery or violence at sea, typically by armed attackers aboard ships, often targeting cargo or passengers for theft or ransom.",
      "explanation_cn": "指在海上通过武装袭击船只，抢劫货物或乘客以获取财物或勒索赎金的行为。",
      "example_en": "Piracy off the coast of Somalia has declined due to increased naval patrols.",
      "example_cn": "由于加强了海军巡逻，索马里沿海的海盗行为已有所减少。"
    },
    {
      "pos": "noun",
      "explanation_en": "The unauthorized use, reproduction, or distribution of copyrighted material, such as music, movies, software, or books, often for commercial gain.",
      "explanation_cn": "指未经许可使用、复制或分发受版权保护的材料（如音乐、电影、软件或书籍），通常以牟利为目的。",
      "example_en": "The film industry suffers billions in losses each year due to online piracy.",
      "example_cn": "由于网络盗版，电影行业每年损失数十亿美元。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of copying or stealing another person's ideas, writings, or creative work without proper attribution, often considered academic or intellectual theft.",
      "explanation_cn": "指在未注明出处的情况下抄袭他人的思想、文字或创意作品，常被视为学术或智力盗窃。",
      "example_en": "The student was expelled for academic piracy after submitting a paper copied from an online source.",
      "example_cn": "该学生因提交一篇从网络来源抄袭的论文而被开除。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "plagiarism",
      "analysis": "“Plagiarism”（抄袭）特指在学术、文学或创意领域中未经许可使用他人作品并隐瞒来源，强调的是‘思想剽窃’和‘学术不端’。而 ‘piracy’ 更广泛地涵盖非法复制和分发受版权保护的物质产品，如软件或电影，不一定涉及署名问题，但更侧重商业性侵权。"
    },
    {
      "word_to_compare": "theft",
      "analysis": "“Theft”（盗窃）泛指非法占有他人财物，通常涉及物理物品的转移。而 ‘piracy’ 在现代语境中多指对无形知识产权的侵犯，如数字内容的复制，不涉及实物的剥夺，因此法律上常被归类为‘侵犯版权’而非传统意义上的‘盗窃’。"
    },
    {
      "word_to_compare": "counterfeiting",
      "analysis": "“Counterfeiting”（伪造）指制造假冒商品以冒充正品，如假币、仿冒品牌包等，其核心是‘以假乱真’。而 ‘piracy’ 是指未经授权复制合法产品，通常不改变产品外观，只是非法传播或分发，如盗版光盘与正版内容完全相同，只是未获授权。"
    }
  ]
}