{
  "word": "pit",
  "pronunciation": "pit",
  "concise_definition": "n. 坑, 矿井, 深洞; v. 使对抗, 使竞争",
  "forms": {
    "plural": "pits",
    "third_person_singular": "pits",
    "past_tense": "pit",
    "past_participle": "pit",
    "present_participle": "pitting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A hole or depression in the ground, often deep and large, created naturally or by human activity, such as a mining pit, a hole for planting, or a crater.",
      "explanation_cn": "指地面上自然形成或人为开凿的深而大的凹陷或洞穴，如矿坑、种植坑或陨石坑。",
      "example_en": "The miners descended into the coal pit to extract resources.",
      "example_cn": "矿工们进入煤矿坑开采资源。"
    },
    {
      "pos": "noun",
      "explanation_en": "The hard inner seed of certain fruits, such as peaches, plums, or cherries, which is typically inedible and enclosed within the flesh.",
      "explanation_cn": "指某些水果（如桃子、李子、樱桃）内部坚硬不可食用的核，通常被果肉包裹。",
      "example_en": "She carefully removed the pit from the cherry before eating it.",
      "example_cn": "她在吃樱桃之前小心地把核剔了出来。"
    },
    {
      "pos": "noun",
      "explanation_en": "A designated area in a racing circuit where cars stop for refueling, tire changes, or repairs.",
      "explanation_cn": "指赛车道上专供车辆停靠进行加油、换胎或维修的区域。",
      "example_en": "The race team worked quickly in the pit to change all four tires.",
      "example_cn": "赛车队在维修区迅速更换了四个轮胎。"
    },
    {
      "pos": "verb",
      "explanation_en": "To set two people or groups against each other in competition or conflict, often to exploit their rivalry.",
      "explanation_cn": "指使两个人或群体相互对抗或竞争，通常是为了利用他们的对立关系。",
      "example_en": "The manager pitted the two departments against each other to increase productivity.",
      "example_cn": "经理让两个部门相互竞争，以提高生产力。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove the pit from a fruit.",
      "explanation_cn": "指将水果中的核取出。",
      "example_en": "She pit the olives before adding them to the salad.",
      "example_cn": "她在把橄榄加入沙拉前去掉了核。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hole",
      "analysis": "“Hole”（洞）是一个更通用的词，泛指任何大小的空洞，可以是小孔或穿孔，不一定深或大。而 “pit” 通常指较深、较大的凹陷，常带有负面或工程性含义，如矿坑或陷阱。"
    },
    {
      "word_to_compare": "ditch",
      "analysis": "“Ditch”（沟渠）是狭长的、人工挖掘的凹槽，通常用于排水或边界，形状呈线性；而 “pit” 是较深的、接近圆形或不规则的凹陷，强调深度而非长度。"
    },
    {
      "word_to_compare": "compete",
      "analysis": "“Compete”（竞争）是中性动词，指双方为赢得某物而努力；而 “pit” 作为动词时隐含第三方主动挑起对抗的意味，带有操纵或利用冲突的负面色彩，如 “pit against” 结构。"
    }
  ]
}