{
  "word": "pitching",
  "pronunciation": "pich·ing",
  "concise_definition": "n. 投球, 推销, 演讲; v. 投掷, 推销, 投球 (动词现在分词/动名词形式)",
  "forms": {
    "base_form": "pitch",
    "third_person_singular": "pitches",
    "past_tense": "pitched",
    "past_participle": "pitched",
    "present_participle": "pitching"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of throwing a ball, especially in baseball or softball, with the intent to deliver it to a batter in a specific manner.",
      "explanation_cn": "指在棒球或垒球中向击球手投掷球的动作，通常带有特定的策略或技巧。",
      "example_en": "His pitching in the final inning saved the game for the team.",
      "example_cn": "他在最后一局的投球为球队保住了胜利。"
    },
    {
      "pos": "noun",
      "explanation_en": "A persuasive presentation or proposal, often delivered briefly and energetically, aimed at convincing someone to invest in, buy, or support an idea, product, or service.",
      "explanation_cn": "指一种简短而富有感染力的说服性陈述，旨在说服他人投资、购买或支持某个想法、产品或服务。",
      "example_en": "She gave a brilliant pitching to the investors about her startup’s potential.",
      "example_cn": "她向投资者做了精彩的产品推介，阐述了她初创公司的潜力。"
    },
    {
      "pos": "noun",
      "explanation_en": "The slope or angle of a surface, especially of a roof or road, which affects drainage or stability.",
      "explanation_cn": "指表面（如屋顶或道路）的倾斜度或坡度，影响排水或结构稳定性。",
      "example_en": "The house has a steep pitching on the roof to handle heavy snowfall.",
      "example_cn": "这栋房子的屋顶坡度很陡，以应对大雪。"
    },
    {
      "pos": "verb",
      "explanation_en": "To throw or hurl something, especially with a specific motion or target (e.g., a ball, a tent peg, or an object).",
      "explanation_cn": "指以特定动作或目标投掷某物（如球、帐篷桩或物体）。",
      "example_en": "He pitched the ball hard toward home plate.",
      "example_cn": "他用力将球投向本垒。"
    },
    {
      "pos": "verb",
      "explanation_en": "To present or promote an idea, product, or proposal in an attempt to gain support or approval.",
      "explanation_cn": "指为争取支持或批准而提出或推广某个想法、产品或提案。",
      "example_en": "They are pitching a new app to improve workplace communication.",
      "example_cn": "他们正在推销一款旨在改善职场沟通的新应用程序。"
    },
    {
      "pos": "verb",
      "explanation_en": "To set up or install something, especially a tent or other temporary structure, by driving stakes into the ground.",
      "explanation_cn": "指通过将桩钉入地面来搭建或安装某物，尤指帐篷或其他临时结构。",
      "example_en": "We pitched our tent near the lake before sunset.",
      "example_cn": "我们在日落前在湖边搭起了帐篷。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "presentation",
      "analysis": "“Presentation”（展示/陈述）是一个更广泛、更正式的术语，泛指任何有组织的信息传达，可能包含幻灯片、数据和长时间讲解。而 “pitching” 更强调说服性、简洁性和行动导向，常用于商业或销售语境，目标是促成决策。"
    },
    {
      "word_to_compare": "throwing",
      "analysis": "“Throwing”（投掷）是物理动作的通用词，指任何将物体抛向空中的行为，无特定目的或技巧。而 “pitching” 在体育语境中特指有策略、有技术的投球动作，如棒球中的变速球、曲球等，具有专业性和规范性。"
    },
    {
      "word_to_compare": "slope",
      "analysis": "“Slope”（坡度）是描述倾斜程度的中性术语，常用于数学或地理，强调角度或比率。而 “pitching” 在建筑或工程语境中特指屋顶或路面的倾斜设计，带有功能目的（如排水），是工程术语，语义更具体。"
    }
  ]
}