{
  "word": "pitches",
  "pronunciation": "pich·iz",
  "concise_definition": "n. 投资建议, 推销, 体育场; v. 投掷, 推销, 投球",
  "forms": {
    "singular": "pitch"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A persuasive presentation or proposal, typically made to secure funding, support, or business, often in a concise and compelling manner.",
      "explanation_cn": "指为争取资金、支持或商业合作而做出的有说服力的陈述或提案，通常简洁有力，旨在打动听众。",
      "example_en": "She delivered a brilliant pitch to the investors and secured $2 million in funding.",
      "example_cn": "她向投资者做了精彩的提案，成功获得了两百万美元的投资。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of throwing or hurling something, especially in sports such as baseball or cricket, or the area where such a sport is played.",
      "explanation_cn": "指投掷动作，尤指棒球或板球中的投球行为；也可指进行此类运动的场地。",
      "example_en": "The pitcher threw a fast ball, and the batter missed the pitch completely.",
      "example_cn": "投手投出一记快速球，击球手完全没打中。"
    },
    {
      "pos": "noun",
      "explanation_en": "A designated area for camping, vending, or events, often found at festivals or outdoor venues.",
      "explanation_cn": "指用于露营、售卖或举办活动的指定区域，常见于音乐节或户外场地。",
      "example_en": "We set up our tent at the camping pitch near the lake.",
      "example_cn": "我们在湖边的露营区搭起了帐篷。"
    },
    {
      "pos": "verb",
      "explanation_en": "To present or promote an idea, product, or service in an attempt to persuade someone to accept or buy it.",
      "explanation_cn": "指为说服他人接受或购买而提出并推广某个想法、产品或服务。",
      "example_en": "He pitched his startup idea at the tech conference last week.",
      "example_cn": "他上周在科技大会上推销了自己的初创企业构想。"
    },
    {
      "pos": "verb",
      "explanation_en": "To throw or hurl something, especially a ball in a sport like baseball or cricket.",
      "explanation_cn": "指投掷某物，尤指在棒球或板球中投球。",
      "example_en": "The pitcher pitched the ball with perfect control.",
      "example_cn": "投手以完美的控制力投出了球。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "proposal",
      "analysis": "“Proposal”（提案）更正式、结构化，常用于商业或学术环境中，强调书面或系统性的计划；而 “pitch” 更口语化、强调现场表现力和说服力，常用于快速争取支持的场景。"
    },
    {
      "word_to_compare": "presentation",
      "analysis": "“Presentation”（演示）是中性词，泛指任何形式的信息展示，可能不具说服目的；而 “pitch” 特指以促成决策或交易为目的的说服性演示，带有明确的行动导向。"
    },
    {
      "word_to_compare": "throw",
      "analysis": "“Throw”（投掷）是通用动词，指任何方向的抛掷动作；而 “pitch” 在体育语境中特指有技巧、有目的的投球动作，如棒球中的投球，语义更专业、具体。"
    }
  ]
}