{
  "word": "pitched",
  "pronunciation": "pich·t",
  "concise_definition": "adj. 投掷的, 倾斜的, 精心策划的; v. 投掷, 投放, 促销, 搭帐篷",
  "forms": {
    "base_form": "pitch",
    "third_person_singular": "pitches",
    "past_tense": "pitched",
    "past_participle": "pitched",
    "present_participle": "pitching"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To throw or hurl something with a specific motion, often with force or precision, especially in sports or combat.",
      "explanation_cn": "指以特定动作投掷或猛掷某物，通常带有力量或精准性，常用于体育或战斗场景。",
      "example_en": "The pitcher pitched a fastball that the batter couldn't hit.",
      "example_cn": "投手投出了一记快球，击球手没能击中。"
    },
    {
      "pos": "verb",
      "explanation_en": "To present or promote an idea, product, or proposal in an attempt to persuade someone to accept or buy it.",
      "explanation_cn": "指为说服他人接受或购买而提出、推销某个想法、产品或提案。",
      "example_en": "She pitched her startup idea to five investors last week.",
      "example_cn": "她上周向五位投资者推销了自己的初创企业构想。"
    },
    {
      "pos": "verb",
      "explanation_en": "To set up or erect something, especially a tent or a structure, often temporarily.",
      "explanation_cn": "指搭建或竖立某物，尤指临时性的帐篷或结构。",
      "example_en": "We pitched our tents by the lake before sunset.",
      "example_cn": "我们在日落前在湖边搭起了帐篷。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that is sloped or inclined at an angle, especially in architecture or terrain.",
      "explanation_cn": "形容某物呈倾斜状或有角度的，常用于建筑或地形描述。",
      "example_en": "The pitched roof of the cottage shed snow easily in winter.",
      "example_cn": "小屋的斜屋顶在冬天很容易让积雪滑落。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing a tone, mood, or effort that is deliberately intense, exaggerated, or highly focused to achieve a specific effect.",
      "explanation_cn": "形容语气、情绪或努力被刻意调高、夸张或高度集中，以达到特定效果。",
      "example_en": "The speech had a pitched emotional tone that moved the audience to tears.",
      "example_cn": "演讲的情感基调被刻意调得极高，感动得观众热泪盈眶。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "thrown",
      "analysis": "“Thrown” 是 “throw” 的过去分词，泛指任何投掷动作，不强调方式或意图。而 “pitched” 通常暗示一种有技巧、有目的、有特定动作的投掷，尤其在体育或商业语境中带有专业性。"
    },
    {
      "word_to_compare": "proposed",
      "analysis": "“Proposed” (提议) 是中性、正式的表达，仅表示提出一个想法，不包含说服或推销的意图。而 “pitched” 强调主动争取认同，常带有营销、说服或表演性质，语气更强烈、更具策略性。"
    },
    {
      "word_to_compare": "erected",
      "analysis": "“Erected” (竖立) 通常用于正式或永久性结构（如纪念碑、建筑），语气庄重。而 “pitched” 多用于临时性、轻便的搭建（如帐篷），更口语化，且隐含快速、简便的含义。"
    },
    {
      "word_to_compare": "inclined",
      "analysis": "“Inclined” (倾斜的) 是描述物理角度的中性词，常用于科学或技术语境。而 “pitched” 作为形容词时，更常用于建筑、工程或日常口语中，带有更具体的形态特征（如屋顶、斜坡），语义更具体、形象。"
    }
  ]
}