{
  "word": "pitch",
  "pronunciation": "pich",
  "concise_definition": "n. 投球, 促销, 语调, 场地; v. 投掷, 推销, 调整音调",
  "forms": {
    "third_person_singular": "pitches",
    "past_tense": "pitched",
    "past_participle": "pitched",
    "present_participle": "pitching"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A throw of a ball, especially in baseball or cricket, delivered by a pitcher or bowler with specific speed and spin to challenge the batter.",
      "explanation_cn": "指棒球或板球中投手或投球手以特定速度和旋转投出的球，旨在挑战击球手。",
      "example_en": "The pitcher threw a perfect fastball for a strikeout.",
      "example_cn": "投手投出一记完美的快速球，三振出局。"
    },
    {
      "pos": "noun",
      "explanation_en": "A persuasive presentation or speech designed to convince someone to buy a product, support an idea, or take action, often used in business or advertising contexts.",
      "explanation_cn": "指为说服他人购买产品、支持某个观点或采取行动而进行的有说服力的陈述或演讲，常用于商业或广告场景。",
      "example_en": "He gave a compelling pitch to investors about his startup’s potential.",
      "example_cn": "他向投资者做了关于其初创公司潜力的精彩推销。"
    },
    {
      "pos": "noun",
      "explanation_en": "The highness or lowness of a sound, determined by the frequency of vibration; also refers to the tone or intonation of speech.",
      "explanation_cn": "指声音的高低，由振动频率决定；也可指言语的语调或音调。",
      "example_en": "Her pitch rose sharply when she asked the unexpected question.",
      "example_cn": "当她提出那个意想不到的问题时，她的语调突然升高了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sloping surface or incline, especially the angle of a roof or a sports field.",
      "explanation_cn": "指倾斜的表面或坡度，尤指屋顶的坡度或运动场地的倾斜度。",
      "example_en": "The roof has a steep pitch to allow snow to slide off easily.",
      "example_cn": "屋顶坡度很陡，以便积雪容易滑落。"
    },
    {
      "pos": "noun",
      "explanation_en": "A designated area or space for a specific activity, such as a camping site, market stall, or sports ground.",
      "explanation_cn": "指为特定活动所划定的区域或场地，如露营点、摊位或运动场。",
      "example_en": "They found a pitch near the lake to set up their tent.",
      "example_cn": "他们在湖边找到了一块地方搭帐篷。"
    },
    {
      "pos": "verb",
      "explanation_en": "To throw or hurl something, especially with a specific motion or target, such as a ball or object.",
      "explanation_cn": "指以特定动作或目标投掷某物，如球或其他物体。",
      "example_en": "He pitched the stone across the river.",
      "example_cn": "他把石头扔过了河。"
    },
    {
      "pos": "verb",
      "explanation_en": "To promote or present something enthusiastically in an attempt to gain support, investment, or approval.",
      "explanation_cn": "指热情地推广或展示某事物，以争取支持、投资或认可。",
      "example_en": "She pitched her novel to five publishers before one accepted it.",
      "example_cn": "她在五家出版社推销自己的小说，最终有一家接受了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To adjust the tone or frequency of a sound, especially in music or speech, to achieve a desired pitch.",
      "explanation_cn": "指调整声音的音调或频率，以达到所需的音高，常用于音乐或言语中。",
      "example_en": "The singer pitched her voice higher to hit the note.",
      "example_cn": "歌手提高了音调以唱出那个音符。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "proposal",
      "analysis": "“Proposal”（提案）通常指正式、书面的建议或计划，结构严谨，常用于商业、学术或政府语境，强调内容的完整性。而 “pitch” 更口语化、更具表演性，强调说服力和即时感染力，常用于口头推销或快速展示。"
    },
    {
      "word_to_compare": "throw",
      "analysis": "“Throw”（投掷）是更通用的动词，泛指任何用手臂力量将物体抛出的动作，无特定目的或技巧。而 “pitch” 在体育语境中特指有技术性、策略性的投球动作，如棒球中的变速球、曲线球，强调精准与控制。"
    },
    {
      "word_to_compare": "intonation",
      "analysis": "“Intonation”（语调）是语言学术语，专指说话时音高的变化模式，用于表达情感、疑问或强调，是语言结构的一部分。而 “pitch” 是更基础的物理概念，指单个声音的高低，可独立于语言使用，如乐器调音或歌手练声。"
    },
    {
      "word_to_compare": "slope",
      "analysis": "“Slope”（斜坡）是数学或地理术语，描述表面倾斜的度数或角度，强调客观测量。而 “pitch” 在建筑或工程中虽也指倾斜度，但更常用于描述实际构造的特性（如屋顶坡度），带有应用导向，且在口语中更常用。"
    }
  ]
}