{
  "word": "pits",
  "pronunciation": "pits",
  "concise_definition": "n. 坑, 矿井, 深洞; v. (使) 有坑, (使) 凹陷",
  "forms": {
    "singular": "pit"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A hollow or depression in the ground, often deep and wide, created naturally or by human activity, such as a mine shaft, excavation, or crater.",
      "explanation_cn": "地面上的一个凹陷或空洞，通常较深且宽，由自然力量或人为活动形成，如矿井、挖掘坑或陨石坑。",
      "example_en": "The miners descended into the coal pit to check for gas leaks.",
      "example_cn": "矿工们下到煤坑中检查是否有气体泄漏。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small hollow or depression on a surface, especially one caused by wear, damage, or natural formation (e.g., on fruit or skin).",
      "explanation_cn": "表面上的一个小凹陷，通常由磨损、损伤或自然形成所致（如水果或皮肤上的凹点）。",
      "example_en": "The peach had a deep pit where the stone was removed.",
      "example_cn": "桃子上有一个深凹，那是果核被移除的地方。"
    },
    {
      "pos": "noun",
      "explanation_en": "In sports or games, a designated area where players rest, receive equipment, or are eliminated (e.g., in a tournament or race).",
      "explanation_cn": "在体育或游戏中，指供选手休息、领取装备或被淘汰的指定区域（如锦标赛或赛车中的维修区）。",
      "example_en": "The race car pulled into the pit for a tire change and fuel refill.",
      "example_cn": "赛车驶入维修区更换轮胎并加油。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make or cause small holes or depressions on a surface, often through erosion, damage, or pressure.",
      "explanation_cn": "使表面形成小孔或凹陷，通常由侵蚀、损伤或压力造成。",
      "example_en": "Years of wind and rain have pitted the surface of the ancient stone statue.",
      "example_cn": "多年的风雨使这座古老石像的表面布满了凹坑。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hole",
      "analysis": "“Hole”（洞）泛指任何贯穿或嵌入物体的空洞，可以是圆形、垂直或贯穿的，用途广泛；而 “pit” 更强调地表或表面的凹陷，通常不贯穿，且多为自然或长期作用形成，常带有深度和规模感。"
    },
    {
      "word_to_compare": "depression",
      "analysis": "“Depression”（凹陷）是一个更中性、更广泛的地理或形态学术语，可用于描述任何低于周围区域的区域，包括心理状态；而 “pit” 更具体，常指较深、较明显的凹陷，具有物理实体感，多用于实际物体或地形。"
    },
    {
      "word_to_compare": "ditch",
      "analysis": "“Ditch”（沟渠）是狭长的人工开凿的凹槽，通常用于排水或边界，具有明确的线性结构；而 “pit” 多为点状或坑状，无方向性，常用于采矿、赛车或水果结构等语境，形状更接近圆形或不规则。"
    }
  ]
}