{
  "word": "plague",
  "pronunciation": "plag",
  "concise_definition": "n. 瘟疫, 灾祸; v. 使苦恼, 使困扰",
  "forms": {
    "third_person_singular": "plagues",
    "past_tense": "plagued",
    "past_participle": "plagued",
    "present_participle": "plaguing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A widespread and highly infectious disease, especially one that causes high mortality and spreads rapidly among a population, historically referring to the bubonic plague.",
      "explanation_cn": "指一种广泛传播、高度传染的疾病，尤其指历史上造成高死亡率并迅速在人群中蔓延的鼠疫（如腺鼠疫）。",
      "example_en": "The Black Death, a devastating plague, killed an estimated one-third of Europe's population in the 14th century.",
      "example_cn": "黑死病是一种毁灭性的瘟疫，在14世纪导致欧洲约三分之一的人口死亡。"
    },
    {
      "pos": "noun",
      "explanation_en": "A widespread and persistent problem or annoyance that causes great distress or disruption.",
      "explanation_cn": "指一种广泛存在且持续不断的麻烦或困扰，造成巨大痛苦或干扰，常用于比喻意义。",
      "example_en": "Traffic congestion is a plague in major cities around the world.",
      "example_cn": "交通拥堵是全球各大城市的一大顽疾。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause persistent trouble, distress, or annoyance to someone or something over a period of time.",
      "explanation_cn": "指长期不断地使某人或某物感到困扰、痛苦或烦恼。",
      "example_en": "The company has been plagued by financial scandals for years.",
      "example_cn": "多年来，这家公司一直受到财务丑闻的困扰。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "epidemic",
      "analysis": "“Epidemic”（流行病）指在特定地区或人群中短时间内迅速传播的疾病，强调传播范围和速度，但不一定致命或具有历史性的毁灭性。而 “plague” 通常指更严重、更致命、更具历史象征意义的传染病，如鼠疫，且常带有文化或文学上的沉重含义。"
    },
    {
      "word_to_compare": "pestilence",
      "analysis": "“Pestilence”（瘟疫）与 “plague” 几乎同义，常用于文学或宗教语境中，语气更古老、更庄重，多用于描述神罚或灾难性瘟疫。而 “plague” 更通用，既可用于医学语境，也可用于比喻义（如‘plague of insects’）。"
    },
    {
      "word_to_compare": "annoyance",
      "analysis": "“Annoyance”（烦恼）指轻微的、日常的令人不快之事，程度远轻于 “plague”。当用作动词时，”plague“ 表示长期、反复、难以摆脱的困扰，而 “annoy” 通常是短暂或偶发的。例如：‘He was annoyed by the noise’ vs. ‘He was plagued by insomnia for months.’"
    }
  ]
}