{
  "word": "planes",
  "pronunciation": "plānz",
  "concise_definition": "n. 飞机, 平面, 水平仪, 刨子",
  "forms": {
    "singular": "plane"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A powered flying vehicle with fixed wings and a weight greater than air, designed to transport people or cargo through the air.",
      "explanation_cn": "一种由发动机驱动、具有固定机翼且重量大于空气的飞行器，用于在空中运输人员或货物。",
      "example_en": "The passengers boarded the plane for their flight to Tokyo.",
      "example_cn": "乘客们登上了飞往东京的飞机。"
    },
    {
      "pos": "noun",
      "explanation_en": "A flat, two-dimensional surface that extends infinitely in all directions, often used in geometry and physics to represent a level or boundary.",
      "explanation_cn": "在几何学和物理学中指一个无限延伸的二维平面，常用于表示水平面或边界。",
      "example_en": "In three-dimensional space, two planes can intersect along a line.",
      "example_cn": "在三维空间中，两个平面可以沿一条直线相交。"
    },
    {
      "pos": "noun",
      "explanation_en": "A tool used in woodworking to smooth or flatten surfaces by shaving off thin layers of wood.",
      "explanation_cn": "一种木工工具，通过削去薄层木材来使表面光滑或平整。",
      "example_en": "He used a hand plane to smooth the rough edge of the wooden board.",
      "example_cn": "他用木工刨子将木板粗糙的边缘磨平。"
    },
    {
      "pos": "noun",
      "explanation_en": "A level or standard of quality, performance, or achievement, often used in phrases like 'on a higher plane'.",
      "explanation_cn": "指质量、表现或成就的层次或水平，常用于如 'on a higher plane'（处于更高层次）等表达中。",
      "example_en": "Their conversation rose to a philosophical plane that few could follow.",
      "example_cn": "他们的对话上升到了一种少有人能理解的哲学层次。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "aircraft",
      "analysis": "“Aircraft”（航空器）是更广泛的术语，包括所有能在空中飞行的装置，如直升机、飞艇、无人机等。而 “plane” 特指具有固定机翼的飞行器，是 “aircraft” 的一个子类。"
    },
    {
      "word_to_compare": "surface",
      "analysis": "“Surface”（表面）泛指任何物体的外层或边界，可以是曲面或不规则形状。而 “plane” 在几何意义上特指完全平坦、无限延伸的二维面，具有严格的数学定义，比 “surface” 更精确、更抽象。"
    },
    {
      "word_to_compare": "level",
      "analysis": "“Level”（水平）常用于比喻意义，表示程度或标准，如 “a high level of skill”。它更口语化、更通用。而 “plane” 在表示抽象层次时更具哲学或学术色彩，常用于文学或理论语境，如 “on a spiritual plane”。"
    }
  ]
}