{
  "word": "plant",
  "pronunciation": "plant",
  "concise_definition": "n. 植物, 工厂; v. 种植, 安置, 使扎根",
  "forms": {
    "third_person_singular": "plants",
    "past_tense": "planted",
    "past_participle": "planted",
    "present_participle": "planting",
    "plural": "plants"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A living organism that typically grows in soil, has leaves, stems, and roots, and synthesizes its own food through photosynthesis.",
      "explanation_cn": "指通常生长在土壤中、具有叶、茎、根，并通过光合作用自行制造养分的生物体。",
      "example_en": "The garden is filled with colorful plants, from roses to ferns.",
      "example_cn": "花园里种满了各种色彩斑斓的植物，从玫瑰到蕨类。"
    },
    {
      "pos": "noun",
      "explanation_en": "A factory or industrial facility where goods are manufactured or processed.",
      "explanation_cn": "指用于制造或加工产品的工厂或工业设施。",
      "example_en": "The car plant employs over 5,000 workers and produces 200 vehicles per day.",
      "example_cn": "这家汽车工厂雇佣了超过五千名员工，每天生产两百辆汽车。"
    },
    {
      "pos": "verb",
      "explanation_en": "To put a seed, bulb, or young plant into the ground so that it can grow.",
      "explanation_cn": "指将种子、球茎或幼苗放入土壤中，使其能够生长。",
      "example_en": "They planted apple trees along the fence last spring.",
      "example_cn": "去年春天，他们在篱笆旁种下了苹果树。"
    },
    {
      "pos": "verb",
      "explanation_en": "To place or fix something firmly in a position, often with the intention of concealing or embedding it.",
      "explanation_cn": "指将某物牢固地安置在某处，常带有隐藏或植入的意图。",
      "example_en": "The spy planted a listening device in the office.",
      "example_cn": "间谍在办公室里安装了一个窃听装置。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause an idea, feeling, or belief to be established in someone’s mind, often deliberately.",
      "explanation_cn": "指有意地在某人脑海中建立某种想法、情感或信念。",
      "example_en": "The advertisement planted the idea that this brand is the most reliable.",
      "example_cn": "这则广告刻意灌输了‘这个品牌最可靠’的理念。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tree",
      "analysis": "“Tree” (树) 是 “plant” 的一种具体类型，特指具有木质茎干、高大且寿命长的植物。而 “plant” 是更广泛的上位词，涵盖草本、灌木、藤本等所有植物类型。因此，所有树都是植物，但并非所有植物都是树。"
    },
    {
      "word_to_compare": "factory",
      "analysis": "“Factory” (工厂) 与 “plant” 在指工业设施时可互换，但 “plant” 更常用于大型、综合性或重工业设施（如发电厂、化工厂），而 “factory” 更泛指任何制造产品的场所，常用于轻工业或消费品生产。此外，”plant“ 在美式英语中更常用作工厂的同义词。"
    },
    {
      "word_to_compare": "sow",
      "analysis": "“Sow” (播种) 专指将种子撒入土壤，是种植行为中的一个具体动作，通常用于农业语境。而 “plant” 更广泛，可指种植种子、幼苗、球茎等，也包括移植、埋入等动作。此外，”plant“ 还有比喻义（如植入想法），而 “sow” 仅在比喻义中用于播种抽象事物（如 sow doubt）。"
    }
  ]
}