{
  "word": "plants",
  "pronunciation": "plant-s",
  "concise_definition": "n. 植物, 工厂, 设备; v. 种植, 安置, 使扎根",
  "forms": {
    "singular": "plant"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Living organisms that typically grow in soil, absorb water and nutrients through roots, and use sunlight to produce energy via photosynthesis; includes trees, flowers, grasses, and ferns.",
      "explanation_cn": "通常生长在土壤中、通过根部吸收水分和养分、并利用阳光通过光合作用制造能量的生物体；包括树木、花卉、草类和蕨类等。",
      "example_en": "Indoor plants can improve air quality and reduce stress.",
      "example_cn": "室内植物可以改善空气质量并减轻压力。"
    },
    {
      "pos": "noun",
      "explanation_en": "A factory or industrial facility where goods are manufactured or processed, especially one that is large and fixed in location.",
      "explanation_cn": "指用于制造或加工产品的大型固定设施，尤指工厂或工业生产场所。",
      "example_en": "The automobile plant employs over 5,000 workers.",
      "example_cn": "这家汽车工厂雇佣了超过五千名工人。"
    },
    {
      "pos": "noun",
      "explanation_en": "Equipment or machinery installed in a fixed location for a specific function, especially in engineering or utilities.",
      "explanation_cn": "指为特定功能而安装在固定位置的设备或机械，尤用于工程或公用事业领域。",
      "example_en": "The water treatment plant operates 24 hours a day.",
      "example_cn": "这座水处理厂全天候运行。"
    },
    {
      "pos": "verb",
      "explanation_en": "To put a seed, bulb, or young plant into the ground so that it can grow.",
      "explanation_cn": "将种子、球茎或幼苗植入土壤中，使其能够生长。",
      "example_en": "She planted tulip bulbs in the garden last autumn.",
      "example_cn": "去年秋天，她在花园里种下了郁金香球茎。"
    },
    {
      "pos": "verb",
      "explanation_en": "To place or fix something firmly in a position, often with the intention of concealing or establishing it for future use.",
      "explanation_cn": "将某物牢固地安置在某处，常带有隐藏或为将来使用而设立的意图。",
      "example_en": "The spy was planted in the company to gather confidential information.",
      "example_cn": "这名间谍被安插进公司以收集机密信息。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "vegetation",
      "analysis": "“Vegetation”（植被）是一个集合名词，泛指某一地区所有植物的总称，强调生态群落的整体性，不用于指单个植物或工厂。而 “plants” 可指单个或多个具体植物实体，也可用于工业语境，语义范围更广。"
    },
    {
      "word_to_compare": "factory",
      "analysis": "“Factory”（工厂）专指工业生产场所，语义更单一、更现代；而 “plant” 作为工厂的同义词，常用于大型、技术密集型设施（如发电厂、化工厂），带有更工程化或基础设施的语感，且可兼指植物，语义更丰富。"
    },
    {
      "word_to_compare": "sow",
      "analysis": "“Sow”（播种）特指将种子撒入土壤的动作，强调播种行为本身，多用于农业语境；而 “plant” 更广泛，可指种植种子、幼苗、球茎等，也可用于比喻义（如安插间谍），动作对象和语境都更丰富。"
    }
  ]
}