{
  "word": "plank",
  "pronunciation": "plangk",
  "concise_definition": "n. 木板, 横梁; v. 用木板铺, 使平直",
  "forms": {
    "plural": "planks",
    "third_person_singular": "planks",
    "past_tense": "planked",
    "past_participle": "planked",
    "present_participle": "planking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long, thin, flat piece of wood, typically used in construction for flooring, decking, or as a structural support.",
      "explanation_cn": "一块长而薄、平坦的木板，常用于建筑中作为地板、甲板或结构支撑。",
      "example_en": "The workers laid new planks to replace the rotting floorboards.",
      "example_cn": "工人们铺设了新的木板以替换腐烂的地板。"
    },
    {
      "pos": "noun",
      "explanation_en": "A narrow, elevated platform used in gymnastics or fitness training, typically for balancing exercises.",
      "explanation_cn": "一种用于体操或健身训练的窄长高台，通常用于平衡练习。",
      "example_en": "She held the plank position for two minutes without wavering.",
      "example_cn": "她保持平板支撑姿势两分钟，纹丝不动。"
    },
    {
      "pos": "noun",
      "explanation_en": "A formal statement of principles, goals, or policies adopted by a political party or organization.",
      "explanation_cn": "政党或组织所采纳的正式原则、目标或政策声明。",
      "example_en": "The party's platform includes commitments to healthcare reform and environmental protection.",
      "example_cn": "该党的政纲包括对医疗改革和环境保护的承诺。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover or lay a surface with planks, especially wood, to create a solid, even floor or structure.",
      "explanation_cn": "用木板覆盖或铺设表面，尤其是为了创建坚固、平整的地板或结构。",
      "example_en": "They planked the deck with cedar to give it a natural, weather-resistant finish.",
      "example_cn": "他们用雪松木板铺设了甲板，以获得自然且耐候的表面。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hold a body in a straight, horizontal position, typically with the weight supported by the forearms and toes, as in the exercise known as a plank.",
      "explanation_cn": "保持身体呈笔直水平姿势，通常以前臂和脚趾支撑体重，如健身动作中的平板支撑。",
      "example_en": "He planked every morning as part of his core workout routine.",
      "example_cn": "他每天早晨都做平板支撑，作为核心训练的一部分。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "board",
      "analysis": "“Board”（板）是一个更通用的词，指任何扁平的厚片状材料，可以是木头、金属或塑料，厚度和尺寸范围更广。而 “plank” 特指长而窄、通常用于建筑或结构用途的木板，强调其形状和用途的特定性。"
    },
    {
      "word_to_compare": "platform",
      "analysis": "“Platform”（平台）泛指任何用于站立、支撑或展示的平坦表面，可以是金属、混凝土或木质结构，常用于公共交通、演讲或政治语境。而 “plank” 作为名词时，特指体操中的窄木板或政纲中的具体政策条目，语义更具体、更狭窄。"
    },
    {
      "word_to_compare": "beam",
      "analysis": "“Beam”（梁）是建筑中用于承重的横向结构构件，通常较厚、较粗，用于支撑屋顶或楼层。而 “plank” 更薄、更轻，主要用于铺设表面而非承重结构。两者在功能和结构强度上有本质区别。"
    }
  ]
}