{
  "word": "plaques",
  "pronunciation": "plakz",
  "concise_definition": "n. 牌匾, 斑块, 病变斑块",
  "forms": {
    "singular": "plaque"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A flat, decorative plate or tablet, typically made of metal, wood, or ceramic, mounted on a wall or other surface to commemorate a person, event, or achievement.",
      "explanation_cn": "一种扁平的装饰性板状物，通常由金属、木材或陶瓷制成，安装在墙壁或其他表面上，用以纪念某人、某事件或某项成就。",
      "example_en": "A bronze plaque on the building's facade honors the founder of the university.",
      "example_cn": "大楼正面上的一块青铜牌匾纪念着这所大学的创始人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, abnormal deposit or patch of material on a surface, especially in medical contexts such as fatty deposits in arteries or bacterial films on teeth.",
      "explanation_cn": "指在某一表面形成的微小异常沉积物或斑块，尤其在医学语境中，如动脉中的脂肪沉积物或牙齿上的细菌菌斑。",
      "example_en": "Dental plaques can lead to cavities and gum disease if not removed regularly.",
      "example_cn": "如果不定期清除，牙菌斑会导致蛀牙和牙龈疾病。"
    },
    {
      "pos": "noun",
      "explanation_en": "A thickened, scaly patch of skin caused by chronic irritation or disease, such as in psoriasis or eczema.",
      "explanation_cn": "因长期刺激或疾病导致的皮肤增厚、鳞屑状斑块，如银屑病或湿疹中的病变。",
      "example_en": "The patient exhibited several raised, red plaques on the elbows and knees, consistent with psoriasis.",
      "example_cn": "患者肘部和膝盖上出现数个隆起的红色斑块，符合银屑病的特征。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "memorial",
      "analysis": "“Memorial”（纪念物）是一个更广泛的术语，泛指任何用于纪念逝者或重要事件的物体或结构，如纪念碑、雕像或公园。而 “plaque” 是一种具体的、通常为扁平金属或石质的纪念形式，常固定在墙面或地面，文字内容更简洁。"
    },
    {
      "word_to_compare": "deposit",
      "analysis": "“Deposit”（沉积物）是一个中性、通用的术语，指任何物质在表面或内部的积累，如泥沙沉积、矿物沉积。而 “plaque” 在医学或牙科语境中特指具有病理意义的、结构化的沉积物，如动脉粥样硬化斑块或牙菌斑，带有明确的临床含义。"
    },
    {
      "word_to_compare": "patch",
      "analysis": "“Patch”（斑块/补丁）泛指任何小块状区域，可以是皮肤上的、布料上的或地面上的，语义较宽泛，不强调成因或病理性质。而 “plaque” 在医学和牙科中特指由特定病理过程形成的、质地较硬或结构特殊的斑块，具有诊断意义。"
    }
  ]
}