{
  "word": "plaster",
  "pronunciation": "plas·tər",
  "concise_definition": "n. 石膏, 灰泥; v. 用石膏覆盖, 粘贴",
  "forms": {
    "third_person_singular": "plasters",
    "past_tense": "plastered",
    "past_participle": "plastered",
    "present_participle": "plastering"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A soft, wet mixture of lime, cement, or gypsum that is applied to walls and ceilings to create a smooth surface, and hardens as it dries.",
      "explanation_cn": "一种由石灰、水泥或石膏制成的柔软湿混合物，用于涂抹在墙壁和天花板上以形成光滑表面，干燥后会变硬。",
      "example_en": "The workers applied a fresh coat of plaster to the bedroom walls.",
      "example_cn": "工人在卧室墙壁上涂了一层新的灰泥。"
    },
    {
      "pos": "noun",
      "explanation_en": "A thin, flexible sheet or strip with an adhesive backing, used to cover small wounds or hold a bandage in place; also called a band-aid in American English.",
      "explanation_cn": "一种带有粘性背衬的薄而柔韧的片状物，用于覆盖小伤口或固定绷带；美式英语中也称为创可贴。",
      "example_en": "She put a plaster over the cut on her finger to prevent infection.",
      "example_cn": "她在手指的伤口上贴了一块创可贴以防止感染。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover a surface, especially a wall or ceiling, with plaster to make it smooth and even.",
      "explanation_cn": "用石膏覆盖表面（尤指墙壁或天花板），使其变得平滑均匀。",
      "example_en": "The house was plastered with a white finish to give it a clean, modern look.",
      "example_cn": "这所房子用白色石膏粉刷，呈现出干净现代的外观。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover or stick something densely or hastily over a surface, often in a way that is excessive or unattractive.",
      "explanation_cn": "匆忙或过度地将某物密集地贴在表面上，常带有不美观或夸张的意味。",
      "example_en": "The walls were plastered with posters from the music festival.",
      "example_cn": "墙上贴满了音乐节的海报。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mortar",
      "analysis": "“Mortar”（砂浆）主要用于砌筑砖石结构，含有粗颗粒，强度高，用于粘合建筑材料；而 “plaster” 是用于表面装饰和找平的细质材料，不承担结构性承重功能。"
    },
    {
      "word_to_compare": "putty",
      "analysis": "“Putty”（油灰）是一种柔软、可塑的填充材料，常用于填补缝隙或固定玻璃，干燥后变硬但不用于大面积墙面覆盖；而 “plaster” 是用于大面积墙面或天花板的涂层材料，具有更强的覆盖性和结构性。"
    },
    {
      "word_to_compare": "bandage",
      "analysis": "“Bandage”（绷带）是用于包扎伤口的织物或弹性材料，通常需要缠绕固定；而 “plaster” 作为名词时，特指带有粘性背衬的贴片式敷料，使用更简便，适用于小面积伤口，不需缠绕。"
    }
  ]
}