{
  "word": "played",
  "pronunciation": "plād",
  "concise_definition": "v. 演奏, 表演, 玩, 打 (游戏), 担任 (角色)",
  "forms": {
    "base_form": "play",
    "third_person_singular": "plays",
    "present_participle": "playing",
    "past_tense": "played",
    "past_participle": "played"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To perform music on an instrument, or to sing or act in a musical or theatrical production.",
      "explanation_cn": "指在乐器上演奏音乐，或在音乐或戏剧作品中演唱或表演。",
      "example_en": "She played the violin beautifully at the concert last night.",
      "example_cn": "她昨晚在音乐会上优美地演奏了小提琴。"
    },
    {
      "pos": "verb",
      "explanation_en": "To engage in a game, sport, or recreational activity, often for enjoyment or competition.",
      "explanation_cn": "指参与游戏、运动或休闲活动，通常出于娱乐或竞争目的。",
      "example_en": "The children played soccer in the park after school.",
      "example_cn": "孩子们放学后在公园里踢足球。"
    },
    {
      "pos": "verb",
      "explanation_en": "To perform a role or part in a film, play, or other dramatic production.",
      "explanation_cn": "指在电影、戏剧或其他戏剧作品中扮演某个角色。",
      "example_en": "Leonardo DiCaprio played the lead role in Inception.",
      "example_cn": "莱昂纳多·迪卡普里奥在《盗梦空间》中饰演主角。"
    },
    {
      "pos": "verb",
      "explanation_en": "To behave in a certain way, often insincerely or strategically, to achieve a desired effect.",
      "explanation_cn": "指以某种方式行事，常带有不真诚或策略性，以达到预期效果。",
      "example_en": "He played dumb when asked about the missing money.",
      "example_cn": "当被问到失踪的钱时，他装作什么都不知道。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to function or operate, especially a device or recording.",
      "explanation_cn": "指使某物（尤其是设备或录音）开始运作。",
      "example_en": "She played the song on her phone while waiting for the bus.",
      "example_cn": "她在等公交车时用手机播放了这首歌。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "performed",
      "analysis": "“Performed” (表演) 更正式，强调完成一项具有技巧性或艺术性的演出，常用于舞台、音乐或正式场合。而 “played” 更广泛，可指演奏乐器、玩游戏或扮演角色，语义更口语化、更日常。"
    },
    {
      "word_to_compare": "acted",
      "analysis": "“Acted” (表演/行动) 专指在戏剧、电影中扮演角色，或指做出某种行为（常含伪装意味）。而 “played” 在扮演角色时更强调娱乐性或非严肃性，如 “played a king” 比 “acted a king” 更自然；但当表示伪装时，两者可互换，如 “played/acted innocent”。"
    },
    {
      "word_to_compare": "engaged",
      "analysis": "“Engaged” (参与) 指投入或参加某项活动，但不强调具体行为方式，语义更抽象。而 “played” 明确指向具体的互动行为，如玩游戏、演奏乐器，具有更强的动作性和具体性。"
    }
  ]
}