{
  "word": "playing",
  "pronunciation": "play·ing",
  "concise_definition": "v. 玩, 演奏, 表演, 扮演; n. 演出, 表演行为",
  "forms": {
    "base_form": "play",
    "third_person_singular": "plays",
    "past_tense": "played",
    "past_participle": "played",
    "gerund": "playing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To engage in an activity for enjoyment or recreation, often involving rules, competition, or imagination, such as games, sports, or children's activities.",
      "explanation_cn": "指为了娱乐或消遣而参与某种活动，通常涉及规则、竞争或想象力，如玩游戏、运动或儿童游戏。",
      "example_en": "The children were playing soccer in the park after school.",
      "example_cn": "放学后，孩子们在公园里踢足球。"
    },
    {
      "pos": "verb",
      "explanation_en": "To perform music on an instrument or to perform a role in a theatrical, cinematic, or musical production.",
      "explanation_cn": "指在乐器上演奏音乐，或在戏剧、电影或音乐剧中扮演角色。",
      "example_en": "She has been playing the piano since she was five.",
      "example_cn": "她从五岁起就开始弹钢琴。"
    },
    {
      "pos": "verb",
      "explanation_en": "To behave in a certain way, often insincerely or manipulatively, to achieve a desired effect or outcome.",
      "explanation_cn": "指以某种方式行事，常带有不真诚或操纵性，以达到预期的效果或结果。",
      "example_en": "He's just playing dumb to avoid responsibility.",
      "example_cn": "他只是装傻来逃避责任。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or process of engaging in play, especially in the context of theater, sports, or games; can refer to a dramatic work performed on stage.",
      "explanation_cn": "指进行游戏或娱乐的行为，尤其在戏剧、体育或游戏中；也可指在舞台上演出的戏剧作品。",
      "example_en": "The play was a huge success, and the playing of the lead actor received critical acclaim.",
      "example_cn": "这部戏剧大获成功，主演的表演广受好评。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "performing",
      "analysis": "“Performing”（表演）更侧重于正式的、有准备的展示，常用于舞台、音乐或仪式场合，强调技巧和观众的观看。而 “playing” 可以更随意，涵盖从儿童游戏到乐器演奏的广泛含义，不一定有观众或正式结构。"
    },
    {
      "word_to_compare": "gaming",
      "analysis": "“Gaming”（玩游戏）特指电子游戏或有明确规则的竞技性游戏，语义范围较窄。而 “playing” 是更广义的词，可涵盖体育、乐器、角色扮演、甚至心理策略，不限于数字或竞技形式。"
    },
    {
      "word_to_compare": "acting",
      "analysis": "“Acting”（表演/演戏）专指在戏剧、电影中扮演角色，强调情感表达和角色塑造。而 “playing” 在此语境下虽可互换（如 playing a role），但更口语化，且可延伸至非表演性语境（如 playing with fire），语义更灵活。"
    }
  ]
}