{
  "word": "plotting",
  "pronunciation": "plot·ing",
  "concise_definition": "n. 阴谋, 策划; v. 绘图, 图解, 设计",
  "forms": {
    "base_form": "plot",
    "third_person_singular": "plots",
    "past_tense": "plotted",
    "past_participle": "plotted",
    "present_participle": "plotting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A secret plan or scheme, often with malicious or unlawful intent, devised by two or more people to achieve a specific goal.",
      "explanation_cn": "指两人或多人密谋策划的秘密计划，通常带有恶意或非法目的，旨在实现特定目标。",
      "example_en": "The police uncovered a plotting to overthrow the government.",
      "example_cn": "警方揭发了一起推翻政府的阴谋。"
    },
    {
      "pos": "noun",
      "explanation_en": "The sequence of events or the storyline in a novel, play, film, or other narrative work, structured to create tension, conflict, and resolution.",
      "explanation_cn": "指小说、戏剧、电影或其他叙事作品中事件的安排或情节主线，旨在制造张力、冲突与解决。",
      "example_en": "The plotting of the mystery novel was so intricate that readers couldn't guess the ending.",
      "example_cn": "这本推理小说的情节错综复杂，读者根本猜不到结局。"
    },
    {
      "pos": "verb",
      "explanation_en": "To mark points on a graph or chart and connect them to represent data visually, often for analysis or presentation.",
      "explanation_cn": "指在图表上标出数据点并将其连接，以视觉化方式呈现数据，常用于分析或展示。",
      "example_en": "The scientist was plotting temperature changes over the last decade.",
      "example_cn": "这位科学家正在绘制过去十年的温度变化曲线。"
    },
    {
      "pos": "verb",
      "explanation_en": "To plan or scheme something carefully, often with hidden or strategic intent.",
      "explanation_cn": "指精心策划某事，通常带有隐蔽或策略性的意图。",
      "example_en": "She was plotting her escape from the castle long before the rebellion began.",
      "example_cn": "在起义开始之前，她早已策划好了逃离城堡的方案。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "conspiracy",
      "analysis": "“Conspiracy” (阴谋) 是一个名词，指阴谋行为本身或其法律定义，强调非法共谋的客观事实；而 “plotting” 是动名词，更侧重于策划的过程和持续的行动，语义上更具动态性。"
    },
    {
      "word_to_compare": "storyline",
      "analysis": "“Storyline” (故事情节) 是叙事作品中事件的总称，强调内容和逻辑连贯性；而 “plotting” 作为名词时，更强调事件的安排、设计和结构构建过程，常用于创作语境中，带有主动策划的意味。"
    },
    {
      "word_to_compare": "graphing",
      "analysis": "“Graphing” (作图) 是 “plotting” 在数据可视化中的近义词，但 “graphing” 更泛指绘制图形的整个过程，包括选择坐标系、标注轴等；而 “plotting” 更特指在坐标系中标出具体数据点的动作，是 graphing 的核心步骤。"
    },
    {
      "word_to_compare": "planning",
      "analysis": "“Planning” (计划) 是中性词，泛指为达成目标而进行的系统性安排，可公开、合法；而 “plotting” 常带有秘密、狡诈或非法的隐含色彩，尤其在指阴谋时，情感色彩更负面。"
    }
  ]
}