{
  "word": "plotted",
  "pronunciation": "plot·id",
  "concise_definition": "adj. 阴谋的, 策划的; v. (plot 的过去式和过去分词) 阴谋, 策划, 绘制",
  "forms": {
    "base_form": "plot",
    "third_person_singular": "plots",
    "present_participle": "plotting",
    "past_tense": "plotted",
    "past_participle": "plotted"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To make secret plans, often with harmful or illegal intentions, to achieve a particular goal, especially by manipulating events or people.",
      "explanation_cn": "指秘密策划，通常带有恶意或非法意图，以实现某一特定目标，尤其通过操纵事件或他人来达成。",
      "example_en": "The two conspirators plotted to overthrow the government.",
      "example_cn": "这两位阴谋者策划推翻政府。"
    },
    {
      "pos": "verb",
      "explanation_en": "To mark points on a graph or chart and connect them to show a relationship between variables, such as data trends over time.",
      "explanation_cn": "指在图表上标出点并将其连接，以显示变量之间的关系，例如随时间变化的数据趋势。",
      "example_en": "Scientists plotted the temperature changes over the last decade on a line graph.",
      "example_cn": "科学家们在折线图上绘制了过去十年的温度变化。"
    },
    {
      "pos": "verb",
      "explanation_en": "To arrange the sequence of events in a story, novel, or film in a structured and intentional way.",
      "explanation_cn": "指有意识地安排故事、小说或电影中事件的顺序和结构。",
      "example_en": "The author plotted the novel with surprising twists that kept readers engaged.",
      "example_cn": "这位作家精心设计了小说的情节，用出人意料的转折吸引读者。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by secret scheming or cunning planning, often with deceitful or malicious intent.",
      "explanation_cn": "形容具有秘密策划或狡诈谋划特征的，通常带有欺骗性或恶意意图。",
      "example_en": "He gave her a plotted smile that made her feel uneasy.",
      "example_cn": "他露出一个阴险的微笑，让她感到不安。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "planned",
      "analysis": "“Planned” (计划的) 是中性词，泛指为实现目标而事先安排，不隐含恶意或秘密性。而 “plotted” 强调秘密、狡诈甚至非法的策划，带有负面情感色彩。例如：planned a vacation（计划度假） vs. plotted a murder（密谋杀人）。"
    },
    {
      "word_to_compare": "mapped",
      "analysis": "“Mapped” (绘制地图/规划) 通常用于物理空间或抽象路径的可视化呈现，强调系统性布局，常为中性或正面用途（如地图绘制、流程图）。而 “plotted” 在表示绘图时更侧重于逐点标记和连接，常用于数据或数学语境，且在非技术语境中更常与阴谋关联。"
    },
    {
      "word_to_compare": "conspired",
      "analysis": "“Conspired” (共谋) 与 “plotted” 在阴谋义上高度重合，常可互换，但 “conspired” 更强调多人合作达成非法目的，而 “plotted” 可以是个人行为，且更广泛用于非犯罪语境（如情节设计）。此外，“conspired” 通常与 “with” 搭配，而 “plotted” 常与 “to” 搭配。"
    }
  ]
}