{
  "word": "plot",
  "pronunciation": "plot",
  "concise_definition": "n. 情节, 阴谋, 地块; v. 图谋, 规划, 绘制",
  "forms": {
    "third_person_singular": "plots",
    "past_tense": "plotted",
    "past_participle": "plotted",
    "present_participle": "plotting",
    "plural": "plots"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The sequence of events that make up the story in a novel, play, film, or other narrative work, including the arrangement of conflicts, turning points, and resolutions.",
      "explanation_cn": "指小说、戏剧、电影或其他叙事作品中构成故事的一系列事件，包括冲突、转折点和结局的安排。",
      "example_en": "The plot of the mystery novel was so intricate that readers couldn't guess the ending.",
      "example_cn": "这本侦探小说的情节错综复杂，读者根本猜不到结局。"
    },
    {
      "pos": "noun",
      "explanation_en": "A secret plan, especially one intended to harm someone or achieve a dishonest goal.",
      "explanation_cn": "指一种秘密计划，尤其是旨在伤害他人或达成不正当目的的阴谋。",
      "example_en": "The police uncovered a plot to assassinate the president.",
      "example_cn": "警方揭穿了一起暗杀总统的阴谋。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small piece of land, especially one designated for a specific use such as building or farming.",
      "explanation_cn": "指一小块土地，尤其是被指定用于建筑、耕种等特定用途的地块。",
      "example_en": "They bought a plot of land near the lake to build their summer house.",
      "example_cn": "他们在湖边买了一块地，打算建一座避暑小屋。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make secret plans, especially to do something illegal or harmful.",
      "explanation_cn": "指秘密策划，尤其是策划违法或有害的事情。",
      "example_en": "The two conspirators plotted to steal the company's confidential data.",
      "example_cn": "这两个同谋者密谋窃取公司的机密数据。"
    },
    {
      "pos": "verb",
      "explanation_en": "To plan or arrange something carefully, often with a specific goal in mind.",
      "explanation_cn": "指仔细规划或安排某事，通常带有明确的目标。",
      "example_en": "She plotted her career path carefully, aiming to become a CEO by age 40.",
      "example_cn": "她精心规划了自己的职业道路，目标是40岁前成为首席执行官。"
    },
    {
      "pos": "verb",
      "explanation_en": "To draw or mark points on a graph or map to represent data or locations.",
      "explanation_cn": "指在图表或地图上标出点以表示数据或位置。",
      "example_en": "The scientist plotted the temperature changes over the last decade on a line graph.",
      "example_cn": "科学家在折线图上标出了过去十年的温度变化。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "story",
      "analysis": "“Story”（故事）泛指叙述性内容，强调事件的叙述和情感体验，结构可以松散；而 “plot” 更强调事件之间的逻辑结构、因果关系和精心设计的安排，是故事的骨架。"
    },
    {
      "word_to_compare": "conspiracy",
      "analysis": "“Conspiracy”（共谋）是名词，专指非法或秘密的联合计划，语义范围比 “plot” 更窄、更负面；而 “plot” 作为名词时，既可用于阴谋，也可用于小说情节，语义更广。"
    },
    {
      "word_to_compare": "plan",
      "analysis": "“Plan”（计划）是中性词，泛指为达成目标而制定的步骤，可公开、可日常；而 “plot” 常带有秘密性、策略性甚至恶意色彩，尤其在动词用法中，暗示更复杂、更隐蔽的策划。"
    },
    {
      "word_to_compare": "map",
      "analysis": "“Map”（地图）是名词，指地理或空间的可视化表示；而 “plot” 作为动词时，指在地图或图表上标出具体点位，是绘制地图的行为，而非地图本身。"
    }
  ]
}