{
  "word": "plow",
  "pronunciation": "plou",
  "concise_definition": "v. 犁地, 耕作; n. 犁, 犁具",
  "forms": {
    "third_person_singular": "plows",
    "past_tense": "plowed",
    "past_participle": "plowed",
    "present_participle": "plowing",
    "plural": "plows"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To turn over and break up soil with a plow in preparation for planting crops, typically using a tractor or animal-drawn implement.",
      "explanation_cn": "使用犁具翻耕土地，以准备播种作物，通常由拖拉机或牲畜牵引。",
      "example_en": "The farmer plowed the field before planting the seeds.",
      "example_cn": "农夫在播种前犁了地。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move forward with great effort through a difficult or obstructed path, often implying forceful or persistent progress.",
      "explanation_cn": "指费力地向前推进，穿越困难或受阻的路径，常暗示一种顽强或强力的前进。",
      "example_en": "The snowplow plowed through the heavy snowdrifts to clear the road.",
      "example_cn": "除雪车奋力铲除厚厚的积雪，清理了道路。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or proceed in a continuous, steady, and often noisy or disruptive manner, especially in a crowd or through a dense area.",
      "explanation_cn": "指以持续、稳定的方式前进，常带有嘈杂或干扰性，尤其在人群或密集区域中。",
      "example_en": "The crowd plowed forward as the concert began, pushing past the ushers.",
      "example_cn": "音乐会开始时，人群推搡着向前涌去，挤开了引导员。"
    },
    {
      "pos": "noun",
      "explanation_en": "A farming tool with one or more blades or shares, designed to cut, lift, and turn over soil for planting.",
      "explanation_cn": "一种农具，带有一个或多个犁铧，用于切割、抬起并翻转土壤以便播种。",
      "example_en": "He repaired the old wooden plow that had been in his family for generations.",
      "example_cn": "他修理了家族世代相传的旧木犁。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cultivate",
      "analysis": "“Cultivate” (耕作/培育) 涵盖更广泛的农业活动，包括施肥、除草、灌溉等，强调对土地或作物的长期照料和管理。而 “plow” 仅指翻土这一具体动作，是耕作的初始步骤。"
    },
    {
      "word_to_compare": "till",
      "analysis": "“Till” (耕作) 与 “plow” 在农业语境中常可互换，但 “till” 是更通用的术语，泛指任何翻松土壤的行为，包括使用锄头、耙子等工具；而 “plow” 特指使用犁具进行的深度翻土，更具工具指向性。"
    },
    {
      "word_to_compare": "clear",
      "analysis": "“Clear” (清除) 指移除障碍物或杂草，使某区域变得空旷，但不涉及翻土或准备播种。而 “plow” 不仅清除杂草，还主动翻动土壤，为种植创造条件，具有建设性而非单纯清理的含义。"
    }
  ]
}