{
  "word": "pluck",
  "pronunciation": "pluhk",
  "concise_definition": "v. 拔, 摘, 拨; n. 勇气, 胆量",
  "forms": {
    "third_person_singular": "plucks",
    "past_tense": "plucked",
    "past_participle": "plucked",
    "present_participle": "plucking"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To pull or pick something quickly and forcibly, especially with the fingers or a tool, often removing it from a surface or attachment.",
      "explanation_cn": "指用手指或工具迅速而用力地拔出或摘下某物，通常是从表面或附着物上移除。",
      "example_en": "She plucked a rose from the garden and handed it to him.",
      "example_cn": "她从花园里摘下一朵玫瑰，递给了他。"
    },
    {
      "pos": "verb",
      "explanation_en": "To play a stringed instrument by pulling or snapping the strings with the fingers or a pick, rather than using a bow.",
      "explanation_cn": "指用手指或拨片拨动弦乐器的琴弦来演奏，而非使用琴弓。",
      "example_en": "He plucked the strings of his guitar softly in the dim light.",
      "example_cn": "他在微弱的灯光下轻轻拨动吉他的琴弦。"
    },
    {
      "pos": "verb",
      "explanation_en": "To take something courageously or decisively, often in the face of difficulty or fear.",
      "explanation_cn": "指在面对困难或恐惧时，果断或勇敢地采取行动或做出决定。",
      "example_en": "It took real pluck to speak up against the boss in that meeting.",
      "example_cn": "在那次会上敢于对老板直言，确实需要很大的勇气。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden burst of courage or determination, especially in a difficult or dangerous situation.",
      "explanation_cn": "指在困难或危险情况下突然表现出的勇气或决心。",
      "example_en": "The firefighter showed incredible pluck when he rescued the child from the burning building.",
      "example_cn": "消防员在从着火的大楼中救出孩子时展现了非凡的勇气。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pick",
      "analysis": "“Pick” (采摘/挑选) 通常指温和、有选择性地取走某物，常用于水果、花朵或物品的挑选，语气较中性。而 “pluck” 更强调动作的突然性和力量感，常带有物理上的拉扯或拔除意味，语气更强烈。"
    },
    {
      "word_to_compare": "pull",
      "analysis": "“Pull” (拉) 是一个更广泛、更通用的动词，指任何方向的牵引力，不涉及具体方式或结果。而 “pluck” 是一种特定类型的拉——快速、短促、常用于从固定位置摘取或拔除，动作更精准、更集中。"
    },
    {
      "word_to_compare": "courage",
      "analysis": "“Courage” (勇气) 是一个抽象名词，泛指面对危险或困难时的心理品质。而 “pluck” 作为名词时，是 “courage” 的一种更口语化、更生动的表达，常带有“胆识”“果敢”甚至“鲁莽”的色彩，多用于描述具体行为中的瞬间勇气。"
    }
  ]
}