{
  "word": "plucked",
  "pronunciation": "pluht",
  "concise_definition": "v. 拔, 摘, 拨 (pluck 的过去式和过去分词)",
  "forms": {
    "base_form": "pluck",
    "third_person_singular": "plucks",
    "present_participle": "plucking",
    "past_tense": "plucked",
    "past_participle": "plucked"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To pull or pick something quickly and suddenly, especially feathers, hairs, or small objects from a surface or body.",
      "explanation_cn": "指迅速而突然地将某物（尤其是羽毛、毛发或小物件）从表面或身体上拔下或摘下。",
      "example_en": "She plucked a feather from the bird's wing to use in her hat.",
      "example_cn": "她从鸟的翅膀上拔下一根羽毛，用来装饰她的帽子。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pick or gather fruit, flowers, or crops by hand, often with a gentle pulling motion.",
      "explanation_cn": "指用手采摘水果、花朵或农作物，通常伴随着轻柔的拉扯动作。",
      "example_en": "The children plucked strawberries from the garden and ate them fresh.",
      "example_cn": "孩子们从花园里摘下草莓，直接吃了起来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strike or pull the strings of a musical instrument, such as a guitar or harp, with the fingers or a pick.",
      "explanation_cn": "指用手指或拨片拨动吉他、竖琴等乐器的琴弦以发出声音。",
      "example_en": "He plucked the strings of his banjo softly, creating a gentle melody.",
      "example_cn": "他轻轻拨动班卓琴的琴弦，奏出柔和的旋律。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove something abruptly or forcefully, often implying a sense of suddenness or violence.",
      "explanation_cn": "指突然或强行地移除某物，常带有突然性或暴力性的意味。",
      "example_en": "The dictator plucked dissenters from their homes in the middle of the night.",
      "example_cn": "独裁者在深夜强行将异见者从家中带走。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "picked",
      "analysis": "“Picked” (采摘/挑选) 是更通用的词，泛指从某处取走某物，可以是选择性的（如挑选水果）或随意的（如捡起东西）。“Plucked” 更强调动作的突然性、直接性和物理拉扯感，常用于羽毛、毛发或琴弦等具体对象，带有更强的视觉和听觉意象。"
    },
    {
      "word_to_compare": "pulled",
      "analysis": "“Pulled” (拉) 是一个更宽泛的动词，指任何方向的拉力动作，不一定涉及移除或摘取。“Plucked” 是一种特定类型的“pull”，特指快速、短促、从表面或附着物上脱离的动作，如拔毛、摘果、拨弦，动作更精准、更轻巧。"
    },
    {
      "word_to_compare": "harvested",
      "analysis": "“Harvested” (收获) 指大规模、有组织地采集农作物，强调季节性、集体性和经济目的。“Plucked” 则是小规模、个体化、常带个人动作色彩的采摘行为，不强调系统性，更富生活化或诗意的意味。"
    }
  ]
}