{
  "word": "plugs",
  "pronunciation": "pluhgz",
  "concise_definition": "n. 插头, 塞子, 促销; v. 插入, 填塞, 宣传",
  "forms": {
    "singular": "plug"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A device with metal prongs or pins that is inserted into an electrical socket to connect an appliance to a power source.",
      "explanation_cn": "一种带有金属插脚或针状物的装置，插入电源插座以连接电器与电源。",
      "example_en": "He forgot to unplug the toaster before leaving the house.",
      "example_cn": "他离开家前忘了拔掉烤面包机的插头。"
    },
    {
      "pos": "noun",
      "explanation_en": "A stopper or piece of material used to block or seal an opening, such as a drain or a bottle.",
      "explanation_cn": "用于堵塞或密封开口的塞子或材料，例如排水口或瓶子的塞子。",
      "example_en": "She pulled the plug to drain the bathtub.",
      "example_cn": "她拔掉塞子，放空了浴缸里的水。"
    },
    {
      "pos": "noun",
      "explanation_en": "A promotional mention or advertisement, especially one that is overt or repeated in media or public speech.",
      "explanation_cn": "一种公开或反复在媒体或公开演讲中进行的促销宣传。",
      "example_en": "The celebrity gave a subtle plug for her new skincare line during the interview.",
      "example_cn": "这位名人在采访中巧妙地为她的新护肤品系列做了宣传。"
    },
    {
      "pos": "verb",
      "explanation_en": "To insert something firmly into a hole or opening, especially to secure or seal it.",
      "explanation_cn": "将某物牢固地插入孔洞或开口中，尤指为了固定或密封。",
      "example_en": "He plugged the leak in the pipe with a piece of rubber.",
      "example_cn": "他用一块橡胶堵住了管道的漏缝。"
    },
    {
      "pos": "verb",
      "explanation_en": "To promote or advertise something enthusiastically, often in a public or persuasive manner.",
      "explanation_cn": "热情地宣传或推广某事物，通常以公开或具有说服力的方式。",
      "example_en": "The author plugged her new novel on every talk show she appeared on.",
      "example_cn": "这位作者在她参加的每一个脱口秀节目中都大力宣传她的新小说。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "socket",
      "analysis": "“Socket”（插座）是插头（plug）所插入的固定接口，二者是配套使用的部件。插头是主动插入的部分，而插座是被动接收的部分。因此，它们是互补关系，而非同义词。"
    },
    {
      "word_to_compare": "stopper",
      "analysis": "“Stopper”（塞子）与 “plug” 在堵塞功能上高度相似，常可互换，但 “stopper” 更常用于瓶子、酒瓶等容器的软木塞或玻璃塞，而 “plug” 更广泛用于管道、排水口等工业或日常场景，语义范围更广。"
    },
    {
      "word_to_compare": "promote",
      "analysis": "“Promote”（推广）是更正式、更广泛的商业术语，涵盖广告、营销、公关等多种手段；而 “plug” 作为动词时，语气更口语化，常带有“硬广”或“刻意植入”的意味，有时甚至隐含贬义，强调单次或重复的宣传行为。"
    }
  ]
}