{
  "word": "plug",
  "pronunciation": "pluhg",
  "concise_definition": "n. 插头, 塞子, 促销; v. 插入, 填塞, 宣传",
  "forms": {
    "third_person_singular": "plugs",
    "past_tense": "plugged",
    "past_participle": "plugged",
    "present_participle": "plugging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A device inserted into an electrical socket to connect an appliance to a power source.",
      "explanation_cn": "用于插入电源插座以连接电器与电源的装置。",
      "example_en": "The charger’s plug is damaged, so the phone won’t charge.",
      "example_cn": "充电器的插头坏了，所以手机无法充电。"
    },
    {
      "pos": "noun",
      "explanation_en": "A piece of material used to block or seal a hole, especially to prevent leakage.",
      "explanation_cn": "用于堵塞或密封孔洞的材料，尤其用于防止泄漏。",
      "example_en": "He used a cork plug to stop the wine bottle from spilling.",
      "example_cn": "他用软木塞堵住酒瓶，防止酒液洒出。"
    },
    {
      "pos": "noun",
      "explanation_en": "A promotional statement or advertisement, often delivered in a subtle or persuasive manner, especially in media or speech.",
      "explanation_cn": "一种宣传性言论或广告，通常以微妙或劝说性的方式在媒体或演讲中传达。",
      "example_en": "The actor gave a subtle plug for his new movie during the interview.",
      "example_cn": "这位演员在采访中巧妙地为自己的新电影做了宣传。"
    },
    {
      "pos": "verb",
      "explanation_en": "To insert something firmly into a hole or opening, especially to seal or secure it.",
      "explanation_cn": "将某物牢固地插入孔洞或开口中，尤其用于密封或固定。",
      "example_en": "She plugged the drain with a rubber stopper.",
      "example_cn": "她用橡胶塞子堵住了排水口。"
    },
    {
      "pos": "verb",
      "explanation_en": "To promote or advertise something enthusiastically, often in a public or persuasive context.",
      "explanation_cn": "热情地宣传或推广某事物，通常在公开或劝说性语境中进行。",
      "example_en": "The CEO plugged the company’s new sustainability initiative on social media.",
      "example_cn": "首席执行官在社交媒体上大力宣传公司的新可持续发展计划。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "socket",
      "analysis": "“Socket”（插座）是插头所插入的固定接口，是电源连接的接收端；而 “plug” 是可移动的连接端，用于插入插座。两者是互补的部件，但功能相反：socket 是固定的，plug 是可插拔的。"
    },
    {
      "word_to_compare": "stopper",
      "analysis": "“Stopper”（塞子）是更通用的术语，泛指任何用于封闭容器口的物体，如瓶塞、试管塞；而 “plug” 更常用于指用于堵塞管道、排水口或电气接口的塞子，语义范围更广，也包含技术性用途。"
    },
    {
      "word_to_compare": "promote",
      "analysis": "“Promote”（推广）是更正式、广泛的商业术语，涵盖广告、营销、公关等多种手段；而 “plug” 作为动词时更口语化，常指在非正式场合（如访谈、直播）中简短、直接的宣传，带有轻微的“硬广”或“植入”意味。"
    }
  ]
}