{
  "word": "plugged",
  "pronunciation": "pluhgd",
  "concise_definition": "adj. 插入的, 连接的; v. 插入, 推销; n. 插头, 插座",
  "forms": {
    "base_form": "plug",
    "third_person_singular": "plugs",
    "past_tense": "plugged",
    "past_participle": "plugged",
    "present_participle": "plugging"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Connected to an electrical source via a plug or socket, indicating that a device is receiving power.",
      "explanation_cn": "通过插头或插座连接到电源，表示设备正在通电运行。",
      "example_en": "The laptop is plugged in and charging.",
      "example_cn": "笔记本电脑已插上电源，正在充电。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used informally to describe someone who is deeply engaged or immersed in something, often to the point of being unaware of surroundings.",
      "explanation_cn": "非正式用法，形容某人全神贯注于某事，甚至对周围环境毫无察觉。",
      "example_en": "She was plugged into her headphones, completely lost in the music.",
      "example_cn": "她戴着耳机，完全沉浸在音乐中。"
    },
    {
      "pos": "verb",
      "explanation_en": "To insert something, especially a plug, into a socket or opening to establish a connection, typically for power or data.",
      "explanation_cn": "将某物（尤其是插头）插入插座或开口中，以建立连接，通常用于供电或传输数据。",
      "example_en": "He plugged the charger into the wall outlet.",
      "example_cn": "他把充电器插进了墙上的插座。"
    },
    {
      "pos": "verb",
      "explanation_en": "To promote or advertise something enthusiastically, often in a biased or paid manner.",
      "explanation_cn": "热情地推广或宣传某物，通常带有偏见或为有偿行为。",
      "example_en": "The celebrity was plugged on TV as the face of the new skincare line.",
      "example_cn": "这位名人被电视广告大力推荐为新护肤品系列的代言人。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "connected",
      "analysis": "“Connected” (连接的) 是一个更广泛、更中性的术语，可指任何形式的连接（网络、关系、通信），不局限于物理插头。而 “plugged” 特指通过物理插头接入电源或设备，语义更具体、更技术化。"
    },
    {
      "word_to_compare": "inserted",
      "analysis": "“Inserted” (插入的) 是一个通用动词，指将任何物体放入某处，不涉及功能目的。而 “plugged” 隐含了功能性目的——为了供电、通信或激活设备，语义更明确。"
    },
    {
      "word_to_compare": "promoted",
      "analysis": "“Promoted” (推广) 是一个正式的商业术语，泛指通过广告、营销等手段提升产品知名度。而 “plugged” 作为动词使用时，带有非正式甚至略带贬义的色彩，常暗示过度宣传或利益驱动的推荐。"
    }
  ]
}