{
  "word": "plump",
  "pronunciation": "plump",
  "concise_definition": "adj. 胖乎乎的, 饱满的; v. 使变丰满, 填充",
  "forms": {
    "comparative": "plumper",
    "superlative": "plumpest",
    "third_person_singular": "plumps",
    "past_tense": "plumped",
    "past_participle": "plumped",
    "present_participle": "plumping"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having a rounded, full, and slightly fat appearance, often in an attractive or healthy way, especially referring to a person's body or facial features.",
      "explanation_cn": "形容外表圆润、丰满，通常带有吸引力或健康感，尤其用于描述人的体型或面部特征。",
      "example_en": "She had plump cheeks and a warm, smiling face.",
      "example_cn": "她有着圆润的脸颊和温暖的笑容。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Full, well-filled, and often juicy or rich in content, typically describing fruits, vegetables, or other natural substances.",
      "explanation_cn": "形容饱满、充实，通常指水果、蔬菜或其他天然物质多汁或内容丰富。",
      "example_en": "The market was filled with plump, ripe strawberries.",
      "example_cn": "市场上摆满了饱满成熟的草莓。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make something fuller or more rounded, especially by adding padding or stuffing.",
      "explanation_cn": "通过添加填充物使某物变得更丰满或更圆润。",
      "example_en": "She plumped the pillows before sitting down on the sofa.",
      "example_cn": "她坐在沙发上之前把枕头拍得更蓬松了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To become plump or fatter, often used to describe a gradual increase in body size or fullness.",
      "explanation_cn": "逐渐变得丰满或发胖，常用于描述体型或饱满度的缓慢增加。",
      "example_en": "After the holidays, he plumped up a little from all the rich food.",
      "example_cn": "假期过后，他因为吃了太多丰盛的食物而稍微发福了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fat",
      "analysis": "“Fat” (胖的) 是一个中性或有时带贬义的词，直接描述体脂过多，可能暗示不健康或缺乏控制。而 “plump” 更具褒义或温和的语气，常用于形容可爱、健康或诱人的丰满，尤其在描述女性、儿童或食物时。"
    },
    {
      "word_to_compare": "chubby",
      "analysis": "“Chubby” (圆嘟嘟的) 通常用于形容儿童或婴儿的可爱丰满，带有强烈的亲昵和温馨感，语义范围比 “plump” 更窄，且更常用于面部或四肢。而 “plump” 可用于成人、身体整体或非生物（如水果），适用范围更广。"
    },
    {
      "word_to_compare": "robust",
      "analysis": "“Robust” (健壮的) 强调健康、强壮和有活力，常用于形容体格强健的人或系统，不强调外形的圆润，而更注重功能性和力量。而 “plump” 侧重于外形的饱满和柔软感，不一定与健康或力量直接相关。"
    }
  ]
}