{
  "word": "plunge",
  "pronunciation": "pluhnj",
  "concise_definition": "v. 投入, 猛跌, 使骤降; n. 猛冲, 急降",
  "forms": {
    "third_person_singular": "plunges",
    "past_tense": "plunged",
    "past_participle": "plunged",
    "present_participle": "plunging"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move or cause something to move suddenly and forcefully downward or into something, often with a sense of urgency or danger.",
      "explanation_cn": "指突然而有力地向下移动，或使某物突然进入某物中，常带有紧迫或危险的意味。",
      "example_en": "The stock market plunged after the announcement of the economic crisis.",
      "example_cn": "经济危机宣布后，股市骤然暴跌。"
    },
    {
      "pos": "verb",
      "explanation_en": "To immerse oneself suddenly and completely in an activity, situation, or experience, often without hesitation.",
      "explanation_cn": "指毫不犹豫地突然完全投入到某项活动、情境或体验中。",
      "example_en": "She plunged into the project with great enthusiasm and worked around the clock.",
      "example_cn": "她满怀热情地投入了这个项目，日夜不停地工作。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden and steep fall or drop in level, value, or position.",
      "explanation_cn": "指水平、价值或位置的突然而急剧的下降。",
      "example_en": "The plunge in oil prices affected global economies.",
      "example_cn": "油价的骤降影响了全球经济。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden, forceful movement forward or downward, often into water or a deep space.",
      "explanation_cn": "指突然而有力地向前或向下移动，常指跳入水中或深坑中。",
      "example_en": "He took a plunge into the icy lake to save the drowning child.",
      "example_cn": "他纵身跳入冰冷的湖中，救起了溺水的孩子。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fall",
      "analysis": "“Fall” (落下) 是一个通用词，泛指任何向下的运动，可以是缓慢、自然或意外的，如树叶飘落。而 “plunge” 强调速度、突然性和强烈的动作感，通常带有危险或戏剧性色彩。"
    },
    {
      "word_to_compare": "dive",
      "analysis": "“Dive” (跳水/俯冲) 通常指有控制地、有目的性地向下运动，如跳水运动员或飞机俯冲，常带技巧性。而 “plunge” 更强调无意识、冲动或失控的猛冲，情感色彩更强烈。"
    },
    {
      "word_to_compare": "sink",
      "analysis": "“Sink” (下沉) 指因重力或失去浮力而缓慢、持续地下沉，如船沉没或情绪低落。它强调过程的持续性，而 “plunge” 强调瞬间的剧烈变化，常用于抽象语境如价格或情绪的骤降。"
    }
  ]
}