{
  "word": "ply",
  "pronunciation": "plī",
  "concise_definition": "v. 勤勉地从事, 不断地使用, 船只航行, 供应",
  "forms": {
    "third_person_singular": "plies",
    "past_tense": "plied",
    "past_participle": "plied",
    "present_participle": "plying"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To work steadily and diligently at a task, often with repeated effort or persistent application.",
      "explanation_cn": "指坚持不懈、勤勉地从事某项工作，通常意味着持续不断地付出努力。",
      "example_en": "She plied her needle with great skill, stitching the quilt through the night.",
      "example_cn": "她灵巧地挥动针线，整夜缝制被子。"
    },
    {
      "pos": "verb",
      "explanation_en": "To offer or supply something persistently, especially in an attempt to persuade or influence.",
      "explanation_cn": "指持续不断地提供（尤指劝说或影响他人时），如不断提供信息、酒水或建议。",
      "example_en": "The salesman plied him with free samples and flattering remarks.",
      "example_cn": "推销员不断向他提供免费样品并说些奉承话。"
    },
    {
      "pos": "verb",
      "explanation_en": "To travel regularly along a route, especially by boat or ship, to transport goods or passengers.",
      "explanation_cn": "指（尤指船只）定期在某条航线上航行，用于运输货物或乘客。",
      "example_en": "Ferries ply between the island and the mainland every hour.",
      "example_cn": "渡轮每小时往返于岛屿与大陆之间。"
    },
    {
      "pos": "verb",
      "explanation_en": "To use something repeatedly or vigorously, especially a tool or instrument.",
      "explanation_cn": "指反复或用力地使用某物，尤指工具或器具。",
      "example_en": "The carpenter plied his axe with great force to split the log.",
      "example_cn": "木匠用力挥动斧头劈开木头。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "work",
      "analysis": "“Work” (工作) 是最通用的词，泛指任何形式的体力或脑力劳动，不强调持续性或重复性。而 “ply” 更强调持续、勤勉、反复地从事某项具体活动，常带有熟练或专注的意味。"
    },
    {
      "word_to_compare": "supply",
      "analysis": "“Supply” (供应) 侧重于提供物品或资源，是单向的给予行为，通常不包含劝说或持续施加影响的含义。而 “ply” 在表示供应时，隐含了不断、主动、甚至带有目的性地提供，常用于劝说语境。"
    },
    {
      "word_to_compare": "navigate",
      "analysis": "“Navigate” (航行/导航) 强调的是控制方向、路径或过程，常用于抽象语境（如导航网站）。而 “ply” 在表示航行时，仅指定期往返于固定航线，不涉及操控或规划，更强调频率和常规性。"
    },
    {
      "word_to_compare": "use",
      "analysis": "“Use” (使用) 是最基础的动词，仅表示利用某物达到目的，无情感或强度色彩。而 “ply” 在表示使用工具时，带有强烈、频繁、熟练甚至费力的意味，语义更丰富、更具画面感。"
    }
  ]
}