{
  "word": "poaching",
  "pronunciation": "pohch-ing",
  "concise_definition": "n. 非法捕猎, 非法捕捞, 侵夺, 窃取人才",
  "forms": {
    "noun": "poaching"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The illegal hunting, capturing, or killing of wild animals, typically in violation of wildlife protection laws or hunting regulations.",
      "explanation_cn": "指违反野生动物保护法律或狩猎法规，非法猎捕或杀害野生动物的行为。",
      "example_en": "Poaching of elephants for their ivory remains a serious threat to African wildlife.",
      "example_cn": "为获取象牙而非法猎杀大象，仍然是对非洲野生动物的重大威胁。"
    },
    {
      "pos": "noun",
      "explanation_en": "The illegal fishing or harvesting of aquatic resources, such as fish or shellfish, in protected or restricted areas.",
      "explanation_cn": "指在受保护或受限区域非法捕鱼或采集水生资源（如鱼类、贝类）的行为。",
      "example_en": "Authorities have cracked down on poaching in the coral reefs, where endangered species are being overharvested.",
      "example_cn": "当局已对珊瑚礁区域的非法捕捞行为展开打击，那里濒危物种正被过度捕捞。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of stealing or luring away employees or clients from a competitor, especially in a professional or business context.",
      "explanation_cn": "指在职业或商业环境中，从竞争对手处挖走员工或客户的行为。",
      "example_en": "The tech company was accused of poaching key engineers from its rival.",
      "example_cn": "这家科技公司被指控从竞争对手那里挖走关键工程师。"
    },
    {
      "pos": "noun",
      "explanation_en": "A cooking method in which food (especially eggs or fish) is gently simmered in liquid just below the boiling point.",
      "explanation_cn": "一种烹饪方法，指将食物（尤其是鸡蛋或鱼类）在略低于沸点的液体中缓慢烹煮。",
      "example_en": "She prepared a delicate dish of poached salmon with dill sauce.",
      "example_cn": "她准备了一道精致的香草酱配水煮三文鱼。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hunting",
      "analysis": "“Hunting”（狩猎）是中性词，泛指为获取食物、运动或控制种群而猎杀动物，可以是合法的；而 “poaching” 特指非法狩猎，带有违法和道德谴责的含义。"
    },
    {
      "word_to_compare": "theft",
      "analysis": "“Theft”（盗窃）是广义的非法占有他人财物，适用于任何物品；而 “poaching” 在人才或资源语境下特指以不正当手段获取他人拥有的资源（如员工、鱼类），强调的是‘掠夺性挖角’或‘侵占受保护资源’的特殊性。"
    },
    {
      "word_to_compare": "fishing",
      "analysis": "“Fishing”（捕鱼）是合法、受监管的水生资源采集活动；而 “poaching” 在此语境下特指违反渔业法规、在禁渔区或禁渔期非法捕捞，具有破坏生态和法律的双重性质。"
    },
    {
      "word_to_compare": "simmering",
      "analysis": "“Simmering”（慢煮）是烹饪术语，泛指在低温下长时间加热液体；而 “poaching” 是一种特定的慢煮方式，专指将食物浸入微沸液体中烹制，强调温度控制和食物的柔嫩口感，是烹饪中的专业术语。"
    }
  ]
}