{
  "word": "pocket",
  "pronunciation": "pok·it",
  "concise_definition": "n. 口袋, 小袋; v. 将...放入口袋, 私吞, 赢得",
  "forms": {
    "plural": "pockets",
    "third_person_singular": "pockets",
    "past_tense": "pocketed",
    "past_participle": "pocketed",
    "present_participle": "pocketing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small bag or pouch, typically sewn into or onto clothing, used for carrying small items such as keys, coins, or a phone.",
      "explanation_cn": "缝在或附着在衣物上的小袋，用于携带钥匙、硬币或手机等小物品。",
      "example_en": "He reached into his pocket and pulled out a handful of coins.",
      "example_cn": "他伸手进裤子口袋，掏出一把硬币。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, enclosed area or region that is distinct from its surroundings, often used geographically or politically (e.g., a pocket of resistance).",
      "explanation_cn": "指与周围环境明显不同的小片区域，常用于地理或政治语境（如抵抗的据点）。",
      "example_en": "A pocket of forest remains untouched amid the urban sprawl.",
      "example_cn": "在城市扩张的包围中，仍有一小片森林未被破坏。"
    },
    {
      "pos": "verb",
      "explanation_en": "To put something into a pocket, especially to conceal or take possession of it, sometimes illegally or dishonestly.",
      "explanation_cn": "将某物放入口袋，尤指为了隐藏或非法占有而私吞（如偷窃）。",
      "example_en": "The shoplifter pocketed a lipstick without paying.",
      "example_cn": "那个小偷没付钱就把口红放进了口袋。"
    },
    {
      "pos": "verb",
      "explanation_en": "To win or retain something for oneself, especially money or a prize, often in a competitive context.",
      "explanation_cn": "在竞争性情境中赢得或保留某物，尤指金钱或奖品。",
      "example_en": "The underdog team pocketed the championship after a thrilling final match.",
      "example_cn": "这支不被看好的球队在一场激动人心的决赛后赢得了冠军。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bag",
      "analysis": "“Bag”（袋子）泛指任何用于盛放物品的容器，通常比 “pocket” 更大、更独立，不一定缝在衣物上。而 “pocket” 是衣物的一部分，体积小、位置固定，主要用于随身携带轻便物品。"
    },
    {
      "word_to_compare": "stash",
      "analysis": "“Stash”（藏匿物）强调秘密地储存或隐藏物品，常用于非法或谨慎的语境，如藏钱、藏毒品。而 “pocket” 作为动词时虽可含私吞之意，但更侧重物理动作（放入口袋），不一定隐含隐蔽意图。"
    },
    {
      "word_to_compare": "nook",
      "analysis": "“Nook”（角落）指空间中的一个隐蔽或凹陷的小区域，常用于描述建筑结构中的角落，如书架角落。它强调空间位置，而非容器功能。而 “pocket” 作为名词时虽可指小区域，但更强调其功能性（如可容纳物品），且常用于比喻性语境。"
    }
  ]
}