{
  "word": "pod",
  "pronunciation": "pahd",
  "concise_definition": "n. 豆荚, 舱, 群体, 小型独立单元",
  "forms": {
    "plural": "pods"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long, narrow case or container that holds seeds, especially in leguminous plants such as peas or beans.",
      "explanation_cn": "指豆科植物（如豌豆或蚕豆）中容纳种子的细长容器，通常由果皮构成，成熟后会裂开。",
      "example_en": "She opened the pea pod and counted seven green peas inside.",
      "example_cn": "她打开了一颗豌豆荚，发现里面有七颗绿色的豌豆。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, enclosed compartment or capsule, especially one designed to carry people or equipment, often used in transportation or space technology.",
      "explanation_cn": "指一个小型封闭式舱体或胶囊，常用于运输或航天技术中，用于承载人员或设备。",
      "example_en": "The astronauts entered the lunar lander pod for descent to the moon's surface.",
      "example_cn": "宇航员进入登月舱，准备降落到月球表面。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of marine mammals, such as dolphins or whales, that swim and travel together in a social unit.",
      "explanation_cn": "指一群共同游动、生活在一起的海洋哺乳动物（如海豚或鲸鱼），构成一个社会性群体。",
      "example_en": "A pod of orcas was spotted near the coast, hunting in coordinated formation.",
      "example_cn": "在海岸附近发现了一群虎鲸，正以协同方式捕猎。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, self-contained unit or group, especially in modern technology or urban planning, such as a pod of workspaces or autonomous vehicles.",
      "explanation_cn": "指现代科技或城市规划中一个独立的小型单元或群体，例如独立的工作舱、自动驾驶车辆编队等。",
      "example_en": "The new office design includes modular pods for focused, quiet work.",
      "example_cn": "新办公室设计包含模块化工作舱，便于专注安静地工作。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "capsule",
      "analysis": "“Capsule”（胶囊）通常指更小、更紧凑、常用于医药或航天的密封容器，强调功能性与封闭性；而 “pod” 更强调结构上的独立性与群体性，可指更大的空间单元，如太空舱或工作舱，语义范围更广。"
    },
    {
      "word_to_compare": "group",
      "analysis": "“Group”（群体）是泛指任何聚集在一起的人或物，无特定结构或功能；而 “pod” 特指具有生物或技术上紧密联系、协同行为的群体，如鲸群或自动驾驶车队，具有更强的组织性和功能性。"
    },
    {
      "word_to_compare": "husk",
      "analysis": "“Husk”（外壳/果壳）指植物种子外层的干硬保护壳，通常被剥离丢弃；而 “pod” 是包含种子的完整结构，不仅有外壳，还包含内部种子，是植物繁殖的完整单位，语义上更完整、更主动。"
    }
  ]
}