{
  "word": "poetic",
  "pronunciation": "puh·tik",
  "concise_definition": "adj. 诗意的, 优美的, 富有诗意的",
  "forms": {
    "comparative": "more poetic",
    "superlative": "most poetic"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having the qualities of poetry; expressing ideas or emotions in a lyrical, imaginative, or emotionally evocative way, often using figurative language, rhythm, or imagery.",
      "explanation_cn": "具有诗歌特质的；以抒情、富有想象力或情感感染力的方式表达思想或情感，常使用比喻、韵律或意象。",
      "example_en": "The sunset over the lake was poetic, with hues of gold and crimson melting into the water.",
      "example_cn": "湖面上的日落诗意盎然，金色与深红的色彩缓缓融入水中。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by an idealized, romantic, or overly sentimental view of reality, often used to describe a person’s outlook or manner of speaking.",
      "explanation_cn": "指以理想化、浪漫化或过度感伤的方式看待现实，常用于形容人的观点或言谈方式。",
      "example_en": "He gave a poetic explanation for why he left his job — 'I followed the whisper of my soul.'",
      "example_cn": "他对离职给出了一个诗意的解释：‘我追随了灵魂的低语。’"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characteristic of poetry as an art form, especially in style or structure.",
      "explanation_cn": "与诗歌作为一种艺术形式相关，尤其在风格或结构上具有诗歌特征。",
      "example_en": "The film’s poetic structure, with its non-linear timeline and symbolic motifs, earned critical acclaim.",
      "example_cn": "这部电影采用非线性叙事和象征性意象的诗意结构，赢得了评论界的高度赞誉。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "lyrical",
      "analysis": "“Lyrical”（抒情的）强调语言的音乐性、情感的直接表达和节奏感，常用于描述歌曲、诗歌或文字中流淌的情感。而 “poetic” 范围更广，不仅包含音乐性，还涵盖意象、隐喻和整体美学氛围，可应用于视觉、叙事或思想层面。"
    },
    {
      "word_to_compare": "romantic",
      "analysis": "“Romantic”（浪漫的）侧重于情感的理想化、对爱情或自然的崇敬，常带有主观幻想色彩。而 “poetic” 不一定涉及爱情，它可以是冷静、克制但充满意象的表达，更注重艺术形式本身，而非情感倾向。"
    },
    {
      "word_to_compare": "figurative",
      "analysis": "“Figurative”（比喻的）特指使用非字面意义的语言（如隐喻、拟人），是诗歌的工具之一。而 “poetic” 是整体风格的评价，可能包含比喻，但也可能通过节奏、留白、意象组合等非修辞手段实现诗意，因此 “poetic” 是更综合的审美判断。"
    }
  ]
}