{
  "word": "points",
  "pronunciation": "poynts",
  "concise_definition": "n. 分数, 点, 要点, 地点, 尖端; v. 指向, 指示",
  "forms": {
    "singular": "point"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A unit of scoring in a game, competition, or assessment, used to measure performance or achievement.",
      "explanation_cn": "在游戏、比赛或评估中用于衡量表现或成就的计分单位。",
      "example_en": "She scored 20 points in the final quarter of the basketball game.",
      "example_cn": "她在篮球比赛的最后一节得了20分。"
    },
    {
      "pos": "noun",
      "explanation_en": "A specific idea, argument, or detail in a discussion, text, or presentation that is considered important or central.",
      "explanation_cn": "在讨论、文本或演讲中被认为重要或核心的某个观点、论点或细节。",
      "example_en": "The main point of his speech was the need for environmental reform.",
      "example_cn": "他演讲的主要观点是需要进行环境改革。"
    },
    {
      "pos": "noun",
      "explanation_en": "A specific location or position in space, often marked or implied, such as on a map, graph, or physical surface.",
      "explanation_cn": "空间中的一个特定位置或地点，通常在地图、图表或物理表面上被标记或暗示。",
      "example_en": "The coordinates of the ship's last known point were recorded before it vanished.",
      "example_cn": "在船只失踪前，其最后已知位置的坐标已被记录。"
    },
    {
      "pos": "noun",
      "explanation_en": "The sharp end or tip of an object, such as a needle, pencil, or sword, designed to pierce or mark.",
      "explanation_cn": "物体（如针、铅笔或剑）的尖端，用于刺穿或标记。",
      "example_en": "Be careful with the point of the knife—it's very sharp.",
      "example_cn": "小心刀尖——它非常锋利。"
    },
    {
      "pos": "verb",
      "explanation_en": "To direct or aim something, especially a finger, weapon, or device, toward a specific target or direction.",
      "explanation_cn": "将某物（尤其是手指、武器或设备）指向某个特定目标或方向。",
      "example_en": "He pointed the camera at the sunset and took a photo.",
      "example_cn": "他把相机对准日落，拍了一张照片。"
    },
    {
      "pos": "verb",
      "explanation_en": "To indicate or show something by gesture or direction, often to draw attention to it.",
      "explanation_cn": "通过手势或方向指示某物，通常是为了引起注意。",
      "example_en": "The teacher pointed to the map to explain the trade routes.",
      "example_cn": "老师指着地图解释贸易路线。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "score",
      "analysis": "“Score”（得分）通常特指在比赛或考试中累计的分数，强调结果和总量，常用于竞技语境。而 “point” 更侧重于单个计分单位，也可用于抽象观点或位置，语义范围更广。"
    },
    {
      "word_to_compare": "aspect",
      "analysis": "“Aspect”（方面）指事物的某个特征或视角，强调从不同角度观察的维度，常用于分析性语境。而 “point” 更强调一个具体的论点或要点，具有更强的表达意图和结论性。"
    },
    {
      "word_to_compare": "spot",
      "analysis": "“Spot”（地点、斑点）通常指一个具体的、有时是小范围的物理位置或污渍，语义更具体、更视觉化。而 “point” 可以是抽象的、数学的或逻辑的位置，适用范围更广，包括非物理空间。"
    },
    {
      "word_to_compare": "indicate",
      "analysis": "“Indicate”（指示）是更正式的动词，泛指通过信号、数据或行为传达信息，不一定是物理指向。而 “point” 作为动词，常伴随明确的身体动作（如手指）或具象方向，更具动作性和直观性。"
    }
  ]
}