{
  "word": "poker",
  "pronunciation": "pohk-er",
  "concise_definition": "n. 扑克牌, 拨火棍, 好管闲事的人; v. 用拨火棍拨火, 打探消息",
  "forms": {
    "plural": "pokers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A card game played with a standard deck of 52 cards, in which players bet on the value of their hand based on combinations such as pairs, flushes, and straights.",
      "explanation_cn": "一种使用标准52张扑克牌进行的纸牌游戏，玩家根据手中的牌型（如对子、同花、顺子等）下注，以争夺彩池。",
      "example_en": "He won a large sum of money playing poker at the casino last night.",
      "example_cn": "昨晚他在赌场打扑克赢了一大笔钱。"
    },
    {
      "pos": "noun",
      "explanation_en": "A long, thin rod, typically made of metal, used for stirring or adjusting burning logs in a fireplace.",
      "explanation_cn": "一种细长的杆状物，通常由金属制成，用于拨动壁炉中的燃烧木柴。",
      "example_en": "She used the poker to rearrange the embers and keep the fire alive.",
      "example_cn": "她用拨火棍重新摆放了余烬，以保持炉火不灭。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is overly curious or meddlesome, especially in other people's affairs; often used in the phrase 'poker face' to describe someone who hides their emotions.",
      "explanation_cn": "指对他人事务过度好奇或爱管闲事的人；常与 'poker face'（扑克脸）连用，形容面无表情、不露情绪的人。",
      "example_en": "He's such a poker—he keeps asking about everyone's personal life.",
      "example_cn": "他真是个爱管闲事的人，总打听别人的私事。"
    },
    {
      "pos": "verb",
      "explanation_en": "To stir or prod something, especially embers or ashes in a fire, with a poker.",
      "explanation_cn": "用拨火棍拨动或捅动（尤指炉火中的余烬）。",
      "example_en": "He poked the fire to make it burn brighter.",
      "example_cn": "他拨了拨炉火，让它烧得更旺。"
    },
    {
      "pos": "verb",
      "explanation_en": "To inquire or probe into someone's affairs in a persistent or intrusive way.",
      "explanation_cn": "以持续或侵扰的方式打探某人的私事。",
      "example_en": "Don't poke into my personal business—I don't want to talk about it.",
      "example_cn": "别打探我的私事——我不想谈这个。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cards",
      "analysis": "“Cards”（纸牌）是泛指所有类型的牌，包括扑克牌、麻将牌、塔罗牌等，是一个更宽泛的类别。而 “poker” 特指一种具体的纸牌游戏及其相关语境，具有明确的规则和文化含义。"
    },
    {
      "word_to_compare": "stirrer",
      "analysis": "“Stirrer”（搅拌棒）泛指任何用于搅拌的工具，如咖啡搅拌棒或化学实验中的搅拌棒，用途广泛且无特定文化联想。而 “poker” 专指用于拨火的金属长棍，具有明确的家居或壁炉使用场景，语义更具体。"
    },
    {
      "word_to_compare": "meddler",
      "analysis": "“Meddler”（爱管闲事者）是直接描述爱干涉他人事务的人，语气偏贬义，但无隐喻色彩。而 “poker” 作为名词表示此类人时，是借用了 “poker face” 的隐喻，暗含“不动声色地打探”之意，语义更微妙、更具文学性。"
    }
  ]
}