{
  "word": "polarization",
  "pronunciation": "poh·luh·ruh·zey·shun",
  "concise_definition": "n. 极化, 两极分化, 偏振",
  "forms": {
    "plural": "polarizations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process or state of dividing into two sharply contrasting or opposing groups, especially in politics, society, or opinion, leading to increased hostility or reduced compromise.",
      "explanation_cn": "指在政治、社会或观点上分裂为两个截然对立的群体的过程或状态，常导致敌意加剧和妥协减少。",
      "example_en": "The polarization of political parties has made it difficult to pass bipartisan legislation.",
      "example_cn": "政党的两极分化使得通过两党共同支持的立法变得困难。"
    },
    {
      "pos": "noun",
      "explanation_en": "The physical phenomenon in which waves (especially light or electromagnetic waves) oscillate in a particular direction, often achieved by filtering out other orientations.",
      "explanation_cn": "指波（尤其是光波或电磁波）沿特定方向振动的物理现象，通常通过滤除其他方向的振动来实现。",
      "example_en": "Polarized sunglasses reduce glare by blocking horizontally oriented light waves.",
      "example_cn": "偏光太阳镜通过阻挡水平方向的光波来减少眩光。"
    },
    {
      "pos": "noun",
      "explanation_en": "The separation of electric charges within a material, resulting in one side becoming positively charged and the other negatively charged, often under the influence of an external electric field.",
      "explanation_cn": "指在材料内部由于外加电场的作用，电荷分离导致一侧带正电、另一侧带负电的现象。",
      "example_en": "Dielectric polarization occurs when insulating materials are exposed to an electric field.",
      "example_cn": "当绝缘材料暴露在电场中时，会发生电介质极化。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "division",
      "analysis": "“Division” (分裂) 是一个更广泛、中性的词，泛指任何类型的分割或区分，不必然带有对立或极端的含义。而 “polarization” 特指分裂为两个极端对立的阵营，强调张力、对立和不可调和性，语义更强烈、更具社会政治色彩。"
    },
    {
      "word_to_compare": "segmentation",
      "analysis": "“Segmentation” (细分) 通常用于商业或社会学中，指将整体划分为多个具有相似特征的子群体，目的是为了精准服务或分析，不隐含冲突或对立。而 “polarization” 暗示这些群体之间存在排斥、敌意或零和博弈。"
    },
    {
      "word_to_compare": "orientation",
      "analysis": "“Orientation” (取向/定位) 指方向、立场或倾向，常用于描述个体或群体的偏好或态度，但不涉及群体间的对立结构。而 “polarization” 是一种系统性、结构性的两极分布，强调群体间距离的扩大和中间地带的消失。"
    }
  ]
}