{
  "word": "poles",
  "pronunciation": "pohlz",
  "concise_definition": "n. 极点, 杆, 杆状物, 波兰人（复数）",
  "forms": {
    "singular": "pole"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "One of the two points on the Earth's surface where its axis of rotation intersects, representing the geographic North Pole and South Pole.",
      "explanation_cn": "指地球表面自转轴与地表相交的两个点，即地理上的北极和南极。",
      "example_en": "The Arctic Circle lies near the North Pole.",
      "example_cn": "北极圈位于北极附近。"
    },
    {
      "pos": "noun",
      "explanation_en": "A long, slender, usually cylindrical object made of wood, metal, or other material, used for support, suspension, or as a marker.",
      "explanation_cn": "指一根细长的圆柱形物体，通常由木头、金属或其他材料制成，用于支撑、悬挂或作为标记物。",
      "example_en": "They hung the lantern from a wooden pole in the garden.",
      "example_cn": "他们把灯笼挂在花园里的一根木杆上。"
    },
    {
      "pos": "noun",
      "explanation_en": "In electricity and magnetism, one of the two terminals or regions of a magnet or electric circuit where the magnetic or electric force is concentrated, such as the positive and negative poles.",
      "explanation_cn": "在电学和磁学中，指磁体或电路中磁力或电力集中的两个端点或区域，如正极和负极。",
      "example_en": "The battery has a positive pole and a negative pole.",
      "example_cn": "这节电池有正极和负极。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person from Poland; plural form used to refer to multiple individuals from Poland.",
      "explanation_cn": "指来自波兰的人；复数形式用于指多个波兰人。",
      "example_en": "Many poles moved to the UK after Poland joined the European Union.",
      "example_cn": "波兰加入欧盟后，许多波兰人移居英国。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rod",
      "analysis": "“Rod”（杆）通常指较短、较细、用于工具或机械部件的实心棒状物，如钓鱼竿或杠杆；而 “pole” 更常用于指较长、较直、用于支撑或标记的杆状物，如电线杆或旗杆。两者虽可互换，但 “pole” 更强调长度和功能性用途。"
    },
    {
      "word_to_compare": "extremity",
      "analysis": "“Extremity”（极端、末端）是一个更抽象的词，泛指任何事物的最远端或极限部分，如身体的四肢或情况的极端；而 “pole” 在地理或物理语境中特指两个对称的端点，具有明确的方位或物理属性，如磁极或地理极点。"
    },
    {
      "word_to_compare": "nation",
      "analysis": "“Nation”（国家）指具有共同文化、语言或历史的人民群体，是一个政治或社会概念；而 “poles” 作为波兰人的复数形式，仅指代具有波兰国籍或血统的个体，是民族身份的集合名词，不包含国家制度或领土含义。"
    }
  ]
}