{
  "word": "pole",
  "pronunciation": "pohl",
  "concise_definition": "n. 杆, 杆状物, 地极; v. 用杆推",
  "forms": {
    "plural": "poles",
    "third_person_singular": "poles",
    "past_tense": "poled",
    "past_participle": "poled",
    "present_participle": "poled"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long, slender, cylindrical object, typically made of wood, metal, or plastic, used for support, suspension, or as a marker.",
      "explanation_cn": "指一根细长的圆柱形物体，通常由木材、金属或塑料制成，用于支撑、悬挂或作为标记物。",
      "example_en": "The flag was raised on a tall metal pole.",
      "example_cn": "旗帜被升上了一根高高的金属杆。"
    },
    {
      "pos": "noun",
      "explanation_en": "One of the two points on the Earth's surface where its axis of rotation intersects, referring to the North Pole or South Pole.",
      "explanation_cn": "指地球自转轴与地表相交的两个点，即北极或南极。",
      "example_en": "Polar bears are native to the Arctic region around the North Pole.",
      "example_cn": "北极熊原产于围绕北极的北极地区。"
    },
    {
      "pos": "noun",
      "explanation_en": "In electricity, one of the two terminals of a battery or magnet, designated as positive or negative (or north and south), where electric or magnetic forces originate.",
      "explanation_cn": "在电学中，指电池或磁体的两个端点之一，标记为正极或负极（或北极或南极），是电力或磁力的来源。",
      "example_en": "The positive pole of the battery is connected to the red wire.",
      "example_cn": "电池的正极连接到红色导线上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To push or propel something, especially a boat, using a long pole, typically against the bottom of a river or canal.",
      "explanation_cn": "指用长杆推动物体，尤指用杆抵住河床或运河底部来推动船只前进。",
      "example_en": "The guide poled the canoe through the shallow waters.",
      "example_cn": "向导用杆撑着独木舟穿过浅水区。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rod",
      "analysis": "“Rod”（杆）通常指较短、较细、用于特定用途（如钓鱼竿、金属棒）的刚性物体，常带有工具或设备的含义；而 “pole” 更强调长度和支撑功能，多用于建筑、旗帜或地理语境，尺寸通常更大。"
    },
    {
      "word_to_compare": "post",
      "analysis": "“Post”（柱、桩）一般指垂直固定在地面或结构中的短粗支撑物，如门柱、电线杆，强调其作为固定支点的功能；而 “pole” 更强调细长形态和可移动性，如撑船的杆或悬挂旗帜的杆，不一定固定于地面。"
    },
    {
      "word_to_compare": "axis",
      "analysis": "“Axis”（轴）是抽象的几何或物理概念，指物体旋转所围绕的假想直线；而 “pole” 是轴与地球表面的两个实际交点，是具体的地理位置。在科学语境中，axis 是理论线，pole 是其端点。"
    }
  ]
}