{
  "word": "politically",
  "pronunciation": "pah·lit·i·kuh·lee",
  "concise_definition": "adv. 政治上, 从政治角度, 有政治动机地",
  "forms": {
    "comparative": "",
    "superlative": ""
  },
  "definitions": [
    {
      "pos": "adverb",
      "explanation_en": "In a manner related to politics, government, or the exercise of power and authority; describing actions, decisions, or perspectives influenced by political considerations.",
      "explanation_cn": "以与政治、政府或权力行使相关的方式；描述受政治考量影响的行为、决策或观点。",
      "example_en": "The decision was politically motivated, aimed at gaining support from key voter groups.",
      "example_cn": "这一决定出于政治动机，旨在争取关键选民群体的支持。"
    },
    {
      "pos": "adverb",
      "explanation_en": "From the standpoint of political ideology or alignment; indicating conformity with or opposition to a particular political position or party.",
      "explanation_cn": "从政治意识形态或立场的角度出发；表明与某种政治立场或政党一致或对立。",
      "example_en": "She is politically liberal, advocating for social equality and environmental reform.",
      "example_cn": "她在政治上持自由派立场，倡导社会平等与环境改革。"
    },
    {
      "pos": "adverb",
      "explanation_en": "In a way that involves strategic maneuvering or compromise to achieve political advantage, often at the expense of principle.",
      "explanation_cn": "以通过策略性操作或妥协来获取政治利益的方式，常以牺牲原则为代价。",
      "example_en": "The mayor politically delayed the vote to avoid alienating powerful interest groups.",
      "example_cn": "市长在政治上推迟了投票，以避免触怒有影响力的利益集团。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ideologically",
      "analysis": "“Ideologically”（从意识形态上）强调基于一套系统性信念或价值观的立场，如自由主义、保守主义等，通常更抽象和理论化。而 “politically” 更侧重于实际权力运作、选举利益或政策妥协，更具现实性和策略性。"
    },
    {
      "word_to_compare": "diplomatically",
      "analysis": "“Diplomatically”（以外交方式）强调以谨慎、委婉、避免冲突的方式处理事务，常用于国际关系或人际沟通中。而 “politically” 更关注权力结构和利益博弈，不一定追求和谐，有时甚至故意制造张力以达成目标。"
    },
    {
      "word_to_compare": "strategically",
      "analysis": "“Strategically”（战略性地）泛指为实现长期目标而进行的有计划安排，可用于商业、军事或个人领域。而 “politically” 是 “strategically” 在政治语境中的特例，特指以政治利益为导向的策略行为，带有明显的权力和群体认同色彩。"
    }
  ]
}