{
  "word": "politics",
  "pronunciation": "pah·lit·iks",
  "concise_definition": "n. 政治, 政治活动, 政治手段",
  "forms": {
    "plural": "politics"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The art or science of governing a country or region, including the processes, institutions, and activities involved in making and enforcing public policy, exercising power, and managing conflicts among groups.",
      "explanation_cn": "指治理国家或地区的艺术或科学，包括制定和执行公共政策、行使权力以及管理群体间冲突所涉及的过程、制度和活动。",
      "example_en": "She studied politics at university and now works as a policy advisor.",
      "example_cn": "她在大学主修政治学，现在担任政策顾问。"
    },
    {
      "pos": "noun",
      "explanation_en": "The activities, strategies, or behaviors used to gain or maintain power within an organization or group, often involving manipulation, negotiation, or self-interest.",
      "explanation_cn": "指在组织或团体中为获取或维持权力而采取的活动、策略或行为，常涉及操纵、谈判或个人利益。",
      "example_en": "Office politics made it difficult for new employees to get promoted.",
      "example_cn": "办公室政治使得新员工难以获得晋升。"
    },
    {
      "pos": "noun",
      "explanation_en": "The collective system of beliefs, ideologies, and practices related to government and public affairs in a society.",
      "explanation_cn": "指一个社会中与政府和公共事务相关的整体信仰、意识形态和实践体系。",
      "example_en": "The country's politics have become increasingly polarized in recent years.",
      "example_cn": "近年来，该国的政治日益两极分化。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "government",
      "analysis": "“Government”（政府）指具体的统治机构或组织，如议会、总统、内阁等，是执行政治权力的实体。而 “politics” 更侧重于权力运作的过程、策略和互动，是抽象的活动体系，政府是政治的载体，但政治不等于政府本身。"
    },
    {
      "word_to_compare": "policy",
      "analysis": "“Policy”（政策）是政治活动的产物，指具体的决策或行动方案，如税收政策、教育政策。而 “politics” 是制定这些政策的整个过程，包括辩论、妥协、利益博弈等。政策是政治的结果，政治是政策的土壤。"
    },
    {
      "word_to_compare": "ideology",
      "analysis": "“Ideology”（意识形态）指一套系统的观念、信仰或价值观，如自由主义、社会主义，是政治立场的理论基础。而 “politics” 是这些意识形态在现实中的实践和应用，包括权力斗争、选举、立法等具体行为。意识形态是政治的指导思想，政治是意识形态的舞台。"
    }
  ]
}