{
  "word": "political",
  "pronunciation": "puh·lit·i·kuhl",
  "concise_definition": "adj. 政治的, 政治相关的, 有政治目的的",
  "forms": {
    "comparative": "more political",
    "superlative": "most political"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to the government, public affairs, or the activities associated with gaining and exercising power within a state or community.",
      "explanation_cn": "与政府、公共事务或在国家或社会中获取和行使权力的活动相关的。",
      "example_en": "The new policy has sparked intense political debate.",
      "example_cn": "这项新政策引发了激烈的政治争论。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Influenced by or motivated by political considerations rather than purely objective or practical ones; often implying bias or strategic advantage.",
      "explanation_cn": "受政治因素影响或由政治考量驱动，而非纯粹基于客观或实际因素；常暗示偏见或战略利益。",
      "example_en": "Her appointment was seen as a political move to gain support from minority groups.",
      "example_cn": "她的任命被视为一种争取少数群体支持的政治手段。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Concerned with the principles and practices of politics as a field of study or social activity.",
      "explanation_cn": "涉及政治作为一门学科或社会活动的原则与实践。",
      "example_en": "He has a deep interest in political theory and historical governance models.",
      "example_cn": "他对政治理论和历史治理模式有浓厚兴趣。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "governmental",
      "analysis": "“Governmental”（政府的）特指与政府机构、官方职能或行政体系直接相关的事物，范围较窄，强调制度性。而 “political” 范围更广，涵盖权力斗争、意识形态、公众舆论等非正式或非机构性的活动。例如，政府预算属于 governmental，但围绕预算的党派博弈则是 political。"
    },
    {
      "word_to_compare": "ideological",
      "analysis": "“Ideological”（意识形态的）强调基于一套系统性信念或价值观（如自由主义、社会主义）的立场，通常具有理论性和原则性。而 “political” 更侧重于实际权力运作和利益分配，可能不涉及深层信念，仅出于策略或实用目的。一个决定可以是 political 而不一定是 ideological。"
    },
    {
      "word_to_compare": "public",
      "analysis": "“Public”（公共的）泛指与社会大众或共同利益相关的事物，如公共设施、公共安全。它不必然涉及权力结构或政党活动。而 “political” 特指与权力、治理、政策制定相关的公共事务，具有明确的权力维度。例如，公园是 public，但决定公园预算分配的争论是 political。"
    }
  ]
}