{
  "word": "polling",
  "pronunciation": "poh·ling",
  "concise_definition": "n. 投票, 民意调查, 选举计票",
  "forms": {
    "noun": "polling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of collecting opinions or votes from a group of people, typically to gauge public sentiment or determine the outcome of an election.",
      "explanation_cn": "指从一群人中收集意见或选票的过程，通常用于衡量公众情绪或确定选举结果。",
      "example_en": "The polling data showed a narrow lead for the incumbent candidate.",
      "example_cn": "民意调查数据显示现任候选人以微弱优势领先。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of conducting a survey, especially one designed to measure public opinion on political, social, or economic issues.",
      "explanation_cn": "指进行一项调查的行为，尤其是旨在衡量公众对政治、社会或经济问题态度的调查。",
      "example_en": "Exit polling revealed unexpected voter preferences in several key states.",
      "example_cn": "出口民调揭示了几个关键州选民出人意料的偏好。"
    },
    {
      "pos": "noun",
      "explanation_en": "The system or method used to record and count votes in an election, often referring to the physical or digital infrastructure involved.",
      "explanation_cn": "指在选举中记录和计票的系统或方法，常指所涉及的物理或数字基础设施。",
      "example_en": "The country upgraded its polling infrastructure to prevent fraud and improve accessibility.",
      "example_cn": "该国升级了投票基础设施，以防止舞弊并提高可及性。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "survey",
      "analysis": "“Survey”（调查）是一个更广泛的术语，泛指任何形式的数据收集，包括问卷、访谈、观察等，不限于政治或选举场景。而 “polling” 特指以统计公众意见或投票结果为目的的系统性调查，通常具有明确的样本代表性和量化分析特征。"
    },
    {
      "word_to_compare": "voting",
      "analysis": "“Voting”（投票）强调的是个体表达选择的行为本身，是投票过程中的一个动作。而 “polling” 指的是收集这些投票或意见的整个系统性过程，包括设计、实施、统计和分析。投票是 polling 的组成部分，但 polling 不仅限于正式投票。"
    },
    {
      "word_to_compare": "opinion poll",
      "analysis": "“Opinion poll” 是 “polling” 的同义表达，常可互换使用，但 “opinion poll” 更明确地指向对公众意见的测量，而 “polling” 作为名词使用时，语义更广，可涵盖选举计票、实时数据采集等非意见类场景。在正式语境中，两者常被视为等价，但 “polling” 更常用于新闻报道和政治分析中作为简洁术语。"
    }
  ]
}