{
  "word": "pools",
  "pronunciation": "po͞ols",
  "concise_definition": "n. 水池, 池塘, 赌注集合, 资金池; v. 合并, 集中",
  "forms": {
    "singular": "pool"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small body of still water, either natural or artificial, often used for swimming, decoration, or watering livestock.",
      "explanation_cn": "指自然形成或人工建造的静水区域，常用于游泳、装饰或牲畜饮水。",
      "example_en": "The children splashed around in the backyard pool.",
      "example_cn": "孩子们在后院的泳池里嬉戏。"
    },
    {
      "pos": "noun",
      "explanation_en": "A collective fund or group of resources contributed by several people for a shared purpose, such as betting, investment, or resource sharing.",
      "explanation_cn": "指由多人共同出资或贡献形成的集合资金或资源，用于共同目的，如赌博、投资或资源共享。",
      "example_en": "They formed a lottery pool to increase their chances of winning.",
      "example_cn": "他们组成了一个彩票彩池，以提高中奖几率。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large number of similar things grouped together, often used metaphorically to describe a supply or selection (e.g., a pool of candidates).",
      "explanation_cn": "指大量同类事物的集合，常用于比喻性表达，如人才库、候选人群体等。",
      "example_en": "The company is drawing from a large pool of qualified applicants.",
      "example_cn": "该公司正从大量合格的应聘者中进行筛选。"
    },
    {
      "pos": "verb",
      "explanation_en": "To combine resources, efforts, or funds with others for mutual benefit or efficiency.",
      "explanation_cn": "指与他人合并资源、努力或资金，以实现共同利益或提高效率。",
      "example_en": "The neighbors pooled their money to buy a new playground swing.",
      "example_cn": "邻居们凑钱买了一个新的秋千。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pond",
      "analysis": "“Pond”（池塘）通常指自然形成的小型水体，规模较小，多用于生态或景观用途，不用于人工游泳或资金集合。而 “pool” 可以是人工建造的，用途更广泛，包括游泳、资金合并等。"
    },
    {
      "word_to_compare": "fund",
      "analysis": "“Fund”（基金）特指用于特定目的的金钱集合，通常具有正式管理结构（如慈善基金、养老基金）。而 “pool” 更强调多人临时或非正式地汇集资源，不一定有制度化管理，语义更灵活。"
    },
    {
      "word_to_compare": "aggregate",
      "analysis": "“Aggregate”（合计/集合）是一个更抽象、更正式的术语，常用于统计或数学语境，指多个数值或元素的总和。而 “pool” 更具实际操作性，强调资源的共同使用和协作，常用于日常或商业语境。"
    }
  ]
}