{
  "word": "pool",
  "pronunciation": "poohl",
  "concise_definition": "n. 水池, 池塘, 资金池, 共同资源; v. 合并, 集中, 共享",
  "forms": {
    "plural": "pools",
    "third_person_singular": "pools",
    "past_tense": "pooled",
    "past_participle": "pooled",
    "present_participle": "pooling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small body of still water, either natural or artificial, often used for swimming, decoration, or irrigation.",
      "explanation_cn": "指自然或人工形成的静止水体，常用于游泳、装饰或灌溉。",
      "example_en": "The children splashed around in the backyard pool.",
      "example_cn": "孩子们在后院的泳池里嬉戏。"
    },
    {
      "pos": "noun",
      "explanation_en": "A collective fund or resource contributed by multiple parties for a shared purpose, such as betting, financing, or risk-sharing.",
      "explanation_cn": "指由多方共同出资或贡献形成的集合资金或资源，用于共同目的，如赌博、融资或风险分担。",
      "example_en": "The employees pooled their money to buy a gift for their boss.",
      "example_cn": "员工们凑钱给老板买了一份礼物。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of people or vehicles sharing a common resource or schedule, such as a carpool or a pool of qualified candidates.",
      "explanation_cn": "指共享某种资源或安排的群体，如拼车群体或合格候选人库。",
      "example_en": "The company maintains a pool of freelance designers for urgent projects.",
      "example_cn": "公司保留了一个自由职业设计师库，以应对紧急项目。"
    },
    {
      "pos": "verb",
      "explanation_en": "To combine resources, efforts, or funds from different sources into a single shared pool for mutual benefit.",
      "explanation_cn": "指将来自不同来源的资源、努力或资金合并为一个共享的集合，以实现共同利益。",
      "example_en": "They pooled their expertise to solve the complex problem.",
      "example_cn": "他们将各自的专长结合起来，解决了这个复杂问题。"
    },
    {
      "pos": "verb",
      "explanation_en": "To gather or accumulate something in a concentrated form, often implying a buildup over time.",
      "explanation_cn": "指将某物聚集或累积成集中形式，常暗示随着时间推移逐渐积累。",
      "example_en": "Rainwater pooled in the low areas of the field after the storm.",
      "example_cn": "暴风雨后，雨水在田地的低洼处积聚起来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pond",
      "analysis": "“Pond”（池塘）通常指自然形成的小型水体，规模较小且多为静止，常用于描述生态或景观环境；而 “pool” 可以是人工建造的，用途更广泛（如游泳、资金），且常带有功能性或组织性含义。"
    },
    {
      "word_to_compare": "fund",
      "analysis": "“Fund”（基金）特指用于特定目的的金钱集合，通常具有正式管理结构和法律属性；而 “pool” 更强调资源的临时性、协作性或非正式合并，适用范围更广，可包括人力、设备、时间等非金钱资源。"
    },
    {
      "word_to_compare": "combine",
      "analysis": "“Combine”（合并）泛指将两个或多个事物合为一体，强调动作本身；而 “pool” 特指将资源集中共享，保留各自所有权或贡献身份，常隐含合作与互利的语义，更强调资源的共用性而非完全融合。"
    }
  ]
}