{
  "word": "poor",
  "pronunciation": "pohr",
  "concise_definition": "adj. 贫穷的, 贫乏的, 糟糕的",
  "forms": {
    "comparative": "poorer",
    "superlative": "poorest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Lacking sufficient money or resources to meet basic needs such as food, shelter, and clothing; living in poverty.",
      "explanation_cn": "缺乏满足基本生活需求（如食物、住所和衣物）所需的资金或资源；处于贫困状态。",
      "example_en": "Many families in the region are poor and rely on charity for survival.",
      "example_cn": "该地区许多家庭生活贫困，依赖慈善机构维持生计。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Of low quality, inadequate, or unsatisfactory; not meeting expected standards.",
      "explanation_cn": "质量低劣、不足或令人不满意；未达到预期标准。",
      "example_en": "The poor lighting in the room made it hard to read.",
      "example_cn": "房间里的光线太差，难以阅读。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Expressing sympathy or pity, often used to describe someone in an unfortunate situation (sometimes with condescension).",
      "explanation_cn": "用于表达同情或怜悯，常指处于不幸境况中的人（有时带有居高临下的意味）。",
      "example_en": "Poor thing, she lost her job and her apartment all in one week.",
      "example_cn": "可怜的孩子，她一周之内丢了工作又失去了公寓。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Inadequate in quantity or content, especially in terms of nutrients or value.",
      "explanation_cn": "数量或内容不足，尤指营养或价值匮乏。",
      "example_en": "The soil is poor and won't support healthy crops without fertilizer.",
      "example_cn": "土壤贫瘠，不施肥料就无法长出健康的庄稼。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "impoverished",
      "analysis": "“Impoverished”（赤贫的）是“poor”的更正式、更强烈的同义词，通常用于描述因系统性原因导致的极端贫困，带有社会或经济分析的语境。而 “poor” 更通用，可用于日常口语，也可形容非经济层面的匮乏。"
    },
    {
      "word_to_compare": "bad",
      "analysis": "“Bad”（坏的）是一个广泛使用的形容词，可指道德、质量、状态等多方面的负面含义，但不特指经济匮乏。而 “poor” 在描述质量差时更侧重于“低劣”或“不足”，如 poor performance（表现差），比 “bad” 更具客观描述性。"
    },
    {
      "word_to_compare": "destitute",
      "analysis": "“Destitute”（一无所有的）比 “poor” 更极端，指完全缺乏基本生存资源，常带有无依无靠、走投无路的意味。它强调彻底的匮乏，而 “poor” 可以涵盖从轻微不足到严重贫困的广泛范围。"
    }
  ]
}