{
  "word": "popped",
  "pronunciation": "pahpt",
  "concise_definition": "v. 爆裂, 突然出现, 快速进出, 爆米花",
  "forms": {
    "base_form": "pop",
    "third_person_singular": "pops",
    "past_tense": "popped",
    "past_participle": "popped",
    "present_participle": "popping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To burst suddenly with a sharp sound, often due to pressure or heat, as a balloon, bubble, or kernel of corn.",
      "explanation_cn": "指因压力或热量突然爆裂，并发出清脆的响声，如气球、气泡或玉米粒。",
      "example_en": "The balloon popped when it touched the sharp edge of the table.",
      "example_cn": "气球碰到桌子的尖锐边缘时突然爆裂了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To appear or arrive suddenly and often unexpectedly, especially in a casual or brief manner.",
      "explanation_cn": "指突然且常常出人意料地出现，通常带有随意或短暂的性质。",
      "example_en": "She popped into the office just to say hello before heading to lunch.",
      "example_cn": "她只是顺路进办公室打了个招呼，就去吃午饭了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or act quickly and energetically, often in a lively or abrupt way, especially in informal contexts.",
      "explanation_cn": "指以快速、有活力的方式移动或行动，常用于非正式语境中，带有突然或活泼的意味。",
      "example_en": "He popped up from his chair and ran out the door.",
      "example_cn": "他猛地从椅子上跳起来，冲出了门。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make popcorn by heating corn kernels until they burst open.",
      "explanation_cn": "指通过加热玉米粒使其爆开制成爆米花。",
      "example_en": "We popped some kernels in the microwave for movie night.",
      "example_cn": "我们用微波炉爆了一些玉米粒，准备看电影时吃。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "burst",
      "analysis": "“Burst” (爆裂) 与 “popped” 在描述物体因内部压力破裂时意义相近，但 “burst” 更常用于强调剧烈、破坏性的破裂，常伴随严重后果（如血管爆裂、水管爆裂），而 “popped” 更轻快、日常，多用于无害或有趣的情境（如气球、爆米花）。"
    },
    {
      "word_to_compare": "appeared",
      "analysis": "“Appeared” (出现) 是中性、正式的词，仅表示某物或某人进入视野，不带速度或突然性的语义色彩。而 “popped” 在表示出现时，隐含了快速、意外、甚至有点俏皮的意味，更具口语化和生动性。"
    },
    {
      "word_to_compare": "sprang",
      "analysis": "“Sprang” (跳起) 是 “spring” 的过去式，强调从静止状态迅速弹起或跃起，常用于身体动作（如猫从地板上弹起）。而 “popped” 在表示突然出现时，不一定涉及身体的跳跃，更侧重于“突然现身”的结果，动作感较弱，语义更宽泛。"
    }
  ]
}