{
  "word": "populist",
  "pronunciation": "pop·yuh·list",
  "concise_definition": "adj. 民粹主义的, 争取大众支持的; n. 民粹主义者",
  "forms": {
    "comparative": "more populist",
    "superlative": "most populist",
    "plural": "populists"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or appealing to the interests, desires, and opinions of the general population, often by simplifying complex issues and appealing to emotions rather than rational argument.",
      "explanation_cn": "指与大众的利益、愿望和观点相关，或以此为诉求的；常通过简化复杂问题、诉诸情感而非理性论证来争取广泛支持。",
      "example_en": "The politician gave a populist speech promising to cut taxes for everyone, regardless of income.",
      "example_cn": "这位政治家发表了一篇民粹主义演讲，承诺为所有人减税，不论收入高低。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by a political approach that pits 'the ordinary people' against 'the elite', often fostering distrust in institutions and established leadership.",
      "explanation_cn": "指一种政治策略，将‘普通民众’与‘精英阶层’对立，常煽动对制度和既有领导层的不信任。",
      "example_en": "Populist movements have gained traction in several Western democracies by blaming immigrants for economic stagnation.",
      "example_cn": "民粹主义运动通过将经济停滞归咎于移民，在多个西方民主国家获得了广泛支持。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who supports or advocates populism, typically by positioning themselves as the voice of the common people against corrupt or out-of-touch elites.",
      "explanation_cn": "指支持或倡导民粹主义的人，通常自诩为普通民众的代言人，反对腐败或脱离群众的精英阶层。",
      "example_en": "The populist ran for office claiming he was the only one who truly understood the struggles of working families.",
      "example_cn": "这位民粹主义者竞选公职时声称，他是唯一真正理解工薪家庭困境的人。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "democratic",
      "analysis": "“Democratic”（民主的）指符合民主制度原则的政治体系或行为，强调程序正义、多数决定与权利保障，不必然诉诸情绪或对立叙事。而 “populist”（民粹主义的）虽常以‘代表人民’为名，但可能绕过制度程序，通过煽动性言论获取支持，甚至威胁民主规范。"
    },
    {
      "word_to_compare": "charismatic",
      "analysis": "“Charismatic”（有魅力的）描述个人因个性、感染力或吸引力而赢得追随者，这种影响力可以是正面的（如马丁·路德·金）或中性的。而 “populist” 强调的是一种特定的政治策略——利用民众对精英的不满来建立权力，其核心是意识形态和叙事，而非单纯的人格魅力。"
    },
    {
      "word_to_compare": "nationalist",
      "analysis": "“Nationalist”（民族主义的）聚焦于国家主权、文化纯洁性和民族优越性，常以‘本国优先’为口号。而 “populist” 的核心是‘人民 vs. 精英’的二元对立，其支持基础可以跨越国界，不一定与民族认同绑定。两者常重叠，但并非等同：一个民粹主义者可以是跨国的，而一个民族主义者未必是民粹主义者。"
    }
  ]
}