{
  "word": "portsmouth",
  "pronunciation": "pawrtmuth",
  "concise_definition": "n. 波特smouth（英国港口城市名）",
  "forms": {
    "plural": "portsmouths"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A coastal city in southern England, known for its historic naval dockyard, the HMS Victory, and as the departure point of many important maritime expeditions.",
      "explanation_cn": "英国南部一座沿海城市，以历史悠久的海军船坞、胜利号战舰（HMS Victory）以及作为众多重要航海远征的出发地而闻名。",
      "example_en": "Portsmouth is home to the Mary Rose Museum, which displays a 16th-century warship raised from the seabed.",
      "example_cn": "波特smouth是玛丽玫瑰博物馆的所在地，该博物馆展出了一艘从海底打捞上来的16世纪战舰。"
    },
    {
      "pos": "noun",
      "explanation_en": "A city in New Hampshire, United States, known for its well-preserved 18th-century architecture and vibrant downtown waterfront.",
      "explanation_cn": "美国新罕布什尔州的一座城市，以其保存完好的18世纪建筑和充满活力的滨水市中心而闻名。",
      "example_en": "Tourists flock to Portsmouth, New Hampshire, in the fall to enjoy the colorful foliage and historic charm.",
      "example_cn": "秋季，游客纷纷前往美国新罕布什尔州的波特smouth，欣赏绚丽的秋叶和历史韵味。"
    },
    {
      "pos": "noun",
      "explanation_en": "A city in Virginia, United States, located on the southern shore of the James River, known for its military installations and industrial history.",
      "explanation_cn": "美国弗吉尼亚州的一座城市，位于詹姆斯河南岸，以军事设施和工业历史著称。",
      "example_en": "The naval base in Portsmouth, Virginia, has been a key strategic asset since the 19th century.",
      "example_cn": "自19世纪以来，弗吉尼亚州波特smouth的海军基地一直是一项关键的战略资产。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "harbor",
      "analysis": "“Harbor”（港口）泛指船只停泊、装卸货物的水域或设施，是一个通用地理术语。而 “Portsmouth” 是一个专有名词，特指某座以港口闻名的城市，其含义包含地理、历史和文化多重属性，远超单纯的港口功能。"
    },
    {
      "word_to_compare": "seaport",
      "analysis": "“Seaport”（海港）是描述一个具备海上运输功能的港口城市的通用词，强调其经济与交通职能。而 “Portsmouth” 是具体地名，即使它是一个海港，其名称本身承载着独特的历史事件、建筑遗产和地方身份，不能被“seaport”一词替代。"
    },
    {
      "word_to_compare": "city",
      "analysis": "“City”（城市）是泛指人口密集、具有行政和经济功能的聚居地，而 “Portsmouth” 是一个具体城市名称，其意义不仅在于城市属性，更在于其作为英国皇家海军发源地、美国殖民历史见证者等特殊文化身份。"
    }
  ]
}