{
  "word": "porte",
  "pronunciation": "pɔːrt",
  "concise_definition": "n. 门, 出入口, 船舶的舷门",
  "forms": {
    "plural": "portes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A door or entrance, especially one that is large, formal, or architecturally significant; often used in architectural or literary contexts to denote a grand or symbolic gateway.",
      "explanation_cn": "指一扇门或出入口，尤指规模宏大、正式或具有建筑重要性的门；常用于建筑或文学语境中，表示宏伟或象征性的入口。",
      "example_en": "The ancient castle was entered through a massive stone porte adorned with heraldic carvings.",
      "example_cn": "这座古老的城堡通过一扇装饰着纹章雕刻的巨型石门进入。"
    },
    {
      "pos": "noun",
      "explanation_en": "In nautical terminology, a door or hatch on the side of a ship, typically used for loading cargo or embarking/disembarking passengers.",
      "explanation_cn": "在航海术语中，指船舶侧面的门或舱口，通常用于装卸货物或上下乘客。",
      "example_en": "The crew opened the porte to unload the supplies onto the dock.",
      "example_cn": "船员打开舷门，将补给品卸到码头上。"
    },
    {
      "pos": "noun",
      "explanation_en": "In French-influenced contexts, a term used to describe a ceremonial or symbolic entrance, often in art, theater, or fashion (e.g., 'porte-cochère' or 'porte-bonheur').",
      "explanation_cn": "在受法语影响的语境中，用于描述一种仪式性或象征性的入口，常见于艺术、戏剧或时尚领域（如 'porte-cochère' 或 'porte-bonheur'）。",
      "example_en": "The hotel’s porte-cochère provided a grand, sheltered entrance for arriving guests.",
      "example_cn": "酒店的车马门为抵达的宾客提供了宏伟而遮蔽的入口。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "door",
      "analysis": "“Door” 是最通用的词，泛指任何用于进出的门户，无特殊语体或象征意义。而 “porte” 更具文学性、建筑性或法语文化色彩，常用于描述具有设计感、仪式感或历史感的门，语义更丰富、语境更特定。"
    },
    {
      "word_to_compare": "entrance",
      "analysis": "“Entrance” 强调进入的动作或空间的入口区域，可指建筑整体的入口，不一定是实体门。而 “porte” 更具体地指门本身，常带有结构或装饰特征，更偏向物理实体，且常用于正式或艺术语境。"
    },
    {
      "word_to_compare": "hatch",
      "analysis": "“Hatch” 通常指较小的、可开启的舱口或盖板，多用于船舶、飞机或地下室，强调功能性而非装饰性。而 “porte” 在航海语境中虽可指舷门，但通常更大、更正式，有时甚至具有礼仪功能，语义范围更广。"
    }
  ]
}