{
  "word": "portfolios",
  "pronunciation": "pawr·tuh·fow·lee·ohz",
  "concise_definition": "n. 作品集, 投资组合, 公文包",
  "forms": {
    "singular": "portfolio"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A collection of selected works, projects, or achievements, typically presented to demonstrate one's skills, creativity, or professional experience, especially in fields like art, design, writing, or architecture.",
      "explanation_cn": "指精选的作品、项目或成就的集合，通常用于展示个人在艺术、设计、写作或建筑等领域的技能、创造力或专业经验。",
      "example_en": "She presented her portfolio to the design firm and was offered a job the same day.",
      "example_cn": "她向设计公司展示了她的作品集，当天就收到了录用通知。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of financial assets, such as stocks, bonds, and cash, held by an individual or institution, managed with the goal of achieving specific investment objectives.",
      "explanation_cn": "指个人或机构持有的金融资产组合，如股票、债券和现金，旨在实现特定的投资目标。",
      "example_en": "His investment portfolio includes technology stocks, real estate funds, and government bonds.",
      "example_cn": "他的投资组合包括科技股、房地产基金和政府债券。"
    },
    {
      "pos": "noun",
      "explanation_en": "A briefcase or folder, typically made of stiff material, used to carry documents, especially by professionals such as politicians, lawyers, or businesspeople.",
      "explanation_cn": "指一种由硬质材料制成的公文包或文件夹，用于携带文件，尤指政治家、律师或商人等专业人士使用。",
      "example_en": "The minister carried his portfolio into the meeting room and opened it to review the policy papers.",
      "example_cn": "部长带着公文包走进会议室，打开后审阅了政策文件。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "resume",
      "analysis": "“Resume”（简历）是个人教育背景、工作经历和技能的简明列表，侧重于事实性陈述和职业履历；而 “portfolio” 更强调通过实际作品或成果来展示能力，更具可视化和实证性，常用于创意行业。"
    },
    {
      "word_to_compare": "collection",
      "analysis": "“Collection”（收藏品）泛指任何被收集的物品，可能无特定目的或标准，如邮票收藏、艺术品收藏；而 “portfolio” 是经过精心挑选、有明确展示目的的集合，通常用于专业或评估场景，具有更强的意图性和结构性。"
    },
    {
      "word_to_compare": "asset",
      "analysis": "“Asset”（资产）是单个具有经济价值的资源，如现金、房产或股票；而 “portfolio” 是多个资产的组合，强调配置、平衡与整体策略。前者是组成单元，后者是系统性结构。"
    }
  ]
}