{
  "word": "poses",
  "pronunciation": "pohz",
  "concise_definition": "n. 姿势, 姿态; v. 提出, 假装, 造成 (威胁/问题)",
  "forms": {
    "singular": "pose",
    "third_person_singular": "poses",
    "past_tense": "posed",
    "past_participle": "posed",
    "present_participle": "posing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A particular way of holding one's body, especially for artistic representation, photography, or to convey a specific impression.",
      "explanation_cn": "指身体摆出的特定姿态，常用于艺术表现、摄影或传达某种特定印象。",
      "example_en": "The model struck a graceful pose for the fashion magazine.",
      "example_cn": "模特为时尚杂志摆出一个优雅的姿势。"
    },
    {
      "pos": "noun",
      "explanation_en": "A deliberate or artificial manner or behavior adopted to impress others or conceal one's true feelings.",
      "explanation_cn": "指为给他人留下印象或掩饰真实情感而刻意表现出的虚假态度或做作行为。",
      "example_en": "His confident demeanor was just a pose; inside, he was terrified.",
      "example_cn": "他自信的外表只是装出来的；实际上，他内心非常恐惧。"
    },
    {
      "pos": "verb",
      "explanation_en": "To present or put forward a question, problem, or challenge for consideration.",
      "explanation_cn": "指提出一个问题、难题或挑战以供考虑。",
      "example_en": "The new evidence poses a serious challenge to the prosecution's case.",
      "example_cn": "这些新证据对检方的案件构成了严重挑战。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pretend to be something one is not, especially to deceive or impress.",
      "explanation_cn": "指假装成自己并非真实的身份，以欺骗或给人留下深刻印象。",
      "example_en": "She posed as a wealthy socialite to gain access to the exclusive event.",
      "example_cn": "她假扮成一位富有的社交名媛，以获得参加这场专属活动的资格。"
    },
    {
      "pos": "verb",
      "explanation_en": "To create or cause a potential threat, danger, or problem.",
      "explanation_cn": "指造成潜在的威胁、危险或问题。",
      "example_en": "The rising sea levels pose a serious threat to coastal cities.",
      "example_cn": "海平面上升对沿海城市构成了严重威胁。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "posture",
      "analysis": "“Posture” (姿态/体态) 更侧重于身体的自然或习惯性姿势，常用于生理学或健康语境，如坐姿、站姿。而 “pose” 更强调有意识、刻意摆出的姿态，常用于艺术、摄影或社交表演中，带有表演性或象征性。"
    },
    {
      "word_to_compare": "question",
      "analysis": "“Question” (问题) 是中性、直接的提问或疑问，用于获取信息；而 “pose” 作为动词时，强调的是‘提出’一个复杂、棘手或具有挑战性的问题，常带有紧迫性或深远影响，语气更正式、更沉重。"
    },
    {
      "word_to_compare": "pretend",
      "analysis": "“Pretend” (假装) 是泛指虚构或掩饰真实情况，可指任何虚假行为；而 “pose as” 特指‘冒充’某种身份、角色或状态，具有明确的欺骗目的，常用于伪装成某人或某类人，语义更具体、更具有社会性。"
    }
  ]
}