{
  "word": "post",
  "pronunciation": "poast",
  "concise_definition": "n. 岗位, 邮政, 木柱; v. 发布, 邮寄, 守卫",
  "forms": {
    "third_person_singular": "posts",
    "past_tense": "posted",
    "past_participle": "posted",
    "present_participle": "posting",
    "plural": "posts"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A position or job, especially one involving responsibility or duty within an organization or system.",
      "explanation_cn": "指在组织或体系中承担职责或义务的职位或岗位。",
      "example_en": "She applied for a post as a senior editor at the newspaper.",
      "example_cn": "她申请了报社高级编辑的职位。"
    },
    {
      "pos": "noun",
      "explanation_en": "A physical pillar or stake, typically made of wood or metal, used to support structures, mark boundaries, or display information.",
      "explanation_cn": "指用于支撑结构、标记边界或展示信息的实体柱子或桩子，通常由木材或金属制成。",
      "example_en": "The fence was held up by wooden posts spaced every two meters.",
      "example_cn": "围栏由每隔两米一根的木桩支撑。"
    },
    {
      "pos": "noun",
      "explanation_en": "A message or piece of content published on a website, social media platform, or online forum.",
      "explanation_cn": "指在网站、社交媒体平台或在线论坛上发布的信息或内容。",
      "example_en": "He made a funny post about his cat that went viral overnight.",
      "example_cn": "他发了一条关于他猫的搞笑帖子，一夜之间爆红。"
    },
    {
      "pos": "noun",
      "explanation_en": "A station or location where someone is stationed to perform a duty, especially in military or service contexts.",
      "explanation_cn": "指为履行职责而被派驻的地点或站点，尤其用于军事或服务场景。",
      "example_en": "The soldiers were assigned to a remote post near the border.",
      "example_cn": "士兵们被派往边境附近的一个偏远哨所。"
    },
    {
      "pos": "noun",
      "explanation_en": "The system or service for sending letters and packages through a national or international network.",
      "explanation_cn": "指通过国家或国际网络寄送信件和包裹的系统或服务，即邮政。",
      "example_en": "I sent the letter by post, so it should arrive in three days.",
      "example_cn": "我通过邮政寄出了这封信，所以三天内应该能到达。"
    },
    {
      "pos": "verb",
      "explanation_en": "To publish or upload content, especially on the internet or social media.",
      "explanation_cn": "指在互联网或社交媒体上发布或上传内容。",
      "example_en": "She posts daily updates about her travels on Instagram.",
      "example_cn": "她在Instagram上每天发布旅行动态。"
    },
    {
      "pos": "verb",
      "explanation_en": "To send a letter or package through the postal system.",
      "explanation_cn": "指通过邮政系统寄送信件或包裹。",
      "example_en": "I posted the package yesterday, and it should reach you by Friday.",
      "example_cn": "我昨天寄出了这个包裹，应该周五能到你那里。"
    },
    {
      "pos": "verb",
      "explanation_en": "To assign someone to a specific location or duty, especially in a military or official capacity.",
      "explanation_cn": "指将某人指派到特定地点或职责岗位，尤指在军事或官方场合中。",
      "example_en": "He was posted to Berlin as the embassy's cultural attaché.",
      "example_cn": "他被派往柏林担任使馆文化参赞。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "job",
      "analysis": "“Job” (工作) 是一个更通用的词，泛指任何有报酬的劳动或职业，不强调具体地点或职责结构。而 “post” 更强调一个有明确职责、地点或层级的正式职位，常用于官方、军事或组织语境中。"
    },
    {
      "word_to_compare": "column",
      "analysis": "“Column” (专栏/柱子) 在物理意义上与 “post” 有重叠（如柱子），但 “column” 更常用于指报纸或杂志中的固定文章栏目，或建筑中细长的支撑结构。而 “post” 更强调功能性支撑或岗位，语义范围更广。"
    },
    {
      "word_to_compare": "publish",
      "analysis": "“Publish” (出版/发布) 是一个更正式、更广泛的术语，涵盖印刷品、书籍、学术论文等正式发布行为。而 “post” 通常特指在数字平台（如社交媒体、博客）上的非正式或即时发布，语体更口语化、现代。"
    },
    {
      "word_to_compare": "mail",
      "analysis": "“Mail” (邮件) 作为名词时与 “post” 在邮政语境中可互换（美式用 mail，英式用 post），但作为动词时，“mail” 仅指寄送信件，而 “post” 还可表示发布内容或派驻岗位，语义更丰富。"
    }
  ]
}