{
  "word": "posts",
  "pronunciation": "pohts",
  "concise_definition": "n. 帖子, 柱子, 职位; v. 发布, 张贴, 任命",
  "forms": {
    "singular": "post"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A message or piece of content published on a social media platform, website, or online forum, intended for public or group viewing.",
      "explanation_cn": "指在社交媒体平台、网站或在线论坛上发布的信息或内容，供公众或群体查看。",
      "example_en": "She shared a photo of her vacation on Instagram and received hundreds of likes on the post.",
      "example_cn": "她在 Instagram 上分享了一张度假照片，这条帖子收到了数百个赞。"
    },
    {
      "pos": "noun",
      "explanation_en": "A vertical support or pillar, typically made of wood, metal, or concrete, used to hold up structures or mark boundaries.",
      "explanation_cn": "指用于支撑结构或标记边界的垂直支柱，通常由木材、金属或混凝土制成。",
      "example_en": "The fence was secured to wooden posts driven deep into the ground.",
      "example_cn": "围栏被固定在深深打入地下的木柱上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A position or job, especially one with specific duties or responsibilities, often within an organization or government.",
      "explanation_cn": "指一个职位或工作，尤其指在组织或政府中具有特定职责的岗位。",
      "example_en": "He applied for a post as a senior editor at the newspaper.",
      "example_cn": "他申请了报社高级编辑的职位。"
    },
    {
      "pos": "verb",
      "explanation_en": "To publish or upload content, especially digital content, to a website, social media platform, or online system.",
      "explanation_cn": "指将内容（尤其是数字内容）发布或上传到网站、社交媒体平台或在线系统中。",
      "example_en": "He posts daily updates about his hiking adventures on his blog.",
      "example_cn": "他每天在他的博客上发布关于徒步旅行的更新。"
    },
    {
      "pos": "verb",
      "explanation_en": "To display or affix a notice, announcement, or advertisement in a public place.",
      "explanation_cn": "指在公共场所张贴通知、公告或广告。",
      "example_en": "The university posted the exam schedule on the bulletin board.",
      "example_cn": "大学在公告栏上张贴了考试时间表。"
    },
    {
      "pos": "verb",
      "explanation_en": "To assign someone to a particular position or location, especially in a military or official context.",
      "explanation_cn": "指将某人指派到特定职位或地点，尤其用于军事或官方语境。",
      "example_en": "She was posted to the embassy in Tokyo for two years.",
      "example_cn": "她被派往东京大使馆任职两年。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "article",
      "analysis": "“Article”（文章）通常指结构完整、篇幅较长、内容较正式的书面作品，常见于新闻、学术或杂志中；而 “post” 更偏向于非正式、即时性、常用于社交媒体的短内容，形式更自由。"
    },
    {
      "word_to_compare": "column",
      "analysis": "“Column”（专栏）是定期发表的、有固定作者和主题的系列文章，通常具有个人风格和深度分析；而 “post” 是单次发布的独立内容，不一定有规律性或深度，更注重时效性和互动性。"
    },
    {
      "word_to_compare": "notice",
      "analysis": "“Notice”（通知）是用于传达正式信息的简短公告，通常具有权威性或法律效力，如学校通知、政府公告；而 “post” 可以是任何类型的内容，包括个人分享、广告或娱乐信息，语境更广泛且非正式。"
    }
  ]
}