{
  "word": "pot",
  "pronunciation": "pahht",
  "concise_definition": "n. 罐, 锅, 花盆; v. 种植, 把…装入罐中",
  "forms": {
    "plural": "pots"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A round, open container, typically made of metal, ceramic, or earthenware, used for cooking food or storing substances.",
      "explanation_cn": "一种圆形、开口的容器，通常由金属、陶瓷或陶土制成，用于烹饪食物或盛放物品。",
      "example_en": "She stirred the soup vigorously in the large pot on the stove.",
      "example_cn": "她用炉子上大锅里的勺子用力搅拌着汤。"
    },
    {
      "pos": "noun",
      "explanation_en": "A container, usually with drainage holes, used for growing plants indoors or in gardens.",
      "explanation_cn": "一种通常带排水孔的容器，用于在室内或花园中种植植物。",
      "example_en": "The windowsill was lined with pots of blooming tulips.",
      "example_cn": "窗台上摆满了盛开的郁金香花盆。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slang term for marijuana or a cannabis cigarette.",
      "explanation_cn": "俚语，指大麻或大麻香烟。",
      "example_en": "He was arrested for possession of pot during a routine traffic stop.",
      "example_cn": "他在一次例行交通检查中因持有大麻而被逮捕。"
    },
    {
      "pos": "verb",
      "explanation_en": "To plant or grow something, especially a plant, in a pot.",
      "explanation_cn": "将某物（尤指植物）种植在花盆中。",
      "example_en": "They potted several succulents to decorate their apartment.",
      "example_cn": "他们种了几盆多肉植物来装饰公寓。"
    },
    {
      "pos": "verb",
      "explanation_en": "To place something, especially food, into a pot for cooking or storage.",
      "explanation_cn": "将某物（尤指食物）放入锅中进行烹饪或储存。",
      "example_en": "The chef potted the stew and let it simmer for hours.",
      "example_cn": "厨师把炖菜放进锅里，让它慢炖了数小时。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pan",
      "analysis": "“Pan”（平底锅）通常指浅而宽、底部平坦的烹饪容器，适合煎、炒等烹饪方式；而 “pot” 更深、更圆，适合煮、炖、蒸等需要较多液体的烹饪方式。两者在形状和用途上有明显区别。"
    },
    {
      "word_to_compare": "vase",
      "analysis": "“Vase”（花瓶）主要用于插花装饰，通常无排水孔、不用于种植植物，且材质更注重美观；而 “pot” 是为植物生长设计的，常有排水孔，功能性强于装饰性。"
    },
    {
      "word_to_compare": "jar",
      "analysis": "“Jar”（广口瓶）通常为玻璃材质，有密封盖，主要用于储存干货、果酱或液体；而 “pot” 多为开口容器，用于烹饪或种植，强调使用过程中的可接触性，而非长期密封保存。"
    }
  ]
}