{
  "word": "potential",
  "pronunciation": "poh·ten·shuhl",
  "concise_definition": "n. 潜力, 潜能; adj. 潜在的, 可能的",
  "forms": {
    "adverb": "potentially",
    "noun_plural": "potentials"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The inherent capacity or ability to develop into something future or greater, often unactualized but capable of being realized under the right conditions.",
      "explanation_cn": "指内在的、尚未实现但具备在适当条件下发展为更高级或更大成就的能力或可能性。",
      "example_en": "The young athlete shows great potential for becoming an Olympic champion.",
      "example_cn": "这位年轻运动员展现出成为奥运冠军的巨大潜力。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that has the capacity to become something significant, often used in contexts of talent, opportunity, or future value.",
      "explanation_cn": "指具有成为重要人物或事物能力的人或物，常用于描述天赋、机会或未来价值。",
      "example_en": "She is considered a potential candidate for the CEO position.",
      "example_cn": "她被认为是担任首席执行官的潜在人选。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Existing in possibility but not yet actualized; capable of becoming real or active under certain conditions.",
      "explanation_cn": "指尚未实现但有可能在特定条件下成为现实或活跃的状态。",
      "example_en": "There is potential for conflict if the negotiations fail.",
      "example_cn": "如果谈判失败，可能会引发冲突。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or indicating the maximum possible output, effect, or capacity, especially in physical or technical contexts.",
      "explanation_cn": "指与最大可能产出、效果或容量相关，尤其用于物理或技术语境中。",
      "example_en": "The potential energy stored in the battery can power the device for hours.",
      "example_cn": "电池中储存的势能足以让设备运行数小时。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ability",
      "analysis": "“Ability” (能力) 指已经具备的、可明确衡量的技能或才干，是当前状态的体现；而 “potential” 强调尚未实现但未来可能发展的能力，具有前瞻性与未完成性。"
    },
    {
      "word_to_compare": "capacity",
      "analysis": "“Capacity” (容量/能力) 通常指物理或系统层面的最大承载量或功能范围，如房间容量、处理能力，偏重客观限制；而 “potential” 更强调主观或内在的发展可能性，常用于人才、创新或成长语境。"
    },
    {
      "word_to_compare": "possibility",
      "analysis": "“Possibility” (可能性) 是一个更宽泛的词，泛指任何可能发生的事情，不强调内在发展动力；而 “potential” 暗示某种内在资源或特质，使其发展成为现实具有内在依据，比 “possibility” 更具实质性和可实现性。"
    }
  ]
}