{
  "word": "pounded",
  "pronunciation": "pow·nd",
  "concise_definition": "v. 猛击, 砸, 捶打 (pound 的过去式和过去分词)",
  "forms": {
    "base_form": "pound",
    "third_person_singular": "pounds",
    "present_participle": "pounding",
    "past_tense": "pounded",
    "past_participle": "pounded"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To strike something repeatedly and forcefully, often with a heavy object or fist, to crush, flatten, or break it.",
      "explanation_cn": "指用重物或拳头反复猛烈击打某物，以将其压碎、压平或击破。",
      "example_en": "The carpenter pounded the nail into the wood until it was flush with the surface.",
      "example_cn": "木匠把钉子反复敲进木头里，直到它与表面齐平。"
    },
    {
      "pos": "verb",
      "explanation_en": "To beat or hammer something into a particular shape or form, often through repeated forceful action.",
      "explanation_cn": "指通过反复的强力动作将某物锤打成特定形状或形态。",
      "example_en": "She pounded the garlic into a paste with a mortar and pestle.",
      "example_cn": "她用研钵和研杵把大蒜捣成泥状。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or beat with great force and rhythm, often describing the sound or impact of footsteps, heartbeats, or waves.",
      "explanation_cn": "指以巨大的力量和节奏移动或敲打，常用于描述脚步声、心跳声或海浪声。",
      "example_en": "His heart pounded in his chest as he ran up the stairs.",
      "example_cn": "他跑上楼梯时，心脏在胸腔里猛烈跳动。"
    },
    {
      "pos": "verb",
      "explanation_en": "To subject someone or something to a continuous and overwhelming amount of something, such as criticism, questions, or advertisements.",
      "explanation_cn": "指对某人或某物施加持续而压倒性的某种事物，如批评、提问或广告。",
      "example_en": "The politician was pounded with questions from the press after the scandal broke.",
      "example_cn": "丑闻曝光后，这位政客被媒体接连不断地追问。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hit",
      "analysis": "“Hit” (击打) 是一个更通用的词，指一次性的打击动作，力度和次数不固定。而 “pounded” 强调的是重复、持续且有力的击打，带有更强的暴力感和节奏感。"
    },
    {
      "word_to_compare": "beat",
      "analysis": "“Beat” (敲打) 与 “pound” 在某些语境下可互换，但 “beat” 更广泛，可用于节奏性敲击（如打鼓）、身体殴打或抽象意义（如击败对手）。“Pounded” 更强调物理上的猛烈冲击和破坏性，常伴随沉重感和噪音。"
    },
    {
      "word_to_compare": "crush",
      "analysis": "“Crush” (压碎) 强调结果——使物体变形或破碎，不一定强调动作过程。而 “pounded” 更侧重于动作本身：通过反复击打来达到压碎的效果。例如，你可以用重物 crush 一个罐子，但只有用锤子反复敲打时才用 pounded。"
    },
    {
      "word_to_compare": "throb",
      "analysis": "“Throb” (搏动) 描述的是有节奏的脉动，如心跳或疼痛的跳动，是被动的生理现象。而 “pounded” 描述的是主动施加的、有力量的击打动作，虽然两者都可形容心跳剧烈，但 “pounded” 更具动作性和外在性。"
    }
  ]
}