{
  "word": "powder",
  "pronunciation": "pow·der",
  "concise_definition": "n. 粉末, 粉状物; v. 撒粉, 涂粉",
  "forms": {
    "plural": "powders"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A dry, fine, loose substance composed of very small particles, often used in cooking, cosmetics, or industrial applications.",
      "explanation_cn": "由极细小颗粒组成的干燥、松散的物质，常用于烹饪、化妆品或工业用途。",
      "example_en": "She added a pinch of cinnamon powder to the cake batter.",
      "example_cn": "她往蛋糕糊里加了一小撮肉桂粉。"
    },
    {
      "pos": "noun",
      "explanation_en": "A cosmetic substance applied to the skin, especially the face, to create a smooth or matte finish.",
      "explanation_cn": "一种用于皮肤（尤其是面部）的化妆品，用以打造平滑或哑光效果。",
      "example_en": "She dusted her face with translucent powder to reduce shine.",
      "example_cn": "她用透明散粉轻拍面部，以减少油光。"
    },
    {
      "pos": "noun",
      "explanation_en": "A chemical substance used to produce an explosion, especially gunpowder or other explosive mixtures.",
      "explanation_cn": "用于产生爆炸的化学物质，尤指火药或其他爆炸性混合物。",
      "example_en": "The old pistol still contained traces of black powder.",
      "example_cn": "这把旧手枪里仍残留着黑火药的痕迹。"
    },
    {
      "pos": "verb",
      "explanation_en": "To apply a fine substance, especially a cosmetic powder, lightly over a surface.",
      "explanation_cn": "轻柔地在表面涂抹细粉，尤指化妆品粉末。",
      "example_en": "The makeup artist powdered the actor's nose to eliminate shine under the lights.",
      "example_cn": "化妆师为演员的鼻子轻扑了一层粉，以消除灯光下的油光。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reduce something to a fine powder or to break it into small particles.",
      "explanation_cn": "将某物碾碎或研磨成细粉。",
      "example_en": "He powdered the aspirin tablets to make them easier to swallow.",
      "example_cn": "他把阿司匹林药片碾成粉末，以便更容易吞服。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "dust",
      "analysis": "“Dust”（灰尘）通常指自然形成或由磨损产生的微小颗粒，常带有负面含义（如脏、不洁），而 “powder” 更强调人为制造、用途明确的细粉，如化妆品或火药，语义更中性或专业。"
    },
    {
      "word_to_compare": "flour",
      "analysis": "“Flour”（面粉）是特指由谷物研磨而成的食用粉末，属于 “powder” 的一种子类，但具有明确的食品属性。而 “powder” 是更广泛的上位词，涵盖非食用、工业或化学用途的粉末。"
    },
    {
      "word_to_compare": "sprinkle",
      "analysis": "“Sprinkle”（撒、洒）是动作动词，描述将细小颗粒（如盐、糖、粉末）均匀散布的动作，常与 “powder” 搭配使用（如 sprinkle powder），但本身不指代物质，而 “powder” 是名词或表示研磨动作的动词。"
    }
  ]
}