{
  "word": "powers",
  "pronunciation": "pow·erz",
  "concise_definition": "n. 权力, 能力, 幂, (复数) 政府机构",
  "forms": {
    "singular": "power"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The ability or right to control people, events, or resources, especially in a political, social, or organizational context.",
      "explanation_cn": "指在政治、社会或组织环境中控制他人、事件或资源的能力或权利。",
      "example_en": "The president holds considerable powers to influence legislation.",
      "example_cn": "总统拥有影响立法的相当大权力。"
    },
    {
      "pos": "noun",
      "explanation_en": "The capacity or ability to do something, often referring to physical, mental, or mechanical strength or function.",
      "explanation_cn": "指做某事的能力，常指身体、心理或机械方面的力量或功能。",
      "example_en": "The new engine delivers more power and better fuel efficiency.",
      "example_cn": "这款新发动机提供更强的动力和更好的燃油效率。"
    },
    {
      "pos": "noun",
      "explanation_en": "In mathematics, the result of multiplying a number by itself a certain number of times (e.g., 2³ = 8); also refers to the exponent itself.",
      "explanation_cn": "在数学中，指一个数自乘若干次的结果（如 2³ = 8）；也可指指数本身。",
      "example_en": "In algebra, understanding powers is essential for solving exponential equations.",
      "example_cn": "在代数中，理解幂是求解指数方程的关键。"
    },
    {
      "pos": "noun",
      "explanation_en": "Plural form used to refer to the branches or institutions of government, especially in constitutional contexts (e.g., executive, legislative, judicial powers).",
      "explanation_cn": "复数形式，用于指政府的各个分支或机构，尤其在宪政语境中（如行政、立法、司法权力）。",
      "example_en": "The separation of powers is a fundamental principle in democratic systems.",
      "example_cn": "权力分立是民主制度的基本原则。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "authority",
      "analysis": "“Authority”（权威）强调被合法授予或公认的支配权，通常带有合法性、正当性和层级性，如政府官员的权威。而 “power” 更广泛，可指实际影响力，无论是否合法，如黑帮头目的权力。"
    },
    {
      "word_to_compare": "ability",
      "analysis": "“Ability”（能力）侧重于个人或实体完成某事的天赋或技能，是内在的、非强制性的。而 “power” 可包含外部施加的控制力，如国家对公民的权力，不一定依赖于个人能力。"
    },
    {
      "word_to_compare": "strength",
      "analysis": "“Strength”（力量）多用于物理或情感层面的强度，如肌肉力量或意志力，强调耐力或韧性。而 “power” 更强调能量输出、控制力或数学运算中的指数关系，适用范围更广，包括抽象和技术语境。"
    }
  ]
}