{
  "word": "powered",
  "pronunciation": "pow·uhrd",
  "concise_definition": "adj. 由...驱动的, 有动力的, 有能量供应的",
  "forms": {
    "base_form": "power",
    "past_tense": "powered",
    "past_participle": "powered",
    "present_participle": "powering"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Furnished with or operated by a source of energy, such as electricity, fuel, or mechanical force, enabling functionality or motion.",
      "explanation_cn": "指由某种能源（如电力、燃料或机械力）提供动力，从而具备运行或运动能力的。",
      "example_en": "The powered wheelchair allows users to move independently.",
      "example_cn": "这款电动轮椅使使用者能够独立行动。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by strong energy, enthusiasm, or momentum, often used metaphorically to describe something dynamic or highly effective.",
      "explanation_cn": "比喻性地形容充满能量、热情或强劲动力的事物，常用于描述具有强烈推动力或高效能的状态。",
      "example_en": "Her powered performance on stage left the audience in awe.",
      "example_cn": "她在舞台上的精彩演出令观众叹为观止。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used in compound terms to describe devices or systems that rely on an external or internal power source to function, often contrasting with manual or non-electric alternatives.",
      "explanation_cn": "用于复合词中，描述依赖外部或内部电源才能运作的设备或系统，常与手动或非电动版本形成对比。",
      "example_en": "Powered tools like drills and saws save time and reduce physical effort.",
      "example_cn": "电钻、电锯等电动工具节省时间并减少体力消耗。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "electric",
      "analysis": "“Electric”（电动的）特指由电能驱动，强调能源类型；而 “powered” 是更广义的术语，可涵盖电力、燃油、人力、风力等多种动力来源。例如，一个电动牙刷是 electric，但一个汽油动力割草机是 powered，却不是 electric。"
    },
    {
      "word_to_compare": "driven",
      "analysis": "“Driven”（被驱动的）常用于描述由某种力量、动机或机制推动的状态，既可以是物理的（如发动机驱动），也可以是抽象的（如野心驱动）。而 “powered” 更侧重于物理能量的供给，语义更具体、更技术化。"
    },
    {
      "word_to_compare": "energized",
      "analysis": "“Energized”（充满活力的）多用于描述人或生物体因获得能量而精神振奋，具有强烈的情感或心理色彩；而 “powered” 用于物体或系统，强调功能性动力，不涉及情绪。例如，人可以被咖啡 energized，但机器是 powered。"
    }
  ]
}