{
  "word": "practice",
  "pronunciation": "prak·tis",
  "concise_definition": "n. 实践, 习俗, 练习; v. 练习, 实行, 从事",
  "forms": {
    "third_person_singular": "practices",
    "past_tense": "practiced",
    "past_participle": "practiced",
    "present_participle": "practicing",
    "plural": "practices"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The actual application or use of an idea, belief, or method, as opposed to theory or abstract principles; repeated performance or exercise to acquire or maintain proficiency.",
      "explanation_cn": "指对某种思想、信念或方法的实际应用，而非理论或抽象原则；也指为获得或保持熟练程度而进行的反复练习或操练。",
      "example_en": "Good communication is a key practice in successful teamwork.",
      "example_cn": "良好的沟通是成功团队合作的关键实践。"
    },
    {
      "pos": "noun",
      "explanation_en": "A customary way of operating or behaving, especially one that is widely accepted within a profession, culture, or organization.",
      "explanation_cn": "指在某一职业、文化或组织中被广泛接受的常规做法或行为方式。",
      "example_en": "It is common practice in this company to review performance annually.",
      "example_cn": "这家公司通常每年进行一次绩效评估，这是通行的做法。"
    },
    {
      "pos": "verb",
      "explanation_en": "To perform an activity repeatedly in order to improve skill or maintain competence, especially in a physical or mental task.",
      "explanation_cn": "指为提高技能或保持能力而反复进行某项活动，尤其针对身体或心理上的任务。",
      "example_en": "She practices the piano every day for an hour.",
      "example_cn": "她每天练习一小时钢琴。"
    },
    {
      "pos": "verb",
      "explanation_en": "To engage in a profession or occupation regularly, especially one requiring specialized training or licensing.",
      "explanation_cn": "指定期从事某一职业，尤其是需要专门训练或执照的职业。",
      "example_en": "He practices law in New York City.",
      "example_cn": "他在纽约市从事律师职业。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "exercise",
      "analysis": "“Exercise” (锻炼/操练) 通常指为增强体能、技能或智力而进行的有目的的活动，强调身体或认知上的训练，如体育锻炼或脑力练习。而 “practice” 更侧重于通过重复来掌握某种技能或行为规范，常与专业性、习惯性或长期目标相关。"
    },
    {
      "word_to_compare": "habit",
      "analysis": "“Habit” (习惯) 指一种无意识或自动化的重复行为，通常是被动形成的，不一定有明确目标。而 “practice” 是有意识、有目的的重复行为，旨在提升能力或达成标准，具有主动性和改进导向。"
    },
    {
      "word_to_compare": "application",
      "analysis": "“Application” (应用) 强调将理论、知识或方法用于实际情境，是一个一次性或单次行为。而 “practice” 强调持续性、反复性和经验积累，是将理论转化为熟练能力的过程。例如：你‘应用’一个公式解题，但你‘练习’解题技巧以提高速度。"
    }
  ]
}