{
  "word": "praise",
  "pronunciation": "prāz",
  "concise_definition": "n. 赞扬, 称赞; v. 赞扬, 表扬",
  "forms": {
    "third_person_singular": "praises",
    "past_tense": "praised",
    "past_participle": "praised",
    "present_participle": "praising",
    "plural": "praises"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An expression of approval, admiration, or gratitude toward someone or something, often publicly or formally given to recognize achievement or virtue.",
      "explanation_cn": "对某人或某事表达的认可、钦佩或感激，通常公开或正式地给予，以表彰其成就或美德。",
      "example_en": "The teacher gave high praise to the student for her creative essay.",
      "example_cn": "老师因学生富有创意的作文而给予了高度赞扬。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of expressing admiration, especially in religious or poetic contexts, such as songs or words honoring a deity or ideal.",
      "explanation_cn": "表达钦佩的行为，尤其在宗教或诗歌语境中，如赞美神明或理想的事物。",
      "example_en": "The choir sang praises to the Lord during the morning service.",
      "example_cn": "唱诗班在早祷中唱颂赞美诗来颂扬主。"
    },
    {
      "pos": "verb",
      "explanation_en": "To express warm approval or admiration for someone’s actions, qualities, or achievements, often to encourage or affirm positive behavior.",
      "explanation_cn": "对某人的行为、品质或成就表达热烈的认可或钦佩，通常旨在鼓励或肯定积极的行为。",
      "example_en": "Parents should praise their children for honesty rather than just good grades.",
      "example_cn": "父母应当表扬孩子的诚实，而不仅仅是好成绩。"
    },
    {
      "pos": "verb",
      "explanation_en": "To glorify or honor, especially in a religious context, through words, song, or ritual.",
      "explanation_cn": "通过言语、歌曲或仪式来颂扬或尊崇，尤其用于宗教语境中。",
      "example_en": "The congregation praised God with hymns and prayers.",
      "example_cn": "会众以圣诗和祷告颂扬上帝。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "compliment",
      "analysis": "“Compliment”（恭维）通常指礼貌性或社交性的赞美，可能较表面、短暂，有时带有社交目的，不一定反映深层认可。而 “praise” 更具真诚性、深度和情感分量，常用于表彰实质性成就或道德品质。"
    },
    {
      "word_to_compare": "applause",
      "analysis": "“Applause”（鼓掌）是通过肢体动作（如拍手）表达的即时认可，多用于公开场合，是外在的、非语言的反应。而 “praise” 是语言性的、可包含详细理由的评价，具有更持久的影响力。"
    },
    {
      "word_to_compare": "commend",
      "analysis": "“Commend”（推荐/称赞）比 “praise” 更正式、更常用于权威语境（如上级对下级、官方文件），强调推荐或正式认可，语气较克制；而 “praise” 更情感化、口语化，表达更直接的钦佩。"
    }
  ]
}