{
  "word": "preaching",
  "pronunciation": "pree·ching",
  "concise_definition": "n. 布道, 说教, 宣讲; v. 布道, 说教",
  "forms": {
    "third_person_singular": "preaches",
    "past_tense": "preached",
    "past_participle": "preached",
    "present_participle": "preaching"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of delivering a religious sermon or moral message, typically in a public or formal setting, with the aim of inspiring faith, repentance, or ethical behavior.",
      "explanation_cn": "指在公共或正式场合发表宗教布道或道德训诫，旨在激发信仰、悔改或道德行为。",
      "example_en": "His preaching on forgiveness moved the entire congregation to tears.",
      "example_cn": "他关于宽恕的布道让整个会众感动落泪。"
    },
    {
      "pos": "noun",
      "explanation_en": "A long, moralizing lecture or repeated advice, often perceived as annoying or self-righteous, especially when delivered in an unsolicited or overly earnest manner.",
      "explanation_cn": "指冗长的道德说教或反复的劝诫，常带有令人厌烦或自以为是的意味，尤其当其未经请求或过于认真地强加于人时。",
      "example_en": "I don't need your preaching about healthy eating—I already know the rules.",
      "example_cn": "我不需要你对我讲健康饮食的大道理——我早就知道这些规则了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To deliver a sermon or religious message, especially as part of a formal worship service.",
      "explanation_cn": "指在正式礼拜仪式中发表布道或宗教信息。",
      "example_en": "The pastor preached every Sunday at 10 a.m.",
      "example_cn": "牧师每周日上午十点都布道。"
    },
    {
      "pos": "verb",
      "explanation_en": "To advocate or promote a belief, principle, or behavior forcefully and persistently, often in a way that seems preachy or didactic.",
      "explanation_cn": "指强烈而持续地倡导某种信念、原则或行为，方式常显得说教或训导性过强。",
      "example_en": "She's always preaching about reducing plastic use, even at dinner parties.",
      "example_cn": "她总在聚餐时喋喋不休地劝人减少使用塑料。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sermon",
      "analysis": "“Sermon” (布道) 是一个名词，指具体的布道内容或一篇讲道文本，是“preaching”的产物。而 “preaching” 强调的是布道这一行为或过程。例如：He gave a powerful sermon（他做了一场有力的布道） vs. His preaching inspires many（他的布道激励了很多人）。"
    },
    {
      "word_to_compare": "lecturing",
      "analysis": "“Lecturing”（讲课/训诫）更广泛地指任何形式的正式讲解或说教，不一定有道德或宗教目的，可以是学术性的。而 “preaching” 常带有强烈的道德、宗教或劝诫色彩，且常隐含批评或指责的语气，容易被听者视为干涉或高高在上。"
    },
    {
      "word_to_compare": "advocating",
      "analysis": "“Advocating”（倡导）是中性词，指为某种观点、政策或事业公开支持或辩护，通常基于理性论证和证据，不必然带有道德优越感。而 “preaching” 常带有情感强烈、重复、甚至强迫性的意味，容易被理解为不尊重他人自主性。"
    }
  ]
}