{
  "word": "predatory",
  "pronunciation": "pred·uh·tuh-ree",
  "concise_definition": "adj. 抢劫的, 捕食的, 有掠夺性的",
  "forms": {
    "comparative": "more predatory",
    "superlative": "most predatory"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characteristic of a predator; involving the exploitation, harm, or destruction of others for personal gain, often in a ruthless or aggressive manner.",
      "explanation_cn": "与捕食者相关或具有捕食者特征的；指以无情或侵略性的方式剥削、伤害或摧毁他人以谋取私利。",
      "example_en": "The predatory lending practices of the bank led to widespread financial ruin among low-income families.",
      "example_cn": "这家银行的掠夺性贷款行为导致许多低收入家庭陷入严重的财务困境。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing animals that hunt, kill, and feed on other animals as part of their natural behavior.",
      "explanation_cn": "描述那些以捕猎、杀死并食用其他动物为自然行为的动物。",
      "example_en": "Sharks are apex predatory fish that play a crucial role in maintaining oceanic ecosystems.",
      "example_cn": "鲨鱼是顶级捕食性鱼类，在维持海洋生态系统中起着至关重要的作用。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by a strong, often unethical, desire to take advantage of others, especially in social, economic, or sexual contexts.",
      "explanation_cn": "指具有强烈（常为不道德的）利用他人倾向的，尤其在社会、经济或性关系中。",
      "example_en": "His predatory behavior toward interns raised serious concerns about workplace ethics.",
      "example_cn": "他对实习生的掠夺性行为引发了关于职场道德的严重担忧。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "aggressive",
      "analysis": "“Aggressive”（好斗的/具攻击性的）泛指表现出敌意、竞争性或主动进攻的行为，不一定涉及剥削或利用他人。而 “predatory” 更强调以牺牲他人为代价获取利益，带有更强的道德谴责和生存性掠夺色彩。"
    },
    {
      "word_to_compare": "exploitative",
      "analysis": "“Exploitative”（剥削性的）与 “predatory” 非常接近，都指利用他人弱点谋利。但 “exploitative” 更侧重于系统性或结构性的不平等利用（如劳工剥削），而 “predatory” 常暗示更直接、主动、甚至暴力的攻击性行为，如掠夺性贷款或性掠夺。"
    },
    {
      "word_to_compare": "carnivorous",
      "analysis": "“Carnivorous”（食肉的）是生物学上的中性术语，仅指以肉类为食的动物，不包含道德判断。而 “predatory” 不仅描述食肉行为，还常引申为具有攻击性、掠夺性的人类行为，具有强烈的情感和伦理内涵。"
    }
  ]
}