{
  "word": "prefect",
  "pronunciation": "pree·fekt",
  "concise_definition": "n. 督学, 校长助理; adj. 完美的, 无瑕的",
  "forms": {
    "plural": "prefects",
    "comparative": "more prefect",
    "superlative": "most prefect"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A student in a position of authority in a school, especially in British private schools, who is responsible for maintaining discipline and assisting staff in managing other students.",
      "explanation_cn": "指在英国私立学校中担任权威职务的学生，负责维持纪律并协助教职员工管理其他学生，通常称为‘级长’或‘学生督察’。",
      "example_en": "As a prefect, he was responsible for overseeing the behavior of younger students during lunchtime.",
      "example_cn": "作为级长，他负责监督低年级学生在午餐时间的行为。"
    },
    {
      "pos": "noun",
      "explanation_en": "An official in ancient Rome who held administrative or judicial authority, often appointed by the emperor to govern a region or city.",
      "explanation_cn": "指古罗马时期由皇帝任命、负责管理某一地区或城市的行政或司法官员。",
      "example_en": "The Roman prefect of Judea had the power to impose taxes and maintain order.",
      "example_cn": "犹太地的罗马总督有权征税并维持秩序。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Perfect or flawless in form, function, or execution; without any defect or imperfection.",
      "explanation_cn": "在形式、功能或执行上完美无瑕，没有任何缺陷或瑕疵。",
      "example_en": "She delivered a prefect performance that left the audience in awe.",
      "example_cn": "她献上了一场完美无瑕的演出，令观众叹为观止。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "principal",
      "analysis": "“Principal”（校长/主要的）通常指学校的最高行政负责人，是正式的教职员工；而 “prefect” 是学生担任的辅助管理角色，权力和职责范围较小，且非职业身份。两者虽都涉及管理，但层级和身份本质不同。"
    },
    {
      "word_to_compare": "perfect",
      "analysis": "“Perfect”（完美的）是更通用的形容词，用于描述任何事物达到理想状态；而 “prefect” 作为形容词时是 “perfect” 的古旧或文学化变体，现代英语中极少使用，仅在特定语境（如诗歌或复古风格）中出现，二者语义相近但语用频率和时代感截然不同。"
    },
    {
      "word_to_compare": "governor",
      "analysis": "“Governor”（总督/州长）是现代政治体系中的正式官员，拥有法定行政权力；而 “prefect” 在古罗马或现代学校语境中，权力来源更依赖传统或任命，而非民主选举，且范围更局部（如学校或小区域），权威性相对有限。"
    }
  ]
}