{
  "word": "pressuring",
  "pronunciation": "pres·chuh·ring",
  "concise_definition": "v. 施压, 逼迫, 催促",
  "forms": {
    "base_form": "pressure",
    "third_person_singular": "pressures",
    "past_tense": "pressured",
    "past_participle": "pressured",
    "present_participle": "pressuring"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To exert persistent influence or force on someone to make them do something, often against their will or better judgment, typically through emotional, social, or psychological means.",
      "explanation_cn": "通过持续的情感、社会或心理手段对某人施加影响或压力，迫使其做某事，通常违背其意愿或理性判断。",
      "example_en": "She felt pressured by her parents to major in medicine, even though she wanted to study art.",
      "example_cn": "尽管她想学艺术，却仍感到父母逼迫她选择医学专业。"
    },
    {
      "pos": "verb",
      "explanation_en": "To create a situation in which someone is compelled to act quickly or make a decision under time constraints or external demands.",
      "explanation_cn": "制造一种情境，使某人因时间紧迫或外部要求而被迫迅速行动或做出决定。",
      "example_en": "The manager was pressuring the team to finish the report by Friday.",
      "example_cn": "经理正催促团队在周五前完成报告。"
    },
    {
      "pos": "verb",
      "explanation_en": "To apply sustained social or institutional pressure to influence behavior, policy, or outcomes, often in a public or political context.",
      "explanation_cn": "在公共或政治语境中，通过持续的社会或制度性压力来影响行为、政策或结果。",
      "example_en": "Activists are pressuring the government to pass stricter environmental regulations.",
      "example_cn": "活动人士正在施压政府通过更严格的环保法规。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "coercing",
      "analysis": "“Coercing” (胁迫) 指使用威胁、暴力或法律强制力迫使他人服从，具有更强的非法性或暴力性。而 “pressuring” 通常不涉及直接威胁，更多依赖心理或社会压力，如内疚、从众或期望。"
    },
    {
      "word_to_compare": "urging",
      "analysis": "“Urging” (敦促) 是一种温和、积极的劝说，强调鼓励和支持，通常带有善意或建设性目的。而 “pressuring” 带有强迫性，常引发抵触或不适感，语气更强势甚至令人窒息。"
    },
    {
      "word_to_compare": "compelling",
      "analysis": "“Compelling” (迫使) 指因逻辑、证据或强大理由而使人不得不接受或行动，强调合理性与必然性。而 “pressuring” 更侧重于外部施加的非理性压力，可能缺乏正当性，甚至带有操纵性质。"
    }
  ]
}