{
  "word": "preserves",
  "pronunciation": "pruh·zervz",
  "concise_definition": "n. 果酱, 保存物; v. 保存, 保护, 维持",
  "forms": {
    "singular": "preserve",
    "third_person_singular": "preserves",
    "past_tense": "preserved",
    "past_participle": "preserved",
    "present_participle": "preserving"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Fruit that has been cooked with sugar and stored in jars or containers to prevent spoilage, often consumed as a spread on bread or in desserts.",
      "explanation_cn": "指将水果与糖一起烹煮后装入罐中保存，以防止变质，常作为涂抹在面包上的果酱或甜点配料。",
      "example_en": "She made homemade strawberry preserves last summer and shared them with her neighbors.",
      "example_cn": "她去年夏天自制了草莓果酱，并与邻居们分享。"
    },
    {
      "pos": "noun",
      "explanation_en": "A legally or officially protected area, such as a wildlife preserve, where natural resources or species are safeguarded from human interference.",
      "explanation_cn": "指通过法律或官方手段保护的区域，如野生动物保护区，以防止人类活动对自然资源或物种造成干扰。",
      "example_en": "The national preserve is home to endangered eagles and ancient pine forests.",
      "example_cn": "这个国家保护区是濒危鹰类和古老松林的栖息地。"
    },
    {
      "pos": "verb",
      "explanation_en": "To maintain something in its original state or prevent it from deteriorating, especially over time or under adverse conditions.",
      "explanation_cn": "指使某物保持其原有状态，防止其因时间推移或不利条件而退化或损坏。",
      "example_en": "The museum works to preserve historical artifacts for future generations.",
      "example_cn": "博物馆致力于保护历史文物，以传给后代。"
    },
    {
      "pos": "verb",
      "explanation_en": "To treat food with sugar, salt, or other methods to extend its shelf life and prevent decay.",
      "explanation_cn": "指通过加糖、加盐或其他方法处理食物，以延长其保质期并防止腐烂。",
      "example_en": "They preserve peaches by canning them in syrup every autumn.",
      "example_cn": "他们每年秋天都通过糖浆罐装的方式来保存桃子。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "jams",
      "analysis": "“Jams”（果酱）与 “preserves”（果酱/保存物）常被混用，但严格来说，“jams” 通常指果肉被捣碎或打成泥状的果制品，而 “preserves” 更强调保留了完整的水果块或整颗水果。因此，“preserves” 更突出“保留原形”的特点。"
    },
    {
      "word_to_compare": "conserves",
      "analysis": "“Conserves”（果酱/保存物）是英式英语中与 “preserves” 非常接近的词，常指含整颗水果或大块水果的糖渍制品。但在美式英语中，“conserves” 有时指多种水果混合制成的果酱，而 “preserves” 更偏向单一水果。两者在语义上高度重叠，但地域用法不同。"
    },
    {
      "word_to_compare": "protect",
      "analysis": "“Protect”（保护）是一个更广泛、更抽象的动词，指采取措施防止伤害、损害或损失，可用于人、物、环境、权利等。而 “preserve” 更强调维持原状、防止退化或消失，尤其适用于自然环境、文化遗产或食物的长期保存，带有更强的“保存完整性”的语义色彩。"
    },
    {
      "word_to_compare": "maintain",
      "analysis": "“Maintain”（维持）侧重于持续保持某种状态、水平或功能，常用于系统、设备、关系或标准，如维持秩序、维持健康。而 “preserve” 更强调对抗时间、破坏或变化的力量，以保留原始形态或本质，常用于自然、历史或文化语境，语义上更具“抢救性”和“历史性”。"
    }
  ]
}