{
  "word": "press",
  "pronunciation": "pres",
  "concise_definition": "v. 压, 按, 推; n. 压力, 压迫, 新闻界",
  "forms": {
    "third_person_singular": "presses",
    "past_tense": "pressed",
    "past_participle": "pressed",
    "present_participle": "pressing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To apply continuous force or pressure on something, typically to flatten, shape, or move it.",
      "explanation_cn": "指对某物施加持续的力或压力，通常为了将其压平、塑形或移动。",
      "example_en": "She pressed the button to call the elevator.",
      "example_cn": "她按下了按钮召唤电梯。"
    },
    {
      "pos": "verb",
      "explanation_en": "To urge or strongly encourage someone to do something, often persistently or with authority.",
      "explanation_cn": "指持续或权威性地敦促某人做某事，带有施加压力的意味。",
      "example_en": "The manager pressed the team to meet the deadline.",
      "example_cn": "经理敦促团队按时完成任务。"
    },
    {
      "pos": "verb",
      "explanation_en": "To print and distribute newspapers, magazines, or other publications, especially on a large scale.",
      "explanation_cn": "指大规模印刷和发行报纸、杂志或其他出版物。",
      "example_en": "The newspaper is press daily at dawn.",
      "example_cn": "这份报纸每天黎明时分印刷发行。"
    },
    {
      "pos": "noun",
      "explanation_en": "The collective body of journalists, reporters, and media organizations that report news and influence public opinion.",
      "explanation_cn": "指所有报道新闻、影响公众舆论的记者、记者团体和媒体机构的总称。",
      "example_en": "The president held a press conference to address the scandal.",
      "example_cn": "总统召开新闻发布会回应丑闻。"
    },
    {
      "pos": "noun",
      "explanation_en": "A machine or device that applies pressure to flatten, shape, or extract something, such as a printing press or juice press.",
      "explanation_cn": "指用于压平、塑形或提取物质的机械装置，如印刷机或榨汁机。",
      "example_en": "The antique printing press is on display in the museum.",
      "example_cn": "这台古董印刷机正在博物馆展出。"
    },
    {
      "pos": "noun",
      "explanation_en": "A forceful or oppressive influence, often psychological or social, that compels someone to act in a certain way.",
      "explanation_cn": "指一种强制性的、通常为心理或社会层面的压力，迫使某人以某种方式行动。",
      "example_en": "Peer pressure led him to make poor decisions.",
      "example_cn": "同伴压力使他做出了错误的决定。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "squeeze",
      "analysis": "“Squeeze” (挤压) 强调在有限空间内施加突然或强烈的外力，常带有“挤出”或“压缩到极限”的含义，如挤柠檬、挤进人群。而 “press” 更强调持续、稳定、有方向性的压力，不一定导致形变或挤出。"
    },
    {
      "word_to_compare": "advocate",
      "analysis": "“Advocate” (倡导) 指公开支持或提倡某种观点或行动，强调立场和表达，通常不带强制性。而 “press” 作为动词时，带有更强的敦促、施压甚至强迫的意味，常用于上级对下级或外界对个人的推动。"
    },
    {
      "word_to_compare": "media",
      "analysis": "“Media” (媒体) 是一个更广泛、更中性的术语，泛指所有传播信息的渠道，包括电视、广播、网络、社交媒体等。而 “press” 作为名词时，特指印刷媒体（报纸、杂志）及其从业者，具有历史传统和专业性，语义范围更窄。"
    }
  ]
}