{
  "word": "pressed",
  "pronunciation": "presd",
  "concise_definition": "adj. 受压的, 紧迫的, 紧张的; v. 压, 按, 熨烫（press 的过去式和过去分词）",
  "forms": {
    "base_form": "press",
    "third_person_singular": "presses",
    "present_participle": "pressing",
    "past_tense": "pressed",
    "past_participle": "pressed"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Feeling or showing urgency or stress due to time constraints, demands, or pressure; under duress or tight deadlines.",
      "explanation_cn": "因时间紧迫、要求繁重或外部压力而感到焦虑或紧张的状态，常用于描述因任务堆积而无法喘息的情形。",
      "example_en": "She was pressed for time and couldn't attend the meeting.",
      "example_cn": "她时间紧迫，无法参加会议。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Forced or compelled to do something, often unwillingly, due to external pressure or influence.",
      "explanation_cn": "因外界压力或影响而被迫做某事，通常带有不情愿的意味。",
      "example_en": "He was pressed into service as a volunteer despite his objections.",
      "example_cn": "尽管他反对，仍被强迫担任志愿者。"
    },
    {
      "pos": "verb",
      "explanation_en": "To apply continuous force or pressure on something, typically to flatten, shape, or imprint it.",
      "explanation_cn": "对某物施加持续的压力，通常用于压平、塑形或留下印记。",
      "example_en": "She pressed the flowers between the pages of a book to preserve them.",
      "example_cn": "她把花夹在书页中压平以保存。"
    },
    {
      "pos": "verb",
      "explanation_en": "To iron clothing or fabric to remove wrinkles using a heated tool.",
      "explanation_cn": "使用加热工具熨烫衣物或织物以去除褶皱。",
      "example_en": "He pressed his suit before the job interview.",
      "example_cn": "他在面试前把西装熨平了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pushed",
      "analysis": "“Pushed”（被推动）强调外力导致的物理或心理上的推动，常带有主动施加力量的意味，如“被催促”或“被逼迫”。而 “pressed” 更强调持续性的压力或紧迫感，常用于时间、责任或情感上的压迫，语气更内敛但更持久。"
    },
    {
      "word_to_compare": "compelled",
      "analysis": "“Compelled”（被迫）语气更正式，强调道德、法律或权威层面的强制性，通常不包含情绪压力。“Pressed” 则更口语化，常用于日常情境中的时间或情绪压力，如“被催着交报告”，带有更强烈的主观焦虑感。"
    },
    {
      "word_to_compare": "crushed",
      "analysis": "“Crushed”（压碎）强调物理上的彻底破坏或极度沉重的压迫，常用于极端情境，如“被重物压垮”或“情绪崩溃”。“Pressed” 则程度较轻，多用于可承受的压力状态，如“时间紧迫但还能完成”，不包含毁灭性后果。"
    }
  ]
}