{
  "word": "pride",
  "pronunciation": "prahyd",
  "concise_definition": "n. 自豪, 自尊, 骄傲; v. 使自豪",
  "forms": {
    "plural": "prides",
    "third_person_singular": "prides",
    "past_tense": "prided",
    "past_participle": "prided",
    "present_participle": "priding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A feeling of deep satisfaction or pleasure derived from one's own achievements, qualities, or possessions, or from those of someone with whom one identifies.",
      "explanation_cn": "因自己的成就、品质或拥有之物，或因与自己有关联之人的成就而产生的深切满足感或愉悦感。",
      "example_en": "She felt immense pride after graduating at the top of her class.",
      "example_cn": "她在班级排名榜首后感到无比自豪。"
    },
    {
      "pos": "noun",
      "explanation_en": "Excessive self-esteem or arrogance; an inflated sense of one's own importance, often leading to disdain for others.",
      "explanation_cn": "过度的自尊或傲慢；对自己重要性的夸大认知，常导致对他人轻视。",
      "example_en": "His pride prevented him from apologizing, even when he knew he was wrong.",
      "example_cn": "他的骄傲使他即使知道自己错了也不愿道歉。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of lions or other animals, especially when gathered together in a social unit.",
      "explanation_cn": "指一群狮子或其他动物，尤指以社会群体形式聚集在一起的动物群。",
      "example_en": "The pride of lions was resting under the acacia tree.",
      "example_cn": "一群狮子正在金合欢树下休息。"
    },
    {
      "pos": "verb",
      "explanation_en": "To feel or show pride in something, especially when referring to oneself or one's actions.",
      "explanation_cn": "因某事而感到或表现出自豪，尤指针对自己或自己的行为。",
      "example_en": "He prides himself on his ability to remain calm under pressure.",
      "example_cn": "他为自己在压力下保持冷静的能力而感到自豪。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "self-respect",
      "analysis": "“Self-respect”（自尊）强调对自身价值的内在认可和道德上的自我珍视，通常带有正面、健康的意义，不包含优越感或傲慢。而 “pride” 在表示‘自尊’时可能包含自我评价的成分，若过度则滑向‘傲慢’。"
    },
    {
      "word_to_compare": "arrogance",
      "analysis": "“Arrogance”（傲慢）是纯粹的贬义词，指对他人的轻视和自我膨胀，通常缺乏合理依据。而 “pride” 作为名词时，既可以是中性或正面的（如成就带来的自豪），也可以是负面的（如过度自大），语义范围更广。"
    },
    {
      "word_to_compare": "dignity",
      "analysis": "“Dignity”（尊严）强调在任何境遇下保持庄重、尊重和自我价值的内在品质，常与处境无关，是被动维持的品格。而 “pride” 更多是主动的情绪反应，源于成就或认同，可能外显，也可能因挫败而消失。"
    }
  ]
}