{
  "word": "priesthood",
  "pronunciation": "prēsht·hʊd",
  "concise_definition": "n. 祭司身份, 神职人员, 神职阶层",
  "forms": {
    "plural": "priesthoods"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The collective body of priests or clergy in a religious organization, especially those authorized to perform sacred rites and mediate between the divine and the faithful.",
      "explanation_cn": "指宗教组织中所有神职人员的总称，特别是那些被授权主持神圣仪式、在神与信徒之间充当中介的人。",
      "example_en": "The priesthood in the Catholic Church is exclusively male.",
      "example_cn": "天主教会的神职人员仅限男性。"
    },
    {
      "pos": "noun",
      "explanation_en": "The office, status, or function of being a priest; the spiritual authority and responsibilities associated with this role.",
      "explanation_cn": "指担任祭司的职位、身份或职能；与这一角色相关的属灵权威与责任。",
      "example_en": "She felt a deep calling to the priesthood, despite societal pressures against women in religious leadership.",
      "example_cn": "尽管社会对女性担任宗教领导角色存在压力，她仍深感自己被召唤进入神职。"
    },
    {
      "pos": "noun",
      "explanation_en": "In some religious traditions, a specific order or hierarchy of spiritual authority, such as the Aaronic or Melchizedek priesthood in Mormonism.",
      "explanation_cn": "在某些宗教传统中，指特定的属灵权威体系或等级，例如摩门教中的亚伦祭司职或麦基洗德祭司职。",
      "example_en": "In the LDS Church, young men are ordained to the Aaronic priesthood at age 12.",
      "example_cn": "在耶稣基督后期圣徒教会中，男孩在12岁时被按立为亚伦祭司职。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "clergy",
      "analysis": "“Clergy”（神职人员）是一个更广泛的术语，泛指所有被按立或任命从事宗教服务的人员，包括牧师、神父、主教、牧师等，不限于祭司。“Priesthood”更强调祭司这一特定身份及其神圣权柄，有时也指该身份所构成的制度性体系，而“clergy”侧重于人员群体。"
    },
    {
      "word_to_compare": "ministry",
      "analysis": "“Ministry”（圣工、事奉）指神职人员所从事的宗教服务或职责本身，强调行为与功能，如布道、牧养、教导等。“Priesthood”则更侧重于身份、地位和授予的属灵权柄，是“ministry”得以行使的基础。"
    },
    {
      "word_to_compare": "ordination",
      "analysis": "“Ordination”（按立）是授予某人 priesthood 的仪式或过程，是成为祭司的手段，而非身份本身。“Priesthood”是结果，是持续存在的地位；而“ordination”是事件，是进入该地位的转折点。"
    }
  ]
}