{
  "word": "primaries",
  "pronunciation": "prahy·muh·reez",
  "concise_definition": "n. 初选, 首要部分, 原色",
  "forms": {
    "singular": "primary"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An election in which voters in a political party select their preferred candidate to represent the party in the general election.",
      "explanation_cn": "指政党选民投票选出本党在大选中代表本党参选的候选人的选举。",
      "example_en": "The Democratic primaries will be held next month to choose the presidential nominee.",
      "example_cn": "民主党将于下月举行初选，以选出总统候选人。"
    },
    {
      "pos": "noun",
      "explanation_en": "The first or most important part of something, especially in a sequence or hierarchy; often used in plural to refer to fundamental elements or components.",
      "explanation_cn": "指某事物中首要或最基本的部分，尤其在序列或层级中；常以复数形式指代基本要素或组成部分。",
      "example_en": "The primaries of good health include proper nutrition, regular exercise, and sufficient sleep.",
      "example_cn": "健康的首要要素包括均衡营养、规律锻炼和充足睡眠。"
    },
    {
      "pos": "noun",
      "explanation_en": "In color theory, the three basic colors—red, blue, and yellow—from which all other colors can be mixed; sometimes extended to include red, green, and blue in light.",
      "explanation_cn": "在色彩理论中，指三种基本颜色——红、蓝、黄——所有其他颜色均可由它们混合而成；有时在光色中扩展为红、绿、蓝。",
      "example_en": "Art students learn to mix paints using the three primaries: red, blue, and yellow.",
      "example_cn": "美术学生学习使用三种原色——红、蓝、黄——来调配颜料。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "election",
      "analysis": "“Election”（选举）是泛指任何选择官员或决定事项的投票过程，范围广泛，包括大选、公投等。而 “primaries” 特指政党内部为筛选候选人而举行的初选，是选举体系中的一个特定阶段。"
    },
    {
      "word_to_compare": "fundamentals",
      "analysis": "“Fundamentals”（基本要素）与 “primaries” 在表示“基础部分”时语义接近，但 “fundamentals” 更常用于抽象概念（如数学基础、科学原理），而 “primaries” 在此语境下更强调“原始性”和“不可再分性”，尤其在色彩或系统构成中使用更精确。"
    },
    {
      "word_to_compare": "originals",
      "analysis": "“Originals”（原作/原始物）强调来源的唯一性或创作的初始版本，常用于艺术、文学或设计领域。而 “primaries” 强调的是构成其他事物的基础元素，不一定是唯一的原始物，而是功能上的基础成分，如原色可被重复混合使用。"
    }
  ]
}