{
  "word": "primitive",
  "pronunciation": "prih·mit·iv",
  "concise_definition": "adj. 原始的, 早期的, 简陋的; n. 原始人, 原始事物",
  "forms": {
    "comparative": "more primitive",
    "superlative": "most primitive"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Belonging to an early stage of development; not advanced or sophisticated in technology, culture, or social organization.",
      "explanation_cn": "指处于发展早期阶段的，技术、文化或社会组织方面尚未进步或复杂的。",
      "example_en": "The tribe lived in primitive conditions without electricity or running water.",
      "example_cn": "这个部落生活在没有电和自来水的原始环境中。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by simplicity or lack of refinement, often in art, design, or behavior; resembling early or natural forms.",
      "explanation_cn": "指在艺术、设计或行为上具有简单性或缺乏精致感，常类似于早期或自然形态。",
      "example_en": "Her painting has a primitive charm that captures raw emotion.",
      "example_cn": "她的画作有一种原始的吸引力，能传达出原始的情感。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person belonging to a society with a simple, early stage of cultural or technological development; often used historically to refer to indigenous or pre-industrial peoples.",
      "explanation_cn": "指属于文化或技术发展处于简单早期阶段社会的人；常用于历史语境中指土著或前工业民族。",
      "example_en": "Early anthropologists studied primitive societies to understand human origins.",
      "example_cn": "早期的人类学家研究原始社会，以了解人类的起源。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ancient",
      "analysis": "“Ancient”（古代的）强调时间上的久远，指历史上很久以前的时期或事物，如古埃及、古罗马。它不必然意味着技术或文化简单，而“primitive”则强调发展水平低、未开化。一个古代文明（如玛雅）可能高度发达，但一个原始部落则技术简单。"
    },
    {
      "word_to_compare": "basic",
      "analysis": "“Basic”（基本的）指构成某物所必需的最低限度要素，中性甚至正面，如“basic needs”（基本需求）。“Primitive”则带有贬义或历史偏见，暗示落后、未开化，常用于描述技术或社会形态的不成熟。"
    },
    {
      "word_to_compare": "raw",
      "analysis": "“Raw”（原始的、未加工的）强调未经处理或自然状态，如“raw data”（原始数据）或“raw meat”（生肉），侧重物理或形式上的未加工。“Primitive”则更侧重社会、文化或技术层面的早期发展阶段，具有更广泛的人文内涵。"
    }
  ]
}