{
  "word": "prints",
  "pronunciation": "prints",
  "concise_definition": "n. 印刷品, 版画, 打印件; v. 打印, 印刷",
  "forms": {
    "singular": "print"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A copy of an image, text, or design produced by printing, especially one made from an original artwork or photograph.",
      "explanation_cn": "指通过印刷技术制作出的图像、文字或设计的复制品，尤指从原版艺术作品或照片中印制的版本。",
      "example_en": "She hung several fine art prints on the walls of her living room.",
      "example_cn": "她在客厅的墙上挂了几幅精美的艺术印刷品。"
    },
    {
      "pos": "noun",
      "explanation_en": "A mark or impression left by a foot, hand, or object, often used as evidence or a sign of presence.",
      "explanation_cn": "指脚、手或物体留下的痕迹或印记，常作为存在或行为的证据。",
      "example_en": "The police found footprints leading away from the crime scene.",
      "example_cn": "警察在犯罪现场发现了通往远处的脚印。"
    },
    {
      "pos": "noun",
      "explanation_en": "A printed version of digital content, such as a document or photograph produced by a printer.",
      "explanation_cn": "指通过打印机输出的数字内容的纸质版本，如文档或照片。",
      "example_en": "I need a color print of this photo for the exhibition.",
      "example_cn": "我需要这张照片的彩色打印件用于展览。"
    },
    {
      "pos": "verb",
      "explanation_en": "To produce a copy of text, images, or designs using a printing press or digital printer.",
      "explanation_cn": "指使用印刷机或数字打印机制作文本、图像或设计的复制品。",
      "example_en": "The publisher will print 10,000 copies of the new novel next month.",
      "example_cn": "出版社下个月将印刷这部新小说的一万册。"
    },
    {
      "pos": "verb",
      "explanation_en": "To leave a mark or impression on a surface, especially by pressure or contact.",
      "explanation_cn": "指通过压力或接触在表面上留下痕迹或印记。",
      "example_en": "The muddy shoes prints were all over the clean floor.",
      "example_cn": "沾满泥巴的鞋子在干净的地板上留下了一串脚印。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "copy",
      "analysis": "“Copy” (副本) 是一个通用词，泛指任何复制品，可以是手写的、电子的或印刷的，不强调制作方式。而 “print” 特指通过印刷或打印技术产生的复制品，具有明确的工艺属性。"
    },
    {
      "word_to_compare": "impression",
      "analysis": "“Impression” (印象/痕迹) 更侧重于抽象的感知或物理上的压痕，常用于艺术（如版画印痕）或心理层面。而 “print” 既可以是物理痕迹，也可以是成品印刷品，语义范围更广，且常为最终产品。"
    },
    {
      "word_to_compare": "output",
      "analysis": "“Output” (输出) 是一个技术性术语，泛指任何系统产生的结果，包括数据、信号或打印件。它不特指物理形式，而 “print” 明确指代可触摸的纸质或实体印刷产物。"
    }
  ]
}