{
  "word": "principals",
  "pronunciation": "prin·suh·pulz",
  "concise_definition": "n. 校长, 主要人物, 本金, 主要原则",
  "forms": {
    "singular": "principal"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The head administrator of a school or educational institution, responsible for overall management and leadership.",
      "explanation_cn": "指学校的最高行政负责人，负责学校的整体管理和领导工作。",
      "example_en": "The principal announced a new policy to improve student attendance.",
      "example_cn": "校长宣布了一项新政策，以提高学生的出勤率。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is primarily responsible for an action or decision, especially in business or legal contexts; the main party involved.",
      "explanation_cn": "指在商业或法律语境中对某项行动或决策负主要责任的人，即主要当事人或核心人物。",
      "example_en": "The principals in the merger negotiated the terms for over six months.",
      "example_cn": "并购的双方主要负责人就条款进行了长达六个月的谈判。"
    },
    {
      "pos": "noun",
      "explanation_en": "The original sum of money invested or loaned, excluding interest or profits.",
      "explanation_cn": "指投资或贷款的原始本金，不包括利息或利润。",
      "example_en": "She paid off the interest but still owes the principal on her mortgage.",
      "example_cn": "她已经还清了利息，但仍欠着房贷的本金。"
    },
    {
      "pos": "noun",
      "explanation_en": "A fundamental truth, rule, or standard that serves as the foundation for a system of belief or behavior.",
      "explanation_cn": "指作为信仰体系或行为准则基础的根本真理、规则或标准。",
      "example_en": "Honesty and integrity are the principal values of this organization.",
      "example_cn": "诚实与正直是该组织的基本价值观。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "principal",
      "analysis": "“Principals” 是 “principal” 的复数形式，两者词义相同，仅在数量上区分。在使用时需注意语境：当指多个校长、多个主要当事人或多个本金时，才使用复数形式。单数形式更常见于日常表达。"
    },
    {
      "word_to_compare": "agents",
      "analysis": "“Agents” (代理人) 指代表他人行事的人，通常在法律或商业中作为中间人，其权力来源于委托。而 “principals” 是被代理人所代表的主体，是决策和责任的最终承担者。二者是相对概念。"
    },
    {
      "word_to_compare": "core",
      "analysis": "“Core” (核心) 是一个形容词或名词，泛指某事物最重要的部分，但不特指人或资金。它更抽象，可用于描述理念、结构或系统的核心。而 “principal” 在指人或金额时具有明确的身份或财务属性，语义更具体。"
    },
    {
      "word_to_compare": "foundations",
      "analysis": "“Foundations” (基础) 与 “principles”（原则）更接近，都指支撑体系的基本要素。但 “principals” 在作为“原则”使用时，是 “principle” 的复数，而 “foundations” 更强调物理或结构性支撑，常用于比喻性语境，如 ‘the foundations of democracy’。"
    }
  ]
}