{
  "word": "probe",
  "pronunciation": "prohb",
  "concise_definition": "n. 探测, 调查; v. 探查, 探索, 侦查",
  "forms": {
    "third_person_singular": "probes",
    "past_tense": "probed",
    "past_participle": "probed",
    "present_participle": "probing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A device or instrument used to examine or investigate something internally, especially in medicine or space exploration, often by inserting it into a body or object.",
      "explanation_cn": "指用于内部检查或调查的装置或仪器，常用于医学或太空探索，通过插入身体或物体内部来获取信息。",
      "example_en": "The doctor used a slender probe to examine the wound without causing further damage.",
      "example_cn": "医生使用一根细长的探针检查伤口，避免造成进一步损伤。"
    },
    {
      "pos": "noun",
      "explanation_en": "A thorough and systematic investigation, especially into a complex issue or scandal, aimed at uncovering hidden facts or responsibilities.",
      "explanation_cn": "指对复杂问题或丑闻进行的彻底而系统的调查，旨在揭露隐藏的事实或责任。",
      "example_en": "A congressional probe into the company's financial practices revealed widespread fraud.",
      "example_cn": "对该公司财务行为的国会调查揭露了广泛的欺诈行为。"
    },
    {
      "pos": "verb",
      "explanation_en": "To examine or investigate something closely and thoroughly, often by using a physical or metaphorical tool to explore unknown or hidden areas.",
      "explanation_cn": "指通过使用物理或隐喻性工具，对某事物进行密切而彻底的检查或调查，常用于探索未知或隐藏的领域。",
      "example_en": "Scientists are probing the depths of the ocean to discover new species.",
      "example_cn": "科学家正在探测海洋深处，以发现新物种。"
    },
    {
      "pos": "verb",
      "explanation_en": "To ask persistent or intrusive questions, especially in an attempt to uncover private or sensitive information.",
      "explanation_cn": "指持续或侵入性地提问，尤其试图揭露私人或敏感信息。",
      "example_en": "The reporter probed the politician about his undisclosed donations.",
      "example_cn": "记者追问这位政客关于其未公开的捐款。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "investigate",
      "analysis": "“Investigate” (调查) 是一个更广泛、更正式的术语，泛指系统性地收集信息以查明事实，适用于法律、犯罪、学术等各类场景。而 “probe” 更强调深入、细致甚至带有侵入性的探索，常暗示调查对象具有隐蔽性或敏感性，语气更强烈。"
    },
    {
      "word_to_compare": "explore",
      "analysis": "“Explore” (探索) 通常指开放性、好奇心驱动的发现过程，如探索未知地域或新思想，不带有强制或怀疑色彩。而 “probe” 常带有目的性、批判性甚至怀疑性，旨在揭露问题或缺陷，语义更严肃、更具针对性。"
    },
    {
      "word_to_compare": "inspect",
      "analysis": "“Inspect” (检查) 通常指基于标准或规范的正式审查，如建筑检查、安全检查，强调合规性而非深度挖掘。而 “probe” 更深入，常用于发现隐藏问题，超越表面检查，带有挖掘真相的意味。"
    }
  ]
}