{
  "word": "probing",
  "pronunciation": "proh·bing",
  "concise_definition": "adj. 深入的, 探究的; v. 探查, 探索 (probe 的现在分词)",
  "forms": {
    "base_form": "probe",
    "third_person_singular": "probes",
    "past_tense": "probed",
    "past_participle": "probed",
    "present_participle": "probing"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing an inquiry, question, or investigation that is thorough, incisive, and aimed at uncovering hidden truths or underlying causes.",
      "explanation_cn": "形容一种深入、尖锐的询问或调查，旨在揭示隐藏的真相或根本原因。",
      "example_en": "The journalist asked probing questions about the CEO's financial dealings.",
      "example_cn": "这位记者就首席执行官的财务往来提出了深入的质询。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterizing a tool, method, or technique that is designed to explore or examine something deeply, often physically or scientifically.",
      "explanation_cn": "形容一种旨在深入探索或检查某物的工具、方法或技术，常用于物理或科学领域。",
      "example_en": "The probe sent to Mars carried a probing instrument to analyze soil composition.",
      "example_cn": "送往火星的探测器携带了一种探查仪器，用于分析土壤成分。"
    },
    {
      "pos": "verb",
      "explanation_en": "To investigate or explore something thoroughly, especially by asking detailed questions or using physical instruments.",
      "explanation_cn": "指通过提出详细问题或使用物理工具对某事物进行彻底调查或探索。",
      "example_en": "Scientists are probing the depths of the ocean to discover new species.",
      "example_cn": "科学家们正在探索海洋深处，以发现新物种。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "inquiring",
      "analysis": "“Inquiring” (询问的) 通常指一般性的提问，语气中性，不一定具有深度或目的性。而 “probing” 强调问题的尖锐性、深入性和意图揭露本质，带有更强的分析性和批判性。"
    },
    {
      "word_to_compare": "investigative",
      "analysis": "“Investigative” (调查性的) 是一个更宽泛的术语，常用于描述系统性、官方或法律层面的调查（如 investigative journalism）。而 “probing” 更侧重于提问或探索的深度和穿透力，可以是个人行为，不一定需要正式程序。"
    },
    {
      "word_to_compare": "curious",
      "analysis": "“Curious” (好奇的) 描述一种对事物感兴趣或想了解的状态，但未必采取行动或深入探究。而 “probing” 暗示了主动、持续、有策略地深入挖掘，是行动导向的，而非仅停留在心理层面。"
    }
  ]
}