{
  "word": "professed",
  "pronunciation": "pruh·fesd",
  "concise_definition": "adj. 声称的, 公开宣称的; v. 声称, 公开表示",
  "forms": {
    "base_form": "profess",
    "third_person_singular": "professes",
    "past_tense": "professed",
    "past_participle": "professed",
    "present_participle": "professing"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Declared or claimed openly, often with the implication that the claim may not be fully sincere or may be superficial, especially when referring to beliefs, opinions, or affiliations.",
      "explanation_cn": "公开宣称的，常带有暗示该宣称可能并非完全真诚或仅流于表面，尤其用于指信仰、观点或隶属关系。",
      "example_en": "He is a professed atheist who never attends religious services.",
      "example_cn": "他是一名公开的无神论者，从不参加宗教活动。"
    },
    {
      "pos": "verb",
      "explanation_en": "To declare or state something openly and formally, especially a belief, opinion, or allegiance, sometimes with a hint of insincerity or performative intent.",
      "explanation_cn": "公开而正式地声明某事，尤其是信仰、观点或忠诚，有时隐含不真诚或作秀的意味。",
      "example_en": "She professed her love for classical music, though she rarely listened to it.",
      "example_cn": "她声称自己热爱古典音乐，尽管她很少听。"
    },
    {
      "pos": "verb",
      "explanation_en": "To claim to be qualified or experienced in a particular field, often to gain credibility or advantage.",
      "explanation_cn": "声称自己在某一领域具备资格或经验，常为获取信誉或优势。",
      "example_en": "He professed to be an expert in ancient history, but his knowledge was quite shallow.",
      "example_cn": "他自称是古代史专家，但他的知识非常肤浅。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "claimed",
      "analysis": "“Claimed” (声称) 更中性，泛指任何公开提出的要求或断言，不一定带有虚伪或表演色彩。而 “professed” 常隐含对信仰、情感或立场的表面化宣称，更易暗示其真实性存疑。"
    },
    {
      "word_to_compare": "declared",
      "analysis": "“Declared” (宣布) 强调正式、权威或公开的陈述，通常用于官方、法律或重大场合，语义更严肃、更可信。而 “professed” 更常用于个人信念或情感层面，且常带怀疑语气。"
    },
    {
      "word_to_compare": "asserted",
      "analysis": "“Asserted” (断言) 强调自信地、坚定地表达观点，通常基于某种信念或证据，具有说服力和主动性。而 “professed” 更侧重于外在表达，可能缺乏内在支撑，甚至带有表演性质。"
    }
  ]
}