{
  "word": "progressive",
  "pronunciation": "pruh·grehs·iv",
  "concise_definition": "adj. 进步的, 前进的, 渐进的; n. 进步主义者",
  "forms": {
    "comparative": "more progressive",
    "superlative": "most progressive"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Favoring or promoting social, political, or economic reform and change, especially toward greater equality, justice, or innovation; opposed to traditional or conservative views.",
      "explanation_cn": "支持或推动社会、政治或经济改革与变革，尤其倾向于实现更大的平等、正义或创新；与传统或保守观点相对。",
      "example_en": "The party has adopted a more progressive stance on climate change and healthcare.",
      "example_cn": "该政党在气候变化和医疗保健问题上采取了更加进步的立场。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by gradual, continuous advancement or development over time, rather than sudden or drastic change.",
      "explanation_cn": "指随着时间推移逐步、持续地前进或发展，而非突然或剧烈的变化。",
      "example_en": "A progressive tax system increases rates as income rises.",
      "example_cn": "一种累进税制会随着收入增加而提高税率。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who supports progressive policies and advocates for social reform, especially in politics or civil rights.",
      "explanation_cn": "指支持进步政策并倡导社会改革的人，尤其在政治或民权领域。",
      "example_en": "As a progressive, she campaigned for universal basic income and environmental justice.",
      "example_cn": "作为一名进步主义者，她为全民基本收入和环境正义而奔走呼吁。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "liberal",
      "analysis": "“Liberal”（自由派）通常指在政治或社会议题上支持个人自由、宽容和多元化的立场，但不一定强调系统性变革；而 “progressive” 更强调主动推动结构性改革，常带有更强的激进或变革色彩，尤其在经济平等和制度重构方面。"
    },
    {
      "word_to_compare": "modern",
      "analysis": "“Modern”（现代的）仅表示属于当前时代或具有当代特征，不必然包含价值判断或改革倾向；而 “progressive” 隐含积极的价值取向，即推动社会向更公正、更先进的方向发展，具有明确的意识形态导向。"
    },
    {
      "word_to_compare": "innovative",
      "analysis": "“Innovative”（创新的）侧重于新方法、新技术或新理念的创造与应用，常用于科技或商业语境；而 “progressive” 更广泛地用于社会、政治或制度层面，强调的是价值导向的演进，而不仅是技术或形式上的新颖。"
    }
  ]
}