{
  "word": "projection",
  "pronunciation": "pruh·jek·shun",
  "concise_definition": "n. 投影, 预测, 估算, 投射",
  "forms": {
    "plural": "projections"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of casting or throwing something forward, especially an image or light onto a surface, as in a movie theater or a slide show.",
      "explanation_cn": "指将图像、光线或其他内容投射到某个表面上的行为，例如在电影院或幻灯片演示中。",
      "example_en": "The projector created a sharp projection of the presentation on the screen.",
      "example_cn": "投影仪在屏幕上清晰地投射出了演示文稿的内容。"
    },
    {
      "pos": "noun",
      "explanation_en": "A forecast or estimate of future trends, outcomes, or values based on current data or assumptions.",
      "explanation_cn": "指根据当前数据或假设对未来趋势、结果或数值所做的预测或估算。",
      "example_en": "Economic projections suggest a 3% growth in GDP next year.",
      "example_cn": "经济预测表明明年GDP将增长3%。"
    },
    {
      "pos": "noun",
      "explanation_en": "A psychological process in which a person attributes their own feelings, thoughts, or motives to someone else, often unconsciously.",
      "explanation_cn": "指一种心理机制，个体无意识地将自己的情感、想法或动机归因于他人。",
      "example_en": "His anger toward his boss was actually a projection of his own guilt about missing the deadline.",
      "example_cn": "他对老板的愤怒实际上是他对自己未能按时完成截止日期的内疚的投射。"
    },
    {
      "pos": "noun",
      "explanation_en": "A part of an object that extends outward beyond its main body, such as a ledge or overhang.",
      "explanation_cn": "指物体超出其主体部分向外延伸的结构，如突出的檐口或平台。",
      "example_en": "The building's projection provided shelter from the rain for pedestrians below.",
      "example_cn": "这座建筑的突出部分为下方的行人提供了遮雨的庇护。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "forecast",
      "analysis": "“Forecast”（预测）通常用于气象、经济或事件的未来趋势预测，强调基于数据和模型的科学性与客观性。而 “projection” 更常用于假设性情境，可能包含更多主观前提，如‘如果政策不变，人口将……’，因此更具条件性。"
    },
    {
      "word_to_compare": "display",
      "analysis": "“Display”（展示）泛指将信息或物品呈现出来供人观看，可以是静态的、非技术性的，如橱窗陈列。而 “projection” 特指通过光学或数字技术将图像投射到表面，强调技术媒介和空间延伸的特性。"
    },
    {
      "word_to_compare": "illusion",
      "analysis": "“Illusion”（幻觉）指一种错误的感知或虚假的印象，常带有欺骗性或心理误导的含义。而 “projection” 在心理学语境中虽也涉及主观投射，但它是认知机制，不一定是虚假的，而是个体将内在情绪外化的一种心理策略。"
    }
  ]
}