{
  "word": "projected",
  "pronunciation": "pruh·jek·tuhd",
  "concise_definition": "adj. 预测的, 预计的; v. 投射, 预测 (project 的过去式和过去分词)",
  "forms": {
    "base_form": "project",
    "present_participle": "projecting",
    "past_tense": "projected",
    "past_participle": "projected"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Based on estimates, forecasts, or calculations of future trends, often used in economic, demographic, or statistical contexts to describe anticipated outcomes.",
      "explanation_cn": "基于对未来的趋势、估算或预测，常用于经济、人口或统计语境中，描述预期的结果。",
      "example_en": "The projected population growth for the next decade is 8%.",
      "example_cn": "未来十年的人口预计增长率为8%。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Displayed or cast onto a surface, especially in the context of visual media or technology, such as slides, films, or digital images.",
      "explanation_cn": "指被投射或显示在某个表面上，尤其用于视觉媒体或技术场景，如幻灯片、电影或数字图像。",
      "example_en": "The projected image on the screen was blurry due to poor focus.",
      "example_cn": "屏幕上投射的图像因焦点不准而模糊。"
    },
    {
      "pos": "verb",
      "explanation_en": "To estimate or predict future outcomes based on current data or trends, often used in planning and analysis.",
      "explanation_cn": "根据当前数据或趋势估算或预测未来结果，常用于规划与分析中。",
      "example_en": "Economists projected a slowdown in consumer spending.",
      "example_cn": "经济学家预测消费者支出将放缓。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cast or throw light, an image, or sound onto a surface, typically using a device such as a projector.",
      "explanation_cn": "使用投影仪等设备将光线、图像或声音投射到表面上。",
      "example_en": "The teacher projected the PowerPoint slides onto the whiteboard.",
      "example_cn": "老师把PowerPoint幻灯片投射到了白板上。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "forecast",
      "analysis": "“Forecast” (预测) 通常指基于气象、经济或统计模型对未来事件的系统性预测，更强调科学性和数据驱动。而 “projected” 更广泛，可指任何基于现有趋势的推断，不一定需要复杂模型，语气更中性，常用于书面报告。"
    },
    {
      "word_to_compare": "estimated",
      "analysis": "“Estimated” (估计) 指对当前或未来数值的粗略计算，常带有不确定性，可能基于经验或有限数据。而 “projected” 暗示了趋势延续的逻辑，更强调从当前状态向外推演，常用于长期规划，比 “estimated” 更具动态性和前瞻性。"
    },
    {
      "word_to_compare": "displayed",
      "analysis": "“Displayed” (显示) 是一个通用词，泛指任何将信息、图像或内容呈现出来的方式，如屏幕显示、橱窗陈列等。而 “projected” 特指通过光学或电子设备将图像投射到外部表面，强调投射的动作和媒介特性，技术性更强。"
    }
  ]
}