{
  "word": "promotions",
  "pronunciation": "prə·mō·shənz",
  "concise_definition": "n. 提升, 促销, 推广",
  "forms": {
    "singular": "promotion"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of advancing someone to a higher position or rank, especially in a job or organization, as a reward for performance or seniority.",
      "explanation_cn": "指因表现优异或资历深厚而将某人提升至更高职位或等级的行为，尤其用于职场或组织内部。",
      "example_en": "After five years of outstanding service, she received a promotion to senior manager.",
      "example_cn": "在五年卓越服务后，她获得了晋升为高级经理的职位。"
    },
    {
      "pos": "noun",
      "explanation_en": "Marketing activities designed to increase awareness, interest, or sales of a product or service, often involving discounts, advertisements, or special offers.",
      "explanation_cn": "指为提高产品或服务的认知度、兴趣或销量而开展的营销活动，通常包括折扣、广告或特别优惠。",
      "example_en": "The store is running a summer promotion with 50% off all clothing items.",
      "example_cn": "这家商店正在举办夏季促销活动，所有服装五折优惠。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of publicly supporting or advocating for something to gain attention or approval, such as a cause, idea, or person.",
      "explanation_cn": "指为获得关注或认可而公开支持或倡导某事物，如一项事业、理念或人物。",
      "example_en": "The campaign included celebrity endorsements and social media promotions for the new environmental initiative.",
      "example_cn": "该活动包括名人代言和社交媒体推广，以支持这项新的环保倡议。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "raise",
      "analysis": "“Raise”（提高）通常指薪资、水平或数量的增加，多用于具体数值的提升，如 raise salary（加薪），不涉及职位变动或营销行为。而 “promotion” 在职场语境中特指职位晋升，具有结构性和权威性，范围更广。"
    },
    {
      "word_to_compare": "advertising",
      "analysis": "“Advertising”（广告）是促销的一种手段，侧重于通过媒体传播信息以影响公众认知。而 “promotion” 是一个更广泛的术语，包含广告、折扣、赠品、活动等多种形式，是策略性行为的总称。"
    },
    {
      "word_to_compare": "advancement",
      "analysis": "“Advancement”（进步、提升）是更抽象和通用的词，可指任何领域的进展，如技术进步、个人成长。而 “promotion” 更具体，专指组织体系内的职位晋升，具有明确的层级和制度背景。"
    }
  ]
}