{
  "word": "proprietary",
  "pronunciation": "pruh·prai·e·ter·ee",
  "concise_definition": "adj. 专有的, 私有的, 专利的",
  "forms": {
    "comparative": "more proprietary",
    "superlative": "most proprietary"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Owned or controlled exclusively by a particular company or individual, especially in the context of technology, software, or formulas, and not available to the public or competitors.",
      "explanation_cn": "指由某个公司或个人独家拥有或控制的，尤其在技术、软件或配方领域，不向公众或竞争对手开放。",
      "example_en": "The company uses proprietary software that cannot be copied or distributed without permission.",
      "example_cn": "该公司使用的是无法在未经许可的情况下复制或分发的专有软件。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to a trademark, patent, or other legal right that grants exclusive ownership or use of a product, process, or name.",
      "explanation_cn": "与商标、专利或其他法律权利相关，赋予某人对产品、工艺或名称的独家所有权或使用权。",
      "example_en": "The proprietary formula for the soft drink is kept secret by the manufacturer.",
      "example_cn": "这种软饮料的专有配方由制造商严格保密。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characteristic of being possessive or overly protective of one's own ideas, resources, or methods; often implying reluctance to share.",
      "explanation_cn": "指对自身的想法、资源或方法表现出占有欲或过度保护，常暗示不愿分享。",
      "example_en": "His proprietary attitude toward his research data hindered collaboration with other scientists.",
      "example_cn": "他对研究数据的独占态度阻碍了与其他科学家的合作。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "exclusive",
      "analysis": "“Exclusive”（独占的）强调排他性，即仅限特定群体或个人使用，但不一定涉及法律所有权。例如，会员专属服务。而 “proprietary” 更强调法律上的所有权或知识产权，通常与专利、版权或商业秘密直接相关。"
    },
    {
      "word_to_compare": "private",
      "analysis": "“Private”（私有的）泛指不属于公众或政府的，可用于个人、组织或财产，语义范围更广，不必然涉及商业控制或知识产权。例如私人住宅。而 “proprietary” 特指在商业或技术语境中受法律保护的专有资产，具有更强的法律和经济属性。"
    },
    {
      "word_to_compare": "patented",
      "analysis": "“Patented”（已获专利的）特指已通过官方程序获得专利保护的技术或发明，是 “proprietary” 的一种子集。所有已获专利的内容都是专有的，但并非所有专有内容都已申请专利（如商业秘密）。因此，“proprietary” 的范围更广，涵盖专利与非专利的独占资产。"
    }
  ]
}