{
  "word": "prop",
  "pronunciation": "prop",
  "concise_definition": "n. 支撑物, 帮助者, 道具; v. 支撑, 促进, 维持",
  "forms": {
    "plural": "props",
    "third_person_singular": "props",
    "past_tense": "propped",
    "past_participle": "propped",
    "present_participle": "propping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A physical object used to support or hold up something else, often temporarily, such as a wooden beam holding a ceiling or a stand holding a microphone.",
      "explanation_cn": "指用于临时支撑或托住某物的物理物体，例如支撑天花板的木梁或固定麦克风的支架。",
      "example_en": "The old bookshelf was held together by a single prop under one corner.",
      "example_cn": "那个旧书架靠一个支撑物撑在角落才没有倒塌。"
    },
    {
      "pos": "noun",
      "explanation_en": "An object used in a theatrical performance, film, or photograph to enhance the setting or action; any item handled by actors to make a scene more realistic.",
      "explanation_cn": "指在戏剧、电影或摄影中用于增强场景或动作的物品，任何由演员手持以使场景更真实的道具。",
      "example_en": "The detective’s trench coat and fedora were classic props in noir films.",
      "example_cn": "侦探的风衣和软呢帽是黑色电影中的经典道具。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that provides support, encouragement, or assistance, often in an informal or metaphorical sense.",
      "explanation_cn": "指在非正式或隐喻意义上提供支持、鼓励或帮助的人或事物。",
      "example_en": "Her friends were her emotional props during the difficult divorce.",
      "example_cn": "在艰难的离婚过程中，她的朋友们是她情感上的支柱。"
    },
    {
      "pos": "verb",
      "explanation_en": "To support or hold something in position using a physical object, often to prevent collapse or movement.",
      "explanation_cn": "指使用物理物体支撑或固定某物，以防止其倒塌或移动。",
      "example_en": "They propped the door open with a brick to let in the fresh air.",
      "example_cn": "他们用一块砖把门撑开，让新鲜空气进来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To encourage or promote something, especially by providing support or resources to sustain it.",
      "explanation_cn": "指通过提供支持或资源来鼓励或促进某事物，使其得以维持。",
      "example_en": "The government is propping up the failing airline with subsidies.",
      "example_cn": "政府正通过补贴来维持这家濒临倒闭的航空公司。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "support",
      "analysis": "“Support” (支持) 是一个更广泛、更抽象的词，可用于情感、经济、结构等多方面支持，不特指物理支撑物或道具。而 “prop” 更具体，常指物理支撑物，或在表演语境中特指道具，语义范围更窄但更形象。"
    },
    {
      "word_to_compare": "propel",
      "analysis": "“Propel” (推动) 指通过施加力量使某物向前运动，强调动力和方向性，如火箭推进。而 “prop” 作为动词时强调的是“维持”或“支撑”，不必然导致前进，甚至可能只是防止倒下。两者语义方向相反：propel 是主动推进，prop 是被动维持。"
    },
    {
      "word_to_compare": "道具 (dàojù)",
      "analysis": "“道具”是中文中对 “prop” 作为舞台/影视物品的直接翻译，但英文 “prop” 本身还包含物理支撑和隐喻性支持的含义，而中文“道具”仅限于表演用具，语义范围更窄。因此，英文 “prop” 的语义更丰富，需根据语境判断具体含义。"
    }
  ]
}