{
  "word": "proportions",
  "pronunciation": "pruh·pawr·shuhnz",
  "concise_definition": "n. 比例, 尺寸, 规模, 体量",
  "forms": {
    "singular": "proportion"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The relative size, degree, or amount of one part in comparison to another part or to the whole, often used to describe balance or harmony in design, architecture, or the human body.",
      "explanation_cn": "指一个部分相对于另一个部分或整体的相对大小、程度或数量，常用于描述设计、建筑或人体中的平衡与和谐。",
      "example_en": "The proportions of the ancient temple were considered perfect by classical standards.",
      "example_cn": "这座古庙的尺寸比例在古典标准下被认为是完美的。"
    },
    {
      "pos": "noun",
      "explanation_en": "The scale or magnitude of something, especially when it is large or overwhelming, often used in phrases like 'to take on proportions'.",
      "explanation_cn": "指某事物的规模或程度，尤其当其庞大或令人震惊时，常用于短语 'take on proportions'（达到某种规模）。",
      "example_en": "The environmental damage has taken on alarming proportions.",
      "example_cn": "环境破坏已达到令人担忧的规模。"
    },
    {
      "pos": "noun",
      "explanation_en": "A mathematical relationship between two or more quantities, expressed as a ratio or fraction.",
      "explanation_cn": "指两个或多个数量之间的数学关系，通常以比率或分数形式表示。",
      "example_en": "The recipe requires the ingredients to be mixed in exact proportions: two parts flour to one part sugar.",
      "example_cn": "这个食谱要求原料按精确的比例混合：两份面粉配一份糖。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ratio",
      "analysis": "“Ratio”（比率）是数学上两个数量之间的精确数值关系，强调数字表达（如 3:2），通常用于科学、工程或财务语境。而 “proportions” 更常用于描述视觉、物理或抽象意义上的相对大小，不一定以数字形式表达，语义范围更广。"
    },
    {
      "word_to_compare": "scale",
      "analysis": "“Scale”（规模/尺度）侧重于事物在整体系统中的相对大小或级别，常用于地图、模型或宏观趋势（如城市规模）。而 “proportions” 更强调部分与部分、部分与整体之间的协调关系，尤其在美学或结构语境中。"
    },
    {
      "word_to_compare": "dimension",
      "analysis": "“Dimension”（维度）指物体在空间中的具体测量值（如长、宽、高），是客观的物理量。而 “proportions” 关注的是这些维度之间的相对关系，而非绝对数值，更强调和谐与平衡，而非单纯测量。"
    }
  ]
}