{
  "word": "prospectus",
  "pronunciation": "pruh·spek·tuhs",
  "concise_definition": "n. 招股说明书, 招生简章, 宣传手册",
  "forms": {
    "plural": "prospectuses"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A formal document issued by a company or organization to provide detailed information about its financial offerings, such as shares or bonds, to potential investors, including risks, objectives, and terms.",
      "explanation_cn": "由公司或机构发布的正式文件，向潜在投资者提供有关其金融产品（如股票或债券）的详细信息，包括风险、目标和条款。",
      "example_en": "Before investing, you should carefully read the company's prospectus to understand the financial risks involved.",
      "example_cn": "在投资之前，你应该仔细阅读该公司的招股说明书，以了解所涉及的财务风险。"
    },
    {
      "pos": "noun",
      "explanation_en": "A printed booklet or document that outlines the programs, requirements, and opportunities offered by an educational institution to prospective students.",
      "explanation_cn": "由教育机构发布的印刷手册或文件，概述其为潜在学生提供的课程、入学要求和学习机会。",
      "example_en": "The university sent me a colorful prospectus highlighting its study-abroad programs and scholarships.",
      "example_cn": "这所大学寄给我一份色彩丰富的招生简章，重点介绍了其海外学习项目和奖学金。"
    },
    {
      "pos": "noun",
      "explanation_en": "A promotional publication that presents the features, benefits, and details of a product, service, or project to attract interest or investment.",
      "explanation_cn": "一种宣传性出版物，用于展示产品、服务或项目的特征、优势和细节，以吸引关注或投资。",
      "example_en": "The real estate developer distributed a prospectus detailing the luxury amenities of the new condominium complex.",
      "example_cn": "房地产开发商分发了一份宣传手册，详细介绍了新公寓综合体的豪华配套设施。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "brochure",
      "analysis": "“Brochure”（宣传册）通常指更轻便、更注重视觉设计的宣传材料，内容较简略，主要用于一般性推广，不具法律效力。而 “prospectus” 是正式、详尽且常具法律约束力的文件，尤其在金融或教育领域，包含关键数据和披露义务。"
    },
    {
      "word_to_compare": "catalog",
      "analysis": "“Catalog”（目录）侧重于系统性地列出商品、服务或课程，结构通常为清单式，强调分类与编号，用于检索而非说服。而 “prospectus” 更具说服性和解释性，旨在引导读者做出决策（如投资或入学），并包含分析性内容和前景展望。"
    },
    {
      "word_to_compare": "summary",
      "analysis": "“Summary”（摘要）是对长篇内容的简要概括，目的是压缩信息以便快速阅读。而 “prospectus” 是原始的、完整的披露文件，内容详尽，结构严谨，通常包含法律声明、财务数据和风险提示，其目的不是简化，而是全面透明地呈现信息。"
    }
  ]
}