{
  "word": "protective",
  "pronunciation": "pruh·tek·tiv",
  "concise_definition": "adj. 保护的, 保护性的, 有保护欲的",
  "forms": {
    "comparative": "more protective",
    "superlative": "most protective"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Designed or intended to shield someone or something from harm, danger, or damage; providing physical or emotional safeguarding.",
      "explanation_cn": "旨在保护某人或某物免受伤害、危险或损害；提供身体或情感上的防护。",
      "example_en": "Wearing a helmet is a protective measure that can prevent serious head injuries.",
      "example_cn": "戴头盔是一种保护性措施，可以防止严重的头部受伤。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Showing a strong desire to guard or defend someone, often to an excessive degree, especially in a parental or possessive context.",
      "explanation_cn": "表现出强烈的保护或捍卫某人的意愿，常带有过度或占有欲的色彩，尤其在父母对子女或伴侣之间的关系中。",
      "example_en": "Her protective instincts kicked in as soon as she saw her child near the edge of the pool.",
      "example_cn": "当她看到孩子靠近泳池边缘时，母性保护本能立刻被激发了。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characterized by a tendency to shield or preserve something from external influence or risk.",
      "explanation_cn": "与保护或防止外部影响、风险有关的特性，常用于描述制度、政策或行为模式。",
      "example_en": "The government introduced protective tariffs to shield domestic industries from foreign competition.",
      "example_cn": "政府出台了保护性关税，以保护本国产业免受外国竞争的影响。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "defensive",
      "analysis": "“Defensive”（防御性的）强调对已发生或预期威胁的反应，侧重于抵抗或反击，常用于军事、心理或辩论语境。而 “protective” 更强调主动的、预防性的保护行为，不一定需要威胁已经存在。"
    },
    {
      "word_to_compare": "guardian",
      "analysis": "“Guardian”（监护人）是名词，指承担保护责任的人，而 “protective” 是形容词，描述一种态度或性质。虽然两者都涉及保护，但 “guardian” 是角色，而 “protective” 是行为或情感特征。"
    },
    {
      "word_to_compare": "safeguarding",
      "analysis": "“Safeguarding”（保护、保障）是动名词，常用于正式或法律语境，指系统性、制度化的保护措施。而 “protective” 更广泛，可用于日常语言，描述个人态度、物品属性或抽象行为，语义范围更广。"
    }
  ]
}