{
  "word": "provost",
  "pronunciation": "proh·vohst",
  "concise_definition": "n. 教务长, 校长, 警备长",
  "forms": {
    "plural": "provosts"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A senior administrative official in a university or college, often responsible for academic affairs, faculty oversight, and institutional governance, equivalent to a vice president for academic affairs in some systems.",
      "explanation_cn": "大学或学院的高级行政官员，通常负责学术事务、教师管理及机构治理，在某些体系中相当于负责学术事务的副校长。",
      "example_en": "The provost announced new policies to improve undergraduate research opportunities.",
      "example_cn": "教务长宣布了新的政策，以提升本科生的研究机会。"
    },
    {
      "pos": "noun",
      "explanation_en": "A military officer in charge of maintaining discipline and order within a specific area or unit, especially in a garrison or on a military base.",
      "explanation_cn": "负责维持特定区域或部队内纪律与秩序的军职官员，尤其在军营或军事基地中。",
      "example_en": "The provost marshal arrested several soldiers for violating curfew regulations.",
      "example_cn": "警备长逮捕了数名违反宵禁规定的士兵。"
    },
    {
      "pos": "noun",
      "explanation_en": "In some historical or ecclesiastical contexts, a clergyman who presides over a cathedral chapter or a specific district under the bishop’s authority.",
      "explanation_cn": "在某些历史或教会语境中，指在主教权威下主持大教堂教士会或特定教区的神职人员。",
      "example_en": "The provost of the cathedral was known for his scholarly sermons and charitable works.",
      "example_cn": "大教堂的教务长以其博学的讲道和慈善事业而闻名。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "dean",
      "analysis": "“Dean”（院长）通常指大学中某一学院或系的负责人，主要负责教学与学术管理，层级低于教务长。而 “provost” 是整个大学的学术最高行政官员，管理多个学院，权力范围更广。"
    },
    {
      "word_to_compare": "president",
      "analysis": "“President”（校长/大学校长）是大学的最高行政首长，负责整体战略、财务、公共关系与外部事务。而 “provost” 专注于学术事务，是校长在学术方面的首席执行官，二者是上下级关系。"
    },
    {
      "word_to_compare": "marshal",
      "analysis": "“Marshal”（警卫长/元帅）在军事语境中可指高级军衔或执法官员，但通常不直接负责日常纪律执行。而 “provost”（警备长）是专门负责军营内秩序、逮捕违纪人员的执法官员，职能更具体、更贴近基层管理。"
    }
  ]
}