{
  "word": "provided",
  "pronunciation": "pruh·vahy·d",
  "concise_definition": "conj. 只要, 倘若; v. 提供, 供给",
  "forms": {
    "base_form": "provide",
    "third_person_singular": "provides",
    "past_tense": "provided",
    "past_participle": "provided",
    "present_participle": "providing"
  },
  "definitions": [
    {
      "pos": "conjunction",
      "explanation_en": "Used to introduce a condition that must be fulfilled for something else to happen or be true; equivalent to 'if' or 'on the condition that'.",
      "explanation_cn": "用于引入一个必须满足的条件，以使某事发生或成立，相当于 'if' 或 '在……条件下'。",
      "example_en": "You can borrow my car provided you return it by midnight.",
      "example_cn": "只要你午夜前归还，就可以借我的车。"
    },
    {
      "pos": "conjunction",
      "explanation_en": "Often used in formal or legal contexts to impose a stipulation or limitation on an offer or agreement.",
      "explanation_cn": "常用于正式或法律语境中，对提议或协议施加限制性条款。",
      "example_en": "The scholarship will be awarded provided the recipient maintains a GPA of 3.5 or higher.",
      "example_cn": "只要获奖者保持3.5或更高的平均绩点，奖学金就会颁发。"
    },
    {
      "pos": "verb",
      "explanation_en": "To supply or make available something needed or desired, especially in a formal, organized, or systematic way.",
      "explanation_cn": "指有组织地、系统地提供或供应某人所需或期望的事物。",
      "example_en": "The hospital provides free medical care to low-income families.",
      "example_cn": "这家医院为低收入家庭提供免费医疗服务。"
    },
    {
      "pos": "verb",
      "explanation_en": "To furnish or equip with necessary items or resources, often in anticipation of future needs.",
      "explanation_cn": "指为满足未来需求而配备必要的物品或资源。",
      "example_en": "The camp provides tents, sleeping bags, and cooking equipment for all participants.",
      "example_cn": "营地为所有参与者提供帐篷、睡袋和炊具。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "if",
      "analysis": "“If” 是最常用的条件连词，语气中性，适用于所有语境；而 “provided” 更正式，常用于法律、合同或书面语中，带有更强的条件约束感，有时隐含‘若不满足则无效’的含义。"
    },
    {
      "word_to_compare": "supplied",
      "analysis": "“Supplied” 是 “provide” 的过去式，强调动作已完成，侧重于物品的交付；而 “provided” 作为动词时，不仅指交付，更强调满足需求的意图和持续性，常用于服务、支持或系统性供给的语境。"
    },
    {
      "word_to_compare": "offered",
      "analysis": "“Offered” (提供) 强调主动提出某物供他人选择，但不保证对方接受；而 “provided” 暗示满足需求的义务性或必要性，常用于已确定给予的语境，语气更确定、更正式。"
    }
  ]
}