{
  "word": "psychiatric",
  "pronunciation": "sī·kē·ə·trik",
  "concise_definition": "adj. 精神的, 精神病学的, 精神科的",
  "forms": {
    "comparative": "more psychiatric",
    "superlative": "most psychiatric"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to the branch of medicine that deals with the diagnosis, treatment, and prevention of mental illnesses and emotional disorders.",
      "explanation_cn": "指与医学中诊断、治疗和预防精神疾病及情绪障碍的分支——精神病学相关的。",
      "example_en": "She works in a psychiatric hospital specializing in mood disorders.",
      "example_cn": "她在一家专门治疗情绪障碍的精神病医院工作。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing treatments, medications, or interventions aimed at addressing psychological or mental health conditions.",
      "explanation_cn": "描述用于治疗心理或精神健康状况的治疗方法、药物或干预手段。",
      "example_en": "The patient was prescribed psychiatric medication to manage his anxiety.",
      "example_cn": "医生为这位患者开了精神科药物以控制其焦虑。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by or associated with mental illness, often used to describe environments, personnel, or systems focused on mental health care.",
      "explanation_cn": "指具有或与精神疾病相关的特征，常用于描述专注于精神健康护理的环境、人员或体系。",
      "example_en": "The school hired a psychiatric consultant to support students with behavioral issues.",
      "example_cn": "该校聘请了一名精神科顾问，以支持有行为问题的学生。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "psychological",
      "analysis": "“Psychological”（心理的）范围更广，涵盖所有与心智、情绪、行为相关的研究和现象，包括正常与异常心理过程，如认知、学习、动机等。而 “psychiatric” 专指医学领域中对精神疾病的临床诊断与治疗，强调生理与药物干预，具有更强的医疗属性。"
    },
    {
      "word_to_compare": "mental",
      "analysis": "“Mental”（精神的）是更通用的术语，泛指与思维、意识、心理状态有关的一切，可用于描述健康或疾病状态（如 mental health, mental fatigue）。而 “psychiatric” 是专业术语，仅用于医学语境，特指由精神科医生处理的疾病和治疗体系，语义更狭窄、更专业。"
    },
    {
      "word_to_compare": "neurological",
      "analysis": "“Neurological”（神经学的）关注的是大脑、脊髓和神经系统的结构与功能异常，如中风、癫痫、帕金森病等器质性病变。而 “psychiatric” 关注的是功能性的精神障碍，如抑郁症、精神分裂症，其病因常涉及心理、社会和生化因素，而非明确的神经解剖损伤。两者常有重叠，但学科基础不同。"
    }
  ]
}