{
  "word": "psychic",
  "pronunciation": "sahy·kik",
  "concise_definition": "adj. 精神的, 心灵的; n. 通灵者, 灵媒",
  "forms": {
    "comparative": "more psychic",
    "superlative": "most psychic"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to the mind or soul rather than to physical matter; describing phenomena believed to originate from mental or spiritual forces beyond normal sensory perception.",
      "explanation_cn": "指与心灵或灵魂相关，而非物质身体的；形容那些被认为源自超越正常感官知觉的心理或精神力量的现象。",
      "example_en": "She has a psychic connection with her twin sister, often knowing what the other is feeling without communication.",
      "example_cn": "她与双胞胎妹妹有心灵感应，常常不通过交流就能知道对方的感受。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Belonging to or characteristic of the realm of the spirit or supernatural; often used to describe abilities that defy scientific explanation.",
      "explanation_cn": "属于或体现精神或超自然领域的；常用于描述那些无法用科学解释的能力。",
      "example_en": "The haunted house was said to have a psychic energy that made visitors feel uneasy.",
      "example_cn": "据说这座闹鬼的房子有一种灵异能量，让访客感到不安。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who claims to have the ability to perceive information hidden from the normal senses, such as future events, thoughts of others, or distant objects, often through extrasensory perception (ESP).",
      "explanation_cn": "指声称拥有感知正常感官无法获取信息能力的人，例如预知未来、读取他人思想或感知远处物体，通常通过超感官知觉（ESP）实现。",
      "example_en": "The psychic predicted the outcome of the election weeks before the voting took place.",
      "example_cn": "这位灵媒在投票开始前几周就预测了选举结果。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mental",
      "analysis": "“Mental”（心理的）指与思维、认知或大脑功能相关，是心理学和神经科学中的中性术语，强调理性或认知过程。而 “psychic” 更偏向超自然、灵性或非科学解释的层面，常带有神秘主义色彩。"
    },
    {
      "word_to_compare": "spiritual",
      "analysis": "“Spiritual”（灵性的）强调与灵魂、信仰、宗教或生命意义相关的体验，通常具有道德或哲学维度。而 “psychic” 更聚焦于感知能力（如预知、读心），不一定涉及信仰体系，有时甚至被视作伪科学。"
    },
    {
      "word_to_compare": "medium",
      "analysis": "“Medium”（灵媒）是 “psychic” 的一个子类，特指作为人类与亡灵或超自然力量之间沟通媒介的人。所有灵媒都是通灵者，但并非所有通灵者都充当媒介。后者更强调能力，前者更强调功能。"
    }
  ]
}