{
  "word": "psychotic",
  "pronunciation": "sī·kot·ik",
  "concise_definition": "adj. 精神病的, 精神错乱的; n. 精神病患者",
  "forms": {
    "comparative": "more psychotic",
    "superlative": "most psychotic",
    "noun_form": "psychotic"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characterized by psychosis, a severe mental disorder in which thought and emotions are so impaired that contact is lost with external reality, often involving delusions or hallucinations.",
      "explanation_cn": "指与精神病（psychosis）相关或具有其特征的，精神病是一种严重的精神障碍，患者思维和情感严重受损，导致与现实世界失去联系，常伴有妄想或幻觉。",
      "example_en": "The patient exhibited psychotic behavior, including hearing voices that weren't there.",
      "example_cn": "这名患者表现出精神病行为，包括听到并不存在的声音。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Extremely irrational, unreasonable, or out of touch with reality, often used informally to describe extreme or bizarre behavior.",
      "explanation_cn": "非正式用法，形容极度非理性、不合理或脱离现实的行为，常用于夸张地描述怪异或极端的行为。",
      "example_en": "It's psychotic to drive at 150 mph on a city street.",
      "example_cn": "在城市街道上开到每小时150英里简直是疯了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who suffers from psychosis; often used in clinical or informal contexts to refer to someone exhibiting severe mental disturbances.",
      "explanation_cn": "指患有精神病的人；常用于临床或非正式语境中，指表现出严重精神异常的人。",
      "example_en": "The hospital has a specialized unit for treating psychotics.",
      "example_cn": "这家医院设有专门治疗精神病患者的科室。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "psychopathic",
      "analysis": "“Psychopathic”（精神病态的）指具有反社会人格障碍（psychopathy）的特征，如缺乏同理心、操纵他人、冷酷无情，但通常不伴随幻觉或妄想。而 “psychotic” 强调与现实脱节的知觉或思维障碍，如幻觉和妄想，两者在临床诊断中完全不同。"
    },
    {
      "word_to_compare": "insane",
      "analysis": "“Insane”（疯癫的）是法律或通俗用语，泛指精神失常，但缺乏明确的医学定义，常带有贬义或污名化色彩。“Psychotic” 是专业医学术语，准确描述特定的精神病性症状，更中性、更精确。"
    },
    {
      "word_to_compare": "delusional",
      "analysis": "“Delusional”（妄想的）特指持有固定、错误且与现实不符的信念（妄想），是精神病的一种症状，但不涵盖幻觉、思维紊乱等其他精神病表现。而 “psychotic” 是更广泛的临床类别，包含妄想、幻觉、思维障碍等多种症状。"
    }
  ]
}