{
  "word": "pull",
  "pronunciation": "pul",
  "concise_definition": "v. 拉, 拖, 吸引; n. 拉力, 影响力, 拉的动作",
  "forms": {
    "third_person_singular": "pulls",
    "past_tense": "pulled",
    "past_participle": "pulled",
    "present_participle": "pulling"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To exert force on something to move it toward oneself or in a specified direction, typically by using the hands or a mechanical device.",
      "explanation_cn": "指通过手或机械装置对某物施加力量，使其向自己或特定方向移动。",
      "example_en": "She pulled the door open with all her strength.",
      "example_cn": "她用尽全力把门拉开。"
    },
    {
      "pos": "verb",
      "explanation_en": "To attract or draw someone or something, often through influence, charm, or incentive.",
      "explanation_cn": "指通过影响力、魅力或激励来吸引某人或某物。",
      "example_en": "The city's low taxes pull businesses from neighboring states.",
      "example_cn": "该市的低税收吸引了邻州的企业。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove or extract something by force or effort, especially from a tight or fixed position.",
      "explanation_cn": "指通过力量或努力将某物从紧固或固定的位置中取出或拔出。",
      "example_en": "He pulled a splinter out of his finger.",
      "example_cn": "他把手指里的刺拔了出来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to move or operate by pulling a lever, cord, or similar mechanism.",
      "explanation_cn": "指通过拉动杠杆、绳索或其他类似装置来使某物移动或运作。",
      "example_en": "Pull the cord to turn on the light.",
      "example_cn": "拉一下绳子来开灯。"
    },
    {
      "pos": "noun",
      "explanation_en": "The force or effort required to move something by pulling; a physical tug or strain.",
      "explanation_cn": "指拉动某物所需的力量或努力；一种物理上的拉力或牵拉感。",
      "example_en": "The truck had a strong pull to get up the steep hill.",
      "example_cn": "这辆卡车需要很大的拉力才能爬上陡坡。"
    },
    {
      "pos": "noun",
      "explanation_en": "Influence or power to persuade or attract people, especially in politics or business.",
      "explanation_cn": "指在政治或商业中影响或吸引他人的能力或权力。",
      "example_en": "He has a lot of pull with the mayor and can get things done quickly.",
      "example_cn": "他和市长关系很好，能迅速办成事情。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "drag",
      "analysis": "“Drag”（拖拽）强调在阻力或摩擦下缓慢、费力地移动物体，常带有负面或沉重的意味，如拖着沉重的行李。而 “pull” 更中性，可指任何方向的拉力，不一定伴随阻力，且常用于有目的的、主动的拉的动作。"
    },
    {
      "word_to_compare": "tug",
      "analysis": "“Tug”（猛拉）是 “pull” 的一种强烈形式，强调突然、短促、用力的拉，常用于描述两人或两物之间的拉扯，如拔河。而 “pull” 是更广泛、更通用的动词，涵盖从轻柔到强力的各种拉的动作。"
    },
    {
      "word_to_compare": "attract",
      "analysis": "“Attract”（吸引）是抽象意义上的吸引，通常用于情感、兴趣或物理力（如磁力），不涉及实际的肢体接触或机械动作。而 “pull” 作为动词时，既可用于物理拉拽，也可隐喻性地表示吸引力，但更强调一种主动的、有方向性的拉力，比 “attract” 更具动作感和力量感。"
    }
  ]
}