{
  "word": "pulling",
  "pronunciation": "poo·ling",
  "concise_definition": "v. 拉, 拖, 吸引; n. 拉力, 拉的动作",
  "forms": {
    "base_form": "pull",
    "third_person_singular": "pulls",
    "past_tense": "pulled",
    "past_participle": "pulled",
    "present_participle": "pulling"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To exert force on something to move it toward oneself or in a specified direction, often by using hands, ropes, or mechanical means.",
      "explanation_cn": "指通过手、绳索或机械装置对某物施加力量，使其向自己或特定方向移动。",
      "example_en": "He was pulling the heavy suitcase across the terminal.",
      "example_cn": "他正拖着沉重的行李箱穿过航站楼。"
    },
    {
      "pos": "verb",
      "explanation_en": "To attract or draw someone’s attention, interest, or loyalty, often through charm, influence, or appeal.",
      "explanation_cn": "指通过魅力、影响力或吸引力来吸引某人的注意力、兴趣或忠诚。",
      "example_en": "The charismatic speaker was pulling in a huge crowd every evening.",
      "example_cn": "这位富有魅力的演讲者每天晚上都在吸引大批观众。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove or extract something by force or effort, such as a tooth, a plug, or a card from a deck.",
      "explanation_cn": "指通过力量或努力将某物拔出或取出，如拔牙、拔插头或从牌堆中抽牌。",
      "example_en": "The dentist had to pull the infected molar.",
      "example_cn": "牙医不得不拔掉那颗感染的臼齿。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or force of pulling; often used in compound terms to describe a specific type of pull, such as a 'pull factor' or 'pull request'.",
      "explanation_cn": "指拉的动作或拉力；常用于复合词中描述特定类型的拉力，如‘吸引力因素’或‘拉取请求’。",
      "example_en": "The pull of the moon causes the tides.",
      "example_cn": "月球的引力导致了潮汐。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "drag",
      "analysis": "“Drag”（拖拽）强调在阻力或摩擦力作用下缓慢、费力地移动物体，常带有负面或沉重的意味，如拖着湿衣服走路。而 “pulling” 更中性，可指任何方向的拉力，不一定伴随阻力，甚至可以是轻柔的吸引（如吸引注意力）。"
    },
    {
      "word_to_compare": "tug",
      "analysis": "“Tug”（猛拉）是 “pulling” 的一种强烈、短暂、突然的形式，通常指短促有力的拉扯，如拉衣角、拔河时的猛拉。而 “pulling” 是更广泛、持续的动作，可轻可重，可短暂可持久。"
    },
    {
      "word_to_compare": "attract",
      "analysis": "“Attract”（吸引）是抽象意义上的“pulling”，专指通过魅力、利益或情感引发兴趣或靠近，如吸引顾客、吸引人才。而 “pulling” 既可以是物理动作，也可以是比喻用法，语义范围更广，且常用于口语或非正式语境中。"
    }
  ]
}