{
  "word": "pulp",
  "pronunciation": "pulp",
  "concise_definition": "n. 纸浆, 果肉, 浆状物; v. 使成浆状",
  "forms": {
    "plural": "pulps"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The soft, moist, fibrous material obtained by crushing or grinding fruit, especially for making juice or jam, or the soft inner part of a plant or vegetable.",
      "explanation_cn": "指通过压碎或研磨水果所得的柔软、湿润、纤维状物质，常用于制作果汁或果酱；也可指植物或蔬菜的柔软内部部分。",
      "example_en": "She squeezed the orange to extract the pulp and make fresh juice.",
      "example_cn": "她挤压橙子以提取果肉，制作新鲜果汁。"
    },
    {
      "pos": "noun",
      "explanation_en": "A soft, moist mass of cellulose fibers used as the raw material for making paper or cardboard.",
      "explanation_cn": "指由纤维素纤维组成的柔软湿润物质，用作制造纸张或纸板的原材料。",
      "example_en": "The paper mill processes wood pulp into high-quality printing paper.",
      "example_cn": "造纸厂将木浆加工成高质量的印刷纸。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of inexpensive, sensationalist literature or media characterized by exaggerated plots, violence, or romance, often associated with magazines or novels from the early 20th century.",
      "explanation_cn": "指一种廉价、耸人听闻的文学或媒体形式，以夸张的情节、暴力或浪漫为特征，常与20世纪初的杂志或小说相关。",
      "example_en": "He was an avid reader of pulp fiction, especially detective stories with daring heroes.",
      "example_cn": "他热衷于阅读通俗小说，尤其是那些拥有大胆英雄的侦探故事。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reduce something to a soft, moist mass by crushing or grinding.",
      "explanation_cn": "指通过压碎或研磨使某物变成柔软湿润的浆状物。",
      "example_en": "The blender pulped the apples into a smooth puree.",
      "example_cn": "搅拌机将苹果搅成了细腻的果泥。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "paste",
      "analysis": "“Paste”（糊状物）通常指更稠密、更均匀、无明显纤维结构的半固体物质，如牙膏或胶水；而 “pulp” 保留了部分纤维结构，质地更粗糙、更天然，常用于描述水果或植物组织。"
    },
    {
      "word_to_compare": "mash",
      "analysis": "“Mash”（捣碎物）多指通过物理压碎使固体变成松散的泥状物，常用于土豆或谷物，强调破碎后的颗粒感；而 “pulp” 更强调物质被充分分解为湿润纤维状，常用于水果或造纸原料，语义更偏向材料的形态而非处理过程。"
    },
    {
      "word_to_compare": "paper",
      "analysis": "“Paper”（纸）是经过脱水、压制和干燥后的最终产品，由纸浆制成；而 “pulp” 是纸的原始原料状态，尚未成型。两者是原材料与成品的关系，而非同义词。"
    }
  ]
}