{
  "word": "pumps",
  "pronunciation": "poomps",
  "concise_definition": "n. 抽水机, 泵; n. (女性) 高跟鞋; v. 抽水, 泵送, 用力推",
  "forms": {
    "singular": "pump",
    "third_person_singular": "pumps",
    "past_tense": "pumped",
    "past_participle": "pumped",
    "present_participle": "pumping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A mechanical device that moves fluids (liquids or gases) by suction or pressure, commonly used in engineering, plumbing, or industrial systems.",
      "explanation_cn": "一种通过吸力或压力来输送流体（液体或气体）的机械设备，常用于工程、管道或工业系统中。",
      "example_en": "The water pump failed during the drought, leaving the village without clean water.",
      "example_cn": "干旱期间水泵故障，村庄失去了清洁水源。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of women's shoe with a closed toe, closed heel, and no fastenings, typically worn for formal or professional occasions.",
      "explanation_cn": "一种女性穿的鞋子，鞋头和鞋跟封闭，无系带，通常用于正式或职业场合。",
      "example_en": "She wore elegant black pumps to the corporate gala.",
      "example_cn": "她穿着优雅的黑色高跟鞋出席公司晚宴。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or force a fluid through a system using a pump, or to operate such a device.",
      "explanation_cn": "使用泵将流体移动或强制通过某个系统，或操作此类设备。",
      "example_en": "The firefighters pumped water from the river to extinguish the fire.",
      "example_cn": "消防员从河里抽水来扑灭大火。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move something up and down or back and forth with force, often repeatedly; to exert pressure or influence aggressively.",
      "explanation_cn": "用力上下或前后移动某物，常指反复动作；也指施加压力或积极影响。",
      "example_en": "He pumped his fist in triumph after winning the race.",
      "example_cn": "他在赢得比赛后兴奋地挥舞着拳头。"
    },
    {
      "pos": "verb",
      "explanation_en": "To question someone persistently or aggressively, especially to extract information.",
      "explanation_cn": "持续或咄咄逼人地盘问某人，尤其是为了获取信息。",
      "example_en": "The detective pumped the witness for details about the suspect’s alibi.",
      "example_cn": "侦探不断盘问目击者，以获取嫌疑人不在场证明的细节。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pump",
      "analysis": "“Pump” 是单数形式，泛指泵或泵送动作；而 “pumps” 作为复数名词时，常特指女性高跟鞋（复数形式是固定用法），或指多个泵设备。作为动词时，两者形式相同，但 “pumps” 是第三人称单数形式，如 “She pumps water daily”。"
    },
    {
      "word_to_compare": "blow",
      "analysis": "“Blow” (吹) 指通过气流推动物体，通常是自然或轻柔的空气运动，如风吹动树叶；而 “pump” 强调通过机械或人为力量主动、持续地输送流体，具有更强的控制性和目的性。"
    },
    {
      "word_to_compare": "heel",
      "analysis": "“Heel” (鞋跟) 是鞋的一部分，而 “pumps” 是一种完整的鞋类，其特征是带有高跟。虽然 “pumps” 包含 heel，但 “heel” 本身不指代整双鞋，也不能用于动词含义。两者在语义范畴上完全不同。"
    },
    {
      "word_to_compare": "inject",
      "analysis": "“Inject” (注射) 通常指将液体（如药物）通过针头快速注入体内，强调瞬间、精准的输入；而 “pump” 是持续、稳定地输送流体，常用于系统性操作，如水泵、油泵，范围更广，不局限于医疗场景。"
    }
  ]
}