{
  "word": "pumped",
  "pronunciation": "poompt",
  "concise_definition": "adj. 兴奋的, 激动的; v. (pump 的过去式和过去分词) 泵送, 打气, 勒索",
  "forms": {
    "base_form": "pump",
    "third_person_singular": "pumps",
    "past_tense": "pumped",
    "past_participle": "pumped",
    "present_participle": "pumping"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Feeling extremely excited, energized, or enthusiastic, often due to anticipation or stimulation (e.g., before an event or performance).",
      "explanation_cn": "感到极度兴奋、充满活力或热情，通常由于期待或刺激（如在活动或表演之前）。",
      "example_en": "I'm so pumped for the concert tonight — the band is amazing!",
      "example_cn": "我今晚的演唱会太激动了——这支乐队太棒了！"
    },
    {
      "pos": "verb",
      "explanation_en": "To force a liquid or gas into or out of something using a mechanical device, such as a pump.",
      "explanation_cn": "使用泵等机械装置将液体或气体压入或抽出某物。",
      "example_en": "They pumped water from the well to irrigate the crops.",
      "example_cn": "他们从井里抽水来灌溉庄稼。"
    },
    {
      "pos": "verb",
      "explanation_en": "To inflate something, especially a tire or balloon, with air.",
      "explanation_cn": "向某物（尤其是轮胎或气球）充气。",
      "example_en": "Can you help me pump up the bike tire? It's completely flat.",
      "example_cn": "你能帮我给自行车胎打打气吗？它完全瘪了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To obtain money or information from someone through persistent pressure or coercion, often in an illegal or unethical way.",
      "explanation_cn": "通过持续施压或胁迫从某人那里获取金钱或信息，常带有非法或不道德性质。",
      "example_en": "The gang tried to pump the shop owner for cash, but he refused.",
      "example_cn": "那帮人试图敲诈店主交钱，但他拒绝了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "excited",
      "analysis": "“Excited” (兴奋的) 是一个更通用、中性的词，用于描述任何程度的激动情绪，适用于正式和非正式语境。而 “pumped” 更口语化，强调一种充满能量、跃跃欲试的高涨情绪，常用于体育、娱乐或个人目标场景，带有更强的积极行动倾向。"
    },
    {
      "word_to_compare": "energized",
      "analysis": "“Energized” (精力充沛的) 强调因外部或内部刺激而获得体力或精神上的活力，常用于健康、工作或运动语境。它更侧重于生理或心理状态的提升，而 “pumped” 更侧重于情绪上的高涨和期待感，常与兴奋、热血相关。"
    },
    {
      "word_to_compare": "inflate",
      "analysis": "“Inflate” (充气) 是一个更正式、技术性的词，专指通过注入气体使物体膨胀，常用于科学、工程或商业语境（如通货膨胀）。而 “pump” 在表示充气时更口语化，且常暗示使用手动或机械泵的动作，具有更具体的物理操作含义。"
    }
  ]
}