{
  "word": "pumping",
  "pronunciation": "poom·ping",
  "concise_definition": "n. 抽水, 泵送; v. (pump 的现在分词) 抽取, 泵送, 摇动, 用力地上下移动",
  "forms": {
    "base_form": "pump",
    "third_person_singular": "pumps",
    "past_tense": "pumped",
    "past_participle": "pumped",
    "present_participle": "pumping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The action or process of using a pump to move a fluid (such as water, oil, or air) from one place to another, often under pressure.",
      "explanation_cn": "指使用泵将液体（如水、油或空气）从一处输送到另一处的动作或过程，通常在压力下进行。",
      "example_en": "The pumping of groundwater has caused the land to sink in some regions.",
      "example_cn": "地下水的抽取导致某些地区地面下沉。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move a liquid or gas by mechanical force, typically using a pump or similar device.",
      "explanation_cn": "指通过机械力（通常使用泵或类似装置）将液体或气体移动。",
      "example_en": "The firefighters were pumping water from the river to extinguish the fire.",
      "example_cn": "消防员正从河里抽水来扑灭大火。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move something up and down or back and forth with force, often repeatedly, as in exercising or signaling.",
      "explanation_cn": "指用力地上下或前后反复移动某物，常用于锻炼或示意。",
      "example_en": "He was pumping his arms as he ran to gain momentum.",
      "example_cn": "他跑步时用力摆动双臂以获得动力。"
    },
    {
      "pos": "verb",
      "explanation_en": "To extract information from someone persistently or aggressively, often through questioning.",
      "explanation_cn": "指通过反复提问等方式，强行从某人那里获取信息。",
      "example_en": "The journalist was pumping the witness for details about the scandal.",
      "example_cn": "记者不断向目击者追问丑闻的细节。"
    },
    {
      "pos": "verb",
      "explanation_en": "To inflate or fill something with air or gas, especially to make it firm or taut.",
      "explanation_cn": "指向某物充气或注入气体，尤指使其变硬或绷紧。",
      "example_en": "She spent ten minutes pumping up the bicycle tire before the ride.",
      "example_cn": "她骑车前花了十分钟给自行车胎打气。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pump",
      "analysis": "“Pump” 是动词或名词的原形，泛指抽吸、泵送或充气的动作或设备；而 “pumping” 是其现在分词或动名词形式，强调动作的持续性或过程性。例如，“He uses a pump”（他使用一个泵）是设备描述，而 “The pumping continues”（抽水持续进行）强调动作的进行。"
    },
    {
      "word_to_compare": "inject",
      "analysis": "“Inject” (注射/注入) 通常指将液体或物质通过针头或管道精确地送入某物内部，常用于医疗或技术语境，强调精准和单向性。而 “pumping” 更强调持续、有动力的输送过程，不一定需要针头，且常用于大规模流体转移。"
    },
    {
      "word_to_compare": "siphon",
      "analysis": "“Siphon” (虹吸) 是利用液位差和大气压自然流动来转移液体，无需机械动力；而 “pumping” 必须依赖外部机械力（如电机或人力）来驱动流体，因此更主动、更耗能。"
    },
    {
      "word_to_compare": "oscillate",
      "analysis": "“Oscillate” (振荡) 指物体在固定点附近来回运动，通常为周期性，如钟摆；而 “pumping” 虽然也包含上下或前后运动，但强调的是施加力量以实现某种功能（如输送液体或增强动力），而非单纯的物理摆动。"
    }
  ]
}