{
  "word": "pump",
  "pronunciation": "pump",
  "concise_definition": "n. 泵, 抽水机; v. 抽取, 泵送, 鼓动, 用力询问",
  "forms": {
    "third_person_singular": "pumps",
    "past_tense": "pumped",
    "past_participle": "pumped",
    "present_participle": "pumping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A mechanical device designed to move fluids (liquids or gases) by suction or pressure, commonly used in plumbing, engineering, and industrial systems.",
      "explanation_cn": "一种通过吸力或压力来输送流体（液体或气体）的机械设备，常用于管道、工程和工业系统中。",
      "example_en": "The well uses a hand pump to draw water from underground.",
      "example_cn": "这口井使用手动泵从地下抽水。"
    },
    {
      "pos": "verb",
      "explanation_en": "To force a fluid through a system using a pump or similar mechanism, often to transfer, circulate, or pressurize it.",
      "explanation_cn": "使用泵或类似装置将流体强制通过系统，通常用于转移、循环或加压。",
      "example_en": "The firefighters pumped water from the river to extinguish the fire.",
      "example_cn": "消防员从河里抽水来扑灭大火。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move something up and down or back and forth with force, especially repeatedly, as in exercising or operating a device.",
      "explanation_cn": "用力上下或前后移动某物，尤其是反复进行，如锻炼或操作设备时。",
      "example_en": "He pumped his arms as he ran to gain more speed.",
      "example_cn": "他跑步时用力摆动双臂以增加速度。"
    },
    {
      "pos": "verb",
      "explanation_en": "To question someone persistently or aggressively in order to extract information, often in a probing or interrogative manner.",
      "explanation_cn": "通过持续或咄咄逼人的方式询问某人，以获取信息，常带有探询或审问的性质。",
      "example_en": "The journalist pumped the witness for details about the accident.",
      "example_cn": "记者不断追问目击者关于事故的细节。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of shoe with a raised heel, typically worn by women, often associated with formal or fashionable attire.",
      "explanation_cn": "一种后跟较高的鞋子，通常由女性穿着，常与正式或时尚服饰搭配。",
      "example_en": "She wore black pumps to the office meeting.",
      "example_cn": "她穿着黑色高跟鞋去参加办公室会议。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "blow",
      "analysis": "“Blow”（吹）强调通过气流推动物体，通常指用嘴或风力产生气流，如吹气球或吹风。而 “pump” 强调通过机械装置施加压力来移动流体，具有更强的系统性和持续性，常用于液体或气体的主动输送。"
    },
    {
      "word_to_compare": "inject",
      "analysis": "“Inject”（注射）指将物质快速、精准地送入某处（如血液、管道），通常是一次性或小量动作，强调精确性和穿透性。而 “pump” 是持续、稳定地输送，常用于大量流体的循环或转移，动作更缓慢但更持久。"
    },
    {
      "word_to_compare": "squeeze",
      "analysis": "“Squeeze”（挤压）指通过外力压缩物体以排出内容物，如挤柠檬或捏牙膏管，依赖物理变形。而 “pump” 是通过机械结构（如活塞或叶轮）产生压力差来移动流体，不依赖物体本身的形变，更系统化、可重复。"
    },
    {
      "word_to_compare": "question",
      "analysis": "“Question”（询问）是中性、通用的词，泛指提出问题以获取信息。而 “pump” 作为动词时带有强烈的主动性、甚至压迫性，暗示反复、密集、有时不择手段地套取信息，语义色彩更负面或紧张。"
    }
  ]
}