{
  "word": "punch",
  "pronunciation": "puhnch",
  "concise_definition": "n. 击打, 击拳, 饮料; v. 击打, 打拳, 打孔",
  "forms": {
    "third_person_singular": "punches",
    "past_tense": "punched",
    "past_participle": "punched",
    "present_participle": "punching"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A forceful blow delivered with the fist, typically in a fight or sport.",
      "explanation_cn": "用拳头施加的有力一击，通常发生在打斗或体育比赛中。",
      "example_en": "The boxer landed a powerful punch to his opponent's jaw.",
      "example_cn": "拳击手一记重拳击中了对手的下巴。"
    },
    {
      "pos": "noun",
      "explanation_en": "A mixed drink, often served at parties, typically containing fruit juice, alcohol, and sometimes soda or spices.",
      "explanation_cn": "一种混合饮料，常在派对上供应，通常含有果汁、酒精，有时还加苏打水或香料。",
      "example_en": "The party featured a tropical punch with rum and pineapple juice.",
      "example_cn": "派对上供应了含有朗姆酒和菠萝汁的热带果味饮料。"
    },
    {
      "pos": "noun",
      "explanation_en": "A tool or device used to make holes in material, such as paper or metal, often with a sharp, shaped edge.",
      "explanation_cn": "一种用于在材料（如纸张或金属）上打孔的工具，通常带有锋利的成型边缘。",
      "example_en": "She used a paper punch to create decorative holes along the edge of the card.",
      "example_cn": "她用打孔器在卡片边缘打出装饰性的孔洞。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strike someone or something forcefully with the fist.",
      "explanation_cn": "用拳头猛烈击打某人或某物。",
      "example_en": "He punched the wall in frustration after losing the game.",
      "example_cn": "比赛失利后，他沮丧地一拳打在墙上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To use a punch tool to create a hole or indentation in a material.",
      "explanation_cn": "使用打孔工具在材料上制造孔洞或凹痕。",
      "example_en": "The machine punches holes in the plastic sheets at regular intervals.",
      "example_cn": "这台机器在塑料板上按固定间隔打孔。"
    },
    {
      "pos": "verb",
      "explanation_en": "To have a strong, sharp, or striking effect, especially in terms of flavor, impact, or expression.",
      "explanation_cn": "指具有强烈、鲜明或引人注目的效果，尤指在味道、影响力或表达方式上。",
      "example_en": "The speech had real punch — it moved the audience to action.",
      "example_cn": "这场演讲极具感染力，激励了听众采取行动。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hit",
      "analysis": "“Hit” (击打) 是一个更通用的词，可指任何形式的打击，包括用工具、身体部位或物体撞击，语义范围更广。而 “punch” 特指用拳头击打，动作更具体、更具攻击性，常用于拳击或肢体冲突语境。"
    },
    {
      "word_to_compare": "drink",
      "analysis": "“Drink” (饮料) 是泛指任何可饮用的液体，而 “punch” 是一种特定类型的混合饮料，通常色彩鲜艳、含酒精、用于社交场合。它强调配方的混合性和社交功能，而 “drink” 无此文化或语义内涵。"
    },
    {
      "word_to_compare": "sting",
      "analysis": "“Sting” (刺痛/强烈影响) 常用于描述一种尖锐、短暂但强烈的感觉，如味道的辛辣或言语的尖锐。它多用于比喻义，强调“令人不适的冲击力”。而 “punch” 在比喻义中更强调“有力、直接、令人印象深刻”的效果，常用于评价演讲、艺术或广告的冲击力，语义更积极或中性。"
    }
  ]
}