{
  "word": "punches",
  "pronunciation": "puhnch·iz",
  "concise_definition": "n. 击打, 出拳, 有力量的言论; v. 打拳, 打击, 打孔",
  "forms": {
    "singular": "punch"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A forceful blow delivered with the fist, typically in boxing or self-defense.",
      "explanation_cn": "用拳头发出的有力一击，通常用于拳击或自卫。",
      "example_en": "The boxer landed a powerful punch to his opponent's jaw.",
      "example_cn": "拳击手一记重拳击中了对手的下巴。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sharp, impactful statement or remark that conveys strong emotion or criticism.",
      "explanation_cn": "一种尖锐、有力的言论，传达强烈的情感或批评。",
      "example_en": "Her speech was full of punch — every line hit hard and left the audience thinking.",
      "example_cn": "她的演讲充满力量——每一句话都掷地有声，让听众深思。"
    },
    {
      "pos": "noun",
      "explanation_en": "A hole made by a punch tool, especially in metal, leather, or paper.",
      "explanation_cn": "用冲压工具在金属、皮革或纸张上打出的孔洞。",
      "example_en": "The document had three punches along the edge for binding in a folder.",
      "example_cn": "这份文件边缘有三个孔，用于装订进文件夹。"
    },
    {
      "pos": "noun",
      "explanation_en": "A mixed drink, typically served at parties, made with fruit juice, alcohol, and sometimes soda or spices.",
      "explanation_cn": "一种混合饮料，通常在派对上供应，由果汁、酒精，有时还加苏打水或香料调制而成。",
      "example_en": "The party featured a tropical punch with rum and pineapple juice.",
      "example_cn": "派对上供应了含有朗姆酒和菠萝汁的热带果酒。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strike someone or something with the fist.",
      "explanation_cn": "用拳头击打某人或某物。",
      "example_en": "He punched the wall in frustration after losing the game.",
      "example_cn": "比赛输掉后，他因沮丧而一拳打在墙上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a hole in something using a punch tool.",
      "explanation_cn": "使用冲压工具在某物上打孔。",
      "example_en": "The secretary punched holes in the papers before filing them.",
      "example_cn": "秘书在归档前给文件打了孔。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "blow",
      "analysis": "“Blow”（打击）是更广泛的术语，泛指任何形式的击打，可以是手、棍棒、物体等造成的，不特指拳头。而 “punch” 专指用拳头击打，动作更精确、更具攻击性。"
    },
    {
      "word_to_compare": "jab",
      "analysis": "“Jab”（刺拳）是拳击中一种快速、短促、直击的出拳，强调速度和精准，常用于试探或干扰；而 “punch” 是更通用的术语，可指任何类型的重拳，包括钩拳、上勾拳等，力量更大、范围更广。"
    },
    {
      "word_to_compare": "stab",
      "analysis": "“Stab”（刺）指用尖锐物体（如刀）穿刺，强调穿透性伤害；而 “punch” 是钝器击打，造成的是震荡或挫伤，两者伤害机制和工具完全不同。"
    },
    {
      "word_to_compare": "drink",
      "analysis": "当 “punch” 作饮料解时，它特指一种混合型甜酒，常含酒精和水果成分；而 “drink” 是泛指任何可饮用的液体，范围更广，无特定成分或场合限制。"
    }
  ]
}