{
  "word": "punjabi",
  "pronunciation": "puhn·jaa·bee",
  "concise_definition": "n. 旁遮普语, 旁遮普人; adj. 旁遮普的",
  "forms": {
    "plural": "Punjabis"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person originating from the Punjab region, which spans parts of northern India and eastern Pakistan, typically identifying with the cultural and linguistic heritage of that area.",
      "explanation_cn": "指源自旁遮普地区（横跨印度北部和巴基斯坦东部）的人，通常认同该地区的文化和语言传统。",
      "example_en": "Many Punjabis in Canada have maintained strong ties to their ancestral homeland.",
      "example_cn": "加拿大的许多旁遮普人仍与他们的祖籍地保持着紧密联系。"
    },
    {
      "pos": "noun",
      "explanation_en": "The Indo-Aryan language spoken by the Punjabi people, written in the Gurmukhi script in India and the Shahmukhi script in Pakistan, and one of the most widely spoken languages in South Asia.",
      "explanation_cn": "旁遮普人所使用的印欧语系语言，在印度使用古木基文书写，在巴基斯坦使用沙穆基文书写，是南亚使用最广泛的语言之一。",
      "example_en": "She learned Punjabi to communicate with her grandparents, who spoke only their native tongue.",
      "example_cn": "她学习旁遮普语，以便与只会说母语的祖父母交流。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to the Punjab region, its people, language, or culture, including its music, cuisine, and traditions.",
      "explanation_cn": "与旁遮普地区、其人民、语言或文化相关的，包括其音乐、美食和传统。",
      "example_en": "Punjabi bhangra music is known for its energetic rhythms and vibrant costumes.",
      "example_cn": "旁遮普的本格拉音乐以其充满活力的节奏和鲜艳的服饰而闻名。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hindi",
      "analysis": "“Hindi”（印地语）是印度的官方语言之一，主要使用天城文书写，主要在印度北部和中部使用。而 “Punjabi” 是另一种独立的印欧语系语言，虽与印地语有相似词汇，但语法、发音和书写系统不同，且主要在旁遮普地区使用。两者虽同属南亚语言，但属于不同语支，不能互换。"
    },
    {
      "word_to_compare": "urdu",
      "analysis": "“Urdu”（乌尔都语）是巴基斯坦的国语，与印地语高度相似，但使用波斯-阿拉伯字母书写，且受波斯和阿拉伯语影响更深。而 “Punjabi” 虽在巴基斯坦部分地区使用，但其语言结构、词汇和文化背景与乌尔都语有显著差异，尤其在民间诗歌和音乐传统上更具独特性。"
    },
    {
      "word_to_compare": "sikh",
      "analysis": "“Sikh”（锡克教徒）指信仰锡克教的人，而 “Punjabi” 指地理和语言上的族群身份。虽然大多数锡克教徒是旁遮普人，但并非所有旁遮普人都是锡克教徒（也有印度教徒和穆斯林旁遮普人），且锡克教徒也可来自其他地区。因此，两者是交叉但不等同的概念：一个是宗教身份，一个是语言/地域身份。"
    }
  ]
}