{
  "word": "Punjab",
  "pronunciation": "poon·jab",
  "concise_definition": "n. 旁遮普（印度和巴基斯坦的地区/省）",
  "forms": {
    "proper_noun": true
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A region in South Asia historically divided between India and Pakistan, known for its rich agricultural land, Sikh religious heritage, and Punjabi language and culture.",
      "explanation_cn": "南亚的一个地区，历史上被划分为印度和巴基斯坦两部分，以肥沃的农业土地、锡克教宗教传统以及旁遮普语和文化而闻名。",
      "example_en": "The Punjab region is the heartland of Sikhism and home to the Golden Temple in Amritsar.",
      "example_cn": "旁遮普地区是锡克教的发源地，阿姆利则的金庙就坐落于此。"
    },
    {
      "pos": "noun",
      "explanation_en": "A province in Pakistan, officially called Punjab Province, which is the most populous and economically significant province in the country.",
      "explanation_cn": "巴基斯坦的一个省，正式名称为旁遮普省，是该国人口最多、经济最重要的省份。",
      "example_en": "Lahore, the capital of Punjab Province in Pakistan, is known for its Mughal architecture and vibrant food scene.",
      "example_cn": "巴基斯坦旁遮普省的首府拉合尔以其莫卧儿建筑和丰富多彩的美食文化而闻名。"
    },
    {
      "pos": "noun",
      "explanation_en": "A state in India, officially called Punjab State, known for its strong agricultural output, Sikh population, and contributions to Indian military and sports.",
      "explanation_cn": "印度的一个邦，正式名称为旁遮普邦，以强大的农业产出、锡克教人口众多以及对印度军事和体育事业的贡献而著称。",
      "example_en": "Many Indian soldiers and Olympic athletes come from the state of Punjab in India.",
      "example_cn": "许多印度士兵和奥运运动员都来自印度的旁遮普邦。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "Haryana",
      "analysis": "“Haryana”（哈里亚纳邦）是印度北部的一个邻近旁遮普邦的州，两者在语言和文化上有相似之处，但哈里亚纳邦以印度教人口为主，而旁遮普邦以锡克教文化为核心。地理上相邻，但宗教与历史背景差异显著。"
    },
    {
      "word_to_compare": "Sindh",
      "analysis": "“Sindh”（信德省）是巴基斯坦南部的一个省份，与旁遮普省相邻，但语言以信德语为主，文化深受伊斯兰苏菲传统影响，与旁遮普的锡克教和农业主导文化形成鲜明对比。"
    },
    {
      "word_to_compare": "Kashmir",
      "analysis": "“Kashmir”（克什米尔）是南亚一个具有争议的地区，横跨印度、巴基斯坦和中国，以山地景观和穆斯林人口为主，其政治地位与旁遮普的稳定行政划分不同。旁遮普是明确的行政区，而克什米尔长期处于主权争议中。"
    }
  ]
}