{
  "word": "punk",
  "pronunciation": "puhngk",
  "concise_definition": "n. 朋克, 朋克音乐, 朋克风格; adj. 朋克的, 叛逆的; v. 使变成朋克风格",
  "forms": {
    "plural": "punks",
    "third_person_singular": "punks",
    "past_tense": "punked",
    "past_participle": "punked",
    "present_participle": "punking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person associated with the punk subculture, characterized by rebellious attitudes, anti-establishment views, and distinctive fashion such as spiked hair, leather jackets, and safety pins.",
      "explanation_cn": "指与朋克亚文化相关的人，以叛逆态度、反主流立场以及独特的服饰为特征，如尖刺发型、皮夹克和安全别针。",
      "example_en": "The punk band played a loud, fast song with raw, angry lyrics.",
      "example_cn": "这支朋克乐队演奏了一首节奏快速、歌词充满原始愤怒的歌曲。"
    },
    {
      "pos": "noun",
      "explanation_en": "A style of music that emerged in the mid-1970s, featuring aggressive guitar riffs, simple chord structures, fast tempos, and politically charged or nihilistic lyrics.",
      "explanation_cn": "指20世纪70年代中期兴起的一种音乐风格，以激烈的吉他 riff、简单的和弦结构、快速节奏以及充满政治意识或虚无主义的歌词为特征。",
      "example_en": "Punk rock revolutionized the music scene by rejecting mainstream polish in favor of raw energy and DIY ethics.",
      "example_cn": "朋克摇滚通过摒弃主流的精致感，转而推崇原始能量和 DIY 精神，彻底改变了音乐界。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characteristic of the punk subculture or its aesthetics, often implying rebellion, crudeness, or nonconformity.",
      "explanation_cn": "与朋克亚文化或其美学相关的，常暗示叛逆、粗犷或非传统。",
      "example_en": "She wore a punk outfit with ripped jeans and a band T-shirt.",
      "example_cn": "她穿着一件朋克风格的服装，搭配破洞牛仔裤和乐队T恤。"
    },
    {
      "pos": "verb",
      "explanation_en": "To modify or style something in a punk manner, often to make it appear rebellious, edgy, or deliberately crude.",
      "explanation_cn": "指以朋克风格改造或装扮某物，通常使其显得叛逆、前卫或故意粗犷。",
      "example_en": "He punked up his old car with spray-painted flames and chains.",
      "example_cn": "他用喷漆画上火焰和链条，把旧车改成了朋克风格。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "goth",
      "analysis": "“Goth”（哥特）虽然也属于反主流亚文化，但更强调黑暗美学、忧郁情绪和维多利亚式服饰，常与宗教象征和神秘主义相关；而 “punk” 更注重愤怒、反叛和 DIY 精神，风格更直接、粗粝，不追求唯美。"
    },
    {
      "word_to_compare": "rebel",
      "analysis": "“Rebel”（反叛者）是一个更广泛的概念，泛指任何反抗权威或规范的人，可以是政治、社会或个人层面的；而 “punk” 是一个特定的文化标签，包含音乐、服饰、态度和生活方式的完整体系，其反叛具有明确的美学和历史背景。"
    },
    {
      "word_to_compare": "hippie",
      "analysis": "“Hippie”（嬉皮士）代表的是60年代追求和平、爱与自然的乌托邦式反文化，强调包容与精神觉醒；而 “punk” 是70年代对社会冷漠和消费主义的激烈反击，强调愤怒、破坏与个体反抗，两者在价值观和表达方式上截然相反。"
    }
  ]
}