{
  "word": "punt",
  "pronunciation": "punt",
  "concise_definition": "v. 踢球, 用脚踢; n. 踢球, 长船, 浮动摊贩",
  "forms": {
    "third_person_singular": "punts",
    "past_tense": "punted",
    "past_participle": "punted",
    "present_participle": "punting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To kick a football (especially in American or Canadian football) by dropping it from the hands and striking it with the foot before it hits the ground, typically to send it as far as possible downfield.",
      "explanation_cn": "在美式或加式橄榄球中，将球从手中放下，在其触地前用脚踢出，通常是为了尽可能远地将球踢向对方场地。",
      "example_en": "The quarterback punted the ball 45 yards to gain field position.",
      "example_cn": "四分卫将球踢出45码，以争取有利的场地位置。"
    },
    {
      "pos": "verb",
      "explanation_en": "To propel a boat by pushing a long pole against the riverbed, especially in shallow waters.",
      "explanation_cn": "用长杆抵住河床推动船只前进，尤其在浅水区域。",
      "example_en": "The guide punted the flat-bottomed boat gently down the river.",
      "example_cn": "向导用长杆轻轻撑着平底船顺流而下。"
    },
    {
      "pos": "noun",
      "explanation_en": "A kick in American or Canadian football, especially one made to send the ball downfield.",
      "explanation_cn": "在美式或加式橄榄球中，指将球踢向对方场地的踢球动作。",
      "example_en": "The team’s punter had an excellent day, averaging 48 yards per punt.",
      "example_cn": "球队的弃踢手表现优异，平均每脚踢出48码。"
    },
    {
      "pos": "noun",
      "explanation_en": "A long, narrow, flat-bottomed boat used for transporting goods or passengers on rivers, especially in Europe.",
      "explanation_cn": "一种细长、平底的船，常用于在河流上运输货物或乘客，尤见于欧洲。",
      "example_en": "We took a punt ride along the River Cam in Cambridge.",
      "example_cn": "我们在剑桥的康河上乘坐了一艘平底船游览。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, mobile stall or vendor, often on a boat, selling goods such as food or souvenirs.",
      "explanation_cn": "一种小型移动摊位，通常设在船上，出售食品或纪念品等商品。",
      "example_en": "The riverbank was lined with colorful punts selling ice cream and handmade crafts.",
      "example_cn": "河岸旁排列着色彩鲜艳的浮动摊贩，售卖冰淇淋和手工制品。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "kick",
      "analysis": "“Kick”（踢）是通用词，泛指用脚击打任何物体，无特定语境限制。而 “punt” 是体育术语，特指橄榄球中在特定时机（如第四档进攻）将球踢向对方半场的战术性踢球，具有规则和策略含义。"
    },
    {
      "word_to_compare": "pole",
      "analysis": "“Pole”（杆）是名词，指工具本身；而 “punt” 作为动词时，指用杆推动船只的动作，强调动作过程而非工具。两者是工具与动作的关系，不能直接互换。"
    },
    {
      "word_to_compare": "launch",
      "analysis": "“Launch”（发射/启动）强调使某物从静止状态开始运动，常用于火箭、船只下水或项目启动。而 “punt” 作为动词时，仅限于用脚踢球或用杆撑船，动作更具体、更局部，不涉及整体启动或释放。"
    }
  ]
}