{
  "word": "puppet",
  "pronunciation": "pup·it",
  "concise_definition": "n. 木偶, 操纵下的傀儡; v. 操纵, 控制",
  "forms": {
    "plural": "puppets",
    "third_person_singular": "puppets",
    "past_tense": "puppeted",
    "past_participle": "puppeted",
    "present_participle": "puppeting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small figure of a person or animal, typically made of cloth, wood, or rubber, that is manipulated by a puppeteer using strings, rods, or hands to perform in a show.",
      "explanation_cn": "一种由木偶师用绳子、木棒或手操作的人或动物小雕像，通常由布、木头或橡胶制成，用于表演戏剧或娱乐节目。",
      "example_en": "The children laughed as the puppet danced on the stage.",
      "example_cn": "孩子们看着舞台上跳舞的木偶，哈哈大笑。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is controlled by another person or group, often acting against their own will or interests, especially in politics or business.",
      "explanation_cn": "指被他人或团体操控的人，常违背自身意愿或利益行事，尤用于政治或商业语境中，形容缺乏自主权的傀儡。",
      "example_en": "The president was seen as a puppet of the military regime.",
      "example_cn": "这位总统被视为军政府的傀儡。"
    },
    {
      "pos": "verb",
      "explanation_en": "To control or manipulate someone, especially in a way that makes them appear to act independently while actually following another's orders.",
      "explanation_cn": "指操控或操纵某人，使其表面上看似自主行动，实则完全听命于他人。",
      "example_en": "The wealthy donor was accused of puppeting the local politician to pass favorable legislation.",
      "example_cn": "这位富有的捐助者被指控操控当地政客，以通过有利的立法。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "marionette",
      "analysis": "“Marionette”（提线木偶）是“puppet”的一种具体类型，特指用多根细线从上方操控的木偶，强调其机械操控方式。而 “puppet” 是更广泛的总称，可包括手偶、布袋偶等，也可用于比喻意义。"
    },
    {
      "word_to_compare": "pawn",
      "analysis": "“Pawn”（棋子/棋盘上的棋子）比喻被他人利用的工具性人物，常用于国际政治或策略语境，强调其无足轻重、可牺牲的属性。而 “puppet” 更强调被直接操控、缺乏自主性，带有更强的贬义和控制感。"
    },
    {
      "word_to_compare": "figurehead",
      "analysis": "“Figurehead”（名义领袖）指一个仅具象征性头衔、无实权的领导人，如名义上的董事长或君主。它强调的是形式上的存在，而非被主动操控。而 “puppet” 暗示了幕后操纵者的存在，且被操控者通常明知或被迫服从。"
    }
  ]
}