{
  "word": "purge",
  "pronunciation": "purj",
  "concise_definition": "v. 清除, 净化, 洗刷; n. 清除, 净化",
  "forms": {
    "third_person_singular": "purges",
    "past_tense": "purged",
    "past_participle": "purged",
    "present_participle": "purging"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To remove unwanted, harmful, or undesirable elements from a group, system, or organization, often forcefully or abruptly, especially political opponents or corrupt individuals.",
      "explanation_cn": "指强行或突然地从群体、系统或组织中清除不受欢迎、有害或不理想的人或事物，尤指政治异己或腐败分子。",
      "example_en": "The dictator ordered a purge of all dissenting voices in the government.",
      "example_cn": "独裁者下令清除政府中所有持不同政见者。"
    },
    {
      "pos": "verb",
      "explanation_en": "To clean or rid something of impurities, contaminants, or excess material, often through a process of flushing or filtering.",
      "explanation_cn": "指通过冲洗、过滤等过程清除某物中的杂质、污染物或多余物质，以达到净化目的。",
      "example_en": "The water treatment plant purges the reservoir of algae and sediment.",
      "example_cn": "水处理厂通过净化过程清除水库中的藻类和沉积物。"
    },
    {
      "pos": "verb",
      "explanation_en": "To eliminate or remove something completely, especially in a ritualistic or symbolic way, such as guilt, sin, or emotional baggage.",
      "explanation_cn": "指彻底消除某物，常带有仪式性或象征性，如清除罪恶、内疚或情感负担。",
      "example_en": "She went on a retreat to purge herself of negative thoughts and past regrets.",
      "example_cn": "她去参加静修，以清除内心的消极想法和过往遗憾。"
    },
    {
      "pos": "noun",
      "explanation_en": "A forced removal or elimination of people or things considered undesirable, especially in a political or institutional context.",
      "explanation_cn": "指在政治或制度背景下，对被认为不受欢迎的人或事物进行的强制性清除行动。",
      "example_en": "The party leadership initiated a purge after the failed coup.",
      "example_cn": "政变失败后，政党领导层发起了大规模清洗。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "remove",
      "analysis": "“Remove” (移除) 是一个中性、通用的词，指将某物从某处拿走，不带有强烈的情感或强制色彩。而 “purge” 暗示了系统性、彻底性甚至暴力性的清除，常用于政治、道德或情感层面的激烈净化。"
    },
    {
      "word_to_compare": "cleanse",
      "analysis": "“Cleanse” (净化) 与 “purge” 在“清除杂质”义项上接近，但 “cleanse” 更常用于道德、精神或宗教语境，带有赎罪或神圣化的意味，语气较温和；而 “purge” 更强调行动的强制性和破坏性，常含政治压迫色彩。"
    },
    {
      "word_to_compare": "expel",
      "analysis": "“Expel” (驱逐) 指将某人或某物从某个地方或组织中正式赶出，如学校开除学生、国家驱逐外交官。它侧重于“外力驱离”，而 “purge” 不仅驱逐，还包含系统性根除、连根拔起的含义，范围更广，后果更严重。"
    }
  ]
}