{
  "word": "purification",
  "pronunciation": "pyoo·ruh·fih·kay·shun",
  "concise_definition": "n. 净化, 提纯, 清洁",
  "forms": {
    "plural": "purifications"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of removing impurities, contaminants, or unwanted elements from a substance, such as water, air, or metal, to make it cleaner or more pure.",
      "explanation_cn": "指从物质（如水、空气或金属）中去除杂质、污染物或不需要的成分，以使其变得更清洁或更纯净的过程。",
      "example_en": "The purification of drinking water is essential for public health.",
      "example_cn": "饮用水的净化对公共健康至关重要。"
    },
    {
      "pos": "noun",
      "explanation_en": "A spiritual or moral process of cleansing oneself from sin, guilt, or negative influences, often through ritual, reflection, or penance.",
      "explanation_cn": "指通过仪式、反思或忏悔等方式，从罪恶、内疚或负面影响中净化自身的精神或道德过程。",
      "example_en": "The monk underwent a period of purification through fasting and meditation.",
      "example_cn": "这位僧人通过禁食和冥想经历了一段净化身心的时期。"
    },
    {
      "pos": "noun",
      "explanation_en": "In chemistry or industry, the act of refining a compound or material to achieve a higher degree of purity for specific applications.",
      "explanation_cn": "在化学或工业中，指通过精炼使化合物或材料达到更高纯度，以满足特定应用需求的过程。",
      "example_en": "The purification of silicon is critical for manufacturing high-efficiency solar panels.",
      "example_cn": "硅的提纯对于制造高效太阳能电池板至关重要。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cleansing",
      "analysis": "“Cleansing” (清洁) 更广泛地指去除污垢、灰尘或表面杂质，常用于身体、皮肤或环境的清洁，语义偏重物理层面。而 “purification” 更强调去除深层或有害的杂质，常用于化学、精神或系统性层面，具有更强的彻底性和专业性。"
    },
    {
      "word_to_compare": "refinement",
      "analysis": "“Refinement” (精炼/优化) 侧重于使某物更精致、更完善，常用于风格、行为或工艺的提升，不一定涉及去除有害物质。而 “purification” 的核心是去除杂质，强调从不纯到纯净的转变，具有明确的净化目标。"
    },
    {
      "word_to_compare": "sterilization",
      "analysis": "“Sterilization” (灭菌) 是一种特定类型的净化，专指通过物理或化学手段彻底杀灭所有微生物，常用于医疗或实验室环境。而 “purification” 的范围更广，可包括过滤、沉淀、蒸馏等非杀菌方式，不一定要求无菌状态。"
    }
  ]
}