{
  "word": "purple",
  "pronunciation": "pur·pl",
  "concise_definition": "n. 紫色, 紫色衣物; adj. 紫色的, 紫色的; n. 紫色的染料; n. 紫色的贵族",
  "forms": {
    "comparative": "purpler",
    "superlative": "purplest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Of a color that is a blend of red and blue, often associated with royalty, luxury, and spirituality due to its historical rarity and costliness.",
      "explanation_cn": "指由红色和蓝色混合而成的颜色，因其历史上稀有且昂贵，常与王室、奢华和灵性相关联。",
      "example_en": "She wore a purple gown to the royal banquet.",
      "example_cn": "她穿着一件紫色长裙参加皇家宴会。"
    },
    {
      "pos": "noun",
      "explanation_en": "The color itself, used to describe objects, clothing, or natural phenomena that exhibit this hue.",
      "explanation_cn": "指这种颜色本身，用于描述呈现该色调的物体、衣物或自然现象。",
      "example_en": "The sunset painted the sky in shades of purple and orange.",
      "example_cn": "日落将天空染成了紫色和橙色的渐变。"
    },
    {
      "pos": "noun",
      "explanation_en": "A dye or pigment derived historically from sea snails, especially the murex, which was extremely valuable in ancient times and reserved for emperors and high-ranking officials.",
      "explanation_cn": "指历史上从海螺（尤其是骨螺）中提取的染料，古代极为珍贵，仅限皇帝和高级官员使用。",
      "example_en": "In ancient Rome, only the emperor could wear garments dyed with true purple.",
      "example_cn": "在古罗马，只有皇帝才能穿着用真紫色染料染制的衣物。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person of high social status or nobility, especially in historical contexts where purple clothing symbolized power and privilege.",
      "explanation_cn": "指在历史上因穿着紫色衣物而象征权力与特权的高贵人物，尤指贵族或统治者。",
      "example_en": "The court was filled with purple, from the king down to his most trusted advisors.",
      "example_cn": "宫廷里满是身着紫袍的贵族，从国王到最信任的顾问皆是如此。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "violet",
      "analysis": "“Violet”（紫罗兰色）是比“purple”更偏蓝的色调，通常更明亮、更冷，常用于描述花朵或光谱中的颜色。而“purple”更偏红，更饱和，常用于日常语言和象征意义中，如王权或奢华。两者在色轮上相邻，但文化联想不同。"
    },
    {
      "word_to_compare": "mauve",
      "analysis": "“Mauve”（淡紫罗兰色）是一种浅淡、柔和的紫色，带有灰或粉的色调，常用于时尚和装饰领域，给人温柔、复古的感觉。而“purple”更浓烈、更鲜明，象征力量与庄严，两者在明度和情感强度上有显著差异。"
    },
    {
      "word_to_compare": "indigo",
      "analysis": "“Indigo”（靛蓝）是一种深蓝偏紫的颜色，接近黑色，常用于描述夜空或染料，其文化意义多与神秘、冥想相关。而“purple”更强调红蓝混合的视觉效果和历史上的贵族象征，不具有“indigo”那种深沉的暗调感。"
    }
  ]
}