{
  "word": "pushing",
  "pronunciation": "poo·shing",
  "concise_definition": "adj. 激进的, 前沿的, 有进取心的; v. 推动, 推挤, 催促 (现在分词)",
  "forms": {
    "base_form": "push",
    "third_person_singular": "pushes",
    "past_tense": "pushed",
    "past_participle": "pushed",
    "gerund": "pushing"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing something that is at the forefront of innovation, challenging traditional norms, or aggressively advancing boundaries in a field such as technology, art, or thought.",
      "explanation_cn": "形容某事物处于创新前沿，挑战传统规范，或在科技、艺术或思想等领域积极突破界限。",
      "example_en": "Her pushing-edge design redefined modern architecture.",
      "example_cn": "她的前沿设计重新定义了现代建筑。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterizing a person or approach that is forceful, determined, and insistent in pursuing goals or demanding change.",
      "explanation_cn": "形容一个人或方法在追求目标或推动变革时具有强势、坚定和不容置疑的特质。",
      "example_en": "He’s a pushing manager who never accepts mediocrity.",
      "example_cn": "他是一个极具进取心的经理，从不接受平庸。"
    },
    {
      "pos": "verb",
      "explanation_en": "To apply physical force to move something away from oneself or in a particular direction.",
      "explanation_cn": "施加物理力量，使某物远离自己或朝特定方向移动。",
      "example_en": "She was pushing the heavy cart through the doorway.",
      "example_cn": "她正推着沉重的手推车穿过门道。"
    },
    {
      "pos": "verb",
      "explanation_en": "To urge or pressure someone to act, improve, or make progress, often with persistence or intensity.",
      "explanation_cn": "以持续或强烈的方式敦促或施压某人采取行动、改进或取得进展。",
      "example_en": "Her coach was pushing her to train harder for the Olympics.",
      "example_cn": "她的教练敦促她为奥运会更加刻苦训练。"
    },
    {
      "pos": "verb",
      "explanation_en": "To promote or advocate for something aggressively, especially in business or politics.",
      "explanation_cn": "积极推广或倡导某事物，尤其在商业或政治领域。",
      "example_en": "The company is pushing a new line of eco-friendly products.",
      "example_cn": "该公司正在大力推广一系列环保新产品。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "driving",
      "analysis": "“Driving” (推动的) 与 “pushing” 在表示激励或促使时非常接近，但 “driving” 更强调内在动力或主导力量，常用于描述一种持续、主导性的驱动力（如 driving force）；而 “pushing” 更侧重外在施压或主动推进，带有更强的干预性和紧迫感。"
    },
    {
      "word_to_compare": "advancing",
      "analysis": "“Advancing” (推进的) 强调向前发展、进步，通常带有积极、建设性的含义，如技术进步或知识扩展；而 “pushing” 更强调突破障碍、挑战极限，有时甚至带有对抗性或激进色彩，如 pushing boundaries。"
    },
    {
      "word_to_compare": "pressing",
      "analysis": "“Pressing” (紧迫的) 侧重于时间或情境上的紧迫性，常用于描述需要立即处理的压力（如 pressing issue）；而 “pushing” 更强调主动施加力量或持续推动，不一定有时间限制，但更具主动性与侵略性。"
    }
  ]
}