{
  "word": "push",
  "pronunciation": "pooch",
  "concise_definition": "v. 推, 推动, 勉强推进; n. 推, 推动, 努力",
  "forms": {
    "third_person_singular": "pushes",
    "past_tense": "pushed",
    "past_participle": "pushed",
    "present_participle": "pushing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To apply force to an object in order to move it away from oneself, typically with the hands or body.",
      "explanation_cn": "指用手或身体对物体施加力量，使其远离自己。",
      "example_en": "He pushed the door open and stepped inside.",
      "example_cn": "他推开门，走了进去。"
    },
    {
      "pos": "verb",
      "explanation_en": "To urge or pressure someone to do something, often persistently or forcefully, especially to achieve a goal or meet a deadline.",
      "explanation_cn": "指持续或强烈地敦促某人做某事，通常是为了达成目标或满足截止日期。",
      "example_en": "The manager pushed the team to finish the project before the holiday.",
      "example_cn": "经理敦促团队在假期前完成项目。"
    },
    {
      "pos": "verb",
      "explanation_en": "To promote or advocate for something aggressively, such as a product, idea, or political agenda.",
      "explanation_cn": "指积极地推广或倡导某事物，如产品、理念或政治议程。",
      "example_en": "The company is pushing its new line of eco-friendly products.",
      "example_cn": "该公司正在大力推广其新的环保产品系列。"
    },
    {
      "pos": "noun",
      "explanation_en": "A forceful effort or attempt to achieve a goal, often in the face of resistance or difficulty.",
      "explanation_cn": "指为达成目标而做出的有力尝试，常在面临阻力或困难时进行。",
      "example_en": "The final push before the election brought out record voter turnout.",
      "example_cn": "选举前的最后冲刺带来了创纪录的投票率。"
    },
    {
      "pos": "noun",
      "explanation_en": "A physical act of pressing or shoving something, often with the hand or body.",
      "explanation_cn": "指用手或身体进行的推压或推搡动作。",
      "example_en": "She gave the cart a gentle push to get it moving.",
      "example_cn": "她轻轻推了一下手推车，让它动起来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "shove",
      "analysis": "“Shove” (猛推) 比 “push” 更强调突然、粗暴或用力的动作，常带有不礼貌或强制的意味。例如，推搡人群。而 “push” 更中性，可轻可重，适用于日常或正式语境。"
    },
    {
      "word_to_compare": "encourage",
      "analysis": "“Encourage” (鼓励) 指通过支持、激励或正面引导促使某人行动，语气温和、积极。而 “push” 常带有施压、强迫或紧迫感，可能引起反感。例如，鼓励孩子学习 vs. 推孩子赶作业。"
    },
    {
      "word_to_compare": "propel",
      "analysis": "“Propel” (推动) 是更正式或技术性的词汇，常用于描述由某种动力或力量驱动的运动，如火箭推进、水流推动船只。它强调外力的持续作用，而 “push” 更多指直接的、接触性的物理动作。"
    }
  ]
}