{
  "word": "pyramid",
  "pronunciation": "pīr·uh·mid",
  "concise_definition": "n. 金字塔, 锥形结构, 层级体系",
  "forms": {
    "plural": "pyramids"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A monumental structure with a square or triangular base and sloping sides that meet at a point, typically built in ancient Egypt as a tomb for pharaohs.",
      "explanation_cn": "一种底座为方形或三角形、侧面倾斜并汇聚于顶点的宏伟建筑，通常为古埃及法老建造作为陵墓。",
      "example_en": "The Great Pyramid of Giza is one of the Seven Wonders of the Ancient World.",
      "example_cn": "吉萨大金字塔是古代世界七大奇迹之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A hierarchical structure or system in which each level is smaller than the one below it, often used to describe organizations, social classes, or economic systems.",
      "explanation_cn": "一种层级结构，每一层都比其下方的层级更小，常用于描述组织、社会阶层或经济体系。",
      "example_en": "The company operates on a pyramid structure, with the CEO at the top and entry-level employees at the base.",
      "example_cn": "该公司采用金字塔式结构，首席执行官位于顶层，基层员工位于底层。"
    },
    {
      "pos": "noun",
      "explanation_en": "A shape or arrangement resembling a pyramid, such as a stack of objects or a geometric form with a polygonal base and triangular sides converging at a vertex.",
      "explanation_cn": "一种形状或排列类似于金字塔的结构，例如物品堆叠或具有多边形底面、三角形侧面汇聚于顶点的几何体。",
      "example_en": "The children built a pyramid of cans at the food drive.",
      "example_cn": "孩子们在食品捐赠活动中堆了一个罐头金字塔。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "prism",
      "analysis": "“Prism”（棱柱）是一种两端为相同多边形、侧面为矩形的几何体，光线通过时会发生折射；而 “pyramid” 的侧面是三角形并汇聚于一点，结构上呈锥形。两者虽均为多面体，但形态和功能截然不同。"
    },
    {
      "word_to_compare": "cone",
      "analysis": "“Cone”（圆锥）是底面为圆形、侧面平滑汇聚于顶点的三维形状，而 “pyramid” 的底面为多边形（如方形或三角形），侧面为平面三角形。两者都具有顶点，但底面形状和表面构成不同。"
    },
    {
      "word_to_compare": "hierarchy",
      "analysis": "“Hierarchy”（等级制度）是抽象概念，泛指任何按等级排列的系统，如军队或政府；而 “pyramid” 作为比喻时，特指以图形化层级结构呈现的等级体系，强调视觉上的上下递减形态，更具象化。"
    }
  ]
}