{
  "word": "pyramids",
  "pronunciation": "pīr·uh·mids",
  "concise_definition": "n. 金字塔, 锥形建筑群",
  "forms": {
    "singular": "pyramid"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A massive stone structure with a square or triangular base and four triangular sides that meet at a point, typically built as a tomb for ancient Egyptian pharaohs.",
      "explanation_cn": "一种由巨石建造的大型结构，具有方形或三角形底座和四个三角形侧面，顶部汇聚于一点，通常作为古埃及法老的陵墓。",
      "example_en": "The Great Pyramid of Giza is one of the Seven Wonders of the Ancient World.",
      "example_cn": "吉萨大金字塔是古代世界七大奇迹之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "Any structure or arrangement that resembles a pyramid in shape, such as a social hierarchy, organizational chart, or stack of objects.",
      "explanation_cn": "任何在形状上类似金字塔的结构或排列，例如社会等级制度、组织架构图或堆叠的物体。",
      "example_en": "The company operates under a pyramid structure, with the CEO at the top.",
      "example_cn": "这家公司采用金字塔式的结构，首席执行官位于顶端。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of similar structures, especially those found in Mesoamerica, built by ancient civilizations such as the Maya and Aztec for religious or ceremonial purposes.",
      "explanation_cn": "一组类似的建筑，尤其指中美洲古代文明（如玛雅人和阿兹特克人）为宗教或仪式目的建造的金字塔群。",
      "example_en": "The Mayan pyramids at Chichen Itza were used for astronomical observations and rituals.",
      "example_cn": "奇琴伊察的玛雅金字塔曾用于天文观测和宗教仪式。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "monument",
      "analysis": "“Monument”（纪念碑/纪念物）泛指任何为纪念重要人物或事件而建造的结构，形式多样，如雕像、方尖碑或拱门，不一定具有金字塔形状。而 “pyramid” 特指具有特定几何形态的建筑，且常与古文明的丧葬或宗教功能相关。"
    },
    {
      "word_to_compare": "mound",
      "analysis": "“Mound”（土丘）指自然形成或人工堆砌的隆起土堆，形状通常圆润、低矮，缺乏金字塔的精确几何结构和宏伟规模。金字塔是高度规划的石构建筑，而土丘多为简易堆筑，常用于墓葬但无复杂内部结构。"
    },
    {
      "word_to_compare": "ziggurat",
      "analysis": "“Ziggurat”（阶梯状神庙）是美索不达米亚文明特有的多层平台式宗教建筑，顶部有神殿，外形呈阶梯状而非光滑的三角形斜面。虽然与金字塔同为宗教性高台建筑，但金字塔是实心或仅含墓室的锥体，而齐古拉特是中空、有台阶可攀登的多层结构。"
    }
  ]
}