{
  "word": "quad",
  "pronunciation": "kwod",
  "concise_definition": "n. 四边形场地, 四人一组, 四缸发动机, 四轮摩托车",
  "forms": {
    "plural": "quads"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A square or rectangular open space, especially one surrounded by buildings, commonly found in universities, colleges, or institutional campuses.",
      "explanation_cn": "指一个方形或矩形的开放区域，通常被建筑物环绕，常见于大学、学院或机构校园中。",
      "example_en": "Students gathered on the quad to enjoy the spring sunshine.",
      "example_cn": "学生们聚集在校园广场上享受春日的阳光。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of four people or things considered together, especially in sports or music contexts.",
      "explanation_cn": "指四个个体或事物组成的团体，尤其用于体育或音乐语境中。",
      "example_en": "The jazz quartet performed as a quad of saxophones, piano, bass, and drums.",
      "example_cn": "这支爵士四重奏由萨克斯、钢琴、贝斯和鼓组成，精彩演绎了乐曲。"
    },
    {
      "pos": "noun",
      "explanation_en": "A four-cylinder engine, especially in automotive or motorcycle contexts.",
      "explanation_cn": "指四缸发动机，尤其用于汽车或摩托车领域。",
      "example_en": "The motorcycle features a powerful quad engine for better acceleration.",
      "example_cn": "这辆摩托车配备强劲的四缸发动机，以获得更好的加速性能。"
    },
    {
      "pos": "noun",
      "explanation_en": "A four-wheeled all-terrain vehicle (ATV), often used for off-road recreation or utility work.",
      "explanation_cn": "指一种四轮全地形车（ATV），常用于越野娱乐或作业用途。",
      "example_en": "He rented a quad to explore the desert trails during his vacation.",
      "example_cn": "他在度假期间租了一辆四轮摩托来探索沙漠小径。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "quadrangle",
      "analysis": "“Quadrangle”（四边形场地）是“quad”的正式或学术用语，专指建筑围合的四边形庭院，多用于建筑学或正式描述；而 “quad” 是其口语化、简化的形式，更常用于日常校园语境中，语义范围更广。"
    },
    {
      "word_to_compare": "quartet",
      "analysis": "“Quartet”（四重奏/四人组）特指由四名音乐家或表演者组成的艺术团体，强调艺术协作；而 “quad” 在此语境下更泛化，可指任何四人组合，不限于艺术领域，且常用于非正式场合。"
    },
    {
      "word_to_compare": "ATV",
      "analysis": "“ATV”（全地形车）是技术性术语，泛指所有用于非铺装路面的多轮车辆，包括三轮、四轮等；而 “quad” 特指四轮 ATV，是其子类，口语中常作为同义词使用，但更强调轮数特征。"
    }
  ]
}