{
  "word": "quake",
  "pronunciation": "kwāk",
  "concise_definition": "v. 颤抖, 震动; n. 地震, 颤抖",
  "forms": {
    "third_person_singular": "quakes",
    "past_tense": "quaked",
    "past_participle": "quaked",
    "present_participle": "quaking"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To shake or tremble involuntarily, often due to fear, cold, excitement, or physical force.",
      "explanation_cn": "指因恐惧、寒冷、兴奋或外力作用而不由自主地颤抖或震动。",
      "example_en": "Her hands quaked as she opened the letter from the hospital.",
      "example_cn": "她打开医院寄来的信时，双手颤抖不已。"
    },
    {
      "pos": "verb",
      "explanation_en": "To shake or vibrate as a result of seismic activity, especially when referring to the ground or buildings.",
      "explanation_cn": "指因地震活动而使地面或建筑物发生震动或摇晃。",
      "example_en": "The whole city quaked during the magnitude 7.0 earthquake.",
      "example_cn": "在7.0级地震发生时，整个城市都在摇晃。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden and violent shaking of the ground caused by movements in the earth's crust, also known as an earthquake.",
      "explanation_cn": "指由地壳运动引起的地面突然剧烈震动，即地震。",
      "example_en": "The quake destroyed several buildings and left thousands homeless.",
      "example_cn": "这场地震摧毁了多座建筑物，使数千人无家可归。"
    },
    {
      "pos": "noun",
      "explanation_en": "A brief, involuntary shaking or tremor, often used metaphorically to describe emotional or physical instability.",
      "explanation_cn": "指短暂的、不由自主的颤抖，常用于比喻情绪或身体的不稳定状态。",
      "example_en": "There was a quake in his voice as he spoke about his lost child.",
      "example_cn": "当他谈到失去的孩子时，声音中带着一丝颤抖。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tremble",
      "analysis": "“Tremble” (颤抖) 更常用于描述因情绪（如恐惧、激动）或寒冷引起的细微、持续的抖动，多用于人或生物体，语气较柔和。而 “quake” 语气更强，既可以形容剧烈的身体颤抖，也可指大地的剧烈震动，更具冲击力。"
    },
    {
      "word_to_compare": "shiver",
      "analysis": "“Shiver” (战栗) 通常特指因寒冷或恐惧引起的短促、重复性颤抖，多用于生理反应，语义范围较窄。而 “quake” 不仅可指寒冷引起的颤抖，更广泛用于地震或强烈情绪引发的剧烈震动，适用范围更广。"
    },
    {
      "word_to_compare": "earthquake",
      "analysis": "“Earthquake” (地震) 是 “quake” 作为名词时的同义词，但 “earthquake” 更正式、更具体，专指地壳运动引发的自然灾害。而 “quake” 作为名词时更口语化，也可用于比喻性语境（如情感上的震动），使用更灵活。"
    }
  ]
}