{
  "word": "quarry",
  "pronunciation": "kwor·ree",
  "concise_definition": "n. 采石场, 猎物; v. 采石, 追猎",
  "forms": {
    "plural": "quarries",
    "third_person_singular": "quarries",
    "past_tense": "quarried",
    "past_participle": "quarried",
    "present_participle": "quarrying"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An open pit or excavation from which stone, sand, or other materials are extracted for construction or industrial use.",
      "explanation_cn": "指为开采石料、沙子或其他建筑材料而开凿的露天采石坑或采掘场。",
      "example_en": "The ancient temple was built with limestone quarried from a nearby hillside.",
      "example_cn": "这座古庙是用附近山坡上采石场开采的石灰岩建造的。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or animal that is being hunted or pursued, often in a persistent or determined way.",
      "explanation_cn": "指被追捕或追猎的人或动物，常带有持续、执着追击的意味。",
      "example_en": "The detective had been closing in on his quarry for weeks.",
      "example_cn": "这位侦探已经追踪他的目标长达数周。"
    },
    {
      "pos": "verb",
      "explanation_en": "To extract stone, sand, or other materials from a quarry or open pit.",
      "explanation_cn": "指从采石场或露天坑中开采石料、沙子或其他材料。",
      "example_en": "The company quarries granite to supply building projects across the region.",
      "example_cn": "该公司开采花岗岩，为整个地区的建筑项目提供材料。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pursue or hunt someone or something persistently, often with determination or intensity.",
      "explanation_cn": "指坚持不懈地追捕或追踪某人或某物，常带有强烈的决心或紧迫感。",
      "example_en": "The police have been quarrying the suspect since the robbery.",
      "example_cn": "自抢劫案发生以来，警方一直在追捕这名嫌疑人。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mine",
      "analysis": "“Mine” (采矿) 通常指在地下或封闭环境中开采矿物（如煤、金属），强调地下作业；而 “quarry” 专指露天采石，主要针对石材、沙石等，强调地表开挖。两者虽都涉及资源开采，但作业方式和材料类型不同。"
    },
    {
      "word_to_compare": "prey",
      "analysis": "“Prey” (猎物) 是名词，指被掠食者捕食的动物，强调生物链中的被动角色；而 “quarry” 作为名词时，更广泛地指任何被追捕的对象，包括人类、罪犯或目标，常用于侦探、军事或比喻语境，带有更强的主动追踪意味。"
    },
    {
      "word_to_compare": "hunt",
      "analysis": "“Hunt” (狩猎) 是一个通用动词，泛指追捕动物或寻找某物，可包含休闲、生存或战术目的；而 “quarry” 作为动词时，语气更正式、更强调持续性和目标的明确性，常用于文学或新闻语境中，带有更强的执着与追踪色彩。"
    }
  ]
}