{
  "word": "quarter",
  "pronunciation": "kwawr·tər",
  "concise_definition": "n. 四分之一, 季度, 区域, 一角硬币; v. 给予住宿, 使驻扎",
  "forms": {
    "plural": "quarters"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "One of four equal parts into which something is divided; a fourth part.",
      "explanation_cn": "指某物被均分为四部分中的每一部分，即四分之一。",
      "example_en": "She ate a quarter of the pizza and saved the rest for later.",
      "example_cn": "她吃了四分之一的披萨，把剩下的留到以后吃。"
    },
    {
      "pos": "noun",
      "explanation_en": "A period of three months, especially as a division of the year for financial or business reporting.",
      "explanation_cn": "指一年中三个月的时段，尤指用于财务或商业报告的季度。",
      "example_en": "The company reported a 15% increase in profits for the second quarter.",
      "example_cn": "该公司报告第二季度利润增长了15%。"
    },
    {
      "pos": "noun",
      "explanation_en": "A distinct district or neighborhood within a city, often characterized by a particular social, cultural, or economic identity.",
      "explanation_cn": "指城市中具有特定社会、文化或经济特征的独立区域或街区。",
      "example_en": "The historic quarter of the city is filled with cobblestone streets and old churches.",
      "example_cn": "这座城市的古城区布满了鹅卵石街道和古老的教堂。"
    },
    {
      "pos": "noun",
      "explanation_en": "A coin worth twenty-five cents in the United States and Canada.",
      "explanation_cn": "指美国和加拿大价值二十五美分的硬币。",
      "example_en": "He paid for the soda with three quarters and a dime.",
      "example_cn": "他用三枚二十五美分硬币和一枚十美分硬币买了这罐汽水。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provide lodging or accommodation, especially for soldiers or troops.",
      "explanation_cn": "指为士兵或部队提供住宿或驻扎场所。",
      "example_en": "The town was required to quarter British soldiers during the colonial period.",
      "example_cn": "在殖民时期，这个城镇必须为英国士兵提供住宿。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fourth",
      "analysis": "“Fourth” (第四) 是一个序数词或分数词，仅表示数量上的四分之一，不涉及具体语境。而 “quarter” 不仅可表示四分之一，还可指时间单位（季度）、地理区域或货币单位，语义更丰富、更具体。"
    },
    {
      "word_to_compare": "section",
      "analysis": "“Section” (部分) 是一个更宽泛的词，指任何被划分出的部分，不一定是均等的四份。而 “quarter” 特指四等分之一，具有明确的数学比例含义。在描述区域时，“section” 可能是任意划分，而 “quarter” 常带有文化或历史形成的区域含义。"
    },
    {
      "word_to_compare": "season",
      "analysis": "“Season” (季节) 指自然气候划分的春、夏、秋、冬，每个季节约三个月，与 “quarter” 在时间长度上相似，但 “quarter” 是人为的财务或行政划分，与自然节律无关。例如，财年第四季度可能在冬季，也可能在夏季，取决于公司政策。"
    }
  ]
}