{
  "word": "quarters",
  "pronunciation": "kwawr·tərz",
  "concise_definition": "n. 住所, 营房, 季度, 四分之一",
  "forms": {
    "singular": "quarter"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A place of residence, especially for military personnel, officials, or groups of people living together under organized conditions.",
      "explanation_cn": "指居住的地方，尤指军人、官员或集体生活人员的住所或营房。",
      "example_en": "The soldiers were assigned to new quarters near the base.",
      "example_cn": "士兵们被分配到了基地附近的新营房。"
    },
    {
      "pos": "noun",
      "explanation_en": "One of four equal parts into which something is divided, especially in time (e.g., a fiscal or calendar quarter).",
      "explanation_cn": "指某事物被均分为四部分中的一部分，尤指时间上的季度（如财政季度或日历季度）。",
      "example_en": "The company reported its profits for the first quarter of the year.",
      "example_cn": "该公司公布了今年第一季度的利润。"
    },
    {
      "pos": "noun",
      "explanation_en": "A unit of measurement equal to one-fourth of a gallon (in the US) or one-fourth of a pound (in weight), commonly used in commerce or cooking.",
      "explanation_cn": "一种计量单位，等于一加仑的四分之一（美国）或一磅的四分之一（重量），常用于商业或烹饪。",
      "example_en": "She bought a quarter of beef for the winter.",
      "example_cn": "她为过冬买了一四分之一头牛的牛肉。"
    },
    {
      "pos": "noun",
      "explanation_en": "A district or section of a town or city, often with a distinct character or population.",
      "explanation_cn": "指城镇或城市中的一个区域或地段，通常具有独特的特征或人口构成。",
      "example_en": "The old quarters of the city are filled with historic buildings and narrow alleys.",
      "example_cn": "城市的旧城区布满了历史建筑和狭窄的小巷。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "area",
      "analysis": "“Area” (区域) 是一个更宽泛的地理术语，泛指任何有界限的空间，不强调内部结构或功能。而 “quarters” 通常指有特定用途（如居住、军事）或文化特征的区域，更具功能性或社会性。"
    },
    {
      "word_to_compare": "section",
      "analysis": "“Section” (部分) 指整体中被划分出的任意一部分，用途广泛，可指书本、人群、时间等。而 “quarters” 在指时间或空间时，特指四等分之一，具有固定比例和语境限制，如季度或营房。"
    },
    {
      "word_to_compare": "residence",
      "analysis": "“Residence” (住所) 是一个中性、正式的词，泛指人居住的地方，不包含组织性或集体性含义。而 “quarters” 常暗示集体居住、官方分配或军事背景，带有制度性色彩。"
    },
    {
      "word_to_compare": "portion",
      "analysis": "“Portion” (份额) 指任意比例的一部分，强调数量分配，不一定是四分之一。而 “quarter” 严格等于 1/4，具有数学精确性，尤其在时间、货币或计量语境中不可替代。"
    }
  ]
}