{
  "word": "queer",
  "pronunciation": "kweer",
  "concise_definition": "adj. 古怪的, 反常的; n. 同性恋者 (贬义或 reclaimed 用法)",
  "forms": {
    "comparative": "queerer",
    "superlative": "queerest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Strange, odd, or unconventional in a way that deviates from what is considered normal or expected, often with a sense of mild disapproval or curiosity.",
      "explanation_cn": "指与常规或预期不符的奇怪、古怪或反常行为或事物，常带有轻微的贬义或好奇的语气。",
      "example_en": "There was a queer silence in the room after he made that comment.",
      "example_cn": "他说完那句话后，房间里出现了一种奇怪的沉默。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used as an umbrella term within LGBTQ+ communities to describe sexual orientations, gender identities, or expressions that fall outside traditional norms — often reclaimed as a positive or empowering label.",
      "explanation_cn": "在 LGBTQ+ 社群中作为统称术语，指不符合传统规范的性取向、性别认同或表达方式，现常被重新赋予积极或赋权的含义。",
      "example_en": "She identifies as queer and is active in advocating for non-binary rights.",
      "example_cn": "她自认为是酷儿，并积极参与非二元性别权利的倡导。"
    },
    {
      "pos": "noun",
      "explanation_en": "A historically derogatory term for a homosexual person, now sometimes reclaimed by individuals within the LGBTQ+ community as a self-identifying label.",
      "explanation_cn": "历史上用于指代同性恋者的贬义词，如今部分 LGBTQ+ 社群成员将其作为自我认同的标签加以重新使用。",
      "example_en": "The activist group reclaimed the word 'queer' to challenge societal stigma.",
      "example_cn": "该活动团体重新使用了'酷儿'一词，以挑战社会的污名化。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "strange",
      "analysis": "“Strange” (奇怪的) 是一个中性词，仅描述不熟悉或难以理解的事物，不带有社会规范的评判色彩。而 “queer” 不仅指异常，还隐含对社会规范的偏离，尤其在当代语境中带有政治与身份认同的维度。"
    },
    {
      "word_to_compare": "odd",
      "analysis": "“Odd” (古怪的) 通常用于描述轻微的、无害的异常，语气较轻，常用于日常口语。而 “queer” 在传统用法中更具贬义，但在现代语境中可承载更深刻的文化与身份意义，语义范围更广、更复杂。"
    },
    {
      "word_to_compare": "gay",
      "analysis": "“Gay” (同性恋的) 通常特指男同性恋者或泛指同性恋群体，语义较明确且多为中性或正面。而 “queer” 是一个更宽泛的包容性术语，涵盖性取向、性别认同和表达的多样性，且因历史污名化而更具政治张力与自我定义的特性。"
    }
  ]
}