{
  "word": "queens",
  "pronunciation": "kweenz",
  "concise_definition": "n. 女王, 王后, 后妃, 国王的妻子",
  "forms": {
    "singular": "queen"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The female monarch who rules a country in her own right, holding supreme authority over a kingdom or empire.",
      "explanation_cn": "指以自身名义统治国家的女性君主，拥有对王国或帝国的最高权力。",
      "example_en": "Queen Elizabeth II reigned for over 70 years, becoming the longest-serving British monarch.",
      "example_cn": "伊丽莎白二世女王统治了七十多年，成为英国历史上在位时间最长的君主。"
    },
    {
      "pos": "noun",
      "explanation_en": "The wife of a king, who holds a royal title and status but typically does not rule in her own right.",
      "explanation_cn": "指国王的妻子，拥有王室头衔和地位，但通常不以自身名义统治国家。",
      "example_en": "Queen Camilla is the queen consort of King Charles III.",
      "example_cn": "卡米拉王妃是查尔斯三世国王的王后。"
    },
    {
      "pos": "noun",
      "explanation_en": "A female figure of high status, influence, or dominance in a particular context, often used metaphorically or informally.",
      "explanation_cn": "指在特定语境中具有极高地位、影响力或主导地位的女性，常用于比喻或非正式场合。",
      "example_en": "She's the queen of the fashion world — everyone follows her style.",
      "example_cn": "她是时尚界的女王——人人都追随她的风格。"
    },
    {
      "pos": "noun",
      "explanation_en": "In chess, the most powerful piece on the board, able to move any number of squares vertically, horizontally, or diagonally.",
      "explanation_cn": "在国际象棋中，棋盘上最强大的棋子，可沿垂直、水平或对角线方向任意格数移动。",
      "example_en": "The player sacrificed a rook to bring the queen into a decisive attacking position.",
      "example_cn": "这位棋手牺牲了一辆战车，以将皇后置于决定性的进攻位置。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "monarch",
      "analysis": "“Monarch”（君主）是性别中立的术语，泛指任何拥有世袭统治权的国家元首，包括国王、女王、皇帝等。而 “queen” 仅指女性君主，且在特定语境下可能仅指国王的妻子（王后），需结合上下文判断。"
    },
    {
      "word_to_compare": "empress",
      "analysis": "“Empress”（女皇）是统治帝国的女性君主，其统治范围通常比王国（kingdom）更大、更复杂。而 “queen” 通常指王国的统治者或国王的妻子，权力范围和政治层级低于 “empress”。"
    },
    {
      "word_to_compare": "lady",
      "analysis": "“Lady”（女士/夫人）是泛指贵族或有教养的女性，社会地位低于王室成员，不具统治权。而 “queen” 是国家元首，拥有政治和象征性权威，两者在权力和正式性上存在本质区别。"
    }
  ]
}