{
  "word": "queen",
  "pronunciation": "kween",
  "concise_definition": "n. 女王, 女王蜂, 王后; v. 使居于至尊地位",
  "forms": {
    "plural": "queens"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The female monarch who rules a country in her own right, or the wife of a king, holding the highest royal rank in a monarchy.",
      "explanation_cn": "指以自身名义统治国家的女性君主，或国王的妻子，在君主制中拥有最高王室地位。",
      "example_en": "Queen Elizabeth II reigned for over 70 years, becoming the longest-serving British monarch.",
      "example_cn": "伊丽莎白二世女王统治了七十多年，成为英国历史上在位时间最长的君主。"
    },
    {
      "pos": "noun",
      "explanation_en": "The fertile female bee in a hive, responsible for laying all the eggs and maintaining the colony's population.",
      "explanation_cn": "指蜂群中唯一具有繁殖能力的雌蜂，负责产卵并维持蜂群的种群数量。",
      "example_en": "The beekeeper carefully inspected the queen to ensure the hive was healthy.",
      "example_cn": "养蜂人仔细检查了蜂后，以确保蜂群健康。"
    },
    {
      "pos": "noun",
      "explanation_en": "A playing card with the image of a queen, typically the highest-ranking face card in its suit after the king.",
      "explanation_cn": "指扑克牌中印有女王形象的牌，通常是其花色中仅次于国王的最高级花牌。",
      "example_en": "She played the queen of spades and won the round.",
      "example_cn": "她出了一张黑桃皇后，赢得了这一轮。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is regarded as the most prominent, admired, or dominant figure in a particular group or field, often used metaphorically.",
      "explanation_cn": "指在特定群体或领域中被视为最突出、最受仰慕或最具主导地位的人物，常用于比喻。",
      "example_en": "She is the queen of pop music, with decades of chart-topping hits.",
      "example_cn": "她是流行音乐女王，拥有数十年的冠军单曲。"
    },
    {
      "pos": "verb",
      "explanation_en": "To place someone in a position of supreme authority, dominance, or admiration, often in a figurative or humorous sense.",
      "explanation_cn": "指将某人置于至高无上的权威、主导或受仰慕的地位，常用于比喻或幽默语境。",
      "example_en": "At the party, everyone tried to queen it up on the dance floor.",
      "example_cn": "在派对上，每个人都想在舞池里大出风头。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "monarch",
      "analysis": "“Monarch”（君主）是更广泛的术语，泛指任何拥有最高统治权的统治者，无论性别，包括国王、女王、皇帝等。而 “queen” 特指女性君主或国王的妻子，具有明确的性别指向。"
    },
    {
      "word_to_compare": "empress",
      "analysis": "“Empress”（女皇）是统治帝国的女性君主，其统治范围通常比王国更大，政治层级更高。而 “queen” 通常指王国的统治者或王后，地位低于帝国体系中的女皇。"
    },
    {
      "word_to_compare": "lady",
      "analysis": "“Lady”（女士）是泛指贵族或有教养的女性，社会地位可高可低，不具统治权。而 “queen” 是拥有实际或象征性最高权力的女性，具有政治或制度性权威，语义强度远高于 “lady”。"
    }
  ]
}