{
  "word": "quilt",
  "pronunciation": "kwilt",
  "concise_definition": "n. 被子, 被褥; v. 缝制被子",
  "forms": {
    "plural": "quilts",
    "third_person_singular": "quilts",
    "past_tense": "quilted",
    "past_participle": "quilted",
    "present_participle": "quilting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A thick, padded bed covering made by sewing together two layers of fabric with a layer of insulating material (such as cotton or wool) in between, often decorated with intricate patterns or patchwork.",
      "explanation_cn": "一种厚实的床上覆盖物，由两层织物夹着一层绝缘材料（如棉花或羊毛）缝制而成，通常以复杂的图案或拼布装饰。",
      "example_en": "She inherited her grandmother's handmade quilt, stitched with pieces of fabric from old dresses.",
      "example_cn": "她继承了祖母亲手缝制的被子，上面缝满了旧裙子的布料碎片。"
    },
    {
      "pos": "verb",
      "explanation_en": "To sew together two layers of fabric with a layer of padding in between, typically to make a quilt or to add warmth and texture to clothing or home textiles.",
      "explanation_cn": "将两层织物与中间的填充物缝合在一起，通常用于制作被子，或为衣物和家居纺织品增加保暖性和纹理。",
      "example_en": "The artist spent years quilting a tapestry that told the story of her family’s migration.",
      "example_cn": "这位艺术家花了数年时间缝制了一幅讲述她家族迁徙故事的拼布画。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form or arrange something in a patterned, layered, or patchwork manner, often metaphorically.",
      "explanation_cn": "以有图案、分层或拼贴的方式形成或组织某物，常用于比喻意义。",
      "example_en": "The city’s history is quilted together from centuries of cultural influences.",
      "example_cn": "这座城市的历史由几个世纪的文化影响交织而成。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "blanket",
      "analysis": "“Blanket”（毯子）泛指任何用于保暖的覆盖物，通常为单层或简单填充，不强调缝制工艺或装饰性。而 “quilt” 特指多层缝合、有填充物且常具图案设计的被子，工艺更复杂，文化内涵更丰富。"
    },
    {
      "word_to_compare": "duvet",
      "analysis": "“Duvet”（羽绒被）是现代家居用品，通常为可拆卸的羽绒或合成纤维填充套件，外层为简洁布套，强调功能性而非手工艺术性。而 “quilt” 更强调手工缝制、拼布和装饰性，常作为传家宝或艺术品存在。"
    },
    {
      "word_to_compare": "patchwork",
      "analysis": "“Patchwork”（拼布）是制作 quilt 的一种技术，指将不同形状和颜色的布片缝合组成图案。它本身是工艺或风格，而非成品；而 “quilt” 是最终完成的物品，可能包含 patchwork，也可能不包含（如整块布缝制的被子）。"
    }
  ]
}