{
  "word": "quiz",
  "pronunciation": "kwiz",
  "concise_definition": "n. 小测验, 问答比赛; v. 考问, 考核",
  "forms": {
    "plural": "quizzes",
    "third_person_singular": "quizzes",
    "past_tense": "quizzed",
    "past_participle": "quizzed",
    "present_participle": "quizzing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A short, informal test or set of questions, often used in classrooms or games to assess knowledge or recall, typically with immediate feedback.",
      "explanation_cn": "一种简短、非正式的测试或一组问题，常用于课堂或游戏中，以检验知识或记忆，通常伴随即时反馈。",
      "example_en": "The teacher gave a five-minute quiz on yesterday's reading assignment.",
      "example_cn": "老师就昨天的阅读作业进行了一次五分钟的小测验。"
    },
    {
      "pos": "noun",
      "explanation_en": "A game or competition in which participants answer questions, often on general knowledge, trivia, or specific subjects, for entertainment or prizes.",
      "explanation_cn": "一种参与者回答问题（通常涉及通识、冷知识或特定主题）以供娱乐或赢取奖品的竞赛形式。",
      "example_en": "They hosted a pub quiz every Friday night, with prizes for the winning team.",
      "example_cn": "他们每周五晚上举办一场酒吧问答比赛，获胜队伍可获得奖品。"
    },
    {
      "pos": "verb",
      "explanation_en": "To question someone closely or repeatedly, especially to test their knowledge, memory, or readiness.",
      "explanation_cn": "对某人进行反复或密切的提问，尤其是为了测试其知识、记忆或准备情况。",
      "example_en": "The lawyer quizzed the witness on every detail of his testimony.",
      "example_cn": "律师对证人就其证词的每一个细节进行了盘问。"
    },
    {
      "pos": "verb",
      "explanation_en": "To tease or joke with someone playfully, often by asking unexpected or humorous questions.",
      "explanation_cn": "以轻松、玩笑的方式调侃某人，常通过提出意想不到或幽默的问题来实现。",
      "example_en": "My friends quizzed me about my new haircut, making fun of the style.",
      "example_cn": "朋友们拿我的新发型开玩笑，不断调侃我。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "test",
      "analysis": "“Test”（测试）是一个更广泛、更正式的术语，通常用于评估能力、成绩或技能，结构严谨、评分标准明确，如期末考试。而 “quiz” 更短、更随意，常用于课堂即时检查，目的重在复习而非正式评估。"
    },
    {
      "word_to_compare": "exam",
      "analysis": "“Exam”（考试）通常指高风险、正式且内容广泛的评估，如大学入学考试或职业资格考试。它比 “quiz” 更严肃、耗时更长、影响更大。而 “quiz” 通常是低风险、快速、非正式的检查工具。"
    },
    {
      "word_to_compare": "interrogate",
      "analysis": "“Interrogate”（审问）带有强烈的强制性、严肃性甚至压迫性，常用于法律或调查语境，目的是获取信息或迫使承认。而 “quiz” 即使作为动词使用，也多为中性或轻松的提问，不具威胁性，甚至常带幽默色彩。"
    }
  ]
}