{
  "word": "races",
  "pronunciation": "reyss",
  "concise_definition": "n. 种族, 比赛, 人种",
  "forms": {
    "singular": "race"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A group of people who share common physical traits, such as skin color, hair texture, or facial features, often used in social or historical contexts to categorize human populations.",
      "explanation_cn": "指具有共同身体特征（如肤色、发质、面部特征）的人群群体，常用于社会或历史语境中对人类群体进行分类。",
      "example_en": "The concept of biological races has been largely discredited by modern science.",
      "example_cn": "现代科学已基本否定了生物种族的概念。"
    },
    {
      "pos": "noun",
      "explanation_en": "A competitive event in which participants strive to be the first to reach a finish line, typically involving speed in running, swimming, driving, or other physical activities.",
      "explanation_cn": "指参赛者为率先到达终点而展开竞争的赛事，通常涉及跑步、游泳、驾驶或其他体力活动中的速度比拼。",
      "example_en": "She won the 100-meter race at the Olympic Games.",
      "example_cn": "她在奥运会上赢得了百米赛跑冠军。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of animals or plants with shared inherited characteristics, often bred for specific traits; also used to describe a lineage or breed within a species.",
      "explanation_cn": "指具有共同遗传特征的动植物群体，通常通过选育获得特定性状；也可用于描述物种内的品系或品种。",
      "example_en": "The Labrador is a popular breed of dog known for its friendly temperament and intelligence.",
      "example_cn": "拉布拉多是一种广受欢迎的犬种，以其温顺的性格和高智商著称。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ethnicity",
      "analysis": "“Ethnicity”（族群）强调文化、语言、宗教或地域背景的共同性，而非生理特征。它更侧重于社会认同和文化传承，而 “race” 传统上基于外貌差异，但现代学术界认为种族是社会建构而非生物学事实。"
    },
    {
      "word_to_compare": "competition",
      "analysis": "“Competition”（竞争）是广义的对抗性活动，可涵盖智力、策略或资源争夺，不限于速度。“Race” 作为比赛时特指以速度和时间决定胜负的竞技形式，是“competition”的一种具体类型。"
    },
    {
      "word_to_compare": "breed",
      "analysis": "“Breed”（品种）专用于动植物，指通过人工选育形成的具有稳定遗传特征的群体，如狗的品种、作物的品系。而 “race” 在动物语境中虽可互换，但更常用于人类或泛指自然群体，且在现代英语中较少用于非人类生物，以避免歧义。"
    }
  ]
}