{
  "word": "racing",
  "pronunciation": "rey·sing",
  "concise_definition": "n. 赛车, 赛跑; adj. 赛车的, 赛跑的",
  "forms": {
    "noun_plural": "racing",
    "adjective_comparative": "more racing",
    "adjective_superlative": "most racing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The sport or activity of competing in speed, typically involving vehicles (such as cars, motorcycles, or boats) or animals (such as horses or greyhounds), where participants strive to complete a course in the shortest time.",
      "explanation_cn": "指以速度为竞争核心的体育活动，通常涉及车辆（如汽车、摩托车、帆船）或动物（如马、灰狗），参赛者力求在最短时间内完成指定赛道。",
      "example_en": "He has been passionate about motor racing since he was a child.",
      "example_cn": "他从小便对赛车运动充满热情。"
    },
    {
      "pos": "noun",
      "explanation_en": "A specific event or competition in which speed is the primary criterion for victory, often organized as part of a championship or series.",
      "explanation_cn": "指以速度为决胜标准的特定赛事，通常作为锦标赛或系列赛的一部分进行组织。",
      "example_en": "The Monaco Grand Prix is one of the most prestigious races in Formula 1 racing.",
      "example_cn": "摩纳哥大奖赛是F1赛车中最负盛名的赛事之一。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Designed for or associated with high-speed competition; characterized by speed, agility, and performance optimization.",
      "explanation_cn": "专为高速竞赛设计或与之相关的；以高速度、灵活性和性能优化为特征。",
      "example_en": "She drives a sleek, red racing car that can reach 200 miles per hour.",
      "example_cn": "她驾驶一辆流线型的红色赛车，最高时速可达200英里。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or involving the act of racing, especially in contexts where urgency or rapid movement is implied.",
      "explanation_cn": "与竞速行为相关，尤其在暗示紧迫性或快速移动的语境中。",
      "example_en": "The racing heartbeats of the runners echoed through the stadium.",
      "example_cn": "运动员们急促的心跳在体育场内回荡。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "race",
      "analysis": "“Race”（名词/动词）是更基础的词，可指一次具体的比赛（如a race）或竞速行为（to race），而 “racing” 是其名词化或形容词化形式，更强调这项运动、活动或其属性的整体性。例如，我们说 “He won the race”（他赢了比赛），但 “He is into racing”（他热衷于赛车运动）。"
    },
    {
      "word_to_compare": "speeding",
      "analysis": "“Speeding”（超速）通常带有负面含义，指违反交通规则的过快行驶，而 “racing” 是中性或积极的术语，指在受控环境（如赛道）中合法、有组织的高速竞赛。例如，police may ticket someone for speeding，但不会说他们因racing而开罚单，除非确为非法竞速。"
    },
    {
      "word_to_compare": "competition",
      "analysis": "“Competition”（竞赛）是更广泛的术语，涵盖所有形式的对抗性活动（如棋类、体育、学术竞赛），而 “racing” 是其子集，特指以速度为唯一或主要评判标准的竞赛。因此，所有赛车都是竞赛，但并非所有竞赛都是赛车。"
    }
  ]
}