{
  "word": "racks",
  "pronunciation": "raks",
  "concise_definition": "n. 架子, 支架, 大量; v. 放置, 堆放, 痛击",
  "forms": {
    "singular": "rack",
    "third_person_singular": "racks",
    "past_tense": "racked",
    "past_participle": "racked",
    "present_participle": "racking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A framework or structure with bars or shelves, designed to hold or organize items such as clothes, tools, or bottles.",
      "explanation_cn": "一种由横杆或隔板构成的框架结构，用于存放或整理衣物、工具、酒瓶等物品。",
      "example_en": "The wine bottles were neatly arranged on the wooden racks in the cellar.",
      "example_cn": "酒窖里的葡萄酒瓶整齐地摆放在木制架子上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large amount or quantity of something, often used informally to emphasize abundance.",
      "explanation_cn": "指大量某物，常用于非正式语境中强调数量之多。",
      "example_en": "He made racks of money selling those sneakers.",
      "example_cn": "他卖那些运动鞋赚了大笔钱。"
    },
    {
      "pos": "verb",
      "explanation_en": "To place or store something on a rack or in an organized manner, often for display or convenience.",
      "explanation_cn": "将某物放置在架子上或以有组织的方式存放，通常为了展示或方便取用。",
      "example_en": "She racked the guitars against the wall after the concert.",
      "example_cn": "音乐会结束后，她把吉他靠墙放好。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause severe pain or suffering, often through physical torture or intense pressure; also used figuratively to describe extreme mental distress.",
      "explanation_cn": "指通过身体折磨或巨大压力造成剧烈疼痛或痛苦；也可比喻性地形容极度的精神折磨。",
      "example_en": "The injury racked him with pain every time he moved.",
      "example_cn": "每次他一动，伤处就疼得他撕心裂肺。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "shelf",
      "analysis": "“Shelf”（搁板）通常指单层的水平平台，用于放置物品，结构简单，多用于墙面或柜体中。而 “rack” 通常由多层或多个支架组成，结构更复杂，常用于垂直或倾斜存放，如自行车架、吉他架，强调的是支撑与组织功能。"
    },
    {
      "word_to_compare": "stack",
      "analysis": "“Stack”（堆叠）指将物品一层层叠放在一起，强调的是垂直堆积的形态，如书堆、纸堆。而 “rack” 强调的是通过框架结构来分隔、固定和展示物品，物品之间通常不直接堆叠，而是被独立安置。"
    },
    {
      "word_to_compare": "torment",
      "analysis": "“Torment”（折磨）是抽象名词或动词，专指精神或肉体上的持续痛苦，语义更侧重心理层面。而 “rack” 作为动词时，常带有强烈的物理意象（如‘上夹板’），常用于描述剧烈、突发的痛感，如 ‘racked with pain’，更具画面感和身体性。"
    }
  ]
}