{
  "word": "racket",
  "pronunciation": "rak·it",
  "concise_definition": "n. 噪音, 网球拍, 诈骗; v. 敲诈, 以非法手段牟利",
  "forms": {
    "plural": "rackets"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A loud, unpleasant, and often continuous noise, especially one that is disruptive or annoying.",
      "explanation_cn": "指一种响亮、不悦耳且常常持续不断的噪音，尤其指具有干扰性或令人烦恼的声音。",
      "example_en": "The neighbors were making a racket with their loud music late at night.",
      "example_cn": "邻居们深夜放着震耳欲聋的音乐，吵得不行。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sports implement used to hit a ball, especially in tennis, badminton, or squash, typically consisting of a handled frame with a network of tightly stretched strings.",
      "explanation_cn": "指用于击球的体育用具，尤指网球、羽毛球或壁球拍，通常由一个带柄的框架和紧密绷紧的网状弦线组成。",
      "example_en": "She bought a new racket after her old one broke during the tournament.",
      "example_cn": "她旧球拍在比赛中断了，于是买了一把新的。"
    },
    {
      "pos": "noun",
      "explanation_en": "An illegal or dishonest scheme, especially one designed to make money through fraud or extortion.",
      "explanation_cn": "指一种非法或不诚实的计划，尤其是通过欺诈或敲诈手段牟利的骗局。",
      "example_en": "The police shut down a racket selling counterfeit luxury goods.",
      "example_cn": "警方捣毁了一个销售假冒奢侈品的诈骗团伙。"
    },
    {
      "pos": "verb",
      "explanation_en": "To obtain money illegally through threats, fraud, or coercion, often as part of an organized scheme.",
      "explanation_cn": "指通过威胁、欺诈或胁迫等非法手段获取钱财，通常属于有组织的犯罪活动。",
      "example_en": "The gang was accused of racketing local businesses by demanding protection money.",
      "example_cn": "该帮派因勒索商家缴纳‘保护费’而被指控从事敲诈活动。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "noise",
      "analysis": "“Noise”（噪音）是泛指任何不想要的声音，中性词，可大可小；而 “racket” 特指那种刺耳、喧闹、令人烦躁的噪音，带有强烈的情感色彩，语义更重、更具贬义。"
    },
    {
      "word_to_compare": "bat",
      "analysis": "“Bat”（球棒）通常指棒球或板球中使用的实心击球工具，而 “racket” 专指带网线的击球拍，如网球拍、羽毛球拍。两者虽同为运动器材，但结构和使用运动完全不同，不可互换。"
    },
    {
      "word_to_compare": "scam",
      "analysis": "“Scam”（骗局）泛指任何形式的欺诈行为，语义较广，可轻可重；而 “racket” 强调有组织、持续性、常伴随暴力或胁迫的非法牟利活动，如保护费、地下赌博等，更具黑帮色彩和系统性，语义更具体、更严重。"
    }
  ]
}