{
  "word": "rack",
  "pronunciation": "rak",
  "concise_definition": "n. 架子, 货架; v. 使痛苦, 碎裂, 烧烤",
  "forms": {
    "third_person_singular": "racks",
    "past_tense": "racked",
    "past_participle": "racked",
    "present_participle": "racking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A frame or structure with bars or shelves, designed to hold or organize items such as tools, bottles, or bicycles.",
      "explanation_cn": "一种由横条或搁板构成的框架结构，用于放置或整理物品，如工具、瓶子或自行车。",
      "example_en": "She hung her keys on the rack by the door.",
      "example_cn": "她把钥匙挂在门边的挂钩架上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device used for torturing or stretching a person’s body, historically used to inflict severe pain by pulling limbs apart.",
      "explanation_cn": "一种历史上用于酷刑的装置，通过拉伸人体四肢来造成剧烈疼痛。",
      "example_en": "The prisoner was placed on the rack to extract a confession.",
      "example_cn": "囚犯被绑在刑架上以逼供。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause extreme physical or mental pain, often used figuratively to describe intense suffering or strain.",
      "explanation_cn": "使遭受极大的身体或精神痛苦，常用于比喻性地描述剧烈的折磨或压力。",
      "example_en": "The long wait was racking her nerves.",
      "example_cn": "漫长的等待让她神经紧绷。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cook food, especially meat, on a rack over direct heat, often in a grill or oven.",
      "explanation_cn": "将食物（尤其是肉类）放在架子上用直接热源烧烤。",
      "example_en": "He raked the ribs over the charcoal grill until they were perfectly charred.",
      "example_cn": "他把肋排放在炭火架上烤，直到表面焦香完美。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "shelf",
      "analysis": "“Shelf”（搁板）通常指单一、水平的平面，用于放置物品，结构简单，不包含框架或横条。而 “rack” 通常由多个支撑结构组成，可垂直或倾斜放置，用于悬挂或固定物品，如自行车架、酒架，功能更复杂且强调支撑与组织。"
    },
    {
      "word_to_compare": "torture",
      "analysis": "“Torture”（酷刑）是广义的动词，泛指任何造成剧烈痛苦的行为，而 “rack” 作为动词时特指通过物理拉伸或压迫造成痛苦，具有历史和具象的意象，常与刑具“rack”直接关联，语义更具体、更具画面感。"
    },
    {
      "word_to_compare": "grill",
      "analysis": "“Grill”（烧烤架）是用于烹饪的设备，与 “rack” 在烹饪语境中可互换，但 “grill” 更强调热源和烹饪方式（如炭火、电热），而 “rack” 仅指承载食物的金属架结构。例如，你可以在 grill 上使用 rack，但 rack 本身不产生热量。"
    }
  ]
}