{
  "word": "rage",
  "pronunciation": "rayj",
  "concise_definition": "n. 愤怒, 暴怒; v. 狂怒, 猛烈地发生",
  "forms": {
    "third_person_singular": "rages",
    "past_tense": "raged",
    "past_participle": "raged",
    "present_participle": "raging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An intense, often uncontrollable feeling of anger or fury, typically accompanied by violent behavior or strong emotional outbursts.",
      "explanation_cn": "一种强烈且常常无法控制的愤怒或狂怒情绪，通常伴随暴力行为或强烈的情绪爆发。",
      "example_en": "The crowd erupted in rage when the referee made the controversial call.",
      "example_cn": "当裁判做出有争议的判罚时，观众群情激愤。"
    },
    {
      "pos": "noun",
      "explanation_en": "A widespread and intense phenomenon or trend, often used to describe something that is extremely popular or destructive at a given time.",
      "explanation_cn": "指某种在特定时期广泛流行或极具破坏性的现象或潮流，常用于描述极度流行或肆虐的事物。",
      "example_en": "The fashion for bell-bottom jeans was a rage in the 1970s.",
      "example_cn": "20世纪70年代，喇叭裤曾风靡一时。"
    },
    {
      "pos": "verb",
      "explanation_en": "To feel or express intense anger, often loudly or violently.",
      "explanation_cn": "感到或表现出强烈的愤怒，通常以大声或暴力的方式。",
      "example_en": "He raged at his employees for the missed deadline.",
      "example_cn": "他因截止日期延误而对员工大发雷霆。"
    },
    {
      "pos": "verb",
      "explanation_en": "To proceed with violent force or intensity, often describing natural phenomena such as fire, storms, or war.",
      "explanation_cn": "以猛烈的力量或强度进行，常用于描述自然现象如火灾、风暴或战争。",
      "example_en": "The forest fire raged for three days before it was finally contained.",
      "example_cn": "这场森林大火肆虐了三天，才最终被控制住。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "anger",
      "analysis": "“Anger” (愤怒) 是一个更广泛、更中性的词，泛指任何程度的不快或敌意情绪，可以是轻微的恼火，也可以是强烈的愤怒。而 “rage” 是 anger 的极端形式，强调失控、激烈和爆发性，语义强度远高于 “anger”。"
    },
    {
      "word_to_compare": "fury",
      "analysis": "“Fury” (暴怒) 与 “rage” 非常接近，常可互换，但 “fury” 更具文学性和诗意色彩，常用于描述神圣或神话般的愤怒（如神之怒），而 “rage” 更口语化、更贴近日常暴力或情绪爆发的语境。"
    },
    {
      "word_to_compare": "outburst",
      "analysis": "“Outburst” (爆发) 指情绪、言语或行为的突然释放，可以是愤怒、喜悦或悲伤，范围更广。而 “rage” 专指愤怒的爆发，语义更聚焦。一个 “rage” 可能表现为一次 “outburst”，但并非所有 “outburst” 都是 “rage”。"
    }
  ]
}