{
  "word": "raiding",
  "pronunciation": "rayd·ing",
  "concise_definition": "n. 突袭, 抢劫, 搜查",
  "forms": {
    "base_form": "raid",
    "third_person_singular": "raids",
    "past_tense": "raided",
    "past_participle": "raided",
    "present_participle": "raiding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sudden, violent attack or incursion, typically by a group, to steal, capture, or destroy something, often with speed and surprise.",
      "explanation_cn": "指一群人以突然、暴力的方式发动袭击，旨在偷窃、俘获或破坏某物，通常依靠速度和出其不意。",
      "example_en": "The police conducted a midnight raid on the illegal gambling den.",
      "example_cn": "警方在午夜突袭了非法赌场。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden official search or inspection, often by law enforcement or military personnel, to seize evidence, contraband, or suspects.",
      "explanation_cn": "指由执法或军事人员进行的突然搜查或检查，目的是查获证据、违禁品或嫌疑人。",
      "example_en": "The customs officers carried out a raid on the warehouse and seized hundreds of counterfeit goods.",
      "example_cn": "海关官员对仓库进行了突击搜查，查扣了数百件假冒商品。"
    },
    {
      "pos": "noun",
      "explanation_en": "In video games or online communities, a coordinated group attack on a server, player, or resource to gain advantage or disrupt operations.",
      "explanation_cn": "在电子游戏或在线社群中，指一组玩家协同攻击服务器、玩家或资源，以获取优势或扰乱正常运作。",
      "example_en": "The guild planned a raid on the dragon’s lair to claim the legendary treasure.",
      "example_cn": "公会计划对龙穴发动突袭，以夺取传说中的宝藏。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "attack",
      "analysis": "“Attack” (攻击) 是一个更广泛的术语，泛指任何形式的敌对行动，可以是物理的、言语的或战略的，不一定具有突然性或掠夺目的。而 “raiding” 特指带有掠夺、搜查或突袭性质的攻击，强调行动的突然性和目标性。"
    },
    {
      "word_to_compare": "invasion",
      "analysis": "“Invasion” (入侵) 通常指大规模、有组织的军事行动，旨在占领领土或推翻政权，规模远大于 “raiding”。而 “raiding” 多为小规模、快速的行动，目的通常是劫掠或获取特定物品，而非长期控制。"
    },
    {
      "word_to_compare": "search",
      "analysis": "“Search” (搜查) 是一个中性、合法的程序性行为，通常依据法律授权进行，目的是寻找证据或物品，不包含暴力或掠夺意图。而 “raiding” 虽然也可能合法，但常带有强制、暴力和突袭的色彩，语义上更具攻击性和紧迫感。"
    }
  ]
}