{
  "word": "raid",
  "pronunciation": "rād",
  "concise_definition": "n. 突袭, 劫掠; v. 突袭, 突然搜查",
  "forms": {
    "third_person_singular": "raids",
    "past_tense": "raided",
    "past_participle": "raided",
    "present_participle": "raiding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sudden, violent attack or incursion, typically by a group, to steal, capture, or destroy something, often with speed and surprise.",
      "explanation_cn": "指一群人以突然、暴力的方式发动袭击，目的是偷窃、劫掠或破坏，通常依靠速度和出其不意。",
      "example_en": "The police conducted a raid on the illegal gambling den at midnight.",
      "example_cn": "警方在午夜对非法赌场进行了突袭。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden, often unauthorized, entry into a place (such as a website, database, or TV time slot) to take or use something, especially in a competitive context.",
      "explanation_cn": "指突然、通常是未经授权地进入某个场所（如网站、数据库或电视时段），以获取或使用某物，常用于竞争性语境。",
      "example_en": "The rival network launched a raid on our prime-time programming by signing away our top actor.",
      "example_cn": "竞争对手通过挖走我们的当红演员，对我们的黄金时段节目发动了‘挖角突袭’。"
    },
    {
      "pos": "verb",
      "explanation_en": "To conduct a sudden attack or incursion, especially to seize property, capture people, or disrupt operations.",
      "explanation_cn": "指发动一次突然袭击，尤其是为了夺取财物、抓捕人员或破坏行动。",
      "example_en": "Bandits raided the village and stole all the livestock.",
      "example_cn": "强盗突袭了村庄，抢走了所有牲畜。"
    },
    {
      "pos": "verb",
      "explanation_en": "To enter a place suddenly and forcefully, especially to search for something or make an arrest.",
      "explanation_cn": "指突然且强行进入某地，尤其是为了搜查物品或实施逮捕。",
      "example_en": "IRS agents raided the businessman's office looking for tax fraud evidence.",
      "example_cn": "国税局特工突袭了这位商人的办公室，寻找逃税证据。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "attack",
      "analysis": "“Attack” (攻击) 是一个更广泛的术语，泛指任何形式的敌对行为，可以是军事、言语或心理上的，不一定具有突然性或掠夺目的。而 “raid” 特指有明确目标（如抢夺、抓捕）的突然袭击，强调速度、隐蔽性和行动的短暂性。"
    },
    {
      "word_to_compare": "invasion",
      "analysis": "“Invasion” (入侵) 通常指大规模、有组织的军事行动，旨在占领领土或政权，持续时间较长，规模宏大。而 “raid” 是小规模、快速的行动，目标有限，不追求长期控制。"
    },
    {
      "word_to_compare": "search",
      "analysis": "“Search” (搜查) 是一个中性、合法的程序性行为，通常依据法律授权进行，目的是寻找证据或物品，不包含暴力或掠夺意图。而 “raid” 虽然有时也用于合法执法，但其语义中天然带有暴力、突袭和侵入的负面色彩，常暗示未经授权或过度使用武力。"
    }
  ]
}