{
  "word": "raids",
  "pronunciation": "rādz",
  "concise_definition": "n. 突袭, 抢劫, 突击行动; v. 突袭, 抢劫, 突击",
  "forms": {
    "singular": "raid"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sudden, violent attack or incursion, typically by a group, aimed at stealing, destroying, or capturing something, often with speed and surprise.",
      "explanation_cn": "指一群人为偷窃、破坏或俘获目标而发动的突然、暴力的袭击，通常以速度和出其不意为特点。",
      "example_en": "The police conducted a raid on the illegal gambling den and arrested several suspects.",
      "example_cn": "警方突袭了一处非法赌场，并逮捕了数名嫌疑人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A coordinated military or tactical operation, often involving airborne or special forces, to achieve a specific objective such as rescuing hostages or destroying infrastructure.",
      "explanation_cn": "指由军队或特种部队协同实施的战术行动，旨在实现特定目标，如营救人质或摧毁基础设施。",
      "example_en": "The special forces carried out a daring raid on the enemy headquarters during the night.",
      "example_cn": "特种部队在夜间对敌方总部实施了一次大胆的突袭。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden and often unauthorized inspection or search, especially by authorities, to enforce rules or seize contraband.",
      "explanation_cn": "指当局为执行规则或查缴违禁品而进行的突然、通常未经事先通知的检查或搜查。",
      "example_en": "Customs officials launched a raid on the warehouse and seized hundreds of counterfeit goods.",
      "example_cn": "海关官员突查了仓库，查扣了数百件假冒商品。"
    },
    {
      "pos": "verb",
      "explanation_en": "To conduct a sudden attack or incursion, especially to steal or capture something.",
      "explanation_cn": "指发动突然袭击，尤其是为了偷窃或俘获某物。",
      "example_en": "Bandits raided the village and stole all the livestock.",
      "example_cn": "强盗突袭了村庄，抢走了所有牲畜。"
    },
    {
      "pos": "verb",
      "explanation_en": "To conduct a sudden official search or inspection, typically to enforce laws or regulations.",
      "explanation_cn": "指进行突然的官方搜查或检查，通常是为了执行法律或规定。",
      "example_en": "The IRS raided the businessman's office to investigate tax evasion.",
      "example_cn": "国税局突查了这位商人的办公室，以调查逃税行为。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "attack",
      "analysis": "“Attack”（攻击）是一个更广泛的术语，泛指任何形式的敌对行为，可以是持续的、大规模的或常规的军事行动。而 “raid” 强调的是短暂、突然、目标明确的突袭，通常以快速完成任务并撤离为特征。"
    },
    {
      "word_to_compare": "invasion",
      "analysis": "“Invasion”（入侵）指大规模、有组织、长期占领领土的军事行动，通常涉及国家层面的战争行为。而 “raid” 是小规模、短期的行动，不以占领为目的，而是为了掠夺、破坏或获取情报。"
    },
    {
      "word_to_compare": "search",
      "analysis": "“Search”（搜查）是中性词，指为寻找物品或证据而进行的检查，不一定伴随暴力或非法性。而 “raid” 暗示了强制性、突然性和潜在的违法性，常带有执法或军事的武力色彩。"
    }
  ]
}