{
  "word": "railroad",
  "pronunciation": "reyl·rohd",
  "concise_definition": "n. 铁路, 铁路系统; v. 强行通过, 操纵, 急速推进",
  "forms": {
    "third_person_singular": "railroads",
    "past_tense": "railroaded",
    "past_participle": "railroaded",
    "present_participle": "railroading"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A system of transportation consisting of trains running on metal tracks, typically used for transporting goods and passengers over long distances.",
      "explanation_cn": "一种由列车在金属轨道上运行的交通运输系统，通常用于长途运输货物和乘客。",
      "example_en": "The transcontinental railroad connected the east and west coasts of the United States in the 19th century.",
      "example_cn": "19世纪，横贯大陆的铁路将美国的东西海岸连接了起来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To force or rush something through a process, especially legislation or decision-making, often without proper debate or consideration of opposing views.",
      "explanation_cn": "指强行或仓促推动某事（尤其是立法或决策）通过，通常不给予充分辩论或考虑反对意见。",
      "example_en": "The majority party tried to railroad the controversial bill through the Senate before the election.",
      "example_cn": "多数党试图在选举前强行通过这项有争议的法案。"
    },
    {
      "pos": "verb",
      "explanation_en": "To manipulate or coerce someone into doing something against their will or better judgment, often through pressure or deception.",
      "explanation_cn": "指通过压力或欺骗手段操纵或胁迫某人做违背其意愿或判断的事情。",
      "example_en": "He was railroaded into signing the contract without reading the fine print.",
      "example_cn": "他被逼迫在没看细则的情况下签了合同。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "railway",
      "analysis": "“Railway”（铁路）是“railroad”的英式英语对应词，两者在指代轨道运输系统时基本可互换，但“railroad”在美式英语中更常用，且在动词用法上具有“强行推进”的引申义，而“railway”极少用于动词。"
    },
    {
      "word_to_compare": "push",
      "analysis": "“Push”（推动）是一个通用动词，指施加力量促使某事发生，语气中性或温和。“Railroad”则带有强烈的负面含义，暗示不公正、不民主或压制异议的强行推进，语义更重、更具批判性。"
    },
    {
      "word_to_compare": "fast-track",
      "analysis": "“Fast-track”（加速处理）指为某事提供优先或快捷通道，通常出于效率考虑，不一定有负面含义。而“railroad”隐含着程序被绕过、权利被忽视的不正当性，语义色彩更负面。"
    }
  ]
}