{
  "word": "raising",
  "pronunciation": "rey·zihng",
  "concise_definition": "n. 提高, 筹款, 抚养; v. 提高, 筹集, 养育 (raise 的现在分词/动名词)",
  "forms": {
    "base_form": "raise",
    "third_person_singular": "raises",
    "past_tense": "raised",
    "past_participle": "raised",
    "present_participle": "raising"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of collecting money for a specific purpose, especially for charitable, political, or organizational causes.",
      "explanation_cn": "指为特定目的（尤其是慈善、政治或组织事务）筹集资金的行为。",
      "example_en": "The charity organized a fundraising raising to support homeless families.",
      "example_cn": "该慈善机构组织了一场筹款活动，以帮助无家可归的家庭。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process of bringing up children or animals, providing care, guidance, and education over time.",
      "explanation_cn": "指长期照顾、引导和教育儿童或动物的成长过程。",
      "example_en": "Raising a child in a bilingual household requires consistent effort and patience.",
      "example_cn": "在双语家庭中抚养孩子需要持续的努力和耐心。"
    },
    {
      "pos": "noun",
      "explanation_en": "An increase in the level, amount, or degree of something, especially wages, prices, or standards.",
      "explanation_cn": "指某事物（如工资、价格或标准）水平、数量或程度的提升。",
      "example_en": "The raising of the minimum wage sparked debate across the country.",
      "example_cn": "最低工资的提高在全国引发了争论。"
    },
    {
      "pos": "verb",
      "explanation_en": "To lift or move something to a higher position or level, often with physical effort.",
      "explanation_cn": "指通过体力将某物提升到更高的位置或水平。",
      "example_en": "She was raising her hand to ask a question.",
      "example_cn": "她正举起手来提问。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to increase in amount, intensity, or degree, such as noise, temperature, or expectations.",
      "explanation_cn": "指使某事物（如噪音、温度或期望）的量、强度或程度增加。",
      "example_en": "The coach was raising the intensity of the training before the championship.",
      "example_cn": "教练在锦标赛前提高了训练强度。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "increase",
      "analysis": "“Increase” (增加) 是一个更通用的词，指数量、程度或规模的上升，适用于抽象或具体事物，不强调动作的执行者。而 “raising” 通常隐含主动的、有目的的提升行为，常用于正式语境，如工资、标准或筹款。"
    },
    {
      "word_to_compare": "bringing up",
      "analysis": "“Bringing up” (抚养) 与 “raising” 在养育孩子的语境中可互换，但 “bringing up” 更口语化，常用于家庭语境；而 “raising” 更正式，涵盖更广的教育和成长过程，也可用于动物或项目。"
    },
    {
      "word_to_compare": "fundraising",
      "analysis": "“Fundraising” 是 “raising” 在筹款语境中的专用名词形式，专指为组织或事业募集资金的活动。而 “raising” 作为动名词，语义更广，可涵盖工资、标准、孩子等多方面提升行为。"
    }
  ]
}