{
  "word": "raised",
  "pronunciation": "reyzd",
  "concise_definition": "adj. 提升的, 高起的; v. 提高, 养育, 提出, 筹集 (raise 的过去式和过去分词)",
  "forms": {
    "base_form": "raise",
    "third_person_singular": "raises",
    "present_participle": "raising",
    "past_tense": "raised",
    "past_participle": "raised"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To lift or move something to a higher position, often with physical effort or by using a mechanism.",
      "explanation_cn": "指通过体力或机械装置将某物抬升到更高的位置。",
      "example_en": "She raised her hand to ask a question.",
      "example_cn": "她举手提问。"
    },
    {
      "pos": "verb",
      "explanation_en": "To increase the amount, level, or intensity of something, such as a price, volume, or standard.",
      "explanation_cn": "指提高某物的数量、水平或强度，如价格、音量或标准。",
      "example_en": "The company raised its prices due to inflation.",
      "example_cn": "由于通货膨胀，该公司提高了价格。"
    },
    {
      "pos": "verb",
      "explanation_en": "To care for and nurture a child until adulthood, often implying responsibility and emotional investment.",
      "explanation_cn": "指抚养和培育孩子直至成年，通常包含责任与情感投入。",
      "example_en": "He was raised by his grandparents in a small village.",
      "example_cn": "他在一个小村庄由祖父母抚养长大。"
    },
    {
      "pos": "verb",
      "explanation_en": "To bring up or introduce a topic, issue, or concern for discussion or consideration.",
      "explanation_cn": "指提出某个话题、问题或关切以供讨论或考虑。",
      "example_en": "She raised an important point about environmental sustainability.",
      "example_cn": "她提出了一个关于环境可持续性的重要观点。"
    },
    {
      "pos": "verb",
      "explanation_en": "To collect or gather money, especially for a specific purpose such as charity or a campaign.",
      "explanation_cn": "指为特定目的（如慈善或竞选）筹集资金。",
      "example_en": "The nonprofit raised over $1 million last year.",
      "example_cn": "该非营利组织去年筹集了超过一百万美元。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "lift",
      "analysis": "“Lift” (举起) 通常指短暂、直接的向上动作，强调物理动作本身，不涉及持续性或目的性。而 “raised” 常暗示动作已完成，且可能带有目的，如提升地位、价格或意识，语义范围更广。"
    },
    {
      "word_to_compare": "increase",
      "analysis": "“Increase” (增加) 是一个更抽象、中性的词，用于数量、规模或程度的上升，适用于数据、数量、频率等，不涉及具体动作。而 “raised” 常隐含人为干预或主动行为，如提高价格、工资或音量，更具主动性。"
    },
    {
      "word_to_compare": "bring up",
      "analysis": "“Bring up” (提出/抚养) 与 “raised” 在抚养孩子和提出话题时可互换，但 “bring up” 更口语化，且常用于现在时或进行时；而 “raised” 是完成时态，强调结果和长期过程，尤其在描述成长背景时更正式、更强调结果。"
    },
    {
      "word_to_compare": "collect",
      "analysis": "“Collect” (收集) 指从多个来源聚集物品或资金，强调聚合过程，但不一定有明确目标或用途。而 “raised” 在筹集资金时，隐含了为特定目的（如慈善、项目）而主动发起并完成的筹款行为，目的性更强。"
    }
  ]
}