{
  "word": "rake",
  "pronunciation": "rāk",
  "concise_definition": "n. 锄头, 犁耙; v. 耙地, 扫拢, 搜刮, 大量获得",
  "forms": {
    "third_person_singular": "rakes",
    "past_tense": "raked",
    "past_participle": "raked",
    "present_participle": "raking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A garden tool with a long handle and a row of teeth or tines, used for gathering leaves, grass, or debris, or for leveling soil.",
      "explanation_cn": "一种园艺工具，带有长柄和一排齿状物，用于收集树叶、草屑或杂物，或平整土壤。",
      "example_en": "She used a metal rake to gather the fallen leaves in the yard.",
      "example_cn": "她用一把金属耙子把院子里的落叶扫拢在一起。"
    },
    {
      "pos": "verb",
      "explanation_en": "To gather or move something, especially loose material like leaves, grass, or snow, using a rake.",
      "explanation_cn": "使用耙子将松散的材料（如树叶、草屑或雪）扫拢或移动。",
      "example_en": "He raked the lawn every Saturday morning to keep it tidy.",
      "example_cn": "他每周六早上都耙草坪，以保持整洁。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or sweep something quickly and forcefully across a surface, often in a sweeping motion.",
      "explanation_cn": "以快速而有力的扫动动作在表面上移动某物，通常指横向扫掠。",
      "example_en": "The waves raked the shore with foam as the storm approached.",
      "example_cn": "风暴来临前，海浪带着泡沫猛烈地拍打着海岸。"
    },
    {
      "pos": "verb",
      "explanation_en": "To obtain or collect something, especially money or profit, in large amounts, often quickly or by aggressive means.",
      "explanation_cn": "迅速或以激进手段大量获取（尤指金钱或利润）。",
      "example_en": "The company raked in millions during the holiday sales.",
      "example_cn": "这家公司假期促销期间赚了数百万。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hoe",
      "analysis": "“Hoe”（锄头）主要用于翻土、除草，其刃部通常垂直于柄，适合在作物间工作；而 “rake” 的齿部平行于柄，主要用于收集、平整或扫拢表面松散物，不用于翻土。两者功能互补，但使用场景不同。"
    },
    {
      "word_to_compare": "sweep",
      "analysis": "“Sweep”（扫）泛指用扫帚或其他工具清除表面灰尘或杂物，动作更通用，可指室内或室外；而 “rake” 特指使用耙子进行的、带有齿状工具的扫拢动作，常用于户外、较粗重的材料（如树叶、碎石），动作力度更大。"
    },
    {
      "word_to_compare": "reap",
      "analysis": "“Reap”（收获）通常指收割庄稼或获得劳动成果，带有收获回报的隐喻色彩，常用于抽象语境（如 reap the benefits）；而 “rake in” 强调的是大量、快速甚至不择手段地获取金钱或利益，语气更口语化、更具功利性。"
    }
  ]
}