{
  "word": "rally",
  "pronunciation": "ræl·i",
  "concise_definition": "v. 集结, 振作, 反攻; n. 集会, 示威, 拉力赛",
  "forms": {
    "third_person_singular": "rallies",
    "past_tense": "rallied",
    "past_participle": "rallied",
    "present_participle": "rallying"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To gather or bring together people for a common purpose, especially to restore morale, energy, or unity after a setback.",
      "explanation_cn": "指在遭遇挫折后，将人们聚集起来以恢复士气、活力或团结，常用于政治、军事或体育语境。",
      "example_en": "The team rallied in the final quarter and won the game by three points.",
      "example_cn": "球队在最后一节奋起反击，以三分之差赢得比赛。"
    },
    {
      "pos": "verb",
      "explanation_en": "To recover strength or improve after a period of decline, illness, or weakness.",
      "explanation_cn": "指在经历衰退、疾病或虚弱后重新振作、恢复活力。",
      "example_en": "After a week of rest, she rallied and returned to work.",
      "example_cn": "休息一周后，她恢复了健康并重返工作岗位。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large public gathering, especially one organized to show support for a cause, candidate, or movement.",
      "explanation_cn": "指为表达对某项事业、候选人或运动的支持而组织的大规模公众集会，常带有政治或社会动员性质。",
      "example_en": "Thousands attended the rally to demand climate action.",
      "example_cn": "成千上万人参加了集会，要求采取气候行动。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of motorsport race held on public or private roads, often over long distances and varied terrain, requiring high skill and endurance.",
      "explanation_cn": "指在公共或私人道路上举行的汽车赛事，通常路线长、地形复杂，对车手的技术和耐力要求极高。",
      "example_en": "The Monte Carlo Rally is one of the most prestigious events in motorsport history.",
      "example_cn": "蒙特卡洛拉力赛是汽车运动史上最具声望的赛事之一。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "assemble",
      "analysis": "“Assemble” (集合) 侧重于物理空间上的聚集，强调将分散的人或物集中到一处，不必然带有情感动员或目标导向。而 “rally” 更强调为共同目标而集结，常伴随情绪激励或精神鼓舞，具有更强的行动意图。"
    },
    {
      "word_to_compare": "march",
      "analysis": "“March” (游行) 通常指有组织地步行前进，以表达抗议或支持，形式固定、路线明确。而 “rally” 更侧重于集会本身，可能包括演讲、音乐、口号等，不一定移动。两者都可为政治目的，但 “rally” 更强调聚集后的表达，而 “march” 强调行进过程。"
    },
    {
      "word_to_compare": "revive",
      "analysis": "“Revive” (复苏) 专指使某物从衰弱、休眠或死亡状态中恢复生机，常用于生命、经济或传统等领域，偏重结果。而 “rally” 作为动词时，不仅指恢复，还隐含了主动参与、集体努力的过程，尤其在体育或团队语境中更强调转折性的反弹。"
    }
  ]
}