{
  "word": "rallied",
  "pronunciation": "ræl·aɪd",
  "concise_definition": "v. 集合, 鼓舞, 振奋, 重新组织",
  "forms": {
    "base_form": "rally",
    "third_person_singular": "rallies",
    "present_participle": "rallying",
    "past_tense": "rallied",
    "past_participle": "rallied"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To gather or bring together people for a common purpose, especially in times of difficulty or crisis, often to restore morale or unity.",
      "explanation_cn": "指在困难或危机时刻将人们召集起来，为共同目标而团结一致，通常是为了恢复士气或凝聚力。",
      "example_en": "The community rallied around the families affected by the fire.",
      "example_cn": "社区居民团结起来支持火灾中的受灾家庭。"
    },
    {
      "pos": "verb",
      "explanation_en": "To regain strength, energy, or momentum after a setback or period of decline, often through renewed effort or inspiration.",
      "explanation_cn": "指在遭受挫折或低迷后，通过新的努力或激励重新振作、恢复活力或势头。",
      "example_en": "After falling behind by 20 points, the team rallied in the final quarter and won the game.",
      "example_cn": "球队在落后20分的情况下，在最后一节奋起直追，最终赢得了比赛。"
    },
    {
      "pos": "verb",
      "explanation_en": "To organize or mobilize support for a cause, movement, or political campaign, often through public demonstrations or speeches.",
      "explanation_cn": "指为某一事业、运动或政治竞选组织或动员支持，通常通过公开集会或演讲实现。",
      "example_en": "Activists rallied thousands of people to protest the new environmental policy.",
      "example_cn": "活动人士召集了数千人抗议这项新的环境政策。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "gather",
      "analysis": "“Gather”（聚集）是一个中性词，仅表示物理或抽象上的集合，不强调目的性或情感动员。例如“gather books”或“gather information”。而 “rallied” 隐含强烈的目的性、情感激励和集体行动，常用于应对挑战或推动变革。"
    },
    {
      "word_to_compare": "mobilize",
      "analysis": "“Mobilize”（动员）与 “rallied” 非常接近，都用于组织资源或人群以达成目标，但 “mobilize” 更正式、更常用于军事、政府或系统性行动，强调结构化和效率；而 “rallied” 更具情感色彩，常用于非正式或群众性场合，突出精神鼓舞。"
    },
    {
      "word_to_compare": "revive",
      "analysis": "“Revive”（复兴/复苏）侧重于使某物从衰弱、死亡或停滞状态中恢复生机，常用于生命、传统、经济等抽象概念，但不必然涉及人群的集体行动。而 “rallied” 强调的是人因激励而重新行动，是主动的、集体的、有组织的复苏过程。"
    }
  ]
}