{
  "word": "rallies",
  "pronunciation": "ræl·aɪz",
  "concise_definition": "v. 集合, 鼓舞士气, 反击; n. 集会, 示威, 重组",
  "forms": {
    "third_person_singular": "rallies",
    "past_tense": "rallied",
    "past_participle": "rallied",
    "present_participle": "rallying"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To gather or bring together people for a common purpose, especially to restore morale or unite in support of a cause.",
      "explanation_cn": "指召集人们为共同目标聚集，尤指在低落时重振士气或团结起来支持某项事业。",
      "example_en": "The leader rallied his troops before the final battle.",
      "example_cn": "指挥官在最后一战前鼓舞了士兵们的士气。"
    },
    {
      "pos": "verb",
      "explanation_en": "To recover strength or momentum after a setback, often in a competitive or political context.",
      "explanation_cn": "指在遭遇挫折后重新振作、恢复势头，常用于竞技或政治语境。",
      "example_en": "The team rallied in the second half and won the match 3-2.",
      "example_cn": "球队在下半场奋起反击，以3比2赢得了比赛。"
    },
    {
      "pos": "noun",
      "explanation_en": "A public gathering of people, typically to show support for a cause, leader, or political movement.",
      "explanation_cn": "指为表达对某项事业、领袖或政治运动的支持而举行的公众集会。",
      "example_en": "Thousands attended the climate change rally in downtown.",
      "example_cn": "成千上万人参加了市中心的气候变化集会。"
    },
    {
      "pos": "noun",
      "explanation_en": "A series of competitive matches or events, especially in sports such as tennis or motorsport.",
      "explanation_cn": "指一系列竞技比赛或赛事，尤指网球或赛车等体育项目中的系列赛。",
      "example_en": "She won the ATP tennis rallies this season.",
      "example_cn": "她本赛季赢得了ATP网球系列赛。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "demonstration",
      "analysis": "“Demonstration” (示威) 通常指以抗议或表达诉求为主要目的的公开活动，带有更强的政治对抗性；而 “rally” 更强调团结、鼓舞和动员，目的可能是支持而非反对，情绪更积极。"
    },
    {
      "word_to_compare": "meeting",
      "analysis": "“Meeting” (会议) 是中性词，泛指任何形式的聚集商议，规模可大可小，结构较正式；而 “rally” 通常规模更大、更具激情和公众参与性，常伴随演讲、口号和情绪动员。"
    },
    {
      "word_to_compare": "revive",
      "analysis": "“Revive” (复兴/复苏) 是一个抽象动词，指使某事物重新获得生命或活力，常用于生命、传统、经济等；而 “rally” 作为动词时，特指通过集体行动或精神激励实现的恢复，强调外部推动和群体参与。"
    }
  ]
}