{
  "word": "ram",
  "pronunciation": "ram",
  "concise_definition": "n. 公羊, 冲撞, 增强; v. 冲撞, 猛撞",
  "forms": {
    "plural": "rams"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A male sheep, especially one used for breeding; often symbolizing strength, aggression, or leadership in cultural contexts.",
      "explanation_cn": "公羊，尤指用于繁殖的雄性绵羊；在文化语境中常象征力量、攻击性或领导力。",
      "example_en": "The shepherd carefully selected the strongest ram to breed with the flock.",
      "example_cn": "牧羊人仔细挑选了最强壮的公羊来与羊群交配。"
    },
    {
      "pos": "noun",
      "explanation_en": "A heavy, often metal, projecting part of a ship or ancient war machine designed to break through enemy defenses by forceful impact.",
      "explanation_cn": "船首或古代战争器械上突出的沉重（常为金属制）部分，用于通过强力撞击破坏敌方防御。",
      "example_en": "The ancient Greek triremes were equipped with bronze rams to sink enemy vessels.",
      "example_cn": "古希腊的三列桨战船装备了青铜制的撞角，用以击沉敌舰。"
    },
    {
      "pos": "noun",
      "explanation_en": "In computing, a type of memory (Random Access Memory) that allows data to be read or written in almost the same amount of time regardless of the physical location of data inside the memory.",
      "explanation_cn": "在计算机中，指随机存取存储器（Random Access Memory），无论数据在内存中的物理位置如何，都能以几乎相同的时间读取或写入。",
      "example_en": "Upgrading the RAM in your laptop can significantly improve its performance.",
      "example_cn": "升级笔记本电脑的内存可以显著提升其性能。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strike or push something forcefully, especially with the head or front part of a vehicle or object.",
      "explanation_cn": "用头部或车辆/物体的前部猛烈撞击或推撞某物。",
      "example_en": "The car rammed into the barrier at high speed.",
      "example_cn": "汽车以高速撞上了路障。"
    },
    {
      "pos": "verb",
      "explanation_en": "To force or push something forward aggressively or relentlessly, often in a metaphorical sense.",
      "explanation_cn": "以积极或不屈不挠的方式强行推动某物前进，常用于比喻意义。",
      "example_en": "The government is ramming through the controversial legislation despite public opposition.",
      "example_cn": "尽管公众反对，政府仍强行通过了这项有争议的法案。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sheep",
      "analysis": "“Sheep”（绵羊）泛指整个羊群或雌雄皆可的羊，通常象征温顺、从众；而 “ram” 特指雄性绵羊，强调力量、攻击性和主导性，语义更具体且带有象征性对比。"
    },
    {
      "word_to_compare": "battering ram",
      "analysis": "“Battering ram”（攻城槌）是 “ram” 在军事语境中的具体化形式，专指古代用于撞破城墙的重型器械。而单独使用 “ram” 时，可泛指任何撞击装置或动作，语义范围更广。"
    },
    {
      "word_to_compare": "crash",
      "analysis": "“Crash”（碰撞）强调意外、剧烈且常具破坏性的撞击，多用于描述事故；而 “ram” 更强调主动、有目的的冲撞行为，常含蓄地暗示力量与侵略性，语义更精准且常用于法律或政治语境中。"
    }
  ]
}