{
  "word": "rama",
  "pronunciation": "rah·muh",
  "concise_definition": "n. 拉玛（印度教神祇），拉玛（人名），拉玛（计算机术语）",
  "forms": {
    "plural": "ramas"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A major deity in Hinduism, considered the seventh avatar of the god Vishnu; a symbol of virtue, righteousness, and ideal kingship in Indian culture and epics.",
      "explanation_cn": "印度教中的主要神祇，被视为毗湿奴的第七个化身；在印度文化与史诗中象征美德、正义与理想君主的典范。",
      "example_en": "Rama's life and deeds are chronicled in the Ramayana, one of the greatest epics of ancient India.",
      "example_cn": "罗摩的一生与功绩被记载于《罗摩衍那》中，这是古印度最伟大的史诗之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A given name, especially in South Asian cultures, derived from the deity Rama; often used for males and associated with qualities of honor and duty.",
      "explanation_cn": "源自神祇罗摩的男性名字，常见于南亚文化中，常与荣誉、责任等品质相联系。",
      "example_en": "Rama Sharma is a respected teacher in the village, known for his integrity and compassion.",
      "example_cn": "拉玛·夏尔马是村子里一位受人尊敬的教师，以正直和仁慈著称。"
    },
    {
      "pos": "noun",
      "explanation_en": "In computing, a term sometimes used informally to refer to a RAM (Random Access Memory) module or a system's memory architecture, especially in older or regional technical jargon.",
      "explanation_cn": "在计算机领域，有时非正式地用作 RAM（随机存取存储器）模块或系统内存架构的代称，多见于旧式或地区性技术术语中。",
      "example_en": "The old PC needed a rama upgrade to run the new operating system smoothly.",
      "example_cn": "这台旧电脑需要升级内存才能流畅运行新操作系统。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "avatar",
      "analysis": "“Avatar”（化身）在印度教语境中与 “Rama” 密切相关，因为 Rama 是 Vishnu 的一个 avatar。但 “avatar” 是一个更广泛的术语，泛指神灵在人间的任何化身，而 “Rama” 是特指其中一位具体化身，具有完整的历史、神话和文化体系。"
    },
    {
      "word_to_compare": "ram",
      "analysis": "“Ram”（公羊）与 “Rama” 拼写相似，但语义完全不同。前者是动物名称，后者是神名或人名。在计算机术语中，“RAM” 是 “Random Access Memory” 的缩写，而 “rama” 作为其非正式变体，仅在口语或方言中使用，不具备标准技术地位。"
    },
    {
      "word_to_compare": "raama",
      "analysis": "“Raama” 是 “Rama” 在梵语和部分印度语言中的拼写变体，发音相同，语义完全一致。这种拼写差异主要源于语言转写系统（如 IAST）的规范不同，而非词义区别。"
    }
  ]
}