{
  "word": "ranges",
  "pronunciation": "reynj",
  "concise_definition": "n. 范围, 区域, 山脉, 系列",
  "forms": {
    "singular": "range"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The extent or limits within which something varies, operates, or is contained, often referring to a continuous spectrum of values, qualities, or possibilities.",
      "explanation_cn": "指某事物变化、运作或被包含的范围或界限，通常指一系列连续的数值、性质或可能性。",
      "example_en": "The temperature ranges from -10°C to 30°C during the year.",
      "example_cn": "一年中温度范围从零下10摄氏度到30摄氏度。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large, open area of land, especially one used for grazing livestock or for hunting, often characterized by natural terrain such as hills or grasslands.",
      "explanation_cn": "指大片开阔的土地，尤指用于放牧牲畜或狩猎的地区，常以山丘、草原等自然地貌为特征。",
      "example_en": "The cattle roam freely across the vast ranges of western Texas.",
      "example_cn": "牛群在德克萨斯州西部广袤的草原上自由放牧。"
    },
    {
      "pos": "noun",
      "explanation_en": "A series of mountains or hills forming a connected chain or group, often extending over a large geographical area.",
      "explanation_cn": "指连绵成串或成群的山脉或山丘，通常横跨广阔的地理区域。",
      "example_en": "The Rocky Mountains range stretches from Canada to New Mexico.",
      "example_cn": "落基山脉从加拿大一直延伸到新墨西哥州。"
    },
    {
      "pos": "noun",
      "explanation_en": "A set or sequence of similar things arranged in order, such as products, prices, or options.",
      "explanation_cn": "指按顺序排列的一系列相似事物，如产品、价格或选项。",
      "example_en": "The store offers a wide range of organic foods.",
      "example_cn": "这家商店提供种类繁多的有机食品。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "scope",
      "analysis": "“Scope”（范围）更侧重于某事物的覆盖领域、权限或影响的广度，常用于抽象概念，如项目范围、研究范围。而 “range” 更强调具体数值、空间或事物的连续变化区间，更具量化或物理性。"
    },
    {
      "word_to_compare": "area",
      "analysis": "“Area”（区域）泛指任何地理或抽象的空间，强调的是一个平面或区域本身，不强调边界内的变化或多样性。而 “range” 在指地理区域时，常暗示该区域具有某种特定用途（如放牧）或自然特征（如山脉链），并隐含连续性或多样性。"
    },
    {
      "word_to_compare": "series",
      "analysis": "“Series”（系列）强调一系列按顺序排列的独立项目或事件，通常具有重复性或阶段性，如电视系列剧、数学级数。而 “range” 强调的是一个连续统一体内的变化幅度，如温度范围、价格范围，更注重两端之间的连续性而非离散项。"
    }
  ]
}