{
  "word": "ransom",
  "pronunciation": "ran·suhm",
  "concise_definition": "n. 赎金, v. 绑架勒索",
  "forms": {
    "plural": "ransoms",
    "third_person_singular": "ransoms",
    "past_tense": "ransomed",
    "past_participle": "ransomed",
    "present_participle": "ransoming"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sum of money or other payment demanded or paid for the release of a person or property that has been seized or held captive.",
      "explanation_cn": "指为释放被绑架的人或被扣押的财产而被要求或支付的一笔金钱或其他形式的报酬。",
      "example_en": "The kidnappers demanded a ransom of $5 million for the CEO's safe return.",
      "example_cn": "绑匪要求支付500万美元赎金，以确保首席执行官安全获释。"
    },
    {
      "pos": "noun",
      "explanation_en": "Something given or sacrificed to free someone or something from a harmful or oppressive situation, often used metaphorically.",
      "explanation_cn": "泛指为从有害或压迫性境地中解脱而付出的代价，常用于比喻意义。",
      "example_en": "He paid the ransom of years of hard work to earn his freedom from debt.",
      "example_cn": "他用多年辛勤工作作为代价，才摆脱了债务的束缚。"
    },
    {
      "pos": "verb",
      "explanation_en": "To seize and hold someone or something captive in order to demand a ransom for their release.",
      "explanation_cn": "指绑架或扣押某人或某物，以勒索赎金作为释放条件。",
      "example_en": "The militants ransomed the foreign journalists for political concessions.",
      "example_cn": "武装分子绑架了外国记者，以换取政治让步。"
    },
    {
      "pos": "verb",
      "explanation_en": "To free someone or something by paying a ransom.",
      "explanation_cn": "指通过支付赎金来释放被绑架或扣押的人或物。",
      "example_en": "The government refused to ransom the hostages, fearing it would encourage more kidnappings.",
      "example_cn": "政府拒绝支付赎金营救人质，担心这会助长更多绑架事件。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "extortion",
      "analysis": "“Extortion”（勒索）指通过威胁或恐吓强迫他人交出财物或利益，其手段不限于绑架，也可包括毁坏名誉、揭发隐私等。而 “ransom” 特指以释放人或物为条件索取赎金，是 extortion 的一种具体形式。"
    },
    {
      "word_to_compare": "bribe",
      "analysis": "“Bribe”（贿赂）是主动给予财物以换取非法利益或特权，通常为双方自愿交易；而 “ransom” 是被动被迫支付，由施害方单方面提出要求，具有胁迫性和非法拘禁的特征。"
    },
    {
      "word_to_compare": "redemption",
      "analysis": "“Redemption”（救赎/赎回）多用于道德、宗教或情感语境，指通过牺牲或努力使某人或某物从罪恶、错误或困境中解脱，常含积极意义。而 “ransom” 强调物质交换和强制行为，语义更现实、更阴暗。"
    }
  ]
}