{
  "word": "rap",
  "pronunciation": "rap",
  "concise_definition": "n. 说唱音乐; v. 快速敲击, 闲聊, 责备",
  "forms": {
    "third_person_singular": "raps",
    "past_tense": "rapped",
    "past_participle": "rapped",
    "present_participle": "rapping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A style of popular music characterized by rhythmic spoken or chanted lyrics, often accompanied by a beat, originating in African American communities and now a global genre.",
      "explanation_cn": "一种流行音乐风格，以有节奏的说唱或吟诵歌词为特征，通常配有节拍，起源于非裔美国人社区，现已成为全球性音乐类型。",
      "example_en": "She grew up listening to hip-hop and rap, and now she writes her own lyrics.",
      "example_cn": "她从小听嘻哈和说唱音乐，现在自己写歌词。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strike something quickly and repeatedly, especially with a hard object, producing a sharp sound.",
      "explanation_cn": "指用硬物快速、连续地敲击某物，发出清脆的声响。",
      "example_en": "He rapped on the door three times before entering.",
      "example_cn": "他敲了三下门才进去。"
    },
    {
      "pos": "verb",
      "explanation_en": "To talk informally or chat, often at length or in a lively manner.",
      "explanation_cn": "指非正式地交谈、闲聊，常指长时间或热情洋溢地聊天。",
      "example_en": "We sat on the porch and rapped for hours about our childhood memories.",
      "example_cn": "我们坐在门廊上，聊了几个小时的童年回忆。"
    },
    {
      "pos": "verb",
      "explanation_en": "To criticize or scold someone sharply, often in a direct or blunt way.",
      "explanation_cn": "指直接、坦率地批评或责备某人。",
      "example_en": "The manager rapped him for missing the deadline without notice.",
      "example_cn": "经理因他未通知就错过截止日期而严厉批评了他。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hip-hop",
      "analysis": "“Hip-hop” 是一个涵盖说唱、打碟、街舞和涂鸦等元素的综合文化运动，而 “rap” 仅指其中的音乐部分，即有节奏的说唱演唱。因此，所有 rap 都属于 hip-hop，但并非所有 hip-hop 都包含 rap。"
    },
    {
      "word_to_compare": "chat",
      "analysis": "“Chat” (闲聊) 是中性、温和的日常交谈，通常无目的性；而 “rap” 作为动词时，语气更随意、生动，有时带有强烈的情感或长时间的倾诉，常用于口语中，语义更丰富。"
    },
    {
      "word_to_compare": "tap",
      "analysis": "“Tap” (轻敲) 指轻柔、短暂的敲击动作，声音较轻；而 “rap” 强调快速、有力、清脆的敲击，常带有目的性或情绪性，如敲门催促或责备时的语气。"
    }
  ]
}