{
  "word": "rape",
  "pronunciation": "rayp",
  "concise_definition": "n. 强奸, 强暴; v. 强奸, 强暴; n. 暴力掠夺, 破坏",
  "forms": {
    "third_person_singular": "rapes",
    "past_tense": "raped",
    "past_participle": "raped",
    "present_participle": "raping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The crime of forcing someone to have sexual intercourse against their will, often involving physical violence, threats, or abuse of power.",
      "explanation_cn": "指通过暴力、威胁或滥用权力，强迫他人发生性行为的严重犯罪行为。",
      "example_en": "The victim bravely testified in court about the rape she suffered.",
      "example_cn": "受害者勇敢地在法庭上作证，讲述了她所遭受的强奸。"
    },
    {
      "pos": "verb",
      "explanation_en": "To commit sexual assault by forcing someone to engage in sexual activity without consent.",
      "explanation_cn": "指在未经同意的情况下，通过强迫手段与他人发生性行为。",
      "example_en": "He was convicted and sentenced to life in prison for raping a minor.",
      "example_cn": "他因强奸一名未成年人而被定罪，判处终身监禁。"
    },
    {
      "pos": "noun",
      "explanation_en": "The violent and destructive exploitation or plundering of natural resources, land, or cultural heritage, often for profit or power.",
      "explanation_cn": "指为谋取利益或权力而对自然资源、土地或文化遗产进行暴力掠夺或破坏的行为。",
      "example_en": "The rapid industrialization led to the rape of the Amazon rainforest.",
      "example_cn": "快速的工业化导致了对亚马逊雨林的肆意破坏。"
    },
    {
      "pos": "verb",
      "explanation_en": "To plunder, destroy, or exploit something violently and ruthlessly, especially in an environmental or economic context.",
      "explanation_cn": "指在环境或经济背景下，以暴力和无情的方式掠夺或破坏某物。",
      "example_en": "Corporations have been accused of raping the environment for short-term gains.",
      "example_cn": "企业因追求短期利益而被指控肆意破坏环境。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "assault",
      "analysis": "“Assault”（袭击）是一个更广泛的法律术语，指任何非法的暴力行为或威胁，包括身体攻击、性侵犯等。而 “rape” 是 “assault” 的一种极端形式，特指非自愿的性行为，具有明确的性暴力属性。"
    },
    {
      "word_to_compare": "sexual assault",
      "analysis": "“Sexual assault”（性侵犯）是包含强奸在内的更广泛类别，涵盖所有非自愿的性接触，如抚摸、强迫裸露等，不一定涉及插入行为。而 “rape” 在法律上通常特指性交行为，范围更窄但情节更严重。"
    },
    {
      "word_to_compare": "plunder",
      "analysis": "“Plunder”（掠夺）指暴力夺取财物或资源，常用于战争或经济语境，如掠夺黄金、文物等。虽然 “rape” 在比喻义中可与之互换（如 rape the land），但 “plunder” 不含性暴力含义，仅强调物质剥夺。"
    }
  ]
}