{
  "word": "rare",
  "pronunciation": "rair",
  "concise_definition": "adj. 稀有的, 罕见的, 稀薄的, 未熟的",
  "forms": {
    "comparative": "rarer",
    "superlative": "rarest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Not occurring often or in large numbers; uncommon or infrequent in occurrence.",
      "explanation_cn": "指发生频率低、数量稀少，不常见或罕见的情况或事物。",
      "example_en": "It is rare to see a snowstorm in this region during summer.",
      "example_cn": "在夏季看到这场地区的暴风雪是罕见的。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Of high value or quality due to scarcity, especially in collectibles, artifacts, or natural resources.",
      "explanation_cn": "由于稀少而具有高价值或高品质，尤其用于收藏品、文物或自然资源。",
      "example_en": "This vintage Rolex watch is a rare find among collectors.",
      "example_cn": "这款复古劳力士手表在收藏家中是难得的珍品。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Of meat cooked very lightly, with a red, cool center; not fully cooked through.",
      "explanation_cn": "指肉类烹调程度极轻，中心呈红色且较冷，未完全煮熟。",
      "example_en": "He ordered his steak rare, with just a seared exterior.",
      "example_cn": "他点的牛排要三分熟，外层略焦，内里仍呈红色。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Thin or not dense in texture or distribution, especially when referring to air, vegetation, or population.",
      "explanation_cn": "指质地稀薄或分布稀疏，尤用于形容空气、植被或人口。",
      "example_en": "The forest had a rare undergrowth, allowing sunlight to reach the ground easily.",
      "example_cn": "这片森林的下层植被稀疏，阳光能轻易照到地面。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "uncommon",
      "analysis": "“Uncommon”（不常见的）与 “rare” 意义接近，但语气较温和，仅表示“不常发生”，不一定带有珍贵或稀缺的含义。而 “rare” 常隐含价值、珍贵或异常性，语义更强烈。"
    },
    {
      "word_to_compare": "scarce",
      "analysis": "“Scarce”（缺乏的）强调供应不足或资源短缺，常用于物质或必需品（如水、食物），侧重客观的匮乏状态。而 “rare” 更侧重于发生频率低或数量稀少，可用于抽象概念（如机会、人才）或具体物品，不一定涉及资源危机。"
    },
    {
      "word_to_compare": "unique",
      "analysis": "“Unique”（独特的）强调独一无二、无可复制的特性，与是否常见无关。一个事物可以是罕见的（rare）但不独特（如某种常见但稀有的鸟），也可以是独特的但非常普遍（如某种广泛使用的创新设计）。两者维度不同：rare 是频率，unique 是唯一性。"
    }
  ]
}