{
  "word": "ratchet",
  "pronunciation": "rach·it",
  "concise_definition": "n. 棘轮, 棘爪机构; v. 逐步增加, 逐步提升",
  "forms": {
    "third_person_singular": "ratchets",
    "past_tense": "ratcheted",
    "past_participle": "ratcheted",
    "present_participle": "ratcheting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A mechanical device consisting of a toothed wheel and a pawl that allows motion in one direction while preventing it in the opposite direction, commonly used in wrenches, winches, and automotive systems.",
      "explanation_cn": "一种由带齿的轮子和棘爪组成的机械装置，允许物体单向运动，同时阻止反向运动，常用于扳手、绞盘和汽车系统中。",
      "example_en": "The mechanic used a ratchet wrench to loosen the bolt quickly.",
      "example_cn": "机械师用棘轮扳手迅速松开了螺栓。"
    },
    {
      "pos": "verb",
      "explanation_en": "To increase or escalate something gradually and irreversibly, often in small steps, especially in contexts where reversal is difficult or undesirable.",
      "explanation_cn": "指以渐进、不可逆的方式逐步提高或加剧某事物，通常以小步骤进行，尤其在逆转困难或不受欢迎的情境中。",
      "example_en": "The company ratcheted up its marketing budget after seeing strong sales growth.",
      "example_cn": "公司在看到销售强劲增长后，逐步提高了营销预算。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or turn something using a ratchet mechanism, producing a series of small, jerky motions.",
      "explanation_cn": "指使用棘轮装置移动或转动某物，产生一系列小而间歇性的动作。",
      "example_en": "He ratcheted the jack higher to lift the car just enough to change the tire.",
      "example_cn": "他用千斤顶的棘轮机构逐步升高，把车抬高到足以更换轮胎的高度。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "increment",
      "analysis": "“Increment” (增量) 指在数量或程度上的微小、有计划的增加，通常是中性或技术性的描述，如软件版本更新或数学序列。而 “ratchet” 强调这种增加是单向且难以逆转的，常带有负面或压力语境，如成本、税率或压力的持续上升。"
    },
    {
      "word_to_compare": "escalate",
      "analysis": "“Escalate” (升级) 指情况、冲突或问题迅速加剧，通常指突然或剧烈的变化，常用于冲突、争端或情绪层面。而 “ratchet” 更强调缓慢、逐步、机械式地提升，常用于经济、政策或物理机制中，带有持续性和不可逆性的隐喻。"
    },
    {
      "word_to_compare": "tighten",
      "analysis": "“Tighten” (收紧) 指通过施加压力使某物更紧，如收紧螺丝、收紧政策，强调的是物理或制度上的约束增强。而 “ratchet” 不仅指增强，更强调这种增强是通过一系列锁定步骤实现的，每一步都不可退回，具有机制性、累积性特征。"
    }
  ]
}