{
  "word": "rattle",
  "pronunciation": "rat·ul",
  "concise_definition": "v. 使发出咔嗒声, 使不安; n. 摇铃, 咔嗒声",
  "forms": {
    "third_person_singular": "rattles",
    "past_tense": "rattled",
    "past_participle": "rattled",
    "present_participle": "rattling"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To make a series of short, sharp, clattering sounds, typically caused by objects striking each other or vibrating rapidly.",
      "explanation_cn": "指因物体相互撞击或快速振动而发出一系列短促、清脆的咔嗒声。",
      "example_en": "The old car rattled as it sped down the bumpy road.",
      "example_cn": "那辆旧车在颠簸的道路上疾驰时发出咔嗒声。"
    },
    {
      "pos": "verb",
      "explanation_en": "To unsettle or disturb someone emotionally, often by causing anxiety or fear; to shake someone’s composure.",
      "explanation_cn": "指通过引发焦虑或恐惧来扰乱某人的情绪，动摇其镇定。",
      "example_en": "The sudden noise rattled her nerves and made her jump.",
      "example_cn": "突如其来的响声让她心神不宁，吓得跳了起来。"
    },
    {
      "pos": "noun",
      "explanation_en": "A toy consisting of a small object inside a hollow container that makes a rattling sound when shaken, often given to babies.",
      "explanation_cn": "一种玩具，由一个空心容器和内部的小物体组成，摇动时会发出咔嗒声，常作为婴儿玩具。",
      "example_en": "The baby laughed as she shook the colorful rattle.",
      "example_cn": "婴儿摇动着彩色的摇铃，咯咯地笑了起来。"
    },
    {
      "pos": "noun",
      "explanation_en": "A continuous, clattering sound produced by vibrating or colliding objects.",
      "explanation_cn": "由振动或碰撞物体发出的持续性咔嗒声。",
      "example_en": "The rattle of gunfire echoed through the valley.",
      "example_cn": "枪声的咔嗒声在山谷中回荡。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "clatter",
      "analysis": "“Clatter”（叮当声）强调物体硬质碰撞时发出的连续、响亮、杂乱的噪音，通常用于描述餐具、金属或玻璃等硬物的撞击声。而 “rattle” 更侧重于因松动或振动引起的重复性、轻微的咔嗒声，常带有不稳定的意味，如车窗或牙齿的颤动。"
    },
    {
      "word_to_compare": "shake",
      "analysis": "“Shake”（摇动）是一个更广泛的动词，指任何方向的物理晃动，不一定伴随声音。而 “rattle” 特指在摇动过程中产生噪音，强调声音效果。例如，你可以 shake a bottle（摇瓶子），但只有当瓶内有松动物体时才会 rattle（发出咔嗒声）。"
    },
    {
      "word_to_compare": "unsettle",
      "analysis": "“Unsettle”（使不安）是一个抽象的心理动词，泛指破坏心理稳定，但不包含物理声音的含义。而 “rattle” 作为动词时，既可以指物理声响，也可以隐喻性地表示情绪受扰，其语义更具体、更形象，常带有身体反应（如心跳加速、手抖）的联想。"
    }
  ]
}