{
  "word": "rave",
  "pronunciation": "rayv",
  "concise_definition": "v. 狂热地赞扬, 狂喜地谈论; n. 狂热的赞扬, 狂欢派对",
  "forms": {
    "third_person_singular": "raves",
    "past_tense": "raved",
    "past_participle": "raved",
    "present_participle": "raving"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To speak or write with great enthusiasm and praise, often in an exaggerated or unrestrained manner.",
      "explanation_cn": "以极大的热情和赞美之词说话或写作，常带有夸张或不受约束的语气。",
      "example_en": "She raved about the new restaurant, calling it the best meal she'd ever had.",
      "example_cn": "她对这家新餐厅赞不绝口，称这是她吃过的最棒的一餐。"
    },
    {
      "pos": "verb",
      "explanation_en": "To behave in a wild, excited, or uncontrolled way, often due to strong emotion or intoxication.",
      "explanation_cn": "因强烈情绪或醉酒而表现得狂野、兴奋或失去控制。",
      "example_en": "The crowd was raving after the concert, dancing and shouting until dawn.",
      "example_cn": "演唱会结束后，人群狂热地跳舞、呐喊，直到黎明。"
    },
    {
      "pos": "noun",
      "explanation_en": "An enthusiastic and often exaggerated expression of praise or admiration.",
      "explanation_cn": "一种热情洋溢、常带有夸张色彩的赞美或钦佩之辞。",
      "example_en": "The film received raves from critics and audiences alike.",
      "example_cn": "这部电影赢得了评论家和观众的一致好评。"
    },
    {
      "pos": "noun",
      "explanation_en": "A loud, energetic party, especially one featuring electronic dance music and lasting through the night.",
      "explanation_cn": "一种喧闹、充满活力的派对，通常以电子舞曲为主，并持续整夜。",
      "example_en": "They went to a rave in the woods and danced until sunrise.",
      "example_cn": "他们去森林里参加了一场狂欢派对，一直跳到日出。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "praise",
      "analysis": "“Praise”（赞扬）是中性或正式的表达，强调对成就或品质的认可，语气通常克制、理性。而 “rave” 强调情绪的高涨与表达的夸张，带有强烈的情感色彩和非正式感。"
    },
    {
      "word_to_compare": "celebrate",
      "analysis": "“Celebrate”（庆祝）侧重于通过仪式、活动或聚会来纪念某事，强调行为本身；而 “rave” 作为动词时，强调的是言语或行为的狂热状态，作为名词时则特指一种音乐派对，语义范围更窄、更具体。"
    },
    {
      "word_to_compare": "party",
      "analysis": "“Party”（派对）是泛指任何形式的社交聚会，形式多样，气氛可正式可随意；而 “rave” 特指以电子音乐、灯光效果和通宵狂欢为特征的青年文化派对，具有明确的亚文化标签和风格。"
    }
  ]
}