{
  "word": "ravens",
  "pronunciation": "ray·vanz",
  "concise_definition": "n. 乌鸦（复数形式）",
  "forms": {
    "singular": "raven"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A large, entirely black bird of the crow family, known for its intelligence, distinctive croaking call, and association with mystery or death in folklore and literature.",
      "explanation_cn": "一种体型庞大、通体黑色的鸦科鸟类，以聪明、独特的呱呱叫声以及在民间传说和文学中与神秘或死亡的关联而闻名。",
      "example_en": "A flock of ravens circled above the ancient castle, their cries echoing through the mist.",
      "example_cn": "一群乌鸦在古老的城堡上空盘旋，它们的叫声在薄雾中回荡。"
    },
    {
      "pos": "noun",
      "explanation_en": "In Norse mythology and some Native American traditions, the raven is a sacred symbol of creation, transformation, or a trickster deity.",
      "explanation_cn": "在北欧神话和一些美洲原住民传统中，乌鸦是创造、转变或诡计之神的神圣象征。",
      "example_en": "In Celtic legends, the raven was believed to be the spirit of the war goddess Morrigan.",
      "example_cn": "在凯尔特传说中，乌鸦被认为是战争女神摩莉甘的灵魂。"
    },
    {
      "pos": "noun",
      "explanation_en": "A nickname or symbol used by sports teams, organizations, or cultural groups, often to evoke strength, intelligence, or a dark, mysterious aura.",
      "explanation_cn": "常被体育队伍、组织或文化团体用作昵称或象征，以唤起力量、智慧或黑暗神秘的氛围。",
      "example_en": "The Baltimore Ravens won the Super Bowl in 2000, named after the famous poem by Edgar Allan Poe.",
      "example_cn": "巴尔的摩乌鸦队于2000年赢得超级碗，其名称取自埃德加·爱伦·坡的著名诗篇。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "crows",
      "analysis": "“Crows”（乌鸦）与 “ravens” 同属鸦科，外形相似，但乌鸦体型较小，叫声更尖锐（“caw”），尾羽呈扇形；而乌鸦体型更大，叫声更低沉（“croak”），尾羽呈楔形。在文化象征上，乌鸦更常与城市环境和实用智慧相关，而乌鸦则更多与神话、死亡和神秘力量联系在一起。"
    },
    {
      "word_to_compare": "rooks",
      "analysis": "“Rooks”（寒鸦）是另一种鸦科鸟类，羽毛呈灰黑色，面部有裸露的灰白色皮肤，常群居于树上。它们比乌鸦更温顺，社会性更强，常出现在乡村田野，文化象征较温和，较少与死亡或超自然联系。相比之下，乌鸦更具威严和神秘感。"
    },
    {
      "word_to_compare": "blackbirds",
      "analysis": "“Blackbirds”（黑鸟）泛指多种黑色羽毛的鸟类，如欧洲黑鸟或美洲黑鹂，体型通常比乌鸦小，鸣声悦耳，常象征春天或爱情。它们不具乌鸦那种阴郁、智慧或神谕的象征意义，文化意象更偏向自然与诗意，而非神秘或预兆。"
    }
  ]
}