{
  "word": "raw",
  "pronunciation": "raw",
  "concise_definition": "adj. 未加工的, 生的, 原始的, 尖锐的; n. 未加工的状态",
  "forms": {
    "comparative": "rawer",
    "superlative": "rawest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "In a natural, unprocessed, or uncooked state, especially referring to food or materials that have not been altered by cooking, refining, or manufacturing.",
      "explanation_cn": "指处于自然、未经加工或未烹煮的状态，尤其用于描述未经烹饪、精炼或制造的食物或材料。",
      "example_en": "She prefers to eat raw vegetables for their nutritional value.",
      "example_cn": "她更喜欢生吃蔬菜以获取其营养价值。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Unrefined or unfiltered, often describing emotions, language, or data that are direct, unpolished, and sometimes harsh or unsettling.",
      "explanation_cn": "指未经修饰或过滤的，常用于描述情感、语言或数据，具有直接、粗粝、有时令人不安的特质。",
      "example_en": "His raw honesty made the audience uncomfortable but impressed them with its sincerity.",
      "example_cn": "他直率的诚实让观众感到不适，却因其真诚而令人钦佩。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Not yet experienced or trained; lacking skill or maturity, often used to describe a person or their abilities.",
      "explanation_cn": "指缺乏经验或训练的，能力尚不成熟，常用于形容人或其技能。",
      "example_en": "The young athlete showed raw talent but needed coaching to refine his technique.",
      "example_cn": "这位年轻运动员展现出天赋，但需要教练指导来完善技术。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Exposed to the elements or harsh conditions without protection, often describing weather or physical exposure.",
      "explanation_cn": "指暴露在自然元素或恶劣环境中而无保护，常用于描述天气或身体暴露状态。",
      "example_en": "They spent the night in raw wind and freezing rain.",
      "example_cn": "他们在刺骨寒风和冻雨中度过了整夜。"
    },
    {
      "pos": "noun",
      "explanation_en": "The unprocessed or original form of something, especially in contexts like data, materials, or resources.",
      "explanation_cn": "指某物未经加工或原始的状态，尤其用于数据、材料或资源的语境中。",
      "example_en": "The report is based on raw data collected from field surveys.",
      "example_cn": "这份报告基于从实地调查中收集的原始数据。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "uncooked",
      "analysis": "“Uncooked”（未煮熟的）仅限于描述食物未经过加热处理，范围狭窄；而 “raw” 不仅可用于食物，还可形容情感、数据、经验等，语义更广泛，且常带有情感或风格上的冲击力。"
    },
    {
      "word_to_compare": "primitive",
      "analysis": "“Primitive”（原始的）强调技术或文明发展水平低，常含贬义，指落后或简陋；而 “raw” 强调未加工或未经修饰的状态，中性或褒义，如“raw talent”（天赋异禀），不涉及进化程度。"
    },
    {
      "word_to_compare": "crude",
      "analysis": "“Crude”（粗劣的）常指质量低劣、不精致，带有负面评价，如 crude oil（原油）或 crude humor（粗俗幽默）；而 “raw” 更强调自然本真或未经修饰，不一定贬义，甚至可表达真实与力量，如 raw emotion（真挚情感）。"
    }
  ]
}