{
  "word": "ray",
  "pronunciation": "ray",
  "concise_definition": "n. 光线, 射线, 一丝, 一群鱼; v. 发射光线",
  "forms": {
    "plural": "rays"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A narrow beam of light, heat, or other radiation emitted from a source, often traveling in a straight line.",
      "explanation_cn": "指从光源发出的狭窄光束、热束或其他辐射，通常沿直线传播。",
      "example_en": "A single ray of sunlight broke through the clouds, illuminating the forest floor.",
      "example_cn": "一束阳光穿透云层，照亮了森林地面。"
    },
    {
      "pos": "noun",
      "explanation_en": "A flat, bottom-dwelling fish with a broad, flattened body and long, wing-like pectoral fins, often found in warm oceans.",
      "explanation_cn": "指一种身体扁平、生活在海底的鱼类，具有宽大的翼状胸鳍，常见于温暖的海洋中。",
      "example_en": "The divers were amazed to see a large manta ray gliding gracefully through the water.",
      "example_cn": "潜水员惊讶地看到一条巨大的蝠鲼优雅地在水中滑行。"
    },
    {
      "pos": "noun",
      "explanation_en": "A trace or hint of something, especially a faint indication of emotion or quality.",
      "explanation_cn": "指某事物的微弱痕迹或迹象，尤指情感或品质的一丝流露。",
      "example_en": "There wasn't a ray of hope left after the devastating news.",
      "example_cn": "在听到这个毁灭性的消息后，连一丝希望都没有了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To emit or send out rays of light or radiation.",
      "explanation_cn": "指发出光线或辐射。",
      "example_en": "The sun rays through the window warmed the entire room.",
      "example_cn": "阳光透过窗户照亮了整个房间。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "beam",
      "analysis": "“Beam”（光束）与 “ray” 非常接近，常可互换，但 “beam” 更常用于描述较宽、较集中、有明确方向的光或能量流，如激光束或手电筒光束；而 “ray” 更强调细长、纤细、甚至抽象的光线或痕迹，常用于诗意或文学语境。"
    },
    {
      "word_to_compare": "radiation",
      "analysis": "“Radiation”（辐射）是更科学、更广泛的术语，泛指任何形式的能量以波或粒子形式传播，包括电磁波、粒子流等；而 “ray” 通常特指可见光或某种特定类型的辐射（如X射线），更具体、更形象，常用于日常语言或非专业语境。"
    },
    {
      "word_to_compare": "glow",
      "analysis": "“Glow”（微光）指物体自身发出的柔和、弥漫的光，强调光的温暖感和持续性，如萤火虫的光或炉火的余晖；而 “ray” 是直线传播的、有方向性的光束，强调穿透力和聚焦性，两者在形态和语义上截然不同。"
    }
  ]
}