{
  "word": "rays",
  "pronunciation": "rāz",
  "concise_definition": "n. 光线, 射线, 辐射, 一束",
  "forms": {
    "singular": "ray"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A narrow beam of light, heat, or other radiation emitted from a source, often traveling in a straight line.",
      "explanation_cn": "从光源发出的狭窄光束、热束或其他形式的辐射，通常沿直线传播。",
      "example_en": "Morning rays streamed through the window, warming the room.",
      "example_cn": "晨光透过窗户洒进来，温暖了整个房间。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of flat, cartilaginous fish related to sharks, typically with a broad, disc-shaped body and long, whip-like tail.",
      "explanation_cn": "一种与鲨鱼相关的扁平软骨鱼，通常具有宽大的盘状身体和细长的鞭状尾巴。",
      "example_en": "We saw several stingrays gliding gracefully over the coral reef.",
      "example_cn": "我们看到几条电鳐优雅地在珊瑚礁上方滑行。"
    },
    {
      "pos": "noun",
      "explanation_en": "A radial line or direction extending outward from a central point, often used metaphorically to describe a spreading pattern.",
      "explanation_cn": "从中心点向外延伸的放射状线条或方向，常用于比喻描述扩散的模式。",
      "example_en": "The sun's rays radiated outward in all directions.",
      "example_cn": "太阳的光线向四面八方辐射开来。"
    },
    {
      "pos": "noun",
      "explanation_en": "A thin, elongated streak or line of light, color, or energy, especially when appearing in a visual scene.",
      "explanation_cn": "视觉场景中出现的细长光带、色带或能量线，尤指在光影效果中。",
      "example_en": "A single ray of gold light pierced through the storm clouds.",
      "example_cn": "一道金色的光线穿透了乌云。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "beam",
      "analysis": "“Beam”（光束）通常指更集中、更强烈的光线或能量流，常用于技术或工程语境，如激光束、无线电波束。而 “ray” 更常用于自然光、诗意或抽象语境，强调其细长、发散的特性，范围更广，也更柔和。"
    },
    {
      "word_to_compare": "radiation",
      "analysis": "“Radiation”（辐射）是更广泛的科学术语，泛指任何形式的能量以波或粒子形式传播，包括电离辐射、热辐射等。而 “ray” 是辐射的一种具体表现形式，如 X-ray、gamma ray，更具体、更形象，常用于可观察的单束形式。"
    },
    {
      "word_to_compare": "spoke",
      "analysis": "“Spoke”（辐条）指车轮中从中心向外辐射的刚性结构，常用于比喻（如‘the spokes of a wheel’）。虽然两者都可表示从中心向外延伸的线条，但 ‘ray’ 多用于光、能量或抽象概念，而 ‘spoke’ 仅用于物理结构，且不具能量或光的含义。"
    }
  ]
}