{
  "word": "reaction",
  "pronunciation": "ree·ak·shun",
  "concise_definition": "n. 反应, 反作用, 化学反应",
  "forms": {
    "plural": "reactions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A response or action that occurs as a result of a particular stimulus, event, or influence, often involving emotion, behavior, or physical change.",
      "explanation_cn": "指因特定刺激、事件或影响而产生的回应或行为，常涉及情感、行为或物理变化。",
      "example_en": "The public's reaction to the new policy was overwhelmingly negative.",
      "example_cn": "公众对这项新政策的反应普遍负面。"
    },
    {
      "pos": "noun",
      "explanation_en": "A chemical process in which one or more substances are transformed into different substances through interaction, often involving the breaking and forming of chemical bonds.",
      "explanation_cn": "指一种或多种物质通过相互作用转化为不同物质的化学过程，通常涉及化学键的断裂与形成。",
      "example_en": "The reaction between sodium and water produces hydrogen gas and sodium hydroxide.",
      "example_cn": "钠与水的反应会产生氢气和氢氧化钠。"
    },
    {
      "pos": "noun",
      "explanation_en": "A physical or physiological response of the body to a stimulus, such as an allergic reaction or reflex.",
      "explanation_cn": "指身体对刺激产生的生理或物理反应，如过敏反应或反射。",
      "example_en": "He had a severe allergic reaction to the bee sting.",
      "example_cn": "他对蜂蜇产生了严重的过敏反应。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "response",
      "analysis": "“Response” (回应) 是一个更广泛、更中性的词，泛指对任何刺激的回应，可以是语言、行为或心理上的，不强调因果关系的强度或物理性。而 “reaction” 更常暗示一种即时、本能或强烈的情绪/生理反应，有时带有被动性或不可控性。"
    },
    {
      "word_to_compare": "effect",
      "analysis": "“Effect” (效果/影响) 指某个原因导致的最终结果或后果，强调的是结果本身，而非过程或行为。而 “reaction” 更侧重于主体对刺激的主动或被动回应过程。例如：‘The effect of the drug was calmness’（药物的效果是平静），而 ‘His reaction to the news was anger’（他对这个消息的反应是愤怒）。"
    },
    {
      "word_to_compare": "counteraction",
      "analysis": "“Counteraction” (对抗/反制) 指为抵消某种作用而采取的相反行动，具有明确的目的性和对抗性。而 “reaction” 可以是中性、积极或消极的，不一定具有对抗意图。例如：政府的反制措施是 counteraction，而民众的抗议只是 reaction。"
    }
  ]
}