{
  "word": "reach",
  "pronunciation": "reech",
  "concise_definition": "v. 到达, 达到, 联系; n. 范围, 影响力",
  "forms": {
    "third_person_singular": "reaches",
    "past_tense": "reached",
    "past_participle": "reached",
    "present_participle": "reaching"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To arrive at a place, destination, or point after traveling or moving, often after effort or time.",
      "explanation_cn": "指经过旅行或移动后抵达某个地点、目的地或特定点，常暗示付出努力或耗费时间。",
      "example_en": "We reached the summit just before sunset.",
      "example_cn": "我们在日落前抵达了山顶。"
    },
    {
      "pos": "verb",
      "explanation_en": "To attain or achieve a goal, level, or standard, often one that is difficult or distant.",
      "explanation_cn": "指达到某个目标、水平或标准，通常指那些难以企及或遥远的目标。",
      "example_en": "The company reached its annual sales target ahead of schedule.",
      "example_cn": "该公司提前完成了年度销售目标。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make contact with someone, especially by phone, email, or other means of communication.",
      "explanation_cn": "指通过电话、电子邮件或其他方式与某人取得联系。",
      "example_en": "I tried to reach her by phone, but she didn't answer.",
      "example_cn": "我试着给她打电话，但她没接。"
    },
    {
      "pos": "noun",
      "explanation_en": "The extent or scope over which something can be accessed, influenced, or effective, often referring to physical distance or social influence.",
      "explanation_cn": "指某事物可被触及、影响或生效的范围，常指物理距离或社会影响力。",
      "example_en": "The new policy has a wide reach, affecting millions of people.",
      "example_cn": "这项新政策影响广泛，波及数百万人。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of stretching out one's arm or hand to touch or grasp something.",
      "explanation_cn": "指伸出手臂或手去触碰或抓取某物的动作。",
      "example_en": "She made a final reach for the book on the top shelf.",
      "example_cn": "她最后伸手去够书架顶层的那本书。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "arrive",
      "analysis": "“Arrive” (到达) 专指抵达某个地点，强调终点的完成，通常不涉及过程或努力。而 “reach” 更强调通过努力或克服障碍后抵达，且可引申用于抽象目标（如达成目标），适用范围更广。"
    },
    {
      "word_to_compare": "attain",
      "analysis": "“Attain” (获得/达成) 与 “reach” 在达成目标的语义上高度重合，但 “attain” 更正式，常用于抽象成就（如权力、地位），而 “reach” 更口语化，且可同时用于物理位置和抽象目标，语义更灵活。"
    },
    {
      "word_to_compare": "contact",
      "analysis": "“Contact” (联系) 是一个更直接、更中性的词，仅指建立沟通行为本身，不隐含努力或距离。而 “reach” 在表示联系时，常暗示对方难以联系或需要主动努力，如 ‘reach out to someone’，带有更强的主动性与情感色彩。"
    },
    {
      "word_to_compare": "scope",
      "analysis": "“Scope” (范围) 指某事物的涵盖领域或可能性边界，多用于计划、研究或能力的广度，偏静态描述。而 “reach” 作为名词时，强调的是实际可触及或影响的范围，更具动态性和影响力维度，如 ‘social reach’ 指实际影响的人群数量。"
    }
  ]
}