{
  "word": "reactionary",
  "pronunciation": "ree·ak·shuh·nair·ee",
  "concise_definition": "adj. 保守的, 反动的; n. 保守派, 反动派",
  "forms": {
    "comparative": "more reactionary",
    "superlative": "most reactionary",
    "plural": "reactionaries"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Opposed to political or social change; seeking to return to a previous, often more traditional or authoritarian state of society, typically by resisting progressive reforms.",
      "explanation_cn": "反对政治或社会变革；试图回归到过去更传统或更专制的社会状态，通常表现为抵制进步性改革。",
      "example_en": "The reactionary government banned all public protests and restored strict censorship laws.",
      "example_cn": "这个保守派政府禁止了所有公开抗议，并恢复了严格的审查制度。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by extreme conservatism or resistance to innovation, especially in ideology, culture, or institutional structure.",
      "explanation_cn": "以极端保守或抗拒创新为特征，尤其体现在意识形态、文化或制度结构上。",
      "example_en": "His reactionary views on gender roles made him unpopular among younger colleagues.",
      "example_cn": "他对性别角色的保守观点使他在年轻同事中很不受欢迎。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who holds or advocates reactionary views, especially one who seeks to reverse social or political progress.",
      "explanation_cn": "指持有或主张反动观点的人，尤指试图逆转社会或政治进步的人。",
      "example_en": "The revolutionaries accused the aristocrats of being reactionary elements intent on restoring the monarchy.",
      "example_cn": "革命者指责贵族是企图恢复君主制的反动势力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "conservative",
      "analysis": "“Conservative”（保守的）泛指倾向于维持现状、反对激进变革的人或立场，语义中性，常用于政治光谱的描述。而 “reactionary” 更具贬义，强调不仅保守，而且积极试图逆转已有的进步成果，立场更极端、更具对抗性。"
    },
    {
      "word_to_compare": "traditionalist",
      "analysis": "“Traditionalist”（传统主义者）强调尊重和维护传统习俗、价值观或制度，通常出于文化认同或信仰，不一定反对变革本身。而 “reactionary” 则带有政治对抗性，其目标是恢复已被废除或取代的旧秩序，常与历史倒退相关联。"
    },
    {
      "word_to_compare": "extremist",
      "analysis": "“Extremist”（极端分子）泛指在任何领域（宗教、政治、社会）持极端立场的人，不特指方向。而 “reactionary” 是一种特定类型的极端主义——即向后看、试图恢复旧制度的极端保守主义。因此，所有reactionaries都是extremists，但并非所有extremists都是reactionaries。"
    }
  ]
}