{
  "word": "read",
  "pronunciation": "reed",
  "concise_definition": "v. 阅读, 朗读, 理解; n. 阅读, 读物",
  "forms": {
    "third_person_singular": "reads",
    "past_tense": "read",
    "past_participle": "read",
    "present_participle": "reading"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To look at and understand the meaning of written or printed words by interpreting symbols, letters, or characters.",
      "explanation_cn": "通过解读文字、字母或符号来理解书面或印刷内容的含义。",
      "example_en": "She reads three novels every month to improve her vocabulary.",
      "example_cn": "她每月读三本小说以扩大词汇量。"
    },
    {
      "pos": "verb",
      "explanation_en": "To speak or recite written words aloud, often for the benefit of others.",
      "explanation_cn": "大声朗读或复述书面文字，通常是为了让他人聆听。",
      "example_en": "The teacher asked the student to read the poem aloud to the class.",
      "example_cn": "老师让学生为全班朗读这首诗。"
    },
    {
      "pos": "verb",
      "explanation_en": "To interpret or understand information presented in a non-verbal or symbolic form, such as signs, data, or expressions.",
      "explanation_cn": "解读以非语言或符号形式呈现的信息，如标志、数据或表情。",
      "example_en": "He can read body language very well and knows when someone is lying.",
      "example_cn": "他非常擅长解读肢体语言，能判断出谁在撒谎。"
    },
    {
      "pos": "noun",
      "explanation_en": "An act or instance of reading, especially as a leisure activity; also refers to a book or text that is enjoyable or informative to read.",
      "explanation_cn": "指阅读的行为或一次阅读经历，尤指作为休闲活动；也可指一本有趣或有启发性的读物。",
      "example_en": "This mystery novel is a great read for a rainy afternoon.",
      "example_cn": "这本侦探小说是雨天午后绝佳的读物。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "scan",
      "analysis": "“Scan”（浏览/快速查看）指快速地、不深入地查看文字或信息，目的是获取大意或寻找特定内容，而非仔细理解。而 “read” 强调专注、完整地理解内容，通常伴随思考和记忆。"
    },
    {
      "word_to_compare": "study",
      "analysis": "“Study”（研究/钻研）比 “read” 更深入，通常包含分析、记忆、批判性思考和反复查阅，常用于学术或专业语境。而 “read” 可以是轻松的、表面的，不一定伴随深度思考。"
    },
    {
      "word_to_compare": "interpret",
      "analysis": "“Interpret”（解释/诠释）侧重于对模糊、抽象或非文字信息（如艺术、语言、行为）赋予意义，常涉及主观判断。而 “read” 在非字面用法中虽可表示‘理解’，但更强调从已明确表达的信息中提取含义，如读图表、读表情。"
    }
  ]
}