{
  "word": "reading",
  "pronunciation": "reed·ing",
  "concise_definition": "n. 阅读, 朗读, 读物, 解释",
  "forms": {
    "plural": "readings"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of looking at and understanding written or printed words, often for the purpose of gaining information, learning, or enjoyment.",
      "explanation_cn": "指阅读书面或印刷文字的行为，通常是为了获取信息、学习或享受。",
      "example_en": "She spends an hour every evening in quiet reading.",
      "example_cn": "她每天晚上花一小时安静地阅读。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of aloudly reciting or performing a written text, such as a poem, passage, or speech, often in a public or formal setting.",
      "explanation_cn": "指在公共或正式场合大声朗读或表演书面文本，如诗歌、段落或演讲。",
      "example_en": "The poet gave a powerful reading of her latest work at the literary festival.",
      "example_cn": "这位诗人在文学节上深情地朗读了她的最新作品。"
    },
    {
      "pos": "noun",
      "explanation_en": "A book, article, or other written material that is read, especially when assigned or recommended for study or entertainment.",
      "explanation_cn": "指被阅读的书籍、文章或其他文字材料，尤指被指定或推荐用于学习或娱乐的读物。",
      "example_en": "Our class assignment this week is a challenging reading from Kafka.",
      "example_cn": "我们这周的作业是阅读卡夫卡的一篇难度较高的作品。"
    },
    {
      "pos": "noun",
      "explanation_en": "An interpretation or understanding of a text, symbol, or situation, often implying a subjective or contextual meaning.",
      "explanation_cn": "指对文本、符号或情境的解释或理解，常暗示一种主观或语境化的含义。",
      "example_en": "His reading of the ancient manuscript revealed new insights into medieval philosophy.",
      "example_cn": "他对这份古手稿的解读揭示了中世纪哲学的新见解。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "study",
      "analysis": "“Study”（学习/研究）强调系统性、深入性和分析性的过程，通常包含思考、笔记、记忆和批判性分析，而 “reading” 更侧重于视觉接收和理解文字内容，不一定包含深度分析。"
    },
    {
      "word_to_compare": "literature",
      "analysis": "“Literature”（文学）指具有艺术价值和思想深度的书面作品总称，是一个类别概念；而 “reading” 是一个行为或具体文本，可以是文学，也可以是说明书、新闻等非文学材料。"
    },
    {
      "word_to_compare": "recitation",
      "analysis": "“Recitation”（背诵/朗诵）强调记忆后准确复述，常用于诗歌或经典文本的表演，注重发音、节奏和表现力；而 “reading” 更强调对文本的即时理解与表达，不必然要求背诵。"
    }
  ]
}