{
  "word": "realistic",
  "pronunciation": "ree·uh·lis·tik",
  "concise_definition": "adj. 现实的, 实际的, 写实的",
  "forms": {
    "comparative": "more realistic",
    "superlative": "most realistic"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Based on or representing things as they actually are, without idealization or exaggeration; grounded in practical reality.",
      "explanation_cn": "基于或真实地反映事物的本来面貌，不加理想化或夸张；以实际现实为基础的。",
      "example_en": "The movie's portrayal of war is surprisingly realistic, showing the fear and chaos soldiers face.",
      "example_cn": "这部电影对战争的描绘出人意料地写实，展现了士兵所面临的恐惧与混乱。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Having a practical and sensible attitude toward situations, especially when accepting limitations or constraints.",
      "explanation_cn": "对情况持有务实、理智的态度，尤其指能够接受现实中的限制或约束。",
      "example_en": "It's more realistic to save a little each month than to expect to buy a house next year.",
      "example_cn": "每月存一点钱，比指望明年就能买房更现实。"
    },
    {
      "pos": "adjective",
      "explanation_en": "In art or media, depicting subjects with accurate detail and natural appearance, often contrasting with stylized or abstract forms.",
      "explanation_cn": "在艺术或媒体中，以准确的细节和自然的外观描绘主题，常与风格化或抽象形式形成对比。",
      "example_en": "The painter's realistic style captures every wrinkle and shadow on the old man's face.",
      "example_cn": "这位画家的写实风格精准地捕捉了老人脸上每一道皱纹和阴影。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "practical",
      "analysis": "“Practical”（实际的）强调某事物具有可操作性、实用性，关注是否能有效解决问题或完成任务，常用于方法、工具或计划。而 “realistic” 更侧重于是否符合现实状况，包括客观限制、可能性和真实本质，范围更广，可涵盖态度、期望或表现形式。"
    },
    {
      "word_to_compare": "true-to-life",
      "analysis": "“True-to-life”（栩栩如生的）是 “realistic” 在艺术或描述语境中的近义词，但更强调“逼真”和“高度还原”，常用于形容人物、场景或情节的细节真实性。而 “realistic” 语义更宽泛，可指态度、预期或表现方式，不一定局限于视觉或叙事层面。"
    },
    {
      "word_to_compare": "reasonable",
      "analysis": "“Reasonable”（合理的）指合乎逻辑、公平或适度，常用于判断、要求或期望是否在可接受范围内。它强调理性与公正，而 “realistic” 更强调是否与现实条件相符。一个要求可以是合理的（如合理工资），但未必现实（如在经济萧条时要求高薪）。"
    }
  ]
}