{
  "word": "realism",
  "pronunciation": "ree·uh·liz·uhm",
  "concise_definition": "n. 现实主义, 求实态度, 写实风格",
  "forms": {
    "plural": "realisms"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An artistic, literary, or theatrical movement that seeks to represent subjects as they appear in everyday life, without idealization, exaggeration, or stylization.",
      "explanation_cn": "指一种艺术、文学或戏剧运动，旨在以不加理想化、夸张或风格化的方式，如实表现日常生活中的事物和人物。",
      "example_en": "The novel's realism made readers feel as though they were witnessing the struggles of ordinary people firsthand.",
      "example_cn": "这部小说的写实风格让读者仿佛亲身目睹了普通人的挣扎。"
    },
    {
      "pos": "noun",
      "explanation_en": "A practical approach to life or decision-making that prioritizes facts, conditions, and possibilities over ideals or fantasies.",
      "explanation_cn": "指一种面对生活或做决策时注重事实、现实条件和可能性，而非理想或幻想的务实态度。",
      "example_en": "Her realism helped her accept the challenges of the job rather than dreaming of impossible perfection.",
      "example_cn": "她的务实态度使她能够接受工作的挑战，而不是幻想不可能的完美。"
    },
    {
      "pos": "noun",
      "explanation_en": "In philosophy, the belief that objects and events exist independently of our perception or thought about them.",
      "explanation_cn": "在哲学中，指认为物体和事件独立于我们的感知或思想而存在的观点。",
      "example_en": "Scientific realism holds that the entities described by scientific theories (like electrons) really exist, even if unobservable.",
      "example_cn": "科学现实主义认为，科学理论所描述的实体（如电子）即使不可观测，也真实存在。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "naturalism",
      "analysis": "“Naturalism” (自然主义) 是现实主义的一种极端形式，强调环境、遗传和生理因素对人类行为的决定性影响，常带有宿命论色彩。而 “realism” 更广泛地关注客观呈现现实，不必然强调决定论。"
    },
    {
      "word_to_compare": "idealism",
      "analysis": "“Idealism” (理想主义) 主张现实由思想、观念或精神构成，强调完美、抽象或道德上的应然状态。而 “realism” 则坚持现实是独立于主观愿望的客观存在，两者在哲学和艺术上常形成对立。"
    },
    {
      "word_to_compare": "verisimilitude",
      "analysis": "“Verisimilitude” (逼真性) 指作品在表面上看起来真实可信，即使内容是虚构的。它是一种效果或技巧，而 “realism” 是一种有意识的艺术或哲学立场。一个作品可以有 verisimilitude 而不一定是 realism（如奇幻小说中的逼真细节），但 realism 通常追求 verisimilitude。"
    }
  ]
}