{
  "word": "rebel",
  "pronunciation": "ri·bel",
  "concise_definition": "v. 反抗, 造反; n. 反叛者, 反抗者",
  "forms": {
    "third_person_singular": "rebels",
    "past_tense": "rebelled",
    "past_participle": "rebelled",
    "present_participle": "rebeling",
    "noun_plural": "rebels"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To resist or defy authority, rules, or established norms, often through open opposition or defiance.",
      "explanation_cn": "指反抗权威、规则或既定规范，通常表现为公开的对抗或不服从。",
      "example_en": "The students rebelled against the strict school dress code.",
      "example_cn": "学生们反抗了学校严格的着装规定。"
    },
    {
      "pos": "verb",
      "explanation_en": "To act in opposition to conventional expectations or societal standards, especially in behavior, style, or thought.",
      "explanation_cn": "指在行为、风格或思想上违背传统期望或社会规范，常带有反叛或特立独行的意味。",
      "example_en": "She rebelled against her parents' conservative values by adopting a punk aesthetic.",
      "example_cn": "她通过采用朋克风格来反抗父母保守的价值观。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who resists or rises in opposition to an established government, authority, or system, often through armed or organized resistance.",
      "explanation_cn": "指反抗现有政府、权威或制度的人，通常通过武装或有组织的方式进行抵抗。",
      "example_en": "The rebels captured the capital after months of guerrilla warfare.",
      "example_cn": "经过数月的游击战，叛军攻占了首都。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who refuses to conform to social norms or conventions, especially in lifestyle, fashion, or ideology.",
      "explanation_cn": "指拒绝遵从社会规范或习俗的人，尤其在生活方式、时尚或意识形态方面。",
      "example_en": "He was considered a rebel for refusing to wear a tie to the office.",
      "example_cn": "他因拒绝在办公室打领带而被视为叛逆者。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "revolt",
      "analysis": "“Revolt” (起义/暴动) 通常指更激烈、更突然、更具集体性和暴力性的反抗，常用于政治或社会层面的大规模反抗，如革命。而 “rebel” 可以是个人或小群体的持续性反抗，语气相对温和，适用范围更广。"
    },
    {
      "word_to_compare": "defy",
      "analysis": "“Defy” (公然违抗) 强调有意识地挑战权威或规则，但不一定伴随行动或组织性。它更侧重于态度上的对抗，如“defy the law”；而 “rebel” 不仅包含态度，还常伴随实际行动或系统性抵抗。"
    },
    {
      "word_to_compare": "insurgent",
      "analysis": "“Insurgent” (叛乱者) 是一个更正式、军事化的术语，特指参与武装叛乱、推翻政府的组织成员，多用于政治或战争语境。而 “rebel” 语义更宽泛，可指任何类型的反抗者，包括文化或个人层面的反叛。"
    }
  ]
}