{
  "word": "rebirth",
  "pronunciation": "ree·re·bɜːrθ",
  "concise_definition": "n. 复活, 复兴, 重生",
  "forms": {
    "plural": "rebirths"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of being born again or coming back to life after a period of decline, death, or dormancy, often used metaphorically to describe a renewal of spirit, culture, or organization.",
      "explanation_cn": "指在经历衰退、死亡或沉寂之后重新获得生命或活力的过程，常用于比喻精神、文化或组织的复兴与更新。",
      "example_en": "The city experienced a cultural rebirth after the old theaters were restored and new art galleries opened.",
      "example_cn": "在旧剧院得到修复、新画廊开业后，这座城市迎来了文化复兴。"
    },
    {
      "pos": "noun",
      "explanation_en": "A spiritual or religious transformation in which an individual undergoes a profound change in belief, identity, or purpose, often associated with religious conversion or enlightenment.",
      "explanation_cn": "指个体在信仰、身份或人生目标上经历深刻转变的灵性或宗教性更新，常与宗教皈依或觉悟相关。",
      "example_en": "After his near-death experience, he described his rebirth as a complete awakening to the meaning of life.",
      "example_cn": "在经历濒死体验后，他将这种重生描述为对生命意义的彻底觉醒。"
    },
    {
      "pos": "noun",
      "explanation_en": "The revival or resurgence of a practice, style, or movement that had previously faded or disappeared.",
      "explanation_cn": "指某种曾经消退或消失的实践、风格或运动重新兴起或复苏。",
      "example_en": "The 1990s saw a rebirth of vinyl records as music lovers rediscovered analog sound quality.",
      "example_cn": "20世纪90年代，随着音乐爱好者重新发现模拟音质的魅力，黑胶唱片迎来了复兴。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "resurrection",
      "analysis": "“Resurrection” (复活) 更常用于宗教语境，特指肉体从死亡中复活，如耶稣复活，具有强烈的神学和超自然色彩。而 “rebirth” 更广泛，可用于精神、文化或抽象层面的重生，不一定涉及肉体或神迹。"
    },
    {
      "word_to_compare": "revival",
      "analysis": "“Revival” (复兴) 强调对已衰落事物的重新激活或恢复，常用于宗教聚会、艺术风格或社会运动，偏重外部行为的恢复。“Rebirth” 更强调内在的、根本性的新生，带有更深刻的转变意味，常暗示从旧我到新我的质变。"
    },
    {
      "word_to_compare": "renovation",
      "analysis": "“Renovation” (翻新/整修) 指对建筑、物品或系统进行物理修复或现代化改造，强调外观或功能的改善，但不改变其本质。“Rebirth” 则意味着本质的更新，是彻底的重生，而非表面的修缮。"
    }
  ]
}