{
  "word": "rebounds",
  "pronunciation": "ri·baʊndz",
  "concise_definition": "n. 反弹, 回弹; v. 弹回, 恢复, 重新振作",
  "forms": {
    "singular": "rebound",
    "third_person_singular": "rebounds",
    "past_tense": "rebounded",
    "past_participle": "rebounded",
    "present_participle": "rebounding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The action of bouncing back after hitting a surface, especially in sports such as basketball or tennis, where a player retrieves the ball after it has hit the backboard or floor.",
      "explanation_cn": "指物体撞击表面后弹回的动作，尤指在篮球或网球等运动中，球员在球击中篮板或地面后抢到球。",
      "example_en": "He grabbed a crucial rebound in the final seconds of the game.",
      "example_cn": "他在比赛最后几秒抢到了关键的篮板球。"
    },
    {
      "pos": "noun",
      "explanation_en": "A recovery or return to a previous level of activity, strength, or success after a period of decline or setback.",
      "explanation_cn": "指在经历衰退或挫折后，重新恢复到先前的活跃度、实力或成功水平。",
      "example_en": "The company showed strong rebounds in sales after launching its new product line.",
      "example_cn": "公司在推出新产品线后，销售额出现了强劲反弹。"
    },
    {
      "pos": "verb",
      "explanation_en": "To bounce back forcefully after hitting a surface, often used to describe the motion of a ball or other elastic object.",
      "explanation_cn": "指在撞击表面后有力地弹回，常用于描述球或其他弹性物体的运动。",
      "example_en": "The basketball rebounded off the rim and into the stands.",
      "example_cn": "篮球撞到篮筐后弹到了看台上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To recover quickly from a setback, disappointment, or decline, often with renewed energy or success.",
      "explanation_cn": "指从挫折、失望或衰退中迅速恢复，常伴随着新的活力或成功。",
      "example_en": "After losing her job, she rebounded by starting her own business.",
      "example_cn": "在失去工作后，她通过创业重新振作起来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bounce",
      "analysis": "“Bounce” (弹跳) 是一个更通用的词，泛指任何物体弹起的动作，不强调恢复或逆转的含义。而 “rebound” 除了物理上的弹回，更常用于比喻意义，强调从低谷中恢复，具有更强的语义深度和情感色彩。"
    },
    {
      "word_to_compare": "recovery",
      "analysis": "“Recovery” (恢复) 是一个抽象名词，泛指从疾病、损失或困难中恢复的过程，不包含物理弹回的意象。而 “rebound” 作为名词时，带有动态的、突然的、有力的恢复意味，常用于经济、体育或情绪场景，更具画面感和即时性。"
    },
    {
      "word_to_compare": "revival",
      "analysis": "“Revival” (复兴) 强调一种被重新唤醒或重新激活的状态，通常用于文化、宗教或艺术领域，过程较缓慢且具有象征性。而 “rebound” 更强调快速、直接的反弹，常用于竞技、商业或个人挫折后的即时回升，更具行动性和结果导向。"
    }
  ]
}