{
  "word": "receiving",
  "pronunciation": "ri·siv·ing",
  "concise_definition": "v. 接收, 获得, 接待; n. 接收, 收到",
  "forms": {
    "base_form": "receive",
    "third_person_singular": "receives",
    "past_tense": "received",
    "past_participle": "received",
    "present_participle": "receiving"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To take or accept something that is given, sent, or delivered, often implying passive acceptance or arrival of something from an external source.",
      "explanation_cn": "指接受、接纳他人给予、发送或递送的事物，通常暗示从外部来源被动地接收或收到。",
      "example_en": "She is receiving a package from her grandmother this afternoon.",
      "example_cn": "她今天下午将收到祖母寄来的包裹。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be the recipient of something, especially attention, treatment, or a reaction, often in a social or emotional context.",
      "explanation_cn": "指成为某事物的接受者，尤指在社交或情感语境中获得关注、待遇或反应。",
      "example_en": "The new manager is receiving mixed reviews from the staff.",
      "example_cn": "这位新经理收到了员工们褒贬不一的评价。"
    },
    {
      "pos": "verb",
      "explanation_en": "To detect or capture signals, data, or transmissions, especially in technical or electronic contexts.",
      "explanation_cn": "指在技术或电子语境中检测或捕获信号、数据或传输内容。",
      "example_en": "The satellite is receiving signals from Earth every 15 minutes.",
      "example_cn": "这颗卫星每15分钟接收一次来自地球的信号。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or process of receiving something, especially in formal or logistical contexts such as goods, payments, or guests.",
      "explanation_cn": "指接收某物的行为或过程，尤指在正式或物流语境中接收货物、款项或宾客。",
      "example_en": "The receiving department verified the shipment against the purchase order.",
      "example_cn": "收货部门根据采购订单核对了到货情况。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "accepting",
      "analysis": "“Accepting” (接受) 强调主观意愿上的认可或同意，通常带有选择性；而 “receiving” 更侧重于客观的接收行为，无论是否愿意。例如，你可以收到一封讨厌的邮件（receiving），但不一定接受它的内容（accepting）。"
    },
    {
      "word_to_compare": "receiving",
      "analysis": "“Obtaining” (获得) 通常指通过努力、行动或交易主动取得某物，强调结果；而 “receiving” 更强调被动性或来源的外部性，不涉及主动争取。例如，你通过考试获得奖学金（obtaining），但你收到奖学金支票是接收（receiving）。"
    },
    {
      "word_to_compare": "receiving",
      "analysis": "“Receiving” 与 “getting” 都可表示“得到”，但 “getting” 更口语化、泛化，可用于任何方式的获得；而 “receiving” 更正式，常用于书面语、技术或制度性语境，如接收信号、接收礼物、收货等，语义更精确。"
    }
  ]
}