{
  "word": "receptions",
  "pronunciation": "ri·sep·shuhnz",
  "concise_definition": "n. 欢迎会, 接待, 接收, 仪式",
  "forms": {
    "singular": "reception"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A social gathering or event held to welcome or honor someone, often involving food, drinks, and formal or informal interaction.",
      "explanation_cn": "为欢迎或款待某人而举办的社交聚会，通常包括食物、饮料和正式或非正式的交流。",
      "example_en": "The university hosted a reception for the new international students.",
      "example_cn": "大学为新来的国际学生举办了一场欢迎会。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of receiving or accepting something, such as a gift, message, or person, often with a formal or ceremonial context.",
      "explanation_cn": "接收或接受某物（如礼物、信息或人员）的行为，常带有正式或仪式性的语境。",
      "example_en": "The reception of the treaty by the parliament was overwhelmingly positive.",
      "example_cn": "议会对该条约的接受反应极为积极。"
    },
    {
      "pos": "noun",
      "explanation_en": "A room or area in a building where visitors are greeted and directed, such as in a hotel, office, or hospital.",
      "explanation_cn": "建筑物中用于接待和引导访客的房间或区域，如酒店、办公室或医院的大堂。",
      "example_en": "She waited at the reception for her appointment with the doctor.",
      "example_cn": "她在接待处等待与医生的预约。"
    },
    {
      "pos": "noun",
      "explanation_en": "The way in which something is received or perceived by an audience, especially in terms of public response or critical evaluation.",
      "explanation_cn": "某事物被受众接收或感知的方式，尤指公众反应或批评评价。",
      "example_en": "The film received mixed receptions from critics and audiences alike.",
      "example_cn": "这部电影在评论家和观众中反响不一。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "party",
      "analysis": "“Party”（派对）泛指任何形式的社交聚会，通常以娱乐和庆祝为主，结构较随意；而 “reception” 更强调仪式性、目的性（如欢迎、接待），通常有明确的组织者和礼仪流程。"
    },
    {
      "word_to_compare": "meeting",
      "analysis": "“Meeting”（会议）侧重于正式的商议或讨论，以达成目标或解决问题为核心；“reception” 则以社交互动和款待为主，不以决策为目的，氛围更轻松或庄重但非事务性。"
    },
    {
      "word_to_compare": "lobby",
      "analysis": "“Lobby”（大堂/门厅）是物理空间，指建筑物入口处的区域；而 “reception” 可指该区域，也可指在该区域发生的接待行为或活动，具有行为和场所双重含义。"
    },
    {
      "word_to_compare": "response",
      "analysis": "“Response”（反应）是抽象的心理或行为反馈，如对政策、言论的回应；“reception” 在表示公众反应时，更强调集体性、公开性和文化语境下的整体评价，常用于媒体或艺术领域。"
    }
  ]
}