{
  "word": "reception",
  "pronunciation": "ri·sep·shun",
  "concise_definition": "n. 接待, 欢迎, 接收, 会议, 信号接收",
  "forms": {
    "plural": "receptions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The action or manner of receiving or welcoming someone, especially in a formal or social context, such as at an event or entrance.",
      "explanation_cn": "指以某种方式迎接或接待某人，尤其在正式或社交场合中，如在活动入口或聚会中。",
      "example_en": "The guests were greeted with a warm reception at the hotel lobby.",
      "example_cn": "客人们在酒店大堂受到了热情的接待。"
    },
    {
      "pos": "noun",
      "explanation_en": "A social gathering or party, typically held to welcome or honor someone, such as a wedding reception or a welcome party.",
      "explanation_cn": "指为欢迎或表彰某人而举办的社交聚会，如婚礼招待会或欢迎会。",
      "example_en": "The wedding reception was held in a grand ballroom with live music.",
      "example_cn": "婚礼招待会在一个配有现场音乐的宏伟舞厅举行。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of receiving or accepting something, such as data, signals, or goods, often in a technical or organizational context.",
      "explanation_cn": "指接收或接受某物的行为，常用于技术或组织语境中，如信号、数据或货物的接收。",
      "example_en": "The radio had poor reception in the mountainous area.",
      "example_cn": "在山区，收音机的信号接收效果很差。"
    },
    {
      "pos": "noun",
      "explanation_en": "The way in which something is perceived or responded to by an audience or the public, especially regarding a performance, product, or idea.",
      "explanation_cn": "指某事物（如表演、产品或观点）被观众或公众所接受或回应的方式。",
      "example_en": "The new film received a mixed reception from critics and audiences alike.",
      "example_cn": "这部新电影在评论家和观众中都获得了褒贬不一的评价。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "welcome",
      "analysis": "“Welcome” (欢迎) 作为名词时，常指欢迎的态度或行为，但更侧重于情感上的接纳和友好，通常不包含正式活动或仪式的含义。而 “reception” 不仅包含欢迎，还常指一个具体的社交场合或对事物的整体反应，语义范围更广。"
    },
    {
      "word_to_compare": "acceptance",
      "analysis": "“Acceptance” (接受) 强调对某事物的认可或同意，多用于抽象概念（如观念、规则），偏重心理或制度层面的接纳。而 “reception” 更强调外部反应或实际的接收行为，可以是情感的、物理的或社会性的，更具情境性。"
    },
    {
      "word_to_compare": "lobby",
      "analysis": "“Lobby” (大堂/门厅) 指建筑物中的物理空间，常是接待发生的地点，但本身不包含接待行为的含义。而 “reception” 指的是在该空间中发生的互动行为或事件，二者是场所与行为的关系。"
    },
    {
      "word_to_compare": "signal",
      "analysis": "“Signal” (信号) 是被接收的客体，而 “reception” 是接收信号的过程或效果。例如，我们说 “the signal is weak”，但 “the reception is poor” —— 前者是传输内容，后者是接收质量。"
    }
  ]
}