{
  "word": "recess",
  "pronunciation": "ri·kess",
  "concise_definition": "n. 休息, 休会, 间隙; v. 休会, 暂停",
  "forms": {
    "plural": "recesses",
    "third_person_singular": "recesses",
    "past_tense": "recessed",
    "past_participle": "recessed",
    "present_participle": "recessing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A temporary break or pause in an activity, especially in school, work, or a formal meeting, allowing people to rest or attend to other matters.",
      "explanation_cn": "指在活动（尤其是学校、工作或正式会议）中暂时中断，供人们休息或处理其他事务的时间段。",
      "example_en": "The children ran outside during recess to play on the playground.",
      "example_cn": "孩子们在课间休息时跑到操场上玩耍。"
    },
    {
      "pos": "noun",
      "explanation_en": "A formal suspension of proceedings in a legislative or judicial body, during which no official business is conducted.",
      "explanation_cn": "指立法或司法机构正式暂停会议或审理，期间不进行任何公务活动。",
      "example_en": "The Senate went into recess for the summer holidays.",
      "example_cn": "参议院为暑期休会。"
    },
    {
      "pos": "noun",
      "explanation_en": "A hollow or indentation in a surface, especially one that is set back from the main plane, such as in architecture or engineering.",
      "explanation_cn": "指表面的凹陷或内陷部分，尤其指相对于主平面向内凹入的结构，常见于建筑或工程中。",
      "example_en": "The statue was placed in a recess of the wall to protect it from the weather.",
      "example_cn": "这座雕像被安置在墙内的凹槽中，以保护其免受天气侵蚀。"
    },
    {
      "pos": "verb",
      "explanation_en": "To suspend or adjourn a meeting, session, or activity temporarily.",
      "explanation_cn": "指暂时中止、休会或暂停会议、会议或活动。",
      "example_en": "The judge recessed the court until Monday morning.",
      "example_cn": "法官宣布休庭，周一早上继续开庭。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "break",
      "analysis": "“Break” (休息) 是一个更通用、更口语化的词，泛指任何短暂的停顿，如喝咖啡休息、午餐休息。而 “recess” 更常用于正式或制度化的场合，如学校课间、议会休会，带有更强的结构性和规范性。"
    },
    {
      "word_to_compare": "interval",
      "analysis": "“Interval” (间隔) 强调两个事件或时间段之间的空隙，常用于音乐、体育或科学语境，如“中场休息”或“时间间隔”。它更侧重于时间上的距离，而 “recess” 更强调活动的暂停状态及其目的（如休息或等待）。"
    },
    {
      "word_to_compare": "niche",
      "analysis": "“Niche” (壁龛/利基) 与 “recess” 在建筑学意义上相近，都指墙壁上的凹陷处。但 “niche” 通常特指用于放置雕像、装饰品的有设计感的凹槽，而 “recess” 更泛指任何类型的内凹结构，不一定是装饰性的。"
    }
  ]
}