{
  "word": "reclaimed",
  "pronunciation": "ree·klāmd",
  "concise_definition": "adj. 被回收的, 被重新利用的; v. 开垦, 复原, 收回",
  "forms": {
    "base_form": "reclaim",
    "third_person_singular": "reclaims",
    "past_tense": "reclaimed",
    "past_participle": "reclaimed",
    "present_participle": "reclaiming"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing materials, land, or objects that have been recovered, restored, or repurposed from a previous state of waste, neglect, or disuse.",
      "explanation_cn": "指从废弃、荒废或闲置状态中被回收、修复或重新利用的材料、土地或物品。",
      "example_en": "The furniture was made from reclaimed wood sourced from old barns.",
      "example_cn": "这些家具由从旧谷仓回收的木材制成。"
    },
    {
      "pos": "verb",
      "explanation_en": "To recover or regain possession of something that was lost, abandoned, or taken away, often through effort or legal means.",
      "explanation_cn": "指通过努力或法律手段，将失去、被遗弃或被夺走的事物重新收回或恢复所有权。",
      "example_en": "The government reclaimed the polluted land and turned it into a public park.",
      "example_cn": "政府收回了被污染的土地，并将其改造成一个公共公园。"
    },
    {
      "pos": "verb",
      "explanation_en": "To convert unusable or degraded land (such as swamps, deserts, or wastelands) into productive or habitable land through engineering or agricultural methods.",
      "explanation_cn": "指通过工程或农业手段，将无法使用的退化土地（如沼泽、沙漠或荒地）改造为可耕种或可居住的土地。",
      "example_en": "The Netherlands has reclaimed large areas of land from the North Sea over centuries.",
      "example_cn": "几个世纪以来，荷兰已从北海中开垦出大片土地。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "recycled",
      "analysis": "“Recycled”（循环利用的）强调物质被分解后重新加工成新产品，通常涉及工业处理流程，如塑料瓶变成纤维。而 “reclaimed” 更广泛，可指未经彻底分解的直接再利用，如旧木材直接用于家具，强调的是‘恢复使用’而非‘重新制造’。"
    },
    {
      "word_to_compare": "restored",
      "analysis": "“Restored”（修复的）侧重于将某物恢复到其原始状态或历史原貌，常用于文物、建筑或艺术品。而 “reclaimed” 更强调从废弃或非使用状态中‘夺回’并赋予新用途，不一定追求原貌，可能包含功能性的改造。"
    },
    {
      "word_to_compare": "recovered",
      "analysis": "“Recovered”（恢复的）通常指从损失、疾病或破坏中恢复原状，如健康恢复、数据恢复，侧重于‘回到原来的状态’。而 “reclaimed” 更强调主动介入、改造或重新占有，常用于土地、资源或权利的重新获取，带有更强的主动性与改造意味。"
    }
  ]
}