{
  "word": "reclamation",
  "pronunciation": "ree·kluh·mey·shun",
  "concise_definition": "n. 开垦, 复垦, 回收, 追回",
  "forms": {
    "plural": "reclamations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of restoring land that has been degraded or disturbed—such as by mining, industrial use, or flooding—to a useful or natural state, often through environmental engineering or agricultural methods.",
      "explanation_cn": "指通过环境工程或农业手段，将因采矿、工业使用或洪水等而退化或破坏的土地恢复为可用或自然状态的过程。",
      "example_en": "The reclamation of the abandoned mine site turned it into a thriving public park.",
      "example_cn": "对废弃矿场的复垦使其变成了一片繁荣的公共公园。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of recovering or regaining something that was lost, taken, or wasted, especially materials or resources for reuse.",
      "explanation_cn": "指取回或重新获得失去、被占用或浪费的物品，尤指将材料或资源回收以供再利用。",
      "example_en": "The city's reclamation program recycles over 60% of its household waste.",
      "example_cn": "该市的回收计划将超过60%的家庭垃圾进行了回收利用。"
    },
    {
      "pos": "noun",
      "explanation_en": "The legal process of reclaiming property, rights, or possessions that have been wrongfully taken or abandoned.",
      "explanation_cn": "指通过法律程序追回被非法占有或被遗弃的财产、权利或物品。",
      "example_en": "After a lengthy legal battle, the family won the reclamation of their ancestral land.",
      "example_cn": "经过漫长的法律诉讼，这家人成功追回了祖传土地。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "recycling",
      "analysis": "“Recycling” (回收利用) 专指将废弃物转化为新产品的过程，强调物质的循环再用，通常限于材料（如纸张、塑料）。而 “reclamation” 范围更广，既包括物质回收，也涵盖土地修复和权利追回，语义更丰富。"
    },
    {
      "word_to_compare": "restoration",
      "analysis": "“Restoration” (修复/复原) 侧重于将某物恢复到其原始或历史状态，常用于文化遗产、建筑或生态系统，强调“原貌重现”。而 “reclamation” 更强调从废弃、退化或被侵占状态中“夺回”并使其重新可用，不一定追求完全复原原状。"
    },
    {
      "word_to_compare": "recovery",
      "analysis": "“Recovery” (恢复) 是一个更通用的词，可指健康、经济、情绪等多方面的恢复，不特指土地或资源的再利用。而 “reclamation” 有明确的物理或法律对象（如土地、财产、废弃物），具有更强的专业性和具体性。"
    }
  ]
}