{
  "word": "reconstructed",
  "pronunciation": "ree·kun·struk·tid",
  "concise_definition": "adj. 重建的, 重新构建的; v. 重建, 重新构建（reconstruct 的过去式和过去分词）",
  "forms": {
    "base_form": "reconstruct",
    "third_person_singular": "reconstructs",
    "past_tense": "reconstructed",
    "past_participle": "reconstructed",
    "present_participle": "reconstructing",
    "noun_form": "reconstruction"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing something that has been rebuilt, restored, or reassembled based on evidence, fragments, or original design, often after damage, decay, or loss.",
      "explanation_cn": "指某物在受损、腐朽或遗失后，依据证据、残片或原始设计被重建或重新组装的状态。",
      "example_en": "The reconstructed temple now stands as a major tourist attraction.",
      "example_cn": "这座重建的寺庙如今已成为主要的旅游景点。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Referring to a version of an event, scene, or narrative that has been inferred or created from limited or indirect evidence, often in historical or forensic contexts.",
      "explanation_cn": "指基于有限或间接证据推断或构建出的事件、场景或叙述版本，常用于历史或法医研究中。",
      "example_en": "The detective presented a reconstructed version of the crime scene based on witness statements and DNA evidence.",
      "example_cn": "侦探根据目击者陈述和DNA证据，呈现了犯罪现场的重建版本。"
    },
    {
      "pos": "verb",
      "explanation_en": "To build or create something again, especially after it has been destroyed, damaged, or dismantled, often using original materials or plans.",
      "explanation_cn": "指在某物被毁坏、损坏或拆解后，再次建造或创建它，通常使用原始材料或设计图。",
      "example_en": "Archaeologists reconstructed the ancient Roman road using stones found at the excavation site.",
      "example_cn": "考古学家利用发掘现场找到的石块重建了古罗马道路。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form or devise a theory, account, or model by piecing together available information, especially when direct evidence is missing.",
      "explanation_cn": "指通过整合现有信息来形成理论、描述或模型，尤其在缺乏直接证据时。",
      "example_en": "Historians reconstructed the daily life of medieval peasants from tax records and farm tools.",
      "example_cn": "历史学家通过税收记录和农具重建了中世纪农民的日常生活。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "restored",
      "analysis": "“Restored”（修复的）强调恢复原状，通常指保留或使用原始部件，使物品恢复到其原始状态，如古董家具或壁画的修复。而 “reconstructed” 更强调从零开始或基于碎片重建，可能使用新材料或推断性设计，不一定完全忠实于原貌。"
    },
    {
      "word_to_compare": "rebuilt",
      "analysis": "“Rebuilt”（重建的）与 “reconstructed” 非常接近，常可互换，但 “rebuilt” 更常用于物理结构（如房屋、引擎），强调工程性重建；而 “reconstructed” 更广泛，可用于抽象概念（如事件、叙述、语言），且更常用于学术或科学语境。"
    },
    {
      "word_to_compare": "recreated",
      "analysis": "“Recreated”（重现的）强调复制或再现某种体验、氛围或情境，通常是为了模拟或展示，如电影中的历史场景重现。它更注重感官或情感上的还原，而 “reconstructed” 更注重基于证据的逻辑重建，强调准确性与分析性。"
    }
  ]
}