{
  "word": "record",
  "pronunciation": "rek·awrd",
  "concise_definition": "n. 记录, 档案, 成绩; v. 记录, 录音",
  "forms": {
    "third_person_singular": "records",
    "past_tense": "recorded",
    "past_participle": "recorded",
    "present_participle": "recording",
    "plural": "records"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A written, printed, or electronic document that contains information about an event, person, or transaction, often for official or historical purposes.",
      "explanation_cn": "指关于某一事件、人物或交易的书面、印刷或电子文档，通常用于官方或历史存档目的。",
      "example_en": "The hospital keeps a detailed medical record for every patient.",
      "example_cn": "医院为每位病人保存详细的病历记录。"
    },
    {
      "pos": "noun",
      "explanation_en": "The best performance or achievement ever attained in a particular field, especially in sports or music.",
      "explanation_cn": "指在某一领域（尤指体育或音乐）中曾达到的最高成就或最佳表现。",
      "example_en": "Usain Bolt holds the world record for the 100-meter sprint.",
      "example_cn": "尤塞恩·博尔特保持着100米短跑的世界纪录。"
    },
    {
      "pos": "noun",
      "explanation_en": "A physical medium, such as a vinyl disc or digital file, on which sound or video is stored and can be played back.",
      "explanation_cn": "指用于存储声音或视频并可播放的物理媒介，如黑胶唱片或数字文件。",
      "example_en": "She collected vintage records from the 1960s.",
      "example_cn": "她收藏了20世纪60年代的复古唱片。"
    },
    {
      "pos": "verb",
      "explanation_en": "To capture and store sound, video, or data using a device such as a microphone, camera, or computer.",
      "explanation_cn": "指使用麦克风、摄像机或计算机等设备捕捉并存储声音、视频或数据。",
      "example_en": "The journalist recorded an interview with the mayor.",
      "example_cn": "记者录下了对市长的采访。"
    },
    {
      "pos": "verb",
      "explanation_en": "To officially note or register information, especially in a formal or legal context.",
      "explanation_cn": "指在正式或法律语境中正式记载或登记信息。",
      "example_en": "The court recorded the defendant's plea of not guilty.",
      "example_cn": "法庭记录了被告的无罪答辩。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "file",
      "analysis": "“File” (文件) 通常指按系统分类归档的文档集合，强调组织性和存储结构，常用于行政或办公场景。而 “record” 更侧重于信息本身的内容和历史价值，不一定以文件形式存在，如口头记录或数据记录。"
    },
    {
      "word_to_compare": "log",
      "analysis": "“Log” (日志) 通常指按时间顺序连续记录的事件或数据，常用于技术、航海或工程领域，强调连续性和时效性。而 “record” 可以是单次、非连续的，且用途更广泛，包括成就、档案和媒介。"
    },
    {
      "word_to_compare": "archive",
      "analysis": "“Archive” (档案库) 指长期保存的历史记录集合，强调保存和历史价值，通常用于机构或国家层面。而 “record” 可以是单个条目，不一定具有长期保存的意图，且更常用于日常语境。"
    }
  ]
}