{
  "word": "recovery",
  "pronunciation": "rih·kuh·ver·ee",
  "concise_definition": "n. 恢复, 康复, 回收, 取回",
  "forms": {
    "plural": "recoveries"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of returning to a normal or healthy state after illness, injury, or disruption; often implies physical, emotional, or functional restoration.",
      "explanation_cn": "指在疾病、伤害或干扰后恢复到正常或健康状态的过程，通常涉及身体、情绪或功能上的复原。",
      "example_en": "After months of physical therapy, she made a full recovery from the accident.",
      "example_cn": "经过数月的物理治疗，她从事故中完全康复了。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of retrieving or regaining something that was lost, stolen, or misplaced, especially valuable assets or data.",
      "explanation_cn": "指取回或重新获得失去、被盗或遗失的物品，尤指有价值的资产或数据。",
      "example_en": "The company's recovery of the stolen customer data was a major victory for cybersecurity.",
      "example_cn": "该公司成功取回被盗的客户数据，是网络安全领域的一次重大胜利。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process of restoring economic or financial stability after a downturn or crisis.",
      "explanation_cn": "指在经济衰退或危机后恢复经济或金融稳定的过程。",
      "example_en": "The government implemented stimulus measures to accelerate economic recovery.",
      "example_cn": "政府实施了刺激措施以加速经济复苏。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process of extracting usable materials from waste or discarded items, especially in environmental or industrial contexts.",
      "explanation_cn": "指从废弃物或废弃物品中提取可再利用材料的过程，常用于环保或工业领域。",
      "example_en": "Recycling programs focus on the recovery of plastics, metals, and paper.",
      "example_cn": "回收计划侧重于塑料、金属和纸张的回收利用。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "restoration",
      "analysis": "“Restoration”（修复/复原）强调将某物恢复到其原始状态或历史原貌，常用于建筑、艺术品或文化遗产的修复，带有强烈的“还原”意味。而 “recovery” 更侧重于从损失、疾病或危机中恢复功能或健康，不一定追求原貌。"
    },
    {
      "word_to_compare": "convalescence",
      "analysis": "“Convalescence”（康复期）特指疾病或手术后身体逐渐恢复健康的阶段，是一个医学术语，强调被动的、自然的恢复过程。而 “recovery” 是更通用的词，涵盖身体、心理、经济等多方面恢复，且可包含主动干预。"
    },
    {
      "word_to_compare": "recoup",
      "analysis": "“Recoup”（收回成本/补偿）是动词，指通过某种方式弥补损失（尤指金钱），如通过销售收回投资。它强调经济补偿，而 “recovery” 作为名词，涵盖范围更广，不仅限于财务，还包括健康、环境等层面的恢复。"
    }
  ]
}