{
  "word": "recommendations",
  "pronunciation": "rek·uh·mehn·day·shuhnz",
  "concise_definition": "n. 建议, 推荐, 推荐信",
  "forms": {
    "singular": "recommendation"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An opinion or suggestion about the best course of action, often based on experience, expertise, or personal preference, intended to guide someone's decision.",
      "explanation_cn": "基于经验、专业知识或个人偏好提出的关于最佳行动方案的意见或建议，旨在引导他人的决策。",
      "example_en": "The travel agent gave us several recommendations for hotels in Paris.",
      "example_cn": "旅行社给我们提供了几家巴黎酒店的推荐。"
    },
    {
      "pos": "noun",
      "explanation_en": "A formal written statement supporting someone's qualifications, character, or suitability for a position, often used in job or academic applications.",
      "explanation_cn": "一种正式的书面文件，用于支持某人的资格、品格或胜任某职位的能力，常用于求职或学术申请中。",
      "example_en": "She submitted three letters of recommendation with her graduate school application.",
      "example_cn": "她在研究生申请中提交了三封推荐信。"
    },
    {
      "pos": "noun",
      "explanation_en": "A product, service, or option that is suggested as particularly good or suitable, often in reviews or curated lists.",
      "explanation_cn": "在评论或精选列表中被推荐为特别优秀或合适的产品、服务或选项。",
      "example_en": "According to the magazine's recommendations, this is the best espresso machine on the market.",
      "example_cn": "根据这本杂志的推荐，这是市场上最好的意式咖啡机。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "suggestion",
      "analysis": "“Suggestion”（建议）语气更中性、随意，通常不带有权威性或专业背景，仅表示一种可能的选择。而 “recommendation” 更强调推荐者基于判断或经验的肯定性意见，通常更具分量和指导性。"
    },
    {
      "word_to_compare": "advice",
      "analysis": "“Advice”（忠告）范围更广，可涵盖生活、情感、道德等多方面，常为口头或非正式的指导；而 “recommendation” 更常用于具体情境（如产品、服务、职位），通常更结构化、书面化，且隐含推荐者对结果的信心。"
    },
    {
      "word_to_compare": "endorsement",
      "analysis": "“Endorsement”（背书）通常指权威机构、公众人物或组织公开支持某人或某物，带有更强的公共影响力和信誉转移，常用于政治或商业宣传；而 “recommendation” 更个人化、日常化，不一定涉及公开声明或权威身份。"
    }
  ]
}