{
  "word": "reconstruction",
  "pronunciation": "ree·kun·struk·shun",
  "concise_definition": "n. 重建, 修复, 重构",
  "forms": {
    "plural": "reconstructions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of rebuilding or restoring something that has been damaged, destroyed, or fallen into disrepair, especially structures, systems, or institutions.",
      "explanation_cn": "指对已被破坏、损毁或荒废的物体、系统或机构进行重建或修复的行为。",
      "example_en": "The city underwent a massive reconstruction after the war.",
      "example_cn": "战争过后，这座城市经历了大规模的重建。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process of re-creating or interpreting a past event, situation, or object based on available evidence, often in historical, archaeological, or scientific contexts.",
      "explanation_cn": "指基于现有证据，重新构建或解释过去发生的事件、情境或物体的过程，常用于历史、考古或科学领域。",
      "example_en": "Scientists used fossil records to produce a reconstruction of the ancient dinosaur.",
      "example_cn": "科学家利用化石记录重建了这种远古恐龙的形态。"
    },
    {
      "pos": "noun",
      "explanation_en": "In computing or mathematics, the process of reconstructing data, images, or structures from partial or indirect information.",
      "explanation_cn": "在计算机或数学领域，指从部分或间接信息中重建数据、图像或结构的过程。",
      "example_en": "MRI technology relies on complex algorithms for the reconstruction of internal body images.",
      "example_cn": "磁共振成像技术依赖复杂的算法来重建体内图像。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "restoration",
      "analysis": "“Restoration”（修复/复原）强调将某物恢复到其原始状态或历史原貌，尤其用于文物、建筑或艺术品，注重保留原真性。而 “reconstruction” 更侧重于在原物已不存在或严重损毁时，依据证据重新建造或构建，可能包含一定程度的推测或创新。"
    },
    {
      "word_to_compare": "renewal",
      "analysis": "“Renewal”（更新/革新）指通过注入新元素或改进使某物焕发新生，不一定涉及物理上的拆除与重建，常用于抽象概念如制度、精神或经济的更新。而 “reconstruction” 更强调结构性的、系统性的重建过程，通常伴随旧有部分的彻底改变。"
    },
    {
      "word_to_compare": "rebuilding",
      "analysis": "“Rebuilding” 是 “reconstruction” 在物理层面的近义词，常用于口语或非正式语境，指对建筑物或基础设施的重新建造。而 “reconstruction” 语义更广，可涵盖抽象系统（如社会制度、历史叙事）的重构，且更具学术和正式色彩。"
    }
  ]
}