{
  "word": "recommending",
  "pronunciation": "ree·kuh·mend·ing",
  "concise_definition": "v. 推荐, 建议, 介绍",
  "forms": {
    "base_form": "recommend",
    "third_person_singular": "recommends",
    "past_tense": "recommended",
    "past_participle": "recommended",
    "present_participle": "recommending"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To suggest or advise someone to choose or use a particular person, product, service, or course of action based on personal experience, expertise, or belief in its quality or suitability.",
      "explanation_cn": "基于个人经验、专业知识或对其质量或适用性的信任，向他人建议选择或使用某人、某产品、某服务或某种行动方案。",
      "example_en": "She is recommending a new restaurant that has excellent seafood.",
      "example_cn": "她正在推荐一家海鲜非常棒的新餐厅。"
    },
    {
      "pos": "verb",
      "explanation_en": "To formally endorse or advocate for someone’s appointment, admission, or approval, often in a professional or institutional context.",
      "explanation_cn": "在专业或机构环境中，正式支持或倡导某人获得任命、录取或批准。",
      "example_en": "The professor is recommending her student for the prestigious scholarship.",
      "example_cn": "这位教授正在推荐她的学生申请这项声望很高的奖学金。"
    },
    {
      "pos": "verb",
      "explanation_en": "To propose a course of action as being advisable or beneficial, often in response to a problem or need.",
      "explanation_cn": "为应对某个问题或需求，提出某种行动方案作为明智或有益的选择。",
      "example_en": "The doctor is recommending regular exercise and a balanced diet to manage his condition.",
      "example_cn": "医生建议他通过规律锻炼和均衡饮食来控制病情。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "suggest",
      "analysis": "“Suggest” (建议) 语气较弱，通常表示提出一个可能性或想法，不带有强烈推荐的倾向，接受与否由对方决定。而 “recommending” 更具权威性和主动性，隐含推荐者认为该选择是最佳或最合适的。"
    },
    {
      "word_to_compare": "advise",
      "analysis": "“Advise” (劝告) 常用于正式或专业语境，强调基于知识或经验给出指导性意见，有时带有义务或责任色彩。而 “recommending” 更侧重于表达个人偏好或积极支持，语气更温和且更具鼓励性。"
    },
    {
      "word_to_compare": "endorse",
      "analysis": "“Endorse” (支持/背书) 通常用于公开或正式地表示对某人或某物的全面认可，常用于政治、商业或品牌语境，带有更强的权威性和公众性。而 “recommending” 更偏向于个人或小范围的建议，不一定涉及公开声明。"
    }
  ]
}