{
  "word": "recruited",
  "pronunciation": "ri·kroo·tid",
  "concise_definition": "v. 招募, 征募, 招聘 (recruit 的过去式和过去分词)",
  "forms": {
    "base_form": "recruit",
    "third_person_singular": "recruits",
    "present_participle": "recruiting",
    "plural_noun": "recruits"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To seek out and enlist people for a particular purpose, especially for military service, a job, or an organization, often through active effort or persuasion.",
      "explanation_cn": "指为特定目的（如军队、工作或组织）主动寻找并吸纳人员，通常通过积极的搜寻或劝说实现。",
      "example_en": "The company recruited five new engineers last month to expand its R&D team.",
      "example_cn": "该公司上个月招募了五名新工程师，以扩大其研发团队。"
    },
    {
      "pos": "verb",
      "explanation_en": "To bring someone into a cause, movement, or activity, often by convincing them of its value or importance.",
      "explanation_cn": "指通过说服某人认识到某项事业、运动或活动的价值，而将其吸纳进来。",
      "example_en": "The activist recruited dozens of volunteers to join the environmental campaign.",
      "example_cn": "这位活动家招募了数十名志愿者加入环保运动。"
    },
    {
      "pos": "verb",
      "explanation_en": "To enroll or register someone formally into a system or program, such as a school, club, or political party.",
      "explanation_cn": "指正式将某人登记或纳入某个体系或项目中，如学校、俱乐部或政党。",
      "example_en": "The university recruited over 2,000 international students this academic year.",
      "example_cn": "这所大学本学年招募了超过两千名国际学生。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hired",
      "analysis": "“Hired” (雇佣) 侧重于完成雇佣行为本身，通常指签订合同、支付薪酬的正式录用，多用于商业或职场语境。而 “recruited” 更强调主动寻找、筛选和争取的过程，可能发生在正式雇佣之前，范围更广，常用于军队、非营利组织或大规模招聘场景。"
    },
    {
      "word_to_compare": "enlisted",
      "analysis": "“Enlisted” (应征入伍) 通常特指自愿加入军队，带有法律或制度性程序的含义，语义范围较窄。而 “recruited” 可用于任何组织或目的，包括商业、政治、教育等，且可指主动招募他人，而 “enlisted” 多指个人主动加入。"
    },
    {
      "word_to_compare": "sought",
      "analysis": "“Sought” (寻求) 是一个更宽泛的动词，仅表示“寻找”或“试图获得”，不包含吸纳或接纳的后续动作。而 “recruited” 不仅包含寻找，还隐含成功吸引并纳入的过程，具有更强的目的性和结果导向。"
    }
  ]
}