{
  "word": "redefine",
  "pronunciation": "ree·duh·fīn",
  "concise_definition": "v. 重新定义, 重新界定",
  "forms": {
    "third_person_singular": "redefines",
    "past_tense": "redefined",
    "past_participle": "redefined",
    "present_participle": "redefining"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To give a new or different meaning to a concept, term, or idea, often to reflect changing circumstances, perspectives, or values.",
      "explanation_cn": "指为某个概念、术语或想法赋予新的或不同的含义，通常是为了反映变化的环境、观点或价值观。",
      "example_en": "The rise of remote work has redefined what it means to have a successful career.",
      "example_cn": "远程工作的兴起重新定义了什么是成功的职业生涯。"
    },
    {
      "pos": "verb",
      "explanation_en": "To alter the boundaries, scope, or nature of something, especially in a way that challenges traditional understanding.",
      "explanation_cn": "指改变某事物的界限、范围或本质，尤其是以挑战传统理解的方式。",
      "example_en": "Modern art has redefined the boundaries between sculpture and installation.",
      "example_cn": "现代艺术重新界定了雕塑与装置艺术之间的界限。"
    },
    {
      "pos": "verb",
      "explanation_en": "To revise or reinterpret a role, identity, or social norm to better fit contemporary contexts.",
      "explanation_cn": "指修订或重新诠释某种角色、身份或社会规范，使其更符合当代语境。",
      "example_en": "She redefined motherhood by balancing a high-powered career with raising three children.",
      "example_cn": "她通过在高压职业与抚养三个孩子之间取得平衡，重新定义了母职。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "reform",
      "analysis": "“Reform” (改革) 指对制度、系统或行为进行改进或修正，以使其更有效或更公正，通常涉及结构或规则的调整。而 “redefine” 更侧重于改变概念、定义或理解方式，不一定涉及实际制度的改变。"
    },
    {
      "word_to_compare": "reinterpret",
      "analysis": "“Reinterpret” (重新解释) 与 “redefine” 非常接近，都涉及对已有事物赋予新意义。但 “reinterpret” 更强调从新的角度或理论框架来理解已存在的内容，常用于文本、历史或艺术分析；而 “redefine” 更倾向于正式地、广泛地改变一个术语或概念的官方或普遍接受的含义。"
    },
    {
      "word_to_compare": "reshape",
      "analysis": "“Reshape” (重塑) 指对某事物的外形、结构或形式进行物理或抽象上的重新构造，强调改变其外在形态或组织方式。而 “redefine” 更关注内在含义、定义或认知层面的转变，不一定改变其外在形式。"
    }
  ]
}