{
  "word": "reels",
  "pronunciation": "reels",
  "concise_definition": "n. 卷筒, 卷轴; v. 卷起, 摇晃, 沉醉",
  "forms": {
    "singular": "reel",
    "third_person_singular": "reels",
    "past_tense": "reeled",
    "past_participle": "reeled",
    "present_participle": "reeling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A cylindrical device or spool around which film, tape, thread, or other flexible material is wound, especially in filmmaking or fishing.",
      "explanation_cn": "一种圆柱形装置或卷轴，用于缠绕胶片、磁带、线或其他柔性材料，尤指电影制作或钓鱼中使用的装置。",
      "example_en": "The cinematographer loaded the new film into the reel before starting the shoot.",
      "example_cn": "摄影师在开拍前将新胶片装入卷筒。"
    },
    {
      "pos": "noun",
      "explanation_en": "A short video clip, typically lasting 15 to 90 seconds, posted on social media platforms like Instagram or TikTok, often featuring music, dance, or quick edits.",
      "explanation_cn": "一种短视频片段，通常时长为15至90秒，发布在Instagram或TikTok等社交媒体平台上，常配有音乐、舞蹈或快速剪辑。",
      "example_en": "She went viral after posting a dance reel that got over a million views.",
      "example_cn": "她发布了一段舞蹈短视频，获得超过百万次播放，一夜走红。"
    },
    {
      "pos": "verb",
      "explanation_en": "To wind or turn something around a central axis, especially in a rapid or uncontrolled motion.",
      "explanation_cn": "指将某物快速或无控制地绕中心轴缠绕或转动。",
      "example_en": "The fisherman reeled in the line after feeling a strong tug.",
      "example_cn": "渔夫感觉到鱼线猛拉后，迅速将线收了回来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To sway or stagger unsteadily, often due to dizziness, shock, or intoxication.",
      "explanation_cn": "指因头晕、震惊或醉酒而摇晃、蹒跚。",
      "example_en": "After the punch, he reeled backward, barely keeping his balance.",
      "example_cn": "挨了一拳后，他向后摇晃，几乎站不稳。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be overwhelmed or intoxicated by an emotion or experience, often used figuratively.",
      "explanation_cn": "比喻性地指被某种情绪或经历所淹没或陶醉。",
      "example_en": "They were reeling from the news of the company’s sudden bankruptcy.",
      "example_cn": "他们对这家公司突然破产的消息感到震惊不已。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "roll",
      "analysis": "“Roll” (滚动/卷起) 是一个更通用的词，指任何物体围绕轴心转动或形成卷状，可指自然动作（如球滚动）或物理操作（如卷地毯）。“Reel” 更强调缠绕在特定卷轴上的动作，常用于专业语境（如电影胶片、钓鱼线），且常带有机械或有控制的意味。"
    },
    {
      "word_to_compare": "clip",
      "analysis": "“Clip” (短视频片段) 与 “reel” 在社交媒体语境中常被混用，但 “clip” 通常指任何简短的视频片段，无时长或平台限制；而 “reel” 特指Instagram、TikTok等平台上的竖屏、音乐伴奏、快速剪辑的短视频形式，具有明确的格式和算法推荐机制。"
    },
    {
      "word_to_compare": "spin",
      "analysis": "“Spin” (旋转) 强调快速、持续的自转，常用于抽象意义（如操纵舆论）或物理旋转（如陀螺）。“Reel” 更强调围绕轴心的缠绕或因冲击而产生的不稳晃动，其动作更不规则、更被动，常伴随情绪或身体失控的语义。"
    }
  ]
}