{
  "word": "reeling",
  "pronunciation": "rīl·iŋ",
  "concise_definition": "adj. 摇晃的, 头晕目眩的, 惊慌失措的; v. (reel 的现在分词) 旋转, 摇晃, 沉醉",
  "forms": {
    "base_form": "reel",
    "third_person_singular": "reels",
    "past_tense": "reeled",
    "past_participle": "reeled",
    "present_participle": "reeling"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "In a state of physical or emotional instability, often due to shock, dizziness, or overwhelming emotion; describing someone who is unsteady or disoriented.",
      "explanation_cn": "因震惊、头晕或强烈情绪而处于身体或情绪不稳的状态；形容人摇晃不定、神志恍惚。",
      "example_en": "She was reeling from the news of her father's sudden death.",
      "example_cn": "她因父亲突然去世的消息而头晕目眩。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Overwhelmed or intoxicated by an experience, often used metaphorically to describe being emotionally or mentally overwhelmed by excitement, success, or shock.",
      "explanation_cn": "被某种经历所淹没或陶醉，常用于比喻因兴奋、成功或震惊而精神恍惚。",
      "example_en": "The team was reeling after their unexpected victory and the flood of media attention.",
      "example_cn": "球队在意外获胜并迎来媒体狂潮后，陷入了晕头转向的状态。"
    },
    {
      "pos": "verb",
      "explanation_en": "To turn or spin rapidly, often in an uncontrolled or dizzying manner, either physically or metaphorically.",
      "explanation_cn": "指快速旋转或转动，常是失控或令人眩晕的方式，可指身体动作，也可用于比喻。",
      "example_en": "The dancer was reeling across the stage with graceful, swirling movements.",
      "example_cn": "舞者在舞台上以优雅的旋转动作翩翩起舞。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or sway unsteadily, as if from fatigue, injury, or intoxication.",
      "explanation_cn": "指因疲劳、受伤或醉酒而摇晃、蹒跚地移动。",
      "example_en": "He reeled out of the bar, barely able to stand.",
      "example_cn": "他摇摇晃晃地走出酒吧，几乎站不稳。"
    },
    {
      "pos": "verb",
      "explanation_en": "To draw in or wind something, especially a fishing line or thread, using a reel.",
      "explanation_cn": "指用卷轴将某物（如渔线、线轴）卷回或收起。",
      "example_en": "The fisherman reeled in the catch after a long struggle.",
      "example_cn": "渔夫经过一番搏斗后将鱼收了上来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "staggering",
      "analysis": "“Staggering” (蹒跚的) 强调因身体虚弱、醉酒或受伤而步履不稳，侧重于行走姿态的失控；而 “reeling” 更广泛，可涵盖情绪、心理或感官上的眩晕，不一定伴随实际行走。"
    },
    {
      "word_to_compare": "spinning",
      "analysis": "“Spinning” (旋转的) 通常指有规律或持续的圆周运动，如陀螺旋转；而 “reeling” 常带有失控、混乱或晕眩的意味，更强调主观感受的不稳定，常用于比喻性语境。"
    },
    {
      "word_to_compare": "dazed",
      "analysis": "“Dazed” (茫然的) 描述一种意识模糊、反应迟钝的心理状态，通常由冲击或创伤引起；而 “reeling” 不仅包含心理上的混乱，还常伴随身体上的摇晃感，更具动态性和生理表现。"
    }
  ]
}