{
  "word": "reel",
  "pronunciation": "reel",
  "concise_definition": "n. 卷轴, 卷筒; v. 卷起, 摇晃, 退却",
  "forms": {
    "third_person_singular": "reels",
    "past_tense": "reeled",
    "past_participle": "reeled",
    "present_participle": "reeling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A cylindrical device around which film, thread, or wire is wound, often used in filmmaking, fishing, or textile industries.",
      "explanation_cn": "一种圆柱形装置，用于缠绕胶片、线或电线，常用于电影制作、钓鱼或纺织行业。",
      "example_en": "The cinematographer loaded the new film onto the reel.",
      "example_cn": "摄影师将新胶片装入卷轴。"
    },
    {
      "pos": "noun",
      "explanation_en": "A long sequence of events or items presented in rapid succession, often used metaphorically to describe overwhelming experiences.",
      "explanation_cn": "指一系列快速接连发生的事件或事物，常用于比喻令人应接不暇或情绪剧烈冲击的经历。",
      "example_en": "A reel of memories flashed through her mind as she opened the old photo album.",
      "example_cn": "当她打开旧相册时，一连串回忆在脑海中闪现。"
    },
    {
      "pos": "verb",
      "explanation_en": "To wind or coil something tightly around a spool or cylinder, especially film, line, or thread.",
      "explanation_cn": "指将某物（如胶片、线或线）紧密地缠绕在卷轴或圆筒上。",
      "example_en": "He reeled in the fishing line after catching a large trout.",
      "example_cn": "他钓到一条大鳟鱼后，把鱼线收了回来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To sway or stagger unsteadily, often due to shock, dizziness, or physical impact.",
      "explanation_cn": "指因震惊、眩晕或身体撞击而摇晃、踉跄，常形容人失去平衡的状态。",
      "example_en": "She reeled back in horror after seeing the accident.",
      "example_cn": "她看到事故后惊恐地后退了几步。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or cause to move in a rapid, spinning motion, often used in the context of film or data display.",
      "explanation_cn": "指快速旋转或使某物呈旋转运动，常用于描述电影播放或数据滚动显示。",
      "example_en": "The credits began to reel up the screen as the movie ended.",
      "example_cn": "电影结束时，字幕开始从屏幕底部向上滚动。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "spool",
      "analysis": "“Spool”（线轴）与 “reel” 在物理形态上非常相似，都指缠绕线或胶片的圆柱体。但 “spool” 更常用于缝纫、电工或工业场景，强调功能性；而 “reel” 更多用于电影、钓鱼或比喻性语境，带有更强的文化和情感色彩。"
    },
    {
      "word_to_compare": "stagger",
      "analysis": "“Stagger”（蹒跚）与 “reel” 在表示身体摇晃时可互换，但 “stagger” 更强调因虚弱、醉酒或受伤导致的不稳步伐，而 “reel” 更侧重于因突然冲击（如情绪、打击）引发的瞬间失衡，语义更强烈、更具戏剧性。"
    },
    {
      "word_to_compare": "roll",
      "analysis": "“Roll”（滚动/卷起）是一个更通用的词，可指任何圆形物体的滚动或卷曲动作，如卷地毯、滚动球体。而 “reel” 特指围绕一个轴心有方向性地缠绕或收放，强调机械结构和连续性，尤其在电影和钓鱼语境中不可替代。"
    }
  ]
}