{
  "word": "reference",
  "pronunciation": "ref·ruh·nuhns",
  "concise_definition": "n. 提及, 参考, 介绍信, 目录; v. 引用, 参考",
  "forms": {
    "plural": "references"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A mention or allusion to a source, person, or thing, often used to support an argument, provide context, or direct further inquiry.",
      "explanation_cn": "指对某一来源、人物或事物的提及或暗示，常用于支持论点、提供背景或引导进一步查询。",
      "example_en": "The researcher included several academic references to back up her claims.",
      "example_cn": "这位研究者引用了多项学术资料来支持她的主张。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who can vouch for someone’s character, qualifications, or abilities, typically contacted for a recommendation.",
      "explanation_cn": "指能为某人的品格、资格或能力作证的人，通常在求职或申请时被联系以提供推荐。",
      "example_en": "She provided three professional references for her job application.",
      "example_cn": "她在求职申请中提供了三位职业推荐人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A source of information, such as a book, database, or dictionary, used to obtain facts or data.",
      "explanation_cn": "指用于获取事实或数据的信息来源，如书籍、数据库或词典。",
      "example_en": "The library is a valuable reference for students studying history.",
      "example_cn": "图书馆是学习历史的学生们宝贵的参考资料。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cite or allude to a source, person, or thing in order to support or clarify a point.",
      "explanation_cn": "指在论证或澄清观点时引用或提及某一来源、人物或事物。",
      "example_en": "The article references several studies published in the last decade.",
      "example_cn": "这篇文章引用了过去十年发表的多项研究。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "citation",
      "analysis": "“Citation” (引用) 通常指在学术或正式写作中对文献、数据或观点的精确标注，强调格式规范和来源可追溯性。而 “reference” 范围更广，可包括非正式提及、推荐人或资料来源，不一定要求严格格式。"
    },
    {
      "word_to_compare": "allusion",
      "analysis": "“Allusion” (暗指) 是一种文学或修辞手法，指间接、含蓄地提及某人或某事，常依赖读者的文化背景理解。而 “reference” 更直接、明确，目的通常是提供信息或支持，而非制造文学效果。"
    },
    {
      "word_to_compare": "source",
      "analysis": "“Source” (来源) 是一个更中性的术语，泛指信息的原始出处，不包含“使用”或“提及”的动作。而 “reference” 强调主动地将该来源引入语境中，具有功能性目的，如支持论点或引导查阅。"
    }
  ]
}