{
  "word": "referees",
  "pronunciation": "ref·uh·reez",
  "concise_definition": "n. 裁判, 仲裁者, 证明人",
  "forms": {
    "singular": "referee"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person officially appointed to oversee and enforce the rules of a sports game, ensuring fair play and resolving disputes between participants.",
      "explanation_cn": "指被正式任命来监督和执行体育比赛规则、确保公平竞赛并解决参赛者之间争议的人。",
      "example_en": "The referee blew the whistle to stop the game after the foul.",
      "example_cn": "裁判在犯规后吹响了哨子，停止了比赛。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who attests to the character, qualifications, or abilities of another, typically in a formal context such as a job application or academic recommendation.",
      "explanation_cn": "指在正式场合（如求职申请或学术推荐）中为他人品格、资格或能力作证或背书的人。",
      "example_en": "She provided three professional referees to support her job application.",
      "example_cn": "她提供了三位专业推荐人来支持她的求职申请。"
    },
    {
      "pos": "noun",
      "explanation_en": "An impartial third party who mediates or adjudicates disputes between two or more sides, especially in non-sports contexts such as arbitration or academic peer review.",
      "explanation_cn": "指在非体育语境中（如仲裁或学术同行评审）调解或裁决双方或多方争议的中立第三方。",
      "example_en": "The two companies agreed to submit their contract dispute to an independent referee.",
      "example_cn": "两家公司同意将合同争议提交给一位独立仲裁人处理。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "umpire",
      "analysis": "“Umpire”（板球、网球等运动中的裁判）通常特指某些特定运动（如板球、网球）中的裁判，且常与“referee”在足球、篮球等运动中互换使用。但“umpire”更常用于双人或分边裁判体系中，而“referee”通常是全场唯一或主要的执法者。此外，“umpire”极少用于非体育语境，而“referee”可以指仲裁者或证明人。"
    },
    {
      "word_to_compare": "arbitrator",
      "analysis": "“Arbitrator”（仲裁员）是法律或商业语境中专门解决合同或纠纷的中立第三方，其裁决通常具有法律约束力。而“referee”在非体育语境中虽可作类似用法，但更偏向临时性、非正式或程序性调解，法律效力较弱。"
    },
    {
      "word_to_compare": "witness",
      "analysis": "“Witness”（证人）是目睹事件发生并提供事实陈述的人，其角色是被动地陈述所见，不具有评判或裁决权。而“referee”作为证明人（reference）是主动提供评价性意见，用于支持他人资格或品格，具有推荐性质，而非仅陈述事实。"
    }
  ]
}