{
  "word": "reforming",
  "pronunciation": "ri·form·ing",
  "concise_definition": "v. 改革, 改良; adj. 改革的, 改良的",
  "forms": {
    "base_form": "reform",
    "third_person_singular": "reforms",
    "past_tense": "reformed",
    "past_participle": "reformed",
    "present_participle": "reforming"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To make changes to a system, institution, or practice in order to improve it, often by correcting faults, eliminating abuses, or adapting to new needs.",
      "explanation_cn": "指对某种制度、体系或做法进行调整，以纠正错误、消除弊端或适应新需求，从而实现改进。",
      "example_en": "The government is reforming the education system to promote equity and innovation.",
      "example_cn": "政府正在改革教育体系，以促进公平与创新。"
    },
    {
      "pos": "verb",
      "explanation_en": "To change someone's behavior or character for the better, especially through moral or spiritual influence.",
      "explanation_cn": "指通过道德或精神上的影响，使某人的行为或性格向更好的方向转变。",
      "example_en": "The prison program aims at reforming offenders through vocational training and counseling.",
      "example_cn": "该监狱项目旨在通过职业培训和心理咨询来改造罪犯。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that is intended to bring about improvement or change, especially in social, political, or institutional contexts.",
      "explanation_cn": "形容旨在带来改进或变革的事物，尤其用于社会、政治或制度语境中。",
      "example_en": "The reforming movement pushed for cleaner elections and greater transparency.",
      "example_cn": "这场改革运动推动了更清洁的选举和更大的透明度。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "improving",
      "analysis": "“Improving” (改善) 是一个更广泛、中性的词，泛指任何程度的变好，不必然涉及系统性或结构性的改变。而 “reforming” 强调对既有制度、规则或体系的主动修正，通常带有政治、社会或制度层面的意图。"
    },
    {
      "word_to_compare": "changing",
      "analysis": "“Changing” (改变) 是一个中性词，仅表示状态或形式的变动，不隐含好坏倾向。而 “reforming” 隐含积极价值判断，特指朝向更合理、公正或高效方向的改变。"
    },
    {
      "word_to_compare": "modernizing",
      "analysis": "“Modernizing” (现代化) 侧重于使事物适应现代标准、技术或生活方式，常与科技、基础设施或管理方式相关。而 “reforming” 更关注纠正不公、低效或腐败等结构性问题，不一定涉及技术更新。"
    }
  ]
}