{
  "word": "reformation",
  "pronunciation": "ree·fuhr·mey·shuhn",
  "concise_definition": "n. 改革, 改良, 改造",
  "forms": {
    "plural": "reformations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A significant change or improvement made to a system, institution, or practice, especially one aimed at correcting abuses or inefficiencies and promoting fairness or effectiveness.",
      "explanation_cn": "指对某种制度、体系或实践进行的重大变革或改良，通常旨在纠正弊端或低效，以促进公平性或有效性。",
      "example_en": "The education reformation of the 19th century introduced compulsory schooling for all children.",
      "example_cn": "19世纪的教育改革为所有儿童引入了义务教育。"
    },
    {
      "pos": "noun",
      "explanation_en": "A religious movement, especially the Protestant Reformation of the 16th century, that sought to reform the doctrines and practices of the established church.",
      "explanation_cn": "指一种宗教运动，尤指16世纪的宗教改革，旨在改革现有教会的教义与实践。",
      "example_en": "Martin Luther's Ninety-Five Theses sparked the Protestant Reformation across Europe.",
      "example_cn": "马丁·路德的《九十五条论纲》引发了欧洲各地的宗教改革。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process of improving or correcting one's own character or behavior, often through moral or spiritual renewal.",
      "explanation_cn": "指通过道德或精神上的更新来改善或纠正自身的品格或行为的过程。",
      "example_en": "After his imprisonment, he underwent a personal reformation and became an advocate for prison reform.",
      "example_cn": "服刑后，他经历了个人的改造，成为监狱改革的倡导者。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "reform",
      "analysis": "“Reform” 是动词或可数名词，强调具体的改革行为或措施，如 “a political reform”（一项政治改革）；而 “reformation” 通常是不可数名词，侧重于改革的整体过程、历史事件或深远影响，尤其在宗教或制度层面使用时更具宏观性和历史性。"
    },
    {
      "word_to_compare": "revolution",
      "analysis": "“Revolution” (革命) 指剧烈、彻底、往往暴力的颠覆性变革，常打破原有结构；而 “reformation” 强调在原有体系内进行渐进式、非暴力的修正与完善，目标是改良而非推翻。"
    },
    {
      "word_to_compare": "transformation",
      "analysis": "“Transformation” (转变) 指根本性的、全面的形态或性质变化，可能涉及外观、结构或本质的彻底改变；而 “reformation” 更侧重于纠正错误、恢复正轨，通常保留原有框架，仅优化其功能或道德基础。"
    }
  ]
}