{
  "word": "reformed",
  "pronunciation": "rih·formd",
  "concise_definition": "adj. 改过自新的, 改革后的; v. 改正, 改革 (reform 的过去式和过去分词)",
  "forms": {
    "base_form": "reform",
    "third_person_singular": "reforms",
    "past_tense": "reformed",
    "past_participle": "reformed",
    "present_participle": "reforming"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having changed one's behavior or beliefs, especially after a period of wrongdoing or moral failure; no longer engaged in harmful or illegal activities.",
      "explanation_cn": "指曾经有过不良行为或道德过失，但已改变其行为或信念，不再从事有害或非法活动的人。",
      "example_en": "He is a reformed alcoholic who now volunteers at a recovery center.",
      "example_cn": "他是一名改过自新的酗酒者，如今在康复中心做志愿者。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Modified or improved through systematic change, especially in institutions, systems, or practices to make them more just, efficient, or ethical.",
      "explanation_cn": "指通过系统性变革而被修改或改进的制度、体系或实践，使其更公正、高效或合乎道德。",
      "example_en": "The reformed education system emphasizes critical thinking over rote memorization.",
      "example_cn": "改革后的教育体系强调批判性思维，而非死记硬背。"
    },
    {
      "pos": "verb",
      "explanation_en": "To change something for the better by removing faults, abuses, or outdated elements; to improve or correct a system, law, or behavior.",
      "explanation_cn": "指通过消除缺陷、弊端或过时元素来使某事物变得更好；改进或纠正制度、法律或行为。",
      "example_en": "The government reformed the tax code to reduce inequality.",
      "example_cn": "政府改革了税法以减少不平等。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "revised",
      "analysis": "“Revised” (修订) 通常指对文本、计划或文件进行局部修改以提高准确性或清晰度，不必然涉及道德或结构性的深层改变。而 “reformed” 强调对制度、行为或体系的根本性改进，常带有道德或社会正义的内涵。"
    },
    {
      "word_to_compare": "transformed",
      "analysis": "“Transformed” (彻底改变) 指发生根本性、彻底性的变化，形式或本质可能完全改变。而 “reformed” 更侧重于纠正错误、回归正轨，通常保留原有结构，只是使其更合理或道德。例如：一个腐败的系统被改革（reformed），但未必被彻底转化（transformed）为另一个系统。"
    },
    {
      "word_to_compare": "improved",
      "analysis": "“Improved” (改善) 是一个通用词，泛指任何程度的变好，可以是微小的优化。而 “reformed” 暗示了对系统性缺陷或道德堕落的纠正，语义更强烈、更正式，常用于社会、法律或个人道德层面的深刻变革。"
    }
  ]
}