{
  "word": "registrar",
  "pronunciation": "rih·jis·trahr",
  "concise_definition": "n. 注册官, 登记员, 教务长",
  "forms": {
    "plural": "registrars"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An official responsible for maintaining official records, especially in a government, university, or legal context, such as births, deaths, marriages, or student enrollments.",
      "explanation_cn": "指负责维护官方记录的官员，尤其在政府、大学或法律环境中，负责登记出生、死亡、婚姻或学生注册等事务。",
      "example_en": "The registrar's office handles all student course registrations and academic transcripts.",
      "example_cn": "教务处负责处理所有学生的课程注册和成绩单。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or office that manages the registration of domain names on the internet, acting as an intermediary between the domain name registry and the public.",
      "explanation_cn": "指在互联网上管理域名注册的个人或机构，作为域名注册局与公众之间的中介。",
      "example_en": "You can purchase your domain through a certified registrar like GoDaddy or Namecheap.",
      "example_cn": "你可以通过像GoDaddy或Namecheap这样的认证注册商购买你的域名。"
    },
    {
      "pos": "noun",
      "explanation_en": "In some countries, a registrar may also serve as a civil official who performs marriage ceremonies and maintains vital records.",
      "explanation_cn": "在某些国家，注册官还可能担任民事官员，主持婚礼仪式并保管重要生命记录。",
      "example_en": "The registrar officiated the wedding and filed the marriage certificate with the city hall.",
      "example_cn": "注册官主持了婚礼，并将结婚证书提交至市政厅存档。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "clerk",
      "analysis": "“Clerk”（职员）泛指从事文书、行政工作的人员，职责范围广泛，可能包括收发文件、接待访客等，但不一定涉及官方记录的正式登记。而 “registrar” 特指负责官方登记和记录管理的职位，具有更强的权威性和法定职责。"
    },
    {
      "word_to_compare": "administrator",
      "analysis": "“Administrator”（管理员）强调对系统、组织或流程的整体管理与运营，可能涉及人事、财务、政策制定等高层职能。而 “registrar” 的职责更聚焦于具体的信息登记与档案管理，属于执行性岗位，而非决策性角色。"
    },
    {
      "word_to_compare": "registry",
      "analysis": "“Registry”（登记处/登记簿）是名词，指记录本身或负责登记的机构整体，是一个抽象或实体的系统；而 “registrar” 是指执行登记工作的具体人员或职位。例如：The registry keeps the records; the registrar updates them.（登记处保存记录；注册官更新记录。）"
    }
  ]
}