{
  "word": "regina",
  "pronunciation": "ree·jin·uh",
  "concise_definition": "n. 女王, 拉丁语中的“女王”",
  "forms": {
    "plural": "reginae"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A Latin word meaning 'queen', often used in formal, historical, or ecclesiastical contexts to denote a female monarch or a symbolic figure of sovereignty.",
      "explanation_cn": "拉丁语中意为‘女王’，常用于正式、历史或宗教语境中，指女性君主或象征主权的象征性人物。",
      "example_en": "The title 'Regina' was inscribed on ancient Roman coins to honor the empress.",
      "example_cn": "‘Regina’这一头衔被刻在古罗马硬币上，以尊崇皇后。"
    },
    {
      "pos": "noun",
      "explanation_en": "A proper noun used as a female given name, often chosen for its regal and classical connotations, especially in English-speaking countries with Latin cultural influences.",
      "explanation_cn": "用作女性名字的专有名词，常因其高贵和古典的内涵而被选用，尤其在受拉丁文化影响的英语国家。",
      "example_en": "Regina George is the popular but manipulative leader of the Plastics in the movie Mean Girls.",
      "example_cn": "在电影《贱女孩》中，雷吉娜·乔治是塑料女孩团体中受欢迎但善于操纵的领袖。"
    },
    {
      "pos": "noun",
      "explanation_en": "A term used in some religious or liturgical contexts to refer to the Virgin Mary as 'Queen of Heaven' (Regina Caeli, Regina Coeli).",
      "explanation_cn": "在某些宗教或礼仪语境中，用以尊称圣母玛利亚为‘天后’（Regina Caeli / Regina Coeli）。",
      "example_en": "During Easter, the faithful sing the prayer 'Regina Caeli' to honor the risen Christ and his mother.",
      "example_cn": "在复活节期间，信徒们吟唱《天后颂》以尊崇复活的基督及其母亲。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "queen",
      "analysis": "“Queen” 是现代英语中表示女性君主的通用词，日常使用广泛，语义直接。而 “regina” 是其拉丁语原词，带有古典、庄严或宗教色彩，多用于特定语境，如头衔、名称或仪式语言中，不用于普通对话。"
    },
    {
      "word_to_compare": "monarch",
      "analysis": "“Monarch” (君主) 是性别中立的术语，可指国王或女王，强调统治地位而非性别。“Regina” 则明确特指女性君主，且具有语言学和文化上的历史厚重感，常用于象征性或文学性表达。"
    },
    {
      "word_to_compare": "sovereign",
      "analysis": "“Sovereign” (主权者) 强调拥有最高统治权的个体，可为男性或女性，常用于政治或法律语境。“Regina” 更侧重于身份和头衔本身，常作为专有名词或尊称使用，而非描述权力属性。"
    }
  ]
}