{
  "word": "regret",
  "pronunciation": "rih·gret",
  "concise_definition": "v. 遗憾, 后悔; n. 遗憾, 后悔, 懊悔",
  "forms": {
    "third_person_singular": "regrets",
    "past_tense": "regretted",
    "past_participle": "regretted",
    "present_participle": "regretting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To feel sorrow or disappointment over something one has done or failed to do, often with a sense of wishing it could have been different.",
      "explanation_cn": "对已做或未做的事情感到悲伤或失望，常伴有希望事情本可不同的念头。",
      "example_en": "She regrets not studying harder in college.",
      "example_cn": "她后悔大学时没有更努力学习。"
    },
    {
      "pos": "verb",
      "explanation_en": "To express sorrow or apology for something, especially in a formal or polite context.",
      "explanation_cn": "以正式或礼貌的方式表达对某事的遗憾或歉意。",
      "example_en": "We regret to inform you that your application has been declined.",
      "example_cn": "我们遗憾地通知您，您的申请已被拒绝。"
    },
    {
      "pos": "noun",
      "explanation_en": "A feeling of sadness or disappointment about a past action or decision, often accompanied by self-blame.",
      "explanation_cn": "对过去的行为或决定感到悲伤或失望，常伴随自责。",
      "example_en": "His only regret was not spending more time with his family.",
      "example_cn": "他唯一的遗憾是没有多花时间陪伴家人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A formal expression of apology or sorrow, often used in official communications.",
      "explanation_cn": "在正式沟通中使用的歉意或遗憾的表达方式。",
      "example_en": "The CEO issued a public regret over the company's environmental violations.",
      "example_cn": "首席执行官就公司违反环保规定发表了公开道歉。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "remorse",
      "analysis": "“Remorse”（内疚）比 “regret” 更强烈，通常涉及道德上的自责和深刻的良心谴责，常用于描述因伤害他人而产生的痛苦情感。而 “regret” 可以是轻微的惋惜，不一定涉及道德错误。"
    },
    {
      "word_to_compare": "apology",
      "analysis": "“Apology”（道歉）是表达歉意的行为或言语，是外在的沟通动作；而 “regret” 是内在的情感状态，虽然常通过道歉表达，但本身不是行为。一个人可以感到 regret 但不道歉，也可以道歉但内心并无 regret。"
    },
    {
      "word_to_compare": "lament",
      "analysis": "“Lament”（哀叹）强调公开或抒情地表达悲伤，常用于文学或仪式语境，带有更强的悲情色彩。而 “regret” 更日常、更个人化，侧重于对个人选择的反思，不一定伴随外在表现。"
    }
  ]
}