{
  "word": "regulate",
  "pronunciation": "reg·yuh·leyt",
  "concise_definition": "v. 调节, 管理, 规范, 控制",
  "forms": {
    "third_person_singular": "regulates",
    "past_tense": "regulated",
    "past_participle": "regulated",
    "present_participle": "regulating"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To control or direct according to rule, principle, or law, especially by establishing standards or limits to ensure order or safety.",
      "explanation_cn": "指根据规则、原则或法律来控制或指导，通常通过设定标准或限制来确保秩序或安全。",
      "example_en": "The government regulates the safety standards of food products.",
      "example_cn": "政府对食品的安全标准进行监管。"
    },
    {
      "pos": "verb",
      "explanation_en": "To adjust or modify something to achieve a desired level of function, balance, or accuracy, often mechanically or systematically.",
      "explanation_cn": "指通过机械或系统性的方式调整某物，以达到期望的功能、平衡或精确度。",
      "example_en": "You need to regulate the thermostat to keep the room at a comfortable temperature.",
      "example_cn": "你需要调节恒温器，使房间保持舒适的温度。"
    },
    {
      "pos": "verb",
      "explanation_en": "To bring into proper order or condition by imposing rules or oversight, especially in an institutional or organizational context.",
      "explanation_cn": "指通过施加规则或监督，使某事物（尤指机构或组织中的事务）恢复或维持正常状态。",
      "example_en": "The university regulates student behavior through a formal code of conduct.",
      "example_cn": "大学通过正式的行为准则来规范学生行为。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "control",
      "analysis": "“Control” (控制) 是一个更广泛、更通用的词，指施加影响以决定某事物的运行方式，可能包含强制、压制或主导的含义。而 “regulate” 更强调通过既定规则、标准或制度进行系统性管理，通常带有合法性和规范性，语气更中性或正式。"
    },
    {
      "word_to_compare": "adjust",
      "analysis": "“Adjust” (调整) 侧重于对某物进行微小的、局部的改动以适应特定需求或环境，通常是临时性或技术性的操作，如调音量、调座椅。而 “regulate” 更强调建立长期、系统性的管理机制，常用于制度、法律或生理过程的稳定控制。"
    },
    {
      "word_to_compare": "govern",
      "analysis": "“Govern” (治理) 通常用于宏观层面，指对国家、组织或群体进行整体性领导和管理，强调权力和决策的行使。而 “regulate” 更聚焦于制定和执行具体规则，以约束行为或过程，是治理的手段之一，但范围更窄、更技术性。"
    }
  ]
}