{
  "word": "rehab",
  "pronunciation": "ree·hab",
  "concise_definition": "n. 康复治疗, 戒毒康复; v. 使康复, 使复健",
  "forms": {
    "plural": "rehabs",
    "third_person_singular": "rehabbs",
    "past_tense": "rehabbed",
    "past_participle": "rehabbed",
    "present_participle": "rehabbing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A program or facility providing medical and psychological treatment to help someone recover from addiction, injury, or illness, especially substance abuse.",
      "explanation_cn": "指为帮助个体从成瘾、伤病或疾病中康复而提供的医疗与心理治疗项目或机构，尤指针对药物或酒精依赖的戒断与恢复计划。",
      "example_en": "He completed a 30-day rehab program after his DUI arrest.",
      "example_cn": "他在因酒后驾车被捕后，完成了为期30天的康复治疗。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process of restoring physical function and strength after injury or surgery, often involving exercise, therapy, and medical supervision.",
      "explanation_cn": "指在受伤或手术后，通过锻炼、理疗和医疗监督来恢复身体功能与力量的过程。",
      "example_en": "After the knee surgery, she began physical rehab to regain mobility.",
      "example_cn": "膝盖手术后，她开始了物理康复训练以恢复行动能力。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provide rehabilitation services to someone, helping them recover from addiction, injury, or illness.",
      "explanation_cn": "指为某人提供康复服务，帮助其从成瘾、伤病或疾病中恢复。",
      "example_en": "The center rehabbed dozens of former addicts into productive members of society.",
      "example_cn": "该中心帮助数十名前吸毒者重新融入社会，成为有贡献的成员。"
    },
    {
      "pos": "verb",
      "explanation_en": "To restore or renovate something (especially a building or vehicle) to a good condition, often used informally.",
      "explanation_cn": "（非正式用法）指将某物（尤指建筑物或车辆）修复或翻新至良好状态。",
      "example_en": "They rehabbed the old house and turned it into a cozy bed-and-breakfast.",
      "example_cn": "他们翻新了这栋老房子，将其改造成了一家温馨的民宿。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "recovery",
      "analysis": "“Recovery” (恢复) 是一个更广泛、更抽象的名词，泛指从疾病、创伤或不良状态中恢复的过程或结果，不特指治疗手段。而 “rehab” 强调的是有组织、有专业支持的治疗过程，是实现 “recovery” 的一种具体方式。"
    },
    {
      "word_to_compare": "therapy",
      "analysis": "“Therapy” (治疗) 指任何形式的医疗或心理干预，包括药物、谈话、物理治疗等，范围更广。而 “rehab” 通常指综合性的、长期的康复计划，常包含多种疗法，且更侧重于功能恢复与生活重建，尤其在成瘾或术后场景中。"
    },
    {
      "word_to_compare": "renovate",
      "analysis": "“Renovate” (翻新) 专指对建筑物、设施等进行修复和更新，使其外观或功能恢复如新。虽然 “rehab” 在非正式语境中可与之互换，但 “renovate” 不涉及人体或健康恢复，仅用于物体，语义范围更窄且无医疗含义。"
    }
  ]
}