{
  "word": "rehabilitation",
  "pronunciation": "ree·hab·uh·lih·tey·shuhn",
  "concise_definition": "n. 康复, 改造, 复原",
  "forms": {
    "plural": "rehabilitations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of restoring someone to a healthy, normal life, especially after illness, injury, addiction, or incarceration, through medical, psychological, or social support.",
      "explanation_cn": "指通过医疗、心理或社会支持，帮助个体在疾病、受伤、成瘾或监禁后恢复健康、正常的生活状态的过程。",
      "example_en": "After his stroke, he underwent months of physical rehabilitation to regain mobility.",
      "example_cn": "中风后，他接受了数月的物理康复治疗，以恢复行动能力。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process of reforming criminals or offenders through education, training, and therapy, with the goal of reducing recidivism and reintegrating them into society.",
      "explanation_cn": "指通过教育、培训和心理治疗等方式改造罪犯或违法者，旨在降低再犯率并帮助其重新融入社会。",
      "example_en": "The prison's rehabilitation program includes job training and counseling for inmates.",
      "example_cn": "该监狱的改造项目包括为囚犯提供职业培训和心理咨询。"
    },
    {
      "pos": "noun",
      "explanation_en": "The restoration of something damaged or degraded to its original or improved condition, often used in environmental or structural contexts.",
      "explanation_cn": "指将受损或退化的物体或环境恢复至原有或更优状态的过程，常用于环境或建筑领域。",
      "example_en": "The rehabilitation of the historic building took five years and cost millions of dollars.",
      "example_cn": "这座历史建筑的修复工程历时五年，耗资数百万美元。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "recovery",
      "analysis": "“Recovery” (恢复) 更侧重于从疾病、创伤或损失中恢复到正常状态，强调结果而非过程，常用于身体或经济层面。而 “rehabilitation” 更强调通过系统性干预（如治疗、训练）实现功能重建，过程更主动、更全面。"
    },
    {
      "word_to_compare": "reformation",
      "analysis": "“Reformation” (改革) 通常指制度、体系或社会结构的根本性变革，如宗教改革或政治改革。虽然在某些语境下可与 “rehabilitation” 重叠（如罪犯改造），但后者更聚焦于个体层面的修复与适应，而非系统性重构。"
    },
    {
      "word_to_compare": "restoration",
      "analysis": "“Restoration” (修复/复原) 多用于物体、建筑或自然环境的物理性修复，强调恢复原貌，常不含“功能重建”或“行为矫正”的含义。而 “rehabilitation” 在涉及人时，包含心理、社会和生理层面的综合重建，意义更广泛。"
    }
  ]
}