{
  "word": "reigns",
  "pronunciation": "raynz",
  "concise_definition": "n. 统治时期, 统治权; v. 统治, 主导, 占据主导地位",
  "forms": {
    "base_form": "reign",
    "third_person_singular": "reigns",
    "past_tense": "reigned",
    "past_participle": "reigned",
    "present_participle": "reigning"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The period during which a monarch holds power and exercises authority over a kingdom or territory.",
      "explanation_cn": "指君主在位期间行使权力统治王国或领土的时期。",
      "example_en": "The reigns of Queen Elizabeth II and King Charles III mark two distinct eras in British history.",
      "example_cn": "伊丽莎白二世女王和查尔斯三世国王的统治时期标志着英国历史上的两个不同时代。"
    },
    {
      "pos": "noun",
      "explanation_en": "The period during which a particular person, idea, or force dominates or holds supreme influence in a particular domain.",
      "explanation_cn": "指某人、某种思想或力量在一个特定领域内占据主导地位或拥有至高影响力的时期。",
      "example_en": "The reigns of classical music in the 18th century gave way to romanticism in the 19th.",
      "example_cn": "18世纪古典音乐的统治地位在19世纪让位于浪漫主义。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hold and exercise sovereign power as a monarch or ruler.",
      "explanation_cn": "指作为君主或统治者行使主权权力。",
      "example_en": "The king reigned for over 60 years before abdicating in favor of his son.",
      "example_cn": "这位国王统治了六十多年，之后退位让位于他的儿子。"
    },
    {
      "pos": "verb",
      "explanation_en": "To dominate or prevail overwhelmingly in a particular context or sphere, often without direct authority.",
      "explanation_cn": "指在特定情境或领域中占据压倒性主导地位，通常不依赖正式权威。",
      "example_en": "Fear reigns in the city after the recent wave of violent crimes.",
      "example_cn": "最近一波暴力犯罪后，恐惧笼罩着这座城市。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rule",
      "analysis": "“Rule” (统治) 更广泛地指任何形式的控制或管理，可以是合法的、专制的、或非正式的，适用于政府、组织甚至家庭。而 “reign” 通常特指君主制下的统治，带有历史、仪式性和象征性色彩，更强调地位而非具体行为。"
    },
    {
      "word_to_compare": "dominate",
      "analysis": "“Dominate” (主导) 强调在竞争或影响力上的压倒性优势，常用于非政治语境，如市场、文化或心理层面。而 “reign” 在作动词时虽可表主导，但更常用于比喻性表达，且保留了君主制的隐喻意象，语气更庄重或诗意。"
    },
    {
      "word_to_compare": "era",
      "analysis": "“Era” (时代) 是一个中性的时间段划分术语，不包含权力或控制的含义，仅描述历史分期。而 “reign” 作为名词时，特指某位统治者掌权的时期，隐含权力关系，是“era”的一种子类型，但更具政治和人物中心性。"
    }
  ]
}