{
  "word": "reign",
  "pronunciation": "rayn",
  "concise_definition": "n. 统治, 统治时期; v. 统治, 主导",
  "forms": {
    "third_person_singular": "reigns",
    "past_tense": "reigned",
    "past_participle": "reigned",
    "present_participle": "reigning"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The period during which a monarch holds power and exercises authority over a country or territory.",
      "explanation_cn": "指君主在位并行使权力统治一个国家或领土的时期。",
      "example_en": "The reign of Queen Elizabeth II lasted for 70 years, making it the longest in British history.",
      "example_cn": "伊丽莎白二世女王的统治持续了70年，是英国历史上最长的。"
    },
    {
      "pos": "noun",
      "explanation_en": "Dominant influence or control over a particular domain, often used metaphorically to describe something that is overwhelmingly prevalent.",
      "explanation_cn": "指在某一领域内占主导地位的影响力或控制力，常用于比喻某种事物占据绝对主导地位。",
      "example_en": "For decades, this brand reigned supreme in the smartphone market.",
      "example_cn": "几十年来，这个品牌在智能手机市场中占据绝对主导地位。"
    },
    {
      "pos": "verb",
      "explanation_en": "To exercise sovereign power or authority as a monarch or ruler.",
      "explanation_cn": "指作为君主或统治者行使主权权力。",
      "example_en": "King Louis XIV reigned over France for 72 years, centralizing power in the monarchy.",
      "example_cn": "路易十四统治法国长达72年，将权力集中于王室。"
    },
    {
      "pos": "verb",
      "explanation_en": "To dominate or have overwhelming influence in a particular area or context, often without formal authority.",
      "explanation_cn": "指在某一领域或情境中占据主导地位或产生压倒性影响，通常不依赖正式权威。",
      "example_en": "Fear reigned in the city after the sudden outbreak of violence.",
      "example_cn": "暴力突然爆发后，恐惧笼罩了整座城市。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rule",
      "analysis": "“Rule” (统治) 是更通用的词，可指任何形式的控制或管理，包括非君主制的政府、组织或个人的权威。而 “reign” 更强调君主制背景下的合法继承性权力，带有历史和仪式感，常用于描述王室统治。"
    },
    {
      "word_to_compare": "dominate",
      "analysis": "“Dominate” (支配) 强调在竞争或影响力上的压倒性优势，常用于商业、文化或社会领域，不涉及正式职位。而 “reign” 在作动词时虽可比喻使用，但保留了‘君主式统治’的意象，更具权威性和象征性。"
    },
    {
      "word_to_compare": "era",
      "analysis": "“Era” (时代) 是一个时间概念，指具有特定特征的历史阶段，本身不包含统治行为。而 “reign” 是一个事件性名词，特指某位统治者掌权的时期，是构成“era”的一个组成部分。例如：‘the Victorian era’ 是由 ‘Queen Victoria’s reign’ 所定义的。"
    }
  ]
}