{
  "word": "reinforce",
  "pronunciation": "ree·in·fohrs",
  "concise_definition": "v. 加强, 强化, 支持",
  "forms": {
    "third_person_singular": "reinforces",
    "past_tense": "reinforced",
    "past_participle": "reinforced",
    "present_participle": "reinforcing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To strengthen or increase the strength, effectiveness, or durability of something, especially by adding support or additional elements.",
      "explanation_cn": "指通过增加支持、补充元素或资源来增强某事物的强度、效果或耐久性。",
      "example_en": "The government is reinforcing the border with additional troops and surveillance systems.",
      "example_cn": "政府正在通过增派军队和监控系统来加强边境防御。"
    },
    {
      "pos": "verb",
      "explanation_en": "To support or encourage a behavior, belief, or idea, often through repetition or positive feedback, to make it more likely to continue.",
      "explanation_cn": "指通过重复或正面反馈来支持某种行为、信念或想法，使其更有可能持续发生。",
      "example_en": "Praising children for sharing helps reinforce positive social behavior.",
      "example_cn": "表扬孩子分享行为有助于强化积极的社会行为。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strengthen a structure, especially by adding materials such as steel or concrete to improve its stability or load-bearing capacity.",
      "explanation_cn": "指通过添加钢材、混凝土等材料来增强结构的稳定性或承重能力。",
      "example_en": "Engineers reinforced the bridge with steel beams to withstand earthquakes.",
      "example_cn": "工程师用钢梁加固了桥梁，以使其能够抵御地震。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "strengthen",
      "analysis": "“Strengthen” (加强) 是一个更通用的词，泛指使某物变得更坚固、有力或有效，不特指通过外部支持或补充实现。而 “reinforce” 更强调通过添加额外的支撑、材料或手段来增强，常带有工程或系统性干预的含义。"
    },
    {
      "word_to_compare": "support",
      "analysis": "“Support” (支持) 侧重于提供帮助、援助或背书，可以是情感、经济或道义上的，不一定导致结构或行为的强化。而 “reinforce” 更强调通过支持使某事物变得更牢固、更持久，具有更明显的“加固”效果。"
    },
    {
      "word_to_compare": "boost",
      "analysis": "“Boost” (提升) 通常指快速、显著地提高某事物的水平或表现，常用于情绪、经济、效率等抽象领域，带有临时性或激励性。而 “reinforce” 更注重长期、结构性的增强，强调持续性和稳定性。"
    }
  ]
}