{
  "word": "rejected",
  "pronunciation": "rih·jek·tid",
  "concise_definition": "v. 拒绝, 驳回, 抛弃; adj. 被拒绝的, 被驳回的",
  "forms": {
    "base_form": "reject",
    "third_person_singular": "rejects",
    "past_tense": "rejected",
    "past_participle": "rejected",
    "present_participle": "rejecting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To refuse to accept, consider, or approve something or someone, often due to unsuitability, inadequacy, or disagreement.",
      "explanation_cn": "因不适宜、不足或不同意而拒绝接受、考虑或批准某事物或某人。",
      "example_en": "The journal rejected her research paper after peer review.",
      "example_cn": "经过同行评审后，该期刊驳回了她的研究论文。"
    },
    {
      "pos": "verb",
      "explanation_en": "To dismiss or discard something as unworthy, invalid, or undesirable.",
      "explanation_cn": "将某事物视为无价值、无效或不理想而丢弃或摒弃。",
      "example_en": "He rejected the old furniture and bought a modern set instead.",
      "example_cn": "他扔掉了旧家具，换了一套现代风格的。"
    },
    {
      "pos": "verb",
      "explanation_en": "In computing or telecommunications, to refuse to accept a transmission, request, or connection.",
      "explanation_cn": "在计算机或电信领域，指拒绝接受传输、请求或连接。",
      "example_en": "The server rejected the login attempt due to incorrect credentials.",
      "example_cn": "由于凭证错误，服务器拒绝了登录尝试。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that has been refused or dismissed, especially in social, academic, or professional contexts.",
      "explanation_cn": "描述在社交、学术或职业语境中已被拒绝或驳回的事物。",
      "example_en": "The rejected applicants were given feedback on how to improve their submissions.",
      "example_cn": "被拒的申请者收到了关于如何改进申请材料的反馈。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "refused",
      "analysis": "“Refused” (拒绝) 与 “rejected” 非常接近，但 “refused” 更常用于个人意愿或行为上的拒绝（如拒绝请求、邀请），语气较温和；而 “rejected” 更强调正式、系统性或结构性的否定，常用于机构、评审或技术场景，带有更强的否定意味。"
    },
    {
      "word_to_compare": "denied",
      "analysis": "“Denied” (否认/拒绝给予) 侧重于否定某人的权利、要求或请求，常用于法律、资源分配或权限场景（如 denied access, denied a visa）。而 “rejected” 更强调对整体事物的否定或不接受，不一定是剥夺权利，而是认为其不达标或不合适。"
    },
    {
      "word_to_compare": "turned down",
      "analysis": "“Turned down” 是 “reject” 的非正式口语表达，多用于日常语境（如 turned down a job offer），语气较随意；而 “rejected” 更正式、书面化，常用于学术、技术或官方语境，情感色彩更强烈，常带有失望或挫败感。"
    }
  ]
}