{
  "word": "rejects",
  "pronunciation": "rih·jekt",
  "concise_definition": "v. 拒绝, 回绝, 驳回; n. 拒绝物, 废品",
  "forms": {
    "base_form": "reject",
    "third_person_singular": "rejects",
    "past_tense": "rejected",
    "past_participle": "rejected",
    "present_participle": "rejecting",
    "plural": "rejects"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To refuse to accept, consider, or allow something; to turn down or dismiss outright, often due to unacceptability, incompatibility, or moral objection.",
      "explanation_cn": "拒绝接受、考虑或允许某事物；因不可接受、不相容或道德上的反对而直接驳回或摒弃。",
      "example_en": "The committee rejected the proposal because it lacked sufficient evidence.",
      "example_cn": "委员会驳回了该提案，因为它缺乏足够的证据。"
    },
    {
      "pos": "verb",
      "explanation_en": "To refuse to admit or recognize someone or something as valid, legitimate, or worthy, especially in social, professional, or emotional contexts.",
      "explanation_cn": "拒绝承认某人或某事物为有效、合法或值得的，尤其在社会、职业或情感语境中。",
      "example_en": "He felt rejected by his peers after speaking out against the norm.",
      "example_cn": "他因反对主流观点而感到被同伴们排斥。"
    },
    {
      "pos": "noun",
      "explanation_en": "An item that has been discarded because it fails to meet quality, standard, or specification requirements; a defective or substandard product.",
      "explanation_cn": "因未能达到质量、标准或规格要求而被丢弃的物品；次品或不合格产品。",
      "example_en": "The factory produces only a few rejects per thousand units.",
      "example_cn": "该工厂每千件产品中仅产生少数废品。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "refuse",
      "analysis": "“Refuse” (拒绝) 更侧重于主观意愿上的不接受，常用于表达个人态度，语气较温和，可接不定式（refuse to do）。而 “reject” 更强调主动否定或驳回，常用于正式决定、制度性筛选或对事物价值的彻底否定，语气更强硬。"
    },
    {
      "word_to_compare": "decline",
      "analysis": "“Decline” (婉拒) 通常用于礼貌性地谢绝邀请、提议或帮助，带有尊重和委婉的色彩，常用于社交场合。而 “reject” 则更直接、更严厉，常用于否定方案、申请或产品，带有评判性。"
    },
    {
      "word_to_compare": "dismiss",
      "analysis": "“Dismiss” (打发走/不予考虑) 强调轻视或迅速地将某事物从考虑范围中移除，常带有不屑或不重视的意味。而 “reject” 更强调经过评估后的正式否定，常伴随理由和程序，如法庭、委员会或质检流程中的决定。"
    }
  ]
}