{
  "word": "relationships",
  "pronunciation": "rih·lay·shuhnz",
  "concise_definition": "n. 关系, 人际关系, 联系",
  "forms": {
    "singular": "relationship"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A connection or association between two or more people, often involving emotional, social, or personal bonds such as love, trust, or mutual understanding.",
      "explanation_cn": "指两个人或更多人之间的联系，通常涉及情感、社交或个人纽带，如爱、信任或相互理解。",
      "example_en": "Healthy relationships require open communication and mutual respect.",
      "example_cn": "健康的关系需要开放的沟通和相互尊重。"
    },
    {
      "pos": "noun",
      "explanation_en": "A connection or interaction between entities, such as organizations, countries, or concepts, often defined by cooperation, conflict, or interdependence.",
      "explanation_cn": "指实体（如组织、国家或概念）之间的联系或互动，通常由合作、冲突或相互依赖所定义。",
      "example_en": "Diplomatic relationships between the two nations have improved significantly over the past decade.",
      "example_cn": "过去十年中，两国之间的外交关系显著改善。"
    },
    {
      "pos": "noun",
      "explanation_en": "A pattern of interaction or dependency in a system, such as in mathematics, biology, or data analysis, where one variable affects another.",
      "explanation_cn": "指在系统（如数学、生物学或数据分析）中，一个变量影响另一个变量的互动模式或依赖关系。",
      "example_en": "The study revealed a strong relationship between sleep quality and academic performance.",
      "example_cn": "这项研究揭示了睡眠质量与学业表现之间的密切关系。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "connection",
      "analysis": "“Connection” (联系) 指的是两个事物之间的某种关联，可以是物理的、情感的或抽象的，语义范围更广，但通常不如 “relationship” 深厚或复杂。例如，网络连接是技术性的，而人际关系则包含情感维度。"
    },
    {
      "word_to_compare": "association",
      "analysis": "“Association” (关联) 更强调一种正式或间接的联系，常用于组织、概念或统计背景中，不一定包含情感或互动。例如，吸烟与肺癌之间的关联是统计性的，而 “relationship” 则可能暗示更动态的相互作用。"
    },
    {
      "word_to_compare": "bond",
      "analysis": "“Bond” (纽带) 通常指更强烈、更持久的情感联系，尤其在亲密关系中，如亲情、友情或爱情。它比 “relationship” 更侧重情感深度，而 “relationship” 是一个更中性、更广泛的术语，可涵盖从疏远到亲密的各种互动形式。"
    }
  ]
}