{
  "word": "release",
  "pronunciation": "ri·lēs",
  "concise_definition": "v. 释放, 发布, 放松, 解除; n. 释放, 发布, 释放物",
  "forms": {
    "third_person_singular": "releases",
    "past_tense": "released",
    "past_participle": "released",
    "present_participle": "releasing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To set free from confinement, restraint, or obligation; to allow something to escape or be let go.",
      "explanation_cn": "指从束缚、限制或义务中解放出来；使某物得以逃脱或释放。",
      "example_en": "The prisoners were released after serving their full sentences.",
      "example_cn": "这些囚犯在服满刑期后被释放了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make something publicly available, especially a product, film, music, or information.",
      "explanation_cn": "指将某物（如产品、电影、音乐或信息）向公众发布或推出。",
      "example_en": "The band will release their new album next Friday.",
      "example_cn": "这支乐队将在下周五发布他们的新专辑。"
    },
    {
      "pos": "verb",
      "explanation_en": "To let go of a feeling, emotion, or tension; to stop holding back.",
      "explanation_cn": "指释放情感、情绪或紧张感；不再压抑。",
      "example_en": "She needed to release her anger through exercise.",
      "example_cn": "她需要通过锻炼来释放自己的愤怒。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of making something publicly available, especially a new product, film, or piece of music.",
      "explanation_cn": "指将某物（尤其是新产品、电影或音乐作品）向公众发布的行动。",
      "example_en": "The movie's release was delayed due to technical issues.",
      "example_cn": "由于技术问题，这部电影的上映被推迟了。"
    },
    {
      "pos": "noun",
      "explanation_en": "Something that is set free or discharged, such as a substance, energy, or a person from custody.",
      "explanation_cn": "指被释放或排放出来的事物，如物质、能量或被解除羁押的人。",
      "example_en": "The chemical plant was fined for the unauthorized release of toxic waste.",
      "example_cn": "该化工厂因未经许可排放有毒废物而被罚款。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "publish",
      "analysis": "“Publish” (出版/发表) 通常特指将文字、书籍、文章或信息正式公之于众，多用于出版业和学术领域。而 “release” 的适用范围更广，可涵盖电影、音乐、软件、产品甚至情绪的发布，语义更灵活。"
    },
    {
      "word_to_compare": "liberate",
      "analysis": "“Liberate” (解放) 语气更正式、更具政治或道德色彩，常用于从压迫、奴役或暴政中获得自由，如解放奴隶或国家。而 “release” 更中性，可指物理释放（如释放囚犯）或抽象释放（如释放压力），不必然涉及正义或道德维度。"
    },
    {
      "word_to_compare": "emit",
      "analysis": "“Emit” (发射/发出) 通常用于科学或技术语境，指物理性地释放能量、气体或辐射，如灯泡发光、汽车排放尾气。它强调物理过程，而 “release” 可用于更广泛的语境，包括抽象概念（如释放情绪）和人为行为（如发布产品）。"
    }
  ]
}