{
  "word": "released",
  "pronunciation": "ri·lēst",
  "concise_definition": "v. 释放, 发布, 放出, 解除",
  "forms": {
    "base_form": "release",
    "third_person_singular": "releases",
    "past_tense": "released",
    "past_participle": "released",
    "present_participle": "releasing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To set free from confinement, restraint, or obligation; to allow something or someone to move or act without restriction.",
      "explanation_cn": "指从束缚、限制或义务中解放出来；允许某物或某人不受限制地行动或移动。",
      "example_en": "The prisoners were released after serving their full sentences.",
      "example_cn": "这些囚犯在服满刑期后被释放了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make something publicly available, especially a product, film, music, or information, often for the first time.",
      "explanation_cn": "指将某物（如产品、电影、音乐或信息）首次向公众发布或提供。",
      "example_en": "The band released their new album last Friday.",
      "example_cn": "这支乐队上星期五发布了他们的新专辑。"
    },
    {
      "pos": "verb",
      "explanation_en": "To let go of something physically or emotionally, such as holding back feelings, energy, or pressure.",
      "explanation_cn": "指在身体上或情感上释放某物，如压抑的情绪、能量或压力。",
      "example_en": "She released a deep sigh after hearing the good news.",
      "example_cn": "听到这个好消息后，她长长地叹了一口气。"
    },
    {
      "pos": "verb",
      "explanation_en": "To discharge or emit something, such as gas, light, or radiation, often unintentionally or as a byproduct.",
      "explanation_cn": "指释放或排放某种物质，如气体、光或辐射，通常是非故意的或作为副产品。",
      "example_en": "The factory releases harmful chemicals into the river.",
      "example_cn": "这家工厂将有害化学物质排放到河里。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "let go",
      "analysis": "“Let go” (放手) 更口语化，常用于情感或心理层面的释放，如放下执念或控制欲，强调主观意愿的放弃。而 “released” 更中性，可涵盖物理、法律、技术等多维度的释放，语义范围更广。"
    },
    {
      "word_to_compare": "publish",
      "analysis": "“Publish” (出版/发表) 专指将文字、信息或作品正式公之于众，多用于书籍、文章、新闻等书面内容。而 “released” 的发布含义更广泛，可涵盖电影、音乐、软件、产品等非文字媒介，且不一定需要正式流程。"
    },
    {
      "word_to_compare": "free",
      "analysis": "“Free” (使自由) 与 “released” 在释放囚犯或限制时可互换，但 “free” 更强调恢复自由状态本身，而 “released” 更侧重于动作的执行者（如政府、机构）主动实施释放行为，常带有制度性或程序性含义。"
    }
  ]
}