{
  "word": "relinquish",
  "pronunciation": "rih·lindj·wish",
  "concise_definition": "v. 放弃, 交出, 释放",
  "forms": {
    "third_person_singular": "relinquishes",
    "past_tense": "relinquished",
    "past_participle": "relinquished",
    "present_participle": "relinquishing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To voluntarily give up or surrender something valuable, such as power, control, possession, or a claim, often with reluctance or emotional difficulty.",
      "explanation_cn": "指自愿放弃或交出某样有价值的东西，如权力、控制权、占有权或主张，通常带有不情愿或情感上的挣扎。",
      "example_en": "After decades of leadership, she reluctantly relinquished control of the company to her successor.",
      "example_cn": "在领导数十年后，她不情愿地将公司控制权交给了继任者。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cease to hold or maintain a position, right, or claim, especially under pressure or as part of a compromise.",
      "explanation_cn": "指在压力下或作为妥协的一部分，停止坚持某种立场、权利或主张。",
      "example_en": "The government was forced to relinquish its claim to the disputed territory after international arbitration.",
      "example_cn": "在国际仲裁后，政府被迫放弃了对争议领土的主张。"
    },
    {
      "pos": "verb",
      "explanation_en": "To let go of a habit, emotion, or attachment, often for personal growth or moral reasons.",
      "explanation_cn": "指为了个人成长或道德原因，放下某种习惯、情绪或依恋。",
      "example_en": "He had to relinquish his anger and forgive his brother to find inner peace.",
      "example_cn": "为了获得内心的平静，他必须放下愤怒，原谅他的兄弟。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "surrender",
      "analysis": "“Surrender” (投降/交出) 通常带有被迫、失败或屈服的含义，常用于军事、对抗或竞争语境，强调在压力下放弃抵抗。而 “relinquish” 更强调主动、自愿的放弃，即使可能不情愿，但不必然意味着失败。"
    },
    {
      "word_to_compare": "abandon",
      "analysis": "“Abandon” (遗弃/舍弃) 意味着彻底丢弃、不再关心或负责，常带有消极、不负责任的色彩，如抛弃孩子或项目。“Relinquish” 则更中性或正式，常用于合法、政治或情感上的正式移交，隐含一种有意识的决定。"
    },
    {
      "word_to_compare": "yield",
      "analysis": "“Yield” (让步/屈从) 通常指在压力、争论或竞争中让出空间、权利或立场，常用于交通、谈判或辩论语境，强调暂时或策略性的退让。“Relinquish” 更彻底，意味着永久性或决定性的放弃，而非策略性妥协。"
    }
  ]
}