{
  "word": "relics",
  "pronunciation": "ree·liks",
  "concise_definition": "n. 遗物, 遗迹, 圣物",
  "forms": {
    "singular": "relic"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An object surviving from an earlier time, especially one of historical, cultural, or religious significance, often preserved as a reminder of the past.",
      "explanation_cn": "指从早期时代遗留下来、具有历史、文化或宗教意义的物品，常被保存下来以作为对过去的纪念。",
      "example_en": "The museum displays ancient relics from the Roman Empire, including pottery, coins, and weapons.",
      "example_cn": "博物馆展出了来自罗马帝国的古代遗物，包括陶器、硬币和武器。"
    },
    {
      "pos": "noun",
      "explanation_en": "A religious object believed to be connected with a saint or holy person, often venerated by believers as a source of spiritual power.",
      "explanation_cn": "指被认为与圣人或神圣人物有关的宗教物品，常被信徒尊崇为具有灵性力量的圣物。",
      "example_en": "Pilgrims traveled for miles to see the relic of Saint Thomas Becket, said to be his bone fragment.",
      "example_cn": "朝圣者长途跋涉前来瞻仰圣托马斯·贝克特的遗物——据说是一块他的骨片。"
    },
    {
      "pos": "noun",
      "explanation_en": "Something outdated or obsolete that persists in modern times, often used metaphorically to criticize resistance to change.",
      "explanation_cn": "指在现代社会中仍存留的过时事物，常用于隐喻性批评对变革的抗拒。",
      "example_en": "The company still uses fax machines—such relics of the 20th century are slowing down productivity.",
      "example_cn": "这家公司仍在使用传真机——这些20世纪的遗物正在拖慢生产效率。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "artifact",
      "analysis": "“Artifact” (人工制品) 是考古学和人类学中的专业术语，泛指人类制造的任何物品，强调其人为性和物质性，不必然具有宗教或情感价值。而 “relic” 更强调其历史延续性、神圣性或象征意义，常带有情感或精神层面的重量。"
    },
    {
      "word_to_compare": "antique",
      "analysis": "“Antique” (古董) 指年代久远且具有收藏价值的物品，通常以美学、工艺或稀缺性为评判标准，多用于家具、装饰品等。它侧重于市场价值和审美，而 “relic” 更强调其与过去时代或人物的直接联系，常具有文化或宗教意义。"
    },
    {
      "word_to_compare": "remnant",
      "analysis": "“Remnant” (残余物) 指某物被破坏、消耗或消失后剩下的部分，强调“剩余”和“不完整”，如布料的边角料、战争后的废墟。而 “relic” 是主动保存下来的、具有纪念意义的完整物品，其存在本身就是一种传承。"
    }
  ]
}