{
  "word": "relocate",
  "pronunciation": "ree·loh·keyt",
  "concise_definition": "v. 搬迁, 重新安置, 调迁",
  "forms": {
    "third_person_singular": "relocates",
    "past_tense": "relocated",
    "past_participle": "relocated",
    "present_participle": "relocating"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move from one place to another, especially when referring to a person, family, business, or organization changing its permanent or primary location.",
      "explanation_cn": "指个人、家庭、企业或组织从一个地方迁移到另一个地方，通常指永久性或主要居住/运营地点的变更。",
      "example_en": "The company decided to relocate its headquarters to Singapore for better access to Asian markets.",
      "example_cn": "该公司决定将总部迁至新加坡，以更好地进入亚洲市场。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move something, such as equipment, infrastructure, or services, to a different location for operational, strategic, or logistical reasons.",
      "explanation_cn": "指出于运营、战略或后勤原因，将设备、基础设施或服务等移至其他地点。",
      "example_en": "The government is relocating several public clinics to underserved rural areas.",
      "example_cn": "政府正在将几家公共诊所迁往服务不足的农村地区。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause someone or something to be placed in a new position or context, often implying a significant change in environment or circumstances.",
      "explanation_cn": "指使某人或某物被置于一个新的位置或环境中，通常暗示环境或状况发生重大变化。",
      "example_en": "After the earthquake, many families were relocated to temporary housing units.",
      "example_cn": "地震后，许多家庭被安置到了临时住房中。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "move",
      "analysis": "“Move” (移动) 是一个更通用、更宽泛的词，可指任何位置上的改变，无论距离远近或是否永久。而 “relocate” 通常暗示更正式、更彻底的迁移，常涉及生活或工作的根本性变更，带有长期性或战略性含义。"
    },
    {
      "word_to_compare": "transfer",
      "analysis": "“Transfer” (转移) 强调将某人或某物从一个地方、职位或系统转移到另一个，常用于组织内部、机构之间或抽象概念（如资金、责任）的转移。它不一定涉及物理位置的改变，而 “relocate” 通常指物理空间的迁移。"
    },
    {
      "word_to_compare": "resettle",
      "analysis": "“Resettle” (重新安置) 通常用于指被迫迁移后在新地点建立长期生活，尤其用于难民、灾民或被政府安置的人群。它带有更强的人道主义或社会政策色彩，而 “relocate” 更中性，可用于商业、个人或政府行为。"
    }
  ]
}