{
  "word": "remains",
  "pronunciation": "ri·meynz",
  "concise_definition": "n. 遗体, 残留物, 遗迹; v. 保持, 残留",
  "forms": {
    "singular": "remains",
    "third_person_singular": "remains",
    "past_tense": "remained",
    "past_participle": "remained",
    "present_participle": "remaining"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The parts of a person's or animal's body that are left after death, especially when buried or cremated; often used in formal or forensic contexts.",
      "explanation_cn": "指人或动物死亡后遗留下来的躯体部分，尤其在埋葬或火化后使用，常用于正式或法医语境。",
      "example_en": "The archaeologists uncovered the remains of an ancient Roman settlement.",
      "example_cn": "考古学家发现了古罗马聚居地的遗迹。"
    },
    {
      "pos": "noun",
      "explanation_en": "Leftover parts or traces of something that has been used, consumed, or destroyed; anything that persists after the main part is gone.",
      "explanation_cn": "指某物被使用、消耗或毁坏后残留下来的部分或痕迹；任何在主体消失后仍存留的东西。",
      "example_en": "There were only a few remains of the meal left on the plate.",
      "example_cn": "盘子里只剩下一点饭菜的残渣。"
    },
    {
      "pos": "noun",
      "explanation_en": "The surviving elements of a structure, civilization, or system that have endured over time, often of historical or cultural significance.",
      "explanation_cn": "指随着时间推移而幸存下来的建筑、文明或体系的组成部分，通常具有历史或文化意义。",
      "example_en": "The remains of the medieval castle still stand on the hilltop.",
      "example_cn": "中世纪城堡的遗迹仍矗立在山顶上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To continue to exist or persist after other parts have disappeared, changed, or been removed.",
      "explanation_cn": "指在其他部分消失、改变或被移除后，仍继续存在或留存。",
      "example_en": "Even after the storm passed, the sense of fear remained.",
      "example_cn": "即使风暴过去，恐惧感依然存在。"
    },
    {
      "pos": "verb",
      "explanation_en": "To stay in the same place or condition without moving or changing; to be left behind.",
      "explanation_cn": "指停留在原地或原状，不移动或不改变；被遗留下来。",
      "example_en": "She remained silent during the entire meeting.",
      "example_cn": "她在整个会议期间都保持沉默。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "remnant",
      "analysis": "“Remnant”（残余物）通常指从整体中遗留下来的少量、零散部分，常用于描述布料、材料或抽象概念（如信仰、传统）的残余，语气更文学化或象征性。而 “remains” 更常用于指物理遗体、遗迹或物质残留，语义范围更广，也更常用于正式或科学语境。"
    },
    {
      "word_to_compare": "leftovers",
      "analysis": "“Leftovers”（剩菜剩饭）是口语化表达，特指食物中未被吃完的部分，语义狭窄且日常化。而 “remains” 可用于食物，但更广泛地用于非食物语境（如遗迹、遗体），语义更庄重、正式。"
    },
    {
      "word_to_compare": "stay",
      "analysis": "“Stay”（停留）强调动作的持续性，常用于描述人或物在空间中的位置不变，如 “stay here”。而 “remain” 更强调状态的持续，常用于抽象概念（如情绪、条件）或被动留存，语义更内敛、书面化。"
    }
  ]
}