{
  "word": "rents",
  "pronunciation": "rents",
  "concise_definition": "n. 租金, 租赁收入; v. 出租, 租用 (第三人称单数)",
  "forms": {
    "singular": "rent",
    "third_person_singular": "rents",
    "past_tense": "rented",
    "past_participle": "rented",
    "present_participle": "renting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A regular payment made by a tenant to a landlord for the use of property, such as a house, apartment, or land.",
      "explanation_cn": "承租人为了使用房屋、公寓或土地等财产而定期支付给房东的款项。",
      "example_en": "The monthly rents for the downtown apartments have increased by 15% this year.",
      "example_cn": "今年市中心公寓的月租金上涨了15%。"
    },
    {
      "pos": "noun",
      "explanation_en": "Income derived from leasing property or assets, often used in economic or legal contexts to describe unearned income from ownership.",
      "explanation_cn": "通过出租财产或资产所获得的收入，常用于经济或法律语境中，指因拥有资产而获得的非劳动性收入。",
      "example_en": "The estate generates substantial rents from its commercial properties.",
      "example_cn": "该地产通过其商业物业产生了可观的租金收入。"
    },
    {
      "pos": "verb",
      "explanation_en": "To allow someone to use property in exchange for regular payments; to lease out.",
      "explanation_cn": "允许他人使用财产并换取定期付款；将财产出租。",
      "example_en": "She rents out her spare room to international students.",
      "example_cn": "她把多余的房间租给国际学生。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pay for the temporary use of property or equipment; to hire or lease.",
      "explanation_cn": "为临时使用财产或设备而付款；租用。",
      "example_en": "We rented a car for our road trip across the country.",
      "example_cn": "我们为这次横跨全国的自驾游租了一辆车。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "lease",
      "analysis": "“Lease” (租赁) 是一个更正式、法律化的术语，通常指长期、有书面合同的财产使用权转让，常用于商业或房地产领域。而 “rent” 更常用于日常口语，涵盖短期或长期的使用支付，语义范围更广。"
    },
    {
      "word_to_compare": "fee",
      "analysis": "“Fee” (费用) 是一个泛指性词汇，指为服务、许可或特权支付的金额，不特指财产使用。例如：会员费、手续费。而 “rent” 专指因使用不动产或动产而支付的定期款项，具有明确的物权使用属性。"
    },
    {
      "word_to_compare": "hire",
      "analysis": "“Hire” (雇佣/租用) 可以指雇佣人员，也可以指短期租用物品（如设备、车辆），但更强调“获得服务”或“临时使用”的行为，而不一定涉及固定周期的付款。而 “rent” 更强调定期、有规律的金钱支付，尤其适用于房屋、土地等不动产。"
    }
  ]
}