{
  "word": "report",
  "pronunciation": "ri·pawrt",
  "concise_definition": "n. 报告, 汇报; v. 报告, 报道, 陈述",
  "forms": {
    "third_person_singular": "reports",
    "past_tense": "reported",
    "past_participle": "reported",
    "present_participle": "reporting",
    "plural": "reports"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A formal written or spoken account of information, findings, or events, typically compiled for a specific audience or purpose, such as for analysis, decision-making, or documentation.",
      "explanation_cn": "指为特定受众或目的而编写的正式书面或口头陈述，内容包括信息、调查结果或事件，常用于分析、决策或存档。",
      "example_en": "The scientist submitted a detailed report on climate change to the government.",
      "example_cn": "这位科学家向政府提交了一份关于气候变化的详细报告。"
    },
    {
      "pos": "noun",
      "explanation_en": "An official statement or announcement, especially one made by a person in authority or by the media, conveying news or an assessment.",
      "explanation_cn": "指由权威人士或媒体发布的正式声明或公告，用于传达新闻或评估结果。",
      "example_en": "The news report confirmed the president's resignation.",
      "example_cn": "新闻报道确认了总统的辞职。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provide information about an event, situation, or observation, especially to an authority or organization, often in a formal or official manner.",
      "explanation_cn": "指向权威机构或组织提供有关事件、情况或观察的信息，通常以正式或官方的方式进行。",
      "example_en": "Witnesses reported hearing a loud explosion near the station.",
      "example_cn": "目击者报告称在车站附近听到了一声巨响。"
    },
    {
      "pos": "verb",
      "explanation_en": "To appear in a specified place or to present oneself for official duty, especially in military or institutional contexts.",
      "explanation_cn": "指按规定地点报到或出席，尤其用于军事或机构场合，表示履行职责或接受检查。",
      "example_en": "All soldiers must report to the base by 0600 hours.",
      "example_cn": "所有士兵必须在早上6点前到基地报到。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "summary",
      "analysis": "“Summary”（摘要）是对长篇内容的简要概括，强调压缩信息、提炼要点，通常不包含原始数据或详细过程。而 “report” 是完整的陈述，包含背景、方法、数据、分析和结论，结构更完整、更正式。"
    },
    {
      "word_to_compare": "account",
      "analysis": "“Account”（叙述/说明）更侧重于个人对事件的描述，可能带有主观视角或情感色彩，常用于非正式语境。而 “report” 强调客观性、系统性和权威性，通常基于事实和证据，较少掺杂个人观点。"
    },
    {
      "word_to_compare": "announcement",
      "analysis": "“Announcement”（公告）是单向发布信息，目的是通知公众或特定群体，通常简短、直接，不包含分析或细节。而 “report” 是信息的系统性整理，常包含调查、数据和结论，具有解释和决策支持功能。"
    }
  ]
}