{
  "word": "repressed",
  "pronunciation": "rih·prest",
  "concise_definition": "adj. 被压抑的, 被压制的; v. 压抑（repress 的过去式和过去分词）",
  "forms": {
    "base_form": "repress",
    "third_person_singular": "represses",
    "past_tense": "repressed",
    "past_participle": "repressed",
    "present_participle": "repressing"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Suppressed or held back, especially emotions, desires, or thoughts that are considered socially unacceptable or psychologically uncomfortable, often leading to unconscious psychological effects.",
      "explanation_cn": "被抑制或压制的，尤指那些被视为社会不可接受或心理上令人不适的情感、欲望或想法，常导致潜意识的心理影响。",
      "example_en": "She had repressed memories of her childhood trauma that surfaced only in therapy.",
      "example_cn": "她对童年创伤的记忆被压抑了，直到接受治疗时才浮现出来。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by the suppression of expression, often resulting in a stern, unemotional, or overly controlled demeanor.",
      "explanation_cn": "以表达被压制为特征的，常表现为严肃、情感淡漠或过度克制的行为举止。",
      "example_en": "His repressed upbringing made him hesitant to express affection openly.",
      "example_cn": "他被压抑的成长环境使他不敢公开表达情感。"
    },
    {
      "pos": "verb",
      "explanation_en": "To forcibly suppress or restrain something, such as a feeling, thought, or social movement, often by authority or internalized norms.",
      "explanation_cn": "通过权威或内化规范强行压制或约束某种事物，如情感、思想或社会运动。",
      "example_en": "The government repressed dissent by censoring the press and arresting activists.",
      "example_cn": "政府通过审查媒体和逮捕活动人士来压制不同意见。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "suppressed",
      "analysis": "“Suppressed”（压制的）更广泛地指任何有意识地阻止或控制某事物的表达或发生，可以是外在的（如政府压制抗议）或内在的（如忍住不哭）。“Repressed” 更特指心理学意义上的无意识压抑，常涉及被遗忘或深埋的情感，具有长期心理影响。"
    },
    {
      "word_to_compare": "inhibited",
      "analysis": "“Inhibited”（受抑制的）强调因害羞、焦虑或社会规范而自我限制行为或表达，通常带有主观的犹豫或紧张感，不一定是被外部力量强制。“Repressed” 则暗示更深层、更被动的潜意识机制，个体甚至意识不到自己在压抑。"
    },
    {
      "word_to_compare": "constrained",
      "analysis": "“Constrained”（受限制的）侧重于外部条件或规则对行为、自由或发展的限制，如法律、物理环境或资源限制。它不涉及心理层面的内在冲突，而 “repressed” 强调的是内在心理动力与社会规范之间的张力。"
    }
  ]
}