{
  "word": "representation",
  "pronunciation": "rep·ruh·zen·tay·shun",
  "concise_definition": "n. 表示, 代表, 描绘, 代理",
  "forms": {
    "plural": "representations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of standing for or symbolizing something else, especially an idea, group, or person, often in a formal or official capacity.",
      "explanation_cn": "指以某种形式代表或象征另一事物，尤其是思想、群体或个人，通常具有正式或官方性质。",
      "example_en": "The artist's painting is a powerful representation of social injustice.",
      "example_cn": "这位艺术家的画作是对社会不公的有力表现。"
    },
    {
      "pos": "noun",
      "explanation_en": "The depiction or portrayal of something in art, literature, media, or other forms of expression, often reflecting cultural or ideological perspectives.",
      "explanation_cn": "指在艺术、文学、媒体或其他表达形式中对某事物的描绘或呈现，通常反映特定的文化或意识形态视角。",
      "example_en": "The film has been criticized for its poor representation of women in leadership roles.",
      "example_cn": "这部电影因对女性在领导岗位上的描绘不当而受到批评。"
    },
    {
      "pos": "noun",
      "explanation_en": "The action of acting on behalf of someone else, especially in legal, political, or business contexts.",
      "explanation_cn": "指在法律、政治或商业语境中代表他人行事的行为。",
      "example_en": "She hired a lawyer for legal representation during the trial.",
      "example_cn": "她在审判期间聘请了一名律师作为其法律代理人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A mathematical or symbolic expression that stands for a quantity, function, or system.",
      "explanation_cn": "指数学或符号系统中用于表示数量、函数或系统的表达方式。",
      "example_en": "The matrix is a compact representation of the linear transformation.",
      "example_cn": "这个矩阵是线性变换的一种紧凑表示形式。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "symbol",
      "analysis": "“Symbol” (符号) 是一种抽象的、约定俗成的标记，用于代表某种概念或事物，通常具有高度简化和非具体性（如心形代表爱）。而 “representation” 更广泛，可以是任何形式的呈现，包括图像、语言、行为等，强调的是‘再现’或‘替代’的功能，而非仅是象征。"
    },
    {
      "word_to_compare": "depiction",
      "analysis": "“Depiction” (描绘) 与 “representation” 在艺术或叙事语境中常可互换，但 “depiction” 更侧重于具体的、细节化的视觉或语言描述，常用于评价某事物被如何‘画出来’或‘写出来’。而 “representation” 更强调其背后的社会、政治或文化意义，具有更强的批判性维度。"
    },
    {
      "word_to_compare": "proxy",
      "analysis": "“Proxy” (代理人/代用品) 通常指一个具体的人或物被授权或替代另一个主体执行功能，如投票代理或代理服务器。它强调功能性替代，而 “representation” 更广泛，可包含象征、描绘、表达等多种形式，不一定涉及授权或物理替代。"
    }
  ]
}