{
  "word": "reproductive",
  "pronunciation": "ree·pruh·duk·tiv",
  "concise_definition": "adj. 生殖的, 繁殖的, 与繁殖有关的",
  "forms": {
    "comparative": "more reproductive",
    "superlative": "most reproductive"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to the biological process of producing offspring or the organs and systems involved in reproduction.",
      "explanation_cn": "与产生后代的生物过程，或参与繁殖的器官和系统相关的。",
      "example_en": "The reproductive system in humans includes the ovaries, uterus, and testes.",
      "example_cn": "人类的生殖系统包括卵巢、子宫和睾丸。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Capable of reproducing; describing organisms or processes that enable the continuation of a species through sexual or asexual means.",
      "explanation_cn": "具有繁殖能力的；描述能够通过有性或无性方式实现物种延续的生物或过程。",
      "example_en": "Only healthy, mature plants are considered reproductive and capable of producing seeds.",
      "example_cn": "只有健康成熟的植物才被视为具有繁殖能力，能够产生种子。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used in the context of social or economic systems that emphasize or depend on childbearing and family formation.",
      "explanation_cn": "用于指强调或依赖生育和家庭组建的社会或经济体系。",
      "example_en": "Some policies aim to support reproductive labor, such as childcare and domestic work, which are often unpaid.",
      "example_cn": "一些政策旨在支持生殖劳动，如育儿和家务劳动，这些工作通常无报酬。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fertile",
      "analysis": "“Fertile”（有生育力的）强调个体或土地具备产生后代或作物的能力，侧重于生理或土壤的“可育性”。而 “reproductive” 是更广泛的术语，涵盖整个繁殖系统、过程或功能，不仅限于能力，还包括结构和行为。"
    },
    {
      "word_to_compare": "procreative",
      "analysis": "“Procreative”（具有生育力的）是 “reproductive” 的近义词，但更正式，且几乎专指性行为导致生育的生物学功能，常用于哲学、宗教或法律语境。而 “reproductive” 更常用于科学、医学和日常语境，涵盖无性繁殖等更广范围。"
    },
    {
      "word_to_compare": "generative",
      "analysis": "“Generative”（生成的）含义更广，可指任何产生新事物的能力，如艺术创作、语言生成或技术创新，不一定涉及生物学繁殖。而 “reproductive” 严格限定于生物体的繁殖过程，语义范围更窄、更具体。"
    }
  ]
}