{
  "word": "representative",
  "pronunciation": "rep·ruh·zen·tuh·tiv",
  "concise_definition": "n. 代表, 代理人; adj. 有代表性的, 典型的",
  "forms": {
    "plural": "representatives",
    "comparative": "more representative",
    "superlative": "most representative"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who is authorized to act on behalf of another person, group, or organization, especially in official or formal contexts such as politics, business, or negotiations.",
      "explanation_cn": "指被授权代表他人、团体或组织行事的人，尤其在政治、商业或谈判等正式场合中。",
      "example_en": "The company sent a representative to attend the international trade fair.",
      "example_cn": "公司派了一名代表参加国际贸易博览会。"
    },
    {
      "pos": "noun",
      "explanation_en": "An elected official who speaks and acts for a constituency, especially in a legislative body such as a parliament or congress.",
      "explanation_cn": "指在议会或国会等立法机构中，代表选区发声和行动的民选官员。",
      "example_en": "She was elected as a representative to the U.S. House of Representatives.",
      "example_cn": "她当选为美国众议院的议员。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Typical or characteristic of a larger group or category; accurately reflecting the features, proportions, or qualities of the whole.",
      "explanation_cn": "指典型地反映某一更大群体或类别的特征、比例或性质，能准确代表整体。",
      "example_en": "This survey sample is representative of the entire population.",
      "example_cn": "这个调查样本具有整个群体的代表性。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Serving as a symbol or embodiment of something, often used to describe something that exemplifies a particular quality or trend.",
      "explanation_cn": "用作某事物的象征或体现，常用于描述体现某种特质或趋势的事物。",
      "example_en": "The film is a representative example of 1980s American cinema.",
      "example_cn": "这部电影是1980年代美国电影的典型代表。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "delegate",
      "analysis": "“Delegate” (代表/受托人) 强调被正式委派执行特定任务或投票的权力，通常具有临时性和任务导向性，如会议代表。而 “representative” 更强调持续性的身份和广泛代表性，如议员或公司常驻代表。"
    },
    {
      "word_to_compare": "sample",
      "analysis": "“Sample” (样本) 是从整体中抽取的一部分，用于推断整体特征，强调统计学上的代表性，但本身不是主动的“代理人”。而 “representative” 既可以是人，也可以是事物，强调其作为整体的象征或缩影，具有更广泛的文化或社会意义。"
    },
    {
      "word_to_compare": "typical",
      "analysis": "“Typical” (典型的) 是一个形容词，仅描述某事物符合某一类别的常见特征，不涉及“代理”或“代表”的行为功能。而 “representative” 不仅描述特征，还隐含了“作为整体的象征”这一功能，语义更丰富，可作名词使用。"
    }
  ]
}