{
  "word": "republican",
  "pronunciation": "ri·pub·li·kun",
  "concise_definition": "adj. 共和党的, 共和政体的; n. 共和党人, 共和主义者",
  "forms": {
    "plural": "republicans",
    "comparative": "more republican",
    "superlative": "most republican"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to a republic, a form of government in which power resides in the people and is exercised through elected representatives, rather than a monarchy or dictatorship.",
      "explanation_cn": "与共和政体相关的，指一种权力属于人民并通过选举产生的代表行使权力的政治体制，而非君主制或独裁制。",
      "example_en": "The United States is a constitutional republic, with a president elected by the people.",
      "example_cn": "美国是一个宪政共和国，总统由人民选举产生。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Of or relating to the Republican Party, one of the two major political parties in the United States, traditionally associated with conservative policies, lower taxes, and strong national defense.",
      "explanation_cn": "与美国共和党相关的，该党是美国两大主要政党之一，传统上与保守主义政策、低税收和强大的国防联系在一起。",
      "example_en": "The republican candidate won the election by appealing to rural voters.",
      "example_cn": "这位共和党候选人通过争取农村选民赢得了选举。"
    },
    {
      "pos": "noun",
      "explanation_en": "A member or supporter of the Republican Party in the United States.",
      "explanation_cn": "美国共和党的成员或支持者。",
      "example_en": "As a lifelong republican, he has always opposed expanding government welfare programs.",
      "example_cn": "作为一名终身共和党人，他一直反对扩大政府福利项目。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who supports a republican form of government, advocating for the absence of monarchy and the rule of law by elected officials.",
      "explanation_cn": "支持共和政体的人，主张废除君主制，由民选官员依法治国。",
      "example_en": "In the 18th century, many american revolutionaries were republicans who rejected British rule.",
      "example_cn": "18世纪，许多美国革命者是共和主义者，他们反对英国统治。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "democrat",
      "analysis": "“Democrat”（民主党人）是美国另一主要政党的成员，通常支持更积极的政府干预、社会福利、环境保护和多元文化政策，与共和党在经济与社会议题上立场相对。两者虽同属美国两党制，但意识形态和政策倾向截然不同。"
    },
    {
      "word_to_compare": "conservative",
      "analysis": "“Conservative”（保守主义者）是一个意识形态术语，强调传统价值观、有限政府和自由市场，常与共和党重叠，但并非所有保守主义者都是共和党人，也非所有共和党人都是严格意义上的保守派。而 “republican” 是一个政党身份标签，具有组织性和制度性。"
    },
    {
      "word_to_compare": "federalist",
      "analysis": "“Federalist”（联邦主义者）是18世纪美国建国初期支持强大中央政府的政治派别，与现代共和党无直接继承关系。虽然两者都强调国家统一，但联邦主义者主要关注宪法结构与权力分配，而现代共和党更侧重于意识形态和当代政策立场。"
    }
  ]
}