{
  "word": "rescue",
  "pronunciation": "rez·kyoo",
  "concise_definition": "v. 营救, 救援; n. 营救, 救援行动",
  "forms": {
    "third_person_singular": "rescues",
    "past_tense": "rescued",
    "past_participle": "rescued",
    "present_participle": "rescuing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To save someone or something from danger, harm, or destruction, often through urgent or heroic action.",
      "explanation_cn": "指通过紧急或英勇的行动将某人或某物从危险、伤害或毁灭中拯救出来。",
      "example_en": "Firefighters rescued the family from the burning building.",
      "example_cn": "消防员从着火的大楼中救出了这家人。"
    },
    {
      "pos": "verb",
      "explanation_en": "To free or recover something valuable that is at risk of being lost, forgotten, or destroyed, such as data, traditions, or artifacts.",
      "explanation_cn": "指将可能丢失、被遗忘或毁坏的宝贵事物（如数据、传统或文物）挽救或恢复出来。",
      "example_en": "Archaeologists worked to rescue ancient manuscripts before the flood destroyed them.",
      "example_cn": "考古学家们在洪水摧毁这些古籍前努力将它们抢救出来。"
    },
    {
      "pos": "noun",
      "explanation_en": "An act or instance of saving someone or something from danger or harm; often refers to a specific operation or mission.",
      "explanation_cn": "指拯救某人或某物脱离危险或伤害的行为或事件；常指一次具体的营救行动或任务。",
      "example_en": "The rescue of the trapped miners took three days and involved dozens of specialists.",
      "example_cn": "营救被困矿工的行动持续了三天，动用了数十名专家。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "save",
      "analysis": "“Save” (拯救) 是一个更广泛、更通用的词，可用于各种语境，如节省金钱、挽救生命、防止失败等。它不强调行动的紧迫性或危险性。而 “rescue” 更侧重于从直接的、严重的危险中进行主动干预，带有更强的紧急感和英雄主义色彩。"
    },
    {
      "word_to_compare": "retrieve",
      "analysis": "“Retrieve” (取回/找回) 通常指找回丢失的物品、信息或数据，强调的是恢复已失去的东西，但不一定涉及危险或生命威胁。例如“retrieve a file”或“retrieve a ball”。而 “rescue” 强调的是在危险或毁灭的边缘进行挽救，对象通常是人、生命或不可替代的珍贵事物。"
    },
    {
      "word_to_compare": "aid",
      "analysis": "“Aid” (援助) 指提供帮助、支持或资源，但不一定意味着从危险中拯救。它可以是长期的、非紧急的，如人道主义援助。而 “rescue” 是一种即时的、挽救生命的行动，具有明确的紧迫性和目的性。"
    }
  ]
}