{
  "word": "research",
  "pronunciation": "ri·surch",
  "concise_definition": "n. 研究, 调查; v. 研究, 调查",
  "forms": {
    "third_person_singular": "researches",
    "past_tense": "researched",
    "past_participle": "researched",
    "present_participle": "researching"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A systematic investigation or study aimed at discovering, interpreting, or revising facts, theories, or applications, often involving the collection and analysis of data.",
      "explanation_cn": "指为发现、解释或修正事实、理论或应用而进行的系统性调查或研究，通常涉及数据的收集与分析。",
      "example_en": "Her research on climate change has been published in several scientific journals.",
      "example_cn": "她关于气候变化的研究已发表在数份科学期刊上。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process of gathering information from various sources to understand a topic, solve a problem, or support a decision.",
      "explanation_cn": "指通过多种渠道收集信息，以理解某一主题、解决问题或支持决策的过程。",
      "example_en": "Before buying a car, I did extensive research on fuel efficiency and safety ratings.",
      "example_cn": "在买车之前，我广泛研究了燃油效率和安全评级。"
    },
    {
      "pos": "verb",
      "explanation_en": "To conduct a systematic inquiry or study to discover new knowledge or verify existing information.",
      "explanation_cn": "指进行系统性探究或研究，以发现新知识或验证现有信息。",
      "example_en": "Scientists are researching new treatments for Alzheimer’s disease.",
      "example_cn": "科学家们正在研究治疗阿尔茨海默病的新方法。"
    },
    {
      "pos": "verb",
      "explanation_en": "To gather information from books, articles, databases, or interviews in order to prepare for a project, paper, or decision.",
      "explanation_cn": "指通过查阅书籍、文章、数据库或访谈等方式收集信息，以准备项目、论文或决策。",
      "example_en": "I spent two weeks researching the history of the local museum before writing my report.",
      "example_cn": "我在撰写报告之前花了两周时间研究当地博物馆的历史。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "study",
      "analysis": "“Study” (学习/研究) 范围更广，可指任何形式的学习或阅读，不一定包含原创性探索或数据收集。而 “research” 强调系统性、目的性和创新性，通常产生新知识或验证假设。例如，学生读书是 study，但科学家设计实验验证理论是 research。"
    },
    {
      "word_to_compare": "investigation",
      "analysis": "“Investigation” (调查) 常用于查明事实、原因或责任，尤其在法律、犯罪或事故背景下，强调追溯和取证。而 “research” 更侧重于知识构建，常用于学术、科学或商业领域。例如，警方调查案件，学者研究社会趋势。"
    },
    {
      "word_to_compare": "inquiry",
      "analysis": "“Inquiry” (询问/探究) 是一个更宽泛的词，可指任何寻求信息的行为，从简单的提问到正式调查。它不一定需要系统方法或长期过程。而 “research” 是一种结构化、持续且严谨的 inquiry，通常有明确的方法论和目标。"
    }
  ]
}