{
  "word": "reserve",
  "pronunciation": "rih·zurv",
  "concise_definition": "n. 保留, 预订, 保留地; v. 保留, 预订, 保持",
  "forms": {
    "third_person_singular": "reserves",
    "past_tense": "reserved",
    "past_participle": "reserved",
    "present_participle": "reserving"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A supply or amount of something kept back for future use or for a specific purpose, often to ensure availability when needed.",
      "explanation_cn": "指为将来使用或特定目的而保留下来的一笔资源或数量，以确保在需要时能够获得。",
      "example_en": "The country has large reserves of natural gas to meet future energy demands.",
      "example_cn": "该国拥有大量天然气储备，以满足未来的能源需求。"
    },
    {
      "pos": "noun",
      "explanation_en": "A formal arrangement to book or secure a place, seat, or service in advance, especially in hospitality or transportation.",
      "explanation_cn": "指提前预订或确保某个位置、座位或服务的正式安排，常用于酒店、交通等领域。",
      "example_en": "I made a reservation for two at the restaurant for 7 p.m.",
      "example_cn": "我为晚上七点在餐厅预订了两个座位。"
    },
    {
      "pos": "noun",
      "explanation_en": "A tract of land set aside by a government for a specific group, especially Indigenous peoples, often with legal protections.",
      "explanation_cn": "指政府划拨出来供特定群体（尤其是原住民）使用的土地，通常享有法律保护。",
      "example_en": "The Native American tribe lives on a reservation in the southwestern United States.",
      "example_cn": "这个美洲原住民部落居住在美国西南部的一块保留地上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To keep something back for a specific person, time, or purpose, preventing it from being used by others.",
      "explanation_cn": "指将某物保留给特定的人、时间或用途，防止他人使用。",
      "example_en": "Please reserve this seat for my colleague; she’ll be joining us shortly.",
      "example_cn": "请为我的同事保留这个座位，她马上就会来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To formally book or arrange for a service, accommodation, or space in advance.",
      "explanation_cn": "指提前正式预订某项服务、住宿或空间。",
      "example_en": "We reserved a hotel room for our vacation next month.",
      "example_cn": "我们为下个月的假期预订了一间酒店房间。"
    },
    {
      "pos": "verb",
      "explanation_en": "To maintain or hold back a particular attitude, emotion, or behavior, often to appear formal or restrained.",
      "explanation_cn": "指保持某种态度、情绪或行为，通常是为了显得正式或克制。",
      "example_en": "She reserved her judgment until she had heard all the facts.",
      "example_cn": "她在听到所有事实之前一直保持谨慎，不轻易下结论。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "book",
      "analysis": "“Book” (预订) 通常用于日常语境中，指简单地安排座位、房间或服务，语气较随意；而 “reserve” 更正式，常用于书面或官方场合，且可涵盖更广的保留含义（如资源、态度），不仅限于服务预订。"
    },
    {
      "word_to_compare": "stockpile",
      "analysis": "“Stockpile” (囤积) 强调大量积累物资以备不时之需，常用于战争、灾难或经济场景，带有囤积居奇的负面色彩；而 “reserve” 更中性，强调有计划地保留适量资源，常用于国家能源、资金等合法合规的储备。"
    },
    {
      "word_to_compare": "retain",
      "analysis": "“Retain” (保留) 指持续拥有或保持某物（如记忆、员工、律师），强调不失去；而 “reserve” 更强调主动地将某物留出、不立即使用，常带有时间或用途上的预设。例如：retain a lawyer（聘请律师） vs. reserve a table（预留座位）。"
    }
  ]
}