{
  "word": "reserves",
  "pronunciation": "rih·zervs",
  "concise_definition": "n. 储备, 储藏, 保留, 保留地",
  "forms": {
    "singular": "reserve"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A supply of something kept for future use, especially when it is needed in times of shortage or emergency.",
      "explanation_cn": "指为未来使用而保存的某种物资或资源，尤其在短缺或紧急情况下需要动用时。",
      "example_en": "The country has built up large oil reserves to ensure energy security.",
      "example_cn": "该国建立了大量的石油储备以确保能源安全。"
    },
    {
      "pos": "noun",
      "explanation_en": "A feeling or attitude of restraint or hesitation, especially in expressing emotions or opinions.",
      "explanation_cn": "指在表达情感或观点时表现出的克制、保留或犹豫态度。",
      "example_en": "She showed considerable reserve when discussing her personal life.",
      "example_cn": "她在谈论个人生活时表现得相当克制。"
    },
    {
      "pos": "noun",
      "explanation_en": "A tract of land set aside by a government for a specific purpose, especially for indigenous peoples or wildlife conservation.",
      "explanation_cn": "指政府划出用于特定目的的土地，尤其用于原住民居住或野生动物保护。",
      "example_en": "The national park is located within the wildlife reserve.",
      "example_cn": "这个国家公园位于野生动物保护区之内。"
    },
    {
      "pos": "noun",
      "explanation_en": "In sports, a player who is not in the starting lineup but is available to play during the game.",
      "explanation_cn": "在体育运动中，指未被列入首发阵容但可在比赛中上场的替补队员。",
      "example_en": "The coach brought on a reserve midfielder in the 70th minute.",
      "example_cn": "教练在第70分钟换上了替补中场。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "stock",
      "analysis": "“Stock”（库存）通常指商业或生产中为销售或使用而持有的商品或原材料，强调可流通性和商业用途；而 “reserves” 更强调战略性保存，常用于自然资源、能源或紧急情况下的长期储备，具有更强的防御性和计划性。"
    },
    {
      "word_to_compare": "savings",
      "analysis": "“Savings”（储蓄）特指金钱或财务上的积累，通常用于个人或家庭的未来支出；而 “reserves” 可用于物质、人力、情感等多方面，范围更广，且常用于机构、国家或系统层面，不局限于财务。"
    },
    {
      "word_to_compare": "preserve",
      "analysis": "“Preserve”（保护/保存）作为名词时多指通过特殊方法保存食物（如果酱），或作为动词表示保护自然环境；而 “reserve” 作为名词时更强调划定区域或保留资源以备后用，具有制度性或行政性含义，如保护区、保留地。"
    },
    {
      "word_to_compare": "backup",
      "analysis": "“Backup”（备份）多用于技术或数据领域，指为防止主系统失效而准备的替代方案；而 “reserves” 更广泛，可指人力、物资、能量等实体资源，且不一定以‘替代’为目的，而是为‘未来需求’而长期持有。"
    }
  ]
}