{
  "word": "resisting",
  "pronunciation": "ri·zis·ting",
  "concise_definition": "v. 抵抗, 抗拒, 反对 (resist 的现在分词和动名词形式)",
  "forms": {
    "base_form": "resist",
    "third_person_singular": "resists",
    "past_tense": "resisted",
    "past_participle": "resisted",
    "gerund": "resisting"
  },
  "definitions": [
    {
      "pos": "verb (gerund/participle)",
      "explanation_en": "The act of opposing or refusing to comply with something, whether it be pressure, influence, authority, or a physical force, often through active effort or determination.",
      "explanation_cn": "指通过主动努力或坚定意志反对或拒绝服从某种压力、影响、权威或物理力量的行为。",
      "example_en": "She was resisting the urge to scream in fear.",
      "example_cn": "她正努力克制住因恐惧而尖叫的冲动。"
    },
    {
      "pos": "verb (gerund/participle)",
      "explanation_en": "To withstand or hold out against an external force, change, or influence, especially when it is persistent or overwhelming.",
      "explanation_cn": "指抵御或坚持对抗某种持续或压倒性的外部力量、变化或影响。",
      "example_en": "The community has been resisting the government's plan to build a highway through the park.",
      "example_cn": "这个社区一直抵制政府在公园修建高速公路的计划。"
    },
    {
      "pos": "verb (gerund/participle)",
      "explanation_en": "In medicine or biology, to show a lack of susceptibility to a drug, pathogen, or treatment, often due to adaptation or mutation.",
      "explanation_cn": "在医学或生物学中，指对药物、病原体或治疗方法缺乏敏感性，通常由于适应或突变所致。",
      "example_en": "The bacteria are becoming increasingly resistant to antibiotics.",
      "example_cn": "这些细菌对抗生素的抵抗力正变得越来越强。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "opposing",
      "analysis": "“Opposing” (反对) 更侧重于立场或观点上的对抗，常用于政治、辩论或意识形态领域，强调的是态度上的不认同。而 “resisting” 更强调实际的行动或努力去阻止、抵挡某种力量或变化，具有更强的动态性和物理/心理上的对抗性。"
    },
    {
      "word_to_compare": "fighting",
      "analysis": "“Fighting” (斗争/战斗) 通常暗示更激烈、更具攻击性的对抗，可能涉及暴力或强烈情绪。而 “resisting” 可以是被动的、防御性的，甚至无声的，如抵制诱惑或拒绝服从，不一定包含主动攻击。"
    },
    {
      "word_to_compare": "rejecting",
      "analysis": "“Rejecting” (拒绝) 是一种一次性或决定性的行为，通常表示彻底否定或不接受某事物。而 “resisting” 是一个持续的过程，可能包含反复的挣扎或努力，即使最终未能成功，过程本身仍构成抵抗。"
    }
  ]
}