{
  "word": "resilient",
  "pronunciation": "ri·zil·yənt",
  "concise_definition": "adj. 有韧性的, 有弹性的, 适应力强的",
  "forms": {
    "comparative": "more resilient",
    "superlative": "most resilient"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Able to recover quickly from difficulties, setbacks, or adversity; possessing the capacity to bounce back and maintain functionality under stress or pressure.",
      "explanation_cn": "能够从困难、挫折或逆境中迅速恢复，具备在压力或逆境中保持功能并反弹的能力。",
      "example_en": "Despite losing her job, she remained resilient and started her own business within months.",
      "example_cn": "尽管失去了工作，她依然坚韧不拔，并在几个月内创办了自己的企业。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Capable of returning to its original shape or position after being stretched, compressed, or deformed; physically elastic or springy.",
      "explanation_cn": "在被拉伸、压缩或变形后，能够恢复原状或原位的；具有物理上的弹性或回弹特性。",
      "example_en": "The resilient rubber band snapped back to its original length after being stretched.",
      "example_cn": "这个有弹性的橡皮筋在拉伸后恢复了原来的长度。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing systems, communities, or ecosystems that can absorb shocks and adapt to change without collapsing or losing core functions.",
      "explanation_cn": "形容系统、社区或生态系统能够承受冲击并适应变化，而不会崩溃或丧失核心功能。",
      "example_en": "Coastal communities are working to become more resilient to rising sea levels and extreme weather.",
      "example_cn": "沿海社区正在努力增强应对海平面上升和极端天气的适应能力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "strong",
      "analysis": "“Strong”（强壮的）强调力量、体力或结构上的坚固，通常指抵抗外力而不被破坏。而 “resilient” 更侧重于在遭受破坏或压力后恢复的能力，强调的是恢复力而非单纯的抗压能力。一个物体可以很坚固但不具弹性，而一个 resilient 的系统即使受损也能重建。"
    },
    {
      "word_to_compare": "tough",
      "analysis": "“Tough”（坚韧的）常指能忍受艰苦、痛苦或困难，带有吃苦耐劳的意味，但不一定包含恢复或反弹的含义。例如，一个 tough 人可能默默承受压力，但未必能迅速恢复；而 resilient 人则不仅承受，还能从中恢复并成长。"
    },
    {
      "word_to_compare": "flexible",
      "analysis": "“Flexible”（灵活的）强调适应变化、调整方式或态度的能力，常用于行为或思维层面。而 “resilient” 更侧重于在遭遇打击后维持或重建稳定状态的能力，包含情感、心理或物理层面的恢复力。一个灵活的人可能改变策略，但一个 resilient 的人即使策略失败也能重新站起来。"
    }
  ]
}