{
  "word": "resin",
  "pronunciation": "rez·in",
  "concise_definition": "n. 树脂, 松脂, 合成树脂",
  "forms": {
    "plural": "resins"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sticky, viscous substance secreted by certain trees and plants, especially conifers, which hardens when exposed to air and is often used in varnishes, adhesives, and incense.",
      "explanation_cn": "指某些树木和植物（尤其是针叶树）分泌的黏稠物质，暴露在空气中会硬化，常用于清漆、胶黏剂和香料中。",
      "example_en": "Pine trees produce a clear, amber-colored resin that has been used for centuries in traditional medicine.",
      "example_cn": "松树分泌出清澈的琥珀色树脂，几个世纪以来一直被用于传统医学。"
    },
    {
      "pos": "noun",
      "explanation_en": "A synthetic or semi-synthetic polymer material that is used as a base for plastics, coatings, and composite materials, often cured with heat or chemicals.",
      "explanation_cn": "指一种人工或半人工的聚合物材料，用作塑料、涂料和复合材料的基础，通常通过加热或化学方法固化。",
      "example_en": "Epoxy resin is widely used in industrial applications for its strength and durability.",
      "example_cn": "环氧树脂因其强度和耐久性而被广泛用于工业应用中。"
    },
    {
      "pos": "noun",
      "explanation_en": "A substance used in jewelry and art to encapsulate objects, create transparent effects, or simulate precious stones.",
      "explanation_cn": "指用于珠宝和艺术中，以封装物体、制造透明效果或模拟宝石的材料。",
      "example_en": "The artist embedded dried flowers in clear resin to create a lasting, glass-like memorial.",
      "example_cn": "这位艺术家将干花嵌入透明树脂中，制作出持久如玻璃般的纪念品。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "latex",
      "analysis": "“Latex”（乳胶）是一种天然或合成的胶状液体，主要来源于橡胶树，具有弹性，常用于制造手套、气球和橡胶制品。而 “resin” 更坚硬、更易固化，通常用于形成固体结构或涂层，不具备乳胶那样的延展性和柔韧性。"
    },
    {
      "word_to_compare": "plastic",
      "analysis": "“Plastic”（塑料）是一个广义术语，泛指所有合成高分子材料，而 “resin” 是塑料的原材料或基础形态。树脂在未固化前是粘稠液体或粉末，经过加工后才成为塑料制品。因此，树脂是塑料的前体，而非成品。"
    },
    {
      "word_to_compare": "sap",
      "analysis": "“Sap”（树液）是植物体内流动的液体，主要功能是输送水分和养分，通常是清澈或淡黄色的，如枫树汁。而 “resin” 是植物为防御昆虫或真菌而分泌的粘稠物质，颜色更深、更粘稠，且会硬化。两者来源相同，但功能和物理性质截然不同。"
    }
  ]
}