{
  "word": "resilience",
  "pronunciation": "rih·zil·yuhns",
  "concise_definition": "n. 韧性, 恢复力, 适应力",
  "forms": {
    "plural": "resiliences"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The ability to recover quickly from difficulties, adversity, or shock; the capacity to adapt and bounce back after experiencing stress, trauma, or change.",
      "explanation_cn": "指从困难、逆境或打击中迅速恢复的能力；在经历压力、创伤或变化后适应并重新振作的特质。",
      "example_en": "Her resilience after losing her job helped her start a successful business.",
      "example_cn": "她在失业后展现出的韧性帮助她创办了一家成功的企业。"
    },
    {
      "pos": "noun",
      "explanation_en": "In materials science or engineering, the ability of a substance to absorb energy when deformed elastically and release that energy upon unloading, returning to its original shape.",
      "explanation_cn": "在材料科学或工程学中，指一种物质在弹性变形时吸收能量，并在卸载后释放能量、恢复原状的能力。",
      "example_en": "The resilience of the rubber allows it to withstand repeated compression without permanent deformation.",
      "example_cn": "橡胶的韧性使其在反复压缩后仍能恢复原状，不会发生永久变形。"
    },
    {
      "pos": "noun",
      "explanation_en": "In ecology, the capacity of an ecosystem to withstand disturbances and return to its original state or reorganize into a new stable state.",
      "explanation_cn": "在生态学中，指生态系统抵御干扰并恢复到原有状态或重组为新的稳定状态的能力。",
      "example_en": "The resilience of coral reefs depends on biodiversity and water quality.",
      "example_cn": "珊瑚礁的恢复力取决于生物多样性和水质。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "endurance",
      "analysis": "“Endurance”（耐力）强调在持续压力或困难中坚持不倒的能力，侧重于持久性和忍耐力，如长跑运动员的体能耐力。而 “resilience” 更强调在遭受打击后的反弹和恢复能力，是动态的恢复过程，而非静态的坚持。"
    },
    {
      "word_to_compare": "flexibility",
      "analysis": "“Flexibility”（灵活性）指适应变化或调整方式的能力，常用于心理、组织或物理结构的可塑性。它关注的是“改变以适应”的过程，而 “resilience” 更关注“经历冲击后恢复原状或重建”的结果。灵活性是韧性的一种手段，但不是全部。"
    },
    {
      "word_to_compare": "sturdiness",
      "analysis": "“Sturdiness”（坚固性）指物理结构的坚固和不易损坏，强调抗压和抗破坏的刚性特质。它是一种被动的防御能力，而 “resilience” 是一种主动的恢复机制，即使被破坏也能自我修复，更强调动态的再生能力。"
    }
  ]
}