{
  "word": "residency",
  "pronunciation": "rez·id·uhn·see",
  "concise_definition": "n. 居住, 居留, 住院医师培训, 艺术家驻留项目",
  "forms": {
    "plural": "residencies"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The state or period of living in a particular place, especially as a legal or official requirement; often used in the context of immigration, housing, or institutional affiliation.",
      "explanation_cn": "指在某一特定地点居住的状态或时期，通常作为法律或官方要求，常用于移民、住房或机构隶属关系的语境中。",
      "example_en": "She completed her residency in New York before moving to California.",
      "example_cn": "她在搬到加利福尼亚之前，在纽约完成了居留期。"
    },
    {
      "pos": "noun",
      "explanation_en": "A period of supervised clinical training that medical graduates undergo in a hospital to become licensed specialists, typically lasting three to seven years.",
      "explanation_cn": "指医学毕业生在医院接受的受监督的临床培训阶段，以成为持证专科医生，通常持续三至七年。",
      "example_en": "After medical school, he entered a five-year residency in neurology.",
      "example_cn": "医学院毕业后，他进入了一个五年的神经内科住院医师培训。"
    },
    {
      "pos": "noun",
      "explanation_en": "A program that invites artists, writers, or scholars to live and work in a dedicated environment for a set period to foster creativity and collaboration.",
      "explanation_cn": "指为艺术家、作家或学者提供一段时间的专属环境，使其居住并开展创作，以促进创造力与合作的项目。",
      "example_en": "The artist was selected for a three-month residency at the international arts center.",
      "example_cn": "这位艺术家被选中参加国际艺术中心为期三个月的驻留项目。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "residence",
      "analysis": "“Residence”（住所/居所）强调物理上的居住地点或固定住址，是一个中性、客观的名词，常用于法律或行政文件中，如“primary residence”。而 “residency” 更侧重于居住的“状态”或“期间”，尤其在专业或制度性语境中（如医疗培训、艺术项目），具有更强的程序性和时间性。"
    },
    {
      "word_to_compare": "stay",
      "analysis": "“Stay”（逗留）是一个非正式、临时性的词汇，通常指短期的停留，如旅游或出差。它不带有制度性、法律性或专业训练的含义。而 “residency” 通常意味着较长的、有组织的、有明确目标的居住安排，如住院医师培训或艺术家驻留。"
    },
    {
      "word_to_compare": "internship",
      "analysis": "“Internship”（实习）通常指学生或初学者在专业领域中获得实践经验的短期项目，多见于商业、科技或非临床领域。而 “residency” 在医学语境中特指完成学位后的高级临床培训，具有更强的权威性、强制性和专业认证意义。在艺术领域，residency 也比 internship 更强调创作自由与沉浸式体验。"
    }
  ]
}