{
  "word": "resonance",
  "pronunciation": "rez·uh·nuhns",
  "concise_definition": "n. 共振, 回响, 共鸣",
  "forms": {
    "plural": "resonances"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The physical phenomenon in which an object or system vibrates at a greater amplitude when subjected to an external force or frequency that matches its natural frequency.",
      "explanation_cn": "指当一个物体或系统受到与其固有频率相同的外力作用时，产生振幅显著增大的物理现象。",
      "example_en": "The bridge collapsed due to resonance caused by soldiers marching in step.",
      "example_cn": "由于士兵齐步走引发的共振，这座桥坍塌了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A deep, continuing emotional or intellectual response that echoes with personal or cultural significance, often evoking strong feelings or recognition.",
      "explanation_cn": "指某种思想、艺术或言论引发的深刻而持久的情感或理智共鸣，通常因其与个人或文化经验的契合而激起强烈认同或情感反应。",
      "example_en": "Her speech about justice had resonance with millions who had experienced inequality.",
      "example_cn": "她关于正义的演讲引发了数百万曾经历不公者的强烈共鸣。"
    },
    {
      "pos": "noun",
      "explanation_en": "The quality of a sound that is rich, deep, and sustained, often due to the amplification of harmonics in a space or instrument.",
      "explanation_cn": "指声音因空间或乐器中谐波的放大而产生的丰富、深沉且持久的特质。",
      "example_en": "The cathedral's architecture gave the choir's voices a remarkable resonance.",
      "example_cn": "大教堂的建筑结构使合唱团的声音具有非凡的共鸣效果。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "echo",
      "analysis": "“Echo” (回声) 指声音反射后重复出现的物理现象，或比喻性地指对某事的简单重复，通常缺乏深度或情感转化。而 “resonance” 不仅指声音的延续，更强调内在的、持久的、有情感或思想深度的回响，常用于抽象层面。"
    },
    {
      "word_to_compare": "synergy",
      "analysis": "“Synergy” (协同效应) 指多个部分相互作用后产生的整体效果大于各部分之和，强调合作与功能增强。而 “resonance” 不涉及功能叠加，而是强调一种内在的契合、共鸣或情感上的呼应，常用于艺术、文化或心理层面。"
    },
    {
      "word_to_compare": "vibration",
      "analysis": "“Vibration” (振动) 是物理上物体周期性往复运动的客观状态，是共振发生的前提，但本身不包含放大或情感意义。而 “resonance” 是振动在特定频率下被放大后的结果，常带有象征性、情绪性或文化性的延伸含义。"
    }
  ]
}