{
  "word": "resolution",
  "pronunciation": "rez·uh·loo·shuhn",
  "concise_definition": "n. 决心, 决议, 解决, 分辨率",
  "forms": {
    "plural": "resolutions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A firm decision to do or not to do something, often made at the beginning of a new year or after reflection on personal behavior.",
      "explanation_cn": "指一种坚定的决定，决定要做或不做某事，通常在新年伊始或经过自我反思后作出。",
      "example_en": "She made a New Year's resolution to exercise every day.",
      "example_cn": "她立下新年决心，每天锻炼。"
    },
    {
      "pos": "noun",
      "explanation_en": "An official decision or statement adopted by a group, such as a committee, organization, or government body, often after debate or voting.",
      "explanation_cn": "指由团体（如委员会、组织或政府机构）经过讨论或投票后正式通过的决定或声明。",
      "example_en": "The United Nations passed a resolution calling for an immediate ceasefire.",
      "example_cn": "联合国通过了一项呼吁立即停火的决议。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of solving a problem, conflict, or dispute by finding a satisfactory outcome or agreement.",
      "explanation_cn": "指通过找到令人满意的解决方案或协议来解决一个问题、冲突或争端的行为。",
      "example_en": "The resolution of the labor dispute took months of negotiation.",
      "example_cn": "这场劳资纠纷的解决花了数月的谈判。"
    },
    {
      "pos": "noun",
      "explanation_en": "The degree of detail visible in an image, especially on a screen or in a photograph, measured in pixels per inch or lines of vertical resolution.",
      "explanation_cn": "指图像中的细节清晰程度，尤其在屏幕或照片中，通常以每英寸像素数或垂直分辨率线数衡量。",
      "example_en": "This 4K monitor has a resolution of 3840 x 2160 pixels.",
      "example_cn": "这台4K显示器的分辨率为3840 x 2160像素。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "determination",
      "analysis": "“Determination”（决心）强调一种持续不懈的意志力和内在驱动力，通常用于描述一个人面对困难时的坚持态度。而 “resolution” 更侧重于一个明确的、有时是仪式性的决定，尤其在新年或特定时刻作出，可能缺乏持续执行的强度。"
    },
    {
      "word_to_compare": "decision",
      "analysis": "“Decision”（决定）是一个中性词，泛指在两个或多个选项中做出选择，不带有情感或承诺的色彩。而 “resolution” 通常隐含更强的承诺感和道德或个人层面的严肃性，尤其在涉及自我改进或集体行动时。"
    },
    {
      "word_to_compare": "solution",
      "analysis": "“Solution”（解决方案）专指针对问题或难题的应对方法或答案，强调功能性与有效性。而 “resolution” 在此语境下不仅指解决方案本身，还包含达成该方案的过程、协议或正式通过的程序，常用于正式或法律语境。"
    },
    {
      "word_to_compare": "clarity",
      "analysis": "“Clarity”（清晰度）是视觉或思维上的明确性，而 “resolution” 在图像技术语境中是其可量化的技术指标。例如，高分辨率带来高清晰度，但高清晰度不一定来自高分辨率（如通过算法增强）。因此，resolution 是客观参数，clarity 是主观感知。"
    }
  ]
}