{
  "word": "resolved",
  "pronunciation": "rih·zolv·d",
  "concise_definition": "adj. 坚决的, 决心的; v. 解决, 决定, 断定",
  "forms": {
    "base_form": "resolve",
    "third_person_singular": "resolves",
    "past_tense": "resolved",
    "past_participle": "resolved",
    "present_participle": "resolving",
    "noun_form": "resolution"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To find a solution to a problem, conflict, or difficult situation through careful thought or action.",
      "explanation_cn": "指通过深思熟虑或采取行动，为问题、冲突或困难局面找到解决方案。",
      "example_en": "After months of negotiations, the two countries resolved their border dispute.",
      "example_cn": "经过数月的谈判，两国解决了它们的边界争端。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a firm decision or commitment to do something, often with determination or determination to change.",
      "explanation_cn": "指坚定地做出决定或承诺去做某事，通常带有改变现状的决心。",
      "example_en": "She resolved to quit smoking after her doctor's warning.",
      "example_cn": "在医生警告后，她下定决心戒烟。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Showing firm determination or decisiveness, especially in the face of difficulty or opposition.",
      "explanation_cn": "指在面对困难或反对时表现出坚定的决心或果断的态度。",
      "example_en": "He gave a resolved look and stepped forward to accept the challenge.",
      "example_cn": "他露出坚定的表情，上前接受了挑战。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "solve",
      "analysis": "“Solve” (解决) 通常用于逻辑性、数学性或技术性问题，强调找到正确答案或方法，如解方程、破解密码。而 “resolve” 更广泛，可用于人际冲突、情感困境或抽象问题，不仅指找到答案，还包含达成共识或平息矛盾的过程。"
    },
    {
      "word_to_compare": "decide",
      "analysis": "“Decide” (决定) 侧重于在多个选项中做出选择，是一个瞬间行为；而 “resolve” 不仅包含决定，还隐含了坚持执行该决定的意志力，常带有情感或道德上的坚定性。例如：I decided to go to bed early. vs. I resolved to change my lifestyle. 后者更强调持久的决心。"
    },
    {
      "word_to_compare": "settle",
      "analysis": "“Settle” (解决/平息) 常用于结束争端、纠纷或争议，强调达成妥协或让双方接受结果，有时带有“勉强接受”的意味。而 “resolve” 更强调通过理性或努力彻底解决问题，结果更彻底、更积极。例如：They settled the argument with a compromise. vs. They resolved the conflict through dialogue. 后者暗示更深层次的修复。"
    }
  ]
}