{
  "word": "resorts",
  "pronunciation": "ri·zawrts",
  "concise_definition": "n. 度假胜地, 避暑胜地; v. 依靠, 诉诸 (复数形式为 resorts，单数为 resort)",
  "forms": {
    "singular": "resort",
    "third_person_singular": "resorts",
    "past_tense": "resorted",
    "past_participle": "resorted",
    "present_participle": "resorting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A place, typically one with hotels, entertainment, and recreational facilities, that is popular with tourists seeking relaxation or leisure activities, especially during holidays.",
      "explanation_cn": "指通常配备酒店、娱乐设施和休闲活动场所，深受游客欢迎的度假地点，尤其在假期期间用于放松和消遣。",
      "example_en": "The Maldives is a tropical resort known for its white-sand beaches and crystal-clear waters.",
      "example_cn": "马尔代夫是一个以白色沙滩和清澈海水闻名的热带度假胜地。"
    },
    {
      "pos": "noun",
      "explanation_en": "A place where people gather for a specific purpose, such as a health spa or a gambling center, often associated with luxury and exclusivity.",
      "explanation_cn": "指人们为特定目的（如疗养、赌博）聚集的场所，常与奢华和排他性相关联。",
      "example_en": "Las Vegas is a famous resort for gambling and nightlife.",
      "example_cn": "拉斯维加斯是著名的赌博和夜生活度假胜地。"
    },
    {
      "pos": "verb",
      "explanation_en": "To turn to someone or something for help, support, or a solution, especially when other options are limited or exhausted.",
      "explanation_cn": "指在其他选择有限或耗尽时，转向某人或某物寻求帮助、支持或解决方案。",
      "example_en": "When negotiations failed, the government resorted to military action.",
      "example_cn": "当谈判失败后，政府诉诸军事行动。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "destination",
      "analysis": "“Destination” (目的地) 是一个更广泛的概念，泛指任何旅行者前往的地方，可以是城市、景点或国家，不一定是为休闲度假而设。而 “resort” 特指提供休闲、娱乐和住宿服务的度假型目的地，强调功能性和服务配套。"
    },
    {
      "word_to_compare": "haven",
      "analysis": "“Haven” (避风港) 强调安全、宁静和庇护的特性，常用于比喻意义，如心灵的避难所。而 “resort” 更侧重于商业化的休闲场所，虽也可能提供放松，但其本质是消费导向的旅游设施，而非情感上的庇护。"
    },
    {
      "word_to_compare": "option",
      "analysis": "“Option” (选择) 是一个抽象名词，指可供选择的可能性。当 “resort” 作动词时，如 “resort to”，意为“诉诸”，它表示在别无选择时采取某种手段，此时它隐含一种无奈或最后的手段，而 “option” 则是中性的、主动的选择项，不带情感色彩。"
    }
  ]
}