{
  "word": "respect",
  "pronunciation": "rih·spekt",
  "concise_definition": "n. 尊重, 敬意; v. 尊重, 重视",
  "forms": {
    "third_person_singular": "respects",
    "past_tense": "respected",
    "past_participle": "respected",
    "present_participle": "respecting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A feeling of deep admiration for someone or something due to their abilities, qualities, or achievements; also refers to polite regard for the feelings, wishes, or rights of others.",
      "explanation_cn": "因某人或某物的能力、品质或成就而产生的深切钦佩之情；也指对他人的感受、愿望或权利的礼貌尊重。",
      "example_en": "She earned the respect of her colleagues through years of hard work and integrity.",
      "example_cn": "她通过多年的辛勤工作和正直品格赢得了同事们的尊重。"
    },
    {
      "pos": "noun",
      "explanation_en": "A particular aspect or detail of something that is worthy of consideration or attention.",
      "explanation_cn": "指某事物中值得考虑或关注的特定方面或细节。",
      "example_en": "In many respects, this new policy is an improvement over the old one.",
      "example_cn": "在许多方面，这项新政策比旧政策有所改进。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hold someone or something in high regard; to treat someone with consideration and courtesy.",
      "explanation_cn": "对某人或某物抱有高度评价；以体贴和礼貌的方式对待他人。",
      "example_en": "We must respect the opinions of others, even if we disagree with them.",
      "example_cn": "即使我们不同意他人的观点，也必须尊重他们的意见。"
    },
    {
      "pos": "verb",
      "explanation_en": "To comply with or observe rules, boundaries, or agreements; to acknowledge the validity or authority of something.",
      "explanation_cn": "遵守规则、界限或协议；承认某事物的有效性或权威性。",
      "example_en": "Drivers must respect the speed limit to ensure road safety.",
      "example_cn": "司机必须遵守限速规定以确保道路安全。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "admire",
      "analysis": "“Admire” (钦佩) 强调因某人的才华、成就或品质而产生的积极情感，通常带有情感上的仰慕，但不一定包含行为上的服从或礼遇。而 “respect” 更强调理性层面的认可，可能不带强烈情感，但要求外在行为上的尊重，如遵守规则或礼貌对待。"
    },
    {
      "word_to_compare": "honor",
      "analysis": "“Honor” (尊敬/荣誉) 比 “respect” 更正式、更庄重，常用于道德、法律或传统语境中，如尊重长辈、遵守誓言。它常与仪式、地位或义务相关，而 “respect” 更广泛，适用于日常人际互动和抽象原则。"
    },
    {
      "word_to_compare": "value",
      "analysis": "“Value” (重视) 指认为某事物有重要性或有用性，侧重于功利性或主观评价，如‘我重视时间’。而 ‘respect’ 更强调对人格、权利或规范的承认，具有道德和社交维度，不完全等同于‘有用’或‘重要’。"
    }
  ]
}