{
  "word": "rests",
  "pronunciation": "rests",
  "concise_definition": "v. 休息, 停止活动; n. 休息, 剩余部分, 支撑物",
  "forms": {
    "base_form": "rest",
    "third_person_singular": "rests",
    "past_tense": "rested",
    "past_participle": "rested",
    "present_participle": "resting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To cease activity or movement in order to recover energy or find relief from exertion or stress.",
      "explanation_cn": "停止活动或运动，以恢复体力或从劳累或压力中获得放松。",
      "example_en": "After a long day of work, she likes to rest on the couch with a book.",
      "example_cn": "漫长的一天工作后，她喜欢靠在沙发上读书休息。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be supported or placed in a particular position, often implying stability or calmness.",
      "explanation_cn": "被支撑或置于某种位置，常暗示稳定或宁静的状态。",
      "example_en": "The vase rests on the marble table.",
      "example_cn": "花瓶放在大理石桌上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A period of inactivity or sleep intended to restore energy or reduce fatigue.",
      "explanation_cn": "为恢复体力或减轻疲劳而进行的休息或睡眠时段。",
      "example_en": "He took a short rest after the hike and felt refreshed.",
      "example_cn": "徒步后他小憩了一会儿，感觉神清气爽。"
    },
    {
      "pos": "noun",
      "explanation_en": "The remaining part of something after a portion has been used, taken, or removed.",
      "explanation_cn": "在一部分被使用、取走或移除后剩下的部分。",
      "example_en": "The rest of the cake was saved for tomorrow.",
      "example_cn": "剩下的蛋糕留到明天吃。"
    },
    {
      "pos": "noun",
      "explanation_en": "A support or base, especially in art or architecture, that holds an object in place.",
      "explanation_cn": "一种支撑物或底座，尤其在艺术或建筑中用于固定物体。",
      "example_en": "The statue has a bronze rest that elevates it slightly above the ground.",
      "example_cn": "这座雕像有一个青铜底座，使其略微高于地面。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "relax",
      "analysis": "“Relax” (放松) 更强调心理或肌肉的松弛状态，常用于减轻紧张、焦虑或压力，侧重主观感受。而 “rest” 更侧重于身体活动的停止，可能是为了恢复体力，不一定伴随心理放松。"
    },
    {
      "word_to_compare": "pause",
      "analysis": "“Pause” (暂停) 指短暂、临时的中断，通常为继续做某事做准备，时间较短且具有计划性。而 “rest” 通常持续时间更长，目的是恢复精力，不一定有立即恢复活动的意图。"
    },
    {
      "word_to_compare": "remainder",
      "analysis": "“Remainder” (剩余部分) 是一个更正式、更精确的术语，常用于数学、法律或商业语境中，指扣除后的全部剩余。而 “rest” 作为名词表示剩余部分时更口语化、泛用，适用于日常语境，如食物、时间或物品的剩余。"
    }
  ]
}