{
  "word": "restoration",
  "pronunciation": "res·tuh·ray·shun",
  "concise_definition": "n. 恢复, 修复, 复原",
  "forms": {
    "plural": "restorations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of returning something to its original condition, especially after damage, decay, or neglect; often applied to buildings, artworks, or historical artifacts.",
      "explanation_cn": "指将某物恢复到其原始状态的行为，尤其在遭受损坏、腐朽或忽视之后；常用于建筑物、艺术品或历史文物的修复。",
      "example_en": "The restoration of the ancient cathedral took over a decade and involved hundreds of skilled artisans.",
      "example_cn": "这座古老大教堂的修复工作历时十余年，涉及数百名技艺精湛的工匠。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of bringing back a previous state, system, or condition, especially one that is considered better or more legitimate.",
      "explanation_cn": "指重新恢复一种先前的状态、制度或条件，尤指被认为更优越或更合法的状态。",
      "example_en": "The restoration of the monarchy in 1660 marked the end of the republican experiment in England.",
      "example_cn": "1660年君主制的复辟标志着英国共和实验的结束。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process of returning natural ecosystems or environments to a healthier, more natural state after human interference or degradation.",
      "explanation_cn": "指在人类干扰或破坏后，将自然生态系统或环境恢复到更健康、更自然状态的过程。",
      "example_en": "The wetland restoration project has successfully brought back native bird species to the area.",
      "example_cn": "这个湿地修复项目已成功使本地鸟类物种重返该地区。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "recovery",
      "analysis": "“Recovery” (恢复) 通常指从疾病、损失或困难中恢复过来，强调从负面状态回归正常或健康状态，多用于健康、经济或情绪领域。而 “restoration” 更强调对原始形态或结构的精确复原，常用于物质、历史或环境对象的修复。"
    },
    {
      "word_to_compare": "repair",
      "analysis": "“Repair” (修理) 指对损坏的部分进行修补，使其恢复功能，但不一定追求恢复到原始状态或历史准确性。它更注重实用性，而 “restoration” 则追求历史真实性与美学完整性，常涉及专业技术和学术研究。"
    },
    {
      "word_to_compare": "revival",
      "analysis": "“Revival” (复兴) 指使衰落的事物重新活跃或流行起来，常用于文化、艺术、宗教或时尚领域，强调重新获得生命力或关注度，但不一定意味着恢复到原始形式。而 “restoration” 更强调回归原貌，而非重新流行。"
    }
  ]
}