{
  "word": "retainer",
  "pronunciation": "ri·tey·nər",
  "concise_definition": "n. 定金, 预付款, 保持者, 保持器",
  "forms": {
    "plural": "retainers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sum of money paid in advance to secure the services of a professional, such as a lawyer or consultant, ensuring their availability and commitment over a period of time.",
      "explanation_cn": "指为确保专业人士（如律师或顾问）在一段时间内提供服务而预先支付的一笔款项，以保证其可用性和承诺。",
      "example_en": "She paid a $5,000 retainer to the law firm before they began working on her case.",
      "example_cn": "她在律师开始处理她的案件前，支付了5000美元的定金。"
    },
    {
      "pos": "noun",
      "explanation_en": "A dental appliance worn to maintain the position of teeth after orthodontic treatment, typically made of wire and plastic or clear material.",
      "explanation_cn": "指在正畸治疗后用于保持牙齿位置的口腔装置，通常由金属丝和塑料或透明材料制成。",
      "example_en": "The orthodontist gave him a custom-made retainer to wear at night after his braces were removed.",
      "example_cn": "正畸医生在他摘除牙套后，为他定制了一个夜间佩戴的保持器。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is employed on a regular basis to provide ongoing services, especially in a domestic or personal capacity.",
      "explanation_cn": "指被长期雇佣以提供持续服务的人，尤指在家庭或个人事务中的服务人员，如管家或私人助理。",
      "example_en": "The family hired a retainer to manage their household and coordinate their schedule.",
      "example_cn": "这家人雇了一名管家来管理家务并协调他们的日程。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "deposit",
      "analysis": "“Deposit”（押金）通常指为保证履行合同或归还物品而支付的款项，具有可退还性，如租房押金。而 “retainer” 是为获得持续服务而支付的预付款，通常不退还，而是作为服务费用的一部分抵扣。"
    },
    {
      "word_to_compare": "orthodontic appliance",
      "analysis": "“Orthodontic appliance”（正畸装置）是总称，包括牙套、保持器、扩弓器等。而 “retainer” 是其中一种特定类型，专用于治疗后的牙齿位置维持，功能更单一、针对性更强。"
    },
    {
      "word_to_compare": "servant",
      "analysis": "“Servant”（仆人）泛指为他人提供家务或个人服务的人员，语义较传统，有时带有阶级色彩。而 “retainer” 强调的是长期雇佣关系和专业服务的持续性，更常用于现代语境，尤其指高收入家庭聘请的专职人员。"
    }
  ]
}