{
  "word": "retarded",
  "pronunciation": "ri·tard·id",
  "concise_definition": "adj. 智力迟缓的, 落后的; v. (过去式/过去分词) 延缓, 阻碍",
  "forms": {
    "comparative": "more retarded",
    "superlative": "most retarded",
    "past_tense": "retarded",
    "past_participle": "retarded",
    "present_participle": "retarding"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "A term historically used in medicine and psychology to describe a person with significantly below-average intellectual functioning and developmental delays; now widely considered offensive and outdated in both clinical and everyday usage.",
      "explanation_cn": "过去用于医学和心理学中描述智力显著低于平均水平且发育迟缓的人；如今在临床和日常用语中均被视为具有冒犯性且过时的术语。",
      "example_en": "The term 'retarded' was once used in educational reports, but it is now prohibited in professional contexts.",
      "example_cn": "‘retarded’ 一词曾用于教育报告中，但现在在专业语境中已被禁止使用。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used informally and pejoratively to describe something as slow, stupid, or inadequate — often in a dismissive or mocking tone.",
      "explanation_cn": "非正式且贬义地用于形容某事物缓慢、愚蠢或低劣，常带有轻蔑或嘲讽的语气。",
      "example_en": "That’s such a retarded idea — no one would ever agree to that.",
      "example_cn": "这想法太蠢了——没人会同意的。"
    },
    {
      "pos": "verb",
      "explanation_en": "To delay or hinder the progress, development, or function of something.",
      "explanation_cn": "指延缓、阻碍某事物的进展、发展或功能。",
      "example_en": "Poor lighting retards the growth of indoor plants.",
      "example_cn": "光线不足会阻碍室内植物的生长。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "disabled",
      "analysis": "“Disabled” (残疾的) 是一个中性、尊重的术语，用于描述身体、感官或认知功能受限的人群，是法律和医疗领域推荐的用语。而 “retarded” 因其历史污名化和贬义用法，已被主流社会和专业机构弃用，使用它可能构成歧视或冒犯。"
    },
    {
      "word_to_compare": "slow",
      "analysis": "“Slow” (缓慢的) 是一个中性描述词，可用于时间、速度或反应的客观描述，如“slow learner”（学习较慢者），虽可能不够精准，但不具侮辱性。而 “retarded” 作为形容词常被用作人身攻击，带有强烈贬义，语义远超字面意义。"
    },
    {
      "word_to_compare": "hinder",
      "analysis": "“Hinder” (阻碍) 是 “retard” 作为动词时的同义词，但 “hinder” 是中性、正式的词汇，用于描述任何类型的阻碍，如政策、资源或环境因素。而 “retard” 作为动词虽语义相近，但因名词形式的负面联想，使用时易引发歧义或反感，建议优先使用 “hinder” 或 “impede”。"
    }
  ]
}