{
  "word": "retrospective",
  "pronunciation": "ret·ro·spek·tiv",
  "concise_definition": "n. 回顾, 重温; a. 回顾的, 回溯的",
  "forms": {
    "plural": "retrospectives"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An exhibition or review that surveys the work or career of an artist, filmmaker, or other creative individual over a period of time, often highlighting their evolution and major achievements.",
      "explanation_cn": "指对艺术家、电影制作人或其他创意人士在一段时间内作品或职业生涯的全面回顾或展览，通常突出其发展脉络与重要成就。",
      "example_en": "The museum is hosting a retrospective of Frida Kahlo's paintings, showcasing over 100 works from her entire career.",
      "example_cn": "博物馆正在举办弗里达·卡罗的绘画回顾展，展出她整个职业生涯中的一百多件作品。"
    },
    {
      "pos": "noun",
      "explanation_en": "A process or meeting in which a group reflects on past events, actions, or outcomes, especially to learn from experience and improve future performance (commonly used in project management and agile teams).",
      "explanation_cn": "指一个团体对过去事件、行动或结果进行反思的过程，尤其用于从经验中学习并改进未来表现（常见于项目管理与敏捷团队中）。",
      "example_en": "At the end of each sprint, the team holds a retrospective to discuss what went well and what could be improved.",
      "example_cn": "在每个冲刺周期结束时，团队都会召开一次回顾会议，讨论哪些做得好，哪些可以改进。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or dealing with past events, experiences, or periods; looking back on or reviewing the past.",
      "explanation_cn": "与过去事件、经历或时期相关；回顾或重温过去的。",
      "example_en": "The documentary offers a retrospective look at the social changes of the 1960s.",
      "example_cn": "这部纪录片对20世纪60年代的社会变迁进行了回顾性的审视。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "review",
      "analysis": "“Review” (回顾/评论) 是一个更通用的词，可指对任何事物（如书籍、电影、表现）的评价或总结，不一定强调时间跨度或系统性。而 “retrospective” 更侧重于对长期历程的全面、系统性回顾，尤其在艺术或职业发展语境中具有更强的纪念性和结构性。"
    },
    {
      "word_to_compare": "memorial",
      "analysis": "“Memorial” (纪念) 强调对逝者或重要事件的缅怀与致敬，情感色彩更浓，常带有庄重或哀悼意味。而 “retrospective” 更中性，侧重于展示、分析和理解过去的发展过程，不必然涉及死亡或损失。"
    },
    {
      "word_to_compare": "reflection",
      "analysis": "“Reflection” (反思) 更侧重于个人或群体的内在思考与领悟，是心理或哲学层面的内省过程。而 “retrospective” 通常是外在的、有组织的活动，如展览或会议，具有明确的形式和产出。"
    }
  ]
}