{
  "word": "retrograde",
  "pronunciation": "ret·ro·grayd",
  "concise_definition": "adj. 逆行的, 倒退的; v. 使倒退, 逆行",
  "forms": {
    "third_person_singular": "retrogrades",
    "past_tense": "retrograded",
    "past_participle": "retrograded",
    "present_participle": "retrograding"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Moving or proceeding in a direction opposite to the usual or expected direction, especially in astronomy, referring to the apparent backward motion of a planet across the sky as observed from Earth.",
      "explanation_cn": "指以与通常或预期方向相反的方式运动，尤其在天文学中，指从地球观察时行星在天空中呈现的看似向后移动的现象。",
      "example_en": "The retrograde motion of Mars puzzled ancient astronomers for centuries.",
      "example_cn": "火星的逆行运动困扰了古代天文学家数个世纪。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by regression or a return to a less advanced or worse state; opposing progress or development.",
      "explanation_cn": "指表现出倒退或回归到更落后、更差状态的特征；反对进步或发展。",
      "example_en": "The new policy was criticized as a retrograde step for human rights.",
      "example_cn": "这项新政策被批评为在人权方面的倒退。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or cause to move in a backward direction, especially in an astronomical or metaphorical sense.",
      "explanation_cn": "指以向后方向运动，或使某物以向后方向运动，尤其在天文学或隐喻意义上。",
      "example_en": "The planet retrograded across the constellation for several weeks.",
      "example_cn": "这颗行星在几个星期内在星座中逆行移动。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "regressive",
      "analysis": "“Regressive”（倒退的）与 “retrograde” 在描述社会或制度倒退时高度相似，但 “regressive” 更常用于政策、税收或心理发展等抽象语境，强调系统性地向旧模式回归；而 “retrograde” 更具形象性，常与天文学或物理运动相关，也带有更强的贬义色彩。"
    },
    {
      "word_to_compare": "backward",
      "analysis": "“Backward”（向后的）是更通用的词，可指物理方向、发展水平或思维模式的落后，语气较中性或口语化；而 “retrograde” 更正式，常用于科学或学术语境，且隐含对进步的背离，贬义更明显。"
    },
    {
      "word_to_compare": "inverse",
      "analysis": "“Inverse”（相反的）强调数学或逻辑上的对称反向关系，如 inverse proportion（反比），不涉及时间或发展进程；而 “retrograde” 强调的是时间维度上的倒行或复旧，具有动态和历史的含义，不适用于纯数学关系。"
    }
  ]
}