{
  "word": "reuse",
  "pronunciation": "ree·yoos",
  "concise_definition": "v. 再使用, 重复利用; n. 再使用, 重复利用",
  "forms": {
    "third_person_singular": "reuses",
    "past_tense": "reused",
    "past_participle": "reused",
    "present_participle": "reusing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To use something again after it has already been used, often to reduce waste or conserve resources, without significantly altering its form or function.",
      "explanation_cn": "指在某物已被使用过后再次使用，通常是为了减少浪费或节约资源，且不对其形态或功能进行重大改变。",
      "example_en": "Many households reuse glass jars to store food instead of buying new containers.",
      "example_cn": "许多家庭将玻璃罐重新用来储存食物，而不是购买新的容器。"
    },
    {
      "pos": "verb",
      "explanation_en": "To repurpose an object or material for a different use than its original intended function, often in a creative or sustainable way.",
      "explanation_cn": "指将物品或材料以不同于其原始用途的方式重新利用，通常以富有创意或可持续的方式进行。",
      "example_en": "Artists often reuse discarded wood to create sculptures and furniture.",
      "example_cn": "艺术家常将废弃的木材重新利用，制作成雕塑和家具。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or practice of using something again, especially in the context of environmental sustainability or resource efficiency.",
      "explanation_cn": "指再次使用某物的行为或实践，尤其在环境可持续性或资源效率的背景下。",
      "example_en": "The city promotes reuse through community swap events and repair workshops.",
      "example_cn": "该市通过社区物品交换活动和维修工作坊推广重复利用。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "recycle",
      "analysis": "“Recycle” (回收) 指将废弃物经过工业处理，分解成原材料后再制造成新产品，涉及物理或化学形态的改变。而 “reuse” 是直接再次使用原物品，不改变其形态，更节能、更直接。"
    },
    {
      "word_to_compare": "repurpose",
      "analysis": "“Repurpose” (改作他用) 强调将物品用于一个全新的、与原设计不同的目的，通常带有创造性或功能性的转变。而 “reuse” 可以是原用途的重复使用，不一定改变功能。例如：用旧T恤当抹布是 reuse；用旧T恤做手提包是 repurpose。"
    },
    {
      "word_to_compare": "reclaim",
      "analysis": "“Reclaim” (回收利用/恢复) 通常指从废弃、被忽视或被占用的状态中取回并恢复其价值或用途，常用于土地、资源或权利的恢复。它比 “reuse” 更具恢复性或修复性，语义范围更广，有时包含法律或环境修复的含义。"
    }
  ]
}