{
  "word": "revising",
  "pronunciation": "ree·vahy·zihng",
  "concise_definition": "v. 修订, 修改, 校订",
  "forms": {
    "base_form": "revise",
    "third_person_singular": "revises",
    "past_tense": "revised",
    "past_participle": "revised",
    "present_participle": "revising"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To make changes to a text, plan, or document in order to improve its accuracy, clarity, or effectiveness, often by correcting errors, updating information, or reorganizing content.",
      "explanation_cn": "指对文本、计划或文件进行修改，以提高其准确性、清晰度或有效性，通常包括纠正错误、更新信息或重组内容。",
      "example_en": "She spent the weekend revising her research paper before submitting it to the journal.",
      "example_cn": "她整个周末都在修改她的研究论文，以便提交给期刊。"
    },
    {
      "pos": "verb",
      "explanation_en": "To review and reconsider something, especially a decision, opinion, or belief, and possibly change it based on new information or reflection.",
      "explanation_cn": "指重新审视某事物（尤其是决定、观点或信念），并根据新信息或反思可能对其进行更改。",
      "example_en": "After hearing the evidence, the committee decided to revise its original stance on the policy.",
      "example_cn": "在听取了证据后，委员会决定修改其对这项政策的原有立场。"
    },
    {
      "pos": "verb",
      "explanation_en": "To prepare for an exam by reviewing material previously learned, often with the goal of improving retention or understanding.",
      "explanation_cn": "指通过复习已学材料为考试做准备，通常旨在提高记忆或理解程度。",
      "example_en": "He’s been revising for his final exams every day for the past two weeks.",
      "example_cn": "过去两周他每天都在为期末考试复习。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "editing",
      "analysis": "“Editing”（编辑）更侧重于语言层面的润色，如语法、拼写、标点和风格的调整，通常不涉及内容结构的根本性改变。而 “revising” 更强调对内容、逻辑、结构或观点的实质性修改，范围更广。"
    },
    {
      "word_to_compare": "amending",
      "analysis": "“Amending”（修正）通常用于正式文件、法律条文或制度性文本的修改，带有法律或程序上的严肃性，且修改幅度往往较小、更精确。而 “revising” 更通用，可用于学术、创作或日常场景，修改幅度可大可小。"
    },
    {
      "word_to_compare": "rewriting",
      "analysis": "“Rewriting”（重写）意味着几乎完全重新撰写，可能保留原意但彻底改变表达方式。而 “revising” 通常是在原有基础上进行局部调整，保留大部分原始结构和措辞，仅优化或修正部分内容。"
    }
  ]
}