{
  "word": "revised",
  "pronunciation": "ri·vīzd",
  "concise_definition": "adj. 修订过的, 修改后的; v. 修订, 修改（动词 revise 的过去式和过去分词）",
  "forms": {
    "base_form": "revise",
    "third_person_singular": "revises",
    "present_participle": "revising",
    "past_tense": "revised",
    "past_participle": "revised"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Modified or amended after review, typically to improve accuracy, clarity, or completeness; often used to describe updated versions of documents, plans, or standards.",
      "explanation_cn": "经过审查后修改或修订的，通常是为了提高准确性、清晰度或完整性；常用于描述经过更新的文件、计划或标准版本。",
      "example_en": "The revised edition of the textbook includes new case studies and updated statistics.",
      "example_cn": "这本教科书的修订版新增了案例研究和更新的数据。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make changes to something, especially a written text, plan, or system, in order to correct errors, improve quality, or adapt to new information.",
      "explanation_cn": "对某事物（尤其是书面文本、计划或系统）进行修改，以纠正错误、提升质量或适应新信息。",
      "example_en": "She revised her essay three times before submitting it to the professor.",
      "example_cn": "她在提交论文给教授之前修改了三遍。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reconsider and change one's opinion, decision, or estimate based on new evidence or reflection.",
      "explanation_cn": "根据新证据或反思，重新考虑并改变自己的观点、决定或估计。",
      "example_en": "After seeing the data, the committee revised its original forecast.",
      "example_cn": "在看到数据后，委员会修改了其最初的预测。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "edited",
      "analysis": "“Edited”（编辑过的）通常指对文字进行语法、拼写、格式或风格上的润色，侧重于语言层面的修正；而 “revised” 更强调内容层面的实质性修改，如结构调整、观点更新或信息增删，修改幅度通常更大、更深入。"
    },
    {
      "word_to_compare": "updated",
      "analysis": "“Updated”（更新的）侧重于使某事物符合当前的时间、状态或标准，常用于技术、数据或信息的时效性调整，如软件更新；而 “revised” 更强调基于审查或反馈进行的主动修正，可能包含删除、重写或重新组织，不一定只是时间上的更新。"
    },
    {
      "word_to_compare": "amended",
      "analysis": "“Amended”（修正的）多用于法律、政策或正式文件中的条款修改，具有程序性和权威性，常需经过正式流程；而 “revised” 适用范围更广，可用于非正式或日常语境，修改动机更灵活，不必然涉及正式程序。"
    }
  ]
}