{
  "word": "revolutions",
  "pronunciation": "rev·uh·loo·shuhnz",
  "concise_definition": "n. 革命, 旋转, 周转, 转数",
  "forms": {
    "singular": "revolution"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A forcible overthrow of a government or social order, often accompanied by profound changes in political, economic, or cultural systems.",
      "explanation_cn": "指通过暴力手段推翻政府或社会秩序，通常伴随着政治、经济或文化体系的根本性变革。",
      "example_en": "The French Revolution of 1789 marked the end of absolute monarchy in France.",
      "example_cn": "1789年的法国大革命标志着法国绝对君主制的终结。"
    },
    {
      "pos": "noun",
      "explanation_en": "A complete turn or cycle around an axis, especially in mechanical or astronomical contexts.",
      "explanation_cn": "指围绕某一轴心完成的一次完整旋转，常用于机械或天文学语境中。",
      "example_en": "The Earth makes one revolution around the Sun every 365.25 days.",
      "example_cn": "地球每365.25天绕太阳公转一周。"
    },
    {
      "pos": "noun",
      "explanation_en": "A unit of measurement for rotational speed, equal to one full turn per minute (rpm).",
      "explanation_cn": "指衡量旋转速度的单位，等于每分钟完整旋转一圈（rpm）。",
      "example_en": "The motor operates at 3,000 revolutions per minute.",
      "example_cn": "该电机每分钟转速为3000转。"
    },
    {
      "pos": "noun",
      "explanation_en": "A significant and sudden change or transformation in a particular field, such as technology, science, or art.",
      "explanation_cn": "指在某一领域（如科技、科学或艺术）发生的重大而迅速的变革或转型。",
      "example_en": "The digital revolution has transformed how we communicate and access information.",
      "example_cn": "数字革命彻底改变了我们沟通和获取信息的方式。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "uprising",
      "analysis": "“Uprising”（起义）通常指民众自发的、规模较小的反抗行为，不一定旨在彻底推翻政权，而 “revolution” 强调系统性、结构性的彻底变革，常伴随新制度的建立。"
    },
    {
      "word_to_compare": "rotation",
      "analysis": "“Rotation”（旋转）是中性术语，仅描述物体围绕轴心的周期性运动，不包含政治或社会含义；而 “revolution” 在指天体运动时虽可互换，但在社会语境中专指颠覆性变革，语义更丰富。"
    },
    {
      "word_to_compare": "transformation",
      "analysis": "“Transformation”（转变）泛指任何形式的深刻变化，可以是渐进的、非暴力的，如个人成长或企业转型；而 “revolution” 强调剧烈、快速、往往通过冲突实现的质变，具有更强的破坏性和重建性。"
    }
  ]
}