{
  "word": "revolutionary",
  "pronunciation": "rev·uh·loo·shuh·ner·ee",
  "concise_definition": "adj. 革命的, 革命性的; n. 革命者",
  "forms": {
    "comparative": "more revolutionary",
    "superlative": "most revolutionary",
    "plural": "revolutionaries"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or causing a revolution, especially one that brings about a radical and fundamental change in political, social, or technological systems.",
      "explanation_cn": "与革命相关或引发革命的，尤指在政治、社会或技术体系中带来根本性、彻底性变革的。",
      "example_en": "The invention of the smartphone was a revolutionary development in communication technology.",
      "example_cn": "智能手机的发明是通信技术领域的一项革命性突破。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Extremely new, innovative, or radical in approach, often challenging established norms or conventions.",
      "explanation_cn": "在方法上极为新颖、创新或激进，通常挑战既有的规范或传统。",
      "example_en": "Her revolutionary ideas about education transformed the way children learn.",
      "example_cn": "她关于教育的革命性思想彻底改变了儿童的学习方式。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who advocates or participates in a revolution, especially one seeking to overthrow an existing political or social order.",
      "explanation_cn": "主张或参与革命的人，尤指试图推翻现有政治或社会秩序者。",
      "example_en": "The revolutionary was imprisoned for organizing protests against the dictatorship.",
      "example_cn": "这位革命者因组织反对独裁政权的抗议活动而被监禁。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "radical",
      "analysis": "“Radical”（根本的）强调事物的根源性或极端性，常用于描述观点、政策或改革的深度，但不一定涉及暴力或系统性颠覆；而 “revolutionary” 更强调通过剧烈变革彻底推翻旧体系，具有更强的行动导向和历史转折意义。"
    },
    {
      "word_to_compare": "innovative",
      "analysis": "“Innovative”（创新的）侧重于引入新方法、新技术或新理念，通常在现有框架内进行改进，语气中性甚至积极；而 “revolutionary” 暗示对旧体系的颠覆性破坏，变革程度更深、影响更剧烈，常带有政治或社会动荡的色彩。"
    },
    {
      "word_to_compare": "rebellious",
      "analysis": "“Rebellious”（叛逆的）描述一种反抗权威或规则的态度，多用于个人行为或情绪，不一定追求系统性变革；而 “revolutionary” 是有组织、有目标地推动结构性变革，通常指向集体行动和制度更替，语义范围更广、目标更宏大。"
    }
  ]
}