{
  "word": "revolution",
  "pronunciation": "rev·uh·loo·shun",
  "concise_definition": "n. 革命, 重大变革, 周转, 单位转速",
  "forms": {
    "plural": "revolutions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A forcible or dramatic overthrow of a government, social order, or system, often accompanied by widespread change in power, structure, or ideology.",
      "explanation_cn": "指通过暴力或剧烈手段推翻政府、社会秩序或制度，通常伴随着权力、结构或意识形态的广泛变革。",
      "example_en": "The French Revolution of 1789 fundamentally changed the political landscape of Europe.",
      "example_cn": "1789年的法国大革命彻底改变了欧洲的政治格局。"
    },
    {
      "pos": "noun",
      "explanation_en": "A profound and sweeping change in technology, industry, culture, or society that transforms the way people live or work.",
      "explanation_cn": "指在技术、产业、文化或社会领域发生的深刻而广泛的变革，彻底改变人们的生活或工作方式。",
      "example_en": "The digital revolution has transformed how we communicate and access information.",
      "example_cn": "数字革命彻底改变了我们沟通和获取信息的方式。"
    },
    {
      "pos": "noun",
      "explanation_en": "A complete turn or cycle around an axis, especially in mechanical or astronomical contexts.",
      "explanation_cn": "指围绕某一轴心完成的一次完整旋转，常用于机械或天文学语境中。",
      "example_en": "The Earth makes one revolution around the Sun every 365 days.",
      "example_cn": "地球每365天绕太阳公转一周。"
    },
    {
      "pos": "noun",
      "explanation_en": "A unit of measurement for rotational speed, equal to one complete turn per minute (rpm).",
      "explanation_cn": "指衡量旋转速度的单位，等于每分钟完整旋转一圈（rpm）。",
      "example_en": "The engine runs at 3,000 revolutions per minute.",
      "example_cn": "发动机每分钟转速为3000转。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "reform",
      "analysis": "“Reform”（改革）指在现有体系内进行渐进式、制度化的改进，通常不涉及暴力或彻底推翻，强调修正与完善。而 “revolution” 则意味着根本性、颠覆性的断裂，往往伴随剧烈冲突和旧秩序的崩溃。"
    },
    {
      "word_to_compare": "change",
      "analysis": "“Change”（变化）是一个最宽泛的词，泛指任何状态的改变，可以是微小的、偶然的或缓慢的。而 “revolution” 是一种极端、系统性、具有历史意义的剧烈变化，通常具有明确的转折点和深远影响。"
    },
    {
      "word_to_compare": "transformation",
      "analysis": "“Transformation”（转变）强调从一种形式或状态到另一种的深刻变化，常用于个人、组织或自然过程，不必然涉及政治暴力或群众运动。而 “revolution” 更强调集体行动、权力更迭和意识形态的颠覆，具有强烈的政治和社会动员色彩。"
    }
  ]
}