{
  "word": "reward",
  "pronunciation": "ri·wɔrd",
  "concise_definition": "n. 奖励, 报酬, 赏金; v. 奖赏, 报答",
  "forms": {
    "third_person_singular": "rewards",
    "past_tense": "rewarded",
    "past_participle": "rewarded",
    "present_participle": "rewarding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Something given in return for good behavior, achievement, or service, often to encourage or recognize desirable conduct.",
      "explanation_cn": "为回报良好行为、成就或服务而给予的东西，通常用于鼓励或认可可取的行为。",
      "example_en": "She received a cash reward for reporting the stolen car.",
      "example_cn": "她因报告了被盗汽车而获得了一笔现金奖励。"
    },
    {
      "pos": "noun",
      "explanation_en": "A prize or incentive offered to encourage people to take a specific action, especially in contests or investigations.",
      "explanation_cn": "为鼓励人们采取特定行动（尤其是在竞赛或调查中）而提供的奖品或激励。",
      "example_en": "The police offered a $10,000 reward for information leading to the suspect's arrest.",
      "example_cn": "警方悬赏一万美元，以获取有助于逮捕嫌疑人的线索。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give something valuable (such as money, recognition, or a gift) to someone in recognition of their actions, efforts, or achievements.",
      "explanation_cn": "为表彰某人的行为、努力或成就而给予其有价值的东西（如金钱、认可或礼物）。",
      "example_en": "The company rewarded its top employees with a paid vacation.",
      "example_cn": "公司奖励顶尖员工一次带薪假期。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provide a benefit or positive outcome as a consequence of a particular action or behavior, often implying natural or inevitable results.",
      "explanation_cn": "作为某种行为或举动的后果而带来益处或积极结果，常暗示这是自然或必然的结果。",
      "example_en": "Hard work is often rewarded with success.",
      "example_cn": "努力工作常常会换来成功。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "prize",
      "analysis": "“Prize”（奖品）通常指在竞赛、比赛或抽奖中赢得的有形物品或荣誉，强调竞争性和偶然性。而 “reward” 更广泛，可针对任何值得肯定的行为，不一定是通过竞争获得，且更强调行为与回报之间的因果关系。"
    },
    {
      "word_to_compare": "compensation",
      "analysis": "“Compensation”（补偿）侧重于对损失、损害或服务的公平回报，常用于法律或经济语境，具有义务性或交易性。而 “reward” 更偏向自愿性、激励性，通常用于表彰超出基本义务的表现。"
    },
    {
      "word_to_compare": "incentive",
      "analysis": "“Incentive”（激励）指预先设定的诱因，目的是促使某人采取某种行动，通常是预期中的推动力。而 “reward” 是行动完成后的结果，是事后给予的回报。前者是“诱因”，后者是“结果”。"
    }
  ]
}