{
  "word": "rewrite",
  "pronunciation": "ree·rīt",
  "concise_definition": "v. 重写, 重述, 修改",
  "forms": {
    "third_person_singular": "rewrites",
    "past_tense": "rewrote",
    "past_participle": "rewritten",
    "present_participle": "rewriting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To write something again, typically with the aim of improving clarity, style, structure, or accuracy, often after revision or feedback.",
      "explanation_cn": "指重新撰写某内容，通常是为了提升其清晰度、风格、结构或准确性，常在修订或收到反馈后进行。",
      "example_en": "The editor asked the author to rewrite the chapter to make the plot more engaging.",
      "example_cn": "编辑要求作者重写这一章，使情节更具吸引力。"
    },
    {
      "pos": "verb",
      "explanation_en": "To rephrase or restate an idea, text, or expression in a different way, often to suit a new context, audience, or purpose.",
      "explanation_cn": "指以不同的方式重新表述某个想法、文本或表达，通常是为了适应新的语境、受众或目的。",
      "example_en": "She rewrote the legal jargon into plain language so the public could understand it.",
      "example_cn": "她将法律术语改写成通俗语言，以便公众理解。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fundamentally alter or transform the content or form of something, especially in creative or technical fields such as film, software, or literature.",
      "explanation_cn": "指对某事物的内容或形式进行根本性的修改或重构，尤其在电影、软件或文学等创意或技术领域中。",
      "example_en": "The screenplay was completely rewritten after the director’s vision changed.",
      "example_cn": "导演的创作理念改变后，剧本被彻底重写了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "revise",
      "analysis": "“Revise”（修订）通常指对现有文本进行局部调整，如修正语法、润色措辞或补充细节，改动幅度较小，重点在于完善而非重构。而 “rewrite” 强调更彻底的重写，可能涉及结构重组、语言风格转换甚至内容重写，改动程度更深。"
    },
    {
      "word_to_compare": "paraphrase",
      "analysis": "“Paraphrase”（释义）指用不同的词语表达相同的意思，通常保持原意不变，仅改变表达方式，常用于学术或翻译场景。而 “rewrite” 不仅改变措辞，还可能改变结构、语气、重点甚至目的，具有更强的创造性与目的性。"
    },
    {
      "word_to_compare": "edit",
      "analysis": "“Edit”（编辑）是一个更宽泛的术语，涵盖校对、删减、调整顺序、修正错误等多种操作，但不一定涉及重写。而 “rewrite” 是编辑的一种高级形式，特指以全新方式重新构建文本，通常意味着原稿被显著改变或取代。"
    }
  ]
}