{
  "word": "richmond",
  "pronunciation": "rich·mond",
  "concise_definition": "n. 里士满（地名，美国弗吉尼亚州首府、英国伦敦郊区等）",
  "forms": {
    "plural": "richmonds"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to several places, most notably the capital city of the U.S. state of Virginia, known for its historical significance in the American Civil War and its cultural institutions.",
      "explanation_cn": "专有名词，指多个地点，最著名的是美国弗吉尼亚州的首府，以其在美国内战中的历史意义和文化机构而闻名。",
      "example_en": "Richmond is home to the Virginia Museum of Fine Arts and numerous Civil War battlefields.",
      "example_cn": "里士满是弗吉尼亚美术博物馆和众多内战战场的所在地。"
    },
    {
      "pos": "noun",
      "explanation_en": "A district in southwest London, England, known for its royal connections, riverside parks, and historic architecture, including Richmond Palace.",
      "explanation_cn": "英格兰伦敦西南部的一个区，以其与王室的联系、河畔公园和历史建筑（如里士满宫）而闻名。",
      "example_en": "We spent a peaceful afternoon walking along the Thames in Richmond.",
      "example_cn": "我们在里士满沿泰晤士河散步，度过了一个宁静的下午。"
    },
    {
      "pos": "noun",
      "explanation_en": "A surname or family name, historically derived from the place name, borne by notable individuals such as the American actor Keith Richmond or the British politician Charles Richmond.",
      "explanation_cn": "一个姓氏，源自地名，曾为多位知名人士使用，如美国演员基思·里士满或英国政治家查尔斯·里士满。",
      "example_en": "Professor Richmond presented groundbreaking research on urban development at the conference.",
      "example_cn": "里士满教授在会议上就城市发展发表了开创性的研究成果。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "city",
      "analysis": "“City”（城市）是一个通用名词，泛指任何人口密集、具有行政和经济功能的都市区域。而 “Richmond” 是一个专有名词，特指某一个具体的城市或地区，不具备通用性。不能说 “a city” 等同于 “Richmond”，但可以说 “Richmond is a city”。"
    },
    {
      "word_to_compare": "metropolis",
      "analysis": "“Metropolis”（大都市）强调规模庞大、经济文化中心地位的城市，通常带有现代性和国际化色彩。Richmond 虽是州首府，但规模和国际影响力远不及纽约或伦敦这样的 metropolis，因此它更常被描述为历史悠久的区域首府，而非大都市。"
    },
    {
      "word_to_compare": "town",
      "analysis": "“Town”（城镇）通常指规模较小、人口较少的定居点。Richmond（弗吉尼亚州）和伦敦的 Richmond 都是具有一定规模的城市区域，远超一般 town 的定义，因此不能用 “town” 准确替代。但在某些语境中，如伦敦的 Richmond，当地人可能口语化地称其为 “the town of Richmond”，这属于文化习惯而非地理精确性。"
    }
  ]
}