{
  "word": "riders",
  "pronunciation": "ry·dərz",
  "concise_definition": "n. 骑手, 乘客, 附加条款, 修正案",
  "forms": {
    "singular": "rider"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who rides a horse, bicycle, motorcycle, or other animal or vehicle.",
      "explanation_cn": "指骑马、骑自行车、骑摩托车或其他动物或交通工具的人。",
      "example_en": "The riders competed in the long-distance race across the desert.",
      "example_cn": "这些骑手参加了穿越沙漠的长距离比赛。"
    },
    {
      "pos": "noun",
      "explanation_en": "A passenger on a vehicle, especially one who rides as a non-driver (e.g., on a bus, train, or motorcycle).",
      "explanation_cn": "指交通工具上的乘客，尤其是非驾驶者（如公交车、火车或摩托车上的乘客）。",
      "example_en": "The bus driver reminded all riders to hold onto the handrails.",
      "example_cn": "公交车司机提醒所有乘客抓紧扶手。"
    },
    {
      "pos": "noun",
      "explanation_en": "An additional clause or provision added to a bill, contract, or document, often unrelated to the main subject, used to pass or modify legislation indirectly.",
      "explanation_cn": "指附加在法案、合同或文件中的额外条款，通常与主要内容无关，用于间接通过或修改法规。",
      "example_en": "The environmental bill was passed after a controversial rider funding a highway project was attached.",
      "example_cn": "在附加了一项有争议的、为高速公路项目拨款的附加条款后，这项环保法案得以通过。"
    },
    {
      "pos": "noun",
      "explanation_en": "A supplementary condition or stipulation, especially in insurance policies or employment contracts, that modifies the original terms.",
      "explanation_cn": "指在保险单或雇佣合同中附加的条件或规定，用以修改原始条款。",
      "example_en": "The insurance policy included a rider that excluded coverage for pre-existing conditions.",
      "example_cn": "这份保险单包含了一项附加条款，排除了对既往病症的保障。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "passenger",
      "analysis": "“Passenger”（乘客）更广泛地指任何乘坐交通工具的人，不强调是否在驾驶或操作设备，常用于公共交通语境。而 “rider” 更常用于非公共交通工具（如摩托车、自行车）或带有特定语境（如马术、立法附加条款）的场合，语义范围更窄但更具体。"
    },
    {
      "word_to_compare": "cyclist",
      "analysis": "“Cyclist”（骑自行车者）是特指骑自行车的人，属于 “rider” 的一个子类。而 “rider” 可涵盖骑马、骑摩托、骑自行车等多种形式，语义更广。在非正式语境中，两者有时可互换，但 “cyclist” 更专业、更精确。"
    },
    {
      "word_to_compare": "amendment",
      "analysis": "“Amendment”（修正案）指对法律、宪法或文件进行的正式修改，通常是主体内容的直接修订。而 “rider” 是一种非正式、有时隐蔽地附加在法案上的条款，常与主议题无关，带有策略性或投机性，其目的常是绕过正常审议程序。"
    }
  ]
}