{
  "word": "ride",
  "pronunciation": "rahyd",
  "concise_definition": "v. 骑, 乘坐; n. 骑行, 乘车, 旅程",
  "forms": {
    "third_person_singular": "rides",
    "past_tense": "rode",
    "past_participle": "ridden",
    "present_participle": "riding"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To sit on and control the movement of an animal, especially a horse, or to be carried along on a vehicle such as a bicycle, motorcycle, or public transport.",
      "explanation_cn": "指骑在动物（尤其是马）身上并控制其移动，或乘坐自行车、摩托车、公共交通工具等交通工具前行。",
      "example_en": "She rides her bicycle to work every morning.",
      "example_cn": "她每天早上骑自行车上班。"
    },
    {
      "pos": "verb",
      "explanation_en": "To travel as a passenger in a vehicle, especially when not driving it oneself.",
      "explanation_cn": "指作为乘客乘坐交通工具，通常不是自己驾驶。",
      "example_en": "We rode the subway to the museum.",
      "example_cn": "我们乘坐地铁去了博物馆。"
    },
    {
      "pos": "noun",
      "explanation_en": "A journey made by sitting on or in a vehicle or animal, often for pleasure or recreation.",
      "explanation_cn": "指乘坐交通工具或动物进行的一段旅程，常用于休闲或娱乐目的。",
      "example_en": "We went for a long ride through the countryside on our motorcycles.",
      "example_cn": "我们骑摩托车在乡间进行了长途骑行。"
    },
    {
      "pos": "noun",
      "explanation_en": "An amusement park attraction that involves motion, such as a roller coaster or carousel.",
      "explanation_cn": "指游乐园中具有运动性质的娱乐设施，如过山车或旋转木马。",
      "example_en": "The children screamed with delight on the roller coaster ride.",
      "example_cn": "孩子们在过山车上兴奋地尖叫。"
    },
    {
      "pos": "noun",
      "explanation_en": "A smooth or easy experience, often used figuratively to describe a situation that proceeds without difficulty.",
      "explanation_cn": "比喻性地指一段顺利、无阻碍的经历或过程。",
      "example_en": "After the initial setbacks, the project became a smooth ride.",
      "example_cn": "在最初的挫折之后，这个项目变得顺风顺水。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "drive",
      "analysis": "“Drive” (驾驶) 强调主动操作和控制车辆，通常指作为驾驶员；而 “ride” 强调作为乘客或被运送者，不负责操控。例如：I drive a car（我开车） vs. I ride in a car（我坐车）。"
    },
    {
      "word_to_compare": "travel",
      "analysis": "“Travel” (旅行) 是一个更广泛、更抽象的词，泛指从一地到另一地的移动行为，不特指交通工具或方式；而 “ride” 更具体，强调乘坐某种载具进行的移动，常带有短途、休闲或体验的色彩。"
    },
    {
      "word_to_compare": "journey",
      "analysis": "“Journey” (旅程) 通常指较长距离、有目的的旅行，常带有情感或象征意义（如人生旅程）；而 “ride” 更侧重于物理上的乘坐过程，时间较短，且常用于日常语境，如公交 ride、骑马 ride。"
    }
  ]
}