{
  "word": "rider",
  "pronunciation": "ry·dər",
  "concise_definition": "n. 骑手, 乘客, 附加条款, 修正案",
  "forms": {
    "plural": "riders"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who rides a horse, bicycle, motorcycle, or other animal or vehicle.",
      "explanation_cn": "指骑马、骑自行车、骑摩托车或其他动物或交通工具的人。",
      "example_en": "The rider guided the horse gracefully through the obstacle course.",
      "example_cn": "骑手优雅地引导马匹穿过障碍赛道。"
    },
    {
      "pos": "noun",
      "explanation_en": "A passenger on a vehicle, especially one who rides on the back of a motorcycle or bicycle.",
      "explanation_cn": "指乘坐交通工具的乘客，尤指骑在摩托车或自行车后座的人。",
      "example_en": "The driver turned to check on the rider behind him.",
      "example_cn": "司机回头查看身后骑在后座的乘客。"
    },
    {
      "pos": "noun",
      "explanation_en": "An additional clause or provision added to a contract, bill, or document, often modifying its original intent or adding a specific condition.",
      "explanation_cn": "指附加在合同、法案或文件上的额外条款，通常用于修改其原意或增加特定条件。",
      "example_en": "The amendment was passed as a rider to the main budget bill.",
      "example_cn": "该修正案作为附加条款被并入主要预算法案。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small decorative or functional attachment, such as a strap or flap, on clothing or equipment.",
      "explanation_cn": "指服装或装备上的小型装饰性或功能性附件，如带子或翻盖。",
      "example_en": "The saddle had leather riders to secure the stirrups.",
      "example_cn": "马鞍上有皮革带子用于固定马镫。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "passenger",
      "analysis": "“Passenger”（乘客）泛指任何乘坐交通工具的人，不强调是否参与操控，常用于汽车、飞机、火车等。而 “rider” 更常用于指乘坐非机动车（如马、自行车、摩托车）的人，有时隐含其与交通工具的直接互动或控制关系。"
    },
    {
      "word_to_compare": "clause",
      "analysis": "“Clause”（条款）是法律或合同中独立的、结构化的规定，通常有明确编号和逻辑位置。而 “rider” 是一种附加的、非核心的条款，常在文件通过后临时加入，可能带有政治或策略性目的，带有‘附加’或‘搭便车’的隐含意味。"
    },
    {
      "word_to_compare": "appendix",
      "analysis": "“Appendix”（附录）是文件末尾补充的、与正文相关但非核心的材料，通常为信息性内容（如数据、图表）。而 “rider” 是对主文本的实质性修改或补充条件，具有法律效力，常在主文本通过后强行加入，具有更强的干预性。"
    }
  ]
}