{
  "word": "riding",
  "pronunciation": "rye·ding",
  "concise_definition": "n. 骑乘, 骑马; v. 骑, 驾驶, 乘坐",
  "forms": {
    "base_form": "ride",
    "third_person_singular": "rides",
    "past_tense": "rode",
    "past_participle": "ridden",
    "present_participle": "riding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act or practice of sitting on and controlling an animal (especially a horse) or a vehicle (such as a bicycle or motorcycle) while it moves.",
      "explanation_cn": "指骑在动物（尤其是马）或车辆（如自行车或摩托车）上并控制其移动的行为或活动。",
      "example_en": "She went for a long riding in the countryside this morning.",
      "example_cn": "今天早上她去乡下骑了很长时间的马。"
    },
    {
      "pos": "noun",
      "explanation_en": "A journey or trip made by riding, especially for pleasure or sport.",
      "explanation_cn": "指以骑乘方式进行的一次旅程，尤指为了休闲或运动。",
      "example_en": "We enjoyed a relaxing riding along the beach at sunset.",
      "example_cn": "我们在日落时沿着海滩享受了一次轻松的骑乘。"
    },
    {
      "pos": "verb",
      "explanation_en": "To sit on and control the movement of a horse, bicycle, motorcycle, or other vehicle as it travels.",
      "explanation_cn": "指骑在马、自行车、摩托车或其他交通工具上并控制其行进。",
      "example_en": "He rides his bike to work every day.",
      "example_cn": "他每天骑自行车上班。"
    },
    {
      "pos": "verb",
      "explanation_en": "To travel as a passenger in or on a vehicle, especially one that is moving or in motion.",
      "explanation_cn": "指作为乘客乘坐某种交通工具，尤指在移动中的车辆。",
      "example_en": "We rode the subway to the museum.",
      "example_cn": "我们乘坐地铁去了博物馆。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or operate something in a way that involves riding or being carried along, often with a sense of control or dominance.",
      "explanation_cn": "指以骑乘或被载运的方式移动或操作某物，常带有控制或主导的意味。",
      "example_en": "The waves were riding high as the storm approached.",
      "example_cn": "风暴来临之际，海浪汹涌起伏。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "driving",
      "analysis": "“Driving” (驾驶) 通常指操作汽车、卡车等机动车辆，强调对引擎和控制系统（如方向盘、油门）的操控；而 “riding” 更侧重于乘坐或骑乘的状态，不一定涉及直接控制，如骑马或作为乘客乘车。"
    },
    {
      "word_to_compare": "horsing",
      "analysis": "“Horsing” 并非标准英语词汇，但在口语中有时被误用为骑马的同义词。正确表达应为 “riding” 或 “horseback riding”。相比之下，”riding“ 是标准、通用的术语，适用于所有骑乘形式，而不仅限于马匹。"
    },
    {
      "word_to_compare": "traveling",
      "analysis": "“Traveling” (旅行) 是一个更广泛的上位词，泛指从一地到另一地的移动，方式包括步行、驾车、乘飞机等；而 “riding” 是一种具体的交通方式，特指通过骑乘或乘坐移动工具进行的移动，范围更窄、更具体。"
    }
  ]
}