{
  "word": "riff",
  "pronunciation": "riff",
  "concise_definition": "n. 重复乐句, 即兴演奏段落; v. 即兴演奏, 反复谈论",
  "forms": {
    "plural": "riffs",
    "third_person_singular": "riffs",
    "past_tense": "riffed",
    "past_participle": "riffed",
    "present_participle": "riffing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A short, memorable, and often repeated musical phrase, typically played by a guitar, bass, or other instrument in rock, jazz, or blues music, serving as a foundational motif or hook.",
      "explanation_cn": "指在摇滚、爵士或蓝调音乐中，由吉他、贝斯或其他乐器演奏的一段简短、易记且常重复的旋律片段，常作为乐曲的核心动机或抓耳亮点。",
      "example_en": "The opening riff of 'Smoke on the Water' is one of the most recognizable in rock history.",
      "example_cn": "《Smoke on the Water》开头的重复乐句是摇滚史上最广为人知的旋律之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A lively, often humorous or witty verbal pattern of rapid, repetitive speech, especially in comedy or casual conversation.",
      "explanation_cn": "指在喜剧或闲聊中一种活泼、常带幽默或机智的快速、重复性语言模式。",
      "example_en": "He launched into a riff about the absurdities of modern technology.",
      "example_cn": "他开始滔滔不绝地调侃现代科技的荒谬之处。"
    },
    {
      "pos": "verb",
      "explanation_en": "To improvise a musical phrase, especially on a guitar or other instrument, often repeating and varying it creatively during a performance.",
      "explanation_cn": "指在演奏中即兴创作一段旋律，尤其在吉他或其他乐器上，常在表演中重复并加以创造性变化。",
      "example_en": "The guitarist riffed for five minutes while the crowd cheered.",
      "example_cn": "吉他手即兴演奏了五分钟，观众欢呼不断。"
    },
    {
      "pos": "verb",
      "explanation_en": "To speak at length in a lively, repetitive, and often humorous way, especially about a favorite topic.",
      "explanation_cn": "指就某个喜爱的话题滔滔不绝、重复而生动地谈论，常带有幽默色彩。",
      "example_en": "She riffed on her travels through Southeast Asia for over an hour.",
      "example_cn": "她滔滔不绝地讲了一个多小时自己在东南亚的旅行经历。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "melody",
      "analysis": "“Melody”（旋律）指一首乐曲中连贯、有歌唱性的主旋律线，通常是听觉焦点，结构完整且具有情感表达。而 “riff” 更短促、重复性强，常作为节奏或和声的支撑，不一定具备独立的歌唱性，更多用于营造氛围或驱动节奏。"
    },
    {
      "word_to_compare": "jam",
      "analysis": "“Jam”（即兴合奏）指多位乐手共同进行的自由即兴演奏，强调互动与集体创作；而 “riff” 是单个乐手或乐器演奏的短小动机，是构成 jam 的基本素材之一。riff 是元素，jam 是过程。"
    },
    {
      "word_to_compare": "monologue",
      "analysis": "“Monologue”（独白）指一个人连续讲述的较长言语，通常有逻辑结构和叙事目的，常见于戏剧或演讲；而 “riff” 作为语言用法时更随意、跳跃、重复，不追求完整叙事，重在情绪表达或幽默效果，更接近即兴脱口秀。"
    }
  ]
}