{
  "word": "rig",
  "pronunciation": "rɪɡ",
  "concise_definition": "n. 装置, 设备; v. 操纵, 作弊",
  "forms": {
    "third_person_singular": "rigs",
    "past_tense": "rigged",
    "past_participle": "rigged",
    "present_participle": "rigging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A piece of equipment or a system of apparatus, especially one that is complex or specially designed for a particular purpose, such as in oil drilling or sailing.",
      "explanation_cn": "指一套设备或装置，尤其是为特定目的（如石油钻探或帆船航行）而设计的复杂系统。",
      "example_en": "The oil rig in the North Sea is one of the largest in the world.",
      "example_cn": "北海的石油钻井平台是世界上最大的之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "An unfair or dishonest arrangement, especially one designed to manipulate the outcome of an election, contest, or process.",
      "explanation_cn": "指一种不公平或不诚实的安排，尤其是为了操纵选举、比赛或程序的结果。",
      "example_en": "The election was accused of being rigged in favor of the incumbent party.",
      "example_cn": "这次选举被指控被操纵以利于执政党。"
    },
    {
      "pos": "verb",
      "explanation_en": "To manipulate or fix something dishonestly, especially to ensure a desired outcome, such as in a game, vote, or market.",
      "explanation_cn": "指以不诚实的方式操纵或篡改某事物，尤其是为了确保获得预期的结果，如在比赛、投票或市场中。",
      "example_en": "They rigged the poker game by using marked cards.",
      "example_cn": "他们用做记号的扑克牌操纵了扑克游戏。"
    },
    {
      "pos": "verb",
      "explanation_en": "To equip or prepare something, especially with specialized or modified equipment for a specific task.",
      "explanation_cn": "指为特定任务配备或改装设备，通常使用专门或改造过的装置。",
      "example_en": "The crew rigged the sails to catch the strongest wind.",
      "example_cn": "船员调整了帆以捕捉最强的风力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "setup",
      "analysis": "“Setup” (设置/安排) 是一个更中性的词，泛指为某项活动所做的准备或组织结构，不必然带有欺骗性。而 “rig” 在作为名词或动词时，通常隐含非法或不道德的操纵意图，语义色彩更负面。"
    },
    {
      "word_to_compare": "manipulate",
      "analysis": "“Manipulate” (操控) 是一个更广泛的术语，指以巧妙或不正当的方式影响或控制某人或某事，可以是心理、情感或系统层面的。而 “rig” 更具体地指向通过物理或制度性作弊来篡改结果，常用于选举、比赛或技术系统中。"
    },
    {
      "word_to_compare": "install",
      "analysis": "“Install” (安装) 指将设备或系统正式地安置或配置好，通常是合法且技术性的行为，如安装软件或机器。而 “rig” 在作为动词时，强调的是为特定目的进行非标准或欺骗性的改装，带有主观意图和潜在的不正当性。"
    }
  ]
}