{
  "word": "rigs",
  "pronunciation": "rɪgz",
  "concise_definition": "n. 钻井平台, 装置, 作弊手段; v. 操纵, 作弊",
  "forms": {
    "singular": "rig"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A large, complex structure or apparatus used for drilling oil or gas from beneath the earth's surface, typically located on land or offshore.",
      "explanation_cn": "指用于从地表下钻探石油或天然气的大型复杂设备或装置，通常位于陆地或海上。",
      "example_en": "The oil company deployed several offshore rigs to explore new reserves.",
      "example_cn": "这家石油公司部署了数个海上钻井平台以勘探新储量。"
    },
    {
      "pos": "noun",
      "explanation_en": "A system or setup designed to manipulate outcomes unfairly, especially in elections, contests, or financial transactions.",
      "explanation_cn": "指为不公平地操纵结果而设计的系统或手段，尤指在选举、比赛或金融交易中。",
      "example_en": "The election was accused of being rigged by the ruling party.",
      "example_cn": "这次选举被指控遭到执政党的操纵。"
    },
    {
      "pos": "verb",
      "explanation_en": "To manipulate or fix something dishonestly to achieve a desired outcome, especially in a contest or process.",
      "explanation_cn": "指通过不正当手段操纵某事，以达成预期结果，尤指在比赛或程序中。",
      "example_en": "They were caught rigging the bidding process to favor their own company.",
      "example_cn": "他们因操纵投标程序以偏袒自己的公司而被抓获。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of fishing or hunting equipment, such as a set of nets or traps arranged in a specific way to catch fish or animals.",
      "explanation_cn": "指一种捕鱼或狩猎设备，如以特定方式布置的网具或陷阱，用于捕获鱼类或动物。",
      "example_en": "The fishermen set their rigs along the reef to catch lobster.",
      "example_cn": "渔民在珊瑚礁旁布下渔具以捕捞龙虾。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "platform",
      "analysis": "“Platform”（平台）通常指一个用于支持或展示的结构或系统，如演讲平台、数字平台，强调功能性或中立性。而 “rig” 在指钻井设备时更强调其工业复杂性和技术性；在指作弊时则带有强烈的负面和操纵含义，这是 “platform” 所不具备的。"
    },
    {
      "word_to_compare": "scheme",
      "analysis": "“Scheme”（计划/阴谋）泛指任何有预谋的系统性安排，可能是合法的也可能是非法的。而 “rig” 作为名词或动词时，特指非法操纵或作弊，语义更具体、更具贬义。例如，一个税收筹划是 scheme，但操纵比赛结果是 rig。"
    },
    {
      "word_to_compare": "setup",
      "analysis": "“Setup”（布置/安排）是一个中性词，指为某目的所做的准备或组织，如摄影布景或任务安排。而 “rig” 在表示操纵时，隐含欺骗和不公，情感色彩更强烈。例如，一个精心的 setup 可能是合法的，但一个 rigged game 则一定是欺诈的。"
    }
  ]
}