{
  "word": "rise",
  "pronunciation": "rahyz",
  "concise_definition": "v. 上升, 增长, 起来; n. 上升, 增长, 起薪",
  "forms": {
    "third_person_singular": "rises",
    "past_tense": "rose",
    "past_participle": "risen",
    "present_participle": "rising"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move upward from a lower position to a higher one, often due to natural forces or internal energy, without external assistance.",
      "explanation_cn": "指在没有外力推动的情况下，因自然力量或内在能量从较低位置向较高位置移动。",
      "example_en": "The sun rises in the east every morning.",
      "example_cn": "太阳每天早晨从东方升起。"
    },
    {
      "pos": "verb",
      "explanation_en": "To increase in amount, level, value, or intensity over time, especially in a steady or significant manner.",
      "explanation_cn": "指数量、水平、价值或强度随时间稳定或显著地增加。",
      "example_en": "The cost of living has risen sharply over the past decade.",
      "example_cn": "过去十年中，生活成本急剧上升。"
    },
    {
      "pos": "verb",
      "explanation_en": "To stand up from a sitting, lying, or kneeling position; to get up.",
      "explanation_cn": "指从坐、躺或跪的姿势中站起来。",
      "example_en": "Everyone rose when the judge entered the courtroom.",
      "example_cn": "法官进入法庭时，所有人都站了起来。"
    },
    {
      "pos": "noun",
      "explanation_en": "An increase in amount, level, or value, especially one that is notable or sustained.",
      "explanation_cn": "指数量、水平或价值的显著或持续性增长。",
      "example_en": "There has been a steady rise in unemployment rates.",
      "example_cn": "失业率一直呈稳定上升趋势。"
    },
    {
      "pos": "noun",
      "explanation_en": "An increase in salary or pay, especially when granted by an employer.",
      "explanation_cn": "指雇主给予的薪资或报酬的增加。",
      "example_en": "She received a well-deserved rise after five years of excellent performance.",
      "example_cn": "她在五年出色表现后获得了应得的加薪。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "increase",
      "analysis": "“Increase” (增加) 是一个更通用的词，可用于任何数量、规模或程度上的增长，强调结果而非过程，常作及物动词（如 increase prices）。“Rise” 更强调自发、向上运动或自然增长，通常为不及物动词，且多用于描述趋势或动态变化。"
    },
    {
      "word_to_compare": "ascend",
      "analysis": "“Ascend” (攀登/上升) 通常带有正式或文学色彩，强调有目的、有方向地向上移动，常用于物理空间中的攀登（如登山）或地位提升（如 ascend to the throne）。“Rise” 更口语化、更广泛，可用于自然现象、经济趋势或身体动作，不强调意图。"
    },
    {
      "word_to_compare": "grow",
      "analysis": "“Grow” (增长/成长) 强调逐渐发展、成熟或扩大，常用于生物体、抽象概念（如信心、影响力）或规模的缓慢变化。“Rise” 更侧重于垂直方向或数值上的提升，强调变化的起点与终点之间的高度差，而非过程的持续性。"
    }
  ]
}