{
  "word": "rising",
  "pronunciation": "rahy·zihng",
  "concise_definition": "adj. 上升的, 增长的; n. 上升, 增长",
  "forms": {
    "base_form": "rise",
    "past_tense": "rose",
    "past_participle": "risen",
    "present_participle": "rising"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing something that is increasing in value, level, or intensity over time; moving upward or becoming more prominent.",
      "explanation_cn": "形容某事物在价值、水平或强度上随时间增加；向上移动或变得更为突出。",
      "example_en": "The rising cost of housing has made it difficult for young people to buy homes.",
      "example_cn": "房价的上涨使年轻人难以购房。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Referring to a person or group that is gaining power, influence, or popularity, often after a period of obscurity or decline.",
      "explanation_cn": "指某人或某群体在经历一段默默无闻或衰退后正获得权力、影响力或人气。",
      "example_en": "She is a rising star in the world of classical music.",
      "example_cn": "她是古典音乐界一颗冉冉升起的新星。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or process of increasing in height, level, amount, or intensity; an upward movement or trend.",
      "explanation_cn": "指高度、水平、数量或强度增加的行为或过程；向上的运动或趋势。",
      "example_en": "The rising of the sun marked the beginning of a new day.",
      "example_cn": "太阳升起标志着新的一天的开始。"
    },
    {
      "pos": "noun",
      "explanation_en": "A gradual increase in economic or social indicators, such as wages, prices, or population.",
      "explanation_cn": "指经济或社会指标（如工资、价格或人口）的逐步增长。",
      "example_en": "The rising in unemployment has alarmed policymakers.",
      "example_cn": "失业率的上升令政策制定者感到担忧。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "increasing",
      "analysis": "“Increasing” (增加的) 是一个更通用的形容词，适用于任何数量或程度上的增长，不强调方向性或动态过程。而 “rising” 更强调向上运动的视觉意象和持续的动态趋势，常用于自然现象（如水位、温度）或抽象趋势（如股价、声望）。"
    },
    {
      "word_to_compare": "growing",
      "analysis": "“Growing” (增长的) 侧重于逐渐变大或变强的过程，常用于生物、规模或抽象概念（如信心、影响力），带有有机发展的意味。而 “rising” 更强调垂直方向的上升，常用于数值、高度或地位的提升，更具量化和趋势性。"
    },
    {
      "word_to_compare": "ascending",
      "analysis": "“Ascending” (上升的) 是一个更正式、书面化的词，常用于描述物理或抽象意义上的向上移动，如登山、地位晋升，带有目的性和主动性。而 “rising” 更中性，可指自然发生或被动的上升，如潮水、价格，使用范围更广。"
    }
  ]
}