{
  "word": "rival",
  "pronunciation": "rahy·vuhl",
  "concise_definition": "n. 对手, 竞争者; v. 与…竞争, 与…匹敌",
  "forms": {
    "third_person_singular": "rivals",
    "past_tense": "rivalled",
    "past_participle": "rivalled",
    "present_participle": "rivaling",
    "plural": "rivals"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person or organization that competes with another for the same goal, such as customers, resources, or victory, often in a context of direct opposition.",
      "explanation_cn": "指为争夺相同目标（如客户、资源或胜利）而与另一方直接竞争的人或组织，通常带有对立性质。",
      "example_en": "Apple and Samsung are fierce rivals in the smartphone market.",
      "example_cn": "苹果和三星在智能手机市场是激烈的竞争对手。"
    },
    {
      "pos": "noun",
      "explanation_en": "Someone who is considered equal or nearly equal in ability, status, or achievement, often used to describe a worthy opponent.",
      "explanation_cn": "指在能力、地位或成就上与自己相当或几乎相当的人，常用于形容值得尊敬的对手。",
      "example_en": "She considers her older sister her greatest rival in piano competitions.",
      "example_cn": "她认为姐姐是她在钢琴比赛中最大的对手。"
    },
    {
      "pos": "verb",
      "explanation_en": "To compete with someone or something in a way that is nearly equal in strength, quality, or success.",
      "explanation_cn": "指在实力、质量或成就上与某人或某物竞争，达到几乎相等的程度。",
      "example_en": "This new restaurant rivals the best in the city for flavor and service.",
      "example_cn": "这家新餐厅在口味和服务上可与城市里最好的餐厅相媲美。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "opponent",
      "analysis": "“Opponent” (对手) 更侧重于在对抗性情境中（如比赛、辩论、战争）直接面对的一方，强调对立关系，但不一定包含竞争同一资源或目标的含义。而 “rival” 更强调长期、持续的竞争关系，常带有商业、体育或社会地位层面的比较意味。"
    },
    {
      "word_to_compare": "competitor",
      "analysis": "“Competitor” (竞争者) 是一个更中性、更广泛的术语，泛指任何参与竞争的人或组织，常用于商业或经济语境。而 “rival” 带有更强的情感色彩，暗示更紧密、更个人化或更激烈的对抗，有时甚至包含敌意或敬意。"
    },
    {
      "word_to_compare": "antagonist",
      "analysis": "“Antagonist” (对立面/反派) 多用于文学、戏剧或叙事语境，指与主角直接冲突的角色，具有强烈的负面或敌对色彩。而 “rival” 不一定带有道德评判，可以是正面的、值得尊敬的竞争者，情感色彩更复杂。"
    }
  ]
}