{
  "word": "roaming",
  "pronunciation": "roh·mee·ng",
  "concise_definition": "n. 漫游, 游荡; v. 漫游, 游荡 (动词原形: roam)",
  "forms": {
    "base_form": "roam",
    "third_person_singular": "roams",
    "past_tense": "roamed",
    "past_participle": "roamed",
    "present_participle": "roaming"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of traveling or moving around without a fixed destination or schedule, often for leisure, exploration, or necessity.",
      "explanation_cn": "指在没有固定目的地或时间表的情况下四处旅行或移动，通常出于休闲、探索或必要性。",
      "example_en": "After graduation, he went on a year of roaming across Europe.",
      "example_cn": "毕业后，他花了整整一年时间在欧洲各地漫游。"
    },
    {
      "pos": "noun",
      "explanation_en": "The use of a mobile device on a network outside its home service area, typically involving additional charges.",
      "explanation_cn": "指移动设备在归属网络以外的区域使用服务，通常会产生额外费用（如国际漫游）。",
      "example_en": "My phone bill was high because I used data roaming while traveling in Japan.",
      "example_cn": "我的话费很高，因为在日本旅行时使用了数据漫游。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move around aimlessly or casually, often in search of something or simply for the pleasure of movement.",
      "explanation_cn": "指无目的地或随意地四处走动，常为寻找某物，或单纯享受移动的乐趣。",
      "example_en": "The cats were roaming the neighborhood at dusk.",
      "example_cn": "黄昏时分，猫儿们在街区里闲逛。"
    },
    {
      "pos": "verb",
      "explanation_en": "To wander through a place, especially one that is large, open, or unfamiliar, often with a sense of freedom or exploration.",
      "explanation_cn": "指在广阔、开阔或陌生的地方游荡，常带有自由探索的意味。",
      "example_en": "She loved roaming the forests of her childhood home, collecting wildflowers.",
      "example_cn": "她喜欢在童年故居的森林里漫步，采集野花。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "wandering",
      "analysis": "“Wandering” (徘徊/闲逛) 与 “roaming” 非常接近，都表示无明确目标的移动。但 “wandering” 更强调一种缓慢、犹豫或迷失的状态，常带有一丝迷茫或忧郁的色彩；而 “roaming” 更中性，甚至带有积极的探索感，尤其在描述动物或旅行者时更显自由。"
    },
    {
      "word_to_compare": "traveling",
      "analysis": "“Traveling” (旅行) 通常指有目的地、有计划地从一地到另一地，强调旅程本身；而 “roaming” 强调无固定路线、无明确终点的移动，更随意、更自由，常不以到达某地为目的。"
    },
    {
      "word_to_compare": "surfing",
      "analysis": "“Surfing” (浏览/冲浪) 在数字语境中常指在互联网上随意浏览内容，与 “roaming” 在移动网络中的含义（如数据漫游）有语义交叉，但 “surfing” 仅限于信息获取行为，而 “roaming” 在通信领域是技术术语，指设备连接外部网络的物理行为，不涉及内容消费。"
    }
  ]
}