{
  "word": "roar",
  "pronunciation": "rōr",
  "concise_definition": "v. 吼叫, 咆哮; n. 吼声, 咆哮声",
  "forms": {
    "third_person_singular": "roars",
    "past_tense": "roared",
    "past_participle": "roared",
    "present_participle": "roaring"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To make a loud, deep, prolonged sound, typically as done by large animals like lions or bears, or by crowds, engines, or natural forces.",
      "explanation_cn": "发出响亮、低沉而持久的声音，通常指狮子、熊等大型动物，或人群、引擎、自然力量发出的吼叫。",
      "example_en": "The lion roared loudly, echoing through the savanna.",
      "example_cn": "狮子大声咆哮，声音在大草原上回荡。"
    },
    {
      "pos": "verb",
      "explanation_en": "To speak or shout in a loud, angry, or passionate voice, often to express fury or intense emotion.",
      "explanation_cn": "以响亮、愤怒或充满激情的声音说话或喊叫，常用于表达愤怒或强烈情绪。",
      "example_en": "The crowd roared its approval when the champion stepped onto the stage.",
      "example_cn": "当冠军走上舞台时，观众爆发出热烈的欢呼。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or operate with a loud, rumbling sound, especially of engines or machinery.",
      "explanation_cn": "指（引擎或机械）以轰鸣声运行或移动。",
      "example_en": "The old truck roared down the highway as it accelerated.",
      "example_cn": "那辆旧卡车加速时轰鸣着驶过高速公路。"
    },
    {
      "pos": "noun",
      "explanation_en": "A loud, deep, prolonged sound made by an animal, crowd, engine, or natural phenomenon.",
      "explanation_cn": "由动物、人群、引擎或自然现象发出的响亮、低沉而持久的声音。",
      "example_en": "The roar of the waterfall could be heard from miles away.",
      "example_cn": "瀑布的轰鸣声在数英里外都能听见。"
    },
    {
      "pos": "noun",
      "explanation_en": "A loud expression of approval or enthusiasm from a group of people, especially in a stadium or public setting.",
      "explanation_cn": "人群（尤其在体育场或公共场合）发出的热烈欢呼或赞赏声。",
      "example_en": "The audience gave a deafening roar when the band appeared.",
      "example_cn": "乐队出场时，观众爆发出震耳欲聋的欢呼。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "growl",
      "analysis": "“Growl” (低吼) 指一种更低沉、更短促、带有威胁性的声音，常用于狗、猫或人表达不满或警告，音量和气势通常弱于 “roar”。而 “roar” 更宏大、更具爆发力，常用于大型动物或群体情绪的宣泄。"
    },
    {
      "word_to_compare": "shout",
      "analysis": "“Shout” (喊叫) 是指用高音量的人类语言或呼喊，通常为清晰可辨的词语，目的是传达信息或引起注意。而 “roar” 更偏向非语言的、原始的、充满力量的噪音，常不包含具体语义，强调声音的物理强度和情感冲击。"
    },
    {
      "word_to_compare": "boom",
      "analysis": "“Boom” (轰隆声) 通常指低频、爆炸性或回响式的巨响，如雷声、爆炸或大鼓声，强调声音的震动感和空间传播。而 “roar” 更具连续性和动态性，常伴随运动或情绪的持续释放，如狮子持续咆哮或引擎轰鸣。"
    }
  ]
}