{
  "word": "roasted",
  "pronunciation": "roh·stid",
  "concise_definition": "adj. 烤制的, 烧烤的; v. 烤, 烧烤; (俚语) 严厉批评",
  "forms": {
    "base_form": "roast",
    "third_person_singular": "roasts",
    "past_tense": "roasted",
    "past_participle": "roasted",
    "present_participle": "roasting"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing food that has been cooked by dry heat, typically in an oven or over an open flame, resulting in a browned, flavorful exterior and tender interior.",
      "explanation_cn": "指通过干热（通常在烤箱中或明火上）烹制的食物，外皮呈金棕色、风味浓郁，内部鲜嫩多汁。",
      "example_en": "The roasted turkey was the centerpiece of the Thanksgiving dinner.",
      "example_cn": "烤火鸡是感恩节晚餐的主菜。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cook food using direct or indirect dry heat, often to enhance flavor and texture through browning and caramelization.",
      "explanation_cn": "指使用直接或间接的干热来烹制食物，通过褐变和焦糖化来提升风味和口感。",
      "example_en": "She roasted vegetables with olive oil and rosemary for the evening meal.",
      "example_cn": "她用橄榄油和迷迭香烤了蔬菜作为晚餐。"
    },
    {
      "pos": "verb",
      "explanation_en": "To criticize someone harshly and often humorously, especially in public or in a comedic setting; common in slang and internet culture.",
      "explanation_cn": "指公开或在喜剧场合中对某人进行严厉而常常带有幽默感的批评，常见于俚语和网络文化中。",
      "example_en": "The comedian roasted the celebrity with a series of hilarious and biting jokes.",
      "example_cn": "这位喜剧演员用一系列幽默又犀利的笑话对这位名人进行了‘炮轰’。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "grilled",
      "analysis": "“Grilled”（烧烤）通常指在明火或高温金属栅格上直接加热食物，强调快速烹饪和明显的炭烤痕迹，常用于肉类和蔬菜。而 “roasted” 更常用于烤箱中较慢、均匀的加热，适用于整只禽类、根茎类蔬菜或大块肉类，更注重整体风味的渗透和外皮的酥脆。"
    },
    {
      "word_to_compare": "baked",
      "analysis": "“Baked”（烘烤）泛指在烤箱中用热空气烹制食物，通常用于面包、蛋糕、派等，强调均匀受热和结构定型，不强调褐变或焦糖化。而 “roasted” 特指通过高温促使食物表面发生美拉德反应，产生浓郁香气和色泽，多用于肉类、土豆等咸味食材。"
    },
    {
      "word_to_compare": "mocked",
      "analysis": "“Mocked”（嘲笑）指以轻蔑或讽刺的方式取笑某人，语气常带敌意或贬低，不一定幽默。而 “roasted” 在俚语语境中虽也是严厉批评，但通常带有喜剧性、表演性和社交娱乐目的，常用于脱口秀或朋友间的玩笑，不必然带有恶意。"
    }
  ]
}