{
  "word": "roasting",
  "pronunciation": "roh·sting",
  "concise_definition": "n. 烤制, 烘烤; v. 烤, 烘; n. (非正式) 严厉批评, 犀利调侃",
  "forms": {
    "base_form": "roast",
    "third_person_singular": "roasts",
    "past_tense": "roasted",
    "past_participle": "roasted",
    "present_participle": "roasting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process or method of cooking food, especially meat or vegetables, by exposing it to direct or indirect heat in an oven or over a fire, resulting in browning and enhanced flavor.",
      "explanation_cn": "指通过直接或间接加热（如在烤箱中或火上）烹调食物（尤其是肉类或蔬菜），使其表面褐变并增强风味的过程或方法。",
      "example_en": "The roasting of the turkey took three hours in the oven.",
      "example_cn": "这只火鸡在烤箱里烤了三个小时。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cook food by dry heat, typically in an oven, until it is browned and thoroughly cooked through.",
      "explanation_cn": "指用干热（通常在烤箱中）烹调食物，直至其表面呈褐色且完全熟透。",
      "example_en": "She roasted the chicken with garlic and rosemary for Sunday dinner.",
      "example_cn": "她用大蒜和迷迭香烤了鸡肉作为周日晚餐。"
    },
    {
      "pos": "noun",
      "explanation_en": "A humorous and often exaggerated public criticism or teasing directed at a person, typically delivered in a comedic setting such as a roast event.",
      "explanation_cn": "指在喜剧场合（如‘烤人’派对）中对某人进行的幽默、夸张甚至尖锐的公开批评或调侃，通常以娱乐为目的。",
      "example_en": "The comedian’s roast of the actor had the audience laughing and cringing in equal measure.",
      "example_cn": "这位喜剧演员对那位演员的犀利调侃让观众又笑又尴尬。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "grilling",
      "analysis": "“Grilling”（烧烤）通常指在明火或高温金属网格上直接加热食物，强调快速烹饪和明显的炭火痕迹；而 “roasting” 更常用于封闭空间（如烤箱）中较慢、均匀的加热，适合大块肉类或整只禽类。两者虽都涉及干热，但设备和温度控制不同。"
    },
    {
      "word_to_compare": "baking",
      "analysis": "“Baking”（烘烤）一般用于指无脂肪或低脂肪的食品，如面包、蛋糕、饼干，强调温和、均匀的热传导；而 “roasting” 多用于肉类、蔬菜等高脂肪或可褐变的食物，强调表面焦香和风味浓缩。在日常用法中，两者有时互换，但烹饪语境中仍有区分。"
    },
    {
      "word_to_compare": "mocking",
      "analysis": "“Mocking”（嘲讽）泛指任何形式的讥笑或贬低，语气常带恶意；而 “roasting” 作为俚语用法，虽也尖锐，但通常发生在特定社交场合，有明确的娱乐意图，参与者往往心照不宣，甚至期待被‘烤’，带有仪式感和幽默边界，不等同于纯粹的侮辱。"
    }
  ]
}