{
  "word": "rocking",
  "pronunciation": "rok·ing",
  "concise_definition": "adj. 极好的, 令人兴奋的; v. 摇动, 摇摆",
  "forms": {
    "base_form": "rock",
    "present_participle": "rocking",
    "past_tense": "rocked",
    "past_participle": "rocked"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Used informally to describe something that is extremely good, exciting, or impressive, often in the context of music, performance, or style.",
      "explanation_cn": "非正式用语，用于形容某事物极其出色、令人兴奋或给人深刻印象，常用于音乐、表演或风格语境中。",
      "example_en": "That concert was absolutely rocking — the crowd went wild!",
      "example_cn": "那场演唱会太棒了——观众都疯了！"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing a style or attitude that is bold, energetic, and rebellious, often associated with rock music or counterculture.",
      "explanation_cn": "形容一种大胆、充满活力且具有反叛精神的风格或态度，常与摇滚音乐或反主流文化相关。",
      "example_en": "He showed up in a leather jacket and ripped jeans — total rocking vibe.",
      "example_cn": "他穿着皮夹克和破洞牛仔裤出现——完全是摇滚范儿。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move back and forth or side to side in a rhythmic motion, often gently, as in a cradle or chair.",
      "explanation_cn": "以有节奏的方式前后或左右摇动，通常动作轻柔，如摇篮或摇椅的摆动。",
      "example_en": "She was rocking the baby to sleep in the wooden rocking chair.",
      "example_cn": "她正坐在木制摇椅上轻轻摇晃着婴儿，哄他入睡。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to shake or sway vigorously, often due to impact or strong force.",
      "explanation_cn": "因冲击或强大力量而使某物剧烈晃动或摇摆。",
      "example_en": "The explosion was so powerful it was rocking the entire building.",
      "example_cn": "爆炸威力如此巨大，整栋大楼都在摇晃。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "awesome",
      "analysis": "“Awesome” (极好的) 是一个广泛使用的口语形容词，泛指令人敬畏或惊叹的事物，语义较泛化，可用于任何令人印象深刻的场景。而 “rocking” 更具文化语境，常特指音乐、时尚或表演中的酷炫与能量感，带有亚文化色彩。"
    },
    {
      "word_to_compare": "cool",
      "analysis": "“Cool” (酷的) 是一种更中性、更普遍的口语赞美词，表达认可或欣赏，但不强调强度或动感。“Rocking” 则更强烈、更具表现力，常暗示一种充满活力、引人注目的出色状态，比 “cool” 更具冲击力。"
    },
    {
      "word_to_compare": "shaking",
      "analysis": "“Shaking” (颤抖/震动) 强调因恐惧、寒冷或外力导致的不自主或剧烈抖动，常带有负面或生理性的含义。而 “rocking” 描述的是有节奏、可控或有目的的摆动，可以是安抚性的（如摇婴儿）或能量性的（如摇滚音乐），语义更中性甚至积极。"
    }
  ]
}