{
  "word": "rod",
  "pronunciation": "rod",
  "concise_definition": "n. 棒, 杆, 杖; v. 用杆击打",
  "forms": {
    "plural": "rods"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long, thin, straight piece of wood, metal, or other material, typically used for support, fishing, or as a tool.",
      "explanation_cn": "一根长而细的直条状木头、金属或其他材料，通常用于支撑、钓鱼或作为工具。",
      "example_en": "He cast his fishing rod into the lake and waited for a bite.",
      "example_cn": "他把钓鱼竿抛入湖中，等待鱼上钩。"
    },
    {
      "pos": "noun",
      "explanation_en": "A straight bar used as a weapon or instrument of punishment, especially in historical or literary contexts.",
      "explanation_cn": "一种用作武器或惩罚工具的直条，尤其在历史或文学语境中。",
      "example_en": "The schoolmaster wielded a wooden rod to discipline unruly students.",
      "example_cn": "校长挥舞着木棍来惩罚不守规矩的学生。"
    },
    {
      "pos": "noun",
      "explanation_en": "A rigid bar used in engineering or architecture to transmit force or provide structural support, such as a reinforcing rod in concrete.",
      "explanation_cn": "在工程或建筑中用于传递力量或提供结构支撑的刚性杆，例如混凝土中的钢筋。",
      "example_en": "The foundation was reinforced with steel rods to increase its strength.",
      "example_cn": "地基中加装了钢筋以增强其强度。"
    },
    {
      "pos": "noun",
      "explanation_en": "A unit of length equal to 5.5 yards (5.0292 meters), used in surveying and land measurement.",
      "explanation_cn": "一种长度单位，等于5.5码（5.0292米），用于测量土地。",
      "example_en": "The plot of land measured 40 rods by 20 rods.",
      "example_cn": "这块土地的尺寸为40杆乘20杆。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strike or beat someone with a rod, especially as a form of punishment.",
      "explanation_cn": "用杆子击打某人，尤指作为一种惩罚方式。",
      "example_en": "In the past, children were often rodded for misbehaving in school.",
      "example_cn": "过去，孩子们在学校调皮时常常被用棍子打。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "stick",
      "analysis": "“Stick”（棍棒）通常指天然或未经加工的树枝，语义更口语化、更随意，常用于日常语境；而 “rod” 更强调人工制造、形状规则、用途明确（如钓鱼竿、钢筋），更具技术性或正式性。"
    },
    {
      "word_to_compare": "bar",
      "analysis": "“Bar”（条、棒）泛指任何长条形固体，形状可粗可细，用途广泛（如巧克力棒、金属条）；而 “rod” 特指细长、刚性、常用于支撑或传递力的杆状物，更强调其细长和功能性，如钢筋或钓鱼竿。"
    },
    {
      "word_to_compare": "pole",
      "analysis": "“Pole”（杆、柱）通常指较长、较粗、垂直竖立的支撑结构（如电线杆、旗杆），强调其垂直性和承重功能；而 “rod” 更细、更灵活，常用于横向或操作性用途（如钓鱼、测量），不强调垂直性。"
    }
  ]
}