{
  "word": "rogue",
  "pronunciation": "rohg",
  "concise_definition": "n. 无赖, 流氓, 顽皮者; adj. 叛逆的, 脱离常规的, 顽皮的",
  "forms": {
    "plural": "rogues",
    "comparative": "rouger",
    "superlative": "roguest"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A dishonest or unscrupulous person, especially one who behaves in a deceitful or irresponsible way, often with a certain charm or charisma.",
      "explanation_cn": "指一个不诚实或无道德的人，尤其以欺骗或不负责任的方式行事，但往往带有一种迷人的魅力。",
      "example_en": "The charming rogue stole from the rich and gave to the poor, becoming a folk hero.",
      "example_cn": "这个迷人的无赖偷富济贫，成了民间英雄。"
    },
    {
      "pos": "noun",
      "explanation_en": "An animal that has left its group or herd and behaves independently or aggressively, often causing trouble.",
      "explanation_cn": "指脱离群体、独自行动并表现出攻击性或破坏性行为的动物。",
      "example_en": "A rogue elephant attacked the village after being separated from its herd.",
      "example_cn": "一头脱离象群的公象袭击了村庄。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Behaving in a way that is unpredictable, rebellious, or outside the normal rules or patterns, often causing unexpected problems.",
      "explanation_cn": "指行为不可预测、叛逆或偏离常规模式，常导致意外问题。",
      "example_en": "A rogue wave swept across the deck, injuring several sailors.",
      "example_cn": "一股 rogue 海浪席卷甲板，导致几名水手受伤。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Playfully mischievous or unconventional, often in an endearing or humorous way.",
      "explanation_cn": "指带有顽皮、不拘一格的特质，通常令人喜爱或有趣。",
      "example_en": "The rogue child hid his teacher’s chalk and grinned with delight.",
      "example_cn": "那个顽皮的孩子把老师的粉笔藏了起来，开心地笑了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "villain",
      "analysis": "“Villain”（反派）通常指在故事或道德框架中明确的邪恶角色，具有恶意和破坏意图；而 “rogue” 更强调行为的不守规矩、不可预测或叛逆，未必是纯粹邪恶，有时甚至带有魅力或正义色彩。"
    },
    {
      "word_to_compare": "rebel",
      "analysis": "“Rebel”（反叛者）通常指有意识地反抗权威、制度或规范的人，往往带有政治或意识形态动机；而 “rogue” 更侧重于个人行为的偏离常规，不一定有系统性反抗的目的，可能只是任性或自私。"
    },
    {
      "word_to_compare": "mischief",
      "analysis": "“Mischief”（恶作剧）是名词，指调皮捣蛋的行为本身，而 “rogue” 可作形容词描述这种行为的性质（如 rogue behavior），但更强调行为者的身份或性格特征，而非行为本身。一个 rogue 可能制造 mischief，但并非所有 mischief 都来自 rogue。"
    }
  ]
}