{
  "word": "rolling",
  "pronunciation": "roh·ling",
  "concise_definition": "adj. 滚动的, 波动的; n. 滚动, 滚转; v. 滚动 (roll 的现在分词)",
  "forms": {
    "base_form": "roll",
    "third_person_singular": "rolls",
    "past_tense": "rolled",
    "past_participle": "rolled",
    "present_participle": "rolling"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing something that moves by turning over and over on a surface, often continuously or smoothly.",
      "explanation_cn": "形容某物通过在表面上连续或平滑地翻转而移动的状态。",
      "example_en": "The rolling hills of Tuscany are famous for their vineyards.",
      "example_cn": "托斯卡纳连绵起伏的丘陵以其葡萄园而闻名。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing a continuous, rhythmic motion or variation, especially in sound, waves, or economic trends.",
      "explanation_cn": "形容一种持续、有节奏的运动或变化，尤指声音、波浪或经济趋势的起伏。",
      "example_en": "The rolling thunder echoed across the valley.",
      "example_cn": "隆隆的雷声在山谷中回荡。"
    },
    {
      "pos": "noun",
      "explanation_en": "The action or process of moving by rotating on a surface; also refers to a continuous sequence of events or occurrences.",
      "explanation_cn": "指通过在表面上旋转而移动的动作或过程；也可指一系列连续发生的事件或情况。",
      "example_en": "The rolling of the dice determined the winner.",
      "example_cn": "掷骰子的结果决定了胜者。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of bread that is round and often served in sandwiches or with meals.",
      "explanation_cn": "一种圆形的面包，常用于三明治或配餐食用。",
      "example_en": "She bought a fresh loaf of sourdough rolling for breakfast.",
      "example_cn": "她买了一条新鲜的酸面团圆面包当早餐。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move by turning over and over, typically on a surface or along a path.",
      "explanation_cn": "指通过在表面或路径上连续翻转而移动。",
      "example_en": "The ball started rolling down the slope.",
      "example_cn": "球开始沿着斜坡滚落。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rotating",
      "analysis": "“Rotating”（旋转）强调围绕一个固定轴心进行的圆周运动，通常不涉及位置的移动，如风扇叶片旋转。而 “rolling” 强调的是物体在接触面上的移动式翻转，如车轮滚动，既有旋转也有位移。"
    },
    {
      "word_to_compare": "surging",
      "analysis": "“Surging”（激增/汹涌）描述的是突然而强烈的上升或推进，常用于水流、情绪或经济数据，强调力量和爆发性。而 “rolling” 更温和、持续，强调节奏性和连贯性，如海浪滚动或市场趋势缓慢波动。"
    },
    {
      "word_to_compare": "bouncing",
      "analysis": "“Bouncing”（弹跳）指物体撞击表面后反弹，具有离地和短暂脱离接触的特征，如篮球弹跳。而 “rolling” 始终保持与接触面的持续接触，运动更平稳、连续，没有跳跃动作。"
    }
  ]
}