{
  "word": "roll",
  "pronunciation": "rohl",
  "concise_definition": "v. 滚动, 卷, 翻滚; n. 滚动, 卷, 面包卷, 名册",
  "forms": {
    "third_person_singular": "rolls",
    "past_tense": "rolled",
    "past_participle": "rolled",
    "present_participle": "rolling"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move by turning over and over on a surface, typically due to force or gravity, without sliding.",
      "explanation_cn": "指在表面上通过连续翻转而移动，通常由外力或重力引起，且不发生滑动。",
      "example_en": "The ball rolled down the hill and stopped at the fence.",
      "example_cn": "球从山坡上滚下来，停在了围栏边。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form something into a cylindrical or spiral shape by wrapping or turning it.",
      "explanation_cn": "指通过缠绕或转动将某物卷成圆柱形或螺旋形。",
      "example_en": "She rolled the dough into a thin sheet and then cut it into strips.",
      "example_cn": "她把面团擀成薄片，然后切成条状。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to move smoothly along a surface, often by turning or rotating it.",
      "explanation_cn": "指通过转动或旋转使某物在表面上平稳移动。",
      "example_en": "He rolled the suitcase to the check-in counter.",
      "example_cn": "他把行李箱推到值机柜台。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move the eyes or head quickly from side to side, often to express disbelief, annoyance, or impatience.",
      "explanation_cn": "指快速转动眼睛或头部，常用来表达 disbelief、烦躁或不耐烦。",
      "example_en": "She rolled her eyes when he started talking about his new car again.",
      "example_cn": "当他再次谈起他的新车时，她翻了个白眼。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, round bread, often served with meals or used for sandwiches.",
      "explanation_cn": "一种圆形的小面包，常与餐食一起食用或用于制作三明治。",
      "example_en": "He bought a fresh roll from the bakery for breakfast.",
      "example_cn": "他从面包店买了一个新鲜的面包卷当早餐。"
    },
    {
      "pos": "noun",
      "explanation_en": "A list or register of names, especially of members of an organization or participants in an event.",
      "explanation_cn": "指一份名单或登记册，尤指某个组织的成员或活动参与者的名单。",
      "example_en": "The teacher called the roll before starting the lesson.",
      "example_cn": "老师在上课前点名。"
    },
    {
      "pos": "noun",
      "explanation_en": "A long, continuous piece of material, such as paper, fabric, or film, wound around a cylinder.",
      "explanation_cn": "指缠绕在圆柱体上的一长条连续材料，如纸张、布料或胶片。",
      "example_en": "She unrolled the ancient scroll to reveal the faded writing.",
      "example_cn": "她展开那卷古老的卷轴，露出了褪色的文字。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rotate",
      "analysis": "“Rotate” (旋转) 强调围绕一个固定轴心进行圆周运动，通常用于机械或几何语境，如地球自转。而 “roll” 更强调物体在接触面上的连续翻转运动，常伴随位移，如球滚动。"
    },
    {
      "word_to_compare": "curl",
      "analysis": "“Curl” (卷曲) 指物体因弯曲或盘绕而形成不规则的螺旋状，常用于描述头发、纸张或烟雾的自然弯曲形态，强调形态的弯曲性而非动作的连续性。而 “roll” 是主动、有方向性的卷动过程，常形成规则的圆柱形。"
    },
    {
      "word_to_compare": "list",
      "analysis": "“List” (名单) 是一个更通用的词，泛指任何按顺序排列的项目，如购物清单、任务列表。而 “roll” 作为名词特指正式的人员名册，常用于教育、军事或官方场合，带有制度性和权威性。"
    }
  ]
}