{
  "word": "rolled",
  "pronunciation": "rohld",
  "concise_definition": "v. 滚动, 卷起, 翻滚, (尤指) 转动, (声音) 隆隆作响",
  "forms": {
    "base_form": "roll",
    "third_person_singular": "rolls",
    "past_tense": "rolled",
    "past_participle": "rolled",
    "present_participle": "rolling"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move by turning over and over on a surface, typically due to force or gravity, without sliding.",
      "explanation_cn": "指在表面上通过连续翻转而移动，通常由外力或重力引起，且不发生滑动。",
      "example_en": "The ball rolled down the hill and came to a stop at the fence.",
      "example_cn": "球从山坡上滚下来，停在了围栏边。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form something into a cylindrical or spiral shape by wrapping or turning it around itself.",
      "explanation_cn": "指通过缠绕或自身卷曲将某物制成圆柱形或螺旋形。",
      "example_en": "She rolled the dough into a thin sheet and then cut it into strips.",
      "example_cn": "她把面团擀成薄片，然后切成条状。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or cause to move smoothly and continuously, often with a rhythmic motion, especially in reference to vehicles or sound.",
      "explanation_cn": "指以平稳、连续的方式移动，常带有节奏感，尤用于描述车辆行驶或声音的传播。",
      "example_en": "The train rolled gently through the countryside.",
      "example_cn": "火车缓缓驶过乡村。"
    },
    {
      "pos": "verb",
      "explanation_en": "To produce a deep, continuous, resonant sound, especially one that reverberates or echoes.",
      "explanation_cn": "指发出深沉、持续、回响的声响，尤指雷声、鼓声等。",
      "example_en": "Thunder rolled across the sky as the storm approached.",
      "example_cn": "暴风雨来临前，雷声在天空中隆隆作响。"
    },
    {
      "pos": "verb",
      "explanation_en": "To turn or rotate something, especially with the hands, to change its position or orientation.",
      "explanation_cn": "指用手转动某物，以改变其位置或方向。",
      "example_en": "He rolled the dice and got a six.",
      "example_cn": "他掷骰子，掷出了六点。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rotate",
      "analysis": "“Rotate” (旋转) 强调围绕一个固定轴心进行圆周运动，常用于机械或几何语境，如地球自转、齿轮转动。而 “roll” 更强调物体在接触面上的连续翻转运动，通常涉及位移，如球滚动、车轮滚动。"
    },
    {
      "word_to_compare": "curl",
      "analysis": "“Curl” (卷曲) 指物体因弯曲或缠绕而形成不规则的螺旋或波浪状，常用于头发、纸张或肢体动作，强调形态的弯曲而非结构的完整卷绕。而 “roll” 通常形成更规则、紧密的圆柱形，如卷地毯、卷纸。"
    },
    {
      "word_to_compare": "rumble",
      "analysis": "“Rumble” (轰鸣) 专指低沉、持续、震动性的声音，常用于描述雷声、引擎声或地面震动，侧重声音本身的质感。而 “roll” 作为动词描述声音时，强调声音的连续传播和起伏感，如雷声滚滚而来，更具动态和空间延展性。"
    }
  ]
}