{
  "word": "rollers",
  "pronunciation": "roh·luhz",
  "concise_definition": "n. 滚轮, 滚筒, 滚动者, 保龄球瓶, 滚动的海浪",
  "forms": {
    "singular": "roller"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A cylindrical object that rotates on an axis, used to move, press, smooth, or transport materials or objects.",
      "explanation_cn": "指一个绕轴旋转的圆柱形物体，用于移动、压平、整平或运输材料或物体。",
      "example_en": "The paint roller applied an even coat of paint to the wall.",
      "example_cn": "油漆滚筒在墙上均匀地涂上了一层油漆。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that rolls, especially in the context of sports or physical movement (e.g., a roller skater or a roller coaster rider).",
      "explanation_cn": "指滚动的人或物，尤其用于体育或身体运动语境中（如滑旱冰者或过山车乘客）。",
      "example_en": "The roller skaters moved gracefully across the rink.",
      "example_cn": "滑旱冰的人在溜冰场上优雅地滑行。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of bowling pin, especially in the context of ten-pin bowling, where the pins are often referred to as 'rollers' in informal usage.",
      "explanation_cn": "指保龄球中的球瓶，尤其在十瓶保龄球中，非正式场合常将球瓶称为 'rollers'。",
      "example_en": "The ball knocked down all the rollers with a perfect strike.",
      "example_cn": "球一击全中，打倒了所有球瓶。"
    },
    {
      "pos": "noun",
      "explanation_en": "A long, rolling wave, especially one that moves steadily toward the shore.",
      "explanation_cn": "指持续不断、缓缓向岸边推进的长浪，尤指海浪。",
      "example_en": "The beach was quiet except for the sound of the rollers breaking on the sand.",
      "example_cn": "海滩一片宁静，只有海浪拍打沙滩的声音。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "wheel",
      "analysis": "“Wheel”（轮子）是圆形的旋转部件，通常用于承载重量并沿表面滚动，强调结构和功能的独立性，如车轮。而 “roller” 更强调圆柱形的滚动体，常用于压平、传送或作为运动装置的一部分，不一定独立承载负载。"
    },
    {
      "word_to_compare": "cylinder",
      "analysis": "“Cylinder”（圆柱体）是一个纯几何或物理形状术语，描述三维结构，不隐含运动功能。而 “roller” 是具有运动功能的圆柱体，特指能旋转并实现滚动作用的物体，如滚筒、压路机滚轮。"
    },
    {
      "word_to_compare": "skater",
      "analysis": "“Skater”（滑冰者）泛指使用冰刀或轮滑鞋滑行的人，强调的是人及其运动方式。而 “roller” 在此语境中可指代“roller skater”（滑旱冰者），但单独使用时更侧重于“轮子”或“滚动装置”，而非人。"
    }
  ]
}