{
  "word": "roller",
  "pronunciation": "roh·luhr",
  "concise_definition": "n. 滚轮, 滚筒, 辊子; (非正式) 滚轴过山车; (俚语) 爱管闲事的人",
  "forms": {
    "plural": "rollers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A cylindrical object that rotates on an axis, used to roll, press, smooth, or move materials or objects, commonly found in machinery, construction, or household tools.",
      "explanation_cn": "一种绕轴旋转的圆柱形物体，用于滚动、压平、光滑或移动材料或物体，常见于机械、建筑或家用工具中。",
      "example_en": "The painter used a roller to apply the paint evenly on the wall.",
      "example_cn": "油漆工用滚筒将油漆均匀地涂在墙上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of amusement park ride consisting of a train of cars that travels along a track with steep drops and sharp turns, also known as a roller coaster.",
      "explanation_cn": "一种游乐园设施，由一列沿带有陡坡和急转弯轨道行驶的车厢组成，也称为过山车。",
      "example_en": "We rode the roller at the fair and screamed the whole way down.",
      "example_cn": "我们在游乐园坐了过山车，一路尖叫着冲下陡坡。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is overly curious or meddlesome, especially in other people's affairs; often used informally or pejoratively.",
      "explanation_cn": "指对他人事务过度好奇或爱管闲事的人，常用于非正式或贬义语境。",
      "example_en": "Don't be such a roller—mind your own business!",
      "example_cn": "别这么爱管闲事了，管好你自己的事吧！"
    },
    {
      "pos": "noun",
      "explanation_en": "A long, cylindrical object used in specific contexts, such as a hair roller for setting curls or a roller for applying ink in printing.",
      "explanation_cn": "在特定语境中使用的长圆柱形物体，例如用于定型卷发的卷发筒，或印刷中用于上墨的墨辊。",
      "example_en": "She wrapped her hair around the rollers before going to bed.",
      "example_cn": "她睡觉前把头发卷在卷发筒上。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "wheel",
      "analysis": "“Wheel” (轮子) 是一种圆形的旋转部件，通常用于承载重量并实现移动，强调其作为交通工具或机械的移动功能。而 “roller” 更强调圆柱体的滚动动作，常用于压平、传输或固定用途，不一定用于承载或移动整个物体。"
    },
    {
      "word_to_compare": "cylinder",
      "analysis": "“Cylinder” (圆柱体) 是一个纯粹的几何形状或物理形态描述，不隐含运动或功能。而 “roller” 是一个功能性的圆柱体，特指能旋转并执行滚动、压平等任务的物体。所有 roller 都是 cylinder，但并非所有 cylinder 都是 roller。"
    },
    {
      "word_to_compare": "coaster",
      "analysis": "“Coaster” (过山车) 是 “roller” 在娱乐设施语境下的完整形式，即 “roller coaster”。单独使用 “coaster” 也可指杯垫，而 “roller” 在此语境下特指过山车的滚动机制或俗称，语义更宽泛，可指任何滚动装置。"
    }
  ]
}