{
  "word": "rolls",
  "pronunciation": "rohls",
  "concise_definition": "n. 卷, 面包卷, 滚动; v. 滚动, 卷起, 翻滚",
  "forms": {
    "singular": "roll",
    "plural": "rolls"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A cylindrical or rounded shape formed by rolling something, such as dough, paper, or fabric.",
      "explanation_cn": "指通过卷动而形成的圆柱形或球形物体，如面团、纸张或布料。",
      "example_en": "She bought a warm cinnamon roll for breakfast.",
      "example_cn": "她买了一个热乎乎的肉桂面包卷当早餐。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, round bread, typically served as a side dish or sandwich base.",
      "explanation_cn": "一种小型圆形面包，通常作为配菜或三明治的基底。",
      "example_en": "The sandwich was served on a fresh sesame roll.",
      "example_cn": "这个三明治是用新鲜的芝麻面包卷做的。"
    },
    {
      "pos": "noun",
      "explanation_en": "A list or record of names, often used in official contexts such as school or military rosters.",
      "explanation_cn": "指按顺序列出的姓名表，常用于学校、军队等正式场合的名册。",
      "example_en": "The teacher called out the names from the attendance roll.",
      "example_cn": "老师从出勤名册上点名。"
    },
    {
      "pos": "noun",
      "explanation_en": "A movement in which something turns over and over on its axis, especially along a surface.",
      "explanation_cn": "指某物沿其轴线连续翻转，尤其是在表面上滚动的动作。",
      "example_en": "The ball rolled down the hill and disappeared into the bushes.",
      "example_cn": "球滚下山坡，消失在灌木丛中。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move by turning over and over on a surface, often due to gravity or force.",
      "explanation_cn": "指由于重力或外力作用，通过在表面上连续翻转而移动。",
      "example_en": "The children watched as the marble rolled across the table.",
      "example_cn": "孩子们看着弹珠在桌面上滚动。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form something into a cylindrical shape by wrapping or turning it.",
      "explanation_cn": "指通过包裹或转动将某物卷成圆柱形。",
      "example_en": "He rolled the sleeves of his shirt up to his elbows.",
      "example_cn": "他把衬衫袖子卷到了肘部。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to move by turning it, especially in a mechanical or controlled way (e.g., rolling film, rolling dice).",
      "explanation_cn": "指通过转动使某物移动，尤其指机械或有控制的方式（如卷动胶片、掷骰子）。",
      "example_en": "The projectionist rolled the film to start the movie.",
      "example_cn": "放映员卷动胶片，开始播放电影。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "roll",
      "analysis": "“Roll” 是 “rolls” 的单数形式，两者词义完全一致，仅在数量上区分。在语义分析中，通常以单数形式作为词根，复数形式用于指多个卷状物、多个滚动动作或多个名册条目。"
    },
    {
      "word_to_compare": "rotate",
      "analysis": "“Rotate” (旋转) 强调围绕一个固定轴心进行圆周运动，通常不涉及位置的移动，如地球自转或风扇叶片旋转。而 “roll” 强调的是在表面上的连续翻转，伴随着位置的位移，如球滚动或卷轴展开。"
    },
    {
      "word_to_compare": "curl",
      "analysis": "“Curl” (卷曲) 指物体弯曲成环状或螺旋状，但不一定是圆柱形，也不一定涉及运动。例如头发卷曲或纸张边缘卷起。而 “roll” 更强调形成规则的圆柱体或持续的滚动动作，具有更强的动态性和结构性。"
    },
    {
      "word_to_compare": "list",
      "analysis": "“List” (列表) 是一个更通用的词，泛指任何按顺序排列的项目，如购物清单或任务列表。而 “roll” 作为名词时特指正式的、通常用于点名或登记的姓名列表，带有制度性或官方色彩，如花名册、选民名册。"
    }
  ]
}