{
  "word": "roma",
  "pronunciation": "roh·muh",
  "concise_definition": "n. 罗马, 罗马人, 罗马语",
  "forms": {
    "plural": "Romas"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The capital city of Italy, historically the center of the Roman Empire and a major cultural, religious, and political hub in Western civilization.",
      "explanation_cn": "意大利的首都，历史上是罗马帝国的中心，也是西方文明中重要的文化、宗教和政治中心。",
      "example_en": "Roma is home to ancient ruins like the Colosseum and the Roman Forum.",
      "example_cn": "罗马拥有斗兽场和古罗马广场等古代遗迹。"
    },
    {
      "pos": "noun",
      "explanation_en": "A member of the Romani people, an ethnic group with origins in northern India who migrated across Europe and have a distinct language and cultural traditions.",
      "explanation_cn": "指罗姆人（吉普赛人）的成员，一个起源于北印度、后迁徙至欧洲的民族，拥有独特的语言和文化传统。",
      "example_en": "Many Roma communities have preserved their traditional music and crafts despite centuries of discrimination.",
      "example_cn": "尽管历经数世纪的歧视，许多罗姆人社区仍保留了他们的传统音乐和手工艺。"
    },
    {
      "pos": "noun",
      "explanation_en": "The Latin language as spoken and written in ancient Rome, especially in its classical form; sometimes used to refer to the Romance languages derived from it.",
      "explanation_cn": "指古罗马时期所使用的拉丁语，尤指其古典形式；有时也泛指由此衍生的罗曼语族语言。",
      "example_en": "The inscriptions on the temple were written in Roma, the language of the empire.",
      "example_cn": "神庙上的铭文是以罗马帝国的语言——拉丁语写成的。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "Rome",
      "analysis": "“Rome” 是英语中对意大利首都的标准拼写，常用于地理和历史语境；而 “Roma” 是意大利语原名，在英语中多用于学术、文化或正式语境中，强调其意大利语源或历史准确性。两者指同一城市，但 “Roma” 更具语言文化自觉性。"
    },
    {
      "word_to_compare": "Romani",
      "analysis": "“Romani” 是罗姆人所使用的语言名称，也是该民族的正式自称（复数形式为 Roma）；而 “Roma” 作为名词单数时可指单个罗姆人，或作为群体的统称。在指民族时，“Roma” 是社会身份的自称，而 “Gypsy” 是外界使用的、常含贬义的旧称，应避免使用。"
    },
    {
      "word_to_compare": "Latin",
      "analysis": "“Latin” 是古罗马语言的正式英语名称，指代古典语言体系；而 “Roma” 在此语境下是拉丁语的意大利语拼写形式，仅在特定语境（如意大利语文献或文化引用）中使用。在英语中，讨论语言本身时应使用 “Latin”，而非 “Roma”。"
    }
  ]
}