{
  "word": "roman",
  "pronunciation": "roh·man",
  "concise_definition": "n. 罗马人, 罗马风格的, 小说; adj. 罗马的, 罗马风格的",
  "forms": {
    "plural": "romans"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A native or inhabitant of ancient Rome, or a person of Roman descent; also refers to the people of the Roman Empire and their cultural legacy.",
      "explanation_cn": "指古罗马的原住民或后裔，也可泛指罗马帝国的人民及其文化传承。",
      "example_en": "The ruins of Pompeii offer a glimpse into the daily life of the romans.",
      "example_cn": "庞贝古城的废墟为我们提供了了解罗马人日常生活的一扇窗口。"
    },
    {
      "pos": "noun",
      "explanation_en": "A novel, especially one written in a narrative style characteristic of the 18th or 19th century, often with complex characters and social themes; used primarily in French and English literary contexts.",
      "explanation_cn": "指一种小说，尤指18至19世纪风格的叙事性作品，常具有复杂的人物和深刻的社会主题；多用于法语和英语文学语境。",
      "example_en": "War and Peace is considered one of the greatest romans in world literature.",
      "example_cn": "《战争与和平》被认为是世界文学中最伟大的小说之一。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to ancient Rome, its people, language, architecture, or culture; often used to describe styles, scripts, or artistic forms derived from Roman traditions.",
      "explanation_cn": "与古罗马、其人民、语言、建筑或文化相关的；常用于描述源自罗马传统的风格、字体或艺术形式。",
      "example_en": "The cathedral features roman arches and thick stone walls.",
      "example_cn": "这座大教堂具有罗马式拱门和厚重的石墙。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "roman",
      "analysis": "作为‘小说’义项时，‘roman’是法语借词，在英语中特指具有文学深度和复杂结构的长篇叙事作品，与普通‘novel’相比更强调其艺术性和传统文学地位。而‘novel’是通用词，涵盖所有类型的小说。"
    },
    {
      "word_to_compare": "latin",
      "analysis": "‘Latin’ 指拉丁语或与拉丁语相关的语言、文字系统，是罗马人使用的语言；而 ‘roman’ 指的是罗马人本身或其文化产物（如建筑、字体）。两者常被混淆，但‘roman’是文化/民族指称，‘latin’是语言指称。"
    },
    {
      "word_to_compare": "greek",
      "analysis": "‘Greek’ 指古希腊人或其文化，与‘roman’形成对比。罗马文化深受希腊影响，但‘roman’强调罗马自身的制度、法律、工程和帝国组织，而‘greek’更侧重哲学、神话与艺术理想。在建筑风格上，‘roman’风格更重实用与宏伟，‘greek’风格更重比例与和谐。"
    }
  ]
}