{
  "word": "romantic",
  "pronunciation": "roh·man·tik",
  "concise_definition": "adj. 浪漫的, 多情的, 理想化的; n. 浪漫主义者",
  "forms": {
    "comparative": "more romantic",
    "superlative": "most romantic"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characterized by feelings of love, passion, and emotional idealism, often involving gestures or settings that evoke deep affection or nostalgia.",
      "explanation_cn": "与爱情、激情和情感理想主义相关，常涉及能唤起深厚情感或怀旧情绪的举动或场景。",
      "example_en": "They spent the evening at a candlelit restaurant, enjoying a romantic dinner.",
      "example_cn": "他们在一个烛光晚餐的餐厅度过夜晚，享受着浪漫的晚餐。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Tending to view things in an idealized or emotionally exaggerated way, often ignoring practical realities.",
      "explanation_cn": "倾向于以理想化或情感夸张的方式看待事物，常常忽视现实的可行性。",
      "example_en": "His romantic notion of becoming a famous writer ignored the harsh realities of the publishing industry.",
      "example_cn": "他想成为著名作家的浪漫幻想忽视了出版业严酷的现实。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to the literary or artistic movement of Romanticism, which emphasized emotion, nature, and individualism over reason and classical forms.",
      "explanation_cn": "与浪漫主义文学或艺术运动相关，该运动强调情感、自然和个人主义，而非理性与古典形式。",
      "example_en": "The painting’s dramatic sky and solitary figure reflect a romantic style.",
      "example_cn": "这幅画中戏剧性的天空和孤独的人物体现了浪漫主义风格。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is guided by ideals of love, beauty, or adventure rather than by practical concerns.",
      "explanation_cn": "指受爱情、美或冒险理想驱动，而非受实际利益影响的人。",
      "example_en": "She’s a romantic at heart—always dreaming of grand gestures and soulmates.",
      "example_cn": "她骨子里是个浪漫主义者——总梦想着宏大的表白和灵魂伴侣。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "loving",
      "analysis": "“Loving” (充满爱的) 强调对他人真挚、温暖的情感表达，侧重于行为的关怀与体贴，如 loving parents。而 “romantic” 更强调情感的诗意化、理想化和仪式感，常与特定情境（如烛光晚餐、情书）相关，不一定包含日常的关爱。"
    },
    {
      "word_to_compare": "passionate",
      "analysis": "“Passionate” (充满激情的) 指强烈的情感或热情，可用于爱情、信仰、事业等广泛领域，强调强度而非形式。而 “romantic” 特指爱情或理想化的情感表达，常带有优雅、梦幻或感性的色彩，不必然激烈。"
    },
    {
      "word_to_compare": "idealistic",
      "analysis": "“Idealistic” (理想主义的) 指追求完美或抽象理想，常带有脱离现实的意味，适用于政治、社会或哲学层面。而 “romantic” 在此语境下特指以情感和美感为基准的理想化，尤其在人际关系或艺术表达中，更具感性与个人色彩。"
    }
  ]
}