{
  "word": "rome",
  "pronunciation": "rohm",
  "concise_definition": "n. 罗马（意大利首都）, 罗马文明, 罗马天主教",
  "forms": {
    "plural": "Romes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The capital city of Italy, historically the center of the Roman Empire and a major hub of Western civilization, known for its ancient ruins, art, architecture, and religious significance as the seat of the Papacy.",
      "explanation_cn": "意大利的首都，历史上是罗马帝国的中心，也是西方文明的重要枢纽，以其古代遗迹、艺术、建筑以及作为教皇驻地的宗教意义而闻名。",
      "example_en": "We spent a week exploring the Colosseum, the Vatican, and other landmarks in Rome.",
      "example_cn": "我们花了一周时间游览了罗马的斗兽场、梵蒂冈及其他地标。"
    },
    {
      "pos": "noun",
      "explanation_en": "The ancient Roman civilization, including its political system, law, language, culture, and military power, which profoundly influenced modern Western societies.",
      "explanation_cn": "指古罗马文明，包括其政治制度、法律、语言、文化与军事力量，对现代西方社会产生了深远影响。",
      "example_en": "The Latin language and Roman law are foundational elements of modern European culture.",
      "example_cn": "拉丁语和罗马法是现代欧洲文化的基础要素。"
    },
    {
      "pos": "noun",
      "explanation_en": "The Roman Catholic Church or its authority, especially in contrast to other Christian denominations; often used in phrases like 'the Roman Church' or 'Roman obedience'.",
      "explanation_cn": "指罗马天主教会或其权威，常用于与其他基督教派别相对比；常见于如‘罗马教会’或‘罗马服从’等表达中。",
      "example_en": "The Protestant Reformation challenged the authority of Rome over religious doctrine.",
      "example_cn": "宗教改革挑战了罗马在教义上的权威。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "italy",
      "analysis": "“Italy” (意大利) 是一个现代国家的名称，涵盖整个亚平宁半岛及其政治、地理和文化实体；而 “Rome” 仅指其首都或其历史象征意义。虽然罗马是意大利的一部分，但“Rome”承载着更深厚的历史与文明内涵，远超其作为城市或行政中心的地理意义。"
    },
    {
      "word_to_compare": "empire",
      "analysis": "“Empire” (帝国) 是一种政治体制或统治形式，强调权力的集中与扩张；而 “Rome” 是一个具体的历史实体，曾建立并代表过一个帝国。可以说，罗马是帝国的典型代表，但“empire”是抽象概念，而“Rome”是具体名词。"
    },
    {
      "word_to_compare": "vatican",
      "analysis": "“Vatican” (梵蒂冈) 是位于罗马城内的一个独立主权国家，为天主教会的中心；而 “Rome” 是一个更大的城市，包含梵蒂冈在内。虽然两者都与天主教密切相关，但“Rome”涵盖更广泛的历史、文化与政治维度，而“Vatican”专指教廷的行政与宗教核心。"
    }
  ]
}