{
  "word": "root",
  "pronunciation": "roht",
  "concise_definition": "n. 根, 根源, 根基; v. 生根, 扎根, 深植",
  "forms": {
    "third_person_singular": "roots",
    "past_tense": "rooted",
    "past_participle": "rooted",
    "present_participle": "rooting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The part of a plant that grows underground, absorbing water and nutrients and anchoring the plant to the soil.",
      "explanation_cn": "植物生长在地下的部分，用于吸收水分和养分，并将植物固定在土壤中。",
      "example_en": "The tree's roots spread widely to stabilize the soil.",
      "example_cn": "这棵树的根系广泛延伸，以稳固土壤。"
    },
    {
      "pos": "noun",
      "explanation_en": "The origin or source of something, often referring to the fundamental cause or basis of a condition, problem, or idea.",
      "explanation_cn": "某事物的起源或来源，常指某种状况、问题或观念的根本原因或基础。",
      "example_en": "Poverty is often the root cause of crime in urban areas.",
      "example_cn": "贫困往往是城市地区犯罪的根本原因。"
    },
    {
      "pos": "noun",
      "explanation_en": "In mathematics, a number that, when multiplied by itself a certain number of times, produces a given number (e.g., the square root of 9 is 3).",
      "explanation_cn": "在数学中，指一个数，当它自乘若干次后能得到指定的数（例如，9 的平方根是 3）。",
      "example_en": "The square root of 64 is 8.",
      "example_cn": "64 的平方根是 8。"
    },
    {
      "pos": "verb",
      "explanation_en": "To establish firm foundations or become deeply embedded in a place or system, often implying long-term stability or attachment.",
      "explanation_cn": "指在某地或某体系中牢固建立根基，常暗示长期的稳定或依附关系。",
      "example_en": "The family has rooted themselves in this community for over fifty years.",
      "example_cn": "这个家庭已在该社区扎根超过五十年。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cheer enthusiastically for a team or person, especially in a sports context.",
      "explanation_cn": "在体育语境中，热情地为某队或某人加油助威。",
      "example_en": "The crowd rooted for the underdog team until the final whistle.",
      "example_cn": "观众们一直为这支弱队加油，直到终场哨声响起。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "source",
      "analysis": "“Source”（来源）泛指任何事物的起始点或出处，可以是抽象的（如信息来源）或具体的（如水源）。“Root” 更强调根本性、深层的、有时是隐性的起源，常用于分析问题的深层原因，语气更深刻、更具本质性。"
    },
    {
      "word_to_compare": "base",
      "analysis": "“Base”（基础）指支撑某物的底层结构或平台，常用于物理或组织结构中（如建筑基础、基地）。“Root” 则更强调动态的生长过程和内在联系，常用于比喻性语境，如文化根源、心理根源，更具生命力和延续性。"
    },
    {
      "word_to_compare": "origin",
      "analysis": "“Origin”（起源）侧重于事物最初出现的时间或地点，常用于历史、种族或事件的开端。“Root” 不仅指起源，还隐含持续影响和深层联系，强调该起源至今仍发挥作用，如‘root causes’（根本原因）比‘origin causes’更自然、更常用。"
    }
  ]
}