{
  "word": "rosario",
  "pronunciation": "roh·zah·ree·oh",
  "concise_definition": "n. 玫瑰经, 玫瑰念珠, 人名（西班牙语/意大利语）",
  "forms": {
    "plural": "rosarios"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A string of prayer beads used in the Catholic tradition to recite the Rosary, a set of devotional prayers honoring the Virgin Mary, typically consisting of five or fifteen decades of Hail Marys, each preceded by an Our Father and followed by a Glory Be.",
      "explanation_cn": "天主教传统中用于诵念《玫瑰经》的一串念珠，通常由五组或十五组‘十遍’圣母经组成，每组以一遍《天主经》开始，以一遍《光荣颂》结束，用以敬礼圣母玛利亚。",
      "example_en": "She held her rosario tightly as she knelt in silent prayer.",
      "example_cn": "她跪在那儿，紧紧握着玫瑰念珠，默默祈祷。"
    },
    {
      "pos": "noun",
      "explanation_en": "The set of prayers recited using the rosary beads, consisting of meditations on key events in the lives of Jesus and Mary, divided into Joyful, Sorrowful, Glorious, and Luminous Mysteries.",
      "explanation_cn": "指使用玫瑰念珠诵念的一整套祷文，内容为默想耶稣与圣母生平中的关键事件，分为欢喜、痛苦、荣福和光明五端奥迹。",
      "example_en": "Every evening, the family gathered to pray the rosario together.",
      "example_cn": "每天晚上，全家人都聚在一起诵念玫瑰经。"
    },
    {
      "pos": "noun",
      "explanation_en": "A proper noun used as a given name or surname in Spanish- and Italian-speaking cultures, often derived from the religious term and associated with devotion to the Virgin Mary.",
      "explanation_cn": "在西班牙语和意大利语文化中用作人名（名或姓），源自宗教术语，常与对圣母玛利亚的虔诚敬礼相关。",
      "example_en": "Rosario is a common first name in Argentina and the Philippines.",
      "example_cn": "在阿根廷和菲律宾，Rosario 是一个常见的名字。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "prayer beads",
      "analysis": "“Prayer beads”（祈祷念珠）是一个泛称，指任何宗教传统中用于计数祈祷次数的念珠，如伊斯兰教的tasbih、佛教的念珠等。而 “rosario” 特指天主教用于诵念《玫瑰经》的特定念珠，具有固定的结构和祷文内容，具有明确的神学意义。"
    },
    {
      "word_to_compare": "chaplet",
      "analysis": "“Chaplet”（小念珠串）是天主教中泛指任何非标准玫瑰经的祈祷念珠形式，如圣心 chaplet 或慈悲 chaplet。而 “rosario” 专指以十五端奥迹为基础、结构固定的玫瑰经念珠，是 chaplet 中最著名和最广泛使用的一种。"
    },
    {
      "word_to_compare": "name",
      "analysis": "作为人名时，‘Rosario’ 与普通名词 ‘name’ 不同，它承载着强烈的宗教文化内涵，常被父母为孩子取名以表达对圣母的感恩或祈求庇佑，而一般意义上的 ‘name’ 仅指语言符号，无特定宗教或象征意义。"
    }
  ]
}