{
  "word": "routine",
  "pronunciation": "roo·teen",
  "concise_definition": "n. 常规, 日常事务; v. 以常规方式处理",
  "forms": {
    "plural": "routines",
    "third_person_singular": "routines",
    "past_tense": "routined",
    "past_participle": "routined",
    "present_participle": "routining"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A fixed, regular, and often unvarying sequence of actions or procedures performed regularly, especially as part of daily life or work.",
      "explanation_cn": "指一种固定、规律且通常不变的行为序列或程序，常作为日常生活或工作的一部分。",
      "example_en": "Her morning routine includes jogging, breakfast, and reading the newspaper.",
      "example_cn": "她的晨间例行程序包括慢跑、吃早餐和读报纸。"
    },
    {
      "pos": "noun",
      "explanation_en": "A set of standardized performances, especially in entertainment, such as a comedian's repeated jokes or a dancer's choreographed sequence.",
      "explanation_cn": "指一套标准化的表演内容，尤其在娱乐领域，如喜剧演员重复使用的段子或舞者编排好的动作序列。",
      "example_en": "The comedian's routine had not changed in ten years, but the audience still laughed.",
      "example_cn": "这位喜剧演员的段子十年未变，但观众依然笑得前仰后合。"
    },
    {
      "pos": "verb",
      "explanation_en": "To subject someone or something to a routine, especially in a mechanical or unthinking way, often implying lack of individual attention.",
      "explanation_cn": "指以机械或无意识的方式将某人或某事纳入常规处理，常暗示缺乏个性化关注。",
      "example_en": "The hospital tends to routined patients with minor injuries, delaying proper diagnosis.",
      "example_cn": "这家医院往往把轻微受伤的病人当作常规病例处理，导致诊断延误。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "habit",
      "analysis": "“Habit”（习惯）强调个人无意识中重复的行为模式，通常带有心理或生理上的依赖性，如吸烟、咬指甲。而 “routine” 更侧重于有意识安排的、结构化的日常程序，常用于工作或生活系统中，更具计划性和外显性。"
    },
    {
      "word_to_compare": "procedure",
      "analysis": "“Procedure”（程序/流程）强调为达成特定目标而必须遵循的正式步骤，通常具有权威性、规范性和强制性，如手术流程或法律程序。而 “routine” 更偏向日常性、重复性，不一定有正式规则约束，更生活化。"
    },
    {
      "word_to_compare": "custom",
      "analysis": "“Custom”（习俗）指一个群体或文化中长期形成的传统行为方式，具有社会性和历史性，如节日庆典或婚丧礼仪。而 “routine” 是个体或组织的日常行为安排，不具文化传承性，更偏向功能性而非象征性。"
    }
  ]
}