{
  "word": "rout",
  "pronunciation": "rout",
  "concise_definition": "n. 惨败, 溃败; v. 彻底击败, 使溃散",
  "forms": {
    "third_person_singular": "routs",
    "past_tense": "routed",
    "past_participle": "routed",
    "present_participle": "routing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A decisive and overwhelming defeat of a group, especially in a military or competitive context, often involving disorderly retreat or collapse.",
      "explanation_cn": "指在军事或竞技背景下，一方遭受的决定性且压倒性的失败，通常伴随着混乱的撤退或全面崩溃。",
      "example_en": "The home team suffered a humiliating rout at the hands of their rivals.",
      "example_cn": "主队在对手面前遭遇了耻辱性的惨败。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large, noisy, and often disorderly crowd or gathering, especially one that is rowdy or celebratory.",
      "explanation_cn": "指一大群喧闹、混乱的人群，尤指喧闹庆祝或骚动的集会（多用于口语或文学语境）。",
      "example_en": "The festival ended in a drunken rout, with people dancing in the streets.",
      "example_cn": "节日以一场醉酒狂欢结束，人们在街头载歌载舞。"
    },
    {
      "pos": "verb",
      "explanation_en": "To defeat an opponent completely and decisively, often causing them to flee or lose all organization.",
      "explanation_cn": "指彻底而决定性地击败对手，通常使其溃不成军、仓皇逃窜或丧失组织性。",
      "example_en": "The army routed the enemy forces before dawn.",
      "example_cn": "军队在黎明前彻底击溃了敌军。"
    },
    {
      "pos": "verb",
      "explanation_en": "To drive out or disperse a group of people or animals, often forcefully or noisily.",
      "explanation_cn": "指强行驱散或赶走一群人或动物，常带有喧闹或暴力的意味。",
      "example_en": "The police routed the protesters from the square.",
      "example_cn": "警察将抗议者从广场上驱散了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "defeat",
      "analysis": "“Defeat” (击败) 是一个通用词，泛指在竞争或战斗中获胜，程度可轻可重。而 “rout” 强调的是一种压倒性、彻底的失败，通常伴随溃散和混乱，语义强度远高于 “defeat”。"
    },
    {
      "word_to_compare": "crush",
      "analysis": "“Crush” (粉碎/彻底击溃) 与 “rout” 在军事语境中常可互换，但 “crush” 更强调力量上的碾压，常用于比喻（如 crush competition）；而 “rout” 更侧重于组织瓦解和溃逃的动态过程，更具画面感。"
    },
    {
      "word_to_compare": "dispel",
      "analysis": "“Dispel” (驱散) 通常用于抽象事物（如疑虑、黑暗）或温和地驱赶人群，语气中性或正面；而 “rout” 用于驱散时带有暴力、混乱和强制的意味，语义更激烈，常用于描述群体性事件的失控。"
    }
  ]
}