{
  "word": "royale",
  "pronunciation": "rwa·yahl",
  "concise_definition": "adj. 王室的, 皇家的; n. 皇家版, 豪华版",
  "forms": {
    "comparative": "more royal",
    "superlative": "most royal"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to a monarch or a royal family; characterized by grandeur, luxury, or elegance associated with royalty.",
      "explanation_cn": "与君主或王室相关的；具有与王室相关的宏伟、奢华或优雅特征。",
      "example_en": "The palace was decorated in royal blue and gold, exuding a royal aura.",
      "example_cn": "宫殿以皇家蓝与金色装饰，散发着王室的气派。"
    },
    {
      "pos": "noun",
      "explanation_en": "A version or variant of something that is specially designed to be luxurious, premium, or associated with royalty, often used in branding for products like cars, drinks, or games.",
      "explanation_cn": "指某种特别设计为奢华、高端或与王室相关的版本，常用于汽车、饮品或游戏等产品的品牌命名。",
      "example_en": "The new car model is called the 'Ferrari Royale'—a limited edition with hand-stitched leather and gold trim.",
      "example_cn": "这款新车名为‘法拉利皇家版’——一款限量版，配有手工缝制皮革和金色装饰。"
    },
    {
      "pos": "noun",
      "explanation_en": "In card games, particularly in French-speaking regions, a 'royale' refers to a sequence of the highest-ranking cards in a suit (e.g., 10, Jack, Queen, King, Ace), especially when used in the game of Belote.",
      "explanation_cn": "在纸牌游戏中，尤其在法语地区，指某一花色中最高点数的连续牌（如10、J、Q、K、A），常用于贝尔特（Belote）等游戏。",
      "example_en": "She won the hand with a king-queen-ten-ace royal in spades.",
      "example_cn": "她用黑桃的K-Q-10-A皇家顺子赢得了这一局。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "royal",
      "analysis": "“Royal” 是标准形容词，广泛用于描述与王室相关的事物，如 royal family、royal decree。而 “royale” 是其法语借词形式，常用于品牌、营销或特定文化语境中，带有更强烈的奢华、异域或精致的语感，如 ‘Coca-Cola Royale’ 或 ‘Burger Royale’，在日常英语中较少作为形容词直接使用。"
    },
    {
      "word_to_compare": "luxurious",
      "analysis": "“Luxurious” (奢华的) 强调物质上的富足、舒适和昂贵，但不必然与王室有关。而 “royale” 不仅暗示奢华，还附加了历史、血统、权威和传统等王室象征意义，语义层次更丰富。"
    },
    {
      "word_to_compare": "prestigious",
      "analysis": "“Prestigious” (声望卓著的) 指因成就、地位或声誉而受人尊敬，如 prestigious university。它侧重社会评价，而 “royale” 侧重出身、血统和视觉象征，即使没有实际权力，也能通过命名传递高贵感。"
    }
  ]
}