{
  "word": "rub",
  "pronunciation": "ruhb",
  "concise_definition": "v. 摩擦, 擦拭; n. 摩擦, 摩擦声, 障碍",
  "forms": {
    "third_person_singular": "rubs",
    "past_tense": "rubbed",
    "past_participle": "rubbed",
    "present_participle": "rubbing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move one surface over another with pressure, typically to clean, polish, or generate heat through friction.",
      "explanation_cn": "指以压力使一个表面在另一个表面上移动，通常用于清洁、抛光或通过摩擦产生热量。",
      "example_en": "She rubbed the stain with soap until it disappeared.",
      "example_cn": "她用肥皂反复擦拭污渍，直到它消失。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause discomfort or irritation by persistent friction or pressure, often metaphorically referring to interpersonal tension.",
      "explanation_cn": "指因持续的摩擦或压力而引起不适或恼怒，常用于隐喻人际关系中的矛盾或摩擦。",
      "example_en": "His constant criticism began to rub me the wrong way.",
      "example_cn": "他不断的批评让我感到很不爽。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of rubbing or the friction produced by it; also refers to a difficulty or obstacle in a situation.",
      "explanation_cn": "指摩擦的动作或由此产生的摩擦感；也可指某种情况中的困难或障碍。",
      "example_en": "There's a slight rub in the plan — we don't have enough funding.",
      "example_cn": "这个计划有个小障碍——我们的资金不够。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of massage or application of pressure to relieve tension or pain, especially in animals or muscles.",
      "explanation_cn": "指一种通过按压来缓解紧张或疼痛的按摩方式，尤用于动物或肌肉。",
      "example_en": "The vet gave the horse a thorough rub after the race.",
      "example_cn": "兽医在赛马后给它做了彻底的按摩。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "scrape",
      "analysis": "“Scrape”（刮擦）强调用硬物削去或剥离表面物质，常带有破坏性或去除杂质的含义，如刮掉油漆或刮土豆皮。而 “rub” 更侧重于来回摩擦，不一定造成损伤，更多用于清洁、温暖或缓解。"
    },
    {
      "word_to_compare": "chafe",
      "analysis": "“Chafe”（磨破、摩擦发炎）特指因持续摩擦而导致皮肤或材料受损、发红或疼痛，是 “rub” 的负面结果。所有 chafe 都是 rub，但并非所有 rub 都会导致 chafe。"
    },
    {
      "word_to_compare": "friction",
      "analysis": "“Friction”（摩擦力）是物理学中的抽象名词，指两个接触面之间阻碍相对运动的力。而 “rub” 是具体的动作或行为，是产生 friction 的方式。前者是原理，后者是实践。"
    }
  ]
}