{
  "word": "rubber",
  "pronunciation": "ruhb·uhr",
  "concise_definition": "n. 橡胶, 橡皮; v. 橡胶覆盖, 用橡皮擦",
  "forms": {
    "plural": "rubbers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A flexible, elastic material made from the sap of rubber trees or synthetic compounds, widely used in tires, seals, gloves, and other products requiring resilience and water resistance.",
      "explanation_cn": "一种由橡胶树汁液或合成化合物制成的柔韧、有弹性的材料，广泛用于轮胎、密封圈、手套等需要韧性和防水性的产品中。",
      "example_en": "The car's tires are made of high-quality rubber to ensure good traction on wet roads.",
      "example_cn": "汽车轮胎采用高品质橡胶制成，以确保在湿滑路面上的良好抓地力。"
    },
    {
      "pos": "noun",
      "explanation_en": "An eraser, especially one made of rubber, used to remove pencil marks from paper.",
      "explanation_cn": "一种用于擦除纸张上铅笔痕迹的橡皮擦，尤指由橡胶制成的擦除工具。",
      "example_en": "She reached for her rubber to correct the mistake in her drawing.",
      "example_cn": "她伸手去拿橡皮擦，想擦掉画中的错误。"
    },
    {
      "pos": "noun",
      "explanation_en": "A condom, especially in British English.",
      "explanation_cn": "（英式英语）指安全套。",
      "example_en": "He always carries a rubber when he goes out.",
      "example_cn": "他外出时总是随身携带安全套。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover or coat something with rubber, often for insulation or protection.",
      "explanation_cn": "用橡胶覆盖或涂覆某物，通常用于绝缘或保护。",
      "example_en": "The wires were rubber-coated to prevent electric shocks.",
      "example_cn": "这些电线用橡胶包裹，以防触电。"
    },
    {
      "pos": "verb",
      "explanation_en": "To erase something with a rubber, especially pencil marks.",
      "explanation_cn": "用橡皮擦除某物，尤指铅笔痕迹。",
      "example_en": "He rubbed out the wrong answer and rubbered in the correct one.",
      "example_cn": "他擦掉了错误的答案，然后写上了正确的答案。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "latex",
      "analysis": "“Latex”（天然乳胶）是橡胶的一种天然来源，特指从橡胶树中提取的乳白色液体，常用于制造薄型橡胶制品如手套或避孕套。而 “rubber” 是更广泛的术语，包括天然橡胶和合成橡胶，应用范围更广。"
    },
    {
      "word_to_compare": "eraser",
      "analysis": "“Eraser” 是 “rubber” 在美式英语中表示橡皮擦的正式说法，两者在功能上完全相同，但 “eraser” 更中性、通用，而 “rubber” 在英式英语中是日常用语，但在美式英语中可能引起歧义（因有安全套含义）。"
    },
    {
      "word_to_compare": "synthetic",
      "analysis": "“Synthetic”（合成的）是一个形容词，描述非天然制造的材料，常用于修饰橡胶（如 synthetic rubber）。而 “rubber” 本身是名词，指材料实体。合成橡胶是橡胶的一种类型，但不是所有橡胶都是合成的。"
    }
  ]
}