{
  "word": "rubbed",
  "pronunciation": "ruhb-d",
  "concise_definition": "v. 摩擦, 擦, 揉 (rub 的过去式和过去分词)",
  "forms": {
    "base_form": "rub",
    "third_person_singular": "rubs",
    "present_participle": "rubbing",
    "past_tense": "rubbed",
    "past_participle": "rubbed"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move one surface over another with pressure, typically in a back-and-forth or circular motion, often to clean, soothe, or generate heat.",
      "explanation_cn": "指以压力使一个表面在另一个表面上来回或旋转移动，通常用于清洁、缓解不适或产生热量。",
      "example_en": "She rubbed her hands together to warm them up in the cold.",
      "example_cn": "她在寒冷中搓手取暖。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause wear, damage, or removal of a surface through friction, often unintentionally or over time.",
      "explanation_cn": "指通过摩擦导致表面磨损、损坏或剥落，通常是无意或长期作用的结果。",
      "example_en": "The constant rubbing of the rope against the rock had worn a deep groove.",
      "example_cn": "绳子长期摩擦岩石，磨出了一道深深的凹槽。"
    },
    {
      "pos": "verb",
      "explanation_en": "To apply pressure or motion to something in order to transfer or spread a substance, such as ointment, paint, or lotion.",
      "explanation_cn": "指通过按压或移动将某种物质（如药膏、油漆或乳液）涂抹或扩散到某物表面。",
      "example_en": "He rubbed the ointment gently into his sore muscles.",
      "example_cn": "他轻轻将药膏揉进酸痛的肌肉里。"
    },
    {
      "pos": "verb",
      "explanation_en": "To have a close or intimate relationship with someone, often implying influence or association (used idiomatically in phrases like 'rubbed shoulders with').",
      "explanation_cn": "指与某人关系密切或有交往，常用于习语中表示与重要人物有联系或接触。",
      "example_en": "As a journalist, she had rubbed shoulders with politicians and celebrities.",
      "example_cn": "作为一名记者，她曾与政界人士和名人有过交往。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "scrubbed",
      "analysis": "“Scrubbed”（擦洗）强调用力、彻底地清洁表面，通常使用刷子或粗糙工具，带有清除污垢的明确目的。而 “rubbed” 更泛指任何形式的摩擦动作，不一定涉及清洁，也可能用于按摩、加热或磨损。"
    },
    {
      "word_to_compare": "chafed",
      "analysis": "“Chafed”（磨破/擦伤）特指因反复摩擦导致皮肤或材料受损、发红或疼痛，是 “rubbed” 的负面结果之一。所有 “chafed” 都是 “rubbed”，但并非所有 “rubbed” 都会导致 “chafed”。"
    },
    {
      "word_to_compare": "massaged",
      "analysis": "“Massaged”（按摩）是一种有目的、有节奏、通常用于放松或治疗的揉压动作，强调手法的专业性和舒适性。而 “rubbed” 更中性，可以是无意识、粗暴或功能性的摩擦，不必然带有治疗意图。"
    }
  ]
}