{
  "word": "ruin",
  "pronunciation": "roo·in",
  "concise_definition": "n. 废墟, 毁灭; v. 毁坏, 毁灭, 使破产",
  "forms": {
    "third_person_singular": "ruins",
    "past_tense": "ruined",
    "past_participle": "ruined",
    "present_participle": "ruining"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The remains of a building, city, or structure that has been destroyed or decayed over time, often evoking a sense of historical loss or decay.",
      "explanation_cn": "指因时间推移或灾难而被摧毁或荒废的建筑物、城市或结构的残骸，常带有历史失落或衰败的意味。",
      "example_en": "The ancient temple lies in ruins after centuries of neglect and earthquakes.",
      "example_cn": "这座古庙历经数个世纪的忽视和地震，如今已成废墟。"
    },
    {
      "pos": "noun",
      "explanation_en": "Complete destruction or downfall, especially of a person’s life, fortune, or reputation.",
      "explanation_cn": "指彻底的毁灭或垮台，尤指一个人的生活、财富或声誉的崩塌。",
      "example_en": "His gambling addiction led to his financial ruin.",
      "example_cn": "他的赌博成瘾导致了经济上的破产。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause severe damage or destruction to something, rendering it unusable, broken, or non-functional.",
      "explanation_cn": "指对某物造成严重破坏，使其无法使用、破损或失去功能。",
      "example_en": "The flood ruined the basement and all the stored belongings.",
      "example_cn": "洪水淹没了地下室，毁掉了所有存放的物品。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause the downfall or destruction of someone’s success, health, or moral standing, often through bad decisions or external forces.",
      "explanation_cn": "指因错误决定或外部力量导致某人的成功、健康或道德地位的崩溃。",
      "example_en": "The scandal ruined her career overnight.",
      "example_cn": "这起丑闻一夜之间毁掉了她的事业。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "destroy",
      "analysis": "“Destroy” (摧毁) 强调彻底、不可逆的消灭，常用于物理或功能上的完全消除，语气更强烈、更直接。而 “ruin” 可以指部分破坏或逐渐衰败，有时保留残骸，且常用于抽象概念（如名誉、生活）的崩塌。"
    },
    {
      "word_to_compare": "demolish",
      "analysis": "“Demolish” (拆除) 通常指有计划地、物理性地拆毁建筑物，带有明确的行动意图，多用于工程或军事语境。而 “ruin” 更广泛，可指自然衰败、意外事故或道德堕落导致的破坏，不一定是人为或彻底的。"
    },
    {
      "word_to_compare": "wreck",
      "analysis": "“Wreck” (毁坏) 常用于交通工具（如船只、汽车）的严重损毁，或比喻性地形容混乱状态（如一场派对被搞砸了）。它强调突发性、剧烈的破坏，而 “ruin” 更侧重于结果的长期性与全面性，尤其在经济或社会层面。"
    }
  ]
}