{
  "word": "ruined",
  "pronunciation": "roo·ind",
  "concise_definition": "adj. 毁坏的, 破败的; v. 毁坏, 毁掉, 使破产",
  "forms": {
    "base_form": "ruin",
    "past_tense": "ruined",
    "past_participle": "ruined",
    "present_participle": "ruining",
    "plural_noun": "ruins"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "In a state of severe damage or decay, often beyond repair; describing something that has been destroyed or rendered unusable.",
      "explanation_cn": "处于严重损坏或衰败的状态，通常无法修复；描述某物已被摧毁或变得无法使用。",
      "example_en": "The old castle was a ruined structure, overgrown with ivy and crumbling under the weight of time.",
      "example_cn": "这座古老的城堡已成废墟，被常春藤覆盖，在时光的重压下逐渐崩塌。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used informally to describe someone who is extremely tired, exhausted, or emotionally drained.",
      "explanation_cn": "非正式用法，形容人极度疲惫、筋疲力尽或情绪耗尽。",
      "example_en": "After working three shifts back-to-back, I was completely ruined.",
      "example_cn": "连续上了三个班后，我彻底垮了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause severe and often irreversible damage to something, destroying its structure, function, or value.",
      "explanation_cn": "对某物造成严重且通常是不可逆的损害，破坏其结构、功能或价值。",
      "example_en": "The flood ruined the basement and destroyed all the stored furniture.",
      "example_cn": "洪水淹没了地下室，毁掉了所有存放的家具。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause someone's financial, social, or personal life to collapse or fail completely.",
      "explanation_cn": "使某人的财务、社会或个人生活彻底崩溃或失败。",
      "example_en": "His gambling habit ruined him financially and alienated his family.",
      "example_cn": "他的赌博恶习使他倾家荡产，并疏远了家人。"
    },
    {
      "pos": "verb",
      "explanation_en": "To spoil or destroy the enjoyment, quality, or success of something, often unexpectedly.",
      "explanation_cn": "意外地破坏、毁掉某事的愉悦、质量或成功。",
      "example_en": "The loud noise during the movie ruined the entire experience.",
      "example_cn": "电影期间的噪音破坏了整个观影体验。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "destroyed",
      "analysis": "“Destroyed” (摧毁) 强调彻底的物理性消灭，常用于建筑物、物体或生命体的完全灭失，语气更强烈、更绝对。而 “ruined” 可以指功能或价值的丧失，即使物体仍存在，如一座被烧毁但骨架尚存的建筑，可以说 ‘ruined’ 而不一定是 ‘destroyed’。"
    },
    {
      "word_to_compare": "damaged",
      "analysis": "“Damaged” (损坏) 指部分受损，通常仍可修复或使用，程度较轻。而 “ruined” 暗示损害已达到无法挽回或失去原有用途的程度，是损坏的极端形式。"
    },
    {
      "word_to_compare": "spoiled",
      "analysis": "“Spoiled” (毁坏/变质) 多用于食物、计划或孩子的性格，常带有‘因过度宠爱或不当处理而变质’的意味，语气较轻或带情感色彩。而 ‘ruined’ 更强调灾难性后果，适用于更严重的损失，如事业、健康或财产。"
    }
  ]
}