{
  "word": "rules",
  "pronunciation": "roolz",
  "concise_definition": "n. 规则, 规章, 法则; v. 统治, 决定, 裁决",
  "forms": {
    "singular": "rule"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A prescribed guide for conduct or action, established by an authority or agreed upon by a group, to ensure order, fairness, or consistency in behavior or processes.",
      "explanation_cn": "由权威机构制定或群体共同商定的指导行为或行动的规范，旨在确保行为或过程中的秩序、公平性或一致性。",
      "example_en": "The school has strict rules about punctuality and dress code.",
      "example_cn": "学校对守时和着装有严格的规定。"
    },
    {
      "pos": "noun",
      "explanation_en": "A general principle or law that governs a particular system, such as in mathematics, grammar, or nature, often describing how things consistently behave.",
      "explanation_cn": "指支配某一特定系统（如数学、语法或自然）的普遍原则或定律，通常描述事物一贯的行为方式。",
      "example_en": "The rule of gravity explains why objects fall to the ground.",
      "example_cn": "重力法则解释了为什么物体会落地。"
    },
    {
      "pos": "noun",
      "explanation_en": "A standard or criterion used for making judgments or decisions, often implying a norm or expectation.",
      "explanation_cn": "用作判断或决策的标准或准则，通常暗示一种规范或期望。",
      "example_en": "By the rule of thumb, you should save at least 10% of your income.",
      "example_cn": "根据经验法则，你应至少储蓄收入的10%。"
    },
    {
      "pos": "verb",
      "explanation_en": "To govern or control a country, organization, or group with authority; to exercise power over others.",
      "explanation_cn": "以权威统治或控制国家、组织或群体；对他人行使权力。",
      "example_en": "The king ruled the kingdom for over forty years.",
      "example_cn": "这位国王统治王国长达四十多年。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a formal decision or judgment, especially in a legal or competitive context.",
      "explanation_cn": "在法律或竞赛语境中作出正式裁决或判断。",
      "example_en": "The judge ruled in favor of the plaintiff after reviewing the evidence.",
      "example_cn": "法官在审查证据后裁定支持原告。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "regulation",
      "analysis": "“Regulation”（法规/管理）通常指由政府或官方机构颁布的具有法律效力的正式规定，强调强制性和系统性。而 “rule” 更广泛，可以是正式的，也可以是非正式的、约定俗成的规范，适用范围更广，包括游戏、家庭或社交场合。"
    },
    {
      "word_to_compare": "law",
      "analysis": "“Law”（法律）是国家或社会通过立法程序确立的具有强制执行力的规范，违反将导致法律制裁。而 “rule” 可以是更低层级的规范，如公司内部规则或体育比赛规则，不一定具有法律效力，但同样要求遵守。"
    },
    {
      "word_to_compare": "guideline",
      "analysis": "“Guideline”（指南/建议）是建议性的、非强制性的指导原则，用于提供方向，但允许灵活调整。而 “rule” 通常具有约束力，违反可能导致后果。例如，健康指南是建议，而交通规则是必须遵守的。"
    }
  ]
}