{
  "word": "rumble",
  "pronunciation": "rum·bl",
  "concise_definition": "n. 隆隆声, 咕噜声; v. 隆隆作响, 发出低沉的轰鸣",
  "forms": {
    "third_person_singular": "rumbles",
    "past_tense": "rumbled",
    "past_participle": "rumbled",
    "present_participle": "rumbling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A deep, continuous, low sound, often produced by thunder, distant traffic, or a growling stomach, suggesting power or impending action.",
      "explanation_cn": "一种低沉、持续的轰鸣声，通常由雷声、远处的交通或咕噜作响的胃部发出，暗示着力量或即将发生的行动。",
      "example_en": "We heard the rumble of thunder in the distance as the storm approached.",
      "example_cn": "随着暴风雨逼近，我们听到了远处雷声的隆隆作响。"
    },
    {
      "pos": "noun",
      "explanation_en": "A violent or chaotic disturbance, especially among crowds or groups, often implying unrest or a fight.",
      "explanation_cn": "一种暴力或混乱的骚动，尤其指人群中的骚乱或斗殴，常暗示不满或冲突。",
      "example_en": "The protest turned into a rumble when police tried to disperse the crowd.",
      "example_cn": "当警察试图驱散人群时，抗议演变成了一场骚乱。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a deep, continuous, low sound, especially from a large or heavy object in motion.",
      "explanation_cn": "发出低沉、持续的轰鸣声，尤指大型或沉重物体运动时发出的声音。",
      "example_en": "The truck rumbled down the highway as it carried heavy cargo.",
      "example_cn": "卡车载着沉重的货物在高速公路上隆隆驶过。"
    },
    {
      "pos": "verb",
      "explanation_en": "To express anger or discontent in a low, threatening tone, often without direct confrontation.",
      "explanation_cn": "以低沉、威胁性的语气表达愤怒或不满，通常不直接对抗。",
      "example_en": "The crowd rumbled with dissatisfaction as the speaker failed to address their concerns.",
      "example_cn": "当演讲者未能回应他们的关切时，人群中响起了不满的低吼。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "boom",
      "analysis": "“Boom”（轰鸣）通常指突然、响亮、具有冲击力的爆炸声或低沉巨响，如炸弹爆炸或音乐节的重低音，强调瞬间的爆发力。而 “rumble” 更偏向持续、低沉、滚动式的声响，如雷声或引擎的震动，更具压迫感但不具爆炸性。"
    },
    {
      "word_to_compare": "growl",
      "analysis": "“Growl”（咆哮）多用于动物（如狗、狮子）发出的威胁性低吼，带有明确的情绪色彩（愤怒、警告），常与生物行为相关。而 “rumble” 可用于非生物（如雷、卡车、人群），更强调声音的物理特性而非情绪意图。"
    },
    {
      "word_to_compare": "murmur",
      "analysis": "“Murmur”（低语）指轻柔、细碎、几乎听不清的持续声音，常用于人声或风声，表达私密、安静或不安的情绪。而 “rumble” 声音更大、更低沉，具有力量感和潜在威胁，两者在音量、强度和情感色彩上形成鲜明对比。"
    }
  ]
}