{
  "word": "run",
  "pronunciation": "ruhn",
  "concise_definition": "v. 跑, 运行, 管理, 经营; n. 跑步, 运行, 连续",
  "forms": {
    "third_person_singular": "runs",
    "past_tense": "ran",
    "past_participle": "run",
    "present_participle": "running"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move quickly on foot by alternating strides with both feet leaving the ground at intervals.",
      "explanation_cn": "指通过交替迈步、双脚交替离地的方式快速移动。",
      "example_en": "She runs five miles every morning to stay fit.",
      "example_cn": "她每天早上跑五英里以保持健康。"
    },
    {
      "pos": "verb",
      "explanation_en": "To operate or function, especially of machines, systems, or processes, often continuously or automatically.",
      "explanation_cn": "指机器、系统或流程的运转或运作，通常指持续或自动进行。",
      "example_en": "The software runs smoothly on this computer.",
      "example_cn": "这个软件在这台电脑上运行得很流畅。"
    },
    {
      "pos": "verb",
      "explanation_en": "To manage, direct, or be in charge of an organization, business, or activity.",
      "explanation_cn": "指管理、指挥或负责一个组织、企业或活动。",
      "example_en": "He runs a successful restaurant chain in downtown Chicago.",
      "example_cn": "他在芝加哥市中心经营着一家成功的连锁餐厅。"
    },
    {
      "pos": "verb",
      "explanation_en": "To extend or stretch in a particular direction or over a certain distance, often describing paths, borders, or lines.",
      "explanation_cn": "指某物沿特定方向或一定距离延伸，常用于描述路径、边界或线条。",
      "example_en": "The road runs parallel to the river for ten miles.",
      "example_cn": "这条路沿着河流延伸了十英里。"
    },
    {
      "pos": "verb",
      "explanation_en": "To flow or move continuously, especially of liquids or gases.",
      "explanation_cn": "指液体或气体持续流动或移动。",
      "example_en": "Tears ran down her cheeks as she watched the movie.",
      "example_cn": "她看电影时泪水顺着脸颊流下。"
    },
    {
      "pos": "noun",
      "explanation_en": "A continuous period of activity or operation, such as a series of successes or a stretch of time during which something functions.",
      "explanation_cn": "指一段持续的活动或运作时期，如一系列成功或某物持续运作的一段时间。",
      "example_en": "The play had a long run on Broadway, playing for over two years.",
      "example_cn": "这部剧在百老汇连续上演了两年多。"
    },
    {
      "pos": "noun",
      "explanation_en": "A single act of running, especially in a race or as exercise.",
      "explanation_cn": "指一次跑步行为，尤指在比赛中或作为锻炼。",
      "example_en": "He went for a quick run before breakfast.",
      "example_cn": "他早餐前去跑了一小段。"
    },
    {
      "pos": "noun",
      "explanation_en": "A continuous sequence or series of similar events or items, often used in contexts like elections or stock market trends.",
      "explanation_cn": "指一系列相似事件或事物的连续发生，常用于选举或股市趋势等语境。",
      "example_en": "The team is on a winning run of ten games.",
      "example_cn": "这支队伍已连续赢了十场比赛。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "jog",
      "analysis": "“Jog”（慢跑）指一种节奏较慢、轻松的跑步方式，通常用于健身，强度低于 “run”。而 “run” 更广泛，可涵盖从快走到冲刺的各种速度，强调动作本身而非强度。"
    },
    {
      "word_to_compare": "operate",
      "analysis": "“Operate”（操作）更正式，常用于机器、设备或系统，强调按程序或指令执行功能；而 “run” 更口语化，适用范围更广，可指代从软件运行到企业经营的多种情境，语义更灵活。"
    },
    {
      "word_to_compare": "manage",
      "analysis": "“Manage”（管理）侧重于组织、协调和控制资源或人员，常用于抽象事务；而 “run” 在表示经营时更强调日常运作和实际掌控，语气更直接、更接地气，如 “run a business” 比 “manage a business” 更常用。"
    },
    {
      "word_to_compare": "flow",
      "analysis": "“Flow”（流动）强调液体、气体或抽象事物（如信息、情绪）的自然、连续、顺畅的移动，通常无主动控制；而 “run” 在表示流动时更常用于人工或受限环境，如 “water runs through the pipe”，隐含路径或方向性。"
    }
  ]
}