{
  "word": "runaway",
  "pronunciation": "ruhn·away",
  "concise_definition": "adj. 逃跑的, 失控的; n. 逃亡者, 失控的事物",
  "forms": {
    "plural": "runaways"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing something that has escaped control or is moving rapidly and uncontrollably, often with dangerous or unpredictable consequences.",
      "explanation_cn": "形容某事物已失去控制，正在迅速且不可阻挡地发展，常带有危险或不可预测的后果。",
      "example_en": "The runaway train derailed after speeding through the station.",
      "example_cn": "这列失控的火车在高速通过车站时脱轨了。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Referring to a person, especially a child or teenager, who has left home without permission and is living independently, often due to family conflict or hardship.",
      "explanation_cn": "指未经允许离家出走、独自生活的人，尤指因家庭冲突或困境而离家的儿童或青少年。",
      "example_en": "The shelter provides food and counseling for runaway teens.",
      "example_cn": "这个庇护所为离家出走的青少年提供食物和心理辅导。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who has run away, especially from home, an institution, or responsibility.",
      "explanation_cn": "指逃离家庭、机构或责任的人，尤指离家出走的儿童或青少年。",
      "example_en": "Police are searching for a runaway who was last seen near the bus station.",
      "example_cn": "警方正在搜寻一名最后在公交站附近被看到的离家出走者。"
    },
    {
      "pos": "noun",
      "explanation_en": "An event, trend, or process that has become uncontrollable and is progressing rapidly beyond expectations.",
      "explanation_cn": "指变得无法控制并以超乎预期的速度发展的事件、趋势或过程。",
      "example_en": "The popularity of the new app became a runaway success.",
      "example_cn": "这款新应用的流行演变成了一场巨大的成功。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fugitive",
      "analysis": "“Fugitive”（逃犯）特指逃避法律制裁而潜逃的人，具有明确的违法和刑事含义。而 “runaway” 更广泛，可指逃离家庭、责任或控制的人或物，不一定涉及犯罪，如离家出走的青少年或失控的车辆。"
    },
    {
      "word_to_compare": "uncontrolled",
      "analysis": "“Uncontrolled”（失控的）是一个通用形容词，仅描述缺乏控制的状态，不隐含行动或逃离的动态过程。而 “runaway” 不仅表示失控，还强调一种主动或加速的脱离行为，如 runaway inflation（恶性通货膨胀）带有持续加剧的意味。"
    },
    {
      "word_to_compare": "escapee",
      "analysis": "“Escapee”（逃亡者）通常指从监狱、拘留所或强制机构中逃脱的人，语义范围较窄且正式。而 “runaway” 可用于更日常的情境，如孩子离家、宠物走失，甚至抽象事物如价格或情绪的失控，适用范围更广。"
    }
  ]
}