{
  "word": "rundown",
  "pronunciation": "rung·doun",
  "concise_definition": "n. 概要, 情况汇报, 精疲力尽; v. 使筋疲力尽, 概述",
  "forms": {
    "plural": "rundowns",
    "third_person_singular": "rundowns",
    "past_tense": "rundown",
    "past_participle": "rundown",
    "present_participle": "rundown"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A concise summary or overview of a situation, event, or set of information, often presented in a structured or bullet-point format for quick understanding.",
      "explanation_cn": "指对某种情况、事件或信息集的简洁概括或概述，通常以结构化或要点形式呈现，以便快速理解。",
      "example_en": "The manager gave us a rundown of the project timeline before the meeting.",
      "example_cn": "会议前，经理向我们简要介绍了项目的进度时间表。"
    },
    {
      "pos": "noun",
      "explanation_en": "A state of extreme physical or mental exhaustion, often resulting from prolonged stress, overwork, or lack of rest.",
      "explanation_cn": "指因长期压力、过度劳累或缺乏休息而导致的极度身心疲惫状态。",
      "example_en": "After working three shifts in a row, she was completely rundown.",
      "example_cn": "连续上了三个班后，她彻底精疲力尽了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To summarize or give a brief account of something, especially in a clear and efficient manner.",
      "explanation_cn": "指以清晰高效的方式对某事进行概括或简要说明。",
      "example_en": "Can you rundown the key points of the report for me?",
      "example_cn": "你能给我简要概括一下报告的重点吗？"
    },
    {
      "pos": "verb",
      "explanation_en": "To exhaust or wear out someone physically or mentally through prolonged effort or pressure.",
      "explanation_cn": "指通过长期的努力或压力使某人身心俱疲。",
      "example_en": "The demanding schedule rundown the entire team by the end of the quarter.",
      "example_cn": "到季度末，紧张的日程把整个团队都累垮了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "summary",
      "analysis": "“Summary”（摘要）是中性、正式的术语，专指对内容的精炼概括，常用于学术、商务或技术语境，强调信息的完整性和准确性。而 “rundown” 更口语化，常用于口头汇报，可能包含主观判断或非正式细节，更注重实用性而非严谨性。"
    },
    {
      "word_to_compare": "exhaustion",
      "analysis": "“Exhaustion”（精疲力尽）是纯粹描述生理或心理状态的名词，强调结果的严重性，常用于医学或心理学语境。而 “rundown” 作为名词时，语气更口语、更形象，常用于日常对话，且可作动词使用，语义范围更广。"
    },
    {
      "word_to_compare": "overview",
      "analysis": "“Overview”（概览）与 “rundown” 在表示“概括”时语义接近，但 “overview” 更正式、更结构化，常用于报告、演示或规划中，强调全局视角。而 “rundown” 更偏向于快速、非正式的口头传达，有时甚至带有临时性或即兴性。"
    }
  ]
}