{
  "word": "runner",
  "pronunciation": "ruhn·er",
  "concise_definition": "n. 跑者, 送信人, 运行者, 滑动部件",
  "forms": {
    "plural": "runners"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who runs, especially as a sport or for exercise; often used to describe competitive athletes in track and field or long-distance events.",
      "explanation_cn": "指以跑步为运动或锻炼的人，尤其用于描述田径或长跑比赛中的竞技运动员。",
      "example_en": "The marathon runner crossed the finish line with a time of 2 hours and 10 minutes.",
      "example_cn": "这位马拉松跑者以2小时10分钟的成绩冲过终点线。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that carries messages, packages, or items from one place to another, especially in a business or organizational context.",
      "explanation_cn": "指在商业或组织环境中负责传递信件、包裹或物品的人或事物，类似于信使或快递员。",
      "example_en": "The company hired a runner to deliver urgent documents between downtown offices.",
      "example_cn": "公司雇用了一名送信员在市中心的办公室之间递送紧急文件。"
    },
    {
      "pos": "noun",
      "explanation_en": "A part of a machine or mechanism that moves continuously or slides along a track, such as a window runner or a conveyor belt component.",
      "explanation_cn": "指机器或机械中沿轨道连续移动或滑动的部件，如窗户滑轨、传送带组件等。",
      "example_en": "The window runner was worn out, causing the sash to stick when opened.",
      "example_cn": "窗户的滑轨已经磨损，导致窗框开启时卡住。"
    },
    {
      "pos": "noun",
      "explanation_en": "A long, narrow piece of fabric or material placed on the floor, especially in hallways or staircases, often for decoration or protection.",
      "explanation_cn": "指铺设在地板上、尤其用于走廊或楼梯的狭长织物或材料，常用于装饰或保护地面。",
      "example_en": "She chose a red runner to add warmth to the narrow hallway.",
      "example_cn": "她选择了一条红色的地毯条，为狭窄的走廊增添温暖。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "jogger",
      "analysis": "“Jogger”（慢跑者）特指以轻松、有节奏的方式进行慢跑的人，强调休闲性和低强度运动；而 “runner” 范围更广，可涵盖从慢跑到专业竞速的所有跑步者，语义更正式、更广泛。"
    },
    {
      "word_to_compare": "messenger",
      "analysis": "“Messenger”（信使）专指传递信息或物品的人，通常具有组织性或职业性，如快递员或通信员；“runner” 在此义项下虽可互换，但更口语化，且常用于非正式或历史语境（如20世纪初的办公室跑腿员）。"
    },
    {
      "word_to_compare": "slider",
      "analysis": "“Slider”（滑动件）泛指任何能滑动的部件，常用于机械、电子设备（如音量滑块）；而 “runner” 在机械语境中特指沿轨道运行的长条形滑动部件，多用于门窗、轨道系统，语义更具体、更工程化。"
    }
  ]
}