{
  "word": "runners",
  "pronunciation": "ruhn·erz",
  "concise_definition": "n. 跑者, 跑步者; (衣物的) 细带; (机器的) 导轨; (船的) 平衡翼",
  "forms": {
    "singular": "runner"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who runs, especially as a sport or for exercise; often used to describe participants in races or regular joggers.",
      "explanation_cn": "指以跑步为运动或锻炼的人，常用于描述参加比赛的选手或日常慢跑者。",
      "example_en": "The marathon attracted over 10,000 runners from around the world.",
      "example_cn": "这场马拉松吸引了来自世界各地的一万名跑者。"
    },
    {
      "pos": "noun",
      "explanation_en": "A long, narrow strip of fabric placed on the floor, typically along a hallway or under a table; also called a rug runner.",
      "explanation_cn": "指铺设在走廊或桌下的一条狭长的地毯或织物，也称为‘地毯跑带’。",
      "example_en": "She chose a red runner to add warmth to the cold marble hallway.",
      "example_cn": "她选了一条红色的地毯跑带，为冰冷的大理石走廊增添温暖。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sliding component in machinery or equipment that moves along a track or guide, such as in drawers, windows, or conveyor systems.",
      "explanation_cn": "指在机械或设备中沿轨道或导轨滑动的部件，如抽屉滑轨、窗户滑槽或传送系统中的导轨。",
      "example_en": "The drawer’s runners were worn out, making it hard to open and close.",
      "example_cn": "抽屉的滑轨已经磨损，导致难以拉开和推上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A horizontal bar or fin on a boat or sailboat that extends sideways to provide stability and reduce sideways drift (also called a daggerboard or centerboard in some contexts).",
      "explanation_cn": "指船体两侧延伸出的水平杆或鳍片，用于提供稳定性并减少横向漂移（在某些语境中也称为‘稳向板’或‘中心板’）。",
      "example_en": "The sailboat’s runners kept it steady even in strong crosswinds.",
      "example_cn": "这艘帆船的平衡翼即使在强侧风中也能保持稳定。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "runner",
      "analysis": "“Runner” 是单数形式，泛指任何一种‘跑者’或‘滑轨’等角色，而 “runners” 是复数形式，强调多个个体或多个部件。在语义上，复数形式常用于集体语境，如‘一群跑者’或‘多个滑轨’，单数则用于指代单一对象或泛指类别。"
    },
    {
      "word_to_compare": "joggers",
      "analysis": "“Joggers” 专指进行慢跑（jogging）的人，通常带有休闲、非竞技的语义色彩；而 “runners” 范围更广，包括专业运动员、竞赛选手和日常跑步者，语义更正式、更全面。在体育语境中，“runners” 更常用于正式报道或赛事名称中。"
    },
    {
      "word_to_compare": "sliders",
      "analysis": "“Sliders” 指任何能滑动的物体，如门滑块、冰球滑块等，语义更泛化；而 “runners” 在机械语境中特指沿固定轨道滑动的部件，常用于家具、门窗等标准化结构中，具有更强的技术指向性。"
    }
  ]
}