{
  "word": "running",
  "pronunciation": "roo·ning",
  "concise_definition": "n. 跑步, 运行; adj. 运行的, 连续的; v. 跑, 运行 (run 的现在分词和动名词)",
  "forms": {
    "base_form": "run",
    "third_person_singular": "runs",
    "past_tense": "ran",
    "past_participle": "run",
    "present_participle": "running"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The physical activity of moving swiftly on foot, typically with periods of both feet off the ground; a form of exercise or sport.",
      "explanation_cn": "指以较快的速度用脚移动，通常有双脚同时离地的阶段；一种锻炼或体育运动形式。",
      "example_en": "She goes for a morning running every day to stay fit.",
      "example_cn": "她每天早晨跑步以保持健康。"
    },
    {
      "pos": "noun",
      "explanation_en": "A continuous period of operation or activity, especially of a machine, system, or performance.",
      "explanation_cn": "指机器、系统或表演的连续运行或活动时期。",
      "example_en": "The play had a successful running of six months on Broadway.",
      "example_cn": "这部戏剧在百老汇连续上演了六个月，大获成功。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that is currently in operation, functioning, or ongoing without interruption.",
      "explanation_cn": "形容某事物当前正在运行、运作或持续进行，未中断。",
      "example_en": "The running total of donations is now over $50,000.",
      "example_cn": "捐款的累计总额现已超过五万美元。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move at a speed faster than walking, by alternating the contact of feet with the ground in a rhythmic motion.",
      "explanation_cn": "以比步行更快的速度移动，通过双脚有节奏地交替接触地面。",
      "example_en": "He was running late for his meeting and had to sprint down the hallway.",
      "example_cn": "他开会要迟到了，不得不在走廊里奔跑起来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To operate or function continuously, especially of machines, software, or systems.",
      "explanation_cn": "指机器、软件或系统持续运行或运作。",
      "example_en": "The server has been running without downtime for over a year.",
      "example_cn": "这台服务器已经连续运行超过一年而未中断。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "jogging",
      "analysis": "“Jogging” (慢跑) 是一种节奏较慢、强度较低的跑步形式，通常用于健身而非竞技，强调持续性和轻松感。而 “running” 是更广泛的术语，可涵盖从慢跑到冲刺的所有速度，更具强度和目的性。"
    },
    {
      "word_to_compare": "operating",
      "analysis": "“Operating” (操作/运转) 更常用于描述机器、系统或组织的正式运行过程，强调控制和功能实现。而 “running” 更口语化，可泛指任何持续进行的状态，包括抽象概念（如一场演出、一个程序）。"
    },
    {
      "word_to_compare": "sprinting",
      "analysis": "“Sprinting” (短跑) 是一种短时间、高强度的全力奔跑，通常用于比赛中的冲刺阶段。而 “running” 是一个更宽泛的动词，包含所有速度的奔跑，不特指爆发力或距离。"
    }
  ]
}