{
  "word": "runs",
  "pronunciation": "ruhnz",
  "concise_definition": "v. 跑, 运行, 管理, 经营; n. 跑步, 连续, 一段行程",
  "forms": {
    "base_form": "run",
    "third_person_singular": "runs",
    "past_tense": "ran",
    "past_participle": "run",
    "present_participle": "running"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move quickly on foot by alternating steps in a rhythmic motion, typically faster than walking.",
      "explanation_cn": "通过有节奏地交替步伐，以比步行更快的速度用脚移动。",
      "example_en": "She runs every morning to stay fit.",
      "example_cn": "她每天早上跑步以保持健康。"
    },
    {
      "pos": "verb",
      "explanation_en": "To operate or function, especially of machines, systems, or processes; to be in continuous operation.",
      "explanation_cn": "指机器、系统或流程的运行或运作；表示持续处于工作状态。",
      "example_en": "The software runs smoothly on this computer.",
      "example_cn": "这个软件在这台电脑上运行得很流畅。"
    },
    {
      "pos": "verb",
      "explanation_en": "To manage or be in charge of an organization, business, or activity.",
      "explanation_cn": "指管理或负责一个组织、企业或活动。",
      "example_en": "He runs a successful restaurant chain in downtown.",
      "example_cn": "他在市中心经营着一家成功的连锁餐厅。"
    },
    {
      "pos": "noun",
      "explanation_en": "A continuous sequence or stretch of something, often referring to a series of successes, failures, or events.",
      "explanation_cn": "指某事物的连续序列或一段时期，常用于描述一系列成功、失败或事件。",
      "example_en": "The team is on a winning run of ten games.",
      "example_cn": "这支队伍正经历十连胜的高潮。"
    },
    {
      "pos": "noun",
      "explanation_en": "A single act of running, especially in sports or as exercise; also refers to a path or route taken while running.",
      "explanation_cn": "指一次跑步行为，尤指在体育运动或锻炼中；也可指跑步所经过的路径或路线。",
      "example_en": "I went for a five-mile run along the river.",
      "example_cn": "我沿着河边跑了五英里。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "jogs",
      "analysis": "“Jogs”（慢跑）是“runs”的一种较温和、较慢的形式，强调持续、轻松的节奏，通常用于健身而非竞技。而 “runs” 可涵盖从慢跑到冲刺的所有速度，语义范围更广。"
    },
    {
      "word_to_compare": "operates",
      "analysis": "“Operates”（操作）更正式，常用于描述机器、系统或机构的控制与管理，强调技术性或程序性动作。而 “runs” 更口语化，可泛指任何系统或组织的运转，语义更宽泛。"
    },
    {
      "word_to_compare": "series",
      "analysis": "“Series”（系列）是一个中性名词，泛指按顺序排列的一组事物，不强调连续性或动态过程。而 “runs” 作为名词时，隐含一种动态延续性，如连胜、连续降雨等，带有时间延续和结果累积的意味。"
    }
  ]
}