{
  "word": "rupert",
  "pronunciation": "roo·pert",
  "concise_definition": "n. 鲁珀特（人名）",
  "forms": {
    "plural": "Ruperts"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A masculine given name of Germanic origin, derived from the elements 'hrod' (fame) and 'beraht' (bright), commonly used in English-speaking countries and historically associated with nobility and literary figures.",
      "explanation_cn": "一个源自日耳曼语的男性名字，由 'hrod'（名声）和 'beraht'（明亮）组成，常用于英语国家，历史上与贵族和文学人物相关联。",
      "example_en": "Rupert Brooke was a famous English poet known for his idealistic war sonnets.",
      "example_cn": "鲁珀特·布鲁克是一位著名的英国诗人，以其理想主义的战争十四行诗而闻名。"
    },
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to specific notable individuals, such as Rupert Murdoch, the media tycoon, or Rupert Grint, the actor known for playing Ron Weasley in the Harry Potter films.",
      "explanation_cn": "专有名词，指代特定的知名人物，例如传媒大亨鲁珀特·默多克，或在《哈利·波特》系列电影中饰演罗恩·韦斯莱的演员鲁珀特·格林特。",
      "example_en": "Rupert Murdoch built a global media empire including Fox News and The Wall Street Journal.",
      "example_cn": "鲁珀特·默多克建立了一个包括福克斯新闻和《华尔街日报》在内的全球媒体帝国。"
    },
    {
      "pos": "noun",
      "explanation_en": "A name used for fictional characters, such as Rupert Bear, a beloved British children's comic strip character created in 1920.",
      "explanation_cn": "用于虚构角色的名字，例如1920年创作的英国广受欢迎的儿童漫画角色小熊鲁珀特。",
      "example_en": "Rupert Bear has appeared in newspapers and books for over a century, charming generations of children.",
      "example_cn": "小熊鲁珀特一个多世纪以来一直出现在报纸和书籍中，深受几代儿童喜爱。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "robert",
      "analysis": "“Robert”（罗伯特）与 “Rupert” 同为日耳曼语源男性名字，均含 'hrod'（名声）元素，但 “Robert” 源自 'hrodberaht'，而 “Rupert” 是 “Robert” 的中古英语变体，带有更浓厚的贵族和古典色彩，现代使用频率低于 “Robert”。"
    },
    {
      "word_to_compare": "charles",
      "analysis": "“Charles”（查尔斯）是另一个历史悠久的欧洲王室常用名，源自日耳曼语 'karl'（男人、自由人），与 “Rupert” 相比，更广泛用于君主和政治人物（如查尔斯三世），而 “Rupert” 更具文学和艺术关联性，较少用于现代政治语境。"
    },
    {
      "word_to_compare": "prince",
      "analysis": "“Prince”（王子）是头衔而非人名，常与 “Rupert” 搭配使用（如鲁珀特王子），但二者本质不同：前者是身份，后者是名字。在文化语境中，‘Rupert’ 常因历史王子命名而带有贵族联想，但本身不具头衔含义。"
    }
  ]
}