{
  "word": "ruptured",
  "pronunciation": "roop·tchoor·d",
  "concise_definition": "v. 破裂, 破坏, 突然中断",
  "forms": {
    "base_form": "rupture",
    "third_person_singular": "ruptures",
    "past_tense": "ruptured",
    "past_participle": "ruptured",
    "present_participle": "rupturing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To break open or burst suddenly, especially due to internal pressure or physical stress, often referring to a physical structure such as an organ, vessel, or membrane.",
      "explanation_cn": "指由于内部压力或物理应力而突然破裂，通常用于描述器官、血管或膜等物理结构的断裂。",
      "example_en": "The athlete suffered a ruptured Achilles tendon during the marathon.",
      "example_cn": "这位运动员在马拉松比赛中跟腱断裂。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a sudden and complete breakdown or termination of a relationship, agreement, or connection, often due to conflict or irreconcilable differences.",
      "explanation_cn": "指由于冲突或不可调和的分歧，导致关系、协议或联系突然彻底破裂。",
      "example_en": "Diplomatic relations between the two countries were ruptured after the border incident.",
      "example_cn": "边境事件发生后，两国之间的外交关系破裂。"
    },
    {
      "pos": "verb",
      "explanation_en": "To disrupt or interrupt a continuous process, system, or flow in a sudden and damaging way.",
      "explanation_cn": "指以突然且破坏性的方式中断一个连续的过程、系统或流动。",
      "example_en": "The storm ruptured the power grid, leaving thousands without electricity.",
      "example_cn": "风暴破坏了电网，导致成千上万人断电。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "burst",
      "analysis": "“Burst” (爆裂) 强调瞬间的、剧烈的破裂，常伴随声音或爆炸感，多用于气球、水管等容器或弹性结构。而 “ruptured” 更常用于医学或正式语境，强调结构完整性被破坏，可能不伴随明显声响，如器官或组织的撕裂。"
    },
    {
      "word_to_compare": "break",
      "analysis": "“Break” (断裂) 是一个通用词，可指任何类型的断裂或中断，包括物理、情感或抽象层面，语义范围更广。“Ruptured” 更具体，通常暗示一种突然的、严重的、不可逆的断裂，尤其在医学或外交语境中带有更强的负面后果。"
    },
    {
      "word_to_compare": "sever",
      "analysis": "“Sever” (切断) 强调通过外力主动、彻底地切断连接，如切断电缆、断绝关系，常含人为意图。“Ruptured” 更多描述因内部压力或意外导致的被动性破裂，不一定涉及主动行为，更强调结果而非动作。"
    }
  ]
}