{
  "word": "rupture",
  "pronunciation": "rup·cher",
  "concise_definition": "n. 破裂, 断裂; v. 破裂, 破坏, 断绝",
  "forms": {
    "third_person_singular": "ruptures",
    "past_tense": "ruptured",
    "past_participle": "ruptured",
    "present_participle": "rupturing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sudden break or tear in a physical object or structure, often due to pressure or force, resulting in a loss of integrity or continuity.",
      "explanation_cn": "指由于压力或外力导致的物体或结构突然断裂或撕裂，造成完整性或连续性的丧失。",
      "example_en": "The doctor diagnosed a rupture in the patient's Achilles tendon.",
      "example_cn": "医生诊断出患者跟腱发生断裂。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden and complete breakdown in a relationship, agreement, or connection, especially between nations, organizations, or individuals.",
      "explanation_cn": "指关系、协议或联系的突然且彻底的破裂，尤指国家、组织或个人之间的决裂。",
      "example_en": "The diplomatic rupture between the two countries led to the closure of their embassies.",
      "example_cn": "两国之间的外交决裂导致了大使馆的关闭。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a physical break or tear in something, especially a membrane, tissue, or container under pressure.",
      "explanation_cn": "指使某物（尤其是膜、组织或受压容器）发生物理性断裂或撕裂。",
      "example_en": "The intense pressure ruptured the pipe, flooding the basement.",
      "example_cn": "巨大的压力导致管道破裂，地下室被淹。"
    },
    {
      "pos": "verb",
      "explanation_en": "To end a relationship, alliance, or agreement abruptly and decisively, often due to conflict or disagreement.",
      "explanation_cn": "指因冲突或分歧而突然且果断地终止关系、联盟或协议。",
      "example_en": "After years of tension, they finally ruptured their business partnership.",
      "example_cn": "经过多年的紧张关系，他们最终结束了商业伙伴关系。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "break",
      "analysis": "“Break” (断裂/打破) 是一个更通用的词，可指任何类型的断裂、中断或破坏，包括抽象概念（如打破沉默、打破规则）。而 “rupture” 更强调剧烈、突然且通常具有严重后果的断裂，尤其在医学或外交语境中更具专业性和情感强度。"
    },
    {
      "word_to_compare": "fracture",
      "analysis": "“Fracture” (骨折/裂纹) 多用于描述固体材料（如骨头、陶瓷）出现裂缝或部分断裂，通常保留部分连接，程度较轻。而 “rupture” 指完全撕裂或断开，常用于软组织（如肌腱）或抽象关系，强调彻底性。"
    },
    {
      "word_to_compare": "sever",
      "analysis": "“Sever” (切断/断绝) 强调通过外力主动、明确地切断联系或物理连接，常用于肢体、电缆或关系，带有刻意性。而 “rupture” 更多描述一种因压力或冲突导致的被动性崩溃，不一定需要主动行为，情感色彩更浓。"
    }
  ]
}