{
  "word": "rushes",
  "pronunciation": "ruhsh·iz",
  "concise_definition": "v. 匆忙, 急促行动; n. 急流, 急忙的人群",
  "forms": {
    "base_form": "rush",
    "third_person_singular": "rushes",
    "past_tense": "rushed",
    "past_participle": "rushed",
    "present_participle": "rushing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move or act with great speed or urgency, often due to pressure, excitement, or a sense of emergency.",
      "explanation_cn": "指因压力、兴奋或紧急情况而以极快的速度移动或行动。",
      "example_en": "She rushes to the airport every morning to catch the first flight.",
      "example_cn": "她每天早上都匆忙赶往机场赶第一班航班。"
    },
    {
      "pos": "verb",
      "explanation_en": "To proceed hastily or carelessly, often resulting in mistakes or poor outcomes.",
      "explanation_cn": "指仓促行事，常导致错误或不良后果。",
      "example_en": "Don't rush through your homework—take your time to understand each problem.",
      "example_cn": "别急着做作业——花点时间理解每个问题。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden, strong flow of water, air, or people moving quickly in a particular direction.",
      "explanation_cn": "指水、空气或人群快速朝某一方向流动的急流或涌动。",
      "example_en": "The rushes of shoppers during the holiday sale overwhelmed the store entrances.",
      "example_cn": "假期促销期间涌进商店的顾客潮让入口不堪重负。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of tall, grass-like plant that grows in wet areas, often used in weaving or as a natural material.",
      "explanation_cn": "指生长在湿地的一种高大的草本植物，常用于编织或作为天然材料。",
      "example_en": "The marsh was filled with tall rushes swaying in the wind.",
      "example_cn": "沼泽里长满了在风中摇曳的高大芦苇。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hurry",
      "analysis": "“Hurry” (匆忙) 强调时间紧迫下的快速行动，常带焦虑或紧张情绪，但不一定伴随剧烈的身体运动。而 “rushes” 更强调动作的猛烈性、爆发性和物理上的快速移动，常用于描述人流、水流等群体性或自然现象的涌动。"
    },
    {
      "word_to_compare": "sprint",
      "analysis": "“Sprint” (短跑) 专指短距离的全力奔跑，是体育或身体运动中的术语，强调速度和爆发力，但通常有明确的距离和终点。而 “rushes” 更广泛，可用于抽象情境（如情绪、人流），不局限于身体运动，也不一定有明确终点。"
    },
    {
      "word_to_compare": "stream",
      "analysis": "“Stream” (流动) 指连续、平稳、有方向的流动，如水流或数据流，强调连贯性和持续性。而 “rushes” 暗示的是突然、猛烈、有时混乱的涌动，带有更强的动态冲击力和非线性特征。"
    }
  ]
}