{
  "word": "sabha",
  "pronunciation": "sahb·hah",
  "concise_definition": "n. 议会, 会议, 集会",
  "forms": {
    "plural": "sabhas"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A traditional assembly or council in ancient and modern South Asian societies, especially in India, used for deliberation, legislation, or community decision-making; often refers to a formal legislative body in Hindu or Buddhist contexts.",
      "explanation_cn": "南亚社会（尤其在印度）中一种传统的集会或议会，用于审议、立法或社区决策；常指印度教或佛教语境中的正式立法机构。",
      "example_en": "In ancient India, the sabha was composed of elders and scholars who advised the king on matters of law and governance.",
      "example_cn": "在古印度，议会由长者和学者组成，他们就法律与治理问题向国王提供建议。"
    },
    {
      "pos": "noun",
      "explanation_en": "In modern India, a term used for certain legislative assemblies, such as the state legislative assemblies known as 'Vidhan Sabha' or the lower house of Parliament called 'Lok Sabha'.",
      "explanation_cn": "在现代印度，该词用于指某些立法机构，如各邦立法议会（Vidhan Sabha）或议会下院（Lok Sabha）。",
      "example_en": "The members of the Lok Sabha are directly elected by the people of India every five years.",
      "example_cn": "人民院的议员由印度人民每五年直接选举产生。"
    },
    {
      "pos": "noun",
      "explanation_en": "In religious or cultural contexts, a gathering of devotees for spiritual discourse, chanting, or communal worship, especially in Hindu traditions.",
      "explanation_cn": "在宗教或文化语境中，指信徒为进行精神讲道、诵经或集体礼拜而举行的集会，尤见于印度教传统。",
      "example_en": "Every evening, the villagers gather in the sabha for bhajans and teachings from the guru.",
      "example_cn": "每天傍晚，村民们都会聚集在集会厅唱颂赞歌并聆听上师的教诲。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "council",
      "analysis": "“Council”（委员会/议会）是西方政治体系中常见的决策机构，通常由任命或选举产生的成员组成，强调正式的行政或咨询职能。而 “sabha” 具有深厚的文化与宗教根源，其组成和功能在印度传统中更强调社区参与和精神权威，不完全等同于现代西方式的议会。"
    },
    {
      "word_to_compare": "assembly",
      "analysis": "“Assembly”（集会/议会）是一个通用词，泛指任何聚集在一起讨论事务的群体，可指政治、教育或社交场合。而 “sabha” 特指南亚文化中具有制度性、历史性和宗教性意义的集会，语义更具体、文化负载更重。"
    },
    {
      "word_to_compare": "parliament",
      "analysis": "“Parliament”（议会）特指现代国家的最高立法机构，如英国议会或印度议会（Sansad）。虽然印度的 Lok Sabha 是议会的一部分，但 “sabha” 本身并不等同于 “parliament”——它是一个更广泛的概念，可指从地方性宗教集会到国家级立法机构的多种形态。"
    }
  ]
}