{
  "word": "sacrifice",
  "pronunciation": "sak·ruh·fis",
  "concise_definition": "n. 牺牲, 献祭; v. 牺牲, 献出",
  "forms": {
    "third_person_singular": "sacrifices",
    "past_tense": "sacrificed",
    "past_participle": "sacrificed",
    "present_participle": "sacrificing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of giving up something valuable or important for the sake of a higher cause, another person, or a greater good, often involving personal loss or hardship.",
      "explanation_cn": "为了更高的目标、他人或更大的利益而放弃有价值或重要的事物，通常伴随着个人的损失或痛苦。",
      "example_en": "The soldiers made the ultimate sacrifice to protect their country.",
      "example_cn": "士兵们为保卫祖国献出了生命。"
    },
    {
      "pos": "noun",
      "explanation_en": "A religious offering, such as an animal or object, presented to a deity as part of a ritual to gain favor or atone for sins.",
      "explanation_cn": "宗教仪式中向神灵献上的供品，如动物或物品，用以祈求恩宠或赎罪。",
      "example_en": "In ancient cultures, animal sacrifice was a common practice to appease the gods.",
      "example_cn": "在古代文化中，献祭动物是取悦神灵的常见做法。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give up something cherished or essential, often willingly, in order to achieve a more important goal or benefit someone else.",
      "explanation_cn": "自愿放弃心爱或重要的事物，以实现更重要的目标或使他人受益。",
      "example_en": "She sacrificed her career to raise her children.",
      "example_cn": "她为了抚养孩子而牺牲了自己的事业。"
    },
    {
      "pos": "verb",
      "explanation_en": "To offer something as a religious offering, especially in a ceremonial context.",
      "explanation_cn": "在宗教仪式中献上某物作为祭品。",
      "example_en": "The priest sacrificed a lamb at the altar.",
      "example_cn": "祭司在祭坛上献上了一只羔羊。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "give up",
      "analysis": "“Give up” (放弃) 是一个更通用、更口语化的表达，指停止拥有、追求或坚持某物，不一定涉及高尚动机或重大代价。而 “sacrifice” 强调主动、有意识地放弃有价值的东西，通常带有道德或情感上的崇高性。"
    },
    {
      "word_to_compare": "lose",
      "analysis": "“Lose” (失去) 是被动的，指因意外、失败或不可控因素而不再拥有某物，不包含意愿或目的性。而 “sacrifice” 是主动选择的结果，通常是为了换取某种更高价值。"
    },
    {
      "word_to_compare": "offering",
      "analysis": "“Offering” (供品) 通常特指宗教或仪式中献给神灵的物品，语义范围较窄，且多为名词。而 “sacrifice” 既可用于宗教语境，也可用于世俗语境，涵盖更广的牺牲行为，且可作动词和名词。"
    }
  ]
}