{
  "word": "saddle",
  "pronunciation": "sahd·uhl",
  "concise_definition": "n. 鞍子, 鞍状物; v. 给...装鞍, 使负担",
  "forms": {
    "plural": "saddles",
    "third_person_singular": "saddles",
    "past_tense": "saddled",
    "past_participle": "saddled",
    "present_participle": "saddling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A padded seat fastened on the back of a horse or other animal for a rider, typically consisting of a frame, stirrups, and straps to secure it in place.",
      "explanation_cn": "固定在马或其他动物背部供骑手乘坐的垫座，通常由框架、马镫和固定带组成。",
      "example_en": "The cowboy adjusted his saddle before mounting the spirited stallion.",
      "example_cn": "牛仔在骑上那匹烈马前调整了一下马鞍。"
    },
    {
      "pos": "noun",
      "explanation_en": "A raised, curved area or structure resembling a saddle, especially in geography or engineering (e.g., a saddle between two mountain peaks or a saddle joint in mechanics).",
      "explanation_cn": "指形状类似马鞍的隆起或结构，尤用于地理或工程领域（如两座山峰之间的鞍部，或机械中的鞍形关节）。",
      "example_en": "The hikers crossed the saddle connecting the two peaks before descending into the valley.",
      "example_cn": "徒步者穿越了连接两座山峰的鞍部，然后下到山谷。"
    },
    {
      "pos": "verb",
      "explanation_en": "To put a saddle on a horse or other animal, especially for riding or transport.",
      "explanation_cn": "给马或其他动物装上鞍子，尤指为骑乘或运输做准备。",
      "example_en": "The stable hand saddled the mare and led her to the trailhead.",
      "example_cn": "马厩工人给母马套上马鞍，牵它到小径起点。"
    },
    {
      "pos": "verb",
      "explanation_en": "To burden or impose a responsibility, obligation, or task on someone or something, often unfairly or heavily.",
      "explanation_cn": "给某人或某物强加责任、义务或任务，常带有不公平或沉重的意味。",
      "example_en": "The new regulations saddled small businesses with excessive paperwork.",
      "example_cn": "新法规给小企业带来了繁重的文书工作。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pack",
      "analysis": "“Pack” (装载/打包) 指将物品装入容器或背负在身上，强调的是携带物品的行为，不特指动物背部的装置。而 “saddle” 专指为骑乘动物安装的专用座位，具有结构性和功能性，且常与骑乘直接关联。"
    },
    {
      "word_to_compare": "load",
      "analysis": "“Load” (装载) 是一个通用动词，泛指将货物、负担或任务加到某物上，语义广泛，无特定形式。而 “saddle” 作为动词时，带有隐喻色彩，强调‘强加’的沉重感和被动性，常用于抽象语境，如‘saddled with debt’，比 ‘load’ 更具情感色彩。"
    },
    {
      "word_to_compare": "ridge",
      "analysis": "“Ridge” (山脊) 指地形中狭长的隆起部分，通常呈线状延伸，强调的是自然地貌的形态。而 “saddle” 在地理语境中特指两个高地之间的低洼连接处，形状像马鞍，是地形的‘凹陷’而非‘凸起’，两者在形态和功能上相反。"
    }
  ]
}