{
  "word": "sails",
  "pronunciation": "sālz",
  "concise_definition": "n. 帆, 船帆; v. 航行, 驾船",
  "forms": {
    "singular": "sail",
    "third_person_singular": "sails",
    "past_tense": "sailed",
    "past_participle": "sailed",
    "present_participle": "sailing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A large piece of fabric attached to a mast or pole on a boat or ship, designed to catch the wind and propel the vessel forward.",
      "explanation_cn": "安装在船桅或杆上的大型织物，用于捕捉风力以推动船只前进。",
      "example_en": "The white sails of the schooner caught the afternoon breeze and glided smoothly across the bay.",
      "example_cn": "双桅帆船的白色船帆迎着午后微风，平稳地滑过海湾。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or process of traveling by boat using wind power; a journey or trip made by boat.",
      "explanation_cn": "指利用风力乘船航行的行为或过程；也指一次乘船旅行。",
      "example_en": "They went for a sail along the coast and enjoyed the sunset from the water.",
      "example_cn": "他们沿着海岸航行，从水上欣赏了日落。"
    },
    {
      "pos": "verb",
      "explanation_en": "To travel on water in a boat or ship powered by wind or engine, especially when using sails.",
      "explanation_cn": "指乘船在水上航行，尤指使用风帆推进。",
      "example_en": "We plan to sail from Miami to the Bahamas next month.",
      "example_cn": "我们计划下个月从迈阿密航行到巴哈马。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or glide smoothly and gracefully, often as if propelled by wind, especially in a metaphorical sense.",
      "explanation_cn": "指像被风推动一样平稳、优雅地移动，常用于比喻意义。",
      "example_en": "The dancer sailed across the stage with effortless elegance.",
      "example_cn": "舞者以毫不费力的优雅滑过舞台。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sail",
      "analysis": "“Sail” 是 “sails” 的单数形式，作为名词时指单个帆，作为动词时指航行行为。而 “sails” 作为复数名词时强调多个帆或整体帆具系统，作为动词第三人称单数时用于描述某人或某船持续航行的状态。两者在语法功能上互补，语义上 “sails” 更常用于描述整体航行场景或视觉意象。"
    },
    {
      "word_to_compare": "mast",
      "analysis": "“Mast” (桅杆) 是支撑帆的垂直杆状结构，是帆船的组成部分，但本身不捕捉风力。而 “sails” 是直接利用风力推动船只的部件。两者功能紧密相关，但 “sails” 是动力来源，而 “mast” 是支撑结构。"
    },
    {
      "word_to_compare": "voyage",
      "analysis": "“Voyage” (航行/远航) 指一次较长的、通常跨区域或跨洋的海上旅程，强调距离和目的性，是名词。而 “sails” 作为动词时仅描述航行动作本身，作为名词时可指一次航行，但更侧重于方式（使用帆）而非旅程的长度或意义。"
    }
  ]
}