{
  "word": "sailing",
  "pronunciation": "sahy·ling",
  "concise_definition": "n. 航行, 帆船运动; v. 航行, 驾驶帆船",
  "forms": {
    "plural": "sailings",
    "third_person_singular": "sails",
    "past_tense": "sailed",
    "past_participle": "sailed",
    "present_participle": "sailing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The activity or sport of traveling on water using wind-powered vessels, especially boats with sails; often practiced recreationally or competitively.",
      "explanation_cn": "指利用风力驱动的船只（尤其是帆船）在水上航行的活动或运动，常用于休闲或竞技目的。",
      "example_en": "She spends her summers sailing along the coast of Maine.",
      "example_cn": "她夏天常在缅因州海岸航行。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or process of traveling by ship or boat, especially on a scheduled route or voyage.",
      "explanation_cn": "指乘船航行的行为或过程，尤指按固定航线或航程的航行。",
      "example_en": "The sailing from Southampton to New York takes seven days.",
      "example_cn": "从南安普敦到纽约的航程需要七天。"
    },
    {
      "pos": "verb",
      "explanation_en": "To travel on water in a boat or ship, especially one propelled by sails; to operate or navigate such a vessel.",
      "explanation_cn": "指乘船在水上航行，尤指驾驶以风帆为动力的船只；操作或导航此类船只。",
      "example_en": "They sailed across the Atlantic Ocean last summer.",
      "example_cn": "他们去年夏天横渡了大西洋。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move smoothly or effortlessly, as if carried by the wind; often used metaphorically.",
      "explanation_cn": "指像被风推动一样平稳、轻松地移动；常用于比喻意义。",
      "example_en": "The conversation sailed along without a single awkward pause.",
      "example_cn": "谈话进行得十分顺畅，没有一丝尴尬的停顿。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "boating",
      "analysis": "“Boating”（划船）泛指任何在水上驾驶船只的活动，包括使用发动机的快艇、皮划艇等，不依赖风力。而 “sailing” 特指依靠风帆推进的航行方式，强调风力与帆具的运用，更具技术性和传统性。"
    },
    {
      "word_to_compare": "navigation",
      "analysis": "“Navigation”（航行/导航）是一个更广义的术语，指确定位置、规划航线并引导船只或飞行器到达目的地的全过程，可适用于任何交通工具（飞机、汽车、船只）。而 “sailing” 仅指使用帆船的航行行为，是导航的一种具体形式。"
    },
    {
      "word_to_compare": "voyaging",
      "analysis": "“Voyaging”（远航）强调长途、跨区域或探险性质的航行，常带有冒险或历史性色彩，如“voyages of discovery”。而 “sailing” 可用于短途休闲航行，不一定具有远征性质。两者可重叠，但 “voyaging” 更侧重旅程的规模与目的。"
    }
  ]
}