{
  "word": "sally",
  "pronunciation": "sah·lee",
  "concise_definition": "n. 突袭, 出击; v. 突然冲出, 出击",
  "forms": {
    "third_person_singular": "sallies",
    "past_tense": "sallied",
    "past_participle": "sallied",
    "present_participle": "sallying"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sudden attack or charge, especially by troops emerging from a fortified position to confront an enemy; often used in military contexts.",
      "explanation_cn": "指军队从防御工事中突然冲出对敌方发动的袭击或冲锋，常用于军事语境。",
      "example_en": "The defenders launched a sally at dawn, catching the besieging army off guard.",
      "example_cn": "守军在黎明时发动了一次突袭，使围攻的军队措手不及。"
    },
    {
      "pos": "noun",
      "explanation_en": "A brief, lively excursion or outing, often for pleasure or exploration; used in a more figurative or literary sense.",
      "explanation_cn": "指一次短暂而活泼的外出或远足，常用于愉悦或探索的目的，带有比喻或文学色彩。",
      "example_en": "We took a sally into the countryside for a picnic and some fresh air.",
      "example_cn": "我们外出到乡间野餐，呼吸一下新鲜空气。"
    },
    {
      "pos": "verb",
      "explanation_en": "To rush out suddenly, especially from a defensive position to attack or confront an opponent.",
      "explanation_cn": "指突然冲出，尤指从防御位置冲出以攻击或对抗对手。",
      "example_en": "The soldiers sallied forth from the castle to drive back the invaders.",
      "example_cn": "士兵们从城堡中冲出，击退了入侵者。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a brief, energetic excursion or venture, often for amusement or to explore.",
      "explanation_cn": "指进行一次短暂而充满活力的外出或冒险，常为娱乐或探索目的。",
      "example_en": "She sallied into the city center to browse the bookshops and enjoy the street performers.",
      "example_cn": "她前往市中心逛书店，欣赏街头艺人的表演。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "raid",
      "analysis": "“Raid”（突袭）与 “sally” 在军事语境中常可互换，但 “raid” 更强调有计划的、通常针对特定目标的袭击，可能由外部力量发起；而 “sally” 特指从被围困或防御状态中主动冲出反击，具有更强的被动转主动的语义色彩。"
    },
    {
      "word_to_compare": "charge",
      "analysis": "“Charge”（冲锋）泛指任何快速向前的攻击性行动，可由任何一方发起，常用于骑兵或现代军队的正面进攻；而 “sally” 专指从防御工事中出击，隐含了“突围”或“反攻”的战术背景，语义范围更窄、更具体。"
    },
    {
      "word_to_compare": "expedition",
      "analysis": "“Expedition”（远征）指有组织、有目的的长途外出，通常用于探索、科学考察或军事远征，强调计划性和长期性；而 “sally” 强调短暂、突然、非正式的外出，多用于日常或文学语境，两者在目的和时长上截然不同。"
    }
  ]
}