{
  "word": "salt",
  "pronunciation": "sawlt",
  "concise_definition": "n. 盐, 盐类; v. 腌制, 撒盐于",
  "forms": {
    "plural": "salts"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A white crystalline substance, chemically sodium chloride, used to flavor food and preserve it, and essential for human and animal physiology.",
      "explanation_cn": "一种白色晶体物质，化学成分为氯化钠，用于调味和保存食物，也是人类和动物生理功能所必需的物质。",
      "example_en": "She added a pinch of salt to enhance the flavor of the soup.",
      "example_cn": "她加了一小撮盐来提升汤的风味。"
    },
    {
      "pos": "noun",
      "explanation_en": "A substance or material that resembles salt in appearance or texture, such as Epsom salt or rock salt, even if chemically different.",
      "explanation_cn": "指外观或质地类似盐的物质，如泻盐或岩盐，即使其化学成分不同。",
      "example_en": "Epsom salt is often used in bathwater to soothe sore muscles.",
      "example_cn": "泻盐常被加入浴水中以缓解肌肉酸痛。"
    },
    {
      "pos": "noun",
      "explanation_en": "A metaphorical use referring to something that adds value, interest, or spice to a situation or person, often in an essential but subtle way.",
      "explanation_cn": "比喻用法，指为某种情境或人物增添价值、趣味或活力的元素，通常虽不显眼但至关重要。",
      "example_en": "His humor was the salt of the party — everyone loved his witty remarks.",
      "example_cn": "他的幽默是派对的点睛之笔——大家都喜欢他风趣的言辞。"
    },
    {
      "pos": "verb",
      "explanation_en": "To preserve or season food by covering it with salt or soaking it in brine.",
      "explanation_cn": "通过覆盖盐或浸泡在盐水中来腌制或调味食物。",
      "example_en": "They salted the fish to keep it fresh during the long voyage.",
      "example_cn": "他们用盐腌制鱼，以在长途航行中保持新鲜。"
    },
    {
      "pos": "verb",
      "explanation_en": "To sprinkle or scatter something (often metaphorically) over a surface or area, as if sprinkling salt.",
      "explanation_cn": "比喻性地指像撒盐一样将某物撒在表面或区域上。",
      "example_en": "The field was salted with wildflowers after the rain.",
      "example_cn": "雨后，田野里撒满了野花。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sodium chloride",
      "analysis": "“Sodium chloride” 是盐的化学名称，强调其科学成分，用于医学、化学或工业语境；而 “salt” 是日常通用词，涵盖食用、工业、比喻等多种用法，语义更广、更口语化。"
    },
    {
      "word_to_compare": "pepper",
      "analysis": "“Pepper”（胡椒）与 “salt” 常并列使用，同为调味品，但 “pepper” 带有辛辣刺激感，而 “salt” 更侧重于增强本味、平衡口感。在比喻中，salt 常表示‘点睛之笔’，pepper 则多用于表示‘增添多样性’或‘零星点缀’。"
    },
    {
      "word_to_compare": "cure",
      "analysis": "“Cure”（腌制/熏制）是更广泛的食品保存方法，包括盐腌、烟熏、糖渍等；而 “salt” 作为动词特指使用盐进行腌制，是 “cure” 的一种具体手段。因此，salt 更具体，cure 更泛化。"
    }
  ]
}