{
  "word": "salvage",
  "pronunciation": "sal·vij",
  "concise_definition": "v. 抢救, 抢救物, n. 抢救, 抢救物",
  "forms": {
    "third_person_singular": "salvages",
    "past_tense": "salvaged",
    "past_participle": "salvaged",
    "present_participle": "salvaging"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To rescue or recover something valuable from damage, destruction, or waste, especially in a situation where loss seems inevitable.",
      "explanation_cn": "指在看似不可避免的损失情况下，从损坏、毁灭或浪费中抢救或回收出有价值的东西。",
      "example_en": "Firefighters worked tirelessly to salvage what they could from the burning building.",
      "example_cn": "消防员们不懈努力，从燃烧的建筑中抢救出能救出的一切。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make use of something that has been discarded or is considered useless, often by repurposing or repairing it.",
      "explanation_cn": "指利用被丢弃或被认为无用的东西，通常通过重新利用或修复使其恢复价值。",
      "example_en": "She salvaged old wood from the demolished barn to build a coffee table.",
      "example_cn": "她从被拆除的谷仓中回收旧木材，制作了一张咖啡桌。"
    },
    {
      "pos": "noun",
      "explanation_en": "Something that has been rescued or recovered from destruction, loss, or waste; often refers to goods or materials recovered from a wreck or disaster.",
      "explanation_cn": "指从破坏、损失或浪费中被抢救或回收下来的东西；常指从沉船或灾难中回收的货物或材料。",
      "example_en": "The divers recovered a large amount of salvage from the sunken ship.",
      "example_cn": "潜水员从沉船中打捞出大量残骸物资。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rescue",
      "analysis": "“Rescue” (营救) 通常指从危险或灾难中救出人或动物，强调保护生命或避免伤害，语义重心在“人”或“有生命体”。而 “salvage” 更侧重于抢救物品、财产或材料，强调价值的保存，而非生命安全。"
    },
    {
      "word_to_compare": "recover",
      "analysis": "“Recover” (恢复/取回) 是一个更广泛的词，可指恢复健康、记忆、财产或状态，不一定涉及破坏或损失的情境。而 “salvage” 特指在已经发生严重损害或废弃的情况下，尽力从中获取可用部分，带有更强的“挽救残局”意味。"
    },
    {
      "word_to_compare": "recycle",
      "analysis": "“Recycle” (回收利用) 强调将废弃物经过处理后转化为新原料或产品，是环保流程的一部分，通常有标准化的工业程序。而 “salvage” 更偏向于在紧急或非正式情境下直接取用可用部分，不一定经过工业处理，更注重即时性和实用性。"
    }
  ]
}