{
  "word": "samba",
  "pronunciation": "sam·buh",
  "concise_definition": "n. 桑巴舞, 桑巴音乐; v. 跳桑巴舞",
  "forms": {
    "plural": "sambas"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A lively, rhythmic dance and music style originating in Brazil, characterized by syncopated beats, rapid steps, and vibrant costumes, often performed during Carnival celebrations.",
      "explanation_cn": "一种起源于巴西的活泼、富有节奏感的舞蹈和音乐风格，以切分音节奏、快速步法和鲜艳的服饰为特征，常在狂欢节期间表演。",
      "example_en": "The parade featured hundreds of dancers performing the samba in colorful feathered outfits.",
      "example_cn": "游行中，数百名舞者身着色彩斑斓的羽毛服饰跳起了桑巴舞。"
    },
    {
      "pos": "noun",
      "explanation_en": "A genre of Brazilian music with African roots, typically played with percussion instruments such as surdo, tamborim, and cuíca, and often accompanied by call-and-response singing.",
      "explanation_cn": "一种具有非洲根源的巴西音乐体裁，通常使用低音鼓、小鼓和铜卡等打击乐器演奏，并常伴有应答式合唱。",
      "example_en": "The radio station plays samba every weekend to celebrate Brazilian culture.",
      "example_cn": "这家电台每周末播放桑巴音乐，以庆祝巴西文化。"
    },
    {
      "pos": "verb",
      "explanation_en": "To dance the samba, especially in a lively, energetic manner, often in a social or festive context.",
      "explanation_cn": "跳桑巴舞，尤指在社交或节庆场合中以活泼、充满活力的方式跳舞。",
      "example_en": "At the party, everyone began to samba as the band struck up a lively rhythm.",
      "example_cn": "派对上，乐队奏起欢快的节奏，所有人都开始跳起桑巴舞。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rumba",
      "analysis": "“Rumba”（伦巴）是起源于古巴的拉丁舞，节奏较慢、更注重臀部摆动和情感表达，常用于社交舞厅。而 “samba” 节奏更快、更富动感，强调腿部快速动作和全身协调，是巴西狂欢节的象征。两者虽同属拉丁舞，但文化根源和表现形式截然不同。"
    },
    {
      "word_to_compare": "salsa",
      "analysis": "“Salsa”（萨尔萨舞）源自加勒比地区，融合了古巴音乐与纽约爵士元素，节奏复杂，强调双人互动和即兴旋转。相比之下，samba 更多为单人或群体表演，节奏以打击乐为主导，更具民俗性和集体狂欢色彩。"
    },
    {
      "word_to_compare": "tango",
      "analysis": "“Tango”（探戈）起源于阿根廷，以缓慢、优雅、戏剧性的步伐和紧密的舞伴连接为特点，情感深沉内敛。而 samba 则充满阳光、热情与外放的能量，是庆祝与欢乐的表达，两者在情绪基调和身体语言上形成鲜明对比。"
    }
  ]
}