{
  "word": "sampler",
  "pronunciation": "sam·plur",
  "concise_definition": "n. 样品, 选集, 采样器",
  "forms": {
    "plural": "samplers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small sample or representative portion of a larger whole, often used to show quality, style, or content before full adoption or purchase.",
      "explanation_cn": "指从整体中取出的一小部分，用以展示其质量、风格或内容，通常用于在全面采用或购买前进行评估。",
      "example_en": "The fabric store offered free samplers so customers could feel the texture before buying.",
      "example_cn": "布料店提供免费样品，让顾客在购买前能触摸感受质地。"
    },
    {
      "pos": "noun",
      "explanation_en": "A collection of selected excerpts, especially from music, literature, or art, compiled to demonstrate variety or excellence.",
      "explanation_cn": "指从音乐、文学或艺术作品中精选出的片段集合，用于展示多样性或卓越性。",
      "example_en": "The album is a sampler of the label's best tracks from the 1980s.",
      "example_cn": "这张专辑是该厂牌20世纪80年代最佳曲目的精选集。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device or tool used to collect a representative sample from a larger quantity, especially in scientific, industrial, or agricultural contexts.",
      "explanation_cn": "指用于从大量物质中采集代表性样本的设备或工具，常用于科学、工业或农业领域。",
      "example_en": "The environmental agency used a water sampler to test pollution levels in the river.",
      "example_cn": "环保机构使用水质采样器检测河流中的污染水平。"
    },
    {
      "pos": "noun",
      "explanation_en": "A decorative embroidered piece, traditionally made by women to demonstrate needlework skills, often featuring alphabets, motifs, and sayings.",
      "explanation_cn": "指一种传统上由女性制作的装饰性刺绣作品，用于展示针线技艺，常包含字母、图案和格言。",
      "example_en": "She hung her grandmother's 19th-century sampler on the wall as a family heirloom.",
      "example_cn": "她将祖母19世纪的刺绣样品挂在墙上，作为传家宝。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "example",
      "analysis": "“Example”（例子）用于说明一个概念、规则或观点，强调解释性；而 “sampler” 强调的是从整体中提取的代表性部分，用于展示、评估或体验，不以解释为目的，而是以呈现为功能。"
    },
    {
      "word_to_compare": "sample",
      "analysis": "“Sample” 是 “sampler” 的动词或名词原型，泛指任何样本；而 “sampler” 通常特指一种被精心挑选、整理或设计的样本集合，尤其在文化、艺术或技术语境中具有结构化或展示性特征。"
    },
    {
      "word_to_compare": "anthology",
      "analysis": "“Anthology”（选集）通常指文学或艺术作品的正式汇编，具有学术性或收藏价值，内容选择更严谨；而 “sampler” 更偏向实用、通俗或临时性，常用于推广、试用或教学场景，形式更自由。"
    }
  ]
}