{
  "word": "sanction",
  "pronunciation": "sangk·shun",
  "concise_definition": "n. 批准, 认可; 制裁; v. 批准, 授权; 实施制裁",
  "forms": {
    "plural": "sanctions",
    "third_person_singular": "sanctions",
    "past_tense": "sanctioned",
    "past_participle": "sanctioned",
    "present_participle": "sanctioning"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Official permission or approval for an action, often granted by an authority or formal body.",
      "explanation_cn": "指由权威机构或正式组织给予的官方许可或批准。",
      "example_en": "The government gave its sanction to the new educational reform.",
      "example_cn": "政府批准了这项新的教育改革。"
    },
    {
      "pos": "noun",
      "explanation_en": "A penalty or restrictive measure imposed by a government or international organization to enforce compliance with laws or norms, often targeting a country, organization, or individual.",
      "explanation_cn": "指政府或国际组织为迫使遵守法律或规范而施加的惩罚性或限制性措施，通常针对国家、组织或个人。",
      "example_en": "The United Nations imposed economic sanctions on the regime for human rights violations.",
      "example_cn": "联合国因人权侵犯行为对该政权实施了经济制裁。"
    },
    {
      "pos": "verb",
      "explanation_en": "To officially approve or authorize an action, often by a person or body in a position of authority.",
      "explanation_cn": "指由有权人士或机构正式批准或授权某项行动。",
      "example_en": "The board sanctioned the use of funds for the community project.",
      "example_cn": "董事会批准了将资金用于社区项目。"
    },
    {
      "pos": "verb",
      "explanation_en": "To impose penalties or restrictive measures on a country, organization, or individual as a form of punishment or coercion.",
      "explanation_cn": "指对国家、组织或个人施加惩罚性或限制性措施，以作为惩罚或胁迫手段。",
      "example_en": "Several countries have sanctioned the export of advanced technology to the conflict zone.",
      "example_cn": "多个国家已禁止向冲突地区出口先进技术。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "approval",
      "analysis": "“Approval” (批准) 仅指正面的认可或同意，语义单一且中性或积极；而 “sanction” 作为名词时具有双重含义，既可表示正面的批准，也可表示负面的制裁，语义更复杂，语境依赖性强。"
    },
    {
      "word_to_compare": "penalty",
      "analysis": "“Penalty” (处罚) 专指因违反规则而施加的惩罚，语义范围窄且负面；而 “sanction” 作为制裁时虽类似，但通常具有政治性、系统性和国际性，且可作为动词使用，涵盖授权与惩罚双重功能。"
    },
    {
      "word_to_compare": "authorization",
      "analysis": "“Authorization” (授权) 专指正式赋予某人权力或许可，语义明确且积极；而 “sanction” 在表示批准时虽可互换，但更常用于官方或制度性语境，且常隐含法律或政治层面的权威性，使用范围更广、语义更厚重。"
    }
  ]
}