{
  "word": "sanctuary",
  "pronunciation": "sangk·choo·er·ee",
  "concise_definition": "n. 圣所, 避难所, 保护区",
  "forms": {
    "plural": "sanctuaries"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sacred or holy place, especially one dedicated to religious worship or housing a deity, often considered inviolable and protected by spiritual authority.",
      "explanation_cn": "指神圣或宗教场所，尤其用于宗教崇拜或供奉神灵，通常被视为不可侵犯并受宗教权威保护。",
      "example_en": "The ancient temple served as a sanctuary for pilgrims seeking divine guidance.",
      "example_cn": "这座古庙是朝圣者寻求神灵指引的圣所。"
    },
    {
      "pos": "noun",
      "explanation_en": "A place of safety and protection, especially for people or animals fleeing from danger, persecution, or harm.",
      "explanation_cn": "指为躲避危险、迫害或伤害而寻求庇护的安全场所，可用于人或动物。",
      "example_en": "The wildlife sanctuary provides a safe haven for endangered species.",
      "example_cn": "这个野生动物保护区为濒危物种提供了安全的栖息地。"
    },
    {
      "pos": "noun",
      "explanation_en": "A place or situation offering refuge from stress, conflict, or the pressures of everyday life, often emotionally or psychologically comforting.",
      "explanation_cn": "指能让人从压力、冲突或日常生活的烦扰中获得庇护与心灵慰藉的场所或状态。",
      "example_en": "Her garden is her sanctuary, where she finds peace after a long day.",
      "example_cn": "她的花园是她的避风港，在漫长的一天后，她在这里找到宁静。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "shelter",
      "analysis": "“Shelter” (庇护所) 更侧重于提供基本的物理保护，如遮风挡雨或抵御外力，常用于临时性或功能性需求，如灾民庇护所。而 “sanctuary” 不仅包含物理保护，还蕴含神圣性、情感慰藉或道德保护的深层含义，语义更丰富。"
    },
    {
      "word_to_compare": "refuge",
      "analysis": "“Refuge” (避难所) 与 “sanctuary” 在表示躲避危险时非常接近，常可互换。但 “refuge” 更中性、更强调功能性，多用于政治、战争或自然灾害语境；而 “sanctuary” 常带有宗教、道德或情感上的崇高色彩，有时暗示被法律或传统认可的不可侵犯性。"
    },
    {
      "word_to_compare": "haven",
      "analysis": "“Haven” (避风港) 与 “sanctuary” 都可指心理或情感上的安全之地，但 “haven” 更口语化、更侧重于安宁与舒适，常用于比喻（如‘a haven of peace’）；而 “sanctuary” 更正式，可能包含法律、宗教或生态保护的制度性含义，语义更庄重。"
    }
  ]
}