{
  "word": "sand",
  "pronunciation": "sænd",
  "concise_definition": "n. 沙子, 沙滩; v. 用砂纸打磨, 以沙覆盖",
  "forms": {
    "plural": "sands"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Fine, loose particles of rock or mineral, typically composed of quartz, found on beaches, deserts, and riverbeds.",
      "explanation_cn": "由岩石或矿物（通常是石英）组成的细小、松散颗粒，常见于海滩、沙漠和河床。",
      "example_en": "The children built a castle out of wet sand at the beach.",
      "example_cn": "孩子们在海滩上用湿沙子堆了一座城堡。"
    },
    {
      "pos": "noun",
      "explanation_en": "A stretch of land covered with sand, especially along a coast or in a desert.",
      "explanation_cn": "指被沙子覆盖的一片土地，尤指沿海岸或沙漠中的沙滩或沙地。",
      "example_en": "The Sahara is the largest hot desert in the world, with endless stretches of sand.",
      "example_cn": "撒哈拉是世界上最大的热带沙漠，拥有无尽的沙地。"
    },
    {
      "pos": "verb",
      "explanation_en": "To smooth or polish a surface by rubbing it with sandpaper or abrasive material.",
      "explanation_cn": "用砂纸或磨料摩擦表面，使其变得光滑或平整。",
      "example_en": "He sanded the wooden table before painting it.",
      "example_cn": "他在给木桌刷漆之前先打磨了表面。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover or coat something with sand, often to improve traction or absorb moisture.",
      "explanation_cn": "用沙子覆盖或涂覆某物，通常是为了增加摩擦力或吸收湿气。",
      "example_en": "The city spread sand on the icy roads after the snowstorm.",
      "example_cn": "暴风雪过后，城市在结冰的道路上撒了沙子。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "gravel",
      "analysis": "“Gravel”（碎石）指比沙子更大的、不规则的岩石碎片，通常直径在2毫米至75毫米之间，用于铺路或排水。而 “sand” 颗粒更细，流动性更强，常用于建筑、铸造或娱乐用途。两者在粒径和用途上有明显区别。"
    },
    {
      "word_to_compare": "dust",
      "analysis": "“Dust”（灰尘）是极其微小的颗粒，通常来自有机物或工业废料，肉眼难以分辨，常悬浮在空气中。而 “sand” 是可见的、较重的矿物颗粒，不会轻易飘散。沙子是地质产物，灰尘更多是环境副产品。"
    },
    {
      "word_to_compare": "soil",
      "analysis": "“Soil”（土壤）是包含有机质、矿物质、水分和微生物的复杂混合物，支持植物生长。而 “sand” 仅是土壤的一种物理成分，缺乏养分和保水能力。纯沙地通常不适合农业，而土壤是生命的基础。"
    }
  ]
}