{
  "word": "satellites",
  "pronunciation": "sat·uh·līts",
  "concise_definition": "n. 卫星, 人造卫星, 附属物",
  "forms": {
    "singular": "satellite"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An object that orbits a larger celestial body, either naturally (like the Moon) or artificially (launched by humans for communication, observation, or research).",
      "explanation_cn": "指围绕较大天体运行的物体，可以是自然的（如月球），也可以是人类发射的人造物体，用于通信、观测或科研。",
      "example_en": "The International Space Station relies on a network of satellites for global communication and navigation.",
      "example_cn": "国际空间站依靠一组卫星网络实现全球通信与导航。"
    },
    {
      "pos": "noun",
      "explanation_en": "A country, organization, or entity that is politically, economically, or culturally subordinate to a more powerful one, often acting under its influence or control.",
      "explanation_cn": "指在政治、经济或文化上依附于更强大实体的国家、组织或实体，通常受其影响或控制。",
      "example_en": "During the Cold War, many Eastern European nations were considered satellites of the Soviet Union.",
      "example_cn": "冷战期间，许多东欧国家被视为苏联的附属国。"
    },
    {
      "pos": "noun",
      "explanation_en": "A smaller or less important entity that exists in relation to or in support of a larger or more dominant one, often metaphorically.",
      "explanation_cn": "指在关系上依附于更大或更主导实体的较小或较不重要的事物，常用于比喻意义。",
      "example_en": "The small town became a satellite of the nearby metropolis, with most residents commuting daily for work.",
      "example_cn": "这个小镇成为附近大都市的附属区域，大多数居民每天通勤前往工作。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "moon",
      "analysis": "“Moon”（月球）特指自然卫星，是围绕行星运行的天然天体，而 “satellite” 是一个更广泛的术语，包括自然和人造的环绕体。所有月球都是卫星，但并非所有卫星都是月球。"
    },
    {
      "word_to_compare": "auxiliary",
      "analysis": "“Auxiliary”（辅助的）强调功能上的支持性，通常用于描述工具、系统或人员，如辅助电源或辅助人员。而 “satellite” 在比喻义中强调的是从属关系和依附性，常用于政治或地理语境，带有权力结构的含义。"
    },
    {
      "word_to_compare": "appendage",
      "analysis": "“Appendage”（附属物）多用于生物学或机械结构中，指身体或机器上附着的、非核心的组成部分，如肢体或附件。它强调物理连接，而 “satellite” 更强调功能或权力上的依附，不一定有物理连接。"
    }
  ]
}