{
  "word": "satellite",
  "pronunciation": "sat·uh·lait",
  "concise_definition": "n. 卫星, 人造卫星, 附属物",
  "forms": {
    "plural": "satellites"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A celestial body that orbits a larger body in space, such as the Moon orbiting Earth, or an artificial object launched into orbit around a planet for communication, observation, or scientific research.",
      "explanation_cn": "指围绕更大天体运行的天体，如月球绕地球运行；或指为通信、观测或科学研究而发射到行星轨道上的人造物体。",
      "example_en": "The International Space Station is a manned satellite that orbits Earth every 90 minutes.",
      "example_cn": "国际空间站是一个每90分钟绕地球运行一次的载人卫星。"
    },
    {
      "pos": "noun",
      "explanation_en": "A country, organization, or entity that is politically, economically, or culturally subordinate to a more powerful one, often acting under its influence or control.",
      "explanation_cn": "指在政治、经济或文化上从属于更强大实体的国家、组织或实体，通常受其影响或控制。",
      "example_en": "During the Cold War, many Eastern European countries were considered satellites of the Soviet Union.",
      "example_cn": "冷战期间，许多东欧国家被视为苏联的附属国。"
    },
    {
      "pos": "noun",
      "explanation_en": "A smaller or less important entity that exists in relation to and supports a larger or more dominant one, often metaphorically.",
      "explanation_cn": "指在关系上依附于更大或更主导实体的较小或较不重要的事物，常用于比喻意义。",
      "example_en": "The small town is essentially a satellite of the nearby metropolis, relying on it for jobs and services.",
      "example_cn": "这个小镇本质上是附近大都市的附属地，依赖它提供就业和服务。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "moon",
      "analysis": "“Moon”（月亮）特指自然卫星，是围绕行星运行的天然天体，如地球的月球。而 “satellite” 可以指自然的，也可以指人造的，范围更广。在非正式语境中，人们有时用 “moon” 比喻附属物，但其科学含义比 “satellite” 更狭窄。"
    },
    {
      "word_to_compare": "auxiliary",
      "analysis": "“Auxiliary”（辅助的）强调功能上的支持性，通常用于描述工具、系统或人员，如辅助电源、辅助人员。它不涉及空间轨道或从属关系，而 “satellite” 在比喻义中强调的是权力或结构上的依附性，具有更强的政治或系统性隐喻。"
    },
    {
      "word_to_compare": "appendage",
      "analysis": "“Appendage”（附属物）通常指生物体上附着的、非核心的肢体或部分，如尾巴或触角，强调物理上的连接和非独立性。而 “satellite” 在比喻用法中更侧重于功能或权力上的依赖，而非物理连接，常用于国家、城市或系统层面，语义范围更抽象。"
    }
  ]
}