{
  "word": "saturated",
  "pronunciation": "sæch·uh·rey·tɪd",
  "concise_definition": "adj. 饱和的, 浸透的, 充满的",
  "forms": {
    "comparative": "more saturated",
    "superlative": "most saturated"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Containing the maximum possible amount of a substance, especially a liquid or gas, that can be dissolved or absorbed under given conditions.",
      "explanation_cn": "在特定条件下含有某种物质（尤其是液体或气体）所能溶解或吸收的最大量，达到不能再容纳更多物质的状态。",
      "example_en": "The solution was saturated with salt, and no more could dissolve.",
      "example_cn": "这种溶液已经饱和了盐，无法再溶解更多了。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Completely soaked or impregnated with a liquid, often to the point of dripping or overflowing.",
      "explanation_cn": "被液体完全浸透或渗透，常达到滴水或溢出的程度。",
      "example_en": "The sponge was saturated with water after being left in the sink all day.",
      "example_cn": "这块海绵一整天都泡在水槽里，已经完全浸透了。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Filled to capacity with something, especially in the context of media, markets, or information, to the point of diminishing returns or overload.",
      "explanation_cn": "在媒体、市场或信息语境中，被某种内容填满到极限，导致回报递减或信息过载。",
      "example_en": "The market is saturated with similar smartphone models, making it hard for new brands to compete.",
      "example_cn": "智能手机市场已被类似型号充斥，新品牌很难竞争。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Of a color, having the maximum intensity or purity, with no added white, black, or gray.",
      "explanation_cn": "指颜色达到最大强度或纯度，未掺入任何白色、黑色或灰色。",
      "example_en": "She chose a saturated red for the accent wall to create a bold visual impact.",
      "example_cn": "她选择了一种纯正的红色作为强调墙的颜色，以产生强烈的视觉冲击。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "full",
      "analysis": "“Full”（满的）是一个通用词，泛指容器或空间被填满，但不强调是否达到物理或化学极限。而 “saturated” 更精确，特指在特定条件下达到溶解、吸收或承载能力的上限，常用于科学或技术语境。"
    },
    {
      "word_to_compare": "soaked",
      "analysis": "“Soaked”（湿透的）强调被液体浸透的状态，常用于日常口语，但不涉及化学饱和度的概念。而 “saturated” 不仅可用于液体浸透，还可用于描述气体、颜色、市场等抽象或专业情境，语义范围更广。"
    },
    {
      "word_to_compare": "overloaded",
      "analysis": "“Overloaded”（超载的）强调超出承受能力，常含负面含义，如系统崩溃或压力过大。而 “saturated” 描述的是达到理论最大容量，不一定有负面含义，有时只是客观状态，如饱和溶液是稳定状态。"
    },
    {
      "word_to_compare": "intense",
      "analysis": "“Intense”（强烈的）常用于描述感受、情绪或颜色的强烈程度，但不隐含“达到极限”的含义。而 “saturated” 在描述颜色时，特指纯度达到最高、无稀释，是色彩科学中的精确术语。"
    }
  ]
}