{
  "word": "savage",
  "pronunciation": "sav·ij",
  "concise_definition": "adj. 残酷的, 野蛮的; n. 野蛮人, 未开化的人",
  "forms": {
    "comparative": "savage",
    "superlative": "savage",
    "plural": "savages"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Characterized by extreme violence, cruelty, or lack of restraint; often describing behavior that is brutal, ferocious, or merciless.",
      "explanation_cn": "指具有极端暴力、残忍或无节制特征的；常用于描述野蛮、凶猛或无情的行为。",
      "example_en": "The savage attack left the victim with life-threatening injuries.",
      "example_cn": "这场残酷的袭击使受害者身受致命伤。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Existing in a wild, uncultivated, or untamed state; often used to describe nature or environments untouched by human civilization.",
      "explanation_cn": "指处于野生、未开垦或未驯服状态的；常用于描述未被人类文明触及的自然环境。",
      "example_en": "The island's savage landscape was dotted with jagged cliffs and dense forests.",
      "example_cn": "这座岛屿荒凉的景观布满了嶙峋的悬崖和茂密的森林。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person considered to be uncivilized, primitive, or lacking in cultural refinement, often used in a derogatory or outdated colonial context.",
      "explanation_cn": "指被认为未开化、原始或缺乏文化修养的人，常用于带有贬义或过时的殖民主义语境中。",
      "example_en": "Historical texts sometimes referred to indigenous peoples as 'savages,' a term now recognized as offensive and inaccurate.",
      "example_cn": "历史文献有时将原住民称为‘野蛮人’，如今这一术语被认为具有冒犯性且不准确。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ferocious",
      "analysis": "“Ferocious”（凶猛的）强调力量、攻击性和令人恐惧的强度，常用于动物或战斗场景，但不一定包含道德上的野蛮或残忍。而 “savage” 不仅指暴力，还隐含道德上的堕落或文明的缺失，情感色彩更强烈。"
    },
    {
      "word_to_compare": "barbaric",
      "analysis": "“Barbaric”（野蛮的）与 “savage” 非常接近，都指缺乏文明或人道的残忍行为，但 “barbaric” 更常用于批评制度性或系统性的暴行（如酷刑、战争罪行），而 “savage” 更偏向于描述个体行为或自然状态的原始性。"
    },
    {
      "word_to_compare": "wild",
      "analysis": "“Wild”（野生的）主要描述自然状态的未驯服性，如野生动物或荒野，中性或甚至带有美感。而 “savage” 在形容自然时带有威胁性、破坏性或令人不安的意味，情感上更负面，且常用于比喻人类行为的失控。"
    }
  ]
}