{
  "word": "saves",
  "pronunciation": "sāvz",
  "concise_definition": "v. 拯救, 节省, 保存; n. (体育) 抢救, 阻挡",
  "forms": {
    "base_form": "save",
    "third_person_singular": "saves",
    "past_tense": "saved",
    "past_participle": "saved",
    "present_participle": "saving"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To rescue someone or something from danger, harm, or destruction, often by taking timely or decisive action.",
      "explanation_cn": "指通过及时或果断的行动，将某人或某物从危险、伤害或毁灭中拯救出来。",
      "example_en": "The firefighter saves the child from the burning building.",
      "example_cn": "消防员从着火的大楼中救出了孩子。"
    },
    {
      "pos": "verb",
      "explanation_en": "To keep or store something for future use, especially money, time, or resources, to avoid waste or ensure availability.",
      "explanation_cn": "指为将来使用而保留或储存某物，尤其是金钱、时间或资源，以避免浪费或确保其可用性。",
      "example_en": "She saves a portion of her salary every month for emergencies.",
      "example_cn": "她每月都会节省一部分工资以备不时之需。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reduce the amount of something used, especially money, energy, or time, through careful management or efficiency.",
      "explanation_cn": "指通过精心管理或提高效率，减少某物（尤其是金钱、能源或时间）的使用量。",
      "example_en": "Turning off lights when not in use saves electricity.",
      "example_cn": "不用时关灯可以节省电力。"
    },
    {
      "pos": "noun",
      "explanation_en": "In sports, especially baseball or hockey, a successful defensive action that prevents a score or goal, typically by a goalkeeper or fielder.",
      "explanation_cn": "在体育运动中（尤其是棒球或冰球），指守门员或外场球员成功阻止对方得分或进球的防守动作。",
      "example_en": "The goalie made three crucial saves in the final minutes of the game.",
      "example_cn": "守门员在比赛最后几分钟做出了三次关键扑救。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rescue",
      "analysis": "“Rescue” (营救) 专指在紧急或危险情况下将人或物从致命威胁中救出，语义更强烈、更紧迫，通常涉及生命危险。而 “save” 语义更广，可涵盖从物理救援到节省资源等多种含义。"
    },
    {
      "word_to_compare": "preserve",
      "analysis": "“Preserve” (保存/保护) 强调维持原状、防止腐烂或退化，常用于食物、文物或自然环境，带有长期性和保护性。而 “save” 更侧重于为未来使用而保留，或防止损失，不一定强调保持原貌。"
    },
    {
      "word_to_compare": "conserve",
      "analysis": "“Conserve” (节约/保护) 多用于自然资源、能源或环境领域，强调可持续性与理性使用，语气更正式、更生态导向。而 “save” 更口语化，适用范围更广，包括节省金钱、时间等日常场景。"
    },
    {
      "word_to_compare": "block",
      "analysis": "“Block” (阻挡) 指物理上阻止某物通过或前进，如阻挡传球或进攻，但不必然导致得分被避免或结果被改变。而 “save” 在体育语境中特指成功阻止得分，隐含结果上的积极影响，是“有效阻挡”的结果。"
    }
  ]
}