{
  "word": "save",
  "pronunciation": "sāv",
  "concise_definition": "v. 拯救, 保存, 节省, 储存; n. 守门员的扑救",
  "forms": {
    "third_person_singular": "saves",
    "past_tense": "saved",
    "past_participle": "saved",
    "present_participle": "saving"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To rescue someone or something from danger, harm, or destruction, often by taking timely or decisive action.",
      "explanation_cn": "指通过及时或果断的行动，将某人或某物从危险、伤害或毁灭中拯救出来。",
      "example_en": "The firefighters saved the family from the burning building.",
      "example_cn": "消防员从着火的大楼中救出了这家人。"
    },
    {
      "pos": "verb",
      "explanation_en": "To keep something safe, preserved, or unused for future use, often to prevent waste or loss.",
      "explanation_cn": "指将某物妥善保存、保留或不使用，以备将来之需，通常是为了防止浪费或损失。",
      "example_en": "She saves her old letters in a wooden box.",
      "example_cn": "她把旧信件保存在一个木盒里。"
    },
    {
      "pos": "verb",
      "explanation_en": "To use less of something (especially money, time, or resources) than usual, resulting in a surplus or reduced expenditure.",
      "explanation_cn": "指比平常少用某种东西（尤其是金钱、时间或资源），从而产生盈余或减少支出。",
      "example_en": "We saved a lot of money by cooking at home instead of eating out.",
      "example_cn": "我们通过在家做饭而不是外出就餐省了不少钱。"
    },
    {
      "pos": "verb",
      "explanation_en": "To store digital data or files on a device for later retrieval.",
      "explanation_cn": "指将数字数据或文件存储在设备上，以便日后调用。",
      "example_en": "Don't forget to save your document before closing the program.",
      "example_cn": "关闭程序前别忘了保存文档。"
    },
    {
      "pos": "noun",
      "explanation_en": "In sports, especially soccer or hockey, a successful act of preventing a goal by stopping a shot with the hands, body, or equipment.",
      "explanation_cn": "在体育运动中（尤其是足球或曲棍球），指用手、身体或装备成功阻止对方射门得分的行为。",
      "example_en": "The goalkeeper made an incredible save in the final minute.",
      "example_cn": "守门员在最后一分钟做出了一次不可思议的扑救。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "preserve",
      "analysis": "“Preserve” (保存/保护) 更强调维持原状、防止腐烂或退化，常用于食物、文物或自然环境的长期保护。而 “save” 更广泛，可指从危险中拯救或节省资源，不一定强调保持原貌。"
    },
    {
      "word_to_compare": "rescue",
      "analysis": "“Rescue” (营救) 专指在紧急或危险情况下将人或动物从致命威胁中救出，语义更强烈、更紧迫。而 “save” 可用于更广泛的语境，包括非生命物体或抽象概念（如省钱、保存文件）。"
    },
    {
      "word_to_compare": "conserve",
      "analysis": "“Conserve” (节约/保护资源) 通常用于环境或自然资源的可持续管理，如节约用水、保护能源，带有强烈的责任感和长期规划色彩。而 “save” 更口语化，可指短期或个人行为的节省。"
    },
    {
      "word_to_compare": "store",
      "analysis": "“Store” (储存) 仅指物理或数字上的存放行为，不包含“为将来使用而保留”或“防止损失”的意图。而 “save” 在数字语境中隐含了“防止丢失”和“便于后续使用”的目的，语义更丰富。"
    }
  ]
}