{
  "word": "savior",
  "pronunciation": "sey·vye·er",
  "concise_definition": "n. 救世主, 救星, 救助者",
  "forms": {
    "plural": "saviors"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who saves someone from danger, harm, or a difficult situation, often at great personal cost or effort; can refer to a literal rescuer or a metaphorical figure who brings relief or solution.",
      "explanation_cn": "指在危险、伤害或困境中拯救他人的人，通常付出巨大个人代价或努力；可指实际的救援者，也可指带来解脱或解决办法的象征性人物。",
      "example_en": "The firefighter was hailed as a savior after pulling the child from the burning building.",
      "example_cn": "消防员从着火的大楼中救出孩子后，被奉为救星。"
    },
    {
      "pos": "noun",
      "explanation_en": "In religious contexts, especially Christianity, the divine figure who redeems humanity from sin and eternal damnation; traditionally refers to Jesus Christ.",
      "explanation_cn": "在宗教语境中，尤其在基督教中，指救赎人类脱离罪恶与永恒诅咒的神圣人物；传统上特指耶稣基督。",
      "example_en": "Christians believe Jesus is the savior of the world.",
      "example_cn": "基督徒相信耶稣是世界的救世主。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that provides unexpected or crucial help in a time of crisis, often used figuratively to express deep gratitude or relief.",
      "explanation_cn": "指在危机时刻提供意外或关键帮助的人或事物，常用于比喻性表达以传达深切的感激或解脱之情。",
      "example_en": "Her timely loan was a savior when I was about to lose my home.",
      "example_cn": "当我要失去家园时，她及时的借款成了我的救命稻草。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rescuer",
      "analysis": "“Rescuer” (救援者) 更侧重于在物理或紧急情况下实施直接救助的行为，如火灾、溺水等，强调行动本身，通常不带宗教或象征意义。而 “savior” 语义更广，可包含精神、情感或象征层面的拯救，甚至用于夸张的比喻。"
    },
    {
      "word_to_compare": "deliverer",
      "analysis": "“Deliverer” (解救者) 与 “savior” 在宗教语境中常可互换，尤其在《圣经》翻译中，但 “deliverer” 更强调从束缚、压迫或奴役中被释放，如以色列人出埃及。而 “savior” 更强调从罪恶、死亡或永恒惩罚中被拯救，带有救赎的神学内涵。"
    },
    {
      "word_to_compare": "hero",
      "analysis": "“Hero” (英雄) 指因勇敢、牺牲或非凡成就而受尊敬的人，其核心是勇气与榜样作用，不一定涉及拯救他人于生死或精神危机。而 “savior” 必须包含“拯救”这一核心行为，且常伴随被救者的依赖与感恩，情感色彩更强烈。"
    }
  ]
}