{
  "word": "savoy",
  "pronunciation": "suh·voi",
  "concise_definition": "n. 萨沃伊（地名/品种）, 萨沃伊卷心菜, 萨沃伊风格",
  "forms": {
    "plural": "savoyes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A region in the Alps spanning parts of modern-day France and Italy, historically known as the Duchy of Savoy, which played a significant role in European politics and culture.",
      "explanation_cn": "位于阿尔卑斯山区的一个历史地区，横跨现今法国和意大利的部分领土，曾为萨沃伊公国，在欧洲政治与文化中具有重要地位。",
      "example_en": "The House of Savoy ruled Italy until the abolition of the monarchy in 1946.",
      "example_cn": "萨沃伊王朝统治意大利，直至1946年君主制被废除。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of cabbage with crinkled, loose, green leaves, known for its tender texture and mild flavor, often used in European cuisine.",
      "explanation_cn": "一种卷心菜品种，叶片皱褶、松散、呈绿色，质地柔嫩、味道清淡，常用于欧洲料理。",
      "example_en": "She sautéed savoy cabbage with garlic and olive oil for a simple winter side dish.",
      "example_cn": "她用大蒜和橄榄油炒了萨沃伊卷心菜，作为一道简单的冬季配菜。"
    },
    {
      "pos": "noun",
      "explanation_en": "A style or design associated with the cultural heritage of the Savoy region, especially in architecture, furnishings, or decorative arts characterized by elegance and refinement.",
      "explanation_cn": "与萨沃伊地区文化遗产相关的风格或设计，尤指在建筑、家具或装饰艺术中体现的优雅与精致特征。",
      "example_en": "The hotel lobby featured a Savoy-style chandelier and gilded moldings.",
      "example_cn": "酒店大堂装饰着萨沃伊风格的吊灯和镀金雕花。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cabbage",
      "analysis": "“Cabbage”（卷心菜）是通用术语，泛指所有种类的卷心菜，而 “savoy” 是其中一种特定品种，以皱叶和柔嫩口感为特征。因此，savoy 是 cabbage 的子类，具有更具体的形态和风味属性。"
    },
    {
      "word_to_compare": "duchy",
      "analysis": "“Duchy”（公国）是一个政治实体的通用名称，指由公爵统治的领地；而 “Savoy” 是一个具体的地名，特指历史上著名的萨沃伊公国。因此，Savoy 是 duchy 的一个实例，而非同义词。"
    },
    {
      "word_to_compare": "elegant",
      "analysis": "“Elegant”（优雅的）是描述风格的形容词，而 “Savoy” 作为名词时，可指代一种具有优雅特质的文化风格。因此，Savoy 风格可能体现 elegance，但本身是文化专有名词，不能直接等同于形容词。"
    }
  ]
}