{
  "word": "scaled",
  "pronunciation": "skāld",
  "concise_definition": "adj. 按比例的, 规模庞大的; v. 攀登, 按比例调整 (scale 的过去式和过去分词)",
  "forms": {
    "base_form": "scale",
    "third_person_singular": "scales",
    "present_participle": "scaling",
    "past_tense": "scaled",
    "past_participle": "scaled"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Adjusted or arranged according to a particular ratio or proportion, often to fit a specific size, capacity, or standard.",
      "explanation_cn": "根据特定比例或比率进行调整或安排的，通常用于适应特定的尺寸、容量或标准。",
      "example_en": "The model was scaled down to one-tenth the size of the original building.",
      "example_cn": "这个模型按原建筑的十分之一比例缩小。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or involving a large scale, often implying significant size, scope, or impact.",
      "explanation_cn": "涉及大规模的，通常指规模、范围或影响巨大。",
      "example_en": "The project required scaled infrastructure to support millions of users.",
      "example_cn": "该项目需要大规模的基础设施来支持数百万用户。"
    },
    {
      "pos": "verb",
      "explanation_en": "To climb or ascend something steep or difficult, especially a wall, cliff, or mountain.",
      "explanation_cn": "攀登陡峭或困难的物体，尤其是墙壁、悬崖或山峰。",
      "example_en": "The climbers scaled the sheer rock face with ropes and gear.",
      "example_cn": "登山者用绳索和装备攀上了陡峭的岩壁。"
    },
    {
      "pos": "verb",
      "explanation_en": "To adjust the size, amount, or degree of something proportionally to fit a new context or requirement.",
      "explanation_cn": "按比例调整某物的大小、数量或程度，以适应新的情境或需求。",
      "example_en": "The company scaled its operations to meet growing demand.",
      "example_cn": "公司扩大了运营规模以应对不断增长的需求。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "size",
      "analysis": "“Size” (大小) 是一个中性名词，仅描述物体的物理维度或数量，不涉及比例关系或调整过程。而 “scaled” 强调的是根据某种比例对原始对象进行的系统性放大或缩小，具有操作性和相对性。"
    },
    {
      "word_to_compare": "expanded",
      "analysis": "“Expanded” (扩大) 指在范围、数量或规模上的单纯增加，不必然保持比例关系。例如，公司扩大办公室面积。而 “scaled” 强调的是按比例调整，可能包括放大、缩小或重新配置，更注重结构与比例的一致性。"
    },
    {
      "word_to_compare": "climbed",
      "analysis": "“Climbed” (攀爬) 是一个通用动词，泛指向上移动，可用于楼梯、梯子或山坡等。而 “scaled” 专指攀爬陡峭、困难或垂直的表面，如岩壁或高墙，带有技术性、挑战性和专业性的语义色彩。"
    }
  ]
}