{
  "word": "scales",
  "pronunciation": "skālz",
  "concise_definition": "n. 天平, 鳞片, 比例, 音阶; v. 称重, 鳞片状覆盖, 攀爬",
  "forms": {
    "singular": "scale"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A device for measuring weight or mass, typically consisting of a beam or digital display that balances or compares objects.",
      "explanation_cn": "一种用于测量重量或质量的装置，通常由横梁或数字显示屏组成，通过平衡或比较物体来确定其质量。",
      "example_en": "She placed the fruit on the kitchen scales to check its weight.",
      "example_cn": "她把水果放在厨房秤上，检查它的重量。"
    },
    {
      "pos": "noun",
      "explanation_en": "Small, thin, flat plates that cover the skin of fish, reptiles, and some other animals, providing protection and reducing friction.",
      "explanation_cn": "覆盖鱼类、爬行动物和其他一些动物皮肤的细小、扁平的片状结构，用于保护身体并减少摩擦。",
      "example_en": "The snake shed its old scales as it grew larger.",
      "example_cn": "随着体型增大，蛇蜕去了旧的鳞片。"
    },
    {
      "pos": "noun",
      "explanation_en": "The relative size or proportion of something in relation to another, often used in maps, models, or comparisons.",
      "explanation_cn": "某物相对于另一物的相对大小或比例，常用于地图、模型或比较中。",
      "example_en": "The model was built on a scale of 1:100, meaning one centimeter represented one meter.",
      "example_cn": "这个模型按1:100的比例建造，即一厘米代表一米。"
    },
    {
      "pos": "noun",
      "explanation_en": "A series of musical notes arranged in ascending or descending order, forming the foundation of melodies and harmonies.",
      "explanation_cn": "按上升或下降顺序排列的一系列音符，构成旋律和和声的基础。",
      "example_en": "The pianist practiced the C major scale for twenty minutes.",
      "example_cn": "钢琴家练习了C大调音阶二十分钟。"
    },
    {
      "pos": "verb",
      "explanation_en": "To measure or determine the weight or mass of something using a scale.",
      "explanation_cn": "使用秤来测量或确定某物的重量或质量。",
      "example_en": "The pharmacist scaled the medicine precisely to ensure the correct dosage.",
      "example_cn": "药剂师精确称量了药物，以确保剂量准确。"
    },
    {
      "pos": "verb",
      "explanation_en": "To climb or move up a steep surface, especially one that is difficult or dangerous.",
      "explanation_cn": "攀爬陡峭或危险的表面。",
      "example_en": "The climbers scaled the sheer rock face with ropes and gear.",
      "example_cn": "登山者用绳索和装备攀上了陡峭的岩壁。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove or come off in scales, especially referring to skin or paint.",
      "explanation_cn": "以鳞片状剥落或脱落，尤指皮肤或油漆。",
      "example_en": "After the sunburn, her skin began to scale and peel.",
      "example_cn": "晒伤后，她的皮肤开始脱皮。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "balance",
      "analysis": "“Balance”（平衡）强调的是两个或多个物体之间的重量相等或状态稳定，常用于抽象语境（如平衡生活）。而 “scale” 是实现称重的工具或动作本身，具有明确的测量功能。"
    },
    {
      "word_to_compare": "scale (music)",
      "analysis": "在音乐语境中，‘scale’（音阶）是特定音高序列的系统性排列，而 ‘mode’（调式）或 ‘chord’（和弦）是其衍生结构。‘Scale’ 强调线性顺序，不同于和弦的多音同时发声。"
    },
    {
      "word_to_compare": "shard",
      "analysis": "“Shard”（碎片）指破裂后产生的尖锐、不规则的小块，常用于玻璃、陶瓷等脆性材料。而 “scale” 是生物体自然生长的、规则排列的薄片，具有功能性而非破坏性。"
    },
    {
      "word_to_compare": "proportion",
      "analysis": "“Proportion”（比例）是抽象的数学或美学关系，描述部分与整体或部分之间的比率。而 “scale” 在此语境中是比例的具体应用形式，如地图比例尺，具有可测量和可视化的物理体现。"
    }
  ]
}