{
  "word": "scalp",
  "pronunciation": "skalp",
  "concise_definition": "n. 头皮, 剥取; v. 剥去头皮, 大获全胜",
  "forms": {
    "plural": "scalps",
    "third_person_singular": "scalps",
    "past_tense": "scalped",
    "past_participle": "scalped",
    "present_participle": "scalping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The skin covering the top of the head, including the hair follicles and underlying tissues.",
      "explanation_cn": "指覆盖头部顶部的皮肤，包括毛囊及下方组织。",
      "example_en": "She applied a soothing lotion to her scalp to relieve the dryness and itching.",
      "example_cn": "她将一种舒缓的乳液涂抹在头皮上，以缓解干燥和瘙痒。"
    },
    {
      "pos": "noun",
      "explanation_en": "The skin and hair removed from a person's head, especially as a trophy in warfare or ritual practices.",
      "explanation_cn": "指从人头上剥下的皮肤和头发，尤指在战争或仪式中作为战利品。",
      "example_en": "Historical accounts describe how some Native American tribes took scalps as symbols of victory.",
      "example_cn": "历史记载描述了某些美洲原住民部落将头皮作为胜利象征的做法。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove the scalp from a person's head, typically in a violent or historical context.",
      "explanation_cn": "指在暴力或历史背景下从人头上剥下头皮。",
      "example_en": "The ancient warriors scalped their enemies after battle.",
      "example_cn": "古代战士在战斗后剥下敌人的头皮。"
    },
    {
      "pos": "verb",
      "explanation_en": "To obtain a large profit or advantage, especially in a financial or commercial context; to cheat or overcharge someone.",
      "explanation_cn": "指在金融或商业语境中获得巨额利润，尤指通过欺诈或高价剥削他人。",
      "example_en": "The ticket reseller scalped the concert tickets for triple the original price.",
      "example_cn": "票贩子将演唱会门票加价三倍转售。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "skin",
      "analysis": "“Skin”（皮肤）是泛指人体或动物体表的外层组织，适用于全身任何部位。而 “scalp” 是特指头部的皮肤，具有解剖学上的专指性，且常与毛发相关。"
    },
    {
      "word_to_compare": "cranium",
      "analysis": "“Cranium”（颅骨）指头骨的骨性结构，是保护大脑的硬质骨骼，属于解剖学中的骨骼系统。而 “scalp” 是覆盖在颅骨之上的软组织层，包括皮肤、肌肉和结缔组织，两者属于不同解剖层次。"
    },
    {
      "word_to_compare": "profiteer",
      "analysis": "“Profiteer”（牟取暴利者）是名词，泛指通过不道德或投机手段获取超额利润的人。而 “scalp” 作为动词时，特指以高价倒卖商品（如门票）的行为，语义更具体、更具动作性，常用于口语和商业语境中。"
    }
  ]
}