{
  "word": "scarred",
  "pronunciation": "skard",
  "concise_definition": "adj. 有疤痕的, 受创伤的, 留下伤痕的",
  "forms": {
    "base_form": "scar",
    "comparative": "scarred",
    "superlative": "scarred"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having visible marks or lines on the skin or surface as a result of injury, healing, or damage; often implying physical trauma that has left a lasting impression.",
      "explanation_cn": "指皮肤或表面因受伤、愈合或损伤而留下的可见痕迹，通常暗示身体曾遭受创伤并留下持久印记。",
      "example_en": "His arms were scarred from the fire accident he survived as a child.",
      "example_cn": "他的手臂上留有童年时从火灾中幸存下来的疤痕。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Emotionally or psychologically damaged as a result of a painful experience; used metaphorically to describe lasting emotional wounds.",
      "explanation_cn": "比喻性地指因痛苦经历而造成的情感或心理创伤，形容内心留下持久的伤痕。",
      "example_en": "She was a scarred survivor of abuse, struggling to trust others even after years of therapy.",
      "example_cn": "她是一位遭受虐待的幸存者，内心满是创伤，即使经过多年的治疗，仍难以信任他人。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Marked by enduring signs of hardship, conflict, or decay, often applied to landscapes, objects, or societal conditions.",
      "explanation_cn": "形容景观、物体或社会状况因长期的苦难、冲突或衰败而留下持久的痕迹。",
      "example_en": "The scarred landscape of the war zone still bore the ruins of bombed-out buildings.",
      "example_cn": "战区那满目疮痍的大地仍可见被炸毁建筑的废墟。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "marked",
      "analysis": "“Marked”（有痕迹的）泛指任何明显的印记或特征，可以是中性的、积极的或消极的，如“marked improvement”（显著改善）。“Scarred” 则特指由伤害或创伤造成的负面、持久的痕迹，情感色彩更强烈且通常带有痛苦的含义。"
    },
    {
      "word_to_compare": "injured",
      "analysis": "“Injured”（受伤的）描述的是当前或近期的生理损伤状态，强调的是伤害发生时的状况，而 “scarred” 强调的是伤害愈合后留下的永久性后果。一个人可以是 injured 但未 scarred，但一旦 scarred，就必然曾 injured。"
    },
    {
      "word_to_compare": "traumatized",
      "analysis": "“Traumatized”（受创伤的）主要指心理或情感上的严重冲击，常用于描述急性或严重的心理反应，不一定有外在可见的痕迹。“Scarred” 可以是心理上的，但更常与外在可见的伤痕相关联，且暗示创伤已内化为持久的特征。两者可重叠，但 “traumatized” 更侧重过程，而 “scarred” 更侧重结果。"
    }
  ]
}