{
  "word": "scene",
  "pronunciation": "seesn",
  "concise_definition": "n. 场景, 场面, 景色, 事件发生地",
  "forms": {
    "plural": "scenes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A particular view or setting, especially one that is visually striking or significant, often in a natural or urban environment.",
      "explanation_cn": "指一个特定的视觉景象或环境，尤其指具有视觉冲击力或重要意义的自然或城市景观。",
      "example_en": "The sunset over the mountains created a breathtaking scene.",
      "example_cn": "群山之上的日落构成了一幅令人叹为观止的景色。"
    },
    {
      "pos": "noun",
      "explanation_en": "A section of a play, film, or other performance that takes place in a single location and time, forming a coherent unit of the narrative.",
      "explanation_cn": "指戏剧、电影或其他表演中发生在单一地点和时间的一段情节，构成叙事中的一个连贯单元。",
      "example_en": "The final scene of the movie left the audience in tears.",
      "example_cn": "电影的最后一个场景让观众泪流满面。"
    },
    {
      "pos": "noun",
      "explanation_en": "A public or social situation, especially one that is dramatic, chaotic, or emotionally charged.",
      "explanation_cn": "指一种公开或社交情境，尤其指具有戏剧性、混乱或情绪激烈的特点。",
      "example_en": "There was a huge scene at the airport when the flight was canceled.",
      "example_cn": "航班取消时，机场里闹出了很大的风波。"
    },
    {
      "pos": "noun",
      "explanation_en": "The people or activities associated with a particular social or cultural group, especially in the arts or entertainment industry.",
      "explanation_cn": "指与特定社会或文化群体相关的人员或活动，尤指艺术或娱乐行业中的圈子。",
      "example_en": "She’s been part of the downtown art scene for over a decade.",
      "example_cn": "她已活跃于市中心艺术圈十多年。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "setting",
      "analysis": "“Setting”（背景/环境）更侧重于故事或事件发生的物理或时间背景，通常是静态的、描述性的框架，如‘19世纪的伦敦’或‘一座废弃的工厂’。而 ‘scene’ 更强调具体的视觉画面、动态情境或情感氛围，常包含人物行为和事件。"
    },
    {
      "word_to_compare": "view",
      "analysis": "“View”（视野/景色）通常指从某个固定位置看到的视觉景象，偏重客观的自然或城市景观，如‘从山顶俯瞰的view’。而 ‘scene’ 不仅包含视觉元素，还常隐含情感、叙事或社会互动的维度，范围更广。"
    },
    {
      "word_to_compare": "incident",
      "analysis": "“Incident”（事件）指一个具体的、通常意外或不寻常的事件，强调其发生的过程和后果，具有较强的客观性和事实性。而 ‘scene’ 更侧重于事件发生时的氛围、情绪或公众反应，常带有主观或戏剧性色彩。"
    }
  ]
}