{
  "word": "schizophrenic",
  "pronunciation": "skit·suh·nof·rən",
  "concise_definition": "adj. 精神分裂症的, 精神错乱的; n. 患精神分裂症的人",
  "forms": {
    "comparative": "more schizophrenic",
    "superlative": "most schizophrenic",
    "plural": "schizophrenics"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characteristic of schizophrenia, a severe mental disorder marked by disturbances in thought, perception, emotion, and behavior, often including hallucinations and delusions.",
      "explanation_cn": "与精神分裂症相关或具有其特征的，指一种严重的心理疾病，表现为思维、感知、情绪和行为的紊乱，常伴有幻觉和妄想。",
      "example_en": "The film portrays a schizophrenic protagonist who struggles to distinguish reality from hallucination.",
      "example_cn": "这部电影描绘了一位患有精神分裂症的主角，他难以分辨现实与幻觉。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used figuratively to describe something that is contradictory, inconsistent, or marked by conflicting elements or attitudes.",
      "explanation_cn": "比喻性地用于描述某事物充满矛盾、不一致，或具有相互冲突的元素或态度。",
      "example_en": "The company's policy is schizophrenic—promoting sustainability while continuing to pollute.",
      "example_cn": "这家公司的政策自相矛盾：一边倡导可持续发展，一边继续污染环境。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person diagnosed with schizophrenia; a term that is considered outdated and potentially offensive in clinical contexts, though still used colloquially.",
      "explanation_cn": "被诊断患有精神分裂症的人；在临床语境中该词已过时且可能具有冒犯性，但在口语中仍被使用。",
      "example_en": "He was labeled a schizophrenic in his youth, but later received effective treatment and led a productive life.",
      "example_cn": "他年轻时被贴上精神分裂症患者的标签，但后来接受了有效治疗，过上了富有成效的生活。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "psychotic",
      "analysis": "“Psychotic”（精神病的）是一个更广泛的临床术语，指任何失去现实检验能力的状态，包括幻觉、妄想等，可由精神分裂症、重度抑郁、双相障碍或药物引起。而 “schizophrenic” 专指精神分裂症这一特定疾病，范围更窄。并非所有精神病患者都是精神分裂症患者，但所有精神分裂症患者在急性期都可能表现出精神病性症状。"
    },
    {
      "word_to_compare": "delusional",
      "analysis": "“Delusional”（妄想的）仅指持有与现实严重不符的、固执的错误信念，是精神分裂症的一个症状，但不是全部。一个人可以有妄想而不具备其他精神分裂症特征（如幻听、思维紊乱）。因此，“delusional” 是症状层面的描述，而 “schizophrenic” 是疾病诊断层面的术语。"
    },
    {
      "word_to_compare": "crazy",
      "analysis": "“Crazy”（疯狂的）是口语化、非专业且常具贬义的词，泛指行为古怪、情绪失控或不合常理，完全不具备医学意义。而 “schizophrenic” 是医学术语，尽管在日常语言中被误用，但其本义指向一种有明确诊断标准的严重精神疾病。使用 “crazy” 描述精神分裂症患者会加剧污名化。"
    }
  ]
}