{
  "word": "school",
  "pronunciation": "skool",
  "concise_definition": "n. 学校, 学派, 鱼群; v. 教育, 训练",
  "forms": {
    "plural": "schools",
    "third_person_singular": "schools",
    "past_tense": "schoolled",
    "past_participle": "schoolled",
    "present_participle": "schooling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An institution for educating children or young people, typically under the guidance of trained teachers and following a structured curriculum.",
      "explanation_cn": "指在受过培训的教师指导下，按照系统课程对儿童或青少年进行教育的机构。",
      "example_en": "She sent her children to a private school in the city.",
      "example_cn": "她把孩子送到了城里的一所私立学校。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of people who share a common approach, style, or philosophy, especially in art, literature, or science.",
      "explanation_cn": "指在艺术、文学或科学等领域中持有共同方法、风格或理念的一群人，即学派。",
      "example_en": "The Impressionist school revolutionized painting in the 19th century.",
      "example_cn": "印象派学派在19世纪彻底改变了绘画艺术。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large group of fish swimming together in a coordinated way, often for protection or feeding.",
      "explanation_cn": "指大量鱼类以协调方式一起游动，通常为了保护或觅食。",
      "example_en": "A school of tuna passed beneath the boat.",
      "example_cn": "一群金枪鱼从船下游过。"
    },
    {
      "pos": "verb",
      "explanation_en": "To train or educate someone, especially in a particular skill or behavior, often through repeated practice or discipline.",
      "explanation_cn": "指通过反复练习或纪律训练来教育或培养某人掌握某种技能或行为。",
      "example_en": "The coach schooled the team in defensive tactics.",
      "example_cn": "教练训练球队掌握防守战术。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "academy",
      "analysis": "“Academy”（学院）通常指更高层次或专业化的教育机构，如军事学院、艺术学院，带有更正式、精英或研究导向的色彩。而 “school” 更通用，涵盖从幼儿园到中学的各级教育机构，语义范围更广。"
    },
    {
      "word_to_compare": "university",
      "analysis": "“University”（大学）是提供高等教育和授予学位的机构，强调学术研究和专业训练。而 “school” 通常指基础教育阶段，或作为大学内的一个学院（如法学院），但单独使用时不指代大学本身。"
    },
    {
      "word_to_compare": "class",
      "analysis": "“Class”（班级）指在一所学校内由特定教师教授的一组学生，是学校的基本教学单位。而 “school” 是包含多个班级、教师和行政体系的完整机构。两者是整体与部分的关系。"
    }
  ]
}