{
  "word": "scholastic",
  "pronunciation": "skuh·las·tik",
  "concise_definition": "adj. 学术的, 学校的, 学生的",
  "forms": {
    "comparative": "scholastic",
    "superlative": "scholastic"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to schools, education, or academic studies, especially in a formal or traditional context.",
      "explanation_cn": "与学校、教育或学术研究相关的，尤其指在正式或传统语境中的学业活动。",
      "example_en": "The scholastic achievements of the students were celebrated at the annual awards ceremony.",
      "example_cn": "学生们在年度颁奖典礼上因其学术成就而受到表彰。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Concerned with academic learning rather than practical or real-world experience; often implying theoretical or abstract focus.",
      "explanation_cn": "侧重于学术学习而非实践或现实经验，常暗示理论性或抽象性倾向。",
      "example_en": "His argument was purely scholastic, lacking any application to real-life situations.",
      "example_cn": "他的论点纯属学术性的，缺乏对现实情境的任何应用。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Historically referring to the medieval system of philosophy and theology based on logic and dialectic reasoning, especially as developed by thinkers like Thomas Aquinas.",
      "explanation_cn": "历史上指中世纪基于逻辑与辩证推理的哲学与神学体系，尤指托马斯·阿奎那等思想家所发展的体系。",
      "example_en": "Scholastic philosophy dominated European universities for centuries.",
      "example_cn": "经院哲学在欧洲大学中主导了数个世纪。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "academic",
      "analysis": "“Academic”（学术的）范围更广，泛指与高等教育、研究和理论相关的所有内容，可涵盖大学、研究所等机构；而 “scholastic” 更强调学校教育体系，尤其是中小学或传统教学环境，有时带有保守或脱离实践的意味。"
    },
    {
      "word_to_compare": "educational",
      "analysis": "“Educational”（教育的）是更通用的词，指任何具有教育意义或目的的事物，包括非正式学习（如纪录片、游戏）；而 “scholastic” 专指制度化、课程导向的学校教育，语义更狭窄且正式。"
    },
    {
      "word_to_compare": "intellectual",
      "analysis": "“Intellectual”（智力的/思想的）强调思维能力、理性分析和抽象思考，可适用于个人或文化层面；而 “scholastic” 侧重于制度化的学习环境和教学内容，不一定涉及高深思辨，有时甚至指机械的死记硬背。"
    }
  ]
}