{
  "word": "science",
  "pronunciation": "sai·uhns",
  "concise_definition": "n. 科学, 学科, 系统知识",
  "forms": {
    "plural": "sciences"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A systematic enterprise that builds and organizes knowledge in the form of testable explanations and predictions about the natural world, based on empirical evidence and the scientific method.",
      "explanation_cn": "一种系统性的事业，通过实证证据和科学方法，构建并组织关于自然世界的可检验的解释与预测知识。",
      "example_en": "Physics, chemistry, and biology are all branches of natural science.",
      "example_cn": "物理学、化学和生物学都是自然科学的分支。"
    },
    {
      "pos": "noun",
      "explanation_en": "A specific branch or field of study concerned with a particular area of knowledge, often used in plural form to denote academic disciplines.",
      "explanation_cn": "指某一特定知识领域的学科或研究分支，常以复数形式表示各类学术学科。",
      "example_en": "She majored in the sciences at university, focusing on environmental science and genetics.",
      "example_cn": "她在大学主修理科，专注于环境科学和遗传学。"
    },
    {
      "pos": "noun",
      "explanation_en": "The body of knowledge or principles derived from scientific study, often contrasted with art, belief, or intuition.",
      "explanation_cn": "指通过科学研究所得的知识或原理体系，常与艺术、信仰或直觉相对比。",
      "example_en": "The science of climate change has convinced most policymakers of the need for urgent action.",
      "example_cn": "气候变化的科学证据已使大多数政策制定者认识到采取紧急行动的必要性。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "knowledge",
      "analysis": "“Knowledge”（知识）是一个更广泛、更通用的词，泛指通过经验、学习或研究获得的任何信息或理解，包括主观、非系统性的内容。而 “science” 特指通过系统观察、实验和逻辑推理获得的客观、可验证的知识体系。"
    },
    {
      "word_to_compare": "technology",
      "analysis": "“Technology”（技术）指将科学知识应用于实际目的的工具、方法或系统，强调应用与实践。而 “science” 侧重于发现和理解自然规律本身，是技术的基础，但不直接涉及制造或使用产品。"
    },
    {
      "word_to_compare": "discipline",
      "analysis": "“Discipline”（学科）泛指任何有组织的知识体系或学术领域，如历史、哲学、经济学等，不一定依赖实证方法。而 “science” 是一种特定类型的学科，其核心特征是使用可重复的实验和可证伪的假设来建立知识。"
    }
  ]
}