{
  "word": "scoop",
  "pronunciation": "skoop",
  "concise_definition": "n. 铲子, 一铲, 独家新闻; v. 挖, 舀, 获取独家新闻",
  "forms": {
    "third_person_singular": "scoops",
    "past_tense": "scooped",
    "past_participle": "scooped",
    "present_participle": "scooping",
    "plural": "scoops"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A tool with a deep bowl-shaped end, typically used for lifting or moving loose material such as snow, ice, or soil.",
      "explanation_cn": "一种带有深碗状头部的工具，通常用于铲起或搬运松散物质，如雪、冰或土壤。",
      "example_en": "He used a snow scoop to clear the driveway after the storm.",
      "example_cn": "风暴过后，他用雪铲清理了车道。"
    },
    {
      "pos": "noun",
      "explanation_en": "A portion of something scooped up, especially ice cream or a similar soft food.",
      "explanation_cn": "用铲子舀起的一份东西，尤指冰淇淋或类似软质食物。",
      "example_en": "She ordered a double scoop of chocolate ice cream.",
      "example_cn": "她点了一份双球巧克力冰淇淋。"
    },
    {
      "pos": "noun",
      "explanation_en": "An exclusive piece of news or information obtained and published before others, often by a journalist or media outlet.",
      "explanation_cn": "指记者或媒体机构率先获取并发布的独家新闻或信息。",
      "example_en": "The newspaper broke the scoop about the mayor’s resignation.",
      "example_cn": "这家报纸率先披露了市长辞职的独家新闻。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove or gather something with a scoop or similar tool, especially in a quick or casual manner.",
      "explanation_cn": "用铲子或类似工具快速或随意地舀起或收集某物。",
      "example_en": "The children scooped up sand to build a castle.",
      "example_cn": "孩子们用沙子堆砌城堡。"
    },
    {
      "pos": "verb",
      "explanation_en": "To obtain exclusive information or news before others, especially in journalism.",
      "explanation_cn": "尤指在新闻业中，抢先获取独家信息或新闻。",
      "example_en": "The reporter scooped the competition by revealing the scandal two days earlier.",
      "example_cn": "这位记者提前两天揭露了丑闻，抢到了独家新闻。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "spoon",
      "analysis": "“Spoon”（勺子）通常指用于进食的细小餐具，形状较浅，主要用于盛取液体或软食；而 “scoop” 更深、更宽，专为大量舀取松散物质（如雪、冰激凌、沙子）设计，功能更偏向于搬运而非进食。"
    },
    {
      "word_to_compare": "exclusive",
      "analysis": "“Exclusive”（独家的）是形容词，描述信息的独占性；而 “scoop” 作为名词时，特指那条被抢先发布的独家新闻本身，是具体事件或成果，语义更具体、更具新闻行业术语色彩。"
    },
    {
      "word_to_compare": "break",
      "analysis": "“Break”（披露）作为动词时，常与新闻搭配，如 “break a story”，强调首次公开；而 “scoop” 更强调在竞争中抢先一步获得并发布，隐含了“战胜对手”的意味，语义上更富竞争性和成就感。"
    }
  ]
}