{
  "word": "scoring",
  "pronunciation": "skaw·ring",
  "concise_definition": "n. 得分, 记分; v. 得分, 获得, 成功取得",
  "forms": {
    "base_form": "score",
    "third_person_singular": "scores",
    "past_tense": "scored",
    "past_participle": "scored",
    "present_participle": "scoring"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of earning points in a game, competition, or assessment, or the total number of points achieved.",
      "explanation_cn": "在游戏、比赛或评估中获得分数的行为，或所获得的总分数。",
      "example_en": "His final scoring in the basketball game was 32 points.",
      "example_cn": "他在篮球比赛中的最终得分是32分。"
    },
    {
      "pos": "noun",
      "explanation_en": "A success or achievement, especially one that is notable or hard-won, often used informally.",
      "explanation_cn": "一种成功或成就，尤指值得注意或来之不易的成果，常用于非正式语境。",
      "example_en": "Landing that client was a big scoring for the sales team.",
      "example_cn": "签下那个客户是销售团队的一大成就。"
    },
    {
      "pos": "verb",
      "explanation_en": "To earn points in a game or competition by successfully completing a specific action (e.g., hitting a target, crossing a line, or making a goal).",
      "explanation_cn": "在比赛中通过完成特定动作（如击中目标、越过底线或进球）来获得分数。",
      "example_en": "She scored a goal in the final minute of the match.",
      "example_cn": "她在比赛的最后一分钟进了一球。"
    },
    {
      "pos": "verb",
      "explanation_en": "To achieve or obtain something desirable, especially through effort or skill, often in contexts beyond sports (e.g., drugs, information, or opportunities).",
      "explanation_cn": "通过努力或技巧获得某种理想的事物，常用于体育以外的语境（如毒品、信息或机会）。",
      "example_en": "He scored some rare vinyl records at the flea market.",
      "example_cn": "他在跳蚤市场上淘到了几张稀有的黑胶唱片。"
    },
    {
      "pos": "verb",
      "explanation_en": "To receive a grade or evaluation, especially in an academic or testing context.",
      "explanation_cn": "在学术或考试语境中获得评分或评价。",
      "example_en": "The exam papers were scored by a team of experienced teachers.",
      "example_cn": "试卷由一组经验丰富的老师批改评分。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "point",
      "analysis": "“Point”（分数）是得分的最小单位，是抽象的计数单位；而 “scoring” 强调的是获得分数的过程或结果，具有动态性和行为性。例如，你得了一个点（a point），但你是在得分（scoring）。"
    },
    {
      "word_to_compare": "achievement",
      "analysis": "“Achievement”（成就）是一个更广泛、更正式的词，泛指任何成功完成的目标，不局限于分数系统；而 “scoring” 在非体育语境中虽可引申为‘成功获得’，但其语义仍带有‘量化评价’或‘竞争性获取’的隐含色彩，更具体、更口语化。"
    },
    {
      "word_to_compare": "grading",
      "analysis": "“Grading”（评分）侧重于由他人对表现进行评估和打分，是外部评价行为；而 “scoring” 可以是自我完成的动作（如运动员得分），也可以是系统自动计算的结果，更强调结果本身而非评估过程。在教育语境中，grading 是老师的行为，scoring 是学生的行为或系统输出。"
    }
  ]
}