{
  "word": "scotch",
  "pronunciation": "skotsh",
  "concise_definition": "n. 苏格兰人, 苏格兰威士忌; v. 阻止, 压制, 用胶带粘贴",
  "forms": {
    "third_person_singular": "scotches",
    "past_tense": "scotched",
    "past_participle": "scotched",
    "present_participle": "scotching"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A native or inhabitant of Scotland; also used to refer to Scottish culture, dialect, or products, especially whisky.",
      "explanation_cn": "指苏格兰人或苏格兰居民；也可泛指苏格兰文化、方言或产品，尤指苏格兰威士忌。",
      "example_en": "He ordered a glass of single malt scotch after dinner.",
      "example_cn": "晚饭后他点了一杯单一麦芽苏格兰威士忌。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of transparent adhesive tape, especially the brand name 'Scotch Tape', commonly used for sealing or repairing.",
      "explanation_cn": "指一种透明胶带，尤指品牌名为 'Scotch Tape' 的胶带，常用于封口或修补。",
      "example_en": "She used a piece of scotch to fix the torn page in her notebook.",
      "example_cn": "她用一小段胶带把笔记本上撕破的页面粘好了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To stop or prevent something from continuing, often by cutting off or blocking its progress.",
      "explanation_cn": "指阻止某事继续进行，通常通过切断或阻断其进程来实现。",
      "example_en": "The government scotched the rumor by releasing official data.",
      "example_cn": "政府通过发布官方数据遏制了这一谣言。"
    },
    {
      "pos": "verb",
      "explanation_en": "To mark or cut a line or groove into a surface, especially to prevent slipping or to indicate a boundary.",
      "explanation_cn": "指在表面刻划出线条或凹槽，尤指为防滑或标示边界。",
      "example_en": "The carpenter scotched the edge of the wood to give it a better grip.",
      "example_cn": "木匠在木头边缘刻了纹路，以增强抓握力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tape",
      "analysis": "“Tape”（胶带）是通用词，泛指任何带状粘合材料，而 “scotch” 特指品牌为 Scotch 的透明胶带，已成为该类产品的代名词，具有品牌专指性。"
    },
    {
      "word_to_compare": "suppress",
      "analysis": "“Suppress”（压制）强调通过权威或强力手段压制情绪、言论或反抗，常含负面或强制色彩；而 “scotch” 更侧重于迅速、果断地终结谣言、计划或趋势，语气较中性，常用于口语或新闻语境。"
    },
    {
      "word_to_compare": "whisky",
      "analysis": "“Whisky” 是苏格兰威士忌的通用名称，而 “scotch” 是其特指形式，专指在苏格兰生产、符合法定标准的威士忌。所有 scotch 都是 whisky，但并非所有 whisky 都是 scotch。"
    }
  ]
}