{
  "word": "scotty",
  "pronunciation": "skot·ee",
  "concise_definition": "n. （非正式）苏格兰人，苏格兰口音者；（专有名词）人名，斯科蒂",
  "forms": {
    "plural": "scotties"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A colloquial or informal term for a person from Scotland, often used in a friendly or stereotypical way, sometimes carrying connotations of Scottish accent, culture, or traits like frugality or resilience.",
      "explanation_cn": "对苏格兰人的非正式称呼，常用于友好或刻板印象的语境中，有时带有对苏格兰口音、文化或特质（如节俭、坚韧）的暗示。",
      "example_en": "He's a real scotty—always haggling over prices and telling stories about the Highlands.",
      "example_cn": "他真是个典型的苏格兰人——总爱讨价还价，还讲些高地的故事。"
    },
    {
      "pos": "noun",
      "explanation_en": "A proper noun, commonly used as a given name or nickname, notably associated with characters such as Montgomery Scott from Star Trek, known for his engineering expertise and Scottish accent.",
      "explanation_cn": "作为人名或昵称的专有名词，常用于指代如《星际迷航》中的蒙哥马利·斯科特，以其工程专长和苏格兰口音而闻名。",
      "example_en": "The engineer introduced himself as Scotty, and everyone immediately thought of Star Trek.",
      "example_cn": "这位工程师自我介绍叫斯科蒂，大家立刻想到了《星际迷航》。"
    },
    {
      "pos": "noun",
      "explanation_en": "A breed of small terrier dog originating in Scotland, known for its long body, short legs, and wiry coat; also called the Scottish Terrier.",
      "explanation_cn": "一种起源于苏格兰的小型梗犬，以长身体、短腿和粗糙被毛为特征；也称苏格兰梗。",
      "example_en": "She adopted a scotty named Angus who loves to bark at squirrels.",
      "example_cn": "她收养了一只名叫安格斯的苏格兰梗，它喜欢对着松鼠吠叫。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "Scot",
      "analysis": "“Scot” 是指苏格兰人的标准正式术语，中性且无俚语色彩，常用于新闻、学术或官方语境。而 “scotty” 更口语化，可能带有亲切、幽默或刻板印象的意味，使用时需注意语境以避免冒犯。"
    },
    {
      "word_to_compare": "Scottish",
      "analysis": "“Scottish” 是形容词，用于描述与苏格兰相关的事物（如 Scottish accent, Scottish cuisine），不能作为名词指人。而 “scotty” 作为名词可直接指人或狗，具有更强的指代性和口语特征。"
    },
    {
      "word_to_compare": "terrier",
      "analysis": "“Terrier” 是犬类的一个通用类别，泛指所有猎犬型犬种，而 “scotty” 特指苏格兰梗这一具体品种。因此 “scotty” 是 “terrier” 的一个子类，具有更精确的品种含义。"
    }
  ]
}