{
  "word": "scout",
  "pronunciation": "skowt",
  "concise_definition": "n. 侦察兵, 探子, 童子军; v. 侦察, 寻找, 考察",
  "forms": {
    "third_person_singular": "scouts",
    "past_tense": "scouted",
    "past_participle": "scouted",
    "present_participle": "scouting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person sent out to gather information about an enemy's position, strength, or movements, especially in a military context.",
      "explanation_cn": "指被派去收集敌人位置、兵力或动向信息的人，尤其用于军事语境。",
      "example_en": "The army sent a scout ahead to map the terrain before the attack.",
      "example_cn": "军队在进攻前派出一名侦察兵提前测绘地形。"
    },
    {
      "pos": "noun",
      "explanation_en": "A member of a youth organization, especially the Boy Scouts or Girl Scouts, trained in outdoor skills, citizenship, and self-reliance.",
      "explanation_cn": "指童子军组织的成员（如男童子军或女童子军），接受户外技能、公民意识和自立能力的训练。",
      "example_en": "He earned his wilderness survival badge as a scout in elementary school.",
      "example_cn": "他在小学当童子军时获得了野外生存徽章。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person employed to identify and evaluate potential talent, especially in sports or entertainment.",
      "explanation_cn": "指受雇于体育或娱乐行业，负责发掘和评估潜在人才的人。",
      "example_en": "The NFL team hired a scout to find promising college quarterbacks.",
      "example_cn": "这支球队聘请了一名球探，寻找有潜力的大学四分卫。"
    },
    {
      "pos": "verb",
      "explanation_en": "To explore or survey an area to gather information, especially for military, commercial, or strategic purposes.",
      "explanation_cn": "指为军事、商业或战略目的而探索或勘察某地区以收集信息。",
      "example_en": "The team scouted several locations before choosing the filming site.",
      "example_cn": "团队在选定拍摄地点前考察了多个地点。"
    },
    {
      "pos": "verb",
      "explanation_en": "To search for something carefully or systematically, especially to find opportunities or hidden potential.",
      "explanation_cn": "指仔细或系统地搜寻某物，尤指寻找机会或潜在资源。",
      "example_en": "They spent weeks scouting for rare vintage records in flea markets.",
      "example_cn": "他们花了数周时间在跳蚤市场搜寻稀有的复古黑胶唱片。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "spy",
      "analysis": "“Spy”（间谍）通常指秘密潜入敌方获取情报，带有非法或欺骗性质，强调隐蔽性和背叛性；而 “scout” 更偏向于公开或半公开的侦察行为，常为合法军事或商业活动，不必然涉及欺骗。"
    },
    {
      "word_to_compare": "investigator",
      "analysis": "“Investigator”（调查员）侧重于对已发生事件进行系统性分析和取证，通常在事后进行，如警方或侦探调查案件；而 “scout” 更强调事前的主动探索与信息收集，目标是预防或准备，而非事后追查。"
    },
    {
      "word_to_compare": "explorer",
      "analysis": "“Explorer”（探险家）通常指为科学、地理或个人成就目的而探索未知地域，强调冒险与发现；而 “scout” 的探索具有明确的实用目标，如军事优势、人才选拔或商业选址，更注重效率与结果而非纯粹的探索精神。"
    }
  ]
}