{
  "word": "scouts",
  "pronunciation": "skowts",
  "concise_definition": "n. 侦察兵, 童子军, 探测者",
  "forms": {
    "singular": "scout"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person, especially a young boy or girl, who is a member of a youth organization that promotes outdoor activities, character development, and service to others, often through structured programs and uniforms.",
      "explanation_cn": "指加入青年组织（如童子军）的少年，通过有组织的户外活动、服务项目和统一着装，培养品格、自立能力和团队精神。",
      "example_en": "The scouts hiked through the forest and learned how to build a fire without matches.",
      "example_cn": "童子军们徒步穿越森林，学习了如何不用火柴生火。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person sent out to gather information, especially in a military or competitive context, to observe enemy positions, terrain, or opponent strategies.",
      "explanation_cn": "指被派去收集情报的人，尤其在军事或竞技环境中，用于侦察敌方位置、地形或对手策略。",
      "example_en": "The general sent out scouts to locate the enemy's hidden camp.",
      "example_cn": "将军派出了侦察兵去寻找敌人的隐蔽营地。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who searches for and identifies talented individuals, especially in sports or entertainment, for recruitment or sponsorship.",
      "explanation_cn": "指专门寻找并识别有潜力人才（尤指体育或娱乐领域）以进行招募或赞助的人。",
      "example_en": "The NFL team's scouts traveled across the country to find the next star quarterback.",
      "example_cn": "这支NFL球队的球探走遍全国，寻找下一位明星四分卫。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "spies",
      "analysis": "“Spies”（间谍）指秘密从事敌对或非法情报收集活动的人，通常带有欺骗、潜伏和非法性质，具有负面或危险的含义。而 “scouts” 是公开或半公开地执行侦察任务，常在合法或制度化框架内进行，如军队侦察或体育球探，不必然涉及欺骗。"
    },
    {
      "word_to_compare": "explorers",
      "analysis": "“Explorers”（探险家）强调对未知地域或领域的科学性、冒险性探索，目标是发现新大陆、新物种或新知识，通常具有历史或学术意义。而 “scouts” 更侧重于为特定目的（如军事行动、人才选拔）进行有目标的侦察或调查，不追求广义的发现。"
    },
    {
      "word_to_compare": "observers",
      "analysis": "“Observers”（观察员）指中立、被动地记录和监视事件或行为的人，通常不主动干预或收集情报用于行动。而 “scouts” 是主动出击、有明确任务导向的侦察者，其信息收集是为了后续决策或行动服务，更具主动性与目的性。"
    }
  ]
}