{
  "word": "scrapped",
  "pronunciation": "skrapt",
  "concise_definition": "adj. 被废弃的, 被废弃掉的; v. 废弃, 废除, 搁置 (scrap 的过去式和过去分词)",
  "forms": {
    "base_form": "scrap",
    "past_tense": "scrapped",
    "past_participle": "scrapped",
    "present_participle": "scrapping",
    "plural": "scraps"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "No longer in use or service; discarded or decommissioned, often referring to vehicles, machinery, or materials that have been deemed worthless or obsolete.",
      "explanation_cn": "不再使用或服役的；被丢弃或退役的，通常指车辆、机械或材料因无用或过时而被废弃。",
      "example_en": "The old car was scrapped after it was totaled in the accident.",
      "example_cn": "那辆旧车在事故中严重损毁后被报废了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cancel, abandon, or get rid of something, especially a plan, project, or idea, often due to impracticality, cost, or changing circumstances.",
      "explanation_cn": "取消、放弃或丢弃某事物，尤指计划、项目或想法，通常是因为不切实际、成本过高或情况变化。",
      "example_en": "The government scrapped the proposed tax hike after public outcry.",
      "example_cn": "由于公众强烈反对，政府取消了拟议的增税计划。"
    },
    {
      "pos": "verb",
      "explanation_en": "To dismantle or destroy something, especially metal objects, for the purpose of recycling or recovering valuable materials.",
      "explanation_cn": "拆解或摧毁某物（尤指金属制品），以回收或获取有价值的材料。",
      "example_en": "The ship was scrapped for its steel and copper components.",
      "example_cn": "这艘船被拆解以回收其钢材和铜材。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "discard",
      "analysis": "“Discard” (丢弃) 是一个更通用的词，指扔掉不再需要的东西，可以是垃圾、文件或物品，不强调回收或系统性处理。而 “scrap” 更常用于指对有形物体（如机器、车辆）进行有组织的拆解和材料回收，带有工业或经济目的。"
    },
    {
      "word_to_compare": "cancel",
      "analysis": "“Cancel” (取消) 通常用于计划、会议、预订等抽象事务，强调中止一个已安排的事项，不涉及物理销毁或回收。而 “scrap” 在用于计划时，语气更强烈，暗示彻底放弃、不再考虑，常带有负面或失败的含义。"
    },
    {
      "word_to_compare": "dismantle",
      "analysis": "“Dismantle” (拆卸) 指有步骤地分解一个结构或系统，通常是为了维修、运输或重组，不一定意味着废弃。而 “scrap” 意味着拆解的最终目的是彻底废弃和回收，不再恢复原状。"
    }
  ]
}