{
  "word": "scraped",
  "pronunciation": "skrāpt",
  "concise_definition": "adj. 被刮掉的, 被擦伤的; v. 刮掉, 擦伤 (scrape 的过去式和过去分词)",
  "forms": {
    "base_form": "scrape",
    "third_person_singular": "scrapes",
    "present_participle": "scraping",
    "past_tense": "scraped",
    "past_participle": "scraped"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To remove a thin layer or surface by rubbing or scratching against a rough or hard surface, often causing damage or wear.",
      "explanation_cn": "通过与粗糙或坚硬的表面摩擦或刮擦，去除一层薄薄的表层，通常会造成损伤或磨损。",
      "example_en": "She scraped her knee badly when she fell off her bike.",
      "example_cn": "她从自行车上摔下来时，膝盖擦伤得很严重。"
    },
    {
      "pos": "verb",
      "explanation_en": "To collect or obtain something with great difficulty, often from minimal or leftover resources.",
      "explanation_cn": "指从极少或剩余的资源中艰难地收集或获取某物。",
      "example_en": "He scraped together enough money to pay the rent.",
      "example_cn": "他好不容易凑够了付房租的钱。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove material from a surface using a tool, such as a blade or brush, especially in cleaning or preparing for painting.",
      "explanation_cn": "使用刀片、刷子等工具从表面去除材料，常用于清洁或为涂漆做准备。",
      "example_en": "The workers scraped off the old paint before applying a new coat.",
      "example_cn": "工人们在涂新漆之前刮掉了旧漆。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that has been physically abraded or damaged by scraping; often used to describe skin, surfaces, or materials.",
      "explanation_cn": "形容因刮擦而物理磨损或受损的，常用于描述皮肤、表面或材料。",
      "example_en": "He had a scraped elbow and a bruised hand after the accident.",
      "example_cn": "事故发生后，他胳膊肘擦伤了，手也青了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "scratch",
      "analysis": "“Scratch”（划伤）通常指用尖锐物体在表面留下细长的痕迹，多用于轻微损伤，如划痕、抓痕；而 “scrape” 强调更大面积的摩擦性损伤，常伴随表层物质被剥离，损伤程度更深。"
    },
    {
      "word_to_compare": "erase",
      "analysis": "“Erase”（擦除）专指清除书写、绘画或记录的内容，通常是无损或可控的，如橡皮擦掉铅笔字；而 “scrape” 是物理性地去除材料，常伴随破坏，不局限于文字或图像。"
    },
    {
      "word_to_compare": "collect",
      "analysis": "“Collect”（收集）是中性词，泛指有意识地聚集物品；而当 “scrape” 用于收集含义时（如 scrape together），带有强烈的困难、勉强、拼凑的语义色彩，强调资源匮乏下的艰难获取。"
    }
  ]
}