{
  "word": "scratches",
  "pronunciation": "skrach·iz",
  "concise_definition": "n. 刮痕, 擦伤, 抓痕; v. 抓, 刮, 擦伤",
  "forms": {
    "singular": "scratch",
    "third_person_singular": "scratches",
    "past_tense": "scratched",
    "past_participle": "scratched",
    "present_participle": "scratching"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A narrow, shallow mark or injury made on a surface by scraping or rubbing with a sharp or rough object.",
      "explanation_cn": "指由尖锐或粗糙物体刮擦或摩擦而在表面形成的细长、浅表的痕迹或损伤。",
      "example_en": "The cat left several deep scratches on the wooden door.",
      "example_cn": "猫在木门上留下了好几道深深的抓痕。"
    },
    {
      "pos": "noun",
      "explanation_en": "A minor injury to the skin caused by scraping or digging with fingernails or claws.",
      "explanation_cn": "指由指甲或爪子刮擦或抓挠导致的皮肤轻微损伤。",
      "example_en": "She had scratches on her arms from brushing against thorny bushes.",
      "example_cn": "她手臂上有被带刺灌木刮伤的痕迹。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small amount of something, especially when barely enough or barely detectable (often used in the phrase 'at scratch').",
      "explanation_cn": "指极少的一点东西，尤其是几乎不够或几乎无法察觉的数量（常用于短语 'at scratch'）。",
      "example_en": "He started the business with nothing but scratch — no capital and no experience.",
      "example_cn": "他白手起家，既没有资金也没有经验。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a narrow, shallow mark on a surface by scraping or rubbing with a sharp or rough object.",
      "explanation_cn": "指用尖锐或粗糙的物体刮擦或摩擦表面，形成细长浅表的痕迹。",
      "example_en": "The keys scratched the surface of the phone screen.",
      "example_cn": "钥匙把手机屏幕表面刮出了痕迹。"
    },
    {
      "pos": "verb",
      "explanation_en": "To injure the skin by digging or rubbing with fingernails or claws.",
      "explanation_cn": "指用指甲或爪子抓挠或摩擦皮肤，造成损伤。",
      "example_en": "The dog scratched at the door until someone let it in.",
      "example_cn": "狗一直抓门，直到有人放它进来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "scrape",
      "analysis": "“Scrape”（刮擦）指用硬物沿表面移动以去除物质或造成损伤，动作通常更用力、范围更大，可能涉及物质的剥离（如刮掉油漆）。而 “scratch” 更强调细长、浅表的线性痕迹，通常由尖锐物体造成，不一定会移除大量材料。"
    },
    {
      "word_to_compare": "mark",
      "analysis": "“Mark”（痕迹）是更广泛的术语，泛指任何可见的印迹、符号或损伤，可以是压痕、污渍、笔迹等，不一定是刮擦造成的。而 “scratch” 是一种特定类型的 mark，特指由尖锐物划出的线性痕迹。"
    },
    {
      "word_to_compare": "abrasion",
      "analysis": "“Abrasion”（磨损）是医学或工程术语，指因摩擦导致的表层材料逐渐损耗，通常范围较广、过程缓慢，如皮肤因摩擦而脱皮。而 “scratch” 是突发性、局部性的浅表损伤，通常由单次接触造成，更具体、更轻微。"
    }
  ]
}