{
  "word": "scrap",
  "pronunciation": "skrap",
  "concise_definition": "n. 废料, 残片; v. 废弃, 丢弃, 搁置",
  "forms": {
    "plural": "scraps",
    "third_person_singular": "scraps",
    "past_tense": "scrapped",
    "past_participle": "scrapped",
    "present_participle": "scrapping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small piece or fragment of something that is left over or discarded, often of material such as metal, paper, or food.",
      "explanation_cn": "指某物剩余或被丢弃下来的小块或碎片，常用于金属、纸张或食物等材料。",
      "example_en": "The workers collected the metal scraps to recycle.",
      "example_cn": "工人们收集了金属废料进行回收。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small amount of something remaining after the main part has been used or consumed, especially food or information.",
      "explanation_cn": "指主要部分被使用或消耗后所剩下的少量东西，尤指食物或信息。",
      "example_en": "He ate the last scraps of bread from the plate.",
      "example_cn": "他吃掉了盘子里最后一丁点面包。"
    },
    {
      "pos": "verb",
      "explanation_en": "To discard or get rid of something, especially because it is no longer useful, wanted, or functional.",
      "explanation_cn": "指因某物不再有用、不被需要或无法运作而将其丢弃或废弃。",
      "example_en": "The company decided to scrap the outdated software and replace it with a new system.",
      "example_cn": "公司决定废弃过时的软件，改用新系统。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cancel or abandon a plan, project, or activity, often abruptly or due to changing circumstances.",
      "explanation_cn": "指突然取消或放弃某个计划、项目或活动，通常是因为情况发生变化。",
      "example_en": "They had to scrap the flight due to bad weather.",
      "example_cn": "由于天气恶劣，他们不得不取消了航班。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "waste",
      "analysis": "“Waste” (浪费/废物) 更强调资源的无谓消耗或无效状态，常用于抽象概念（如时间浪费）或泛指无用物。而 “scrap” 更具体，指物理上残留的碎片或被主动废弃的物品，常带有回收或再利用的语境。"
    },
    {
      "word_to_compare": "discard",
      "analysis": "“Discard” (丢弃) 是一个中性词，泛指扔掉任何不再需要的东西，语气较温和。而 “scrap” 常带有更强的否定意味，暗示该物已完全失效、过时或不值得保留，尤其用于技术、计划或设备时更具决断性。"
    },
    {
      "word_to_compare": "leftover",
      "analysis": "“Leftover” (剩余物) 通常指食物或物资在使用后自然剩下的部分，带有中性或积极含义（如剩菜可再利用）。而 “scrap” 更常指被丢弃的残渣，常含贬义或无用之意，且多用于工业或非食品语境。"
    }
  ]
}