{
  "word": "scratching",
  "pronunciation": "skrach·ing",
  "concise_definition": "n. 抓挠, 刮擦声, 刮碟; v. 抓挠, 刮擦",
  "forms": {
    "base_form": "scratch",
    "third_person_singular": "scratches",
    "past_tense": "scratched",
    "past_participle": "scratched",
    "present_participle": "scratching"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The action of rubbing or scraping the skin with nails or a sharp object, often due to itchiness or irritation.",
      "explanation_cn": "用指甲或尖锐物体摩擦或刮擦皮肤的行为，通常因瘙痒或刺激引起。",
      "example_en": "The dog's constant scratching kept everyone awake at night.",
      "example_cn": "这只狗不停地抓挠，让每个人晚上都睡不着。"
    },
    {
      "pos": "noun",
      "explanation_en": "A high-pitched, rasping sound produced by rubbing a rough surface against another, such as nails on a chalkboard or a record needle on vinyl.",
      "explanation_cn": "由粗糙表面相互摩擦产生的尖锐、沙哑的声音，例如指甲刮黑板或唱针划过黑胶唱片的声音。",
      "example_en": "The scratching of the record made the music sound distorted.",
      "example_cn": "唱片的刮擦声让音乐听起来失真了。"
    },
    {
      "pos": "noun",
      "explanation_en": "In DJ culture, the technique of moving a vinyl record back and forth under the needle to create rhythmic or percussive sounds.",
      "explanation_cn": "在DJ文化中，通过在唱针下前后移动黑胶唱片，以制造节奏性或打击乐效果的技术。",
      "example_en": "He impressed the crowd with his intricate scratching during the hip-hop set.",
      "example_cn": "他在嘻哈表演中用复杂的刮碟技巧赢得了观众的喝彩。"
    },
    {
      "pos": "verb",
      "explanation_en": "To rub or scrape the surface of something, especially with nails or a sharp object, often unintentionally or due to discomfort.",
      "explanation_cn": "用指甲或尖锐物体摩擦或刮擦某物表面，通常是非故意的，或因不适引起。",
      "example_en": "She was scratching her arm after the mosquito bite.",
      "example_cn": "被蚊子叮了之后，她一直在抓手臂。"
    },
    {
      "pos": "verb",
      "explanation_en": "To produce a harsh, scraping sound by rubbing surfaces together.",
      "explanation_cn": "通过两个表面相互摩擦发出刺耳的刮擦声。",
      "example_en": "The old door was scratching against the floor as it opened.",
      "example_cn": "旧门打开时，与地板摩擦发出刺耳的刮擦声。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "scraping",
      "analysis": "“Scraping”（刮削）强调用硬物去除表面物质，如刮掉油漆或冰，动作更侧重于“移除”而非“摩擦”。“Scratching”则更侧重于表面的划痕或刺痒感，不一定移除物质，常带有不适或噪音的意味。"
    },
    {
      "word_to_compare": "itching",
      "analysis": "“Itching”（发痒）是主观的生理感觉，是导致“scratching”的原因，而非动作本身。例如，皮肤发痒（itching）会引发抓挠（scratching），但“scratching”是外在行为，而“itching”是内在感受。"
    },
    {
      "word_to_compare": "grating",
      "analysis": "“Grating”（刺耳摩擦声）通常指持续、单调、令人不悦的摩擦声，如金属摩擦声，多用于描述声音的质感；而“scratching”更具体地指向由尖锐物体（如指甲、唱针）造成的断续、短促的刮擦声，常与具体动作或文化语境（如DJ）相关。"
    }
  ]
}