{
  "word": "scrambled",
  "pronunciation": "skram·bld",
  "concise_definition": "adj. 混乱的, 搅乱的; v. 搅乱, 炒（蛋）",
  "forms": {
    "base_form": "scramble",
    "present_participle": "scrambling",
    "past_tense": "scrambled",
    "past_participle": "scrambled"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing something that is disordered, mixed up, or jumbled, often in a hasty or confused manner.",
      "explanation_cn": "形容某事物杂乱无章、混在一起，通常是因匆忙或混乱而造成的。",
      "example_en": "She gave a scrambled explanation that left everyone more confused than before.",
      "example_cn": "她给出了一个混乱的解释，让所有人都比之前更困惑了。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Referring to eggs that have been beaten and cooked while stirring, resulting in soft, curdled pieces.",
      "explanation_cn": "指将鸡蛋打散后不断搅拌烹制而成的，呈柔软絮状块状的鸡蛋料理。",
      "example_en": "For breakfast, I had toast and scrambled eggs with a dash of pepper.",
      "example_cn": "早餐我吃了吐司和撒了点胡椒的炒蛋。"
    },
    {
      "pos": "verb",
      "explanation_en": "To mix or move things in a hurried, disorganized way, often causing confusion or disorder.",
      "explanation_cn": "指匆忙、无序地混合或移动事物，常导致混乱或无序状态。",
      "example_en": "The children scrambled the cards before starting the game.",
      "example_cn": "孩子们在开始游戏前把卡片搅乱了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cook eggs by beating them and stirring them while heating, so they form soft lumps.",
      "explanation_cn": "指将鸡蛋打散后在加热过程中不断搅拌，使其凝结成柔软的块状。",
      "example_en": "He scrambled the eggs in a nonstick pan over low heat.",
      "example_cn": "他用小火在不粘锅里把鸡蛋炒好了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mixed",
      "analysis": "“Mixed”（混合的）是一个更通用的词，指将不同成分结合在一起，不一定带有混乱或匆忙的含义。而 “scrambled” 强调混合后的无序、杂乱或不规则状态，尤其在描述食物或信息时带有负面或混乱的语义色彩。"
    },
    {
      "word_to_compare": "jumbled",
      "analysis": "“Jumbled”（杂乱的）与 “scrambled” 非常接近，都表示混乱地混合在一起。但 “jumbled” 更常用于抽象事物（如想法、语言），而 “scrambled” 更常用于物理动作（如炒蛋、抢夺）或口语化的混乱状态，语义上更生动、更口语化。"
    },
    {
      "word_to_compare": "stirred",
      "analysis": "“Stirred”（搅拌的）仅指物理上的搅动动作，不必然导致混乱或改变形态。例如搅拌咖啡只是混合，而 “scrambled” 暗示了因搅拌而发生结构变化（如蛋液凝固成块），具有结果导向性。"
    }
  ]
}