{
  "word": "scratch",
  "pronunciation": "skrach",
  "concise_definition": "n. 抓痕, 刮痕, 起点; v. 抓, 刮, 擦掉, 从零开始",
  "forms": {
    "third_person_singular": "scratches",
    "past_tense": "scratched",
    "past_participle": "scratched",
    "present_participle": "scratching"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A shallow mark or line made by scraping or scratching a surface, often with a sharp object.",
      "explanation_cn": "指用尖锐物体刮擦表面所形成的浅痕或线条。",
      "example_en": "There was a deep scratch on the car's paintwork after the accident.",
      "example_cn": "事故发生后，汽车漆面上留下了一道深深的刮痕。"
    },
    {
      "pos": "noun",
      "explanation_en": "The starting point or initial condition of something, especially when beginning from nothing or with no prior advantage.",
      "explanation_cn": "指某事物的起点或初始状态，尤其指从零开始、没有任何先前优势的情况。",
      "example_en": "He built his business from scratch, with no capital or connections.",
      "example_cn": "他白手起家，没有任何资本或人脉，建立了自己的企业。"
    },
    {
      "pos": "verb",
      "explanation_en": "To scrape or mark a surface with a sharp object or nail, often unintentionally or out of irritation.",
      "explanation_cn": "用尖锐物体或指甲刮擦表面，通常是非故意的或因烦躁所致。",
      "example_en": "The cat scratched the sofa and left fur behind.",
      "example_cn": "猫抓了沙发，留下了一些毛发。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cancel or eliminate something completely, often before it is completed or put into use.",
      "explanation_cn": "指完全取消或删除某事物，通常是在其完成或投入使用之前。",
      "example_en": "The director decided to scratch the entire scene because it didn't fit the tone of the film.",
      "example_cn": "导演决定删掉整个场景，因为它不符合电影的整体基调。"
    },
    {
      "pos": "verb",
      "explanation_en": "To create or produce something from nothing, without external resources or prior preparation.",
      "explanation_cn": "指在没有任何外部资源或事先准备的情况下，从零开始创造或制作某物。",
      "example_en": "She scratched together a meal using only what was left in the pantry.",
      "example_cn": "她仅用 pantry里剩下的食材，凑合做了一顿饭。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mark",
      "analysis": "“Mark”（标记）是一个更广泛的词，泛指任何可见的痕迹或符号，可以是书写、压痕、污渍等，不一定是通过刮擦造成的。而 “scratch” 特指由尖锐物刮擦产生的线状痕迹，具有明确的物理动作和形态特征。"
    },
    {
      "word_to_compare": "start",
      "analysis": "“Start”（开始）是通用词，指任何活动或过程的开端，不强调资源状况。而 “from scratch” 是一个固定短语，特指从零开始、没有任何基础或资源的状态，强调彻底的原创性和无依赖性。"
    },
    {
      "word_to_compare": "erase",
      "analysis": "“Erase”（擦除）通常指清除书写、绘画或记录的内容，如橡皮擦掉铅笔字，强调的是移除信息或痕迹。而 “scratch” 作为动词时，虽然也可表示取消（如 scratch a plan），但更常保留其物理刮擦的意象，且语气更口语化、更强调彻底性。"
    }
  ]
}