{
  "word": "scramble",
  "pronunciation": "skram·buhl",
  "concise_definition": "v. 爬行, 抢夺, 混乱地整理; n. 混乱争夺, 混乱局面",
  "forms": {
    "third_person_singular": "scrambles",
    "past_tense": "scrambled",
    "past_participle": "scrambled",
    "present_participle": "scrambling"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move quickly and clumsily, often using hands and knees, especially when climbing or getting up from a low position.",
      "explanation_cn": "指用手和膝盖快速而笨拙地移动，尤其在攀爬或从低处起身时。",
      "example_en": "The children scrambled up the hill to get a better view.",
      "example_cn": "孩子们手脚并用地爬上了小山，想看得更清楚。"
    },
    {
      "pos": "verb",
      "explanation_en": "To compete urgently or chaotically for something limited, often in a disorganized manner.",
      "explanation_cn": "指为争夺有限资源而激烈而混乱地竞争，通常缺乏秩序。",
      "example_en": "Shoppers scrambled for the discounted items as soon as the store opened.",
      "example_cn": "商店一开门，顾客们就争先恐后地抢购打折商品。"
    },
    {
      "pos": "verb",
      "explanation_en": "To mix or combine things in a haphazard or disordered way, especially words, ideas, or ingredients.",
      "explanation_cn": "指以杂乱无章的方式混合或组合事物，尤指词语、想法或食材。",
      "example_en": "He scrambled eggs with cheese and herbs for breakfast.",
      "example_cn": "他把鸡蛋、奶酪和香草搅在一起做早餐。"
    },
    {
      "pos": "noun",
      "explanation_en": "A hurried, chaotic struggle or contest for something, often involving multiple participants.",
      "explanation_cn": "指为争夺某物而发生的匆忙而混乱的争斗，通常涉及多人参与。",
      "example_en": "There was a scramble for the last available seats on the flight.",
      "example_cn": "航班最后几个座位引发了激烈的争夺。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "climb",
      "analysis": "“Climb” (攀爬) 强调有目的、有方向地向上移动，通常使用手脚但动作较有序；而 “scramble” 更强调动作的笨拙、匆忙和缺乏优雅，常伴随跌倒或不稳的状态。"
    },
    {
      "word_to_compare": "rush",
      "analysis": "“Rush” (匆忙) 指快速移动或行动，但不一定涉及身体的爬行或争夺；“scramble” 则隐含竞争性和混乱性，常用于多人争夺有限资源的情境，比 “rush” 更具冲突感。"
    },
    {
      "word_to_compare": "mix",
      "analysis": "“Mix” (混合) 是中性词，指将不同成分结合，可有条理地进行；而 “scramble” 作为动词时，特指杂乱无章、随意地混合，常带有破坏原有结构的意味，如 scrambled eggs（炒蛋）就强调了打乱蛋液的形态。"
    }
  ]
}