{
  "word": "screws",
  "pronunciation": "skrooz",
  "concise_definition": "n. 螺丝, 螺栓; v. 拧紧, 拧松, 强迫",
  "forms": {
    "singular": "screw",
    "third_person_singular": "screws",
    "past_tense": "screwed",
    "past_participle": "screwed",
    "present_participle": "screwing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A fastener with a helical ridge (thread) around a cylindrical shaft, designed to be inserted into a material by turning, often used to hold objects together.",
      "explanation_cn": "一种带有螺旋纹路的圆柱形紧固件，通过旋转拧入材料中，常用于将物体固定在一起。",
      "example_en": "He tightened the screws on the shelf to prevent it from wobbling.",
      "example_cn": "他拧紧了架子上的螺丝，以防止它晃动。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slang term for a foolish or annoying person, often used in plural to refer to a group of people in a derogatory way.",
      "explanation_cn": "俚语，指愚蠢或令人讨厌的人，常以复数形式用于贬义地指一群人。",
      "example_en": "Those screws in the office never do their work on time.",
      "example_cn": "办公室里那群傻瓜从不按时完成工作。"
    },
    {
      "pos": "verb",
      "explanation_en": "To turn a screw into or out of something, typically using a screwdriver, to fasten or loosen an object.",
      "explanation_cn": "使用螺丝刀将螺丝旋入或旋出某物，以固定或松开物体。",
      "example_en": "She screwed the lid tightly onto the jar.",
      "example_cn": "她把盖子紧紧拧在罐子上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cheat, deceive, or exploit someone unfairly, often for personal gain.",
      "explanation_cn": "不公平地欺骗、愚弄或剥削某人，通常是为了个人利益。",
      "example_en": "The company screwed over its employees by cutting their benefits without notice.",
      "example_cn": "这家公司未经通知就削减了员工福利，欺骗了他们。"
    },
    {
      "pos": "verb",
      "explanation_en": "To have sexual intercourse with someone (slang, informal and often vulgar).",
      "explanation_cn": "与某人发生性关系（俚语，非正式且常带粗俗色彩）。",
      "example_en": "They were caught screwing in the back seat of the car.",
      "example_cn": "他们被发现在汽车后座上发生性关系。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bolt",
      "analysis": "“Bolt”（螺栓）通常指一种带有螺纹的金属杆，配合螺母使用，用于连接两个或多个部件，一般不旋入材料内部，而是从外部穿过。而 “screw” 通常是自攻的，直接旋入材料中，无需螺母。两者都是紧固件，但安装方式和结构不同。"
    },
    {
      "word_to_compare": "nail",
      "analysis": "“Nail”（钉子）是通过敲击进入材料的直金属针，依靠摩擦力固定，不可拆卸或重复使用。而 “screw” 通过旋转进入，可轻松拆卸和重复使用，提供更强的抓力和可调节性。"
    },
    {
      "word_to_compare": "cheat",
      "analysis": "“Cheat”（欺骗）泛指任何形式的不诚实行为，如作弊、造假或隐瞒真相，语义更广泛。而 “screw” 作为动词时，特指通过不公正手段剥削或坑害他人，语气更粗俗、更具情感色彩，常用于口语中表达愤怒或不满。"
    }
  ]
}