{
  "word": "screens",
  "pronunciation": "skreens",
  "concise_definition": "n. 屏幕, 屏风, 筛选器; v. 筛选, 放映, 遮蔽",
  "forms": {
    "singular": "screen"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A flat surface, typically made of glass, plastic, or other material, used to display visual information such as images, text, or video, especially in electronic devices like televisions, computers, or smartphones.",
      "explanation_cn": "指由玻璃、塑料或其他材料制成的平面表面，用于显示图像、文本或视频等视觉信息，尤指电视、电脑或智能手机等电子设备中的显示界面。",
      "example_en": "She stared at the screen for hours, absorbed in the movie.",
      "example_cn": "她盯着屏幕看了几个小时，完全沉浸在电影中。"
    },
    {
      "pos": "noun",
      "explanation_en": "A physical barrier or partition, often decorative or functional, used to block wind, light, or视线, or to provide privacy in a room.",
      "explanation_cn": "指一种物理屏障或隔断，通常具有装饰性或功能性，用于阻挡风、光或视线，或在室内提供隐私。",
      "example_en": "The wooden screen in the corner of the room added both style and privacy.",
      "example_cn": "房间角落的木制屏风既增添了美感，又提供了隐私。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device or process used to filter, examine, or separate items, people, or data according to specific criteria, often to exclude unwanted elements.",
      "explanation_cn": "指用于根据特定标准过滤、审查或分离物品、人员或数据的装置或过程，通常用于排除不想要的元素。",
      "example_en": "The airport uses advanced screening systems to detect dangerous items.",
      "example_cn": "机场使用先进的筛查系统来检测危险物品。"
    },
    {
      "pos": "verb",
      "explanation_en": "To examine or filter people, items, or data systematically to determine suitability, safety, or eligibility, often before allowing access or inclusion.",
      "explanation_cn": "指系统地审查人员、物品或数据，以判断其是否合适、安全或符合资格，通常在允许进入或纳入之前进行。",
      "example_en": "The hiring team screened over 500 applicants before selecting the final candidates.",
      "example_cn": "招聘团队在选出最终候选人之前，筛选了500多名申请者。"
    },
    {
      "pos": "verb",
      "explanation_en": "To show or project a film, television program, or video on a screen for an audience.",
      "explanation_cn": "指在屏幕上向观众放映电影、电视节目或视频。",
      "example_en": "The cinema will screen the new superhero film this Friday.",
      "example_cn": "这家电影院本周五将放映这部新的超级英雄电影。"
    },
    {
      "pos": "verb",
      "explanation_en": "To shield or protect something from view, light, or harm by placing a barrier in front of it.",
      "explanation_cn": "指通过在前方放置屏障来遮挡某物的视线、光线或伤害。",
      "example_en": "Tall hedges screen the backyard from the street.",
      "example_cn": "高高的树篱将后院与街道隔开。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "display",
      "analysis": "“Display”（显示）强调将信息或物品展示出来以供观看，通常不包含筛选或保护的含义。而 “screen” 作为动词时，常隐含审查或过滤的意图，作为名词时则更强调物理或功能性的遮蔽作用，而不仅仅是呈现。"
    },
    {
      "word_to_compare": "filter",
      "analysis": "“Filter”（过滤）侧重于通过物理或逻辑手段去除不需要的成分，常用于液体、气体或数据流。而 “screen” 作为筛选动词时，更强调初步的、基于标准的审查过程，常用于人员、内容或安全检查，带有更强的判断性。"
    },
    {
      "word_to_compare": "shield",
      "analysis": "“Shield”（保护/遮蔽）强调提供物理或象征性的防护，防止伤害或干扰，但不包含“显示”或“放映”的含义。而 “screen” 作为动词时，既可以是遮蔽，也可以是放映，语义范围更广，且常与视觉媒介相关。"
    }
  ]
}