{
  "word": "screwing",
  "pronunciation": "skroo·ing",
  "concise_definition": "n. 螺丝钉的拧紧/松开；v. 拧紧（螺丝）；俚语：欺骗、搞砸、性交",
  "forms": {
    "base_form": "screw",
    "third_person_singular": "screws",
    "past_tense": "screwed",
    "past_participle": "screwed",
    "present_participle": "screwing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The action of turning a screw to fasten or loosen it, typically using a screwdriver; often used in plural to refer to the mechanical process or the screws themselves.",
      "explanation_cn": "指使用螺丝刀旋转螺丝以拧紧或松开的动作；常以复数形式指代这一机械过程或螺丝本身。",
      "example_en": "The cabinet came with extra screwing for assembly.",
      "example_cn": "这个柜子附带了额外的螺丝用于组装。"
    },
    {
      "pos": "verb",
      "explanation_en": "To turn a screw into or out of something to fasten or release a component; to tighten or loosen by rotational motion.",
      "explanation_cn": "指通过旋转动作将螺丝旋入或旋出某物，以固定或松开部件。",
      "example_en": "He was screwing the shelf to the wall when the drill slipped.",
      "example_cn": "他正把架子拧到墙上时，电钻滑了一下。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cheat, deceive, or treat someone unfairly, often for personal gain; a colloquial and sometimes vulgar usage.",
      "explanation_cn": "指以不正当手段欺骗或不公平地对待某人，通常为谋取私利；属于口语化甚至粗俗用法。",
      "example_en": "The company was screwing customers by charging hidden fees.",
      "example_cn": "这家公司通过收取隐藏费用欺骗顾客。"
    },
    {
      "pos": "verb",
      "explanation_en": "To have sexual intercourse with someone; a vulgar slang usage.",
      "explanation_cn": "指与某人发生性关系；属粗俗俚语用法。",
      "example_en": "They were caught screwing in the back seat of the car.",
      "example_cn": "他们被发现在汽车后座上发生性关系。"
    },
    {
      "pos": "verb",
      "explanation_en": "To mess up, ruin, or make a mistake in a situation, often due to carelessness or incompetence.",
      "explanation_cn": "指因粗心或无能而把事情搞砸、弄糟。",
      "example_en": "I really screwed up the presentation by forgetting my notes.",
      "example_cn": "我因为忘了笔记，把演示搞砸了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fastening",
      "analysis": "“Fastening”（固定）是一个更广泛、中性的术语，指任何将物体连接或固定在一起的方法（如扣子、夹子、胶水等）。而 “screwing” 是一种具体的机械固定方式，特指使用螺丝和旋转动作。它更精确，但范围更窄。"
    },
    {
      "word_to_compare": "cheating",
      "analysis": "“Cheating”（欺骗）是更正式、通用的词，用于描述任何形式的不诚实行为（如考试作弊、欺诈）。而 “screwing” 作为俚语表示欺骗时，语气更粗俗、口语化，常带有情绪色彩（如愤怒或讽刺），多用于非正式语境。"
    },
    {
      "word_to_compare": "messing up",
      "analysis": "“Messing up”（搞砸）是日常口语中表示错误或失败的中性表达，语气较轻，可指小失误。而 “screwing up” 意义相近，但语气更强烈、更情绪化，常暗示严重后果或个人责任，带有责备或懊悔的意味。"
    }
  ]
}