{
  "word": "screw",
  "pronunciation": "skroo",
  "concise_definition": "n. 螺丝, 螺栓; v. 拧, 拧紧, 欺骗, 性交",
  "forms": {
    "third_person_singular": "screws",
    "past_tense": "screwed",
    "past_participle": "screwed",
    "present_participle": "screwing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A fastener with a helical ridge (thread) around a cylindrical shaft, designed to be inserted into a material by turning, typically used to hold objects together.",
      "explanation_cn": "一种带有螺旋状凸纹（螺纹）的圆柱形紧固件，通过旋转拧入材料中，通常用于将物体固定在一起。",
      "example_en": "He tightened the screw with a Phillips screwdriver.",
      "example_cn": "他用十字螺丝刀拧紧了螺丝。"
    },
    {
      "pos": "verb",
      "explanation_en": "To turn a screw into or out of something, usually with a tool, to fasten or remove it.",
      "explanation_cn": "使用工具将螺丝旋入或旋出某物，以固定或拆卸它。",
      "example_en": "She screwed the shelf to the wall securely.",
      "example_cn": "她把架子牢牢地拧在墙上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cheat, deceive, or treat someone unfairly, often for personal gain.",
      "explanation_cn": "欺骗、愚弄或不公平地对待某人，通常是为了个人利益。",
      "example_en": "The company screwed over its employees by cutting their benefits without notice.",
      "example_cn": "这家公司未经通知就削减了员工福利，欺骗了他们。"
    },
    {
      "pos": "verb",
      "explanation_en": "To have sexual intercourse with someone (slang, often vulgar).",
      "explanation_cn": "与某人发生性关系（俚语，常带粗俗色彩）。",
      "example_en": "They were caught screwing in the back seat of the car.",
      "example_cn": "他们被发现躺在汽车后座上发生性关系。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bolt",
      "analysis": "“Bolt”（螺栓）通常指一种带有螺纹的金属杆，需与螺母配合使用，多用于重型结构连接，安装时通常从两侧夹紧。而 “screw” 一般直接旋入材料（如木头或塑料）中，无需螺母，更常用于轻型固定。两者功能相似，但结构和应用场景不同。"
    },
    {
      "word_to_compare": "fasten",
      "analysis": "“Fasten”（固定）是一个广义动词，泛指任何使物体连接或固定的行为，如扣上纽扣、系上安全带。而 “screw” 是一种具体的固定方式，特指通过旋转螺丝实现的机械连接。因此，“screw” 是 “fasten” 的一种手段。"
    },
    {
      "word_to_compare": "cheat",
      "analysis": "“Cheat”（欺骗）是更通用的词，指任何形式的不诚实行为，如考试作弊、隐瞒真相。而 “screw” 作为动词表示欺骗时，语气更口语化、情绪更强烈，常带有愤怒或被背叛的色彩，多用于非正式语境，如 ‘They screwed me out of my pay’。"
    }
  ]
}