{
  "word": "scrub",
  "pronunciation": "skruhb",
  "concise_definition": "v. 擦洗, 清洁; n. 灌木丛, 粗糙的人; adj. 干净的, 彻底的",
  "forms": {
    "third_person_singular": "scrubs",
    "past_tense": "scrubbed",
    "past_participle": "scrubbed",
    "present_participle": "scrubbing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To rub a surface hard with a brush, cloth, or other tool in order to clean it thoroughly, often removing dirt, stains, or unwanted material.",
      "explanation_cn": "用刷子、布或其他工具用力摩擦表面，以彻底清洁，通常是为了去除污垢、污渍或不需要的物质。",
      "example_en": "She scrubbed the kitchen floor until all the grease was gone.",
      "example_cn": "她把厨房地板擦洗了一遍，直到所有油污都消失了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cancel or eliminate something, especially a planned event or activity, often abruptly or due to external pressure.",
      "explanation_cn": "取消或消除某事物，尤指突然取消计划中的事件或活动，通常由于外部压力或原因。",
      "example_en": "The flight was scrubbed due to bad weather conditions.",
      "example_cn": "由于天气恶劣，航班被取消了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove or eliminate something completely, especially in a forceful or aggressive manner (e.g., scrubbing someone from a list or record).",
      "explanation_cn": "以强力或激烈的方式彻底清除某物（例如将某人从名单或记录中删除）。",
      "example_en": "The editor scrubbed all references to the scandal from the article.",
      "example_cn": "编辑将文章中所有涉及丑闻的提及都删除了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A dense growth of low shrubs or bushes, especially in areas where trees do not grow well.",
      "explanation_cn": "低矮灌木丛生的区域，尤指不适合树木生长的地方。",
      "example_en": "The hikers got lost in the scrub near the desert edge.",
      "example_cn": "徒步者在沙漠边缘的灌木丛中迷了路。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is considered rough, unrefined, or lacking in social graces; sometimes used humorously or derogatorily.",
      "explanation_cn": "指被认为粗鲁、粗俗或缺乏社交礼仪的人，有时用于幽默或贬义。",
      "example_en": "He’s a bit of a scrub—never showers, always wears the same shirt.",
      "example_cn": "他是个十足的邋遢鬼——从不洗澡，总穿同一件衬衫。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used to describe something that is clean, thorough, or completely removed (e.g., a scrubbed record, a scrubbed surface).",
      "explanation_cn": "用于描述某物已被彻底清洁、清除或干净无瑕的状态（如被彻底清除的记录、被擦净的表面）。",
      "example_en": "The hospital requires a scrubbed environment to prevent infection.",
      "example_cn": "医院要求无菌环境以防止感染。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "clean",
      "analysis": "“Clean” (清洁) 是一个通用词，泛指去除污垢或使干净，但不强调用力或工具的使用。而 “scrub” 特指通过用力摩擦来清洁，动作更强烈、更具体，常涉及刷子或硬物。"
    },
    {
      "word_to_compare": "cancel",
      "analysis": "“Cancel” (取消) 是中性词，用于正式或非正式场合中终止计划，如取消会议、订单等。而 “scrub” 在表示取消时带有更口语化、更随意甚至略带粗暴的语气，常用于非正式语境，如取消航班或比赛。"
    },
    {
      "word_to_compare": "brush",
      "analysis": "“Brush” (刷) 通常指轻柔或快速的擦拭动作，如刷头发、刷灰尘，动作较轻。而 “scrub” 强调用力、反复、深入的摩擦，目的是彻底清除，动作强度远高于 “brush”。"
    }
  ]
}