{
  "word": "scrubs",
  "pronunciation": "skruhbz",
  "concise_definition": "n. 手术服, 工作服; v. 擦洗, 清洁",
  "forms": {
    "singular": "scrub"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Loose-fitting clothing worn by medical personnel in operating rooms and other clinical settings, typically made of cotton or synthetic fabric and designed for hygiene and ease of movement.",
      "explanation_cn": "医疗人员在手术室和其他临床环境中穿着的宽松服装，通常由棉或合成纤维制成，旨在保持卫生并便于活动。",
      "example_en": "The nurses changed into scrubs before entering the operating room.",
      "example_cn": "护士们在进入手术室前换上了手术服。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of uniform worn by workers in other industries, such as restaurants or laboratories, often for cleanliness or safety reasons.",
      "explanation_cn": "其他行业（如餐厅或实验室）工作人员穿着的制服，通常出于清洁或安全考虑。",
      "example_en": "The kitchen staff all wear blue scrubs to maintain food safety standards.",
      "example_cn": "厨房员工都穿着蓝色工作服以符合食品安全标准。"
    },
    {
      "pos": "verb",
      "explanation_en": "To rub or clean a surface vigorously, especially to remove dirt, stains, or unwanted material.",
      "explanation_cn": "用力擦洗表面，尤其是为了去除污垢、污渍或不需要的物质。",
      "example_en": "She scrubbed the bathtub until all the soap scum disappeared.",
      "example_cn": "她用力擦洗浴缸，直到所有肥皂垢都消失了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cancel or eliminate something, especially a planned event or activity, often abruptly or due to external factors.",
      "explanation_cn": "取消或消除某事物，尤指突然取消原定的事件或活动，通常由于外部因素。",
      "example_en": "The flight was scrubbed due to bad weather conditions.",
      "example_cn": "由于天气恶劣，航班被取消了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "uniform",
      "analysis": "“Uniform”（制服）泛指任何组织或职业规定的标准着装，强调统一性和身份标识，范围更广，可包括西装、警服等；而 “scrubs” 特指医疗或特定行业中的功能性清洁服装，强调卫生与实用性。"
    },
    {
      "word_to_compare": "clean",
      "analysis": "“Clean”（清洁）是通用动词，指使某物变得干净，方式多样，可以是擦拭、吸尘、冲洗等；而 “scrub” 强调通过用力摩擦来彻底清除污垢，动作更剧烈、更具体，常用于表面清洁场景。"
    },
    {
      "word_to_compare": "cancel",
      "analysis": "“Cancel”（取消）是通用词，用于终止计划、预约、活动等，语气中性；而 “scrub” 作为动词表示取消时，带有更口语化、更突然或临时性的意味，常用于航空、体育或医疗语境，隐含‘因突发状况被迫取消’的含义。"
    }
  ]
}