{
  "word": "scrubbing",
  "pronunciation": "skruhb·ing",
  "concise_definition": "n. 擦洗, 彻底清洁; v. 擦洗, 清除, 取消",
  "forms": {
    "base_form": "scrub",
    "third_person_singular": "scrubs",
    "past_tense": "scrubbed",
    "past_participle": "scrubbed",
    "present_participle": "scrubbing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The action of cleaning a surface vigorously by rubbing it with a brush, cloth, or other abrasive material, often to remove dirt, stains, or unwanted substances.",
      "explanation_cn": "通过用刷子、布或其他研磨材料用力摩擦表面，以去除污垢、污渍或不需要的物质的行为。",
      "example_en": "The scrubbing of the kitchen floor removed years of built-up grime.",
      "example_cn": "彻底擦洗厨房地板，清除了多年积累的污垢。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove or eliminate something forcefully or thoroughly, especially by rubbing or using strong measures; can refer to physical cleaning or abstract removal (e.g., data, plans).",
      "explanation_cn": "通过强力摩擦或采取激烈手段彻底清除某物；可指物理清洁，也可指抽象事物的删除（如数据、计划）。",
      "example_en": "The government is scrubbing outdated regulations from the legal code.",
      "example_cn": "政府正在废除法律条文中过时的规章。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cancel or call off a planned event or activity, often due to unforeseen circumstances or pressure.",
      "explanation_cn": "因突发情况或压力而取消原定的事件或活动。",
      "example_en": "The concert was scrubbed at the last minute due to the artist's illness.",
      "example_cn": "由于艺人突发疾病，演唱会最后一刻被取消了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cleaning",
      "analysis": "“Cleaning”（清洁）是广义的去除污垢行为，可包括擦拭、吸尘、冲洗等多种方式，不强调力度或工具。而 “scrubbing” 特指通过摩擦和用力的物理动作进行深度清洁，更具强度和针对性。"
    },
    {
      "word_to_compare": "erasing",
      "analysis": "“Erasing”（擦除）通常用于抽象或书面内容的删除，如铅笔痕迹、数据记录，强调的是使某物不再可见或存在，但不涉及物理摩擦。而 “scrubbing” 可用于物理表面，也可用于数字或行政语境中，带有更强的彻底清除和强制性意味。"
    },
    {
      "word_to_compare": "canceling",
      "analysis": "“Canceling”（取消）是通用词，用于任何计划、预约或活动的中止，中性且常见。而 “scrubbing” 在表示取消时带有非正式、口语化色彩，常暗示临时决定、仓促或因负面原因而取消，语气更强烈。"
    }
  ]
}