{
  "word": "sculpted",
  "pronunciation": "skul·ptid",
  "concise_definition": "adj. 雕刻的, 雕塑般的; v. 雕刻（sculpt 的过去式和过去分词）",
  "forms": {
    "base_form": "sculpt",
    "present_participle": "sculpting",
    "past_tense": "sculpted",
    "past_participle": "sculpted",
    "third_person_singular": "sculpts"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Shaped or formed with great precision and artistry, as if carved by a sculptor; often used to describe physical features that appear finely defined and idealized.",
      "explanation_cn": "以极高的精确度和艺术性塑造而成，仿佛由雕塑家雕刻一般；常用于形容外貌特征轮廓分明、理想化。",
      "example_en": "She had sculpted cheekbones that caught the light beautifully.",
      "example_cn": "她有着轮廓分明的颧骨，在光线下显得格外迷人。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something (such as a landscape or object) that has been deliberately shaped or modified to resemble a work of sculpture.",
      "explanation_cn": "形容某物（如景观或物体）被刻意塑造或改造，呈现出雕塑般的形态。",
      "example_en": "The garden featured sculpted hedges arranged in geometric patterns.",
      "example_cn": "花园里有被修剪成几何图案的雕塑式树篱。"
    },
    {
      "pos": "verb",
      "explanation_en": "To carve or shape a material such as stone, wood, or metal into a three-dimensional form, typically as an artistic endeavor.",
      "explanation_cn": "指用石头、木头或金属等材料雕刻或塑造出三维形态，通常是一种艺术创作行为。",
      "example_en": "The artist sculpted a lifelike statue of a dancer from marble.",
      "example_cn": "这位艺术家用大理石雕刻了一座栩栩如生的舞者雕像。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "carved",
      "analysis": "“Carved”（雕刻的）强调用工具从材料中去除部分以形成形状，常用于木材、石头等硬质材料，动作更偏向“削减”；而 “sculpted” 更广泛，包含塑造、修饰、精雕细琢的过程，不仅限于去除材料，也可指通过添加或塑形完成，艺术性更强。"
    },
    {
      "word_to_compare": "modeled",
      "analysis": "“Modeled”（塑造的）通常指用柔软材料（如黏土）进行塑造，强调可塑性和临时性，常用于数字建模或陶艺；而 “sculpted” 更常用于最终成品，尤其是坚硬材料的永久性艺术作品，具有更强的完成感和艺术权威性。"
    },
    {
      "word_to_compare": "shaped",
      "analysis": "“Shaped”（成形的）是最通用的词，泛指任何形式的外形改变，可以是机械的、自然的或粗略的；而 “sculpted” 隐含了审美意图、精细工艺和艺术性，语义更具体、更富表现力。"
    }
  ]
}