{
  "word": "seal",
  "pronunciation": "seel",
  "concise_definition": "n. 海豹, 印章, 封条; v. 封闭, 盖章, 密封",
  "forms": {
    "third_person_singular": "seals",
    "past_tense": "sealed",
    "past_participle": "sealed",
    "present_participle": "sealing",
    "plural": "seals"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A marine mammal with a streamlined body, flippers, and no external ears, typically found in cold ocean waters.",
      "explanation_cn": "一种生活在寒冷海洋中的海洋哺乳动物，身体流线型，有鳍状肢，无外耳，常见于极地或温带海域。",
      "example_en": "The seal basked on the rocky shore, its glossy coat glistening in the sun.",
      "example_cn": "海豹在岩石海岸上晒太阳，光滑的皮毛在阳光下闪闪发亮。"
    },
    {
      "pos": "noun",
      "explanation_en": "An official stamp or emblem used to authenticate documents, often made of wax, metal, or ink, and pressed onto paper or other materials.",
      "explanation_cn": "用于证明文件真实性的官方印章或标志，通常由蜡、金属或墨水制成，并压印在纸张或其他材料上。",
      "example_en": "The treaty was signed and sealed with the royal crest.",
      "example_cn": "条约已签署并加盖了王室徽章。"
    },
    {
      "pos": "noun",
      "explanation_en": "A closure or barrier that prevents air, liquid, or other substances from passing through, such as a gasket or airtight lid.",
      "explanation_cn": "一种防止空气、液体或其他物质渗入或渗出的封闭物或屏障，例如垫圈或密封盖。",
      "example_en": "The jar had a perfect seal, keeping the jam fresh for months.",
      "example_cn": "这个罐子密封性极好，使果酱保持新鲜数月之久。"
    },
    {
      "pos": "verb",
      "explanation_en": "To close or secure something tightly so that nothing can enter or escape, especially air, water, or light.",
      "explanation_cn": "紧密地关闭或固定某物，以防止空气、水或光等进入或逸出。",
      "example_en": "They sealed the envelope before mailing it.",
      "example_cn": "他们在邮寄前把信封封好了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To affix an official stamp or mark to a document to validate or authorize it.",
      "explanation_cn": "在文件上加盖官方印章以证明或授权其有效性。",
      "example_en": "The judge sealed the court records to protect the privacy of the minors involved.",
      "example_cn": "法官封存了法庭记录，以保护涉案未成年人的隐私。"
    },
    {
      "pos": "verb",
      "explanation_en": "To bring something to a final, conclusive, or irreversible state, often metaphorically.",
      "explanation_cn": "使某事达到最终、决定性或不可逆转的状态，常用于比喻意义。",
      "example_en": "The signing of the contract sealed their partnership.",
      "example_cn": "合同的签署标志着他们合作关系的最终确立。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "stamp",
      "analysis": "“Stamp”（盖章）通常指用印模在表面留下图案或文字，多用于邮票、文件标记，强调动作或印记本身；而 “seal” 更强调封闭、认证或不可逆的权威性，常用于法律或正式场合，语义更重。"
    },
    {
      "word_to_compare": "cover",
      "analysis": "“Cover”（覆盖）泛指用物体遮盖某物，不强调密封性或完整性，如用布盖住桌子；而 “seal” 意味着完全封闭、防止泄漏或侵入，具有更强的功能性和技术性含义。"
    },
    {
      "word_to_compare": "wax",
      "analysis": "“Wax”（蜂蜡）本身是一种材料，常用于制作传统印章（wax seal），但作为名词时仅指物质；而 “seal” 是使用蜡或其他材料实现的完整功能实体，包含目的（认证、封闭）和形式（印记、封条）。"
    }
  ]
}