{
  "word": "seals",
  "pronunciation": "seelz",
  "concise_definition": "n. 海豹, 印章, 封条, 签名; v. 封闭, 加封, 盖章",
  "forms": {
    "singular": "seal"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A marine mammal with a streamlined body, flippers, and no external ears, typically found in cold ocean waters.",
      "explanation_cn": "一种生活在寒冷海洋中的海洋哺乳动物，身体流线型，有鳍状肢，无外耳，常见于极地或温带海域。",
      "example_en": "The children watched in awe as the seals basked on the rocky shore.",
      "example_cn": "孩子们惊叹地看着海豹在岩石海岸上晒太阳。"
    },
    {
      "pos": "noun",
      "explanation_en": "A stamp or emblem used to authenticate documents, often made of wax, metal, or ink, and pressed onto paper or other materials.",
      "explanation_cn": "用于证明文件真实性的印章，通常由蜡、金属或墨水制成，压印在纸张或其他材料上。",
      "example_en": "The ancient contract bore the royal seal of King Henry VIII.",
      "example_cn": "这份古老的合同上盖着亨利八世国王的皇家印章。"
    },
    {
      "pos": "noun",
      "explanation_en": "A tight closure or barrier that prevents the passage of air, liquid, or other substances, often used in engineering or packaging.",
      "explanation_cn": "一种紧密的封闭物或屏障，用于阻止空气、液体或其他物质的通过，常用于工程或包装领域。",
      "example_en": "The pipe joint was fitted with a rubber seal to prevent leaks.",
      "example_cn": "管道接头安装了橡胶密封圈以防止泄漏。"
    },
    {
      "pos": "verb",
      "explanation_en": "To close or secure something tightly, especially to prevent entry, exit, or leakage.",
      "explanation_cn": "紧密地关闭或固定某物，尤其是为了防止进入、离开或泄漏。",
      "example_en": "The firefighters sealed the room to contain the smoke.",
      "example_cn": "消防员封闭了房间以控制烟雾扩散。"
    },
    {
      "pos": "verb",
      "explanation_en": "To affix a seal, stamp, or signature to a document to make it official or legally binding.",
      "explanation_cn": "在文件上加盖印章、戳记或签名，使其具有正式性或法律效力。",
      "example_en": "The notary public sealed the certified copy of the birth certificate.",
      "example_cn": "公证人对出生证明的认证副本加盖了印章。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "stamp",
      "analysis": "“Stamp”（盖章）通常指用印模在表面留下图案或文字，强调动作和视觉标记，常用于邮票或行政文件；而 “seal” 更强调封闭性、权威性和防伪功能，常用于法律或正式文件的认证，语义更厚重。"
    },
    {
      "word_to_compare": "wax",
      "analysis": "“Wax”（蜡）本身是材料，常作为 “seal” 的传统材质（如蜡封），但 “seal” 是功能性的概念，而 “wax” 仅是实现密封的一种物质。例如，可以说 “a wax seal”，但不能说 “a wax” 代替 “seal”。"
    },
    {
      "word_to_compare": "gasket",
      "analysis": "“Gasket”（垫片）是工程术语，特指用于两个机械部件之间防止泄漏的物理垫圈，多用于机械、管道系统；而 “seal” 是更广泛的术语，可指任何形式的封闭，包括非物理的（如情感密封）或象征性的（如印章），语义范围更广。"
    }
  ]
}