{
  "word": "seats",
  "pronunciation": "seets",
  "concise_definition": "n. 座位, 席位, (政府或议会的) 议席, (某地的) 居住地",
  "forms": {
    "singular": "seat"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A place or space designed for someone to sit, typically in a public or organized setting such as a theater, classroom, or vehicle.",
      "explanation_cn": "指为某人设计的坐处，通常用于剧院、教室或车辆等公共或有组织的场所。",
      "example_en": "All the seats in the auditorium were taken before the show began.",
      "example_cn": "演出开始前，礼堂里的所有座位都已坐满。"
    },
    {
      "pos": "noun",
      "explanation_en": "A position or office in a legislative or governing body, often representing a constituency or region.",
      "explanation_cn": "指立法机构或政府机构中的一个席位，通常代表一个选区或地区。",
      "example_en": "The party won 120 seats in the national election.",
      "example_cn": "该政党在国民选举中赢得了120个议席。"
    },
    {
      "pos": "noun",
      "explanation_en": "The place where something is based or located, especially an institution, organization, or center of activity.",
      "explanation_cn": "指某事物的所在地或总部，尤指机构、组织或活动中心。",
      "example_en": "Paris is the seat of many international organizations.",
      "example_cn": "巴黎是许多国际组织的总部所在地。"
    },
    {
      "pos": "noun",
      "explanation_en": "A region or area considered as the center of a particular activity, quality, or phenomenon.",
      "explanation_cn": "指某一活动、特质或现象的中心区域或发源地。",
      "example_en": "The region is the seat of ancient civilization.",
      "example_cn": "这一地区是古代文明的发源地。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "chair",
      "analysis": "“Chair” (椅子) 通常指具体的家具，强调物理形态；而 “seat” 更侧重于功能性的“坐的位置”，可以是椅子、长凳、甚至地板上的空间，适用范围更广。在议会语境中，只能用 “seat” 指代议席，不能用 “chair”。"
    },
    {
      "word_to_compare": "spot",
      "analysis": "“Spot” (地点) 是一个泛指的地点，可指任何位置，不特指用于坐的地方。而 “seat” 明确指为坐而设的位置，具有功能性目的。例如，一个观景台的“spot”可能是风景最佳处，但不一定是“seat”。"
    },
    {
      "word_to_compare": "position",
      "analysis": "“Position” (位置/职位) 可指抽象的位置（如战略位置）或职业职位，语义范围远大于 “seat”。虽然在政治语境中两者可互换（如 “a seat in parliament” = “a position in parliament”），但 “seat” 更具体制性和物理性，常用于选举和席位分配的正式语境。"
    }
  ]
}