{
  "word": "secret",
  "pronunciation": "see·krit",
  "concise_definition": "n. 秘密, 秘诀; adj. 秘密的, 机密的",
  "forms": {
    "plural": "secrets",
    "comparative": "secreter",
    "superlative": "secretest"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Something kept hidden or unknown, especially information that is deliberately concealed from others for privacy, security, or strategic reasons.",
      "explanation_cn": "指被有意隐藏或不为人知的事物，尤其是出于隐私、安全或战略目的而对他人保守的信息。",
      "example_en": "She told me the secret of her success: hard work and persistence.",
      "example_cn": "她告诉我她成功的秘诀：努力工作和坚持不懈。"
    },
    {
      "pos": "noun",
      "explanation_en": "A hidden or private practice, ritual, or method known only to a select group, often with symbolic or traditional significance.",
      "explanation_cn": "指仅被特定群体所知的隐秘做法、仪式或方法，常具有象征意义或传统价值。",
      "example_en": "The ancient order guarded its secrets with great care.",
      "example_cn": "这个古老教派小心翼翼地守护着它的秘密。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Intended to be kept hidden from public knowledge or access; not open or public.",
      "explanation_cn": "旨在对公众保密或限制接触的；非公开的、非透明的。",
      "example_en": "The government held a secret meeting to discuss national security.",
      "example_cn": "政府举行了一次秘密会议，讨论国家安全问题。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by concealment or mystery; not easily understood or explained.",
      "explanation_cn": "具有隐蔽性或神秘性的；不易被理解或解释的。",
      "example_en": "There's a secret beauty in the quiet moments of dawn.",
      "example_cn": "黎明时分的宁静中蕴含着一种神秘的美。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "confidential",
      "analysis": "“Confidential”（机密的）强调信息的受信任传递和处理，通常用于正式或职业语境，如医疗记录或商业文件。它暗示一种责任和义务，而非单纯的隐藏。而 “secret” 更广泛，可指任何被隐瞒的事物，无论是否涉及信任关系。"
    },
    {
      "word_to_compare": "hidden",
      "analysis": "“Hidden”（隐藏的）侧重于物理或可见性的遮蔽，如隐藏的房间或隐藏的物体，不一定涉及有意保密的意图。而 “secret” 强调主观的、有意识的隐瞒，通常与信息、意图或知识相关。"
    },
    {
      "word_to_compare": "mystery",
      "analysis": "“Mystery”（谜团）指尚未被解开或无法解释的事物，强调未知性，但不一定是被人为隐瞒的。它可以是自然现象或未解之谜。而 “secret” 暗示有人故意不让别人知道，具有主动保密的成分。"
    }
  ]
}