{
  "word": "secretary",
  "pronunciation": "sih·kret·er-ee",
  "concise_definition": "n. 秘书, 秘书长, 部长",
  "forms": {
    "plural": "secretaries"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person employed to assist with administrative tasks such as managing correspondence, scheduling appointments, and organizing files, typically for an executive or organization.",
      "explanation_cn": "指受雇协助处理行政事务的人，如管理信函、安排约会、整理文件等，通常为高管或组织提供支持。",
      "example_en": "The CEO's secretary scheduled the meeting and prepared all the necessary documents.",
      "example_cn": "首席执行官的秘书安排了会议并准备了所有必要的文件。"
    },
    {
      "pos": "noun",
      "explanation_en": "A high-ranking government official who heads a department or ministry, especially in the United States or the United Kingdom.",
      "explanation_cn": "指政府中负责领导某一部门或部会的高级官员，尤指美国或英国的内阁部长。",
      "example_en": "The Secretary of State is responsible for foreign affairs in the U.S. government.",
      "example_cn": "美国国务卿负责处理国家外交事务。"
    },
    {
      "pos": "noun",
      "explanation_en": "The chief administrative officer of an organization, association, or committee, responsible for record-keeping and communication.",
      "explanation_cn": "指一个组织、协会或委员会的首席行政官员，负责记录保存和对外联络。",
      "example_en": "The secretary of the club sent out the minutes of the last meeting to all members.",
      "example_cn": "俱乐部秘书将上次会议的纪要发送给了所有成员。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "assistant",
      "analysis": "“Assistant”（助手）是一个更宽泛的词，泛指任何提供协助的人，职责范围可大可小，不一定涉及行政或文书工作。而 “secretary” 通常特指承担系统性行政、文书和沟通职责的专业职位，具有更明确的职能边界。"
    },
    {
      "word_to_compare": "administrator",
      "analysis": "“Administrator”（管理员/行政人员）强调对组织或系统的整体管理与运营，常涉及决策和资源调配，职位层级通常更高。而 “secretary” 更侧重执行性、支持性任务，如记录、协调和沟通，虽重要但不主导战略。"
    },
    {
      "word_to_compare": "minister",
      "analysis": "“Minister”（部长）与 “secretary” 在政府语境中常可互换（如美国称 Secretary of Defense，英国称 Minister of Defence），但 “minister” 更普遍用于英联邦国家，且通常暗示更高的政治地位和政策制定权；而 “secretary” 在美国语境中虽同为内阁成员，但词源更偏向行政执行而非政治代表。"
    }
  ]
}