{
  "word": "sectional",
  "pronunciation": "sek·shuh·nuhl",
  "concise_definition": "adj. 分段的, 局部的, 模块化的",
  "forms": {
    "comparative": "sectional",
    "superlative": "sectional"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Divided into separate parts or sections, especially for practical or functional reasons; designed to be assembled from individual components.",
      "explanation_cn": "被划分为多个独立部分，通常出于实用或功能性的考虑；设计为由多个独立模块组装而成。",
      "example_en": "The sectional sofa can be rearranged to fit different room layouts.",
      "example_cn": "这款模块化沙发可以根据不同的房间布局进行重新组合。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or representing a particular section or part of a larger whole, often in political or geographic contexts.",
      "explanation_cn": "与较大整体中的某一特定部分相关，常用于政治或地理语境中，表示局部的、分区的。",
      "example_en": "The election results showed a sectional divide between urban and rural voters.",
      "example_cn": "选举结果显示出城市选民与农村选民之间的地区性分歧。"
    },
    {
      "pos": "adjective",
      "explanation_en": "In cartography or architecture, pertaining to a representation that shows only a portion or cross-section of a structure or area.",
      "explanation_cn": "在制图学或建筑学中，指仅展示某一结构或区域部分的剖面或局部图示。",
      "example_en": "The architect presented a sectional drawing of the building to show the internal staircase.",
      "example_cn": "建筑师展示了这座建筑的剖面图，以展示内部的楼梯结构。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "segmental",
      "analysis": "“Segmental”（分段的）更强调按自然或物理界限划分的片段，常用于生物学（如节肢动物的体节）或数学（如分段函数），具有更强的结构性和解剖学含义。而 “sectional” 更广泛用于人造物品（如家具）或抽象划分（如地区、选区），强调人为的模块化或分区。"
    },
    {
      "word_to_compare": "partial",
      "analysis": "“Partial”（部分的）侧重于不完整、非全部，常带有主观或情感色彩（如偏袒），强调“缺少整体性”。而 “sectional” 是中性术语，指系统性地划分为若干部分，不隐含缺失或缺陷，而是设计上的模块化特征。"
    },
    {
      "word_to_compare": "modular",
      "analysis": "“Modular”（模块化的）与 “sectional” 在家具或建筑语境中常可互换，但 “modular” 更强调标准化、可互换、可扩展的单元设计，常用于技术系统（如模块化软件、模块化房屋）；而 “sectional” 更侧重于“分段”这一物理形态，不一定强调标准化或可替换性。"
    }
  ]
}