{
  "word": "sectors",
  "pronunciation": "sek·tərz",
  "concise_definition": "n. 部门, 领域, 区段",
  "forms": {
    "singular": "sector"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A distinct part or division of an economy, industry, or society that has its own specific characteristics, functions, or participants, often used for analysis or classification.",
      "explanation_cn": "指经济、行业或社会中具有特定特征、功能或参与者的独立部分或领域，常用于分析或分类。",
      "example_en": "The technology sector has seen rapid growth over the past decade.",
      "example_cn": "过去十年中，科技行业经历了快速增长。"
    },
    {
      "pos": "noun",
      "explanation_en": "A specific area or region within a larger system, such as a geographic zone, a section of a market, or a portion of a circle in geometry.",
      "explanation_cn": "指较大系统中的特定区域或部分，例如地理区域、市场的一个部分，或几何学中的圆形扇区。",
      "example_en": "The sector of the circle represents one-eighth of its total area.",
      "example_cn": "这个圆形的扇区占其总面积的八分之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of organizations or businesses operating within a particular field or category, often used in economic or policy discussions.",
      "explanation_cn": "指在特定领域或类别中运营的一组组织或企业，常用于经济或政策讨论中。",
      "example_en": "The government is offering tax incentives to stimulate investment in the renewable energy sector.",
      "example_cn": "政府正在提供税收优惠，以刺激对可再生能源领域的投资。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "industry",
      "analysis": "“Industry”（产业）通常指生产同类产品或提供相似服务的整个商业领域，强调经济活动的类型（如汽车工业、纺织工业）。而 “sector” 范围更广，可涵盖多个相关行业，如 ‘public sector’（公共部门）包括政府、教育、医疗等多个行业。"
    },
    {
      "word_to_compare": "field",
      "analysis": "“Field”（领域）更常用于抽象或专业范畴，如学术领域（field of study）或职业领域（field of work），强调知识或技能的范围。而 “sector” 更偏向结构性划分，常用于经济、地理或组织层面的客观分区。"
    },
    {
      "word_to_compare": "segment",
      "analysis": "“Segment”（细分部分）强调将整体进一步细分为更小、更具体的子群体，常用于市场营销（如消费者细分市场）。而 “sector” 通常是宏观层面的划分，范围更大、更稳定，如 ‘primary sector’（第一产业）包含农业、采矿等。"
    }
  ]
}