{
  "word": "secured",
  "pronunciation": "sikyoord",
  "concise_definition": "adj. 安全的, 有保障的; v. (secure 的过去式和过去分词) 使安全, 获得, 保证",
  "forms": {
    "base_form": "secure",
    "third_person_singular": "secures",
    "past_tense": "secured",
    "past_participle": "secured",
    "present_participle": "securing"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Protected from danger, loss, or unauthorized access; having safeguards in place to ensure safety or stability.",
      "explanation_cn": "受到保护，免受危险、损失或未经授权的访问；具备保障措施以确保安全或稳定。",
      "example_en": "The bank offers a secured loan with low interest rates.",
      "example_cn": "这家银行提供利率较低的有担保贷款。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Feeling confident and free from worry, especially about one’s financial or emotional situation.",
      "explanation_cn": "感到自信且无忧无虑，尤其在财务或情感状况方面。",
      "example_en": "After years of saving, she felt truly secured in her retirement.",
      "example_cn": "经过多年的储蓄，她对退休生活感到真正安心。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make something safe or protected, often by using physical or legal means.",
      "explanation_cn": "通过物理或法律手段使某物变得安全或受保护。",
      "example_en": "They secured the door with a heavy lock before leaving.",
      "example_cn": "他们离开前用一把重锁锁好了门。"
    },
    {
      "pos": "verb",
      "explanation_en": "To obtain or acquire something, especially through effort or by ensuring its availability.",
      "explanation_cn": "通过努力或确保其可用性而获得某物。",
      "example_en": "The team secured a major sponsorship deal for the event.",
      "example_cn": "该团队为此次活动争取到了一项重要的赞助协议。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fasten or fix something firmly in place to prevent movement or loss.",
      "explanation_cn": "牢固地固定某物，防止其移动或丢失。",
      "example_en": "Passengers are required to secure their seatbelts during takeoff.",
      "example_cn": "乘客在起飞时必须系好安全带。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "safe",
      "analysis": "“Safe” (安全的) 是一个更通用的词，泛指没有危险或风险的状态，不强调是否采取了主动措施。而 “secured” 暗示了通过具体手段（如锁、协议、担保）主动实现了安全，更强调人为干预和保障机制。"
    },
    {
      "word_to_compare": "guaranteed",
      "analysis": "“Guaranteed” (有保证的) 通常指由第三方承诺确保结果或权益，常用于金融、服务或合同语境，强调承诺的可靠性。而 “secured” 更侧重于通过物理、法律或财务手段实际锁定或确保状态，不一定涉及第三方承诺。"
    },
    {
      "word_to_compare": "protected",
      "analysis": "“Protected” (受保护的) 强调处于某种防护体系之下，可能来自自然、法律或制度，但不一定意味着完全无风险。而 “secured” 更强调主动、彻底的防护，常隐含‘已排除主要威胁’的含义，语气更强、更确定。"
    }
  ]
}