{
  "word": "seed",
  "pronunciation": "seed",
  "concise_definition": "n. 种子, 种籽; v. 播种, 产生, 给...授粉",
  "forms": {
    "plural": "seeds",
    "third_person_singular": "seeds",
    "past_tense": "seeded",
    "past_participle": "seeded",
    "present_participle": "seeding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A plant structure containing an embryo and nutrients, capable of developing into a new plant under suitable conditions.",
      "explanation_cn": "一种植物结构，包含胚胎和营养物质，在适宜条件下能发育成新的植物。",
      "example_en": "The farmer planted corn seeds in the spring.",
      "example_cn": "农民在春天播下了玉米种子。"
    },
    {
      "pos": "noun",
      "explanation_en": "A source or origin of something, often used metaphorically to describe the beginning of a process, idea, or phenomenon.",
      "explanation_cn": "指某事物的源头或起因，常用于比喻，表示一个过程、想法或现象的开端。",
      "example_en": "The protest was the seed of a larger social movement.",
      "example_cn": "这次抗议是更大规模社会运动的开端。"
    },
    {
      "pos": "verb",
      "explanation_en": "To plant seeds in soil for the purpose of growing plants.",
      "explanation_cn": "将种子播入土壤中以培育植物。",
      "example_en": "They seeded the lawn with grass to restore its green cover.",
      "example_cn": "他们播下草籽以恢复草坪的绿色覆盖。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove seeds from a fruit or vegetable before cooking or eating.",
      "explanation_cn": "在烹饪或食用前去除水果或蔬菜中的种子。",
      "example_en": "She seeded the tomatoes before adding them to the salad.",
      "example_cn": "她在把番茄加入沙拉前去掉了籽。"
    },
    {
      "pos": "verb",
      "explanation_en": "To introduce or establish something, especially in a strategic or preliminary way, such as data, ideas, or opponents in a tournament.",
      "explanation_cn": "指有策略性或初步地引入或建立某事物，如数据、想法，或在比赛中安排参赛者。",
      "example_en": "The tournament was seeded to ensure top players meet only in the later rounds.",
      "example_cn": "比赛进行了种子排位，以确保顶尖选手只在后期轮次相遇。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "spore",
      "analysis": "“Spore”（孢子）是真菌、藻类和某些植物的无性繁殖单位，通常更微小，不包含胚胎或营养储备，依赖环境条件萌发。而 “seed” 是种子植物的有性繁殖结构，内含胚胎和营养，具有更强的生存能力和发育潜力。"
    },
    {
      "word_to_compare": "offspring",
      "analysis": "“Offspring”（后代）泛指生物体繁殖产生的下一代个体，可以是动物或人类的子女，强调血缘关系。而 “seed” 更侧重于植物繁殖的初始形态，或比喻性地指事物的起源，不直接指代成熟个体。"
    },
    {
      "word_to_compare": "initiative",
      "analysis": "“Initiative”（主动性/倡议）指人为发起的行动或计划，强调主观能动性。而 “seed” 作为比喻时，更强调一种潜在的、初始的、可能被后续发展激活的根源，不必然包含主动意图。例如，一个想法是‘种子’，而‘倡议’是主动播种的行为。"
    }
  ]
}