{
  "word": "seeking",
  "pronunciation": "see·king",
  "concise_definition": "v. 寻求, 寻找, 追求 (seek 的现在分词和动名词形式)",
  "forms": {
    "base_form": "seek",
    "third_person_singular": "seeks",
    "past_tense": "sought",
    "past_participle": "sought",
    "present_participle": "seeking"
  },
  "definitions": [
    {
      "pos": "verb (present participle)",
      "explanation_en": "To actively try to find, obtain, or attain something, often with purpose or urgency; can refer to physical, emotional, intellectual, or abstract goals.",
      "explanation_cn": "指有意识地努力寻找、获得或实现某物，常带有目的性或紧迫感；可指物理上的、情感上的、智力上的或抽象的目标。",
      "example_en": "She is seeking a new job after being laid off.",
      "example_cn": "她被裁员后正在寻找一份新工作。"
    },
    {
      "pos": "verb (present participle)",
      "explanation_en": "To look for or pursue a particular experience, relationship, or state of being, often driven by personal need or desire.",
      "explanation_cn": "指为追求某种特定经历、关系或存在状态而行动，通常由个人需求或愿望驱动。",
      "example_en": "Many young people are seeking meaning and purpose in their lives.",
      "example_cn": "许多年轻人正在寻求人生的意义与目标。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used as an adjective to describe someone who is actively looking for something, especially in contexts like employment, relationships, or opportunities.",
      "explanation_cn": "用作形容词，描述正在积极寻找某物的人，尤其用于就业、人际关系或机会等语境中。",
      "example_en": "He is a seeking candidate for the position, with strong references and relevant experience.",
      "example_cn": "他是一位积极应聘该职位的候选人，拥有出色的推荐信和相关经验。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "searching",
      "analysis": "“Searching” (搜索) 更强调系统性、广泛性或技术性的查找过程，常用于物理空间或信息检索，如搜索文件、搜索网络。而 “seeking” 更侧重于有目标、有动机的追求，常涉及情感、价值或抽象目标，语义更主观和深层。"
    },
    {
      "word_to_compare": "pursuing",
      "analysis": "“Pursuing” (追求) 通常指持续、坚定地朝某个目标前进，常带有长期性和竞争性，如追求事业、追求理想。而 “seeking” 更偏向于初始阶段的主动寻找，可能尚未进入持续行动阶段，语气相对更开放和探索性。"
    },
    {
      "word_to_compare": "looking for",
      "analysis": "“Looking for” 是 “seeking” 的口语化表达，语义相近，但更日常、更中性，常用于具体物品的寻找，如 “looking for my keys”。而 “seeking” 更正式、更书面，常用于抽象概念或重要目标，如 “seeking justice” 或 “seeking truth”。"
    }
  ]
}