{
  "word": "seen",
  "pronunciation": "sehn",
  "concise_definition": "v. 看见, 经历, 经过 (see 的过去分词)",
  "forms": {
    "base_form": "see",
    "third_person_singular": "sees",
    "past_tense": "saw",
    "present_participle": "seeing"
  },
  "definitions": [
    {
      "pos": "verb (past participle)",
      "explanation_en": "The past participle of 'see', used in perfect tenses and passive constructions to indicate that an act of perceiving with the eyes has occurred, or that an experience has been witnessed or undergone.",
      "explanation_cn": "是动词 'see' 的过去分词，用于完成时态和被动语态中，表示视觉上的感知行为已经发生，或某人曾目睹或经历过某事。",
      "example_en": "She has seen that movie three times already.",
      "example_cn": "她已经看过那部电影三次了。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used attributively to describe something that has been observed, experienced, or encountered before, often implying familiarity or prior exposure.",
      "explanation_cn": "用作定语，描述某事物曾被观察、经历或遭遇过，通常暗示熟悉性或先前的接触。",
      "example_en": "This is a seen-it-all attitude that comes from years of working in the city.",
      "example_cn": "这是一种源于多年在城市工作后形成的‘见多识广’的态度。"
    },
    {
      "pos": "verb (past participle) - figurative use",
      "explanation_en": "To have experienced or witnessed something significant, often used in expressions like 'been seen' to imply recognition, notoriety, or historical occurrence.",
      "explanation_cn": "用于比喻意义，表示经历过或见证过某件重要的事，常用于短语如 'been seen'，暗示被认可、出名或曾发生于历史上。",
      "example_en": "This scandal has been seen before in other political systems.",
      "example_cn": "这种丑闻在其他政治体制中也曾出现过。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "watched",
      "analysis": "“Watched” 强调持续、专注地观看，通常带有主动观察的意图，如观看比赛或电影。而 “seen” 更侧重于结果——即使只是短暂一瞥，只要视觉上接收到信息，即可用 “seen”。例如：I saw a bird fly by（我瞥见一只鸟飞过）vs. I watched the bird for ten minutes（我看了那只鸟十分钟）。"
    },
    {
      "word_to_compare": "observed",
      "analysis": "“Observed” 比 “seen” 更正式，强调有意识地注意、记录或分析所见之物，常用于科学、法律或学术语境。例如：The scientist observed the reaction（科学家观察了反应）。而 “seen” 更口语化，仅表示视觉感知，不隐含分析或记录。"
    },
    {
      "word_to_compare": "noticed",
      "analysis": "“Noticed” 指注意到某事物，通常是因为它从背景中突显出来，引起注意，强调的是认知上的觉察，而非单纯的视觉接触。例如：I noticed a change in her tone（我注意到她的语气变了）。而 “seen” 只说明视觉上接触过，不一定引起注意。"
    }
  ]
}