{
  "word": "seized",
  "pronunciation": "sēzd",
  "concise_definition": "v. 抓住, 夺取, 突然侵袭, 捕获",
  "forms": {
    "base_form": "seize",
    "third_person_singular": "seizes",
    "past_tense": "seized",
    "past_participle": "seized",
    "present_participle": "seizing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To take hold of something suddenly or forcibly, often with the hands or by physical action.",
      "explanation_cn": "指突然或强行用手或其他身体动作抓住某物。",
      "example_en": "The police seized the suspect's weapons during the raid.",
      "example_cn": "警察在突袭中没收了嫌疑人的武器。"
    },
    {
      "pos": "verb",
      "explanation_en": "To take control of something by force, especially property, power, or authority, often illegally or unexpectedly.",
      "explanation_cn": "指通过武力或突然行动夺取对某物（如财产、权力或权威）的控制，常带有非法或意外的性质。",
      "example_en": "The rebels seized the capital city after a week of fighting.",
      "example_cn": "叛军经过一周战斗后夺取了首都。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be suddenly overcome by a strong emotion, sensation, or condition, often unexpectedly.",
      "explanation_cn": "指突然被某种强烈的情绪、感觉或状况所笼罩，常为意外发生。",
      "example_en": "She was seized by a sudden fear as the lights went out.",
      "example_cn": "当灯光突然熄灭时，她突然感到一阵恐惧。"
    },
    {
      "pos": "verb",
      "explanation_en": "To capture or catch something, especially in the context of images, sounds, or moments, often in a vivid or lasting way.",
      "explanation_cn": "指捕捉（如图像、声音或瞬间），常强调以生动或持久的方式记录下来。",
      "example_en": "The photographer seized the perfect moment when the child laughed.",
      "example_cn": "摄影师捕捉到了孩子大笑的完美瞬间。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "grab",
      "analysis": "“Grab”（一把抓住）强调快速、粗鲁或急切地抓取，通常动作更短暂、更随意，常用于日常语境；而 “seize” 更强调力量、决心或突然性，常带有强制性或重大后果，语义更强烈。"
    },
    {
      "word_to_compare": "capture",
      "analysis": "“Capture”（俘获/捕捉）更常用于军事、摄影或抽象情境，强调成功控制或记录某物，语气较中性；而 “seize” 更强调通过强力或突然行动取得控制，常隐含非法性或对抗性。"
    },
    {
      "word_to_compare": "apprehend",
      "analysis": "“Apprehend”（逮捕）是法律术语，专指依法拘捕犯罪嫌疑人，强调程序性和合法性；而 “seize” 可用于非法或非正式的夺取行为，适用范围更广，不限于执法场景。"
    },
    {
      "word_to_compare": "overtake",
      "analysis": "“Overtake”（超越/赶上）指在运动或发展过程中从后方赶上并超过，强调位置或进度的变化；而 “seize” 强调的是对某物的控制或占有，不涉及相对位置的移动。"
    }
  ]
}