{
  "word": "selectively",
  "pronunciation": "suh·lek·tiv·lee",
  "concise_definition": "adv. 有选择地, 有甄别地",
  "forms": {
    "adjective": "selective"
  },
  "definitions": [
    {
      "pos": "adverb",
      "explanation_en": "In a manner that involves careful or deliberate choice, often excluding others; acting with discrimination or preference based on specific criteria.",
      "explanation_cn": "以谨慎或有意识地选择的方式进行，通常排除其他选项；基于特定标准做出有辨别力的偏好性行为。",
      "example_en": "The university selectively admits students based on academic excellence and extracurricular achievements.",
      "example_cn": "这所大学根据学术卓越和课外成就有选择地录取学生。"
    },
    {
      "pos": "adverb",
      "explanation_en": "Applied to only certain parts or members of a group, rather than universally or uniformly; not broadly or indiscriminately.",
      "explanation_cn": "仅作用于某一群体中的特定部分，而非普遍或无差别地适用；非广泛或无差别地进行。",
      "example_en": "The pesticide was selectively applied to affected crops to minimize environmental damage.",
      "example_cn": "这种杀虫剂仅有针对性地施用于受感染的作物，以最大限度减少对环境的破坏。"
    },
    {
      "pos": "adverb",
      "explanation_en": "With a focus on particular qualities or features, often to highlight or prioritize them over others.",
      "explanation_cn": "专注于特定的品质或特征，通常是为了突出或优先考虑它们而非其他方面。",
      "example_en": "She selectively shared only the most flattering details of her trip in her social media posts.",
      "example_cn": "她在社交媒体帖子中只挑选性地分享了旅行中最光鲜的细节。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "partially",
      "analysis": "“Partially”（部分地）仅表示不完整或不全部，强调的是范围上的不全面，但不隐含选择性或判断。例如，‘partially filled’ 仅说明未填满，而 ‘selectively filled’ 暗示了有意识地挑选了某些内容进行填充。"
    },
    {
      "word_to_compare": "discriminatingly",
      "analysis": "“Discriminatingly”（有鉴别力地）与 ‘selectively’ 非常接近，但更强调审美、品质或判断力上的高水准选择，常用于艺术、品味等语境。‘Selectively’ 更中性，可适用于任何基于标准的选择行为，包括商业或技术场景。"
    },
    {
      "word_to_compare": "arbitrarily",
      "analysis": "“Arbitrarily”（武断地）指无明确标准或理由地选择，与 ‘selectively’ 意义相反。‘Selectively’ 暗示理性、有依据的选择，而 ‘arbitrarily’ 则暗示随机、主观或不公平的决定。"
    }
  ]
}