{
  "word": "sell",
  "pronunciation": "sel",
  "concise_definition": "v. 卖, 销售, 推销; n. 卖出的商品, 销售能力",
  "forms": {
    "third_person_singular": "sells",
    "past_tense": "sold",
    "past_participle": "sold",
    "present_participle": "selling"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To exchange goods or services for money; to transfer ownership of something in return for payment.",
      "explanation_cn": "指以金钱交换商品或服务，将某物的所有权转让给他人以换取报酬。",
      "example_en": "The store sells organic vegetables and fair-trade coffee.",
      "example_cn": "这家商店出售有机蔬菜和公平贸易咖啡。"
    },
    {
      "pos": "verb",
      "explanation_en": "To persuade someone to accept or believe something, often by using convincing arguments or appealing to emotions.",
      "explanation_cn": "指通过有说服力的论点或情感诉求，使他人接受或相信某种观点、产品或想法，即‘推销’。",
      "example_en": "The politician tried to sell his plan for tax reform to the public.",
      "example_cn": "这位政治家试图向公众推销他的税收改革计划。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be perceived or regarded as acceptable or desirable, especially in a particular context or market.",
      "explanation_cn": "指在特定情境或市场中被接受或视为有吸引力，常用于描述想法、行为或产品的市场接受度。",
      "example_en": "This design won't sell in conservative markets—it's too bold.",
      "example_cn": "这种设计在保守市场卖不动——太前卫了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A successful sale or the act of selling something, often used in business contexts to describe performance.",
      "explanation_cn": "指一次成功的销售行为或销售成果，常用于商业语境中描述业绩表现。",
      "example_en": "The new product launch was a big sell, exceeding all sales targets.",
      "example_cn": "这款新产品的发布大获成功，超过了所有销售目标。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "market",
      "analysis": "“Market” (推销/营销) 作为动词时，强调通过广告、宣传和渠道推广来使产品被公众知晓和接受，过程更广泛、更系统。而 “sell” 更侧重于最终的交易行为或说服过程，是营销链条的末端环节。"
    },
    {
      "word_to_compare": "trade",
      "analysis": "“Trade” (交易) 通常指双方交换商品或服务，不一定涉及金钱，也可以是物物交换。而 “sell” 明确指向一方获得金钱，另一方获得商品，具有单向支付的特征。"
    },
    {
      "word_to_compare": "promote",
      "analysis": "“Promote” (推广/促销) 指通过广告、活动或公关手段提升产品或服务的知名度和吸引力，是销售前的准备阶段。而 “sell” 是促成实际购买行为的最终动作，更直接、更具结果导向。"
    }
  ]
}