{
  "word": "seller",
  "pronunciation": "sel·er",
  "concise_definition": "n. 卖家, 售货者, 出售者",
  "forms": {
    "plural": "sellers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person or entity that offers goods or services for sale, typically in exchange for money, and who holds the legal or practical responsibility for completing a transaction.",
      "explanation_cn": "指提供商品或服务以换取金钱的人或实体，通常对完成交易负有法律或实际责任。",
      "example_en": "The seller agreed to deliver the furniture within three business days.",
      "example_cn": "卖家同意在三个工作日内交付家具。"
    },
    {
      "pos": "noun",
      "explanation_en": "In financial markets, a party who offers an asset (such as stocks or commodities) for sale, often in contrast to a buyer who seeks to acquire it.",
      "explanation_cn": "在金融市场中，指提供资产（如股票或商品）出售的一方，通常与寻求购入资产的买方相对。",
      "example_en": "The seller of the stock received a premium due to high demand.",
      "example_cn": "由于需求旺盛，该股票的卖家获得了溢价。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who promotes or advocates for something, often used metaphorically to describe someone who strongly endorses an idea or product.",
      "explanation_cn": "比喻性地指积极推广或支持某事物的人，常用于形容强烈支持某种理念或产品的人。",
      "example_en": "She's a passionate seller of renewable energy solutions.",
      "example_cn": "她是可再生能源解决方案的积极倡导者。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "vendor",
      "analysis": "“Vendor”（供应商/小贩）通常指在特定场所（如市场、展会或线上平台）销售商品的个体或企业，更强调商业渠道和供应角色，常用于技术或政府采购语境。而 “seller” 更通用，涵盖从个人到企业的所有出售行为，语义范围更广。"
    },
    {
      "word_to_compare": "merchant",
      "analysis": "“Merchant”（商人）历史悠久，常指从事大宗贸易或长期商业活动的个体，带有传统或正式色彩，有时隐含财富与影响力。而 “seller” 更中性、现代，适用于任何规模的销售行为，不强调商业地位。"
    },
    {
      "word_to_compare": "vendor",
      "analysis": "“Vendor”（供应商/小贩）通常指在特定场所（如市场、展会或线上平台）销售商品的个体或企业，更强调商业渠道和供应角色，常用于技术或政府采购语境。而 “seller” 更通用，涵盖从个人到企业的所有出售行为，语义范围更广。"
    },
    {
      "word_to_compare": "dealer",
      "analysis": "“Dealer”（经销商/贩子）常用于指专门买卖特定商品（如汽车、古董、毒品）的中间商，有时带有负面或非法交易的隐含意义（如 drug dealer）。而 “seller” 是中性词，无此语义色彩，适用范围更广。"
    }
  ]
}