{
  "word": "sensory",
  "pronunciation": "sen·suh·ree",
  "concise_definition": "adj. 感觉的, 感官的, 与感官有关的",
  "forms": {
    "comparative": "sensory",
    "superlative": "sensory"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to the physical senses—sight, hearing, smell, taste, and touch—that allow organisms to perceive and interpret information from the environment.",
      "explanation_cn": "与人类或动物的五种基本感官（视觉、听觉、嗅觉、味觉和触觉）相关，指通过这些感官接收并解读外界环境信息的过程或特征。",
      "example_en": "The museum offers a sensory exhibit where visitors can touch textures and smell historical scents.",
      "example_cn": "这个博物馆提供了一个感官展览，参观者可以触摸不同质地并闻到历史气味。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used in neuroscience and psychology to describe stimuli, pathways, or brain regions involved in processing sensory input.",
      "explanation_cn": "在神经科学和心理学中，用于描述参与处理感官输入的刺激、神经通路或大脑区域。",
      "example_en": "Sensory neurons transmit signals from the skin to the spinal cord.",
      "example_cn": "感觉神经将来自皮肤的信号传递到脊髓。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Designed to stimulate or engage the senses, often used in contexts like education, therapy, or product design to enhance experience.",
      "explanation_cn": "旨在刺激或调动感官体验，常用于教育、治疗或产品设计领域，以增强感知和参与感。",
      "example_en": "Sensory toys help children with autism develop better motor and cognitive skills.",
      "example_cn": "感官玩具有助于自闭症儿童发展更好的运动和认知能力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "perceptual",
      "analysis": "“Perceptual”（知觉的）强调大脑对感官信息的解释和组织过程，是更高层次的认知功能；而 “sensory” 仅指感官接收原始刺激的阶段，如光线、声音、气味等，尚未经过大脑处理。例如，看到红色是感官输入，而识别它是“警告标志”则是知觉过程。"
    },
    {
      "word_to_compare": "physical",
      "analysis": "“Physical”（物理的）泛指与物质、身体或客观现实相关的任何属性，范围更广，包括重量、温度、结构等；而 “sensory” 专指通过感官系统所感知的属性，如颜色、气味、质地等。并非所有物理属性都能被感官直接感知（如磁场），但所有感官输入都属于物理现象。"
    },
    {
      "word_to_compare": "emotional",
      "analysis": "“Emotional”（情绪的）描述的是由感官输入引发的主观心理反应，如恐惧、愉悦或厌恶；而 “sensory” 仅描述刺激本身，不涉及情绪反应。例如，刺鼻的气味是感官刺激，而因此感到恶心则是情绪反应。两者常相关，但属于不同层面。"
    }
  ]
}