{
  "word": "sentimental",
  "pronunciation": "sen·tuh·men·tuhl",
  "concise_definition": "adj. 多愁善感的, 情感丰富的, 感伤的",
  "forms": {
    "comparative": "more sentimental",
    "superlative": "most sentimental"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Characterized by or appealing to emotion, especially nostalgia or tender feelings, often in an exaggerated or overly romanticized way.",
      "explanation_cn": "以情感为特征，尤其是怀旧或温柔的情感，常带有夸张或过度浪漫化的倾向。",
      "example_en": "She kept the old love letters in a velvet box, feeling sentimental about their youth.",
      "example_cn": "她把那些旧情书珍藏在丝绒盒里，对青春岁月充满感伤之情。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Tending to be easily moved by emotions, especially those associated with memory, loss, or affection; prone to tearfulness or romantic idealization.",
      "explanation_cn": "容易被与记忆、失去或亲情相关的情感所打动；倾向于流泪或对事物进行浪漫化的理想化。",
      "example_en": "He became sentimental at the sight of his childhood home, now abandoned and crumbling.",
      "example_cn": "当他看到自己儿时的家——如今已荒废破败——不禁感伤落泪。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or expressing emotion rather than reason; often used to describe art, music, or literature that aims to evoke deep feeling.",
      "explanation_cn": "与情感表达相关而非理性思考；常用于描述旨在唤起深刻情感的艺术、音乐或文学作品。",
      "example_en": "The film is a sentimental drama about family reunions and second chances.",
      "example_cn": "这部电影是一部关于家庭团聚与重获新生的感伤剧情片。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "emotional",
      "analysis": "“Emotional”（情绪化的）是一个更广泛、中性的词，泛指任何由情绪引发的反应，包括愤怒、恐惧或兴奋，不一定带有怀旧或温柔色彩。而 “sentimental” 特指一种温和、怀旧、常带理想化色彩的情感，通常与记忆和过去有关。"
    },
    {
      "word_to_compare": "nostalgic",
      "analysis": "“Nostalgic”（怀旧的）专指对过去时光的眷恋与思念，是 “sentimental” 的一个重要子集。所有怀旧的情绪都可能是感伤的，但并非所有感伤情绪都源于怀旧——例如，对当下离别的悲伤也可以是 sentimental，却不一定是 nostalgic。"
    },
    {
      "word_to_compare": "romantic",
      "analysis": "“Romantic”（浪漫的）强调理想化、激情或爱情的表达，常与爱情、冒险或崇高情感相关；而 “sentimental” 更侧重于温柔、细腻、易感的情绪，可能无关爱情，甚至可能显得过于矫情或缺乏理性。两者都可能理想化，但 “romantic” 更具主动性与激情，而 “sentimental” 更具被动性与感伤性。"
    }
  ]
}