{
  "word": "serbian",
  "pronunciation": "sərˈbiːən",
  "concise_definition": "adj. 塞尔维亚的, 塞尔维亚人的; n. 塞尔维亚语, 塞尔维亚人",
  "forms": {
    "comparative": "more Serbian",
    "superlative": "most Serbian"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to Serbia, its people, language, or culture; denoting anything originating from or characteristic of the Republic of Serbia.",
      "explanation_cn": "与塞尔维亚、其人民、语言或文化相关的；指源自塞尔维亚共和国或具有其特征的事物。",
      "example_en": "Serbian cuisine is known for its rich flavors and grilled meats.",
      "example_cn": "塞尔维亚美食以其浓郁的风味和烤肉而闻名。"
    },
    {
      "pos": "noun",
      "explanation_en": "The South Slavic language spoken primarily in Serbia, also used in Bosnia and Herzegovina, Montenegro, and Croatia; written in both Cyrillic and Latin scripts.",
      "explanation_cn": "主要在塞尔维亚使用的南斯拉夫语，也在波斯尼亚和黑塞哥维那、黑山及克罗地亚使用；使用西里尔字母和拉丁字母两种书写系统。",
      "example_en": "She is learning Serbian to communicate with her grandmother in Belgrade.",
      "example_cn": "她正在学习塞尔维亚语，以便与在贝尔格莱德的祖母交流。"
    },
    {
      "pos": "noun",
      "explanation_en": "A native or inhabitant of Serbia; a person of Serbian ethnicity.",
      "explanation_cn": "塞尔维亚的原住民或居民；塞尔维亚族人。",
      "example_en": "Many Serbian artists have gained international recognition in recent years.",
      "example_cn": "近年来，许多塞尔维亚艺术家获得了国际认可。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "serb",
      "analysis": "“Serb” (塞尔维亚人) 是一个专指民族身份的名词，仅用于指代塞尔维亚族人，不用于形容词或语言。而 “Serbian” 既可以作名词（指人或语言），也可以作形容词，涵盖范围更广，包括文化、语言、地理等属性。"
    },
    {
      "word_to_compare": "yugoslav",
      "analysis": "“Yugoslav” (南斯拉夫的/南斯拉夫人) 指的是前南斯拉夫社会主义联邦共和国的国家或民族身份，涵盖多个民族（包括塞尔维亚人、克罗地亚人、斯洛文尼亚人等）。而 “Serbian” 仅特指塞尔维亚民族或其相关事物，是更精确、更现代的术语，尤其在南斯拉夫解体后。"
    },
    {
      "word_to_compare": "bosnian",
      "analysis": "“Bosnian” (波斯尼亚的/波斯尼亚人) 指波斯尼亚和黑塞哥维那的国家、民族或语言，虽然与塞尔维亚语高度相似，但因政治和民族认同差异，被视为独立语言。两者同属塞尔维亚-克罗地亚语的方言连续体，但 “Serbian” 强调使用西里尔字母和更保守的语音传统，而 “Bosnian” 更倾向拉丁字母和土耳其语借词。"
    }
  ]
}