{
  "word": "servicing",
  "pronunciation": "sər·vih·sihng",
  "concise_definition": "n. 维护, 保养, 服务",
  "forms": {
    "base_form": "service",
    "third_person_singular": "services",
    "past_tense": "serviced",
    "past_participle": "serviced",
    "present_participle": "servicing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of maintaining, repairing, or providing routine care to equipment, vehicles, or systems to ensure optimal performance and longevity.",
      "explanation_cn": "指为设备、车辆或系统进行维护、修理或提供例行保养，以确保其最佳性能和延长使用寿命。",
      "example_en": "The car's servicing schedule is every 10,000 kilometers or six months, whichever comes first.",
      "example_cn": "这辆车的保养周期为每行驶10,000公里或每六个月，以先到者为准。"
    },
    {
      "pos": "noun",
      "explanation_en": "The provision of ongoing support or assistance to customers, especially in the context of technical products, software, or financial services.",
      "explanation_cn": "指为客户提供持续的支持或协助，尤其在技术产品、软件或金融服务领域。",
      "example_en": "The company offers excellent servicing for its premium customers, including 24/7 technical support.",
      "example_cn": "该公司为其高端客户提供卓越的服务，包括7×24小时技术支持。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process of performing routine checks and adjustments on machinery or infrastructure to prevent breakdowns and maintain efficiency.",
      "explanation_cn": "指对机械或基础设施进行例行检查与调整，以防止故障并维持运行效率。",
      "example_en": "Regular servicing of the HVAC system ensures energy efficiency and indoor air quality.",
      "example_cn": "定期对暖通空调系统进行保养，可确保能源效率和室内空气质量。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "maintenance",
      "analysis": "“Maintenance”（维护）是一个更广泛、更通用的术语，涵盖所有保持设备或系统正常运行的活动，包括清洁、润滑、更换零件等。而 “servicing” 更强调有计划的、周期性的专业操作，通常由技术人员执行，具有更强的程序性和技术性。"
    },
    {
      "word_to_compare": "repair",
      "analysis": "“Repair”（修理）特指在设备发生故障或损坏后进行的修复行为，是被动应对；而 “servicing” 是预防性的，旨在避免故障发生，属于主动管理。一个设备可以定期接受 servicing，但只有在出问题时才需要 repair。"
    },
    {
      "word_to_compare": "support",
      "analysis": "“Support”（支持）范围更广，可包括远程协助、咨询、培训、软件更新等非物理性服务，常用于数字产品或服务行业。而 “servicing” 更侧重于物理设备的现场操作和机械性维护，具有更强的实体操作属性。"
    }
  ]
}