{
  "word": "settled",
  "pronunciation": "set·ld",
  "concise_definition": "adj. 安定的, 稳定的, 已解决的; v. 解决, 安顿, 平息",
  "forms": {
    "base_form": "settle",
    "past_tense": "settled",
    "past_participle": "settled",
    "present_participle": "settling",
    "third_person_singular": "settles"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "In a state of stability or permanence, especially after a period of change or uncertainty; not moving, changing, or unsettled.",
      "explanation_cn": "处于稳定或持久状态，尤其在经历变动或不确定之后；不再移动、变化或动荡。",
      "example_en": "After years of traveling, they finally found a settled life in the countryside.",
      "example_cn": "经过多年漂泊，他们终于在乡下过上了安定的生活。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Resolved or concluded, especially in reference to a dispute, matter, or decision; no longer open to debate or revision.",
      "explanation_cn": "指争议、事务或决定已得到解决，不再有争议或修改的余地。",
      "example_en": "The terms of the contract were settled weeks ago.",
      "example_cn": "合同条款几周前就已经确定了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To resolve or bring to an end a dispute, problem, or matter, often through negotiation or decision.",
      "explanation_cn": "通过协商或决定来解决争议、问题或事务。",
      "example_en": "They settled their differences over coffee.",
      "example_cn": "他们一边喝咖啡，一边解决了彼此的分歧。"
    },
    {
      "pos": "verb",
      "explanation_en": "To establish oneself in a place permanently or for a long time; to take up residence.",
      "explanation_cn": "长期或永久性地在某地安顿下来，建立居所。",
      "example_en": "Her family settled in Canada after fleeing war-torn Syria.",
      "example_cn": "她的家人在逃离战乱的叙利亚后，在加拿大安顿下来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to become stable or calm, such as dust, liquid, or emotions.",
      "explanation_cn": "使某物（如灰尘、液体或情绪）变得稳定或平静。",
      "example_en": "The dust settled after the storm passed.",
      "example_cn": "风暴过后，尘埃渐渐落定。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "resolved",
      "analysis": "“Resolved” 强调通过分析、决策或行动使问题得到明确的终结，常用于正式语境，如法律或技术问题。“Settled” 更广泛，可指情感、物理或法律层面的平息，语气更温和，有时包含妥协的意味。"
    },
    {
      "word_to_compare": "stabilized",
      "analysis": "“Stabilized” 侧重于使不稳定的状态恢复平衡，常用于科学、经济或生理语境，强调动态过程的控制。“Settled” 更强调结果的持久性与静止状态，不一定涉及主动干预。"
    },
    {
      "word_to_compare": "established",
      "analysis": "“Established” 指通过正式程序或长期努力使某事物（如制度、机构、习惯）获得认可和稳固地位，强调权威性和制度性。“Settled” 更偏向于个人或群体在某地或某事上的安顿，不必然涉及正式程序。"
    }
  ]
}