{
  "word": "setup",
  "pronunciation": "set·up",
  "concise_definition": "n. 安装, 配置, 布置; v. 安装, 搭建, 安排",
  "forms": {
    "plural": "setups",
    "third_person_singular": "sets up",
    "past_tense": "set up",
    "past_participle": "set up",
    "present_participle": "setting up"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The arrangement or configuration of equipment, systems, or components to function in a particular way, often referring to technical or organizational structures.",
      "explanation_cn": "指为实现特定功能而对设备、系统或组件进行的安排或配置，常用于技术或组织结构的语境。",
      "example_en": "The studio's audio setup includes high-end microphones and soundproofing panels.",
      "example_cn": "这个录音室的音频设备配置包括高端麦克风和隔音板。"
    },
    {
      "pos": "noun",
      "explanation_en": "A plan, organization, or arrangement of people, roles, or conditions designed to achieve a specific purpose, often implying an underlying system or scheme.",
      "explanation_cn": "指为实现特定目的而设计的人、角色或条件的安排或组织，常暗示一种潜在的系统或结构。",
      "example_en": "It was a clever setup: the entire meeting was staged to pressure him into resigning.",
      "example_cn": "这是一个巧妙的安排：整个会议都是精心策划的，目的是迫使他辞职。"
    },
    {
      "pos": "verb",
      "explanation_en": "To assemble, install, or configure equipment, software, or systems so that they are ready for use.",
      "explanation_cn": "指组装、安装或配置设备、软件或系统，使其处于可使用状态。",
      "example_en": "She spent the weekend setting up her new home office.",
      "example_cn": "她整个周末都在布置她的新家庭办公室。"
    },
    {
      "pos": "verb",
      "explanation_en": "To arrange or organize an event, situation, or scheme, sometimes with deceptive or manipulative intent.",
      "explanation_cn": "指安排或组织某事件、情况或计划，有时带有欺骗或操纵的意图。",
      "example_en": "They set him up to take the blame for the theft.",
      "example_cn": "他们设局让他为盗窃案背黑锅。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "installation",
      "analysis": "“Installation” (安装) 更侧重于物理或技术层面的安装过程，通常指硬件或软件的部署，强调动作的完成。而 “setup” 不仅包含安装，还涵盖配置、调试和整体结构的安排，语义范围更广，常用于非技术语境（如人际关系中的‘设局’）。"
    },
    {
      "word_to_compare": "arrangement",
      "analysis": "“Arrangement” (安排) 是一个更通用的词，泛指任何事物的组织或协调，可用于时间、空间、人际关系等广泛场景。而 “setup” 更强调为实现特定功能或目的而构建的系统性结构，常隐含技术性或策略性，语气更具体、更结构化。"
    },
    {
      "word_to_compare": "configuration",
      "analysis": "“Configuration” (配置) 是技术术语，专指系统参数、组件或设置的精确调整，多用于计算机、网络等专业领域。而 “setup” 是更口语化、更宽泛的词，既可指技术配置，也可指非技术性的组织安排，适用范围更广。"
    }
  ]
}