{
  "word": "sevens",
  "pronunciation": "sev·uhnz",
  "concise_definition": "n. 七, 七个, 七人制橄榄球",
  "forms": {
    "singular": "seven"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The number 7; used to refer to a group or set of seven items, often in counting, games, or symbolic contexts.",
      "explanation_cn": "数字7；用于指代七个物品组成的群体或集合，常见于计数、游戏或象征性语境中。",
      "example_en": "She rolled double sevens in the dice game and won the round.",
      "example_cn": "她在掷骰子游戏中掷出了双七，赢得了这一轮。"
    },
    {
      "pos": "noun",
      "explanation_en": "A variant of rugby union played with seven players per side, known for its fast pace and high scoring; commonly used in international tournaments such as the World Rugby Sevens Series.",
      "explanation_cn": "一种橄榄球联盟的变体，每队七名球员，以节奏快、得分高著称；常用于国际赛事，如世界七人制橄榄球系列赛。",
      "example_en": "The team trained for months to compete in the sevens tournament at the Olympics.",
      "example_cn": "这支队伍为参加奥运会七人制橄榄球比赛训练了数月。"
    },
    {
      "pos": "noun",
      "explanation_en": "In some contexts, a reference to the seventh day of the week (Sunday) or the seventh item in a sequence, especially in religious or cultural traditions.",
      "explanation_cn": "在某些语境中，指一周的第七天（星期日）或序列中的第七个物品，尤其在宗教或文化传统中。",
      "example_en": "In many Christian traditions, the number seven symbolizes completion, as in the seven days of Creation.",
      "example_cn": "在许多基督教传统中，数字七象征着完整，正如创世的七天。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "seven",
      "analysis": "“Seven” 是基数词，表示数字7，作为名词时通常用于抽象或计数语境；而 “sevens” 是其复数形式，强调多个7或多个七人组，常用于游戏（如骰子）、体育（七人制橄榄球）或重复出现的集合中，具有更强的实体性和复数含义。"
    },
    {
      "word_to_compare": "septet",
      "analysis": "“Septet” 指由七人组成的音乐团体或表演组合，专用于艺术领域，强调组织性与协作性；而 “sevens” 在体育语境中特指七人制橄榄球，是项目名称而非团体名称，更侧重规则和形式而非成员构成。"
    },
    {
      "word_to_compare": "heptad",
      "analysis": "“Heptad” 是一个学术性或古语词汇，指由七个元素组成的集合，多用于数学、化学或神学文本中，语义抽象；而 “sevens” 是日常语言中更常见、更口语化的表达，广泛用于体育、游戏和文化语境，更具实用性和通俗性。"
    }
  ]
}