{
  "word": "sewing",
  "pronunciation": "soh·ing",
  "concise_definition": "n. 缝纫, 缝纫活计; v. 缝, 缝合",
  "forms": {
    "noun": "sewing",
    "verb_third_person_singular": "sews",
    "verb_past_tense": "sewed",
    "verb_past_participle": "sewn or sewed",
    "verb_present_participle": "sewing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The activity or craft of stitching fabric or other materials together with thread and a needle, often as a practical skill or artistic expression.",
      "explanation_cn": "指用线和针将布料或其他材料缝合在一起的活动或技艺，常作为实用技能或艺术表达形式。",
      "example_en": "She spends her evenings doing sewing and knitting.",
      "example_cn": "她每晚都做缝纫和编织。"
    },
    {
      "pos": "noun",
      "explanation_en": "The work or items produced by sewing, such as garments, quilts, or embroidery.",
      "explanation_cn": "指通过缝纫制作的作品或物品，如服装、被子或刺绣品。",
      "example_en": "The museum displayed a collection of antique sewing from the 18th century.",
      "example_cn": "博物馆展出了一组18世纪的古老缝纫作品。"
    },
    {
      "pos": "verb",
      "explanation_en": "To join or repair materials, especially fabric, by passing thread through them with a needle.",
      "explanation_cn": "指用针线将材料（尤其是布料）穿连或修补起来。",
      "example_en": "He sewed a button back onto his coat after it fell off.",
      "example_cn": "他把掉下来的纽扣重新缝回了外套上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To close or fasten something by stitching, often to prevent leakage, tearing, or opening.",
      "explanation_cn": "指通过缝合来封闭或固定某物，通常是为了防止泄漏、撕裂或打开。",
      "example_en": "The surgeon sewed the incision closed after the operation.",
      "example_cn": "外科医生在手术后将切口缝合起来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "stitching",
      "analysis": "“Stitching” (缝线/针迹) 是指具体的缝合动作或形成的线迹，是“sewing”的组成部分。它更强调技术性细节，如针法类型（平针、锁边针等），而 “sewing” 是涵盖整个缝纫过程的总称，包括设计、裁剪、缝合和整理。"
    },
    {
      "word_to_compare": "tailoring",
      "analysis": "“Tailoring” (裁缝工艺) 是一种专业化的缝纫形式，特指为个人量身定制服装，强调剪裁、合体性和高级工艺。而 “sewing” 是更广泛、基础的技能，可应用于日常修补、手工制品或非定制服装制作。"
    },
    {
      "word_to_compare": "mending",
      "analysis": "“Mending” (修补) 侧重于修复破损的物品，如补洞、加固磨损处，通常具有实用性和临时性。而 “sewing” 可以是创造性的、全新的制作，不一定涉及修复。修补是缝纫的一种应用，但缝纫的范围更广。"
    }
  ]
}