{
  "word": "sex",
  "pronunciation": "seks",
  "concise_definition": "n. 性别, 性, 性行为; v. (使) 性别化",
  "forms": {
    "plural": "sexes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The biological classification of organisms as male or female, based on reproductive anatomy, chromosomes, and secondary sexual characteristics.",
      "explanation_cn": "根据生殖器官、染色体和第二性征对生物体进行的男性或女性的生物学分类。",
      "example_en": "Biologists study sex differences in behavior across species.",
      "example_cn": "生物学家研究不同物种中性别在行为上的差异。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of sexual intercourse or physical intimacy involving sexual activity between individuals.",
      "explanation_cn": "指个体之间涉及性行为的性交或亲密身体接触。",
      "example_en": "Safe sex practices are essential to prevent the spread of sexually transmitted infections.",
      "example_cn": "安全性行为对于预防性传播感染至关重要。"
    },
    {
      "pos": "noun",
      "explanation_en": "A social or cultural construct that defines roles, behaviors, and expectations associated with being male or female, often distinct from biological sex.",
      "explanation_cn": "一种社会或文化建构，定义与男性或女性身份相关联的角色、行为和期望，常区别于生理性别。",
      "example_en": "Gender norms vary widely across cultures, but sex is often assumed to be binary.",
      "example_cn": "性别规范在不同文化中差异很大，但人们常默认性别是二元的。"
    },
    {
      "pos": "verb",
      "explanation_en": "To assign or attribute a sex to someone or something, often in a biological or social context.",
      "explanation_cn": "在生物或社会语境中，为某人或某物指定或赋予某种性别。",
      "example_en": "The doctor sexed the newborn based on physical characteristics.",
      "example_cn": "医生根据身体特征为新生儿确定了性别。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "gender",
      "analysis": "“Gender” (性别) 指社会文化建构的男性或女性角色、行为和身份，具有流动性和多样性；而 “sex” 主要指生物学上的男性或女性分类，基于生理特征。两者常被混用，但在学术和语境精确表达中需区分。"
    },
    {
      "word_to_compare": "copulation",
      "analysis": "“Copulation” (交配) 是一个更专业、更生物学术语，专指动物或人类的性交行为，语气中性或科学；而 “sex” 是通用词，既可用于生物学语境，也可用于日常口语，涵盖更广的情感与社会维度。"
    },
    {
      "word_to_compare": "lust",
      "analysis": "“Lust” (色欲) 指强烈的性欲望或性冲动，强调心理和情感层面的渴望；而 “sex” 是中性词，指行为本身或分类，不必然包含欲望或情感成分。"
    }
  ]
}