{
  "word": "sexuality",
  "pronunciation": "sek·suh·wal·uh·tee",
  "concise_definition": "n. 性, 性欲, 性取向",
  "forms": {
    "plural": "sexualities"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The state or quality of being sexual; the capacity for sexual feelings, behaviors, and expressions, including physical attraction, desire, and activity.",
      "explanation_cn": "指个体作为性存在所具备的特质或状态，包括性感受、性行为和性表达的能力，涵盖身体吸引、欲望和性活动。",
      "example_en": "Sexuality is a natural and essential part of human identity and development.",
      "example_cn": "性欲是人类身份与发展的自然且重要组成部分。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person's sexual orientation or identity, such as heterosexual, homosexual, bisexual, or asexual, which defines the gender(s) they are emotionally, romantically, or sexually attracted to.",
      "explanation_cn": "指一个人的性取向或性身份，如异性恋、同性恋、双性恋或无性恋，用以界定其在情感、浪漫或性方面被何种性别所吸引。",
      "example_en": "She is exploring her sexuality and has come to identify as pansexual.",
      "example_cn": "她正在探索自己的性取向，并已认同为泛性恋。"
    },
    {
      "pos": "noun",
      "explanation_en": "The cultural, social, and psychological dimensions of sexual behavior and identity, including norms, taboos, and expressions shaped by society and individual experience.",
      "explanation_cn": "指性行为与性身份所涉及的文化、社会与心理层面，包括由社会规范和个人经历塑造的性观念、禁忌与表达方式。",
      "example_en": "Different cultures have vastly different attitudes toward sexuality, influencing everything from education to media representation.",
      "example_cn": "不同文化对性欲的态度差异巨大，影响着从性教育到媒体表征的方方面面。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sex",
      "analysis": "“Sex” (性/性行为) 通常指生理上的性行为、性别分类或生殖特征，强调生物学层面。而 “sexuality” 是一个更广泛、更复杂的概念，涵盖心理、情感、社会和文化层面的性认同与表达，不仅限于行为本身。"
    },
    {
      "word_to_compare": "desire",
      "analysis": "“Desire” (欲望) 仅指对某事物的强烈渴望，常用于性语境时指性冲动或性需求，是 sexuality 的一个组成部分。但 “sexuality” 包含的范围远大于欲望，还包括身份认同、关系模式、社会规范等。"
    },
    {
      "word_to_compare": "orientation",
      "analysis": "“Orientation” (取向) 通常特指性取向（如 heterosexual, homosexual），是 sexuality 的一个子集。而 “sexuality” 是一个总括性术语，包含性取向、性表达、性认同、性行为等多个维度，是一个更全面的概念。"
    }
  ]
}