{
  "word": "shadow",
  "pronunciation": "shad·oh",
  "concise_definition": "n. 阴影, 阴暗处, 跟踪; v. 跟踪, 隐蔽地跟随",
  "forms": {
    "plural": "shadows",
    "third_person_singular": "shadows",
    "past_tense": "shadowed",
    "past_participle": "shadowed",
    "present_participle": "shadowing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A dark area or shape produced by a body coming between a source of light and a surface, blocking the light.",
      "explanation_cn": "指当物体遮挡光源时，在其后方形成的黑暗区域或轮廓，由光线被阻挡而产生。",
      "example_en": "The tree cast a long shadow across the lawn in the late afternoon.",
      "example_cn": "下午晚些时候，树木在草坪上投下了一道长长的阴影。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that follows someone closely, often secretly or in a threatening way, especially a person who is being watched or monitored.",
      "explanation_cn": "指密切跟随某人（常为秘密或具有威胁性）的人，尤指被监视或跟踪的对象。",
      "example_en": "The suspect was followed by a shadow all day, likely an undercover detective.",
      "example_cn": "嫌疑人一整天都被一个跟踪者尾随，很可能是便衣侦探。"
    },
    {
      "pos": "noun",
      "explanation_en": "A faint or indirect presence, influence, or reminder of something, often negative or mysterious.",
      "explanation_cn": "指某种事物模糊、间接的存在、影响或暗示，常带有负面或神秘的意味。",
      "example_en": "The old house had a shadow of sadness over it, as if memories lingered in its walls.",
      "example_cn": "那座老房子笼罩着一丝忧伤的阴影，仿佛记忆仍萦绕在墙间。"
    },
    {
      "pos": "verb",
      "explanation_en": "To follow someone closely and often secretly, especially for surveillance or protection.",
      "explanation_cn": "指密切且常常秘密地跟随某人，尤指为了监视或保护。",
      "example_en": "The security team shadowed the celebrity to ensure her safety.",
      "example_cn": "安保团队秘密跟随这位名人，以确保她的安全。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be or cast a shadow over something, often implying a negative influence or looming threat.",
      "explanation_cn": "指在某事物上投下阴影，常暗示负面的影响或迫近的威胁。",
      "example_en": "The scandal has shadowed his entire political career.",
      "example_cn": "这起丑闻一直笼罩着他的整个政治生涯。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "shade",
      "analysis": "“Shade”（阴凉处）通常指光线被部分遮挡后形成的较柔和、不明显的暗区，常用于描述舒适或凉爽的环境，如树荫。而 “shadow” 更强调清晰、轮廓分明的黑暗区域，常带有心理或象征上的沉重感，如恐惧或威胁。"
    },
    {
      "word_to_compare": "silhouette",
      "analysis": "“Silhouette”（剪影）指物体在明亮背景前呈现的清晰轮廓，通常是正面的、艺术化的视觉形象，强调外形而非黑暗本身。而 “shadow” 是光线被阻挡后形成的暗区，不一定保留物体的完整轮廓，且更常用于描述物理或隐喻性的遮蔽。"
    },
    {
      "word_to_compare": "stalker",
      "analysis": "“Stalker”（跟踪狂）特指出于痴迷、恶意或非法目的持续跟踪他人的人，带有强烈负面情感色彩和法律含义。而 “shadow” 作为动词或名词时，跟踪行为可以是中性的（如安保）或负面的，语义范围更广，不必然包含心理病态。"
    }
  ]
}