{
  "word": "shadows",
  "pronunciation": "shad·ohz",
  "concise_definition": "n. 阴影, 阴暗处, 妨碍, 暗影",
  "forms": {
    "singular": "shadow"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A dark area or shape produced by a body coming between rays of light and a surface, caused by the obstruction of light.",
      "explanation_cn": "指当物体阻挡光线时，在表面形成的黑暗区域或形状，由光线被遮挡而产生。",
      "example_en": "The trees cast long shadows across the lawn in the late afternoon.",
      "example_cn": "下午晚些时候，树木在草坪上投下长长的阴影。"
    },
    {
      "pos": "noun",
      "explanation_en": "A faint or indistinct image or impression of something, often suggesting mystery, danger, or the unseen.",
      "explanation_cn": "指某物模糊不清的影像或印象，常暗示神秘、危险或不可见的事物。",
      "example_en": "He lived under the shadow of his father's reputation.",
      "example_cn": "他一直生活在父亲声誉的阴影之下。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or group that secretly follows or monitors someone, often for surveillance or espionage.",
      "explanation_cn": "指秘密跟踪或监视某人的人或团体，常用于监视或间谍活动。",
      "example_en": "The spy was followed by government shadows all day.",
      "example_cn": "这名间谍一整天都被政府的暗探跟踪。"
    },
    {
      "pos": "noun",
      "explanation_en": "A metaphorical representation of something negative, such as fear, guilt, or a hidden aspect of the self.",
      "explanation_cn": "指某种负面事物的隐喻性表现，如恐惧、内疚或自我中隐藏的一面。",
      "example_en": "She struggled to confront the shadows of her childhood trauma.",
      "example_cn": "她努力面对童年创伤留下的心理阴影。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "shade",
      "analysis": "“Shade”（阴凉处）通常指因遮挡阳光而形成的较柔和、较明亮的暗区，常用于描述舒适或凉爽的环境，如树荫。而 “shadow” 更强调由物体完全阻挡光线形成的清晰、浓重的黑暗轮廓，常带有心理或象征意义。"
    },
    {
      "word_to_compare": "darkness",
      "analysis": "“Darkness”（黑暗）是光线的完全缺失，是一种整体状态，不依赖于物体遮挡。而 “shadow” 是局部的、由特定光源和物体关系产生的黑暗区域，具有明确的形状和边界。"
    },
    {
      "word_to_compare": "silhouette",
      "analysis": "“Silhouette”（剪影）指物体在明亮背景前呈现的清晰轮廓，通常为黑色，强调外形而非阴影本身。而 “shadow” 是光线被阻挡后投射在表面的暗区，不一定保留物体的完整轮廓，且可存在于任何背景上。"
    }
  ]
}