{
  "word": "shafts",
  "pronunciation": "shafts",
  "concise_definition": "n. 轴, 杆, 光束, 竖井",
  "forms": {
    "singular": "shaft"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long, cylindrical rod or bar that transmits rotational motion and power in machinery, such as in engines or motors.",
      "explanation_cn": "指在机械中传递旋转运动和动力的长圆柱形杆或轴，常见于发动机或电机中。",
      "example_en": "The engine's crankshaft connects the pistons to the transmission system.",
      "example_cn": "发动机的曲轴将活塞与传动系统连接起来。"
    },
    {
      "pos": "noun",
      "explanation_en": "A long, narrow vertical passage or hole, especially one leading down into the earth, such as in a mine or elevator system.",
      "explanation_cn": "指一条狭长的垂直通道或孔洞，尤指通向地下的矿井或电梯井。",
      "example_en": "Miners descended into the coal shaft to inspect the tunnel walls.",
      "example_cn": "矿工们沿着煤井下降，检查隧道墙壁。"
    },
    {
      "pos": "noun",
      "explanation_en": "A long, straight beam or column, often used in architecture or as a support structure.",
      "explanation_cn": "指一种长而直的梁或柱，常用于建筑或作为支撑结构。",
      "example_en": "The ancient temple featured marble shafts supporting the roof.",
      "example_cn": "这座古庙用大理石柱支撑着屋顶。"
    },
    {
      "pos": "noun",
      "explanation_en": "A narrow beam of light, especially one passing through a gap or opening.",
      "explanation_cn": "指一束狭窄的光线，尤指通过缝隙或开口射入的光束。",
      "example_en": "A single shaft of sunlight pierced through the clouds and lit up the forest floor.",
      "example_cn": "一束阳光穿透云层，照亮了森林地面。"
    },
    {
      "pos": "noun",
      "explanation_en": "The long, slender stem of an arrow, dart, or similar projectile.",
      "explanation_cn": "指箭、飞镖或其他投射物的细长杆身。",
      "example_en": "The archer adjusted the fletching on the arrow shaft for better accuracy.",
      "example_cn": "弓箭手调整了箭杆上的尾羽以提高精准度。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rod",
      "analysis": "“Rod”（杆）泛指任何细长的固体条状物，材质和用途广泛，不一定用于传递动力或承载结构负荷。而 “shaft” 更特指在机械或建筑中承担旋转力、支撑力或作为通道的长杆，功能性和结构性更强。"
    },
    {
      "word_to_compare": "beam",
      "analysis": "“Beam”（梁）通常指水平或横向支撑的结构构件，用于承载重量，常见于建筑框架中。而 “shaft” 多为垂直或轴向构件，用于传递旋转运动或作为垂直通道，如电梯井或矿井。两者在受力方向和用途上有明显区别。"
    },
    {
      "word_to_compare": "spire",
      "analysis": "“Spires”（尖塔）是建筑顶部高耸的尖形结构，多用于教堂或塔楼，强调垂直形态和装饰性。而 “shaft” 虽然也可指垂直柱体，但更注重功能性（如传力、通道），而非装饰目的。"
    },
    {
      "word_to_compare": "ray",
      "analysis": "“Ray”（光线）指从光源发出的直线光束，常用于描述光的传播，是抽象的物理现象。而 “shaft” 在描述光时，强调其集中、成束、有形的视觉效果，常带有空间感和实体感，如穿过窗户的光柱。"
    }
  ]
}