{
  "word": "shaft",
  "pronunciation": "shæft",
  "concise_definition": "n. 轴, 杆, 竖井, 光束; v. 欺骗, 欺诈",
  "forms": {
    "plural": "shafts",
    "third_person_singular": "shafts",
    "past_tense": "shafted",
    "past_participle": "shafted",
    "present_participle": "shafting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long, slender, cylindrical rod or bar that transmits rotary motion or power, especially in machinery or vehicles.",
      "explanation_cn": "指用于传递旋转运动或动力的细长圆柱形杆状物，尤指机械或车辆中的传动轴。",
      "example_en": "The engine's crankshaft connects the pistons to the transmission.",
      "example_cn": "发动机的曲轴将活塞与变速器连接起来。"
    },
    {
      "pos": "noun",
      "explanation_en": "A deep, narrow vertical passage, such as a mine shaft or elevator shaft, often extending downward into the earth.",
      "explanation_cn": "指深而窄的垂直通道，如矿井竖井或电梯井，通常向下延伸至地下。",
      "example_en": "The miners descended into the shaft to check the ventilation system.",
      "example_cn": "矿工们进入竖井检查通风系统。"
    },
    {
      "pos": "noun",
      "explanation_en": "A long, narrow beam of light, especially one passing through a gap in clouds or a window.",
      "explanation_cn": "指一束细长的光线，尤指穿过云层缝隙或窗户的光束。",
      "example_en": "A shaft of sunlight pierced through the dark clouds, illuminating the field.",
      "example_cn": "一束阳光穿透乌云，照亮了田野。"
    },
    {
      "pos": "verb",
      "explanation_en": "To treat someone unfairly or deceitfully, especially by cheating them out of money, credit, or opportunity.",
      "explanation_cn": "指以不公平或欺骗的方式对待某人，尤其是通过欺诈手段剥夺其金钱、名誉或机会。",
      "example_en": "He felt shafted when his colleague took credit for his idea.",
      "example_cn": "当他的同事把他的主意据为己有时，他感到被欺骗了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rod",
      "analysis": "“Rod”（杆）泛指任何细长的固体条状物，用途广泛，不特指传递动力或垂直结构。而 “shaft” 更强调功能性，如传动、支撑或垂直通道，常用于工程或机械语境中，语义更专业。"
    },
    {
      "word_to_compare": "beam",
      "analysis": "“Beam”（梁/光束）可指建筑结构中的承重横梁，也可指光线。作为光束时，与 “shaft” 可互换，但 “shaft” 更具文学性和视觉冲击力，常用于描述穿透性、戏剧性的光线，而 “beam” 更中性、通用。"
    },
    {
      "word_to_compare": "cheat",
      "analysis": "“Cheat”（欺骗）是通用词，泛指任何形式的不诚实行为，如作弊、造假。而 “shaft” 作为动词时，语气更强烈，带有被背叛、被暗算的意味，常用于口语，强调受害者感到被不公对待，语义更情感化。"
    }
  ]
}