{
  "word": "shake",
  "pronunciation": "shayk",
  "concise_definition": "v. 摇动, 颤抖, 握手; n. 摇动, 颤抖, 奶昔",
  "forms": {
    "third_person_singular": "shakes",
    "past_tense": "shook",
    "past_participle": "shaken",
    "present_participle": "shaking"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move or cause to move back and forth or up and down with short, rapid motions, often due to force, vibration, or emotion.",
      "explanation_cn": "指以短促、快速的来回或上下动作移动或使某物移动，通常由外力、震动或情绪引起。",
      "example_en": "The earthquake made the buildings shake violently.",
      "example_cn": "地震使建筑物剧烈摇晃。"
    },
    {
      "pos": "verb",
      "explanation_en": "To tremble or quiver, typically as a result of fear, cold, excitement, or weakness.",
      "explanation_cn": "指因恐惧、寒冷、兴奋或虚弱而颤抖或战栗。",
      "example_en": "She shook with fear as the stranger approached.",
      "example_cn": "当那个陌生人走近时，她因恐惧而颤抖。"
    },
    {
      "pos": "verb",
      "explanation_en": "To join hands with someone in a gesture of greeting, agreement, or farewell.",
      "explanation_cn": "指通过握手表示问候、同意或告别。",
      "example_en": "They shook hands after signing the contract.",
      "example_cn": "签署合同后，他们握了手。"
    },
    {
      "pos": "noun",
      "explanation_en": "A drink made by blending ice cream, milk, and flavorings, typically served in a glass.",
      "explanation_cn": "指将冰淇淋、牛奶和调味品混合制成的饮品，通常盛在玻璃杯中饮用。",
      "example_en": "He ordered a chocolate shake after dinner.",
      "example_cn": "他晚饭后点了一杯巧克力奶昔。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden, uncontrolled movement or vibration, often indicating instability or disturbance.",
      "explanation_cn": "指突然、不受控制的移动或震动，常表示不稳定或干扰。",
      "example_en": "The car gave a violent shake as it hit the pothole.",
      "example_cn": "汽车撞上坑洞时剧烈颠簸了一下。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tremble",
      "analysis": "“Tremble” (颤抖) 通常指因情绪（如恐惧、激动）或寒冷引起的细微、持续的抖动，多用于描述人或生物的生理反应，语气较文雅。而 “shake” 更通用，可指强烈、可见的晃动，包括由外力或机械原因引起的动作。"
    },
    {
      "word_to_compare": "vibrate",
      "analysis": "“Vibrate” (振动) 强调物体因机械力或能量作用而快速、有规律地来回运动，常用于物理或技术语境（如手机振动）。而 “shake” 更偏向于不规则、非机械性的剧烈晃动，常带情感或突发性色彩。"
    },
    {
      "word_to_compare": "quiver",
      "analysis": "“Quiver” (颤动) 通常指轻微、快速、持续的抖动，常用于描述树叶、嘴唇或声音的细微波动，带有诗意或细腻的意味。而 “shake” 更强调动作的幅度和力量，语义范围更广，可涵盖从轻微抖动到剧烈摇晃。"
    }
  ]
}