{
  "word": "shaking",
  "pronunciation": "shay·king",
  "concise_definition": "n. 颤抖, 震动; v. 颤抖, 摇动, 摇晃",
  "forms": {
    "base_form": "shake",
    "third_person_singular": "shakes",
    "past_tense": "shook",
    "past_participle": "shaken",
    "present_participle": "shaking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A rapid, involuntary movement back and forth or up and down, often caused by fear, cold, excitement, or physical illness.",
      "explanation_cn": "一种快速、不自主的前后或上下运动，通常由恐惧、寒冷、兴奋或身体疾病引起。",
      "example_en": "She was overcome with a shaking after hearing the terrifying news.",
      "example_cn": "听到这个可怕的消息后，她浑身颤抖不已。"
    },
    {
      "pos": "noun",
      "explanation_en": "A trembling or vibration in a structure or object, often due to external force or instability.",
      "explanation_cn": "指结构或物体因外力或不稳定性而产生的颤动或震动。",
      "example_en": "The earthquake caused a violent shaking of the buildings.",
      "example_cn": "地震导致建筑物剧烈震动。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move something rapidly and repeatedly in a back-and-forth or up-and-down motion, often deliberately.",
      "explanation_cn": "指有意识地使某物快速、反复地前后或上下移动。",
      "example_en": "He was shaking the bottle to mix the contents.",
      "example_cn": "他正在摇晃瓶子以混合内容物。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause someone to feel fear, nervousness, or emotional disturbance, often used in the passive form.",
      "explanation_cn": "指使某人感到恐惧、紧张或情绪波动，常用于被动语态。",
      "example_en": "The horror movie really shook her — she couldn't sleep for days.",
      "example_cn": "那部恐怖片真的让她心神不宁，好几天都睡不着觉。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "trembling",
      "analysis": "“Trembling”（颤抖）更强调因情绪（如恐惧、激动）或生理原因（如寒冷、衰老）引起的细微、持续的抖动，常带有脆弱或无助的意味。而 “shaking” 可以是轻微的，也可以是剧烈的，涵盖范围更广，包括人为的摇动（如摇瓶子）和外力引起的震动（如地震）。"
    },
    {
      "word_to_compare": "vibrating",
      "analysis": "“Vibrating”（振动）通常指物体因机械力或能量作用而产生的高频、有规律的微小运动，多用于物理或工程语境（如手机振动、引擎振动）。而 “shaking” 更偏向于不规则、非机械性的、有时是失控的运动，常伴随情感或不稳定状态。"
    },
    {
      "word_to_compare": "quaking",
      "analysis": "“Quaking”（战栗）是 “shaking” 的一种强烈形式，常用于文学语境，强调因极度恐惧或敬畏而产生的全身性颤抖，带有更浓烈的情感色彩。例如：quaking in fear。相比之下，”shaking“ 更中性、更常用，可描述生理、物理或情绪性反应。"
    }
  ]
}