{
  "word": "shanghai",
  "pronunciation": "shen·guy",
  "concise_definition": "v. 诱骗, 欺骗; n. 上海",
  "forms": {
    "third_person_singular": "shanghais",
    "past_tense": "shanghaied",
    "past_participle": "shanghaied",
    "present_participle": "shanghaing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To trick or coerce someone, often by deception or force, into doing something against their will, especially to join a ship's crew or engage in labor under false pretenses.",
      "explanation_cn": "通过欺骗或强迫手段，诱使某人违背其意愿做某事，尤指以虚假借口诱骗他人登船当水手或从事劳役。",
      "example_en": "The sailors were shanghaied into working on a merchant vessel without their consent.",
      "example_cn": "这些水手在未经同意的情况下被诱骗上了商船服役。"
    },
    {
      "pos": "verb",
      "explanation_en": "To manipulate or pressure someone into accepting a situation or decision they would otherwise avoid.",
      "explanation_cn": "通过操纵或施压，迫使某人接受其本会回避的情况或决定。",
      "example_en": "He was shanghaied into giving a speech at the conference, even though he was terrified of public speaking.",
      "example_cn": "尽管他害怕公开演讲，还是被逼着在会议上做了发言。"
    },
    {
      "pos": "noun",
      "explanation_en": "A major city in eastern China, one of the world's largest metropolises, known for its historical role as a commercial and cultural hub.",
      "explanation_cn": "中国东部的一个主要城市，世界最大的都市之一，以其作为商业与文化中心的历史地位而闻名。",
      "example_en": "Shanghai is famous for its skyline along the Bund and its vibrant food scene.",
      "example_cn": "上海以其外滩的天际线和丰富多彩的美食文化而闻名。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "coerce",
      "analysis": "“Coerce” (胁迫) 指通过威胁或暴力手段迫使他人行动，强调直接的强制力，通常不涉及欺骗。而 “shanghai” 特指以欺骗、伪装或诡计诱骗他人，常带有历史语境中的非法绑架或诱骗劳工的含义，欺骗性是其核心特征。"
    },
    {
      "word_to_compare": "manipulate",
      "analysis": "“Manipulate” (操纵) 是一个更广泛、中性的词，指通过策略或影响控制他人行为，不必然带有非法或强迫色彩。而 “shanghai” 是一个更具贬义和具体历史背景的词，特指以欺骗手段使他人陷入不利或非自愿的处境，语义更强烈、更具体。"
    },
    {
      "word_to_compare": "recruit",
      "analysis": "“Recruit” (招募) 是中性或正面的词，指合法、公开地吸引人员加入组织或工作。而 “shanghai” 是其反义词，指非法、欺骗性地“招募”人员，常用于描述19世纪海员被诱骗上船的黑暗历史，带有强烈的道德谴责意味。"
    }
  ]
}