{
  "word": "shape",
  "pronunciation": "shāp",
  "concise_definition": "n. 形状, 状态, 形式; v. 形成, 使成形, 影响",
  "forms": {
    "third_person_singular": "shapes",
    "past_tense": "shaped",
    "past_participle": "shaped",
    "present_participle": "shaping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The external form or contour of an object, especially as defined by its outline or structure.",
      "explanation_cn": "指物体的外部形态或轮廓，通常由其外缘或结构所界定。",
      "example_en": "The sculpture has an elegant, flowing shape.",
      "example_cn": "这座雕塑拥有优雅流畅的形状。"
    },
    {
      "pos": "noun",
      "explanation_en": "A particular condition or state of something, often referring to physical or functional well-being.",
      "explanation_cn": "指某物的特定状况或状态，常用于描述身体、健康或功能上的状况。",
      "example_en": "After the accident, he was in bad shape and needed months to recover.",
      "example_cn": "事故发生后，他身体状况很差，需要数月才能康复。"
    },
    {
      "pos": "noun",
      "explanation_en": "A particular form or type of something abstract, such as an idea, system, or organization.",
      "explanation_cn": "指某种抽象事物（如思想、制度或组织）的具体形式或类型。",
      "example_en": "The new policy took shape after months of negotiation.",
      "example_cn": "经过数月的谈判，这项新政策终于成形。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give a particular form or structure to something, often through deliberate effort or influence.",
      "explanation_cn": "指通过有意识的努力或影响，使某物具有特定的形态或结构。",
      "example_en": "The teacher shaped the students' understanding of history through engaging stories.",
      "example_cn": "老师通过引人入胜的故事塑造了学生对历史的理解。"
    },
    {
      "pos": "verb",
      "explanation_en": "To influence or determine the development or character of something over time.",
      "explanation_cn": "指在一段时间内影响或决定某事物的发展方向或特征。",
      "example_en": "Her childhood experiences shaped her personality and worldview.",
      "example_cn": "她的童年经历塑造了她的性格和世界观。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "form",
      "analysis": "“Form”（形式）更侧重于事物的内在结构、组织方式或抽象模式，常用于哲学、艺术或科学语境中，强调本质性结构；而 “shape” 更偏向于外在轮廓或物理形态，更直观、具体。例如，一个杯子的 “form” 可能指其功能设计，而 “shape” 指它是圆柱形还是锥形。"
    },
    {
      "word_to_compare": "figure",
      "analysis": "“Figure”（外形/图形）常用于描述人或物体的轮廓，尤其在艺术或身体语境中（如人体轮廓），有时也指数字或符号；而 “shape” 更通用，适用于所有物体的外部形态，且可引申为抽象状态（如 in good shape）。此外，“figure” 更具视觉性，而 “shape” 更强调可塑性和变化过程。"
    },
    {
      "word_to_compare": "structure",
      "analysis": "“Structure”（结构）强调事物内部各部分的组织方式、支撑体系或逻辑关系，常用于建筑、组织或系统层面；而 “shape” 更关注外部轮廓或整体外观，不一定涉及内部机制。例如，一座桥的 “structure” 是钢梁和缆索的组合，而它的 “shape” 是拱形或悬索形。"
    }
  ]
}