{
  "word": "shared",
  "pronunciation": "sherd",
  "concise_definition": "adj. 共享的, 共有的; v. 分享, 共有 (share 的过去式和过去分词)",
  "forms": {
    "base_form": "share",
    "third_person_singular": "shares",
    "present_participle": "sharing",
    "past_tense": "shared",
    "past_participle": "shared"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Possessed, used, or experienced by two or more people or groups together; not private or individual.",
      "explanation_cn": "被两个人或多个群体共同拥有、使用或体验的；非私有的或个体独有的。",
      "example_en": "They live in a shared apartment and split the rent equally.",
      "example_cn": "他们合住一套公寓，平分房租。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Referring to something that is common or held in common, especially in values, beliefs, or interests.",
      "explanation_cn": "指某种共同拥有的事物，尤指价值观、信仰或兴趣上的共通点。",
      "example_en": "The two cultures have many shared traditions and festivals.",
      "example_cn": "这两种文化有许多共同的传统和节日。"
    },
    {
      "pos": "verb",
      "explanation_en": "To divide and use something with others, or to allow others to participate in or benefit from something you have.",
      "explanation_cn": "将某物与他人分用，或允许他人参与或受益于你所拥有的事物。",
      "example_en": "She shared her lunch with her hungry classmate.",
      "example_cn": "她把自己的午餐分给了饥饿的同学。"
    },
    {
      "pos": "verb",
      "explanation_en": "To express or disclose personal thoughts, feelings, or experiences with others, often to build connection or trust.",
      "explanation_cn": "向他人表达或透露个人的想法、感受或经历，通常是为了建立联系或信任。",
      "example_en": "He finally shared his struggles with his therapist after months of silence.",
      "example_cn": "经过数月的沉默，他终于向治疗师倾诉了自己的困扰。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "common",
      "analysis": "“Common” (共同的) 强调事物在多个主体中普遍存在或普遍拥有，但不一定涉及主动的分享行为。例如，common interest（共同兴趣）可能只是巧合重合。而 “shared” 更强调主体之间有意识地拥有、使用或交流该事物，隐含互动性。"
    },
    {
      "word_to_compare": "joint",
      "analysis": "“Joint” (联合的) 通常用于法律、财务或结构上的共同拥有，强调多方共同承担责任或权利，如 joint account（联名账户）、joint venture（合资企业）。它更正式、更制度化，而 “shared” 更口语化，适用范围更广，可指情感、物品或经验的分担。"
    },
    {
      "word_to_compare": "mutual",
      "analysis": "“Mutual” (相互的) 强调双向性，即双方或多方彼此拥有或影响，如 mutual respect（相互尊重）。它侧重于关系的对等性，而 “shared” 可以是单向分享（如你分享你的故事给我），不一定要求对方也回馈。"
    }
  ]
}