{
  "word": "share",
  "pronunciation": "shair",
  "concise_definition": "v. 分享, 共享; n. 份额, 股份",
  "forms": {
    "third_person_singular": "shares",
    "past_tense": "shared",
    "past_participle": "shared",
    "present_participle": "sharing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To divide and distribute something with others, or to use or experience something jointly with others.",
      "explanation_cn": "指将某物与他人分割并分发，或与他人共同使用、体验某物。",
      "example_en": "She shared her lunch with her hungry classmate.",
      "example_cn": "她把自己的午餐分给了饥饿的同学。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make known or disclose personal thoughts, feelings, or information with others, often in a trusting context.",
      "explanation_cn": "指在信任的语境中向他人表达或透露个人的想法、情感或信息。",
      "example_en": "He shared his struggles with anxiety during the therapy session.",
      "example_cn": "他在治疗过程中分享了自己与焦虑斗争的经历。"
    },
    {
      "pos": "verb",
      "explanation_en": "To post or forward digital content (such as a link, photo, or video) on social media or online platforms for others to see.",
      "explanation_cn": "指在社交媒体或在线平台上发布或转发数字内容（如链接、照片或视频），供他人查看。",
      "example_en": "They shared a funny meme on WhatsApp that went viral.",
      "example_cn": "他们在 WhatsApp 上分享了一个搞笑表情包，结果火了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A portion or part of something that is divided among several people or entities, especially in terms of ownership or profit.",
      "explanation_cn": "指在多人或多个实体之间分配的某物的一部分，尤指所有权或利润的份额。",
      "example_en": "Each partner received a 25% share of the company's profits.",
      "example_cn": "每位合伙人获得了公司利润的25%份额。"
    },
    {
      "pos": "noun",
      "explanation_en": "A unit of ownership in a company, typically represented by a stock certificate or electronic record.",
      "explanation_cn": "指公司所有权的单位，通常以股票证书或电子记录形式体现。",
      "example_en": "She bought 100 shares of Apple stock last year.",
      "example_cn": "她去年购买了100股苹果公司的股票。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "divide",
      "analysis": "“Divide” (分割) 强调将整体拆分成若干部分，通常不隐含“共同使用”或“给予他人”的意图，可能带有中性甚至对抗的语义（如分割财产）。而 “share” 更强调合作、给予或共同享有，带有积极的社会互动色彩。"
    },
    {
      "word_to_compare": "distribute",
      "analysis": "“Distribute” (分发) 通常指系统性地将物品或资源分配给多个接收者，常用于官方、商业或大规模场景（如分发物资）。它更注重流程和效率，而 “share” 更强调自愿、情感或人际关系中的给予。"
    },
    {
      "word_to_compare": "cooperate",
      "analysis": "“Cooperate” (合作) 指多个个体为共同目标而协同行动，强调行为上的配合。而 “share” 可以是单方面的给予（如分享食物），不一定需要协作。合作是过程，分享是内容的传递。"
    },
    {
      "word_to_compare": "portion",
      "analysis": "“Portion” (部分) 是一个名词，仅指某物的定量部分，无动作含义。而 “share” 既可作动词也可作名词，且作为名词时隐含“应得”或“分配所得”的含义，常用于经济或权利语境（如股份、份额），比 “portion” 更具社会和法律内涵。"
    }
  ]
}