{
  "word": "shark",
  "pronunciation": "shahrk",
  "concise_definition": "n. 鲨鱼, 诈骗者, 放高利贷者; v. 欺诈, 剥削",
  "forms": {
    "plural": "sharks"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A large, predatory marine fish with a cartilaginous skeleton, powerful jaws, and sharp teeth, known for its fearsome reputation and role as an apex predator in ocean ecosystems.",
      "explanation_cn": "一种体型庞大、具有软骨骨骼、强健颚部和锋利牙齿的掠食性海洋鱼类，以凶猛的声誉和作为海洋生态系统顶级捕食者的角色而闻名。",
      "example_en": "The divers were cautious as a great white shark circled nearby.",
      "example_cn": "潜水员们十分谨慎，因为一条大白鲨正在附近盘旋。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who exploits others for personal gain, especially in a predatory or unscrupulous way, such as a loan shark or a con artist.",
      "explanation_cn": "指以掠夺性或不道德的方式剥削他人以谋取私利的人，例如高利贷者或骗子。",
      "example_en": "He was accused of being a financial shark who preyed on desperate homeowners.",
      "example_cn": "他被指控是一名以绝望的房主为猎物的金融骗子。"
    },
    {
      "pos": "verb",
      "explanation_en": "To exploit or cheat someone, especially by taking advantage of their inexperience or vulnerability.",
      "explanation_cn": "指利用他人的无知或脆弱性进行欺诈或剥削。",
      "example_en": "The tourist was sharked into paying three times the fair price for the souvenir.",
      "example_cn": "这名游客被敲诈，为纪念品支付了三倍于合理价格的费用。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "predator",
      "analysis": "“Predator”（捕食者）是一个更广泛的生物学术语，泛指任何捕食其他动物的生物，包括狮子、鹰等陆地或空中动物。而 “shark” 特指海洋中的掠食性鱼类，具有特定的生理特征和生态位，语义更具体。"
    },
    {
      "word_to_compare": "swindler",
      "analysis": "“Swindler”（骗子）专指通过欺骗手段非法获取他人财物的人，强调欺诈行为本身，但不包含“掠夺性”或“强势压迫”的隐喻色彩。而 “shark” 在比喻义中不仅指欺骗，还暗含一种持续、主动、像猎食者般追击受害者的形象，语义更生动且带有贬义的压迫感。"
    },
    {
      "word_to_compare": "loan shark",
      "analysis": "“Loan shark”（高利贷者）是 “shark” 的一个具体子类，特指非法放贷并收取极高利息的人。虽然它本身是一个复合词，但其构成依赖于 “shark” 的比喻义，因此 “shark” 作为词根承载了剥削、无情、危险的核心语义，而 “loan shark” 是其在金融语境中的具体化表达。"
    }
  ]
}