{
  "word": "sharks",
  "pronunciation": "shahrks",
  "concise_definition": "n. 鲨鱼, 贪婪的人, 骗子",
  "forms": {
    "singular": "shark"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A large, predatory fish with a streamlined body, powerful jaws, and sharp teeth, typically found in saltwater environments and known for its role as an apex predator in marine ecosystems.",
      "explanation_cn": "一种体型流线型、具有强健颚部和锋利牙齿的大型掠食性鱼类，通常生活在咸水环境中，是海洋生态系统中的顶级捕食者。",
      "example_en": "The divers were cautious as a great white shark circled nearby.",
      "example_cn": "潜水员们十分谨慎，因为一条大白鲨正在附近盘旋。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who exploits others for personal gain, especially in financial or business contexts, often through cunning or ruthless tactics.",
      "explanation_cn": "指在金融或商业环境中利用他人谋取私利的人，常以狡猾或无情的手段行事，如高利贷者或欺诈性投资者。",
      "example_en": "He was accused of being a loan shark, charging exorbitant interest rates to desperate borrowers.",
      "example_cn": "他被指控为高利贷者，向急需资金的借款人收取极高的利息。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is highly skilled or aggressive in a particular field, often with a connotation of being unscrupulous or predatory.",
      "explanation_cn": "指在某一领域中技艺高超或极具攻击性的人，常带有不择手段或掠夺性的负面含义，如‘扑克鲨鱼’或‘股市鲨鱼’。",
      "example_en": "She’s a poker shark—she always wins when she sits down at the table.",
      "example_cn": "她是个扑克高手——只要一坐到牌桌旁，她就从不失手。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "predator",
      "analysis": "“Predator”（捕食者）是一个更广泛的生物学术语，泛指任何以其他生物为食的动物，包括狮子、鹰等陆地或空中动物。而 “shark” 特指海洋中的掠食性鱼类，具有鲜明的形态特征和文化象征意义，常被赋予神秘或恐怖的色彩。"
    },
    {
      "word_to_compare": "swindler",
      "analysis": "“Swindler”（骗子）强调通过欺骗手段非法获取财物，通常指有计划的欺诈行为，如伪造文件或虚假投资。而 “shark” 在比喻义中更强调利用他人弱点进行剥削，常带有‘技艺高超’和‘毫不留情’的意味，语义更丰富，也更具形象性。"
    },
    {
      "word_to_compare": "fin",
      "analysis": "“Fin”（鳍）是鲨鱼身体的一部分，常被误用为鲨鱼的代称（如电影《大白鲨》中称其为“the fin”），但“fin”本身仅指物理结构，不具备生物或人格含义。而 “shark” 是完整生物体的名称，承载生态、文化与隐喻三重意义。"
    }
  ]
}