{
  "word": "sharing",
  "pronunciation": "shair·ing",
  "concise_definition": "n. 分享, 共享; v. 分享, 共有",
  "forms": {
    "base_form": "share",
    "third_person_singular": "shares",
    "past_tense": "shared",
    "past_participle": "shared",
    "present_participle": "sharing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of dividing or using something jointly with others, often involving resources, experiences, or information to foster cooperation or mutual benefit.",
      "explanation_cn": "指与他人共同使用或分配某物的行为，通常涉及资源、经验或信息的交流，以促进合作或互利。",
      "example_en": "The success of the project relied on the sharing of ideas among team members.",
      "example_cn": "这个项目的成功依赖于团队成员之间的想法共享。"
    },
    {
      "pos": "noun",
      "explanation_en": "A social or economic model in which goods, services, or assets are made available to multiple users, often facilitated by digital platforms.",
      "explanation_cn": "指一种社会或经济模式，其中商品、服务或资产通过数字平台提供给多个用户共同使用。",
      "example_en": "The rise of car-sharing services has reduced the need for personal vehicle ownership in urban areas.",
      "example_cn": "汽车共享服务的兴起减少了城市地区对个人拥车的需求。"
    },
    {
      "pos": "verb",
      "explanation_en": "To allow others to use, enjoy, or benefit from something that belongs to you, whether tangible (e.g., food, space) or intangible (e.g., emotions, knowledge).",
      "explanation_cn": "指允许他人使用、享受或受益于你所拥有的事物，无论是有形的（如食物、空间）还是无形的（如情感、知识）。",
      "example_en": "She shared her lunch with the new student who forgot his.",
      "example_cn": "她把自己的午餐分给了那个忘记带饭的新同学。"
    },
    {
      "pos": "verb",
      "explanation_en": "To post or distribute personal content, experiences, or information publicly, especially on social media platforms.",
      "explanation_cn": "指在社交媒体平台上发布或传播个人内容、经历或信息。",
      "example_en": "He shared a photo of his vacation on Instagram and got hundreds of likes.",
      "example_cn": "他在 Instagram 上分享了一张度假照片，获得了数百个赞。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "giving",
      "analysis": "“Giving” (给予) 强调单向的赠与或奉献，通常意味着原拥有者失去对物品或资源的控制权。而 “sharing” 是双向或多方参与的过程，原拥有者通常仍保留部分使用权。例如，你把书送给朋友是 giving，而你和朋友轮流读同一本书是 sharing。"
    },
    {
      "word_to_compare": "cooperating",
      "analysis": "“Cooperating” (合作) 指为实现共同目标而协同行动，强调行为的协调性，但不一定涉及资源或信息的交换。而 “sharing” 是合作中常见的手段，但本身不必然包含目标导向的协作。例如，两个人可以合作完成任务而不分享任何信息，但若要分享信息，则必然涉及 sharing。"
    },
    {
      "word_to_compare": "distributing",
      "analysis": "“Distributing” (分发) 通常指将物品或信息从一个中心源分配给多个接收者，过程往往是单向、系统化或官方的（如分发传单、疫苗）。而 “sharing” 更强调自愿性、平等性和人际互动，常带有情感或社交意义。"
    }
  ]
}