{
  "word": "shattered",
  "pronunciation": "shæt·ərd",
  "concise_definition": "adj. 粉碎的, 破碎的; v. (shatter 的过去式和过去分词) 粉碎, 破坏, 摧毁",
  "forms": {
    "base_form": "shatter",
    "past_tense": "shattered",
    "past_participle": "shattered",
    "present_participle": "shattering",
    "third_person_singular": "shatters"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "In a state of being broken into many small pieces, often suddenly and violently; describing physical fragmentation or emotional collapse.",
      "explanation_cn": "处于突然且剧烈地碎裂成许多小片的状态；可形容物体的物理破碎，也可比喻情感的彻底崩溃。",
      "example_en": "The vase lay in shattered pieces on the floor after it fell.",
      "example_cn": "花瓶掉在地上后，碎成了一地碎片。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used metaphorically to describe a complete breakdown of something abstract, such as hopes, beliefs, or systems.",
      "explanation_cn": "用于比喻性地描述抽象事物（如希望、信念或体系）的彻底瓦解。",
      "example_en": "His confidence was shattered after years of repeated failures.",
      "example_cn": "经过多年的接连失败，他的信心彻底崩溃了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To break something violently into many small pieces, often with a sudden impact or force.",
      "explanation_cn": "通过突然的冲击或强力将某物猛烈地击碎成许多小片。",
      "example_en": "The hailstorm shattered dozens of car windows.",
      "example_cn": "冰雹风暴击碎了数十辆汽车的车窗。"
    },
    {
      "pos": "verb",
      "explanation_en": "To destroy or ruin something completely, especially an abstract concept like trust, peace, or morale.",
      "explanation_cn": "彻底摧毁或毁坏某物，尤指信任、和平或士气等抽象概念。",
      "example_en": "The scandal shattered the politician's reputation overnight.",
      "example_cn": "这起丑闻一夜之间摧毁了这位政客的声誉。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "broken",
      "analysis": "“Broken” (破碎的) 是一个更通用、更中性的词，可指任何形式的损坏或断裂，不一定意味着完全碎裂。它可以用于物理损坏（如断掉的椅子腿）或抽象状态（如broken heart）。而 “shattered” 强调的是剧烈、彻底、碎片化的破坏，情感或物理上的破坏程度更深、更剧烈。"
    },
    {
      "word_to_compare": "cracked",
      "analysis": "“Cracked” (裂开的) 指物体表面出现裂缝，但尚未完全破碎，仍保持基本结构。它表示破坏的初期阶段，而 “shattered” 则是破坏的最终阶段，意味着完整性完全丧失。例如：a cracked cup（有裂纹的杯子）vs. a shattered cup（碎成渣的杯子）。"
    },
    {
      "word_to_compare": "destroyed",
      "analysis": "“Destroyed” (摧毁的) 是一个更广泛的词，可指任何形式的彻底毁灭，包括焚烧、拆除、抹除等，不一定涉及碎片化。而 “shattered” 特指因冲击或压力导致的碎裂式毁灭，常带有视觉上的碎片意象和强烈的情感色彩。"
    }
  ]
}