{
  "word": "shattering",
  "pronunciation": "shæt·er·iŋ",
  "concise_definition": "adj. 震撼的, 破碎的, 令人崩溃的",
  "forms": {
    "base_form": "shatter",
    "past_tense": "shattered",
    "past_participle": "shattered",
    "present_participle": "shattering",
    "noun_form": "shattering"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Causing a sudden and overwhelming emotional or psychological impact, often leading to deep distress, disbelief, or a sense of collapse.",
      "explanation_cn": "造成突然而强烈的感情或心理冲击，通常导致极度痛苦、难以置信或精神崩溃的感觉。",
      "example_en": "The news of her sudden death was a shattering blow to the family.",
      "example_cn": "她突然去世的消息对家人来说是一个毁灭性的打击。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that breaks into many pieces with great force, often used metaphorically to refer to the destruction of illusions, beliefs, or structures.",
      "explanation_cn": "形容某物因巨大外力而碎裂成许多碎片，常用于隐喻性地描述幻觉、信念或结构的彻底崩塌。",
      "example_en": "The shattering of the glass window echoed through the empty hall.",
      "example_cn": "玻璃窗碎裂的声音在空荡的大厅中回荡。"
    },
    {
      "pos": "adjective",
      "explanation_en": "So intense or extreme that it overwhelms the senses or the mind, often used to describe sound, light, or emotional experiences.",
      "explanation_cn": "如此强烈或极端，以至于压倒感官或心智，常用于形容声音、光线或情感体验。",
      "example_en": "The shattering silence after the explosion was more terrifying than the noise itself.",
      "example_cn": "爆炸之后那令人窒息的寂静，比爆炸声本身更令人恐惧。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "devastating",
      "analysis": "“Devastating” (毁灭性的) 强调造成广泛破坏或严重后果，常用于描述物质损失或长期影响，如战争、灾害。“Shattering” 更侧重于瞬间的心理或情感冲击，带有更强的主观性和情绪张力，常用于个人层面的创伤。"
    },
    {
      "word_to_compare": "crushing",
      "analysis": "“Crushing” (压垮的) 通常指沉重的压力导致精神或情绪上的失败，如“crushing defeat”（惨败），强调重量感和无力感。“Shattering” 则更强调彻底的破碎和不可逆转的断裂，常用于信念、希望或结构的瓦解，更具爆发性和戏剧性。"
    },
    {
      "word_to_compare": "earth-shattering",
      "analysis": "“Earth-shattering” (惊天动地的) 是“shattering”的夸张强化形式，常用于形容重大事件（如科学发现或政治变革），带有夸张和修辞色彩。“Shattering” 更通用，可应用于日常情感体验，而 “earth-shattering” 通常保留给具有历史或全局意义的事件。"
    }
  ]
}