{
  "word": "shatter",
  "pronunciation": "shat·er",
  "concise_definition": "v. 粉碎, 破碎, 破坏; n. 碎片",
  "forms": {
    "third_person_singular": "shatters",
    "past_tense": "shattered",
    "past_participle": "shattered",
    "present_participle": "shattering"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To break suddenly and violently into many small pieces, often with a loud noise, typically referring to hard, brittle materials like glass or ceramic.",
      "explanation_cn": "指坚硬、易碎的材料（如玻璃或陶瓷）突然猛烈地碎裂成许多小片，常伴有响声。",
      "example_en": "The window shattered when the ball hit it with full force.",
      "example_cn": "球以全力击中窗户时，玻璃瞬间碎裂。"
    },
    {
      "pos": "verb",
      "explanation_en": "To destroy or disrupt something completely, especially an abstract concept such as hopes, illusions, or peace.",
      "explanation_cn": "指彻底摧毁或破坏某事物，尤指抽象概念，如希望、幻想或和平。",
      "example_en": "The scandal shattered his reputation overnight.",
      "example_cn": "这场丑闻一夜之间摧毁了他的声誉。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a sudden and intense disruption in a system, relationship, or emotional state, often leading to irreversible damage.",
      "explanation_cn": "指对系统、关系或情绪状态造成突然而剧烈的破坏，常导致不可逆的损害。",
      "example_en": "The news of her death shattered the family’s sense of security.",
      "example_cn": "她去世的消息粉碎了全家的安全感。"
    },
    {
      "pos": "noun",
      "explanation_en": "A fragment or piece resulting from something that has been shattered; often used in plural form.",
      "explanation_cn": "指被击碎后留下的碎片，通常以复数形式出现。",
      "example_en": "She carefully swept up the shatters from the broken vase.",
      "example_cn": "她小心地扫起了碎花瓶的碎片。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "break",
      "analysis": "“Break” (打破) 是一个更通用的词，指任何形式的断裂或损坏，可以是轻微的（如折断铅笔）或严重的，但不一定伴随碎片飞溅。而 “shatter” 强调剧烈、彻底的碎裂，通常产生大量碎片，语气更强烈、更具破坏性。"
    },
    {
      "word_to_compare": "crack",
      "analysis": "“Crack” (裂开) 指物体表面出现裂缝，但未完全破碎，结构仍部分保持完整。它表示破坏的初期阶段，而 “shatter” 是破坏的最终结果，意味着完全解体。"
    },
    {
      "word_to_compare": "destroy",
      "analysis": "“Destroy” (毁灭) 是一个更广泛的词，可指物理、情感或抽象层面的彻底消灭，但不强调“碎裂”的物理形式。而 “shatter” 更具体地描绘了因冲击而碎裂的视觉和听觉效果，常用于具象物体或比喻性的情感崩溃。"
    }
  ]
}