{
  "word": "shed",
  "pronunciation": "shed",
  "concise_definition": "v. 脱落, 泄露, 脱去; n. 小屋, 棚屋",
  "forms": {
    "third_person_singular": "sheds",
    "past_tense": "shed",
    "past_participle": "shed",
    "present_participle": "shedding"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To lose or get rid of something naturally or forcibly, such as hair, skin, leaves, or tears, often as part of a biological or seasonal process.",
      "explanation_cn": "指自然或被迫地脱落或摆脱某物，如毛发、皮肤、树叶或眼泪，通常作为生物或季节性过程的一部分。",
      "example_en": "Dogs shed their fur in the spring to make way for a lighter coat.",
      "example_cn": "狗在春天脱毛，以便长出更轻薄的被毛。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cast off or discard something unwanted, often metaphorically, such as a habit, role, or emotion.",
      "explanation_cn": "指主动摆脱或抛弃某物，常用于比喻意义，如习惯、角色或情绪。",
      "example_en": "She shed her old fears and embraced a new life abroad.",
      "example_cn": "她摆脱了旧有的恐惧，拥抱了海外的新生活。"
    },
    {
      "pos": "verb",
      "explanation_en": "To allow a liquid to flow out in drops or a small stream, often unintentionally or due to leakage.",
      "explanation_cn": "指液体以滴或小股形式流出，通常是无意的或因泄漏所致。",
      "example_en": "The roof sheds water during heavy rain, but the gutters are clogged.",
      "example_cn": "屋顶在大雨时会排水，但排水沟被堵住了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, simple structure, typically made of wood or metal, used for storage or as a workshop, often found in gardens or backyards.",
      "explanation_cn": "指一种小型、简单的结构，通常由木材或金属制成，用于储物或作为工作间，常见于花园或后院。",
      "example_en": "He keeps his tools in a wooden shed behind the house.",
      "example_cn": "他把工具放在房子后面的一个木制小屋里。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "lose",
      "analysis": "“Lose” (失去) 是一个更通用的词，指不再拥有某物，可能是意外、被动或永久性的，如失去钥匙、时间或信心。而 “shed” 更强调自然、渐进或生理性的脱落，常用于毛发、皮肤、液体等具体物质，带有更形象的动态感。"
    },
    {
      "word_to_compare": "discard",
      "analysis": "“Discard” (丢弃) 强调有意识地扔掉不再需要的东西，通常是主动的、有目的的行为，如丢弃垃圾或旧衣服。而 “shed” 可以是无意识的生理过程（如动物脱毛），也可以是隐喻性的自然摆脱，不必然包含主观意愿。"
    },
    {
      "word_to_compare": "hut",
      "analysis": "“Hut” (小屋) 与 “shed” 都指小型简易建筑，但 “hut” 通常更原始、更简陋，常用于描述非西方或乡村地区的临时住所，如非洲或丛林中的茅屋；而 “shed” 更常用于现代语境，功能明确（储物、工具存放），结构更标准化。"
    }
  ]
}