{
  "word": "sheer",
  "pronunciation": "sheer",
  "concise_definition": "adj. 纯粹的, 完全的, 透明的, 陡峭的",
  "forms": {
    "comparative": "sheerer",
    "superlative": "sheerest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Complete and absolute, with no mixture or qualification; emphasizing total extent or intensity.",
      "explanation_cn": "完全的、绝对的，没有任何混合或修饰；强调程度或范围的彻底性。",
      "example_en": "It was sheer nonsense to believe he could win the election.",
      "example_cn": "相信他能赢得选举简直是纯粹的胡说八道。"
    },
    {
      "pos": "adjective",
      "explanation_en": "So thin or transparent that light can pass through it easily; often used to describe fabrics or materials.",
      "explanation_cn": "极其薄或透明，光线可以轻易穿透；常用于描述织物或材料。",
      "example_en": "She wore a sheer silk blouse that revealed the outline of her dress underneath.",
      "example_cn": "她穿着一件透明的丝绸衬衫，隐约显露出里面裙子的轮廓。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Steep and almost vertical, especially in reference to a cliff, slope, or drop.",
      "explanation_cn": "陡峭的，几乎垂直的，尤其用于描述悬崖、斜坡或落差。",
      "example_en": "The hikers were cautious as they approached the sheer cliff face.",
      "example_cn": "徒步者在接近陡峭的悬崖时十分谨慎。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used to emphasize the unexpected or overwhelming nature of something, often in combination with a noun (e.g., sheer luck, sheer force).",
      "explanation_cn": "用于强调某事物的意外性或压倒性，常与名词连用（如 sheer luck, sheer force）。",
      "example_en": "They survived the crash by sheer luck.",
      "example_cn": "他们纯粹是靠运气才从车祸中幸存下来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pure",
      "analysis": "“Pure” (纯粹的) 强调没有杂质或掺杂，常用于物质、成分或道德层面，如 pure water 或 pure intention。而 “sheer” 更强调程度上的绝对性或极端性，常用于抽象概念，如 sheer madness，带有更强的修辞色彩和情感强度。"
    },
    {
      "word_to_compare": "transparent",
      "analysis": "“Transparent” (透明的) 是一个通用词，指任何可透过光线的材料或比喻意义上的坦诚。而 “sheer” 作为透明义时，特指薄到几乎看不见的程度，常用于纺织品，带有物理上的脆弱感和视觉上的轻盈感，如 sheer curtains。"
    },
    {
      "word_to_compare": "steep",
      "analysis": "“Steep” (陡峭的) 是描述坡度的常用词，适用于道路、山体等，语义中性。而 “sheer” 描述的陡峭程度更极端，近乎垂直，常带有危险或令人敬畏的意味，如 sheer drop，强调视觉冲击力和物理上的不可逾越性。"
    }
  ]
}