{
  "word": "shelter",
  "pronunciation": "shel·ter",
  "concise_definition": "n. 庇护所, 遮蔽处, 保护; v. 庇护, 保护",
  "forms": {
    "plural": "shelters",
    "third_person_singular": "shelters",
    "past_tense": "sheltered",
    "past_participle": "sheltered",
    "present_participle": "sheltering"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A structure or place that provides protection from danger, harsh weather, or other harmful conditions, such as a building, cave, or temporary refuge.",
      "explanation_cn": "指为躲避危险、恶劣天气或其他有害环境而提供的建筑物、洞穴或临时避难所。",
      "example_en": "The hikers found shelter under a rocky overhang during the storm.",
      "example_cn": "徒步者在暴风雨中躲到一块岩石突出部下避难。"
    },
    {
      "pos": "noun",
      "explanation_en": "An organization or facility that provides temporary housing and support for people in need, such as the homeless, victims of abuse, or displaced animals.",
      "explanation_cn": "指为需要帮助的人群（如无家可归者、受虐者或流离失所的动物）提供临时住所和支持的机构或设施。",
      "example_en": "The city opened a new shelter for homeless veterans last month.",
      "example_cn": "上个月，这座城市为无家可归的退伍军人开设了一处新收容所。"
    },
    {
      "pos": "verb",
      "explanation_en": "To protect someone or something from harm, danger, or adverse conditions by providing a safe place or covering.",
      "explanation_cn": "通过提供安全场所或遮蔽物来保护某人或某物免受伤害、危险或不利条件的影响。",
      "example_en": "The trees sheltered the small garden from the strong winds.",
      "example_cn": "树木为小花园挡住了强风。"
    },
    {
      "pos": "verb",
      "explanation_en": "To conceal or hide someone, often to protect them from legal consequences or persecution.",
      "explanation_cn": "指隐藏某人，通常是为使其免受法律追究或迫害。",
      "example_en": "The family sheltered the fugitive until the police search ended.",
      "example_cn": "这家人庇护了这名逃犯，直到警方搜查结束。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "refuge",
      "analysis": "“Refuge”（避难所）更强调逃离危险或压迫后的安全状态，常用于政治、战争或灾难语境，带有强烈的紧迫感和情感色彩。而 “shelter” 更通用，可指物理遮蔽，也可用于抽象保护，语义范围更广。"
    },
    {
      "word_to_compare": "haven",
      "analysis": "“Haven”（避风港）带有诗意和情感色彩，常指心灵或精神上的安全之地，如‘a haven of peace’。它更侧重于安宁与慰藉，而 ‘shelter’ 更强调物理或实际的保护功能。"
    },
    {
      "word_to_compare": "protect",
      "analysis": "“Protect”（保护）是更广泛的动词，泛指采取任何措施防止伤害，不一定要提供物理空间。而 “shelter” 作为动词时，特指通过提供遮蔽或藏身处来实现保护，动作更具空间性和具体性。"
    }
  ]
}