{
  "word": "shell",
  "pronunciation": "shel",
  "concise_definition": "n. 贝壳, 外壳, 壳体; v. 剥壳, 轰炸, 除壳",
  "forms": {
    "plural": "shells",
    "third_person_singular": "shells",
    "past_tense": "shelled",
    "past_participle": "shelled",
    "present_participle": "shelling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The hard, outer covering of an animal, such as a mollusk, turtle, or egg, that protects its soft internal parts.",
      "explanation_cn": "指软体动物、龟类或蛋类等生物坚硬的外部覆盖物，用于保护其柔软的内部组织。",
      "example_en": "The crab crawled out of its shell and scuttled across the sand.",
      "example_cn": "螃蟹从它的壳里爬出来，在沙滩上快速爬行。"
    },
    {
      "pos": "noun",
      "explanation_en": "The outer casing or framework of a building, vehicle, or device, often without internal components or details.",
      "explanation_cn": "指建筑物、车辆或设备的外部结构或外壳，通常不包含内部组件或细节。",
      "example_en": "The firefighters saved the shell of the historic building but could not preserve the interior.",
      "example_cn": "消防员救下了这座历史建筑的外壳，但未能保留其内部结构。"
    },
    {
      "pos": "noun",
      "explanation_en": "A projectile fired from a gun or artillery piece, typically containing explosives or other destructive material.",
      "explanation_cn": "指从枪械或火炮发射的弹药，通常装有炸药或其他破坏性物质。",
      "example_en": "The soldiers took cover as shells exploded around them.",
      "example_cn": "炮弹在他们周围爆炸，士兵们纷纷隐蔽。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove the shell or outer covering from something, especially food such as nuts or shrimp.",
      "explanation_cn": "指去除某物的外壳或外皮，尤指坚果、虾类等食物。",
      "example_en": "She shelled the peas while chatting with her grandmother.",
      "example_cn": "她一边和祖母聊天，一边剥豌豆。"
    },
    {
      "pos": "verb",
      "explanation_en": "To bombard a place with shells or explosives, often in a military context.",
      "explanation_cn": "指在军事背景下用炮弹或爆炸物猛烈轰击某地。",
      "example_en": "The town was shelled for three days during the conflict.",
      "example_cn": "在冲突期间，这个城镇被炮击了三天。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "husk",
      "analysis": "“Husk”（外壳/果壳）特指植物种子或果实的干燥、纤维质外皮，如玉米苞叶或椰子外层，通常可食用或可生物降解。而 “shell” 更广泛，可指坚硬的、非植物性的保护层，如贝壳、蛋壳或弹壳，结构更致密且常不可食用。"
    },
    {
      "word_to_compare": "case",
      "analysis": "“Case”（外壳/箱体）泛指任何用于容纳或保护内部物体的容器，如手机壳、保险箱外壳，强调功能性封装，不一定是坚硬或自然形成的。而 “shell” 更强调天然或结构上的保护性外层，常带有脆弱、易碎或生物起源的含义。"
    },
    {
      "word_to_compare": "crust",
      "analysis": "“Crust”（外壳/表层）通常指由表面凝固、硬化或沉积形成的薄层，如面包皮、地壳或熔岩冷却后的表层，多为自然形成且质地较脆。而 “shell” 更强调完整包裹、具有腔体结构的坚硬外层，如蛋壳或贝壳，常可脱离内部主体。"
    }
  ]
}