{
  "word": "shepherd",
  "pronunciation": "shep·uhrd",
  "concise_definition": "n. 牧羊人, 引导者; v. 引导, 照料, 看护",
  "forms": {
    "third_person_singular": "shepherds",
    "past_tense": "shepherded",
    "past_participle": "shepherded",
    "present_participle": "shepherding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who tends, herds, feeds, and guards flocks of sheep, often working in rural or pastoral settings.",
      "explanation_cn": "指照料、放牧、喂养和守护羊群的人，通常在乡村或牧区工作。",
      "example_en": "The shepherd led his flock to the mountain pasture at dawn.",
      "example_cn": "牧羊人在黎明时带领羊群前往山地牧场。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who guides, protects, or oversees a group, process, or project with care and responsibility, often metaphorically.",
      "explanation_cn": "指以关怀和责任感引导、保护或监督某一群体、过程或项目的人，常为比喻用法。",
      "example_en": "As a senator, she shepherded the new healthcare bill through Congress.",
      "example_cn": "作为参议员，她推动了这项新的医疗法案在国会通过。"
    },
    {
      "pos": "verb",
      "explanation_en": "To guide or escort someone or something carefully and attentively, often through a difficult or complex situation.",
      "explanation_cn": "指小心而专注地引导或护送某人或某物，通常是在困难或复杂的情况下。",
      "example_en": "The tour guide shepherded the group safely through the crowded streets.",
      "example_cn": "导游小心地带领团队安全穿过了拥挤的街道。"
    },
    {
      "pos": "verb",
      "explanation_en": "To oversee and manage the development or progress of something, especially a policy, law, or project, to ensure its successful completion.",
      "explanation_cn": "指监督并管理某事物（尤其是政策、法律或项目）的发展或进展，以确保其顺利完成。",
      "example_en": "The minister shepherded the environmental reforms through the legislative process.",
      "example_cn": "部长推动了环境改革在立法程序中的通过。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "herd",
      "analysis": "“Herd” (驱赶/放牧) 强调对动物群体的集体驱赶或管理，动作更偏向于控制和移动，缺乏情感关怀的内涵。而 “shepherd” 不仅包含管理，更强调保护、引导和责任感，常用于比喻语境中，带有更积极、人文的色彩。"
    },
    {
      "word_to_compare": "guide",
      "analysis": "“Guide” (引导) 是一个通用词，泛指带领他人前往某地或提供方向，不隐含保护或长期责任。而 “shepherd” 暗示更深层次的持续关怀、守护和义务，尤其在政治或组织语境中，常指全程负责某项事务的推进。"
    },
    {
      "word_to_compare": "caretaker",
      "analysis": "“Caretaker” (看护者) 侧重于对人、物或场所的日常维护和看管，通常不涉及引导或推动发展。而 “shepherd” 不仅看护，还主动引导方向、促进成长，具有更强的主动性与领导性，常用于抽象对象（如法案、项目）的管理。"
    }
  ]
}