{
  "word": "shipwreck",
  "pronunciation": "ship·wrek",
  "concise_definition": "n. 船难, 沉船; v. 使沉没, 毁坏",
  "forms": {
    "third_person_singular": "shipwrecks",
    "past_tense": "shipwrecked",
    "past_participle": "shipwrecked",
    "present_participle": "shipwrecking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The destruction of a ship due to accident, storm, or collision, often resulting in its sinking and loss of cargo or lives.",
      "explanation_cn": "指船只因事故、风暴或碰撞而遭受毁灭，通常导致沉没以及货物或人员的损失。",
      "example_en": "The crew survived the shipwreck after clinging to debris for three days.",
      "example_cn": "船员在抓住残骸漂浮了三天后幸存下来。"
    },
    {
      "pos": "noun",
      "explanation_en": "The remains of a sunken ship, often found on the ocean floor and studied by archaeologists.",
      "explanation_cn": "指沉没船只的残骸，常位于海底，由考古学家进行研究。",
      "example_en": "Divers explored the ancient shipwreck off the coast of Greece.",
      "example_cn": "潜水员探索了希腊海岸外的古代沉船。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a ship to be destroyed or sunk, typically through accident or natural disaster.",
      "explanation_cn": "指因事故或自然灾害导致船只被毁或沉没。",
      "example_en": "The storm shipwrecked three fishing vessels near the reef.",
      "example_cn": "风暴在礁石附近使三艘渔船沉没。"
    },
    {
      "pos": "verb",
      "explanation_en": "To ruin or destroy something completely, especially a plan, relationship, or endeavor, often metaphorically.",
      "explanation_cn": "比喻性地指彻底毁坏某事物，尤其是计划、关系或事业。",
      "example_en": "His reckless spending shipwrecked his financial future.",
      "example_cn": "他挥霍无度，毁掉了自己的财务未来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "crash",
      "analysis": "“Crash” (碰撞/坠毁) 通常指高速撞击导致的突然破坏，多用于车辆、飞机或系统故障，强调冲击力和瞬间性。而 “shipwreck” 专指船只因海难而沉没，具有特定的海洋语境和更持久的后果，如残骸留存。"
    },
    {
      "word_to_compare": "sinking",
      "analysis": "“Sinking” (下沉) 是一个中性描述，仅指物体因进水或失衡而逐渐沉入水下，不必然导致毁灭。而 “shipwreck” 不仅包含下沉，更强调灾难性后果，如人员伤亡、货物全损或结构彻底解体。"
    },
    {
      "word_to_compare": "disaster",
      "analysis": "“Disaster” (灾难) 是一个泛指重大破坏性事件的词，可涵盖地震、火灾、战争等。而 “shipwreck” 是一种具体的灾难类型，专指与船舶相关的毁灭事件，语义范围更窄、更具体。"
    }
  ]
}