{
  "word": "shock",
  "pronunciation": "shahk",
  "concise_definition": "n. 震惊, 休克, 电击; v. 使震惊, 使休克",
  "forms": {
    "third_person_singular": "shocks",
    "past_tense": "shocked",
    "past_participle": "shocked",
    "present_participle": "shocking",
    "plural": "shocks"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sudden and intense feeling of surprise, disbelief, or distress caused by an unexpected event or piece of news.",
      "explanation_cn": "由意外事件或消息引起的突然而强烈的惊讶、难以置信或痛苦情绪。",
      "example_en": "The news of his resignation came as a shock to everyone in the company.",
      "example_cn": "他辞职的消息让公司里的每个人都感到震惊。"
    },
    {
      "pos": "noun",
      "explanation_en": "A physical condition caused by a severe injury, trauma, or sudden disturbance to the body, often leading to a drop in blood pressure and organ dysfunction.",
      "explanation_cn": "由严重伤害、创伤或身体突然受到干扰所引起的生理状态，常导致血压下降和器官功能障碍。",
      "example_en": "The victim was rushed to the hospital in shock after the car accident.",
      "example_cn": "车祸后，伤者被紧急送往医院，处于休克状态。"
    },
    {
      "pos": "noun",
      "explanation_en": "An electric discharge that passes through the body, often causing pain or injury.",
      "explanation_cn": "通过人体的电流放电，通常会引起疼痛或伤害。",
      "example_en": "He received a nasty shock when he touched the faulty wire.",
      "example_cn": "他碰到那根故障电线时被电了一下，疼得厉害。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause someone to feel sudden and intense surprise, distress, or disbelief.",
      "explanation_cn": "使某人感到突然而强烈的惊讶、痛苦或难以置信。",
      "example_en": "The violent scenes in the movie shocked many viewers.",
      "example_cn": "这部电影中的暴力场景让许多观众感到震惊。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a sudden and severe physical disturbance in the body, especially by electric current or trauma.",
      "explanation_cn": "通过电流或创伤对身体造成突然而严重的生理干扰。",
      "example_en": "The faulty appliance shocked the technician while he was repairing it.",
      "example_cn": "维修时，这台故障电器使技术员遭到了电击。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "surprise",
      "analysis": "“Surprise”（惊讶）指对意外事件的一般性反应，情绪强度较轻，可以是中性或积极的（如惊喜派对）。而 “shock” 强调极端的、负面的、往往具有破坏性的情绪或生理反应，通常伴随心理或身体上的创伤感。"
    },
    {
      "word_to_compare": "trauma",
      "analysis": "“Trauma”（创伤）是一个更广泛的心理学和医学术语，指长期或严重的心理/生理伤害，可能由一次或多次事件引发。而 “shock” 通常是创伤的即时反应，是短期的、急性的状态。创伤可能包含休克，但休克不等于创伤。"
    },
    {
      "word_to_compare": "stun",
      "analysis": "“Stun”（使目瞪口呆）强调因突然的冲击或打击而暂时失去反应能力，常用于物理性撞击或强烈声音，情绪色彩较弱。而 “shock” 不仅可指生理反应，更常用于心理层面的剧烈震动，且带有道德、情感或社会层面的冲击含义。"
    }
  ]
}