{
  "word": "shooter",
  "pronunciation": "shoo·tər",
  "concise_definition": "n. 射手, 射击者, 枪手, 摄影师",
  "forms": {
    "plural": "shooters"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who fires a gun, especially in a military, sporting, or criminal context; often implies skill or habitual involvement in shooting.",
      "explanation_cn": "指使用枪支射击的人，尤其在军事、体育或犯罪语境中；常暗示其具备射击技能或长期从事射击活动。",
      "example_en": "The sniper was a highly trained shooter with years of experience in combat.",
      "example_cn": "这名狙击手是一名经过严格训练、拥有多年实战经验的射手。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who plays a sport involving shooting, such as basketball or pool, especially one known for scoring frequently or accurately.",
      "explanation_cn": "指从事涉及射击的运动（如篮球或台球）的人，尤指那些经常或精准得分的球员。",
      "example_en": "He's the team's best shooter—his three-pointers win games.",
      "example_cn": "他是球队最出色的射手，他的三分球常常决定比赛胜负。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who takes photographs, especially in a professional or artistic context; sometimes used informally to refer to a photographer.",
      "explanation_cn": "指拍摄照片的人，尤其在专业或艺术语境中；有时非正式地用作‘摄影师’的同义词。",
      "example_en": "The shooter captured the moment perfectly as the sun set behind the mountains.",
      "example_cn": "摄影师完美地捕捉到了夕阳落在山后的那一瞬间。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of alcoholic drink, typically a small shot of liquor, sometimes mixed with other ingredients (e.g., a 'boilermaker' or 'screaming orgasm').",
      "explanation_cn": "指一种酒精饮料，通常是少量烈酒，有时混合其他成分（如‘啤酒烈酒’或‘尖叫高潮’）。",
      "example_en": "They ordered a round of shooters to celebrate the team's victory.",
      "example_cn": "他们点了一轮鸡尾酒小杯，庆祝球队获胜。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "marksman",
      "analysis": "“Marksman”（神枪手）强调极高的射击精准度和专业性，通常用于军事或竞技语境，带有褒义色彩，侧重技术能力。而 “shooter” 更通用，可指任何射击者，包括业余者或罪犯，语义范围更广，中性或贬义色彩更强。"
    },
    {
      "word_to_compare": "photographer",
      "analysis": "“Photographer”（摄影师）是正式术语，专指以摄影为职业或艺术表达的人，强调创作性与专业性。而 “shooter” 作为摄影师的非正式用法，常用于口语或行业内部（如新闻摄影），语气更随意，有时暗示快速、实用导向的拍摄风格。"
    },
    {
      "word_to_compare": "gunman",
      "analysis": "“Gunman”（持枪者）通常带有负面含义，特指使用枪支实施暴力或犯罪的人，如劫匪或袭击者。而 “shooter” 虽也可用于犯罪语境，但语义更宽泛，可中性或正面使用（如运动员或士兵），情感色彩更灵活。"
    }
  ]
}