{
  "word": "shoots",
  "pronunciation": "shoots",
  "concise_definition": "n. 新芽, 幼枝; v. 射击, 拍摄, 迅速移动",
  "forms": {
    "base_form": "shoot",
    "third_person_singular": "shoots",
    "past_tense": "shot",
    "past_participle": "shot",
    "present_participle": "shooting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A young stem or branch of a plant, especially one that grows rapidly from the root or trunk.",
      "explanation_cn": "植物的新茎或新枝，尤指从根部或主干迅速长出的嫩枝。",
      "example_en": "The garden was full of fresh shoots after the spring rain.",
      "example_cn": "春雨过后，花园里长满了嫩绿的新芽。"
    },
    {
      "pos": "noun",
      "explanation_en": "A single act of filming or photographing, especially in the context of movie or photo production.",
      "explanation_cn": "在电影或摄影制作中的一次拍摄行为或一段拍摄过程。",
      "example_en": "The director called for another shoot after realizing the lighting was off.",
      "example_cn": "导演发现灯光不对后，下令再拍一次。"
    },
    {
      "pos": "verb",
      "explanation_en": "To discharge a projectile, such as a bullet or arrow, from a weapon with force.",
      "explanation_cn": "从武器中强力发射弹丸，如子弹或箭矢。",
      "example_en": "The hunter shoots deer during the autumn season.",
      "example_cn": "猎人在秋季射杀鹿。"
    },
    {
      "pos": "verb",
      "explanation_en": "To film or photograph something, especially in a professional context.",
      "explanation_cn": "进行拍摄，尤指在专业影视或摄影环境中。",
      "example_en": "They are shooting a new commercial in downtown Los Angeles.",
      "example_cn": "他们正在洛杉矶市中心拍摄一支新广告。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or go somewhere quickly and directly, often in a sudden or forceful manner.",
      "explanation_cn": "迅速而直接地移动，常带有突然或猛烈的意味。",
      "example_en": "The ball shot across the field and into the goal.",
      "example_cn": "球飞速穿过球场，直入球门。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sprout",
      "analysis": "“Sprout” (发芽) 专指植物种子或根部开始长出嫩芽的初始阶段，强调生命萌发的自然过程，通常用于植物学语境。而 “shoot” 作为名词时，指已经长出的嫩枝，形态更明确，可指代更成熟的幼茎，适用范围更广。"
    },
    {
      "word_to_compare": "film",
      "analysis": "“Film” (拍摄) 是一个更正式、更通用的动词，泛指用摄像机记录影像的行为，常用于书面语和专业语境。而 “shoot” 更口语化，常用于影视行业内部，带有动作感和效率感，如 ‘shoot a scene’。"
    },
    {
      "word_to_compare": "fire",
      "analysis": "“Fire” (开火) 与 “shoot” 在射击语境中常可互换，但 “fire” 更强调武器的引爆或释放动作本身，常用于军事或战术语境（如 fire a cannon）；而 “shoot” 更通用，可指任何类型的发射，包括枪、弓、甚至篮球投篮，语义更宽泛。"
    }
  ]
}