{
  "word": "shooting",
  "pronunciation": "shoo·ting",
  "concise_definition": "n. 拍摄, 射击, 投篮; adj. 拍摄的, 射击的",
  "forms": {
    "noun_plural": "shootings",
    "verb_present_participle": "shooting",
    "verb_past_tense": "shot",
    "verb_past_participle": "shot"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of taking photographs or recording video, especially in a professional context such as film or advertising production.",
      "explanation_cn": "指拍摄照片或录制视频的行为，尤指在电影、广告等专业制作环境中的拍摄活动。",
      "example_en": "The shooting of the movie lasted three months in the mountains.",
      "example_cn": "这部电影的拍摄持续了三个月，地点在山区。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of firing a gun or other projectile weapon, often resulting in injury or death.",
      "explanation_cn": "指开枪或发射其他投射武器的行为，常导致伤亡。",
      "example_en": "The school shooting shocked the entire community.",
      "example_cn": "这起校园枪击案震惊了整个社区。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of throwing or launching a ball toward a basket in basketball or similar sports.",
      "explanation_cn": "指在篮球或其他类似运动中向篮筐投掷或发射球的动作。",
      "example_en": "He made a perfect shooting motion just before the buzzer sounded.",
      "example_cn": "在终场哨响前，他完成了一次完美的投篮动作。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to the act of filming or photographing; used to describe locations, schedules, or equipment associated with production.",
      "explanation_cn": "与拍摄行为相关的；用于描述与制作相关的地点、日程或设备。",
      "example_en": "The shooting schedule was tight, with only two days to capture all exterior scenes.",
      "example_cn": "拍摄日程非常紧张，只有两天时间拍摄所有外景。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "filming",
      "analysis": "“Filming”（拍摄）特指用摄像机录制视频，常用于电影或电视制作语境，范围较窄。而 “shooting” 是更通用的术语，可涵盖照片拍摄、视频录制甚至体育投篮，语义更广。"
    },
    {
      "word_to_compare": "firing",
      "analysis": "“Firing”（开火）专指发射武器，强调动作本身，常用于军事或执法语境。而 “shooting” 除了指开枪，还可用于体育或摄影，语义更丰富，且在日常语言中更常用于指暴力事件。"
    },
    {
      "word_to_compare": "throwing",
      "analysis": "“Throwing”（投掷）泛指用手臂将物体抛出，适用于任何物体和场景（如投球、扔石头）。而 “shooting” 在篮球语境中特指有技术性、目标导向的投篮动作，强调准确性与规范性，不用于非体育场景。"
    }
  ]
}