{
  "word": "shot",
  "pronunciation": "shot",
  "concise_definition": "n. 射击, 照片, 一剂, 一小杯酒; v. 拍摄, 射击, 投篮",
  "forms": {
    "plural": "shots",
    "third_person_singular": "shots",
    "past_tense": "shot",
    "past_participle": "shot",
    "present_participle": "shooting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of firing a weapon or propelling a projectile, especially a bullet or arrow.",
      "explanation_cn": "指发射武器或投射弹丸（如子弹或箭）的行为。",
      "example_en": "The hunter took a careful shot at the deer.",
      "example_cn": "猎人小心地向鹿开了一枪。"
    },
    {
      "pos": "noun",
      "explanation_en": "A single photograph or a sequence of images captured by a camera, especially in film or television production.",
      "explanation_cn": "指由相机拍摄的一张照片，或在电影或电视制作中的一组镜头画面。",
      "example_en": "The director asked for another shot of the sunset to get the lighting right.",
      "example_cn": "导演要求再拍一遍日落镜头，以获得正确的光线效果。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small amount of a liquid, especially an alcoholic drink, served in a single portion.",
      "explanation_cn": "指少量液体，尤指以单份形式提供的酒精饮料。",
      "example_en": "He ordered a shot of whiskey to warm up after the cold walk.",
      "example_cn": "在寒冷的步行后，他点了一小杯威士忌暖身。"
    },
    {
      "pos": "noun",
      "explanation_en": "An injection of medicine or vaccine administered into the body, typically with a syringe.",
      "explanation_cn": "指通过注射器注入体内的药物或疫苗剂量。",
      "example_en": "Children need a flu shot every year to stay protected.",
      "example_cn": "儿童每年都需要接种流感疫苗以保持防护。"
    },
    {
      "pos": "verb",
      "explanation_en": "To take a photograph or record video, especially in a professional or artistic context.",
      "explanation_cn": "指在专业或艺术背景下拍摄照片或录制视频。",
      "example_en": "The photographer shot the entire wedding in natural light.",
      "example_cn": "摄影师用自然光拍摄了整个婚礼。"
    },
    {
      "pos": "verb",
      "explanation_en": "To throw or propel something, especially a ball, with force toward a target, as in sports.",
      "explanation_cn": "指用力将某物（尤指球）投向目标，常见于体育运动中。",
      "example_en": "She shot the basketball toward the hoop with perfect form.",
      "example_cn": "她以完美的姿势将篮球投向篮筐。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "picture",
      "analysis": "“Picture” (图片) 通常指静态的视觉图像，强调结果；而 “shot” 在摄影语境中更强调拍摄的动作、过程或特定镜头，常用于影视制作中，具有动态和语境含义。例如，一个电影中的 ‘shot’ 可能包含运动、构图和时间维度，而 ‘picture’ 仅指最终画面。"
    },
    {
      "word_to_compare": "bullet",
      "analysis": "“Bullet” (子弹) 是射击所使用的物理弹药，是名词性物体；而 “shot” 指的是发射子弹这一行为或事件本身。例如，你可以说 ‘a bullet hit the wall’（子弹击中了墙），但 ‘a shot rang out’（枪声响起）强调的是射击动作。"
    },
    {
      "word_to_compare": "dose",
      "analysis": "“Dose” (剂量) 是医学中用于描述药物或治疗物数量的通用术语，中性、正式；而 “shot” 是口语化表达，特指通过注射方式给予的剂量，常用于日常对话，如 ‘get a shot’。两者可互换，但 ‘shot’ 更具口语和情感色彩。"
    }
  ]
}