{
  "word": "shouts",
  "pronunciation": "shawts",
  "concise_definition": "n. 喊叫, 呼喊; v. 大声喊叫",
  "forms": {
    "singular": "shout",
    "third_person_singular": "shouts",
    "past_tense": "shouted",
    "past_participle": "shouted",
    "present_participle": "shouting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A loud cry or call, typically expressing strong emotion such as excitement, anger, fear, or urgency.",
      "explanation_cn": "一种大声的呼喊或叫喊，通常表达强烈的情绪，如兴奋、愤怒、恐惧或紧迫感。",
      "example_en": "The crowd erupted into shouts of joy when the team scored the winning goal.",
      "example_cn": "当球队打进制胜一球时，观众席爆发出喜悦的欢呼声。"
    },
    {
      "pos": "noun",
      "explanation_en": "A loud verbal command or warning issued to attract attention or convey urgency.",
      "explanation_cn": "为吸引注意或传达紧迫性而发出的大声命令或警告。",
      "example_en": "He gave a shout to warn the hikers about the falling rocks.",
      "example_cn": "他大喊一声，提醒徒步者注意落石。"
    },
    {
      "pos": "verb",
      "explanation_en": "To speak or cry out in a very loud voice, often to be heard over distance or noise, or to express strong emotion.",
      "explanation_cn": "以非常大的声音说话或喊叫，通常是为了在远距离或嘈杂环境中被听见，或表达强烈情绪。",
      "example_en": "She shouted for help when she realized she was lost.",
      "example_cn": "当她意识到自己迷路时，她大声呼救。"
    },
    {
      "pos": "verb",
      "explanation_en": "To announce or declare something loudly and publicly, often to gain attention or influence others.",
      "explanation_cn": "大声而公开地宣布或声明某事，通常是为了引起注意或影响他人。",
      "example_en": "The protesters shouted their demands for justice through the streets.",
      "example_cn": "抗议者们在街头高声喊出他们对正义的要求。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "yell",
      "analysis": "“Yell”（叫喊）与 “shout” 非常接近，常可互换，但 “yell” 更强调因情绪激动（如恐惧、愤怒）而发出的尖锐、高亢的声音，语气更情绪化；而 “shout” 可用于更广泛的语境，包括命令、提醒或庆祝，语气不一定激烈。"
    },
    {
      "word_to_compare": "scream",
      "analysis": "“Scream”（尖叫）通常指因极度恐惧、痛苦或兴奋而发出的尖锐、高频率的声音，带有生理性的失控感，常伴随身体反应。而 “shout” 是有意识的、可控的发声行为，目的性更强，不一定伴随恐惧或痛苦。"
    },
    {
      "word_to_compare": "call",
      "analysis": "“Call”（呼喊）指用正常或稍提高的声音呼唤某人，通常用于引起注意或请求回应，音量较低、语气较温和。而 “shout” 强调音量极大，常用于远距离或嘈杂环境中，语气更强烈、更具压迫感。"
    }
  ]
}