{
  "word": "shoulder",
  "pronunciation": "shoul·dər",
  "concise_definition": "n. 肩膀, 肩部; v. 承担, 肩负, 用肩推",
  "forms": {
    "plural": "shoulders",
    "third_person_singular": "shoulders",
    "past_tense": "shouldered",
    "past_participle": "shouldered",
    "present_participle": "shouldering"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The part of the human body where the arm connects to the torso, consisting of the shoulder joint and surrounding bones and muscles.",
      "explanation_cn": "人体中手臂与躯干连接的部位，包括肩关节及周围的骨骼和肌肉。",
      "example_en": "She massaged her sore shoulder after lifting heavy boxes all day.",
      "example_cn": "她一整天搬重箱子后，按摩了酸痛的肩膀。"
    },
    {
      "pos": "noun",
      "explanation_en": "The sloping edge or side of a road, path, or structure, often used for emergency stopping or drainage.",
      "explanation_cn": "道路、小径或结构物的斜边或侧面，常用于紧急停车或排水。",
      "example_en": "The car veered off the road and came to a stop on the shoulder.",
      "example_cn": "汽车偏离了道路，停在了路肩上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A narrow strip of land or water extending from a larger body, such as a ridge or a promontory.",
      "explanation_cn": "从较大区域延伸出的狭窄地带或水域，如山脊或海角。",
      "example_en": "The island has a long shoulder of land that juts into the sea.",
      "example_cn": "这个岛屿有一条长长的陆地延伸入海。"
    },
    {
      "pos": "verb",
      "explanation_en": "To bear or take on a responsibility, burden, or obligation, often with effort or reluctance.",
      "explanation_cn": "承担或接受责任、负担或义务，通常带有努力或勉强的意味。",
      "example_en": "The new manager shouldered the blame for the team's failure.",
      "example_cn": "新经理承担了团队失败的责任。"
    },
    {
      "pos": "verb",
      "explanation_en": "To push or move something by using the shoulder as a point of contact or force.",
      "explanation_cn": "用肩膀作为接触点或施力点来推或移动某物。",
      "example_en": "He shouldered his way through the crowded hallway.",
      "example_cn": "他用肩膀挤过拥挤的走廊。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "arm",
      "analysis": "“Arm”（手臂）指从肩膀到手的整个肢体部分，强调运动和操作功能；而 “shoulder” 仅指连接手臂与躯干的关节区域，是身体结构的一部分，不包含前臂和手。两者是部分与整体的关系。"
    },
    {
      "word_to_compare": "carry",
      "analysis": "“Carry”（携带）泛指用手、背或其他方式搬运物体，强调动作的普遍性；而 “shoulder” 作为动词时特指用肩膀承重或推动，具有明确的身体部位指向性，语义更具体、更具身体动作感。"
    },
    {
      "word_to_compare": "bear",
      "analysis": "“Bear”（承担）与 “shoulder” 在表示承担负担时语义接近，但 “bear” 更正式、抽象，常用于责任、痛苦或压力等抽象概念；而 “shoulder” 更具象，带有身体动作的隐喻色彩，常用于口语或文学中，强调主动承受的力度感。"
    }
  ]
}