{
  "word": "show",
  "pronunciation": "shaw",
  "concise_definition": "v. 展示, 表现, 演出; n. 展示, 表演, 节目",
  "forms": {
    "third_person_singular": "shows",
    "past_tense": "showed",
    "past_participle": "shown",
    "present_participle": "showing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To display or make visible something that is not immediately apparent, often to convey information, emotion, or quality.",
      "explanation_cn": "指将原本不明显的事物（如信息、情感或品质）呈现出来，使其可见或可感知。",
      "example_en": "Her smile showed how happy she was.",
      "example_cn": "她的微笑流露出她有多么开心。"
    },
    {
      "pos": "verb",
      "explanation_en": "To perform or present a public entertainment, such as a play, concert, or television program.",
      "explanation_cn": "指公开表演或呈现娱乐内容，如戏剧、音乐会或电视节目。",
      "example_en": "The theater is showing a new musical this weekend.",
      "example_cn": "这家剧院本周末将上演一部新音乐剧。"
    },
    {
      "pos": "verb",
      "explanation_en": "To guide someone to a place or indicate the location of something.",
      "explanation_cn": "指带领某人前往某地，或指出某物的位置。",
      "example_en": "Can you show me where the nearest restroom is?",
      "example_cn": "你能告诉我最近的洗手间在哪里吗？"
    },
    {
      "pos": "noun",
      "explanation_en": "A public performance or entertainment event, especially one presented on stage, television, or radio.",
      "explanation_cn": "指在舞台、电视或广播上呈现的公开表演或娱乐活动。",
      "example_en": "The talent show attracted thousands of viewers.",
      "example_cn": "这场才艺表演吸引了成千上万的观众。"
    },
    {
      "pos": "noun",
      "explanation_en": "An exhibition or display of goods, art, or information, often organized for public viewing.",
      "explanation_cn": "指为公众观赏而组织的商品、艺术作品或信息的展览。",
      "example_en": "The art show featured works from emerging local artists.",
      "example_cn": "这次艺术展展出了多位新兴本地艺术家的作品。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "display",
      "analysis": "“Display” (展示) 更强调有意识地将物品或信息陈列出来以供观看，常用于商业或展览语境，如橱窗陈列。它更中性、更注重形式，而 “show” 更强调传达意义、情感或信息，具有更强的互动性和目的性。"
    },
    {
      "word_to_compare": "demonstrate",
      "analysis": "“Demonstrate” (演示/证明) 侧重于通过操作或实例来清晰地说明一个原理、功能或方法，常用于教学或技术场景。它比 “show” 更具逻辑性和说服力，而 “show” 更广泛，可包含情感或非正式的呈现。"
    },
    {
      "word_to_compare": "perform",
      "analysis": "“Perform” (表演) 专指在观众面前完成一项艺术性或技术性活动，如演奏、跳舞或演戏。它强调技巧和准备，而 “show” 作为动词时范围更广，可包括非艺术性的展示，如“show your ID”；作为名词时，“show” 也常指娱乐节目，而 “performance” 更强调个体或团体的演出行为。"
    }
  ]
}