{
  "word": "showers",
  "pronunciation": "shaw·erz",
  "concise_definition": "n. 阵雨, 淋浴; v. 使下阵雨, 给予大量",
  "forms": {
    "singular": "shower"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A short period of rain that is heavy but brief, often covering a limited area.",
      "explanation_cn": "指短暂而强烈的降雨，通常只覆盖较小区域。",
      "example_en": "We got caught in a sudden shower on our way to the park.",
      "example_cn": "我们在去公园的路上突然遭遇了一场阵雨。"
    },
    {
      "pos": "noun",
      "explanation_en": "A bath in which water is sprayed over the body from overhead nozzles, typically for personal hygiene.",
      "explanation_cn": "指通过头顶喷头喷洒水流来清洁身体的沐浴方式，常用于个人卫生。",
      "example_en": "I take a quick shower every morning before work.",
      "example_cn": "我每天早上上班前都洗个快速淋浴。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large number of things falling or given rapidly and abundantly, often metaphorically.",
      "explanation_cn": "指大量事物迅速而密集地落下或给予，常用于比喻意义。",
      "example_en": "The bride received a shower of gifts from her guests.",
      "example_cn": "新娘收到了宾客们送来的大量礼物。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause rain to fall in short, heavy bursts over an area.",
      "explanation_cn": "指使某地区下起短暂而强烈的阵雨。",
      "example_en": "The clouds began to shower throughout the afternoon.",
      "example_cn": "下午时分，云层开始下起阵雨。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give or bestow something in large quantities, often as a gesture of generosity or celebration.",
      "explanation_cn": "指大量给予或赠予某物，常作为慷慨或庆祝的表示。",
      "example_en": "They showered their daughter with praise after her graduation.",
      "example_cn": "女儿毕业之后，他们给予了她大量的赞扬。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rain",
      "analysis": "“Rain” (雨) 是一个泛指所有形式降水的总称，可以是持续的细雨、中雨或暴雨，不强调时间长短或强度。而 “shower” 特指短暂、突然、强度较大的阵雨，具有更强的瞬时性和局部性。"
    },
    {
      "word_to_compare": "spray",
      "analysis": "“Spray” (喷雾) 指细小液滴以分散状态喷出，通常用于人工或机械方式，如喷雾器、香水等。它不涉及自然天气现象，也不强调密集或大量。而 “shower” 可以是自然降雨，也可以是比喻性的大量给予，语义范围更广、更生动。"
    },
    {
      "word_to_compare": "downpour",
      "analysis": "“Downpour” (倾盆大雨) 指非常猛烈、持续时间较长的暴雨，强调雨量极大和破坏性。而 “shower” 虽然可能很强烈，但持续时间短，通常不造成严重积水或灾害，语义强度较轻。"
    }
  ]
}