{
  "word": "shows",
  "pronunciation": "shawz",
  "concise_definition": "n. 表演, 展览, 节目; v. 显示, 表现, 演出",
  "forms": {
    "singular": "show",
    "third_person_singular": "shows",
    "past_tense": "showed",
    "past_participle": "shown",
    "present_participle": "showing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A public performance or presentation, such as a theatrical play, television program, or exhibition, intended to entertain or inform an audience.",
      "explanation_cn": "指面向观众的公开表演或展示，如戏剧、电视节目或展览，旨在娱乐或传达信息。",
      "example_en": "The Broadway show received standing ovations every night.",
      "example_cn": "这部百老汇演出每晚都赢得观众起立鼓掌。"
    },
    {
      "pos": "noun",
      "explanation_en": "An exhibition or display of goods, art, or information, often organized for public viewing in a gallery, fair, or store.",
      "explanation_cn": "指为公众观赏而组织的商品、艺术作品或信息的展览，常见于画廊、展会或商店中。",
      "example_en": "The art museum is hosting a special show of Impressionist paintings.",
      "example_cn": "这家艺术博物馆正在举办一场印象派绘画的特别展览。"
    },
    {
      "pos": "verb",
      "explanation_en": "To display, reveal, or make visible something that was previously hidden or not obvious.",
      "explanation_cn": "指展示、揭示或使原本隐藏或不明显的事物变得可见。",
      "example_en": "The X-ray shows a fracture in her wrist.",
      "example_cn": "X光片显示她的手腕有骨折。"
    },
    {
      "pos": "verb",
      "explanation_en": "To perform or present something publicly, such as a play, concert, or film.",
      "explanation_cn": "指公开表演或呈现某事物，如戏剧、音乐会或电影。",
      "example_en": "The theater will show the movie starting next Friday.",
      "example_cn": "这家剧院将于下周五开始放映这部电影。"
    },
    {
      "pos": "verb",
      "explanation_en": "To demonstrate or indicate a quality, emotion, or condition through behavior or expression.",
      "explanation_cn": "指通过行为或表情表现出某种品质、情绪或状态。",
      "example_en": "He showed great patience while waiting in line.",
      "example_cn": "他在排队等候时表现出了极大的耐心。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "performance",
      "analysis": "“Performance” (表演) 更侧重于技艺的执行和艺术表现，常用于音乐、舞蹈或戏剧等专业领域，强调技巧和完成度。而 “show” 更广泛，可指任何形式的公开呈现，包括非专业或娱乐性质的活动，如电视节目或商品展览。"
    },
    {
      "word_to_compare": "display",
      "analysis": "“Display” (展示) 通常指静态地陈列物品以供观看，如商店橱窗或博物馆展品，强调视觉呈现而非动态过程。而 “show” 可包含动态的表演或交互性内容，如演出或演示，更具主动性和过程感。"
    },
    {
      "word_to_compare": "demonstrate",
      "analysis": "“Demonstrate” (演示/证明) 强调通过具体操作或例证来清晰地说明或验证某个原理、功能或观点，常用于教学或技术场景。而 “show” 更口语化、更通用，可指任何类型的呈现，不一定具有论证目的。"
    }
  ]
}