{
  "word": "shower",
  "pronunciation": "shaw·er",
  "concise_definition": "n. 淋浴, 骤雨; v. 淋浴, 使大量落下, 大量给予",
  "forms": {
    "third_person_singular": "showers",
    "past_tense": "showered",
    "past_participle": "showered",
    "present_participle": "showering"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A bath in which water is sprayed over the body from above, typically using a showerhead in a bathroom enclosure.",
      "explanation_cn": "指在浴室中通过花洒从上方喷洒水流来清洁身体的沐浴方式。",
      "example_en": "I took a quick shower before heading to work.",
      "example_cn": "我去上班前快速洗了个澡。"
    },
    {
      "pos": "noun",
      "explanation_en": "A heavy, brief fall of rain or other precipitation, often sudden and intense.",
      "explanation_cn": "指突然而短暂的强降雨或其他降水现象。",
      "example_en": "We got caught in a sudden shower on our hike.",
      "example_cn": "我们在徒步时突然遭遇了一场阵雨。"
    },
    {
      "pos": "noun",
      "explanation_en": "A social gathering, especially one held to celebrate an upcoming event such as a baby's birth, where guests bring gifts.",
      "explanation_cn": "指为庆祝即将到来的事件（如婴儿出生）而举办的社交聚会，宾客通常会携带礼物。",
      "example_en": "She threw a baby shower for her sister last weekend.",
      "example_cn": "上周末她为妹妹举办了一场婴儿派对。"
    },
    {
      "pos": "verb",
      "explanation_en": "To wash one's body under a spray of water, typically in a shower stall or enclosure.",
      "explanation_cn": "指在淋浴间或封闭空间内用喷洒的水流清洗身体。",
      "example_en": "He showers every morning before breakfast.",
      "example_cn": "他每天早上吃早餐前都会淋浴。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to fall or be distributed in large quantities, like rain or objects.",
      "explanation_cn": "指使某物像雨点般大量落下或倾泻而下。",
      "example_en": "The fireworks showered sparks across the night sky.",
      "example_cn": "烟花在夜空中洒下点点火花。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give or bestow something abundantly or generously, often praise, attention, or gifts.",
      "explanation_cn": "指慷慨、大量地给予某物，常用于赞美、关注或礼物。",
      "example_en": "The audience showered the performer with applause.",
      "example_cn": "观众向表演者报以热烈的掌声。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rain",
      "analysis": "“Rain” (雨) 是一个更广泛、更中性的名词，泛指任何形式的降水，不强调强度或持续时间。而 “shower” 特指短暂、突然、强度较大的阵雨，常带有临时性和间歇性特征。作为动词时，“rain” 通常仅用于自然降水，而 “shower” 可用于比喻性大量给予。"
    },
    {
      "word_to_compare": "bath",
      "analysis": "“Bath” (浴) 通常指在浴缸中浸泡全身的洗浴方式，强调沉浸和放松；而 “shower” 是喷淋式清洁，更注重效率和快速。两者在功能上相似，但方式和文化语境不同：英语中 “shower” 更日常、更普遍，而 “bath” 常与休闲、仪式感关联。"
    },
    {
      "word_to_compare": "pour",
      "analysis": "“Pour” (倾倒) 强调液体或颗粒物从容器中连续、定向地流出，常用于主动行为（如倒水、倒酒）；而 “shower” 强调从上方分散、广泛地洒落，具有覆盖性和非定向性。例如 “pour water into a glass” vs. “shower flowers on the bride” —— 后者强调的是覆盖式的、浪漫的、非控制性的给予。"
    }
  ]
}