{
  "word": "shrek",
  "pronunciation": "shrek",
  "concise_definition": "n. 史莱克（童话角色），丑陋但善良的人；adj. 史莱克式的，怪异但可爱的",
  "forms": {
    "plural": "shreks"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A fictional ogre character from the DreamWorks animated film series, known for his green skin, gruff demeanor, and unexpected kindness, symbolizing the idea that true beauty lies within.",
      "explanation_cn": "梦工厂动画系列中的虚构食人魔角色，以绿色皮肤、粗鲁外表和出人意料的善良著称，象征着‘真正的美在于内心’的理念。",
      "example_en": "Shrek is not your typical fairy tale hero—he’s loud, messy, and loves swamp life, but he has a heart of gold.",
      "example_cn": "史莱克不是典型的童话英雄——他吵闹、邋遢、热爱沼泽生活，但内心却无比善良。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is physically unattractive or unconventional in appearance but possesses a warm, kind, or endearing personality.",
      "explanation_cn": "指外表丑陋或与众不同，但性格温暖、善良或讨人喜欢的人。",
      "example_en": "Don't judge him by his looks—he's a real shrek: rough on the outside, but the sweetest guy you'll ever meet.",
      "example_cn": "别以貌取人——他真是个史莱克式的人物：外表粗犷，却是你见过最温柔的人。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that is bizarre, unconventional, or grotesque in appearance, yet oddly charming or appealing.",
      "explanation_cn": "形容某物外表怪异、非传统甚至丑陋，却意外地具有魅力或吸引力。",
      "example_en": "The art installation was a shrek-like mix of rusted metal and stuffed animals—disgusting, but strangely beautiful.",
      "example_cn": "这件艺术装置是生锈金属和毛绒玩具的史莱克式混合体——令人反感，却莫名美丽。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ogre",
      "analysis": "“Ogre”（食人魔）是神话传说中典型的恐怖、凶残的怪物形象，强调邪恶与威胁性。而 “Shrek” 是对这一形象的颠覆性重构——外表是食人魔，内在却是善良的，因此 “shrek” 带有反讽和温情的色彩，而 “ogre” 则是纯粹的负面符号。"
    },
    {
      "word_to_compare": "geek",
      "analysis": "“Geek”（极客）指在技术或小众领域痴迷、社交能力较弱但聪明的人，其魅力来自智慧与独特性。“Shrek” 的魅力则来自外表与内心的反差，强调的是外貌的丑陋与心灵的美丽，而非智力或专业能力。两者都挑战主流审美，但切入点不同。"
    },
    {
      "word_to_compare": "quirky",
      "analysis": "“Quirky”（古怪的）形容个性或风格独特、非主流但令人喜爱，通常带有轻松幽默感，多用于人或事物的风格层面。“Shrek” 不仅是风格古怪，更是一种身份的颠覆——从怪物到英雄的转变，具有更深层的文化隐喻和情感共鸣。"
    }
  ]
}