{
  "word": "shred",
  "pronunciation": "shred",
  "concise_definition": "v. 撕碎, 碎片化; n. 碎片, 碎屑",
  "forms": {
    "third_person_singular": "shreds",
    "past_tense": "shredded",
    "past_participle": "shredded",
    "present_participle": "shredding"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To tear or cut something into small, narrow pieces, often deliberately to destroy or dispose of it securely.",
      "explanation_cn": "指故意将某物撕成或切成细小、狭长的碎片，通常是为了彻底销毁或安全处理（如文件）。",
      "example_en": "She shredded the confidential documents before throwing them away.",
      "example_cn": "她把机密文件撕碎后才扔掉。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reduce something to a very small amount or to a state of disintegration, often metaphorically.",
      "explanation_cn": "指（常用于比喻）将某物减少到几乎为零，或使其彻底瓦解、崩溃。",
      "example_en": "The criticism shredded his reputation in just one day.",
      "example_cn": "这些批评在一天之内就摧毁了他的声誉。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, narrow strip or fragment of something that has been torn or cut apart.",
      "explanation_cn": "指被撕开或切开后形成的细小、狭长的碎片或碎屑。",
      "example_en": "The shredder left only a pile of paper shreds on the floor.",
      "example_cn": "碎纸机只在地板上留下了一堆纸屑。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small amount of something remaining after most has been used or destroyed; often used in the phrase 'a shred of' to emphasize scarcity.",
      "explanation_cn": "指某物在大部分已被使用或毁坏后所剩无几的部分，常用于短语 'a shred of' 以强调极度稀少。",
      "example_en": "He had not a shred of evidence to support his claim.",
      "example_cn": "他连一点证据都拿不出来支持自己的说法。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tear",
      "analysis": "“Tear”（撕裂）泛指用力将物体分开，通常不强调碎片的大小或形状，可能留下不规则的大块。而 “shred” 强调将物体撕成细小、条状的碎片，常带有系统性或目的性（如销毁文件）。"
    },
    {
      "word_to_compare": "chop",
      "analysis": "“Chop”（砍碎）通常指用刀或工具将物体切成块状或段状，强调的是垂直或横向的切割动作，多用于食物或木材。而 “shred” 更侧重于将物体拉成细丝或薄片，常用于纸张、奶酪或肉类，动作更轻柔但更精细。"
    },
    {
      "word_to_compare": "fragment",
      "analysis": "“Fragment”（碎片）是中性词，泛指任何不完整的部分，可能是自然破裂或外力造成的，不隐含动作或意图。而 “shred” 不仅指碎片，还隐含了主动撕碎的过程，且碎片形态更特定（细长、条状），常用于比喻性语境中表达彻底摧毁。"
    }
  ]
}