{
  "word": "shroud",
  "pronunciation": "shrowd",
  "concise_definition": "n. 寿衣, 遮蔽物; v. 遮盖, 隐藏",
  "forms": {
    "third_person_singular": "shrouds",
    "past_tense": "shrouded",
    "past_participle": "shrouded",
    "present_participle": "shrouding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A cloth, especially a burial cloth, used to wrap a corpse before burial; symbolically, anything that covers or conceals something completely.",
      "explanation_cn": "指用于包裹尸体入葬的布料，尤指寿衣；也可引申为任何完全覆盖或遮蔽某物之物。",
      "example_en": "The body was wrapped in a white shroud before the funeral.",
      "example_cn": "葬礼前，遗体被裹在一件白色的寿衣中。"
    },
    {
      "pos": "noun",
      "explanation_en": "A covering or layer that obscures or hides something, often creating an atmosphere of mystery or secrecy.",
      "explanation_cn": "指遮蔽或隐藏某物的覆盖层，常营造出神秘或隐秘的氛围。",
      "example_en": "A thick shroud of fog enveloped the mountains at dawn.",
      "example_cn": "黎明时分，浓重的雾气笼罩着群山。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover or conceal something completely, often with something that obscures visibility or understanding.",
      "explanation_cn": "指完全覆盖或隐藏某物，通常用某种遮蔽物使其难以看清或理解。",
      "example_en": "The truth was shrouded in layers of lies and misinformation.",
      "example_cn": "真相被层层谎言和错误信息所掩盖。"
    },
    {
      "pos": "verb",
      "explanation_en": "To wrap a corpse in a burial cloth; to prepare a body for burial.",
      "explanation_cn": "指用寿衣包裹尸体；为安葬做准备。",
      "example_en": "The monks shrouded the monk’s body with silk and incense.",
      "example_cn": "僧侣们用丝绸和香料包裹了这位僧人的遗体。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cover",
      "analysis": "“Cover” (覆盖) 是最通用的词，指任何类型的遮盖行为或状态，不带有神秘或死亡的隐含意义。而 “shroud” 通常带有强烈的象征性，常与死亡、神秘或不可见性相关，语义更沉重、更具文学色彩。"
    },
    {
      "word_to_compare": "veil",
      "analysis": "“Veil” (面纱/薄纱) 指轻薄、半透明的遮盖物，常用于比喻性语境，如“veil of secrecy”（秘密的面纱），强调部分可见但模糊不清。而 “shroud” 暗示完全、严密的遮蔽，常与彻底隐藏或死亡相关，遮蔽程度更深。"
    },
    {
      "word_to_compare": "envelop",
      "analysis": "“Envelop” (包围) 强调从四周包围、包裹，常用于自然现象（如烟雾、雾气）或抽象概念（如情感），但不特指死亡或丧葬。而 “shroud” 除了有包裹义，还承载着文化与宗教中对死亡仪式的特定联想，语义更具体、更具仪式感。"
    }
  ]
}