{
  "word": "shutter",
  "pronunciation": "shut·er",
  "concise_definition": "n. 百叶窗, 快门; v. 关闭, 关上",
  "forms": {
    "plural": "shutters",
    "third_person_singular": "shutters",
    "past_tense": "shuttered",
    "past_participle": "shuttered",
    "present_participle": "shuttering"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A set of horizontal slats or panels, typically made of wood or metal, installed on the outside of a window to control light, provide privacy, or offer protection from weather or intruders.",
      "explanation_cn": "指安装在窗户外部的一组水平木制或金属百叶板，用于调节光线、提供隐私或抵御恶劣天气与入侵者。",
      "example_en": "The old house had green wooden shutters on every window.",
      "example_cn": "这栋老房子每扇窗户上都有绿色的木制百叶窗。"
    },
    {
      "pos": "noun",
      "explanation_en": "A movable device in a camera that controls the duration of light exposure to the film or sensor by opening and closing rapidly.",
      "explanation_cn": "指相机中通过快速开合来控制光线照射到胶片或传感器时长的活动装置。",
      "example_en": "The photographer adjusted the shutter speed to capture the motion of the waterfall.",
      "example_cn": "摄影师调整了快门速度，以捕捉瀑布的动态。"
    },
    {
      "pos": "verb",
      "explanation_en": "To close or seal something, especially windows or doors, often with shutters or by barricading them.",
      "explanation_cn": "指关闭或封住某物，尤指用百叶窗或用障碍物堵住窗户或门。",
      "example_en": "As the storm approached, residents shuttered their homes to protect against high winds.",
      "example_cn": "随着风暴逼近，居民们关上了百叶窗以抵御强风。"
    },
    {
      "pos": "verb",
      "explanation_en": "To close down or cease operations, especially of a business or facility, often permanently.",
      "explanation_cn": "指关闭或停止运营，尤指企业或设施，常为永久性关闭。",
      "example_en": "The factory was shuttered after decades of declining sales.",
      "example_cn": "这家工厂在销量持续下滑数十年后被关闭了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "blind",
      "analysis": "“Blind”（窗帘/遮光帘）通常指由织物或塑料制成的可卷起或折叠的窗户覆盖物，主要用于遮光和隐私，但不具备百叶窗的结构化叶片设计。而 “shutter” 更强调刚性、可开合的物理结构，常用于防护和装饰双重目的。"
    },
    {
      "word_to_compare": "aperture",
      "analysis": "“Aperture”（光圈）是相机镜头中控制进光量的圆形开口，决定进光量的大小；而 “shutter” 控制的是光线进入的时间长短。两者协同工作，但功能不同：aperture 是‘多少’，shutter 是‘多久’。"
    },
    {
      "word_to_compare": "close",
      "analysis": "“Close” 是通用动词，泛指任何关闭动作，如关门、关灯；而 “shutter” 作为动词时特指用百叶窗或类似装置封闭，或指企业永久性停业，具有更具体的物理或经济语境，语义范围更窄但更精准。"
    }
  ]
}