{
  "word": "shutout",
  "pronunciation": "shut·out",
  "concise_definition": "n. 零封, 未得分; v. 零封对手, 使无法得分",
  "forms": {
    "plural": "shutouts",
    "third_person_singular": "shutouts",
    "past_tense": "shut out",
    "past_participle": "shut out",
    "present_participle": "shutting out"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A game or match in which one team prevents the opposing team from scoring any points, especially in baseball, hockey, or soccer.",
      "explanation_cn": "指在棒球、冰球或足球等比赛中，一方球队完全阻止对手得分，使对方得分为零的比赛。",
      "example_en": "The pitcher threw a shutout, allowing no hits and no runs in nine innings.",
      "example_cn": "这位投手投出了一场零封比赛，九局中未被击出任何安打，也未失一分。"
    },
    {
      "pos": "noun",
      "explanation_en": "A situation in which someone is completely excluded or prevented from participating or being involved.",
      "explanation_cn": "指某人被完全排除在外或无法参与某事的情况，常用于比喻意义。",
      "example_en": "The minority group suffered a political shutout, winning no seats in the election.",
      "example_cn": "少数群体遭遇了政治上的全面落选，选举中未赢得任何席位。"
    },
    {
      "pos": "verb",
      "explanation_en": "To prevent an opponent from scoring any points in a game or competition.",
      "explanation_cn": "指在比赛中阻止对手得分，使其得分为零。",
      "example_en": "The defense shut out the opposing team in the second half.",
      "example_cn": "防守方在下半场零封了对手。"
    },
    {
      "pos": "verb",
      "explanation_en": "To exclude someone completely from participation, access, or information.",
      "explanation_cn": "指完全将某人排除在参与、接触或信息之外。",
      "example_en": "The board shut out the new manager from all strategic discussions.",
      "example_cn": "董事会将新任经理完全排除在所有战略讨论之外。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "blank",
      "analysis": "“Blank”（空白）通常指缺乏内容、信息或反应的状态，如“a blank expression”（面无表情），它不特指比赛中的零分，也不强调主动阻止对方得分的行为。而 “shutout” 是一个体育术语，特指主动防守成功使对方得分为零，具有明确的竞技语境。"
    },
    {
      "word_to_compare": "clean sheet",
      "analysis": "“Clean sheet”（零失球）是英式英语中与 “shutout” 几乎同义的表达，尤其在足球中使用广泛。两者都指防守方未让对手进球，但 “clean sheet” 更侧重于守门员或防线的完美表现，而 “shutout” 在美式英语中更通用，可用于棒球、冰球等多种运动，且可作动词使用。"
    },
    {
      "word_to_compare": "exclude",
      "analysis": "“Exclude”（排除）是一个通用动词，指将某人或某物从群体、活动或范围中移除，语义范围广泛，不涉及体育或得分概念。而 “shut out” 在作为动词使用时，常带有强烈的情感或权力色彩，强调主动、彻底地阻断参与，尤其在体育语境中具有技术性含义。"
    }
  ]
}