{
  "word": "siberian",
  "pronunciation": "sahy·beer·ee·uhn",
  "concise_definition": "adj. 西伯利亚的, n. 西伯利亚人, 西伯利亚猫",
  "forms": {
    "plural": "siberians"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or originating from Siberia, a vast region in northern Asia known for its extremely cold climate, vast forests, and sparse population.",
      "explanation_cn": "指与西伯利亚有关或源自西伯利亚的，西伯利亚是亚洲北部一片地域辽阔、气候严寒、森林广袤且人口稀少的地区。",
      "example_en": "The Siberian tundra is home to unique wildlife adapted to subzero temperatures.",
      "example_cn": "西伯利亚苔原是适应零下温度的独特野生动物的家园。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person native to or inhabiting Siberia.",
      "explanation_cn": "指居住在西伯利亚的原住民或当地人。",
      "example_en": "Many Siberians have developed cultural traditions centered around survival in harsh winter conditions.",
      "example_cn": "许多西伯利亚人形成了以严寒环境下生存为中心的文化传统。"
    },
    {
      "pos": "noun",
      "explanation_en": "A breed of long-haired domestic cat with a thick coat, large paws, and blue eyes, originally from Russia and commonly associated with Siberia.",
      "explanation_cn": "一种长毛家猫品种，毛发浓密、爪子大、眼睛呈蓝色，原产于俄罗斯，常与西伯利亚关联。",
      "example_en": "Her pet Siberian is incredibly gentle and hypoallergenic, making it ideal for allergy sufferers.",
      "example_cn": "她的西伯利亚猫非常温顺且低致敏，非常适合过敏体质的人饲养。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "russian",
      "analysis": "“Russian” (俄罗斯的/俄罗斯人) 指与俄罗斯联邦整体相关的，涵盖其政治、文化、语言和地理范围，而 “Siberian” 仅特指俄罗斯亚洲部分的西伯利亚地区。并非所有俄罗斯人都是西伯利亚人，但所有西伯利亚人都是俄罗斯人（在国籍上）。"
    },
    {
      "word_to_compare": "arctic",
      "analysis": "“Arctic” (北极的) 指地球最北端的极地地区，以永久冰盖和极端寒冷为特征，而 “Siberian” 是一个地理区域名称，虽然西伯利亚部分区域位于北极圈内，但其范围远大于北极地区，包括温带森林和草原。因此，Siberian 是地域性术语，Arctic 是气候/地理带术语。"
    },
    {
      "word_to_compare": "siberian tiger",
      "analysis": "“Siberian tiger” 是一个专有名词短语，特指生活在西伯利亚的东北虎亚种，而 “Siberian” 作为独立词时可指人、物或地区。在使用中，若单独说 “Siberian”，需依赖上下文判断其指代对象；而 “Siberian tiger” 是固定搭配，语义明确。"
    }
  ]
}