{
  "word": "sickening",
  "pronunciation": "sik·nuh·ning",
  "concise_definition": "adj. 令人作呕的, 令人反感的, 极度讨厌的",
  "forms": {
    "comparative": "sickening",
    "superlative": "sickening"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Causing a feeling of nausea or disgust, often due to something physically repulsive, overly sentimental, or morally offensive.",
      "explanation_cn": "因某种身体上令人反感、过度感伤或道德上令人厌恶的事物而引起恶心或厌恶感的。",
      "example_en": "The sickening smell of rotting food filled the kitchen.",
      "example_cn": "腐烂食物令人作呕的气味充满了厨房。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Excessively sentimental or emotional in a way that is irritating or distasteful, often used to criticize artificial or manipulative expressions of affection.",
      "explanation_cn": "情感表达过于感伤或矫情，令人烦躁或反感，常用于批评虚假或操纵性的情感流露。",
      "example_en": "The movie’s sickeningly sweet romance felt forced and unrealistic.",
      "example_cn": "这部电影中过于甜腻的爱情情节显得生硬且不真实。"
    },
    {
      "pos": "adjective",
      "explanation_en": "So extreme or unpleasant that it is morally or emotionally repulsive, often used to describe injustice, cruelty, or hypocrisy.",
      "explanation_cn": "极端恶劣或令人不快，以至于在道德或情感上令人反感，常用于描述不公、残忍或虚伪。",
      "example_en": "It was a sickening display of greed and corruption in the highest levels of government.",
      "example_cn": "这是政府高层贪婪与腐败的令人作呕的展示。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "disgusting",
      "analysis": "“Disgusting” (令人厌恶的) 是一个更通用的词，用于描述任何引起反感的事物，包括脏乱、不卫生或不道德的行为。而 “sickening” 更强调由强烈情绪引发的生理反应（如恶心），常带有更强烈的主观情感色彩，尤其在描述虚伪或过度感伤时更具批判性。"
    },
    {
      "word_to_compare": "revolting",
      "analysis": "“Revolting” (令人作呕的) 与 “sickening” 意义非常接近，都可表示生理或道德上的厌恶，但 “revolting” 更常用于描述极端的、令人震惊的丑恶行为，语气更激烈、更具冲击力。而 “sickening” 在口语中更常用于形容情感上的矫情或过度。"
    },
    {
      "word_to_compare": "repulsive",
      "analysis": "“Repulsive” (令人反感的) 更侧重于因外貌、行为或特质而引发的排斥感，常用于描述物理或社交层面的厌恶，如外貌丑陋或性格恶劣。而 “sickening” 更强调心理或情感上的不适，尤其在涉及虚伪、过度情感或道德败坏时更具感染力。"
    }
  ]
}