{
  "word": "sides",
  "pronunciation": "sīdz",
  "concise_definition": "n. 侧面, 方面, 一方, 赞成者",
  "forms": {
    "singular": "side"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "One of the two or more surfaces or edges of a three-dimensional object or a flat shape, typically perpendicular to the top and bottom.",
      "explanation_cn": "指三维物体或平面形状的两个或多个表面或边缘之一，通常与上下表面垂直。",
      "example_en": "The cube has six sides, each a perfect square.",
      "example_cn": "这个立方体有六个面，每个面都是一个完美的正方形。"
    },
    {
      "pos": "noun",
      "explanation_en": "A particular aspect, viewpoint, or position in a debate, conflict, or situation, often contrasting with another.",
      "explanation_cn": "指在辩论、冲突或情境中的某个特定方面、观点或立场，通常与另一个相对立。",
      "example_en": "It's important to consider both sides of the argument before making a decision.",
      "example_cn": "在做决定之前，考虑争论的双方观点很重要。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of people who support or are aligned with a particular cause, team, or individual in a contest or dispute.",
      "explanation_cn": "指在竞赛或争端中支持某一特定事业、团队或个人的一群人。",
      "example_en": "The fans on both sides were cheering loudly during the final match.",
      "example_cn": "决赛中，双方球迷都在大声欢呼。"
    },
    {
      "pos": "noun",
      "explanation_en": "A part of the body extending from the shoulder to the hip, or the outer surface of the body on either side of the spine.",
      "explanation_cn": "指从肩膀到臀部的身体部分，或脊柱两侧的身体外侧部分。",
      "example_en": "She rubbed her sore sides after running the marathon.",
      "example_cn": "她在跑完马拉松后揉了揉酸痛的肋部。"
    },
    {
      "pos": "noun",
      "explanation_en": "A dish served alongside the main course in a meal, often a vegetable, salad, or starch.",
      "explanation_cn": "指与主菜一同上桌的配菜，通常是蔬菜、沙拉或淀粉类食物。",
      "example_en": "The grilled salmon came with roasted vegetables and rice as sides.",
      "example_cn": "烤三文鱼搭配烤蔬菜和米饭作为配菜。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "aspect",
      "analysis": "“Aspect”（方面）更侧重于事物的某个抽象特征或观察角度，常用于分析或描述复杂事物的组成部分，如‘经济发展的各个方面’。而 ‘side’ 更常用于表达对立立场或物理表面，语义更具体、更口语化。"
    },
    {
      "word_to_compare": "edge",
      "analysis": "“Edge”（边缘）强调物体的边界线或锋利的外沿，常用于物理形状的描述，如‘刀刃的边缘’。而 ‘side’ 指的是一个完整的面或区域，范围更大，不强调边界线。"
    },
    {
      "word_to_compare": "party",
      "analysis": "“Party”（一方）在政治或法律语境中指参与争端的正式团体，具有法律或组织属性，如‘诉讼双方’。而 ‘side’ 更泛化，可用于非正式场合，如体育比赛或日常争论中的支持者，语气更轻松。"
    },
    {
      "word_to_compare": "flank",
      "analysis": "“Flank”（侧翼）是军事术语，特指军队或防御体系的侧面，强调战术位置和动态防御。它比 ‘side’ 更专业、更具体，通常不用于日常语境或抽象意义。"
    }
  ]
}