{
  "word": "sidelined",
  "pronunciation": "sīdˈlīnd",
  "concise_definition": "v. 使 sidelines, 使边缘化, 使闲置",
  "forms": {
    "base_form": "sideline",
    "third_person_singular": "sidelines",
    "past_tense": "sidelined",
    "past_participle": "sidelined",
    "present_participle": "sidelining"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To remove someone from an active role or position, often temporarily, especially in sports or professional contexts, due to injury, lack of opportunity, or strategic decision.",
      "explanation_cn": "指将某人从活跃的角色或职位中移除，通常为暂时性，常见于体育或职业语境中，原因包括受伤、缺乏机会或战略决策。",
      "example_en": "The star player was sidelined for the season after suffering a knee injury.",
      "example_cn": "这位明星球员因膝盖受伤而被排除在赛季之外。"
    },
    {
      "pos": "verb",
      "explanation_en": "To marginalize or exclude someone from participation in important decisions or activities, often due to political, social, or organizational reasons.",
      "explanation_cn": "指因政治、社会或组织原因，将某人边缘化或排除在重要决策或活动之外，使其失去影响力。",
      "example_en": "The reformist minister was sidelined by the conservative faction within the party.",
      "example_cn": "这位改革派部长被党内保守派边缘化了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To divert attention or resources away from a person, idea, or project, causing it to lose priority or momentum.",
      "explanation_cn": "指将注意力或资源从某人、某想法或某项目上转移，导致其失去优先级或动力。",
      "example_en": "The original proposal was sidelined in favor of a more profitable but less innovative alternative.",
      "example_cn": "由于一个更盈利但创新性较低的替代方案，原始提案被搁置了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "excluded",
      "analysis": "“Excluded” (排除) 强调完全被拒之门外，通常带有明确的拒绝或禁止意味，语义更绝对。而 “sidelined” 更强调被暂时或间接地边缘化，当事人可能仍处于系统内，但不再处于核心位置。"
    },
    {
      "word_to_compare": "marginalized",
      "analysis": "“Marginalized” (边缘化) 与 “sidelined” 意义高度重叠，但更常用于社会、文化或政治语境中，强调系统性不公或结构性排斥，带有更强的道德批判色彩。而 “sidelined” 更中性，可用于体育、商业等日常语境。"
    },
    {
      "word_to_compare": "benched",
      "analysis": "“Benched” (放在替补席上) 是 “sidelined” 在体育语境中的具体化表达，特指运动员被换下场或未被安排上场。它比 “sidelined” 更具象，适用范围更窄，仅限于竞技场景。"
    }
  ]
}