{
  "word": "sidelines",
  "pronunciation": "sīd·līnz",
  "concise_definition": "n. 边线, 场边; v. 使退居二线, 使搁置",
  "forms": {
    "singular": "sideline"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The boundary lines that mark the edges of a playing field in sports, especially in football, soccer, or basketball, separating the playing area from the spectator or substitution zones.",
      "explanation_cn": "体育比赛中用来标示场地边界的线，特别是在足球、篮球等运动中，用于分隔比赛区域与观众席或替补区。",
      "example_en": "The coach stood on the sidelines, shouting instructions to the players.",
      "example_cn": "教练站在边线上，向球员们大声发出指令。"
    },
    {
      "pos": "noun",
      "explanation_en": "An activity, interest, or source of income pursued alongside one’s main job or primary responsibility, often secondary or supplementary.",
      "explanation_cn": "指在主要工作或职责之外从事的次要活动、兴趣或收入来源，通常作为补充性质。",
      "example_en": "Her sideline is selling handmade jewelry online while working as a teacher.",
      "example_cn": "她作为一名教师的同时，还兼职在网上销售手工珠宝。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove someone from active participation in a role or activity, often deliberately, by relegating them to a peripheral or less important position.",
      "explanation_cn": "指有意将某人从主要角色或活动中移除，使其处于边缘或不重要的位置。",
      "example_en": "The new manager sidelined the veteran employee by assigning him only administrative tasks.",
      "example_cn": "新经理通过只分配行政任务，将这位资深员工边缘化了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To set aside or postpone something, especially a plan, idea, or issue, so that it is no longer actively considered or pursued.",
      "explanation_cn": "指搁置或推迟某事（如计划、想法或议题），使其不再被积极考虑或推进。",
      "example_en": "The proposal was sidelined due to budget cuts and shifting priorities.",
      "example_cn": "由于预算削减和优先事项的改变，该提案被搁置了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bench",
      "analysis": "“Bench”（替补席）在体育语境中常指球员被替换下场后所坐的位置，隐喻性地表示暂时退出比赛，但仍有回归可能；而 “sidelines” 更强调被排除在核心活动之外，可能带有永久性或被动性，语义更广，也用于非体育语境。"
    },
    {
      "word_to_compare": "marginalize",
      "analysis": "“Marginalize”（边缘化）是更正式、更强烈的词汇，常用于社会、政治或组织语境中，指系统性地剥夺某人或某群体的权力、影响力或代表性；而 “sideline” 更口语化，常用于日常语境，强调的是被暂时或非故意地排除在中心之外。"
    },
    {
      "word_to_compare": "side job",
      "analysis": "“Side job”（副业）是 “sideline” 作为名词时的同义表达，但 “side job” 仅指有报酬的次要工作，而 “sideline” 还可指非盈利的兴趣爱好，且作为动词时具有“搁置”“边缘化”的含义，语义范围更广。"
    }
  ]
}