{
  "word": "sideline",
  "pronunciation": "sīd·līn",
  "concise_definition": "n. 边线, 旁务; v. 使退居次要地位, 从事副业",
  "forms": {
    "third_person_singular": "sidelines",
    "past_tense": "sidelined",
    "past_participle": "sidelined",
    "present_participle": "sidelining"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The boundary line marking the edge of a playing field in sports such as football or basketball; also used metaphorically to refer to a peripheral or secondary role.",
      "explanation_cn": "在足球、篮球等运动中标志球场边缘的边界线；也可比喻性地指代次要或边缘化的角色。",
      "example_en": "The coach kept the injured player on the sideline until he was fully recovered.",
      "example_cn": "教练让受伤的球员一直坐在场边，直到他完全康复。"
    },
    {
      "pos": "noun",
      "explanation_en": "A secondary occupation or activity pursued alongside a main job or career, often for additional income or personal interest.",
      "explanation_cn": "指在主要职业之外从事的次要工作或活动，通常为了增加收入或满足个人兴趣。",
      "example_en": "Besides being a teacher, her sideline is selling handmade jewelry online.",
      "example_cn": "除了当老师，她的副业是在网上销售手工珠宝。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove someone from a central or active role, often unexpectedly or unfairly, and assign them to a less important position.",
      "explanation_cn": "指将某人从核心或活跃的角色中移除，通常带有意外或不公的性质，转而赋予其较不重要的位置。",
      "example_en": "After the new CEO took over, the former director was sidelined in favor of younger managers.",
      "example_cn": "新CEO上任后，前总监被边缘化，取而代之的是更年轻的经理。"
    },
    {
      "pos": "verb",
      "explanation_en": "To engage in a secondary activity or business in addition to one's primary occupation.",
      "explanation_cn": "指在主要职业之外从事另一项活动或生意。",
      "example_en": "He sidelines as a freelance photographer during weekends.",
      "example_cn": "他在周末兼职做自由摄影师。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bench",
      "analysis": "“Bench”（替补席）常用于体育语境，指球员因受伤或轮换而暂时不参与比赛，但通常保留回归的可能，带有临时性和战术性。而 “sideline” 更强调被排除在核心之外，可能具有长期性甚至永久性，且常含贬义，暗示被忽视或边缘化。"
    },
    {
      "word_to_compare": "peripheral",
      "analysis": "“Peripheral”（边缘的）是形容词，描述某事物处于核心之外、不重要的状态，是静态描述。而 “sideline” 作为动词时，强调一个主动的、可能带有权力干预的边缘化过程，作为名词时则特指这种边缘角色或副业，更具行为和情境指向性。"
    },
    {
      "word_to_compare": "side job",
      "analysis": "“Side job”（兼职）是中性词，仅指在主业之外的额外工作，强调经济目的，无贬义或权力关系。而 “sideline” 作为名词时虽可指副业，但常隐含该活动非正式、非主流或临时性，且在动词用法中带有被排挤、被剥夺主位的负面含义，语义更丰富复杂。"
    }
  ]
}