{
  "word": "siege",
  "pronunciation": "sēj",
  "concise_definition": "n. 围攻, 围困; v. 围攻, 围困",
  "forms": {
    "plural": "sieges",
    "third_person_singular": "sieves",
    "past_tense": "sieved",
    "past_participle": "sieved",
    "present_participle": "sieging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A military operation in which enemy forces surround a town, building, or other fortified position with the intent of capturing it through prolonged attack or isolation.",
      "explanation_cn": "指敌方军队包围城镇、建筑或其他防御工事，通过长期攻击或切断补给以迫使其投降的军事行动。",
      "example_en": "The castle held out for three months during the siege.",
      "example_cn": "这座城堡在围攻中坚守了三个月。"
    },
    {
      "pos": "noun",
      "explanation_en": "A prolonged and persistent effort to pressure or overwhelm someone or something, often in a non-military context (e.g., media, public opinion, or demands).",
      "explanation_cn": "指在非军事语境中对某人或某事物进行的长期、持续的压力或冲击，如媒体围攻、公众舆论施压或不断提出要求。",
      "example_en": "The politician faced a media siege after the scandal broke.",
      "example_cn": "丑闻曝光后，这位政客遭到了媒体的围攻。"
    },
    {
      "pos": "verb",
      "explanation_en": "To surround and attack a place militarily with the aim of forcing its surrender.",
      "explanation_cn": "指以军事手段包围并攻击某地，以迫使其投降。",
      "example_en": "The army besieged the city for weeks before it finally surrendered.",
      "example_cn": "军队围攻这座城市数周，直到它最终投降。"
    },
    {
      "pos": "verb",
      "explanation_en": "To overwhelm someone with persistent demands, questions, or attention, often in an intrusive or harassing manner.",
      "explanation_cn": "指以持续不断的请求、提问或关注来压倒某人，通常带有侵扰或骚扰性质。",
      "example_en": "She was besieged by reporters as she left the courthouse.",
      "example_cn": "她离开法院时被记者们团团围住。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "blockade",
      "analysis": "“Blockade” (封锁) 强调切断物资、交通或通讯的通道，以孤立目标，但不一定包含直接的军事攻击。而 “siege” 不仅包括封锁，还必然包含持续的进攻或施压行为，目标是迫使对方屈服。"
    },
    {
      "word_to_compare": "assault",
      "analysis": "“Assault” (袭击) 指一次或多次突然、猛烈的攻击，通常是短期的、直接的暴力行为。而 “siege” 是长期、系统性的包围与攻击，强调持续性和战略耐心，而非单次爆发。"
    },
    {
      "word_to_compare": "encirclement",
      "analysis": "“Encirclement” (包围) 是一个纯军事术语，仅描述地理上的包围状态，不包含攻击或施压意图。而 “siege” 是包含包围、封锁和攻击的完整军事行动，具有明确的战略目的。"
    }
  ]
}