{
  "word": "sight",
  "pronunciation": "sīt",
  "concise_definition": "n. 视力, 景象, 看见; v. 看到, 发现",
  "forms": {
    "plural": "sights"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The ability to see or the sense of vision, allowing one to perceive visual information from the environment.",
      "explanation_cn": "指视觉能力或视觉感官，使人能够感知来自环境的视觉信息。",
      "example_en": "She lost her sight in the accident but learned to read Braille.",
      "example_cn": "她在事故中失明了，但学会了读盲文。"
    },
    {
      "pos": "noun",
      "explanation_en": "A view or scene that is seen, especially one that is impressive, beautiful, or noteworthy.",
      "explanation_cn": "指所看到的景象或风景，尤指令人印象深刻、美丽或值得注意的景观。",
      "example_en": "The Eiffel Tower is one of the most famous sights in Paris.",
      "example_cn": "埃菲尔铁塔是巴黎最著名的景点之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of seeing something, especially something unexpected or rare; a glimpse or sighting.",
      "explanation_cn": "指看到某物的行为，尤指意外或罕见的发现；一次瞥见或目击。",
      "example_en": "There was a rare sight of a snow leopard in the Himalayas last winter.",
      "example_cn": "去年冬天，人们在喜马拉雅山区目击到了一只罕见的雪豹。"
    },
    {
      "pos": "verb",
      "explanation_en": "To see or catch a glimpse of something, especially something notable or unexpected.",
      "explanation_cn": "指看到或瞥见某物，尤指值得注意或意外的事物。",
      "example_en": "We sighted a whale off the coast just before sunset.",
      "example_cn": "我们在日落前刚看到海岸外有一头鲸鱼。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "view",
      "analysis": "“View” (视野/景色) 通常指从特定位置看到的全景或风景，强调观察的角度和范围，常用于自然或城市景观。而 “sight” 更侧重于所看到的具体对象或事件，可以是单一的、短暂的或具有特殊意义的景象。"
    },
    {
      "word_to_compare": "vision",
      "analysis": "“Vision” (视觉/远见) 可以指生理上的视力，但更常用于比喻意义，如“远见”或“愿景”。它强调内在的洞察力或未来目标，而 “sight” 更偏向于外在的、物理的视觉感知或实际看到的景象。"
    },
    {
      "word_to_compare": "appearance",
      "analysis": "“Appearance” (外观/出现) 指某物呈现出来的样子或某人/物的出现，强调表象或存在，不一定涉及视觉感知。而 “sight” 明确指通过眼睛看到的行为或结果，具有更强的感官直接性。"
    }
  ]
}