{
  "word": "sighted",
  "pronunciation": "sahy·tuhd",
  "concise_definition": "adj. 有视力的, 看见的; v. (sight 的过去式和过去分词) 看见, 目击",
  "forms": {
    "base_form": "sight",
    "past_tense": "sighted",
    "past_participle": "sighted",
    "present_participle": "sighting",
    "third_person_singular": "sights"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having the ability to see; possessing normal or functional vision, as opposed to being blind or visually impaired.",
      "explanation_cn": "具有视觉能力的；拥有正常或功能性的视力，与失明或视力障碍相对。",
      "example_en": "The sighted participants were asked to describe the painting, while the blind participants relied on touch.",
      "example_cn": "有视力的参与者被要求描述这幅画，而盲人参与者则依靠触觉。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used in compound terms to indicate that something has been observed or detected visually, especially in scientific or observational contexts.",
      "explanation_cn": "用于复合词中，表示某物已被视觉观察或探测到，尤其在科学或观测语境中。",
      "example_en": "The team confirmed the sighting of a rare bird species during their expedition.",
      "example_cn": "团队在考察期间确认目击了一种稀有鸟类。"
    },
    {
      "pos": "verb",
      "explanation_en": "To see or observe something, especially for the first time or in a notable context; to catch sight of.",
      "explanation_cn": "看见或观察到某物，尤其指第一次看到或在显著情境下；瞥见。",
      "example_en": "They sighted land after three weeks at sea.",
      "example_cn": "他们在海上航行三周后终于看到了陆地。"
    },
    {
      "pos": "verb",
      "explanation_en": "To aim or align a weapon, instrument, or device using a sighting mechanism, such as a telescope or scope.",
      "explanation_cn": "使用瞄准装置（如望远镜或瞄准镜）对准目标或调整仪器。",
      "example_en": "The sniper sighted the target through his scope and took the shot.",
      "example_cn": "狙击手通过瞄准镜锁定目标后开枪。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "seen",
      "analysis": "“Seen” (看见) 是动词 “see” 的过去分词，泛指视觉感知的结果，强调经历或状态。而 “sighted” 更强调主动、有意识地观察或发现，尤其用于正式、科学或技术语境，如目击动物、瞄准目标等，语义更具体、更具动作性。"
    },
    {
      "word_to_compare": "observed",
      "analysis": "“Observed” (观察) 指系统性、有目的的注意和记录，常用于科学研究，强调过程和方法。而 “sighted” 更侧重于视觉上的瞬间发现或确认，不一定包含持续的分析或记录，语义更轻、更直接。"
    },
    {
      "word_to_compare": "visual",
      "analysis": "“Visual” (视觉的) 是形容词，描述与视觉相关的事物，如视觉信息、视觉效果，不表示主体是否具备视力或是否看见了某物。而 “sighted” 明确指主体具有视觉能力或完成了视觉确认，是关于主体状态或行为的判断。"
    }
  ]
}