{
  "word": "signs",
  "pronunciation": "sīnz",
  "concise_definition": "n. 征兆, 标志, 符号, 招牌",
  "forms": {
    "singular": "sign"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A visible object, symbol, or phenomenon that indicates the presence, existence, or likelihood of something else, often used to convey information or warn of a condition.",
      "explanation_cn": "指一个可见的物体、符号或现象，用以表明另一事物的存在、发生或可能性，常用于传递信息或警示某种状况。",
      "example_en": "Dark clouds are a sign that a storm is coming.",
      "example_cn": "乌云是暴风雨即将来临的征兆。"
    },
    {
      "pos": "noun",
      "explanation_en": "A symbol or mark used to represent a concept, object, or instruction, especially in communication or navigation.",
      "explanation_cn": "指用于代表某个概念、物体或指令的符号或标记，尤其在沟通或导航中使用。",
      "example_en": "The stop sign at the intersection prevents accidents.",
      "example_cn": "路口的停车标志防止了事故的发生。"
    },
    {
      "pos": "noun",
      "explanation_en": "A board or display with writing or images used to advertise a business or provide directions.",
      "explanation_cn": "指带有文字或图像的标牌，用于广告宣传企业或提供方向指引。",
      "example_en": "We passed a sign for the nearest gas station.",
      "example_cn": "我们经过了一个指向最近加油站的招牌。"
    },
    {
      "pos": "noun",
      "explanation_en": "In astrology or medicine, a celestial configuration or physical symptom that is interpreted as indicating a particular condition or influence.",
      "explanation_cn": "在占星术或医学中，指被解释为预示某种状况或影响的天体配置或身体症状。",
      "example_en": "Her fever and cough are signs of a viral infection.",
      "example_cn": "她的发烧和咳嗽是病毒感染的体征。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "symbol",
      "analysis": "“Symbol” (符号) 更强调抽象的、约定俗成的代表关系，如心形代表爱、鸽子代表和平，其意义往往依赖文化背景。而 “sign” 更侧重于实际可观察的、具有指示功能的迹象或标记，常与因果或预测相关。"
    },
    {
      "word_to_compare": "indicator",
      "analysis": "“Indicator” (指示器) 多用于技术、经济或科学语境，指可测量、可量化的数据或装置，如交通灯、经济指标。它更客观、系统化；而 “sign” 更口语化、广泛，可用于自然现象、情绪或健康等非量化情境。"
    },
    {
      "word_to_compare": "mark",
      "analysis": "“Mark” (痕迹、标记) 指物理上留下的印迹或记号，如划痕、记号笔的标记，强调其物理存在。而 “sign” 不一定有物理形态，可以是抽象的征兆（如沉默是愤怒的信号），其功能是传达意义而非单纯留下痕迹。"
    }
  ]
}