{
  "word": "signaling",
  "pronunciation": "sīn·əl·iŋ",
  "concise_definition": "n. 信号传递, 信号发送; v. 发信号, 传达信息",
  "forms": {
    "base_form": "signal",
    "third_person_singular": "signals",
    "past_tense": "signaled",
    "past_participle": "signaled",
    "present_participle": "signaling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of transmitting information through signals, often non-verbal or indirect, to convey intent, status, or condition to others; commonly used in biology, economics, and social sciences.",
      "explanation_cn": "通过信号（通常是非语言或间接方式）向他人传递意图、地位或状态的行为；常用于生物学、经济学和社会科学中。",
      "example_en": "In evolutionary biology, peacock feathers are a classic example of signaling to attract mates.",
      "example_cn": "在进化生物学中，孔雀的羽毛是吸引配偶的典型信号传递行为。"
    },
    {
      "pos": "noun",
      "explanation_en": "A signal or set of signals sent to communicate a specific message, often to influence perception or behavior in a strategic context.",
      "explanation_cn": "为传达特定信息而发出的信号或信号集合，常用于策略性情境中以影响他人的认知或行为。",
      "example_en": "The company's decision to hire a high-profile CEO was seen as signaling confidence in its future growth.",
      "example_cn": "该公司聘请一位知名首席执行官的决定被视为对其未来增长充满信心的信号。"
    },
    {
      "pos": "verb",
      "explanation_en": "To send a signal, either physically (e.g., with lights or gestures) or metaphorically (e.g., through actions or choices), to communicate information intentionally.",
      "explanation_cn": "通过物理方式（如灯光或手势）或隐喻方式（如通过行动或选择）有意识地发送信号以传达信息。",
      "example_en": "She signaled to the driver to stop by raising her hand.",
      "example_cn": "她举起手向司机示意停车。"
    },
    {
      "pos": "verb",
      "explanation_en": "To indicate or suggest something indirectly through behavior, appearance, or choice, often to convey unspoken information.",
      "explanation_cn": "通过行为、外表或选择间接表明或暗示某种信息，通常用于传达未言明的内容。",
      "example_en": "Wearing formal attire to the meeting was signaling respect for the occasion.",
      "example_cn": "在会议上穿着正式服装，是在传达对场合的尊重。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "communication",
      "analysis": "“Communication”（交流）是一个更广泛的术语，泛指任何形式的信息传递，包括语言、文字、表情等。而 “signaling” 更强调非直接、非语言或象征性的信息传递，常带有策略性或隐含意图，尤其在博弈论或生物学语境中。"
    },
    {
      "word_to_compare": "indication",
      "analysis": "“Indication”（迹象）指某种可观察的现象或线索，通常被动地被解读，不必然包含发送者的意图。而 “signaling” 强调发送者主动发出信号以影响接收者，具有目的性和策略性。例如，乌云是降雨的“indication”，而司机打转向灯是“signaling”。"
    },
    {
      "word_to_compare": "cue",
      "analysis": "“Cue”（提示）通常指在表演、社交或心理情境中触发特定反应的外部刺激，多为即时、情境化的线索。而 “signaling” 更广泛，可包含长期、重复或制度化的信息传递行为，如企业通过分红政策向市场传递财务稳健的信号。"
    }
  ]
}