{
  "word": "signaled",
  "pronunciation": "sīn·əl·əd",
  "concise_definition": "v. 发信号, 暗示, 打手势",
  "forms": {
    "base_form": "signal",
    "third_person_singular": "signals",
    "present_participle": "signaling",
    "past_tense": "signaled",
    "past_participle": "signaled"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To communicate a message, intention, or instruction non-verbally, often through gestures, lights, sounds, or symbols, especially in situations where direct speech is impractical or prohibited.",
      "explanation_cn": "通过手势、灯光、声音或符号等非语言方式传达信息、意图或指令，尤其在无法或不宜直接说话的情况下。",
      "example_en": "The driver signaled left before turning into the side street.",
      "example_cn": "司机在拐进侧街前打出了左转信号。"
    },
    {
      "pos": "verb",
      "explanation_en": "To indicate or suggest something indirectly, often through subtle cues or contextual hints rather than explicit statements.",
      "explanation_cn": "通过微妙的线索或上下文暗示某种信息，而非直接陈述。",
      "example_en": "Her hesitation signaled that she wasn't fully convinced by the argument.",
      "example_cn": "她的犹豫暗示她并未完全信服这个论点。"
    },
    {
      "pos": "verb",
      "explanation_en": "To send a formal or coded message, especially in military, maritime, or emergency contexts, using standardized signals such as flags, radio, or lights.",
      "explanation_cn": "在军事、航海或紧急情况下，使用旗帜、无线电或灯光等标准化信号发送正式或编码的信息。",
      "example_en": "The ship signaled its position to the coast guard using Morse code.",
      "example_cn": "那艘船用摩尔斯电码向海岸警卫队发送了其位置信号。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "indicated",
      "analysis": "“Indicated” (表明) 更广泛地用于任何方式的提示或显示，包括文字、数据、图表或语言陈述，强调客观呈现信息。而 “signaled” 更侧重于非语言、主动传递的意图或暗示，常带有策略性或隐蔽性。"
    },
    {
      "word_to_compare": "gestured",
      "analysis": "“Gestured” (做手势) 专指用身体动作（如挥手、点头）传达信息，是 “signaled” 的一种具体形式。而 “signaled” 的范围更广，可包括灯光、声音、符号等非肢体方式。"
    },
    {
      "word_to_compare": "hinted",
      "analysis": "“Hinted” (暗示) 通常指含蓄、委婉地透露信息，常用于言语或文字语境，带有试探性或模糊性。而 “signaled” 更强调一种明确、可被接收者识别的信号行为，即使不直接说出，也更倾向于清晰传达意图。"
    }
  ]
}