{
  "word": "signing",
  "pronunciation": "sīn·iŋ",
  "concise_definition": "n. 签署, 签名, 签约行为",
  "forms": {
    "base_form": "sign",
    "past_tense": "signed",
    "past_participle": "signed",
    "present_participle": "signing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of affixing one's signature to a document, contract, or agreement to indicate consent, authorization, or legal obligation.",
      "explanation_cn": "指在文件、合同或协议上签署姓名，以表示同意、授权或承担法律责任的行为。",
      "example_en": "The signing of the treaty marked the end of decades of conflict.",
      "example_cn": "条约的签署标志着数十年冲突的结束。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process or event of a person, especially a celebrity or athlete, signing autographs for fans.",
      "explanation_cn": "指某人（尤其是名人或运动员）为粉丝签名的活动或过程。",
      "example_en": "The signing at the bookstore drew hundreds of eager fans waiting in line.",
      "example_cn": "书店的签名活动吸引了数百名热情的粉丝排队等候。"
    },
    {
      "pos": "noun",
      "explanation_en": "In the context of deaf communication, the use of hand gestures and movements to convey meaning, as in American Sign Language (ASL); often used in plural form 'signings' to refer to performances or events.",
      "explanation_cn": "在聋人交流语境中，指使用手势和动作传达意义的行为，如美国手语（ASL）；常以复数形式 'signings' 指代表演或活动。",
      "example_en": "The theater hosted a bilingual performance with live signing for the deaf audience.",
      "example_cn": "剧院举办了一场双语演出，为听障观众提供现场手语翻译。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "signature",
      "analysis": "“Signature”（签名）是名词，指签署后留下的具体符号或笔迹，是“signing”行为的结果。而 “signing” 强调的是签署这一动作或事件本身。例如：He put his signature on the contract（他在合同上签了名） vs. The signing took place at noon（签署仪式在中午举行）。"
    },
    {
      "word_to_compare": "autograph",
      "analysis": "“Autograph”（亲笔签名）特指名人或公众人物为粉丝签署的名字，通常带有纪念意义，是 “signing” 在娱乐语境中的具体表现形式。而 “signing” 是更广泛的术语，可涵盖法律文件、合同等正式签署行为。"
    },
    {
      "word_to_compare": "gesture",
      "analysis": "“Gesture”（手势）泛指任何身体动作表达意思，包括非语言交流中的挥手、点头等。而 “signing” 在手语语境中特指系统化、语法化的手语表达，如 ASL，具有语言结构，远比一般手势复杂和规范。"
    }
  ]
}