{
  "word": "silver",
  "pronunciation": "sil·vər",
  "concise_definition": "n. 银, 银色, 银器; adj. 银色的, 银制的",
  "forms": {
    "plural": "silvers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A precious metallic element with the chemical symbol Ag, known for its bright, lustrous appearance, high electrical and thermal conductivity, and use in jewelry, coins, and tableware.",
      "explanation_cn": "一种化学符号为 Ag 的贵金属元素，以其明亮有光泽的外观、优异的导电性和导热性著称，常用于制作珠宝、硬币和餐具。",
      "example_en": "She wore a delicate silver necklace that had been passed down through generations.",
      "example_cn": "她戴着一条精致的银项链，这是家族世代相传的珍品。"
    },
    {
      "pos": "noun",
      "explanation_en": "The color resembling the metallic element silver, often described as a pale, cool gray with a reflective sheen.",
      "explanation_cn": "指类似于银金属的颜色，通常被描述为一种带有反光光泽的浅冷灰色。",
      "example_en": "The moonlight cast a silver glow over the lake.",
      "example_cn": "月光为湖面洒下了一层银色的光辉。"
    },
    {
      "pos": "noun",
      "explanation_en": "Items made of silver, especially decorative or functional objects such as cutlery, trays, or ceremonial vessels.",
      "explanation_cn": "指由银制成的物品，尤指餐具、托盘或仪式用器皿等装饰性或功能性器物。",
      "example_en": "The family heirloom included a set of antique silver tea service.",
      "example_cn": "这家族传家宝中包括一套古董银茶具。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Of, made from, or having the color of silver; often used to describe objects, tones, or appearances with a metallic or pale gray luster.",
      "explanation_cn": "指由银制成的、具有银色的，或与银颜色相似的；常用于描述具有金属光泽或浅灰冷色调的物体、音色或外观。",
      "example_en": "He had a silver tongue and could persuade anyone with his words.",
      "example_cn": "他口才出众，能用言辞说服任何人。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "metal",
      "analysis": "“Metal”（金属）是一个广义类别，涵盖铁、铜、铝等所有金属元素，而 “silver” 是其中一种具体的金属，具有独特的物理和美学特性。使用 “metal” 时通常不特指银，而 “silver” 则明确指向该元素及其相关属性。"
    },
    {
      "word_to_compare": "white",
      "analysis": "“White”（白色）是纯粹的无彩色，常用于描述光或纸张的明亮色调；而 “silver” 是一种带有冷调和金属反光的浅灰色，具有更复杂的视觉质感。在描述颜色时，silver 比 white 更强调光泽和金属感。"
    },
    {
      "word_to_compare": "platinum",
      "analysis": "“Platinum”（铂金）也是一种贵金属，外观与银相似，但颜色更灰白、更沉稳，密度和价值更高。银更常见、更易氧化变黑，而铂金更耐腐蚀，常用于高端珠宝。两者虽同为贵重金属，但银更具日常性和历史普及性。"
    }
  ]
}