{
  "word": "sing",
  "pronunciation": "sing",
  "concise_definition": "v. 唱歌, 唱曲; n. 唱歌的行为",
  "forms": {
    "third_person_singular": "sings",
    "past_tense": "sang",
    "past_participle": "sung",
    "present_participle": "singing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To produce musical sounds with the voice, typically following a melody and often with lyrics, as an art form or expression of emotion.",
      "explanation_cn": "用嗓音发出带有旋律和（通常）歌词的音乐声音，作为一种艺术形式或情感表达方式。",
      "example_en": "She sings beautifully in the church choir every Sunday.",
      "example_cn": "她每周日在教堂唱诗班里唱得非常动听。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a sound that resembles singing, such as the whistling of wind or the humming of machinery.",
      "explanation_cn": "发出类似歌唱的声音，如风的呼啸或机器的嗡鸣。",
      "example_en": "The kettle began to sing as the water boiled.",
      "example_cn": "水烧开时，水壶开始发出鸣响。"
    },
    {
      "pos": "verb",
      "explanation_en": "To confess or reveal information under pressure, especially in a legal or interrogative context.",
      "explanation_cn": "在压力下招供或透露信息，尤指在法律或审讯情境中。",
      "example_en": "After hours of questioning, the suspect finally sang and named his accomplices.",
      "example_cn": "经过数小时的审问，嫌疑人终于招供并供出了同伙。"
    },
    {
      "pos": "noun",
      "explanation_en": "An informal term for a singing performance or a session of singing, often used in phrases like 'give a sing'.",
      "explanation_cn": "非正式用语，指一次歌唱表演或唱歌活动，常用于短语如 'give a sing'。",
      "example_en": "We had a little sing around the campfire last night.",
      "example_cn": "昨晚我们在篝火旁唱了一小会儿歌。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "chant",
      "analysis": "“Chant”（吟唱）强调重复的、节奏性强的、通常无旋律的发声，常用于宗教、仪式或抗议场合，具有集体性和仪式感。而 “sing” 更广泛，包含旋律、情感表达和艺术性，不限于重复结构。"
    },
    {
      "word_to_compare": "hum",
      "analysis": "“Hum”（哼唱）指无歌词、低音量、持续的、通常无意识的发声，常用于表达情绪或打发时间，声音较单调。而 “sing” 是有意识、有旋律、可能包含歌词的完整音乐表达。"
    },
    {
      "word_to_compare": "yodel",
      "analysis": "“Yodel”（约德尔唱法）是一种特定的歌唱技巧，通过在胸声和头声之间快速切换来产生跳跃音效，是“sing”的一种特殊形式，具有地域文化特征。而 “sing” 是通用术语，涵盖所有类型的声乐表达。"
    }
  ]
}