{
  "word": "sink",
  "pronunciation": "sɪŋk",
  "concise_definition": "v. 下沉, 沉没; n. 水槽, 洗涤槽",
  "forms": {
    "third_person_singular": "sinks",
    "past_tense": "sank",
    "past_participle": "sunk",
    "present_participle": "sinking"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move downward and become submerged, especially in a liquid or soft substance, often due to weight, loss of buoyancy, or external force.",
      "explanation_cn": "指因重量、浮力丧失或外力作用而向下移动并被液体或松软物质淹没。",
      "example_en": "The ship sank rapidly after hitting the iceberg.",
      "example_cn": "船撞上冰山后迅速沉没。"
    },
    {
      "pos": "verb",
      "explanation_en": "To decline in value, quality, or condition; to deteriorate or become worse over time.",
      "explanation_cn": "指价值、质量或状况下降；随着时间推移而恶化。",
      "example_en": "His spirits sank after hearing the bad news.",
      "example_cn": "听到这个坏消息后，他的情绪低落了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to be absorbed or accepted, especially money or effort, often unwillingly or at great cost.",
      "explanation_cn": "指投入（金钱、精力等），常带有不情愿或巨大代价的意味。",
      "example_en": "They sank thousands of dollars into renovating the old house.",
      "example_cn": "他们花了数千美元翻新这栋老房子。"
    },
    {
      "pos": "noun",
      "explanation_en": "A fixed basin, usually made of porcelain, stainless steel, or stone, installed in a kitchen or bathroom for washing dishes, hands, or other items, with running water and a drain.",
      "explanation_cn": "一种固定式水槽，通常由陶瓷、不锈钢或石材制成，安装在厨房或浴室中，用于清洗餐具、双手或其他物品，配有自来水和排水口。",
      "example_en": "She washed the dishes in the kitchen sink.",
      "example_cn": "她把盘子放在厨房水槽里洗了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "drown",
      "analysis": "“Drown” (淹死) 专指因被液体（尤其是水）淹没而导致窒息死亡，强调生命体的死亡结果，主语通常是人或动物。而 “sink” 仅描述物体下沉的过程，不必然导致毁灭或死亡，且可指非生命体。"
    },
    {
      "word_to_compare": "plummet",
      "analysis": "“Plummet” (骤降) 强调速度极快的垂直下降，常用于价格、温度或数量的急剧下跌，具有强烈的动态感和突然性。而 “sink” 的下降更缓慢、持续，且常带有沉重、无力或不可逆的意味，适用范围更广，包括抽象概念。"
    },
    {
      "word_to_compare": "basin",
      "analysis": "“Basin” (盆、盆地) 是一个更广泛的容器或凹陷区域的统称，可指自然地貌（如河流盆地）或人工容器（如洗脸盆），不一定有排水功能。而 “sink” 特指带有水龙头和排水系统的固定洗涤槽，功能明确，语义更具体。"
    }
  ]
}