{
  "word": "sinks",
  "pronunciation": "sɪŋks",
  "concise_definition": "n. 水槽, 洗涤槽; v. 下沉, 沉没, 使沉没",
  "forms": {
    "third_person_singular": "sinks",
    "past_tense": "sank",
    "past_participle": "sunk",
    "present_participle": "sinking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A fixed basin, typically made of porcelain, stainless steel, or stone, installed in kitchens or bathrooms for washing hands, dishes, or other items, with a drain and often connected to water supply.",
      "explanation_cn": "一种固定安装的水槽，通常由陶瓷、不锈钢或石材制成，用于厨房或浴室中洗手、洗碗或其他物品，配有排水口并连接供水系统。",
      "example_en": "She washed the dishes in the kitchen sink.",
      "example_cn": "她把盘子放在厨房水槽里洗了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A natural depression in the ground, especially one that collects water or serves as a drainage point, such as a sinkhole or a wetland basin.",
      "explanation_cn": "地表上的自然凹陷，尤其指能汇集水流或作为排水点的区域，如落水洞或湿地盆地。",
      "example_en": "The hiking trail passed by a large sinkhole that had formed after heavy rains.",
      "example_cn": "徒步小径经过一个大雨后形成的大型落水洞。"
    },
    {
      "pos": "verb",
      "explanation_en": "To descend or cause something to descend below the surface of a liquid or the ground, often due to weight, damage, or gravity.",
      "explanation_cn": "因重量、损坏或重力等原因，使某物下降或使其沉入液体表面或地面以下。",
      "example_en": "The old boat began to sink after hitting a rock.",
      "example_cn": "那艘旧船撞上岩石后开始下沉。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fall into a state of decline, despair, or deterioration, often used metaphorically to describe emotional or economic conditions.",
      "explanation_cn": "比喻性地指陷入衰退、绝望或恶化状态，常用于描述情绪或经济状况的恶化。",
      "example_en": "After losing his job, he sank into a deep depression.",
      "example_cn": "失业后，他陷入了深深的抑郁。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "basin",
      "analysis": "“Basin”（盆、盆地）泛指任何用于盛水或收集液体的凹形容器或地形，可以是便携的（如洗脸盆）或自然形成的（如河流盆地）。而 “sink” 特指固定安装在建筑中的洗涤水槽，功能更具体，通常与供水和排水系统相连。"
    },
    {
      "word_to_compare": "drown",
      "analysis": "“Drown”（淹死）强调因液体进入呼吸道而导致死亡，通常用于人或动物，带有致命后果。而 “sink” 仅指物体或人因重力沉入液体中，不一定导致死亡，如船只沉没、石头沉底。"
    },
    {
      "word_to_compare": "plunge",
      "analysis": "“Plunge”（猛冲、骤降）强调快速、突然、剧烈的向下动作，常用于描述情绪或物理位置的急剧变化，如“plunge into debt”或“plunge into water”。而 “sink” 更缓慢、持续，强调最终状态的沉没或陷入，语气更沉稳、被动。"
    }
  ]
}