{
  "word": "sinking",
  "pronunciation": "sīŋ·kɪŋ",
  "concise_definition": "adj. 下沉的, 令人沮丧的; n. 下沉, 沉没",
  "forms": {
    "base_form": "sink",
    "past_tense": "sank",
    "past_participle": "sunk",
    "present_participle": "sinking"
  },
  "definitions": [
    {
      "pos": "verb (present participle)",
      "explanation_en": "The action of moving downward through a liquid or gas, typically due to gravity or loss of buoyancy; often used to describe a vessel or object descending beneath a surface.",
      "explanation_cn": "指由于重力或浮力丧失而向下穿过液体或气体的运动，常用于描述船只或物体沉入表面以下的过程。",
      "example_en": "The ship was sinking rapidly after hitting the iceberg.",
      "example_cn": "船撞上冰山后迅速下沉。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing a feeling of deep sadness, hopelessness, or decline; often used metaphorically to convey emotional or moral deterioration.",
      "explanation_cn": "形容一种深深的悲伤、绝望或衰落感；常用于隐喻，表达情绪或道德上的恶化。",
      "example_en": "She had a sinking feeling that something terrible had happened.",
      "example_cn": "她有一种不祥的预感，觉得发生了可怕的事情。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process or event of something sinking, especially a ship or structure going under water; can also refer to the act of declining in value or status.",
      "explanation_cn": "指某物下沉的过程或事件，尤指船只或结构沉入水中；也可指价值或地位的下降。",
      "example_en": "The sinking of the Titanic remains one of the most famous maritime disasters in history.",
      "example_cn": "泰坦尼克号的沉没是历史上最著名的海难之一。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "descending",
      "analysis": "“Descending”（下降）是一个更中性、更广泛的术语，可用于任何方向向下的运动，如楼梯、飞机或温度。它不隐含物理沉没或液体介质，也不带有情感色彩。而 “sinking” 通常特指在液体中下沉，且常带有负面或失控的意味。"
    },
    {
      "word_to_compare": "dropping",
      "analysis": "“Dropping”（掉落/下降）强调从高处向低处的快速或突然移动，常用于物体、价格或温度，但不涉及浸入液体或浮力丧失。它更短促、更直接，而 “sinking” 暗示持续、缓慢且可能不可逆的过程。"
    },
    {
      "word_to_compare": "declining",
      "analysis": "“Declining”（衰退/下降）主要用于抽象概念，如健康、经济、数量或态度，强调趋势性的减弱。而 “sinking” 在用作形容词时，更富情感张力，常用于表达直觉性的恐惧或绝望，如 “a sinking feeling”，这是 “declining” 所不具备的强烈心理意象。"
    }
  ]
}