{
  "word": "siren",
  "pronunciation": "sahy·ruhn",
  "concise_definition": "n. 警报器, 塞壬女妖, 吸引人的事物",
  "forms": {
    "plural": "sirens"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A loud, wailing sound-producing device, typically mounted on emergency vehicles such as ambulances, police cars, or fire trucks, used to alert people of danger or to request right-of-way.",
      "explanation_cn": "一种发出刺耳鸣响的装置，通常安装在救护车、警车或消防车等应急车辆上，用于警示人们注意危险或请求优先通行权。",
      "example_en": "The siren blared as the ambulance raced through the intersection.",
      "example_cn": "救护车疾驰通过十字路口时，警报器发出刺耳的鸣响。"
    },
    {
      "pos": "noun",
      "explanation_en": "In Greek mythology, a dangerous sea nymph whose enchanting song lured sailors to their doom by causing them to crash their ships on rocky shores.",
      "explanation_cn": "在希腊神话中，一种危险的海中女妖，以其迷人的歌声引诱水手触礁沉船，导致死亡。",
      "example_en": "The singer's voice was like a siren, irresistible and dangerously alluring.",
      "example_cn": "这位歌手的声音如同塞壬，令人无法抗拒，却又充满危险。"
    },
    {
      "pos": "noun",
      "explanation_en": "Something that is highly attractive or tempting, often in a way that leads to danger or distraction.",
      "explanation_cn": "指某种极具吸引力或诱惑力的事物，往往会导致危险或分心。",
      "example_en": "For many young people, the promise of quick wealth is a siren call that distracts them from long-term goals.",
      "example_cn": "对许多年轻人来说，快速致富的承诺就像塞壬的歌声，使他们偏离了长期目标。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "alarm",
      "analysis": "“Alarm”（警报）泛指任何发出警告信号的装置或系统，可以是声音、灯光或电子提示，用途广泛，不特指高音鸣响。而 “siren” 特指那种尖锐、连续、穿透力强的警报声，常用于紧急车辆或军事场景，更具声音特征和紧迫感。"
    },
    {
      "word_to_compare": "mermaid",
      "analysis": "“Mermaid”（美人鱼）是神话中上半身为女性、下半身为鱼的生物，通常被描绘为美丽、友善或神秘的形象。而 “siren” 在神话中是具有致命诱惑力的危险生物，其核心特征是用歌声引诱并毁灭水手，强调的是诱惑与毁灭的双重性，而非单纯的外貌美。"
    },
    {
      "word_to_compare": "temptation",
      "analysis": "“Temptation”（诱惑）是抽象名词，泛指任何引诱人偏离正道或做出错误选择的力量。而 “siren” 作为比喻时，是一个具象化的象征，常用于文学或修辞中，赋予诱惑以声音、形象和神话色彩，比 “temptation” 更富诗意和文化内涵。"
    }
  ]
}