{
  "word": "skating",
  "pronunciation": "skey·ting",
  "concise_definition": "n. 滑冰, 滑旱冰; v. 滑冰, 滑行",
  "forms": {
    "base_form": "skate",
    "third_person_singular": "skates",
    "past_tense": "skated",
    "past_participle": "skated",
    "present_participle": "skating"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The activity or sport of moving on ice or a hard surface using skates, typically for recreation, competition, or transportation.",
      "explanation_cn": "指使用冰刀或旱冰鞋在冰面或硬质表面上滑行的活动或运动，通常用于休闲、竞技或交通。",
      "example_en": "She spends every winter weekend practicing figure skating at the local rink.",
      "example_cn": "她每个冬季周末都在本地滑冰场练习花样滑冰。"
    },
    {
      "pos": "noun",
      "explanation_en": "A style or type of skating, such as ice skating, roller skating, or speed skating, often used in compound forms.",
      "explanation_cn": "指滑冰的某种类型或风格，如花样滑冰、轮滑或速度滑冰，常用于复合词中。",
      "example_en": "Inline skating has become increasingly popular among teenagers in urban areas.",
      "example_cn": "直排轮滑在城市青少年中越来越受欢迎。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move on ice or a hard surface using skates, either as a physical activity or as part of a performance.",
      "explanation_cn": "指使用冰刀或旱冰鞋在冰面或硬质表面上滑行，作为一项体育活动或表演的一部分。",
      "example_en": "The children were skating on the frozen pond, laughing as they glided across the ice.",
      "example_cn": "孩子们在结冰的池塘上滑冰，滑行时发出欢笑声。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move smoothly and quickly over a surface, often metaphorically, as if gliding without effort.",
      "explanation_cn": "指在表面上平稳快速地移动，常用于比喻，形容轻松自如、毫不费力地完成某事。",
      "example_en": "He managed to skate through the exam without studying much.",
      "example_cn": "他没怎么复习就轻松通过了考试。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sliding",
      "analysis": "“Sliding” (滑动) 是一个更广泛的物理动作，指任何物体在表面因摩擦力减小而移动，不依赖于特定工具（如冰刀）。它可以是无意识的（如人滑倒）或机械性的（如抽屉滑动）。而 “skating” 特指使用滑冰工具进行的有目的、受控的滑行运动，具有明确的运动形式和文化背景。"
    },
    {
      "word_to_compare": "gliding",
      "analysis": "“Gliding” (滑翔/滑行) 强调一种轻盈、流畅、几乎无阻力的运动状态，常用于描述鸟类飞行、飞机滑翔或冰上动作的优雅感。它更侧重于运动的质感和美感，而 “skating” 是一个具体的运动行为，包含工具、场地和规则。在比喻用法中两者可互换，但 “gliding” 更诗意，而 “skating” 更具动作性。"
    },
    {
      "word_to_compare": "rollerblading",
      "analysis": "“Rollerblading” 是 “skating” 的一个子类，特指使用直排轮滑鞋进行的滑行活动。虽然常被当作同义词使用，但 “skating” 是上位词，涵盖冰上滑冰、旱冰、花样滑冰等多种形式。使用 “rollerblading” 时语义更具体，而 “skating” 更通用，可能指任何类型的滑行运动。"
    }
  ]
}