{
  "word": "skeletons",
  "pronunciation": "ske·luh·tuhnz",
  "concise_definition": "n. 骨架, 骨骼, 轮廓, 底稿",
  "forms": {
    "singular": "skeleton"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The internal framework of bones that supports the body of a vertebrate animal, providing structure, protection, and attachment points for muscles.",
      "explanation_cn": "脊椎动物体内支撑身体的骨性结构框架，提供形态支撑、保护内脏器官，并作为肌肉附着的支点。",
      "example_en": "The museum displayed a complete skeleton of a Tyrannosaurus rex.",
      "example_cn": "博物馆展出了完整的霸王龙骨架。"
    },
    {
      "pos": "noun",
      "explanation_en": "A bare or minimal outline or structure of something, lacking detail or substance, often used metaphorically to describe the basic framework of a plan, story, or system.",
      "explanation_cn": "指某事物的最基本轮廓或结构，缺乏细节或实质内容，常用于比喻计划、故事或系统的初步框架。",
      "example_en": "She wrote a skeleton of the report before filling in the details.",
      "example_cn": "她在补充细节之前先写出了报告的提纲。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that appears thin, gaunt, or lifeless, often evoking an image of death or decay; sometimes used humorously or figuratively.",
      "explanation_cn": "指人或物显得瘦骨嶙峋、憔悴或毫无生气，常让人联想到死亡或腐朽；有时用于幽默或比喻性表达。",
      "example_en": "After the long fast, he looked like a walking skeleton.",
      "example_cn": "长时间禁食后，他看起来像个行尸走肉。"
    },
    {
      "pos": "noun",
      "explanation_en": "In computing or engineering, a basic, unfinished model or prototype that serves as the foundational structure for further development.",
      "explanation_cn": "在计算机或工程领域，指作为进一步开发基础的初步模型或原型，尚未完成细节设计。",
      "example_en": "The engineers built a skeleton of the bridge to test load distribution before adding the final supports.",
      "example_cn": "工程师们先搭建了桥梁的骨架，以测试荷载分布，然后再添加最终的支撑结构。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "frame",
      "analysis": "“Frame”（框架）泛指任何支撑结构，可以是木质、金属或抽象的组织结构，不一定由骨骼组成，也不一定暗示“缺失细节”。而 “skeleton” 更强调“基础性”和“裸露性”，常带有未完成、简略或令人联想到死亡的隐喻色彩。"
    },
    {
      "word_to_compare": "outline",
      "analysis": "“Outline”（提纲/轮廓）主要指文字或计划的要点结构，强调逻辑顺序和要点，通常用于写作或演讲准备，是主动构建的摘要。而 “skeleton” 在比喻用法中更偏向于“原始、粗糙、未填充”的状态，常暗示后续需大量补充内容。"
    },
    {
      "word_to_compare": "structure",
      "analysis": "“Structure”（结构）是一个更广泛、中性的术语，指任何有组织的系统或排列方式，可以是物理的、社会的或抽象的，不带有“简化”或“死亡”的联想。而 “skeleton” 特指结构中最核心、最基础、最简化的部分，常隐含“缺乏血肉”或“未完善”的意味。"
    }
  ]
}