{
  "word": "sketch",
  "pronunciation": "sketch",
  "concise_definition": "n. 草图, 素描, 梗概; v. 画草图, 简述",
  "forms": {
    "third_person_singular": "sketches",
    "past_tense": "sketched",
    "past_participle": "sketched",
    "present_participle": "sketching"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A quick, rough drawing made to capture the essential features of a subject, often as a preliminary study or for artistic expression.",
      "explanation_cn": "指为捕捉主体基本特征而快速绘制的粗略图画，常作为初步研究或艺术表达的手段。",
      "example_en": "The artist made a quick sketch of the landscape before starting the oil painting.",
      "example_cn": "这位艺术家在开始油画创作前，快速画了一幅风景草图。"
    },
    {
      "pos": "noun",
      "explanation_en": "A brief, informal description or outline of something, such as a plan, idea, or performance.",
      "explanation_cn": "指对某事物（如计划、想法或表演）的简要、非正式的描述或提纲。",
      "example_en": "She gave a sketch of her proposal during the meeting.",
      "example_cn": "她在会议上简要介绍了她的提案。"
    },
    {
      "pos": "noun",
      "explanation_en": "A short comedic performance, often part of a larger show, featuring exaggerated characters or situations.",
      "explanation_cn": "指一种短小的喜剧表演，常作为大型演出的一部分，以夸张的角色或情境为特点。",
      "example_en": "The comedy show included a hilarious sketch about office life.",
      "example_cn": "这场喜剧演出包含了一个关于办公室生活的滑稽小品。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a quick, rough drawing of something, typically without detailed refinement.",
      "explanation_cn": "指快速、粗略地画出某物，通常不进行细致修饰。",
      "example_en": "He sketched the portrait of his friend during the coffee break.",
      "example_cn": "他在咖啡休息时为朋友画了一幅肖像草图。"
    },
    {
      "pos": "verb",
      "explanation_en": "To outline or describe something briefly, especially in speech or writing.",
      "explanation_cn": "指用简短的方式概述或描述某事物，尤其在口语或书面语中。",
      "example_en": "The report sketches the main challenges facing the industry.",
      "example_cn": "这份报告简要概述了该行业面临的主要挑战。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "drawing",
      "analysis": "“Drawing”（绘画）通常指更完整、细致、有明确目的的艺术作品，强调技巧和完成度；而 “sketch” 更强调快速、临时性和未完成的状态，常用于构思或记录灵感。"
    },
    {
      "word_to_compare": "outline",
      "analysis": "“Outline”（提纲）主要指文字性的结构框架，用于组织思想或内容；而 “sketch” 作为名词时，既可以是视觉的草图，也可以是语言上的简略描述，更具表现力和灵活性。"
    },
    {
      "word_to_compare": "doodle",
      "analysis": "“Doodle”（涂鸦）通常指无意识、随意的线条涂画，缺乏明确目的；而 “sketch” 是有意识的、带有意图的简略表达，即使粗糙，也服务于某种表达或创作目标。"
    }
  ]
}