{
  "word": "skid",
  "pronunciation": "skid",
  "concise_definition": "n. 滑移, 打滑; v. 打滑, 滑行",
  "forms": {
    "third_person_singular": "skids",
    "past_tense": "skidded",
    "past_participle": "skidded",
    "present_participle": "skidding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sudden, uncontrolled sliding movement, especially of a vehicle's tires on a slippery surface, often resulting in loss of traction or steering control.",
      "explanation_cn": "指车辆轮胎在湿滑路面上突然失去抓地力而发生的不受控制的滑动，常导致转向失控。",
      "example_en": "The car went into a skid on the icy road and hit the guardrail.",
      "example_cn": "汽车在结冰的路面上打滑，撞上了护栏。"
    },
    {
      "pos": "noun",
      "explanation_en": "A short, thick piece of wood or metal used to support or elevate something, especially in construction or shipping.",
      "explanation_cn": "指用于支撑或抬高物体的短而厚的木块或金属块，常用于建筑或运输中。",
      "example_en": "The pallet was resting on wooden skids to allow forklift access.",
      "example_cn": "托盘放在木制垫木上，以便叉车操作。"
    },
    {
      "pos": "verb",
      "explanation_en": "To slide unintentionally or uncontrollably, especially on a slippery or smooth surface, often due to loss of friction.",
      "explanation_cn": "指在湿滑或光滑表面上无意识或失控地滑动，通常因摩擦力丧失所致。",
      "example_en": "The cyclist skidded on the wet pavement and fell.",
      "example_cn": "骑自行车的人在湿滑的路面上打滑摔倒了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to slide or move abruptly and uncontrolled along a surface.",
      "explanation_cn": "指使某物在表面上突然且不受控制地滑动。",
      "example_en": "The driver skidded the car around the corner to avoid the obstacle.",
      "example_cn": "司机猛打方向盘使汽车在拐角处打滑，以避开障碍物。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "slip",
      "analysis": "“Slip”（滑倒/滑动）泛指任何失去抓地力的滑动，常用于人或物体在光滑表面上的轻微滑动，不一定伴随失控或高速。而 “skid” 更强调车辆或重物在高速或重力作用下的剧烈、失控滑动，通常与交通安全相关。"
    },
    {
      "word_to_compare": "slide",
      "analysis": "“Slide”（滑行）是中性词，可指有控制的、平滑的移动（如滑梯、冰上滑行），不隐含危险或失控。而 “skid” 通常带有负面含义，暗示意外、危险或失去控制，尤其在驾驶语境中。"
    },
    {
      "word_to_compare": "derail",
      "analysis": "“Derail”（脱轨）特指火车脱离轨道，是极端失控的物理事件，通常由外部因素（如轨道损坏）引起。而 “skid” 是轮胎与地面间摩擦力不足导致的横向滑动，不涉及轨道或结构脱离，适用范围更广，包括汽车、自行车等。"
    }
  ]
}