{
  "word": "skies",
  "pronunciation": "skīz",
  "concise_definition": "n. 天空, 天穹 (复数形式)",
  "forms": {
    "singular": "sky"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The upper atmosphere or space as seen from Earth, often referring to the expanse above us that appears blue during the day and holds clouds, stars, and celestial bodies.",
      "explanation_cn": "指从地球表面所见的上层大气或太空，通常表现为白天呈现蓝色的广阔空间，包含云朵、星辰和其他天体。",
      "example_en": "The children looked up at the clear skies and pointed out the shapes of the clouds.",
      "example_cn": "孩子们仰望着晴朗的天空，指出云朵的形状。"
    },
    {
      "pos": "noun",
      "explanation_en": "Used in plural form to emphasize multiple regions or layers of the sky, often in poetic, literary, or figurative contexts to convey vastness, diversity, or changing conditions.",
      "explanation_cn": "以复数形式使用，以强调天空的多个区域或层次，常用于诗歌、文学或比喻语境中，表达广阔、多样或变化的天象。",
      "example_en": "They traveled across distant skies, from the Arctic auroras to the tropical stars.",
      "example_cn": "他们穿越了遥远的天穹，从北极的极光到热带的星空。"
    },
    {
      "pos": "noun",
      "explanation_en": "A metaphorical expression for fate, destiny, or divine power, especially in phrases like 'the skies have smiled' or 'the skies are against us'.",
      "explanation_cn": "用作隐喻，指命运、天意或神力，尤其在如‘苍天垂怜’或‘天不助我’等表达中。",
      "example_en": "After years of hardship, the skies finally smiled upon her with unexpected success.",
      "example_cn": "经历了多年的磨难后，命运终于对她露出了微笑，带来了意想不到的成功。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sky",
      "analysis": "“Sky” 是单数形式，通常指单一、整体的天空，用于日常描述，如 ‘The sky is blue.’ 而 “skies” 作为复数，常用于强调不同区域、时间或状态的天空，更具文学性或象征性，如 ‘mountain skies’ 或 ‘stormy skies’。"
    },
    {
      "word_to_compare": "heavens",
      "analysis": "“Heavens” 与 “skies” 在某些语境中可互换，但 “heavens” 更具宗教或神圣色彩，常指神灵居所或终极的宇宙秩序，如 ‘praise the heavens’。而 “skies” 更偏向物理空间，较少带有宗教含义。"
    },
    {
      "word_to_compare": "atmosphere",
      "analysis": "“Atmosphere” (大气层) 是科学术语，指地球周围的气体层，强调其物理组成和分层结构（如对流层、平流层）。而 “skies” 是日常或诗意用语，不涉及科学定义，更关注视觉体验和情感联想。"
    }
  ]
}