{
  "word": "skinner",
  "pronunciation": "skin·nuhr",
  "concise_definition": "n. 皮肤剥除者, 斯金纳（姓氏）, 斯金纳箱的发明者",
  "forms": {
    "plural": "skinner"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who skins animals, especially as a profession; historically associated with the leather trade or fur industry.",
      "explanation_cn": "指以剥皮为职业的人，尤其指从事皮革或毛皮行业的人。",
      "example_en": "The skinner carefully removed the hide from the fox without damaging the fur.",
      "example_cn": "这名剥皮工小心地将狐狸的皮剥下，未损伤毛皮。"
    },
    {
      "pos": "noun",
      "explanation_en": "A surname, most notably associated with B.F. Skinner (1904–1990), the American psychologist and behaviorist who developed operant conditioning and the Skinner box.",
      "explanation_cn": "姓氏，最著名的是美国心理学家和行为主义者B.F.斯金纳（1904–1990），他提出了操作性条件反射理论并发明了斯金纳箱。",
      "example_en": "Skinner's experiments with rats and pigeons revolutionized the study of learning and behavior.",
      "example_cn": "斯金纳对大鼠和鸽子的实验彻底改变了学习与行为的研究。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device used in behavioral psychology experiments, known as the Skinner box, designed to study operant conditioning by rewarding or punishing animal behavior.",
      "explanation_cn": "指行为心理学实验中用于研究操作性条件反射的装置，即‘斯金纳箱’，通过奖励或惩罚来观察动物行为的改变。",
      "example_en": "The rat learned to press the lever in the Skinner box to receive food pellets.",
      "example_cn": "大鼠学会了在斯金纳箱中按压杠杆以获得食物颗粒。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tanner",
      "analysis": "“Tanner”（制革工）指专门处理动物皮以制成皮革的人，侧重于鞣制和加工过程；而 “skinner” 仅指剥皮阶段，是制革流程的前期步骤。两者在职业链条中是前后关系，但技能和工具完全不同。"
    },
    {
      "word_to_compare": "psychologist",
      "analysis": "“Psychologist”（心理学家）是泛指研究心理过程的专家，而 “Skinner” 作为专有名词特指行为主义学派的代表人物B.F.斯金纳。虽然他是一名心理学家，但“Skinner”一词在心理学语境中已特指其理论和实验装置，具有不可替代的专指性。"
    },
    {
      "word_to_compare": "box",
      "analysis": "“Box”（箱子）是普通名词，指任何容器；而 “Skinner box” 是一个专业术语，特指用于行为实验的标准化装置，其功能、结构和理论背景都与普通箱子截然不同。前者是物理实体，后者是科学工具的专称。"
    }
  ]
}