{
  "word": "skins",
  "pronunciation": "skinz",
  "concise_definition": "n. 皮肤, 外皮, 皮肤层, （复数形式）皮肤制品、外层、（俚语）人",
  "forms": {
    "singular": "skin"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The natural outer covering of the body of a human or animal, serving as a protective barrier against environmental factors.",
      "explanation_cn": "人类或动物身体表面的天然外层，起到抵御环境因素的保护屏障作用。",
      "example_en": "Sunburn can damage the skin and increase the risk of skin cancer.",
      "example_cn": "晒伤会损害皮肤，增加患皮肤癌的风险。"
    },
    {
      "pos": "noun",
      "explanation_en": "The outer layer or covering of an object, often thin and flexible, such as the peel of a fruit or the casing of a drum.",
      "explanation_cn": "指物体的外层或表皮，通常薄而柔韧，如水果的皮或鼓的鼓面。",
      "example_en": "She peeled the skin off the apple before eating it.",
      "example_cn": "她吃苹果前把皮剥掉了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of material made from the tanned or processed hide of an animal, used in clothing, footwear, or accessories.",
      "explanation_cn": "指经过鞣制或加工的动物皮，用于制作服装、鞋履或配饰。",
      "example_en": "He bought a pair of leather boots made from genuine skins.",
      "example_cn": "他买了一双用真皮制成的皮靴。"
    },
    {
      "pos": "noun",
      "explanation_en": "In video games or digital contexts, a customizable visual appearance or theme applied to a character, interface, or object.",
      "explanation_cn": "在电子游戏或数字语境中，指应用于角色、界面或物体的可自定义视觉外观或主题。",
      "example_en": "She bought a rare skin for her favorite character in the game.",
      "example_cn": "她为游戏中自己最喜欢的角色购买了一款稀有皮肤。"
    },
    {
      "pos": "noun",
      "explanation_en": "Slang: A person, often used informally or derogatorily, especially in contexts like 'skinny' (information) or 'skin' as shorthand for 'person'.",
      "explanation_cn": "俚语：指人，常用于非正式或贬义语境，如 'skinny'（内幕消息）或用 'skin' 作为 '人' 的简略说法。",
      "example_en": "He's a good skin to have on your team — always gets the job done.",
      "example_cn": "他是个不错的伙计，团队里有他总能把事办成。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hide",
      "analysis": "“Hide”（兽皮）特指大型动物（如牛、马）未经加工的厚皮，常用于工业或皮革制造语境，强调原始状态；而 “skin” 更通用，可用于所有动物，包括人类，且可指薄层或表皮，语义范围更广。"
    },
    {
      "word_to_compare": "rind",
      "analysis": "“Rind”（外皮）专指坚硬、厚实的植物外皮，如奶酪、西瓜或柑橘类水果的外层，强调质地坚硬；而 “skin” 更常用于柔软、可剥离的表层，如苹果或人的皮肤，适用对象更广泛。"
    },
    {
      "word_to_compare": "shell",
      "analysis": "“Shell”（外壳）指坚硬、脆性或保护性的外层结构，如蛋壳、坚果壳或贝壳，强调结构的刚性与封闭性；而 “skin” 通常是柔韧、有弹性的覆盖层，更贴近生物体表面，不具备坚硬特性。"
    }
  ]
}