{
  "word": "skin",
  "pronunciation": "skin",
  "concise_definition": "n. 皮肤, 外皮, 表面; v. 剥皮, 削皮",
  "forms": {
    "plural": "skins"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The natural outer covering of the body of a human or animal, serving as a protective barrier against environmental damage and regulating temperature and sensation.",
      "explanation_cn": "人或动物身体表面的天然外层，起到防止环境损伤、调节体温和感知外界刺激的保护屏障作用。",
      "example_en": "She applied sunscreen to protect her skin from UV rays.",
      "example_cn": "她涂抹防晒霜以保护皮肤免受紫外线伤害。"
    },
    {
      "pos": "noun",
      "explanation_en": "The outer layer or surface of something, often thin and flexible, such as the peel of a fruit or the top layer of a liquid.",
      "explanation_cn": "指某物的外层或表面，通常薄而柔韧，如水果的皮或液体表面的薄膜。",
      "example_en": "A thin skin of ice formed on the surface of the pond overnight.",
      "example_cn": "一夜之间，池塘表面结了一层薄冰。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person's appearance or outward facade, especially when it conceals true feelings or intentions; also used metaphorically to describe a person's identity or essence.",
      "explanation_cn": "指一个人的外表或外在表现，尤其用于掩饰真实情感或意图；也可比喻性地指一个人的身份或本质。",
      "example_en": "He put on a calm skin, but inside he was panicking.",
      "example_cn": "他表面装得镇定自若，内心却慌乱不已。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove the outer covering or skin from something, especially food or an animal.",
      "explanation_cn": "指将某物（尤其是食物或动物）的外皮或表层剥去。",
      "example_en": "She skinned the potatoes before boiling them.",
      "example_cn": "她把土豆去皮后再煮。"
    },
    {
      "pos": "verb",
      "explanation_en": "To punish or defeat someone severely, often used in slang or informal contexts.",
      "explanation_cn": "（俚语）严厉惩罚或彻底击败某人。",
      "example_en": "The team got skinned in the final match — they lost 10–0.",
      "example_cn": "球队在决赛中惨败，以0比10落败。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hide",
      "analysis": "“Hide”（皮、兽皮）通常指从动物身上剥下的整张皮，尤其用于皮革加工语境，强调其作为原材料的属性。而 “skin” 更通用，既可指活体表面的皮肤，也可指任何物体的表层，语义范围更广。"
    },
    {
      "word_to_compare": "peel",
      "analysis": "“Peel”（剥皮）多用于水果、蔬菜等植物性食物的外皮，强调动作过程，常作动词使用。而 “skin” 作为动词时更广泛，可用于动物、植物甚至抽象事物（如剥去伪装），且作为名词时涵盖范围更广，包括非食物类表面。"
    },
    {
      "word_to_compare": "surface",
      "analysis": "“Surface”（表面）是中性、抽象的术语，泛指任何物体的最外层，不带生物或物质属性。而 “skin” 常带有生物性、有机性或可触摸的质感，隐含一层“有生命”的边界，语义更具体、形象。"
    }
  ]
}