{
  "word": "skinned",
  "pronunciation": "skind",
  "concise_definition": "adj. 被剥皮的, v. (skin 的过去式和过去分词) 剥皮, 擦伤, 挨骂",
  "forms": {
    "base_form": "skin",
    "present_participle": "skinning",
    "past_tense": "skinned",
    "past_participle": "skinned",
    "third_person_singular": "skins"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To remove the skin or outer covering from an animal or plant, typically for food, preparation, or processing.",
      "explanation_cn": "指从动物或植物身上剥去皮肤或外层，通常用于食用、加工或准备。",
      "example_en": "The chef skinned the fish before frying it.",
      "example_cn": "厨师在煎鱼之前把鱼皮剥掉了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To rub or scrape the skin off one's body, usually due to friction or an accident, resulting in an abrasion or wound.",
      "explanation_cn": "指因摩擦或意外导致身体表皮被擦伤或刮伤，形成擦伤或伤口。",
      "example_en": "He skinned his knee when he fell off his bike.",
      "example_cn": "他从自行车上摔下来时擦伤了膝盖。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cheat or swindle someone, especially by charging them an unfairly high price or taking advantage of them financially.",
      "explanation_cn": "指通过收取过高价格或利用他人来欺骗、敲诈某人，尤指在经济上占便宜。",
      "example_en": "The mechanic skinned me for $500 just to replace a simple fuse.",
      "example_cn": "修车工只换了个保险丝就向我收了500美元，简直把我坑惨了。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that has had its skin or outer layer removed; often used in contexts of food preparation or animal processing.",
      "explanation_cn": "形容某物已被剥去皮肤或外层，常用于食品加工或动物处理的语境中。",
      "example_en": "The skinned chicken breasts were ready to be grilled.",
      "example_cn": "去皮的鸡胸肉已经准备好可以烤了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "peeled",
      "analysis": "“Peeled”（去皮）通常用于植物性食物（如水果、蔬菜）的外皮去除，强调的是柔软、可食用的表层，如苹果皮、土豆皮。而 “skinned” 更常用于动物或较坚韧的外层，如鱼皮、鸡皮，或指身体擦伤，语义范围更广且更具生理冲击力。"
    },
    {
      "word_to_compare": "scraped",
      "analysis": "“Scraped”（刮伤）泛指任何表面被硬物摩擦而受损，可用于墙壁、金属、皮肤等，强调动作的摩擦性，但不必然涉及“移除外层组织”。而 “skinned” 在指身体受伤时，特指表皮被大面积擦掉，程度更深、更严重，带有更强烈的疼痛和视觉冲击。"
    },
    {
      "word_to_compare": "cheated",
      "analysis": "“Cheated”（欺骗）是广义的欺诈行为，涵盖虚假承诺、作弊、隐瞒等。而 “skinned” 在俚语中特指通过高价或不公平交易“榨取”金钱，带有口语化和地域色彩，更强调经济剥削的直接性和粗暴性，语气更生动、更口语。"
    }
  ]
}