{
  "word": "skipped",
  "pronunciation": "skip·id",
  "concise_definition": "v. 跳过, 跳过（某事）, 跳跃, n. 跳跃动作",
  "forms": {
    "base_form": "skip",
    "third_person_singular": "skips",
    "past_tense": "skipped",
    "past_participle": "skipped",
    "present_participle": "skipping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To deliberately avoid or not attend or participate in something, especially something expected or required.",
      "explanation_cn": "故意避免、不参加或不参与某事，尤指本应参加或必须完成的事情。",
      "example_en": "She skipped class to go to the concert.",
      "example_cn": "她逃课去听音乐会了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pass over or omit something, such as a section of text, a step in a process, or an item in a list.",
      "explanation_cn": "跳过、省略某物，如文本的某一部分、流程中的一个步骤或列表中的某一项。",
      "example_en": "The editor skipped the last paragraph because it was irrelevant.",
      "example_cn": "编辑跳过了最后一段，因为它与主题无关。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move by hopping or leaping, typically on one foot or alternating feet, often in a playful or energetic way.",
      "explanation_cn": "通过跳跃或蹦跳的方式移动，通常单脚或交替双脚，常带有玩耍或活泼的意味。",
      "example_en": "The children skipped down the path toward the park.",
      "example_cn": "孩子们蹦蹦跳跳地沿着小路走向公园。"
    },
    {
      "pos": "noun",
      "explanation_en": "A single hop or leap, especially in the context of children's games or physical activity.",
      "explanation_cn": "一次跳跃或蹦跳，尤其指儿童游戏或体育活动中的一种动作。",
      "example_en": "He did a skip and a jump to reach the top of the wall.",
      "example_cn": "他蹦了一下、跳了一下才爬到墙顶。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "omitted",
      "analysis": "“Omitted”（省略）强调因疏忽、错误或正式决定而未包含某物，语气更中性或被动，常用于书面或技术语境（如数据遗漏）。而 “skipped” 更强调主观意愿或主动选择跳过，常带有随意或逃避的意味。"
    },
    {
      "word_to_compare": "avoided",
      "analysis": "“Avoided”（避免）侧重于主动避开可能带来负面后果的事物，常含警惕或防范意图（如避免冲突、避免风险）。而 “skipped” 更多用于日常行为中对义务或程序的轻率跳过，情感色彩较轻。"
    },
    {
      "word_to_compare": "bounced",
      "analysis": "“Bounced”（弹跳）指物体因撞击而反弹，强调物理上的弹性运动，常用于球类或机械场景。而 “skipped” 作为动词时，特指人或物体轻快地连续跳跃，常用于地面或水面（如石片打水漂），更具节奏感和人为控制性。"
    }
  ]
}