{
  "word": "skipping",
  "pronunciation": "skip·ing",
  "concise_definition": "v. 跳过, 跳跃, 逃课; n. 跳绳, 跳过的行为",
  "forms": {
    "base_form": "skip",
    "third_person_singular": "skips",
    "past_tense": "skipped",
    "past_participle": "skipped",
    "present_participle": "skipping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To deliberately avoid or omit something, such as a class, meal, or step in a process, often intentionally or without permission.",
      "explanation_cn": "指故意避免或省略某事物，如逃课、跳过一餐或某个步骤，通常是有意为之或未经允许。",
      "example_en": "He was suspended for skipping school without a valid excuse.",
      "example_cn": "他因无正当理由逃课而被停学。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move by hopping or leaping, typically with both feet leaving the ground at once, as in the physical activity of jump rope.",
      "explanation_cn": "指通过跳跃或弹跳的方式移动，通常双脚同时离地，如跳绳运动。",
      "example_en": "The children were skipping rope in the playground.",
      "example_cn": "孩子们在操场上跳绳。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pass over or bypass a part of something, especially in a sequence or list, without engaging with it.",
      "explanation_cn": "指在序列或列表中跳过某一部分，而不进行接触或处理。",
      "example_en": "She skipped the tedious parts of the report and went straight to the conclusions.",
      "example_cn": "她跳过了报告中枯燥的部分，直接看结论。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of skipping, especially in the context of jumping rope or avoiding something.",
      "explanation_cn": "指跳过或跳跃的行为，尤其指跳绳或逃避某事的行为。",
      "example_en": "Skipping is a great cardiovascular workout for kids.",
      "example_cn": "跳绳是孩子们很好的有氧运动。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "omitting",
      "analysis": "“Omitting” (省略) 更正式，强调在记录、列表或过程中因疏忽或有意而未包含某项，通常用于书面或技术语境，如省略数据或步骤。而 “skipping” 更口语化，常带有主观选择或轻率的意味，如跳过课程或章节。"
    },
    {
      "word_to_compare": "bypassing",
      "analysis": "“Bypassing” (绕过) 强调通过替代路径或方法避开障碍或常规流程，常用于技术、交通或系统语境（如绕过安全检查）。它隐含“替代性路径”的概念，而 “skipping” 更直接地表示“跳过”而不涉及替代方案。"
    },
    {
      "word_to_compare": "hopping",
      "analysis": "“Hopping” (单脚跳) 指用单脚或双脚轻快地跳跃，常用于描述动物或人短距离的弹跳动作，不强调目的性。而 “skipping” 作为动词时，特指一种有节奏、交替脚部的跳跃动作，尤其在跳绳或儿童游戏中，具有更强的规律性和文化语境。"
    }
  ]
}