{
  "word": "skip",
  "pronunciation": "skip",
  "concise_definition": "v. 跳过, 跳过不做, 跳跃; n. 跳跃, 跳绳",
  "forms": {
    "third_person_singular": "skips",
    "past_tense": "skipped",
    "past_participle": "skipped",
    "present_participle": "skipping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To deliberately avoid or omit something, especially a part of a task, event, or sequence, often because it is considered unnecessary, unpleasant, or unimportant.",
      "explanation_cn": "故意避开或省略某事物，尤其是任务、事件或序列中的一部分，通常是因为认为其不必要、不愉快或不重要。",
      "example_en": "I decided to skip breakfast this morning because I was in a hurry.",
      "example_cn": "今天早上我因为赶时间，决定不吃早餐。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move by hopping or leaping, typically with both feet leaving the ground at the same time, often in a light or playful manner.",
      "explanation_cn": "通过跳跃或蹦跳的方式移动，通常双脚同时离地，动作轻快或带有玩耍性质。",
      "example_en": "The children were skipping rope in the schoolyard.",
      "example_cn": "孩子们在操场上跳绳。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fail to attend or be present at something, especially an appointment, class, or event.",
      "explanation_cn": "未能出席或参加某事，尤指约会、课程或活动。",
      "example_en": "He skipped class again yesterday and got in trouble with the teacher.",
      "example_cn": "他昨天又逃课了，被老师训了一顿。"
    },
    {
      "pos": "noun",
      "explanation_en": "A single hop or leap, especially in the context of children's play or physical activity.",
      "explanation_cn": "一次跳跃或蹦跳，尤其用于描述儿童游戏或体育活动中的动作。",
      "example_en": "She gave a joyful skip as she ran toward the park.",
      "example_cn": "她一边跑向公园，一边欢快地跳跃着。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "omit",
      "analysis": "“Omit” (省略) 更正式，强调在记录、写作或程序中因有意或无意而未包含某内容，通常不带有情感色彩或行为动作。而 “skip” 更口语化，常暗示主动选择跳过，有时带有轻率或逃避的意味，如跳过课程或任务。"
    },
    {
      "word_to_compare": "jump",
      "analysis": "“Jump” (跳跃) 是更通用的物理动作词，指双脚离地的任何向上或向前的弹跳，不一定是轻快或重复性的。而 “skip” 作为动词时，特指一种轻盈、有节奏的跳跃，常用于儿童游戏或描述愉悦的移动方式，如跳绳或边走边跳。"
    },
    {
      "word_to_compare": "avoid",
      "analysis": "“Avoid” (避免) 强调主动避开危险、麻烦或不愉快的事物，通常是为了防止负面后果，语义更侧重于防范。而 “skip” 更中性，可以用于无害的场合，如跳过一段无聊的视频，不一定涉及风险或威胁。"
    }
  ]
}