{
  "word": "skirt",
  "pronunciation": "skurrt",
  "concise_definition": "n. 裙子, 避开, 边缘地带; v. 规避, 躲避",
  "forms": {
    "plural": "skirts",
    "third_person_singular": "skirts",
    "past_tense": "skirted",
    "past_participle": "skirted",
    "present_participle": "skirting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A garment worn by women and girls, hanging from the waist and covering the lower part of the body, typically reaching to the knees or below.",
      "explanation_cn": "女性和女孩穿着的服装，从腰部垂下，覆盖身体下部，通常长度到达膝盖或以下。",
      "example_en": "She wore a flowing red skirt to the party.",
      "example_cn": "她穿了一条飘逸的红裙子去参加聚会。"
    },
    {
      "pos": "noun",
      "explanation_en": "The outer edge or boundary of a town, city, or area, especially one that is less developed or less central.",
      "explanation_cn": "城镇、城市或区域的边缘地带，尤指较不发达或非中心的周边地区。",
      "example_en": "Many low-income families live in the skirts of the city.",
      "example_cn": "许多低收入家庭居住在城市边缘地带。"
    },
    {
      "pos": "verb",
      "explanation_en": "To avoid or evade something, especially a responsibility, problem, or direct confrontation, often by going around it rather than facing it directly.",
      "explanation_cn": "规避或逃避某事物，尤指责任、问题或直接对抗，通常通过绕开而非正面应对的方式。",
      "example_en": "The politician skirted the controversial issue during the debate.",
      "example_cn": "这位政客在辩论中避开了这个有争议的问题。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pass along the edge or periphery of something, especially while moving.",
      "explanation_cn": "沿着某物的边缘或外围移动，尤指在行进过程中。",
      "example_en": "The road skirts the edge of the forest.",
      "example_cn": "这条路沿着森林的边缘延伸。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "dress",
      "analysis": "“Dress”（连衣裙）通常指一件从肩部到下摆连为一体的完整服装，而 “skirt” 仅指下半身的裙装，需搭配上衣穿着。两者在服装结构上有本质区别，但都属于女性下装范畴。"
    },
    {
      "word_to_compare": "avoid",
      "analysis": "“Avoid”（避免）是通用词，泛指任何方式的避开，常用于抽象或具体事物；而 “skirt” 作为动词时，强调以迂回、巧妙或不直接的方式绕开问题，带有策略性或回避责任的隐含意味，语气更微妙。"
    },
    {
      "word_to_compare": "periphery",
      "analysis": "“Periphery”（外围）是名词，指某物的边缘区域，与 “skirt” 作名词时的‘边缘地带’含义相近，但 “skirt” 更具口语化和文学色彩，常用于地理或社会语境，而 “periphery” 更学术化，多用于科学或系统分析中。"
    }
  ]
}