{
  "word": "skunk",
  "pronunciation": "skuhngk",
  "concise_definition": "n. 臭鼬, 使丢脸, 使失败; v. 使丢脸, 使失败",
  "forms": {
    "plural": "skunks"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small, black-and-white mammal native to the Americas, known for its ability to spray a strong-smelling liquid as a defense mechanism.",
      "explanation_cn": "一种原产于美洲的小型黑白哺乳动物，以其能喷射出强烈气味的液体作为防御机制而闻名。",
      "example_en": "The hiker heard a rustling in the bushes and saw a skunk waddling away.",
      "example_cn": "徒步者听到灌木丛中传来沙沙声，看见一只臭鼬摇摇晃晃地走开了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is considered a loser or someone who has been thoroughly defeated, especially in a competition or game.",
      "explanation_cn": "指在比赛或游戏中被彻底击败、被视为失败者的人。",
      "example_en": "After losing 10–0, the team was called a skunk by the fans.",
      "example_cn": "以0比10落败后，球队被球迷称为‘臭鼬’（惨败者）。"
    },
    {
      "pos": "verb",
      "explanation_en": "To defeat someone decisively, especially in a game or competition, often by a large margin.",
      "explanation_cn": "指在比赛或竞争中以压倒性优势彻底击败某人。",
      "example_en": "The home team skunked their rivals in the final match.",
      "example_cn": "主队在决赛中以悬殊比分击败了对手。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause someone to be embarrassed or humiliated, often by outperforming them in a public way.",
      "explanation_cn": "指通过公开地胜过某人而使其感到尴尬或丢脸。",
      "example_en": "He skunked his opponent in the debate, leaving them speechless.",
      "example_cn": "他在辩论中彻底压倒了对手，令对方哑口无言。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mink",
      "analysis": "“Mink”（水貂）是一种毛皮珍贵的哺乳动物，外形与臭鼬相似，但体型更修长、颜色多为深棕色，且不具喷射臭液的防御能力。两者虽同属鼬科，但“skunk”因气味和黑白斑纹而具有鲜明的识别特征，常带有贬义或俚语用法，而“mink”则多与奢华相关。"
    },
    {
      "word_to_compare": "defeat",
      "analysis": "“Defeat”（击败）是通用词，泛指在竞争、战争或对抗中获胜，中性且正式。而“skunk”作为动词时，语气更口语化、俚语化，强调压倒性胜利或羞辱性失败，常用于非正式语境，如体育比赛或游戏，带有更强的情感色彩。"
    },
    {
      "word_to_compare": "humiliate",
      "analysis": "“Humiliate”（羞辱）侧重于心理层面的贬低和使对方感到丢脸，不一定涉及胜负结果。而“skunk”作为动词时，通常包含实际的胜利行为（如得分悬殊），羞辱是胜利的自然结果，因此“skunk”更强调行为结果，而“humiliate”更强调情感影响。"
    }
  ]
}