{
  "word": "sky",
  "pronunciation": "skī",
  "concise_definition": "n. 天空, 天穹; v. (使) 高高举起, (使) 高耸",
  "forms": {
    "plural": "skies"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The atmosphere and space as seen from the Earth's surface; the apparent dome above the Earth, often appearing blue during the day and filled with stars at night.",
      "explanation_cn": "从地球表面所见的大气层及太空，通常表现为一个穹顶状的覆盖空间，白天常呈蓝色，夜晚则布满星辰。",
      "example_en": "The birds flew high into the clear blue sky.",
      "example_cn": "鸟儿飞向清澈湛蓝的天空。"
    },
    {
      "pos": "noun",
      "explanation_en": "A region or area considered as being above or beyond the earth, often used metaphorically to refer to heaven or the divine.",
      "explanation_cn": "指超越地球之上的区域，常用于隐喻中表示天堂或神圣之境。",
      "example_en": "They believe their loved one has gone to the sky.",
      "example_cn": "他们相信所爱之人已升入天堂。"
    },
    {
      "pos": "verb",
      "explanation_en": "To raise or lift something high into the air, often suddenly or forcefully.",
      "explanation_cn": "将某物突然或用力地高高举起，使其升至空中。",
      "example_en": "The crowd skyed their hands in celebration.",
      "example_cn": "人群高高举起双手以示庆祝。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to stand or rise prominently or toweringly, especially in architecture or landscape.",
      "explanation_cn": "使某物高耸、突兀地矗立，尤用于描述建筑或地貌。",
      "example_en": "The new skyscraper skies above the old downtown buildings.",
      "example_cn": "这座新摩天大楼高耸于旧城区建筑之上。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "heaven",
      "analysis": "“Heaven” (天堂) 是一个宗教或精神概念，指死后灵魂的归宿或神的居所，具有强烈的道德和信仰内涵。而 “sky” 是物理意义上的大气层或天穹，是可观察的自然现象，二者在字面和隐喻层面虽有重叠，但 “heaven” 更抽象、更神圣。"
    },
    {
      "word_to_compare": "atmosphere",
      "analysis": "“Atmosphere” (大气层) 是科学术语，指包围地球的气体层，强调其物理组成和分层结构（如对流层、平流层）。而 “sky” 是日常语言中对大气层视觉外观的描述，不涉及科学细节，更侧重于人的感官体验。"
    },
    {
      "word_to_compare": "ceiling",
      "analysis": "“Ceiling” (天花板) 指室内空间的顶部表面，是封闭、有限的物理边界。而 “sky” 是无限延伸的自然穹顶，象征开放与自由。二者虽都表示“上方的覆盖”，但 “ceiling” 是压抑的，而 “sky” 是解放的。"
    }
  ]
}