{
  "word": "slalom",
  "pronunciation": "suh·lom",
  "concise_definition": "n. 回转滑雪, 旗门滑雪; v. 作回转滑雪动作, 急转弯穿行",
  "forms": {
    "plural": "slaloms",
    "third_person_singular": "slaloms",
    "past_tense": "slalomed",
    "past_participle": "slalomed",
    "present_participle": "slaloming"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A skiing race in which competitors must navigate a course marked by a series of closely spaced flags or poles, requiring sharp, rapid turns to pass between them.",
      "explanation_cn": "一种滑雪比赛，参赛者必须在一系列紧密排列的旗门或标杆之间快速转弯穿行，考验敏捷性和控雪技术。",
      "example_en": "She won the gold medal in the women's slalom at the Winter Olympics.",
      "example_cn": "她在冬奥会女子回转滑雪项目中赢得了金牌。"
    },
    {
      "pos": "noun",
      "explanation_en": "A winding or zigzag path or route, often used metaphorically to describe a complex or challenging journey through obstacles.",
      "explanation_cn": "指一条蜿蜒曲折的路径，常用于比喻在复杂或充满障碍的情境中艰难穿行的过程。",
      "example_en": "The politician had to slalom through a series of scandals to remain in office.",
      "example_cn": "这位政客不得不在一系列丑闻中左冲右突，才得以保住职位。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or travel in a zigzag pattern, especially by making rapid, sharp turns to avoid obstacles.",
      "explanation_cn": "以之字形或急转弯的方式移动，尤其指为避开障碍物而快速转向。",
      "example_en": "The driver slalomed between the traffic cones to avoid a collision.",
      "example_cn": "司机在交通锥之间急转弯穿行，以避免碰撞。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "skiing",
      "analysis": "“Skiing”（滑雪）是泛指所有在雪地上使用滑雪板进行的运动，包括越野滑雪、高山滑雪、自由式滑雪等。而 “slalom” 是滑雪的一种具体竞赛形式，强调在密集旗门间精确转弯的技术要求，属于滑雪的子类别。"
    },
    {
      "word_to_compare": "zigzag",
      "analysis": "“Zigzag”（之字形移动）是一个通用描述词，指任何呈锯齿状的路径或运动轨迹，可用于描述人、车辆、光线等的运动，不局限于体育或雪地环境。而 “slalom” 专指在特定规则下（如滑雪或滑水）有组织、有旗门标记的之字形穿行，具有竞技性和规范性。"
    },
    {
      "word_to_compare": "weave",
      "analysis": "“Weave”（穿行、穿梭）强调在密集物体间灵活穿插，常用于描述人或车辆在人群中或车流中移动，语义更宽泛，不强调速度或转弯的锐度。而 “slalom” 更强调高速、精确、连续的急转弯动作，通常与体育竞技和物理障碍物（如旗门）直接关联。"
    }
  ]
}