{
  "word": "slap",
  "pronunciation": "slap",
  "concise_definition": "v. 掌掴, 拍打; n. 掌掴声, 拍打",
  "forms": {
    "third_person_singular": "slaps",
    "past_tense": "slapped",
    "past_participle": "slapped",
    "present_participle": "slapping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To strike someone or something sharply with the open hand, typically on the face, often as an act of anger, punishment, or surprise.",
      "explanation_cn": "用张开的手掌猛烈拍打某人或某物，通常打在脸上，常作为愤怒、惩罚或惊讶的表达方式。",
      "example_en": "She slapped him across the face after he lied to her.",
      "example_cn": "他向她撒谎后，她一巴掌打在他脸上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To place or move something quickly and noisily, often with a flat, forceful motion.",
      "explanation_cn": "以快速而响亮的动作将某物放置或移动，常带有扁平、有力的拍击感。",
      "example_en": "He slapped the book down on the table and walked out.",
      "example_cn": "他把书重重地拍在桌上，然后走了出去。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sharp, flat sound made by striking a surface with the palm of the hand, or the act of delivering such a strike.",
      "explanation_cn": "用手掌拍击表面时发出的清脆、扁平的声音，或实施这种拍打的动作本身。",
      "example_en": "The slap of the waves against the shore was soothing.",
      "example_cn": "海浪拍打岸边的声音令人平静。"
    },
    {
      "pos": "noun",
      "explanation_en": "A contemptuous or dismissive remark or action, often delivered in a sudden, harsh manner.",
      "explanation_cn": "一种轻蔑或敷衍的言论或行为，通常以突然、严厉的方式表达。",
      "example_en": "The critic's review was a slap in the face for the director.",
      "example_cn": "评论家的评论对这位导演来说无异于当头一棒。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hit",
      "analysis": "“Hit” (击打) 是一个更广泛、更中性的动词，泛指任何形式的打击，可以使用拳头、工具或身体任何部位，力度和意图多样。而 “slap” 特指用掌心拍打，通常带有羞辱、情绪化或轻蔑的意味，且多用于面部。"
    },
    {
      "word_to_compare": "beat",
      "analysis": "“Beat” (殴打) 指连续、反复的击打，常暗示暴力或虐待，强度和持续时间远超单次拍打。“Slap” 通常是单次、短暂的动作，即使激烈，也不具备“beat”所蕴含的系统性暴力特征。"
    },
    {
      "word_to_compare": "pat",
      "analysis": "“Pat” (轻拍) 是一种温和、安抚性的轻触动作，常用于表达关心或鼓励，如拍肩、拍头。而 “slap” 则是强烈、粗暴的拍击，带有攻击性或侮辱性，两者在情感色彩和意图上完全相反。"
    }
  ]
}