{
  "word": "slapping",
  "pronunciation": "slap·ing",
  "concise_definition": "v. 掌掴, 猛拍; n. 掌掴声, 猛拍动作",
  "forms": {
    "base_form": "slap",
    "third_person_singular": "slaps",
    "past_tense": "slapped",
    "past_participle": "slapped",
    "present_participle": "slapping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To strike someone or something sharply with the open hand, typically producing a loud sound; often used to express anger, punishment, or surprise.",
      "explanation_cn": "用张开的手掌猛烈拍打某人或某物，通常发出响亮的声音；常用于表达愤怒、惩罚或惊讶。",
      "example_en": "The coach was so angry that he started slapping the table with his open hand.",
      "example_cn": "教练非常生气，开始用手掌拍打桌子。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hit something forcefully and quickly, especially to produce a sharp, flat sound, not necessarily involving the hand (e.g., slapping a door, a fish, or a book).",
      "explanation_cn": "快速而有力地拍打某物，尤其是发出清脆、扁平的声响，不一定用手（如拍门、拍鱼、拍书）。",
      "example_en": "The fish slapped the surface of the water as it jumped out.",
      "example_cn": "鱼跃出水面时拍打着水面。"
    },
    {
      "pos": "noun",
      "explanation_en": "The sound or act of a sharp, flat impact made by striking with an open hand or flat object.",
      "explanation_cn": "用手掌或扁平物体击打时发出的清脆、扁平的声响或动作。",
      "example_en": "The slapping of the waves against the shore was soothing.",
      "example_cn": "海浪拍打岸边的声音令人感到平静。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used informally to describe something of very poor quality, often in the phrase 'a slapping good time' or 'a slapping lie' — though the latter is ironic.",
      "explanation_cn": "非正式用法，形容质量极差的事物，常用于短语如 'a slapping good time'（极好的时光）或 'a slapping lie'（荒谬的谎言）——后者为反语。",
      "example_en": "He gave us a slapping good show last night — the best we've seen all year.",
      "example_cn": "昨晚他给我们带来了一场极棒的表演——是我们今年见过最好的。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hit",
      "analysis": "“Hit”（击打）是更广泛的动词，泛指任何形式的打击，可以是用拳头、棍棒、物体等，不强调方式或声音。而 “slapping” 特指用掌心拍打，强调扁平、响亮、有时带有情绪色彩的击打方式。"
    },
    {
      "word_to_compare": "whack",
      "analysis": "“Whack”（重击）通常指用硬物或大力击打，声音更沉闷或厚重，常带有暴力或意外的意味（如用棒子打）。而 “slapping” 更轻快、更依赖手掌，声音更清脆，常用于日常或情绪化场景。"
    },
    {
      "word_to_compare": "pat",
      "analysis": "“Pat”（轻拍）是温和、轻柔的接触，常表达安慰、鼓励或安抚，与 “slapping” 的强烈、攻击性形成鲜明对比。两者动作相似，但力度、意图和情感色彩截然不同。"
    }
  ]
}