{
  "word": "slate",
  "pronunciation": "sleyt",
  "concise_definition": "n. 板岩, 石板; v. 安排, 提名, 计划",
  "forms": {
    "plural": "slates",
    "third_person_singular": "slates",
    "past_tense": "slated",
    "past_participle": "slated",
    "present_participle": "slating"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A type of fine-grained, metamorphic rock that can be split into thin, flat sheets, commonly used for roofing, flooring, or writing surfaces.",
      "explanation_cn": "一种细粒变质岩，可分裂成薄而平坦的片状，常用于屋顶、地板或书写板。",
      "example_en": "The old schoolhouse had a slate roof that had lasted over a century.",
      "example_cn": "那所旧校舍的屋顶是石板做的，已经使用了一百多年。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, flat piece of slate used for writing or drawing, especially in schools before the advent of paper and chalkboards.",
      "explanation_cn": "一种小型的石板片，过去常用于学校书写或绘画，早于纸张和黑板的使用。",
      "example_en": "Children in the 19th century practiced their spelling on slates with chalk.",
      "example_cn": "19世纪的孩子们用粉笔在石板上练习拼写。"
    },
    {
      "pos": "noun",
      "explanation_en": "A list of candidates nominated together for election, especially in political contexts.",
      "explanation_cn": "在政治语境中，指一组被共同提名参选的候选人名单。",
      "example_en": "The party unveiled its slate of candidates for the upcoming election.",
      "example_cn": "该政党公布了即将选举的候选人名单。"
    },
    {
      "pos": "verb",
      "explanation_en": "To schedule or plan something for a particular time or purpose, often formally or officially.",
      "explanation_cn": "正式或官方地安排某事在特定时间发生或用于特定目的。",
      "example_en": "The meeting is slated for next Tuesday at 3 p.m.",
      "example_cn": "会议定于下周二下午三点举行。"
    },
    {
      "pos": "verb",
      "explanation_en": "To nominate someone for a position or role, especially in a political or organizational context.",
      "explanation_cn": "提名某人担任某一职位或角色，尤其在政治或组织语境中。",
      "example_en": "She was slated to become the next CEO of the company.",
      "example_cn": "她被提名为公司下一任首席执行官。"
    },
    {
      "pos": "verb",
      "explanation_en": "To criticize or condemn someone severely, often publicly or in writing.",
      "explanation_cn": "公开或书面严厉批评或谴责某人。",
      "example_en": "The newspaper slated the mayor for his handling of the budget crisis.",
      "example_cn": "这家报纸严厉批评了市长对预算危机的处理方式。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "plan",
      "analysis": "“Plan” (计划) 是一个通用词，泛指为未来行动制定的方案，不带有正式提名或安排的含义。而 “slate” 作为动词时，特指正式或官方地安排某人或某事，常用于政治、组织或媒体语境，语义更具体、更具权威性。"
    },
    {
      "word_to_compare": "nominate",
      "analysis": "“Nominate” (提名) 仅指正式推荐某人担任职位，而 “slate” 不仅包含提名，还隐含了将候选人作为一组整体推出，常用于政党或选举的集体提名语境。此外，“slate” 还可作名词表示整个提名名单，而 “nominate” 无此用法。"
    },
    {
      "word_to_compare": "rock",
      "analysis": "“Rock” (岩石) 是一个广义词，泛指所有天然矿物固体，而 “slate” 是一种特定类型的岩石，具有可分裂成薄片的物理特性。两者是种属关系，不能互换。"
    },
    {
      "word_to_compare": "criticize",
      "analysis": "“Criticize” (批评) 是中性或通用的动词，可指任何程度的负面评价。而 “slate” 作为动词时，语气更强烈，常带有公开、严厉甚至带有媒体渲染色彩的谴责意味，语义色彩更重。"
    }
  ]
}