{
  "word": "slider",
  "pronunciation": "slī·dər",
  "concise_definition": "n. 滑块, 滑动部件, 滑行者",
  "forms": {
    "plural": "sliders"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A component that moves along a track or groove to adjust or control a setting, commonly found in user interfaces, audio equipment, or mechanical devices.",
      "explanation_cn": "指沿轨道或凹槽滑动以调节或控制设置的部件，常见于用户界面、音频设备或机械装置中。",
      "example_en": "Use the volume slider to adjust the sound level on your phone.",
      "example_cn": "使用音量滑块来调节手机的音量。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of sandwich, especially in American English, consisting of a long bread roll filled with meats, cheeses, vegetables, and condiments.",
      "explanation_cn": "一种三明治，尤其在美国英语中，指用长条面包夹入肉类、奶酪、蔬菜和调味品制成的食物，也称作子三明治（sub）或英雄三明治（hero）。",
      "example_en": "We ordered two chicken sliders for lunch.",
      "example_cn": "我们午餐点了两个鸡肉三明治。"
    },
    {
      "pos": "noun",
      "explanation_en": "A baseball pitch that moves horizontally as it approaches the batter, typically thrown with a slight spin to create lateral movement.",
      "explanation_cn": "一种棒球投球方式，球在接近击球手时呈水平方向移动，通常通过轻微旋转产生横向偏移。",
      "example_en": "The pitcher threw a sharp slider that broke away from the right-handed batter.",
      "example_cn": "投手投出一个锐利的滑球，使右打者无法击中。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that slides, especially in sports such as baseball, skiing, or gymnastics, where sliding motion is a key element.",
      "explanation_cn": "指滑动的人或物，尤其在棒球、滑雪或体操等运动中，滑动是关键动作。",
      "example_en": "The baseball player was a master slider, often stealing bases with perfect timing.",
      "example_cn": "这位棒球运动员是滑垒高手，常以完美的时机盗垒成功。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "knob",
      "analysis": "“Knob”（旋钮）是通过旋转来调节的控制部件，常用于音量、温度等连续调节，强调转动动作；而 “slider” 是通过直线滑动来调节，提供更直观的视觉反馈，适合需要精细控制的场景，如亮度或音量条。"
    },
    {
      "word_to_compare": "sandwich",
      "analysis": "“Sandwich”（三明治）是通用术语，泛指两片面包夹馅的食物；而 “slider” 是一种特定类型的三明治，通常体积较小、使用小圆面包，多用于快餐或聚会场景，具有明确的形态和文化语境。"
    },
    {
      "word_to_compare": "curveball",
      "analysis": "“Curveball”（曲球）是棒球中一种以垂直下坠为主要特征的投球，依靠上旋产生重力效应；而 “slider” 是水平横向移动的球路，速度更快、弧度更小，更难被击中。两者虽同为变化球，但运动轨迹和战术用途截然不同。"
    }
  ]
}