{
  "word": "slides",
  "pronunciation": "slaydz",
  "concise_definition": "n. 滑动, 幻灯片, 滑梯; v. 滑动, 滑行",
  "forms": {
    "singular": "slide",
    "past_tense": "slid",
    "past_participle": "slid",
    "present_participle": "sliding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A single page or image in a presentation, typically displayed sequentially to convey information, often using visual aids such as text, charts, or photographs.",
      "explanation_cn": "指在演示文稿中依次展示的单页内容，通常包含文字、图表或照片，用于传递信息。",
      "example_en": "The professor used several slides to explain the theory of evolution.",
      "example_cn": "教授使用了多张幻灯片来解释进化论。"
    },
    {
      "pos": "noun",
      "explanation_en": "A smooth, sloping surface designed for children to slide down for play, commonly found in playgrounds.",
      "explanation_cn": "指游乐场中供儿童滑下的光滑倾斜表面。",
      "example_en": "The children were laughing as they raced down the slides.",
      "example_cn": "孩子们一边滑下滑梯，一边大笑。"
    },
    {
      "pos": "noun",
      "explanation_en": "A thin, flat piece of material, especially one used in microscopy or construction, such as a glass slide for viewing specimens under a microscope.",
      "explanation_cn": "指薄而平的片状物，尤指用于显微镜观察标本的玻璃片，或建筑中的薄板。",
      "example_en": "The biologist placed a drop of water on a glass slide and examined it under the microscope.",
      "example_cn": "生物学家将一滴水滴在玻璃载玻片上，用显微镜观察。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move smoothly and effortlessly along a surface, often with little or no friction.",
      "explanation_cn": "指在表面上平稳、轻松地滑动，通常摩擦力很小或没有。",
      "example_en": "The ice skater slid gracefully across the rink.",
      "example_cn": "滑冰运动员优雅地在冰场上滑行。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to move smoothly along a surface or within a mechanism, often intentionally.",
      "explanation_cn": "指有意识地使某物沿表面或机械结构内平稳移动。",
      "example_en": "She slid the drawer open to retrieve her keys.",
      "example_cn": "她把抽屉拉开，取出了钥匙。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pass or shift subtly or unnoticed, especially in time or condition.",
      "explanation_cn": "指时间或状态悄然、不易察觉地流逝或转变。",
      "example_en": "The afternoon slid away as they chatted over coffee.",
      "example_cn": "他们一边喝咖啡一边聊天，下午悄然流逝。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "presentation",
      "analysis": "“Presentation”（演示）是一个整体概念，指整个展示过程或活动，可能包含多个幻灯片、演讲和互动；而 “slide” 是构成演示的单个视觉单元。前者是系统，后者是组件。"
    },
    {
      "word_to_compare": "glide",
      "analysis": "“Glide”（滑行）强调优雅、流畅、无阻力的运动，常用于描述鸟类、冰上运动或自然状态下的移动，带有美学或诗意色彩；而 “slide” 更中性，可指任何平滑移动，包括机械或无意的滑动，如滑倒或抽屉滑动。"
    },
    {
      "word_to_compare": "slip",
      "analysis": "“Slip”（滑落）通常暗示意外、失控或不稳定的移动，常带有负面含义，如“slip on ice”；而 “slide” 更强调可控、有方向的平滑运动，通常是主动或设计好的行为，如滑梯或幻灯片切换。"
    }
  ]
}