{
  "word": "sliding",
  "pronunciation": "slyd·ing",
  "concise_definition": "v. 滑动, 滑行; n. 滑动, 滑行",
  "forms": {
    "base_form": "slide",
    "third_person_singular": "slides",
    "past_tense": "slid",
    "past_participle": "slid",
    "present_participle": "sliding"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move smoothly and continuously along a surface, typically with little or no friction, often by gliding or slipping.",
      "explanation_cn": "指在表面上平稳、连续地移动，通常因摩擦力极小而呈滑行状态。",
      "example_en": "The children were sliding down the icy hill on their sleds.",
      "example_cn": "孩子们正坐在雪橇上从结冰的山坡上滑下来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or shift gradually or subtly, often without being noticed, especially in position, value, or condition.",
      "explanation_cn": "指位置、价值或状态发生缓慢、微妙的变化，通常不易被察觉。",
      "example_en": "His opinion has been sliding toward more conservative views over the years.",
      "example_cn": "多年来，他的观点逐渐向更保守的方向倾斜。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or process of sliding; a smooth, gliding movement.",
      "explanation_cn": "滑动的行为或过程；一种平滑的滑行动作。",
      "example_en": "The sliding of the door on its track was surprisingly quiet.",
      "example_cn": "门在轨道上滑动的声音出奇地安静。"
    },
    {
      "pos": "noun",
      "explanation_en": "A playground equipment consisting of a sloping surface down which children slide, typically made of metal or plastic.",
      "explanation_cn": "一种儿童游乐设施，由倾斜的表面构成，儿童可沿其滑下，通常由金属或塑料制成。",
      "example_en": "The kids lined up eagerly for their turn on the slide.",
      "example_cn": "孩子们排着队，急切地等待轮到他们玩滑梯。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "slipping",
      "analysis": "“Slipping”（滑倒/滑落）通常指意外或失去控制的滑动，常带有负面含义，如脚底打滑导致摔倒；而 “sliding” 更强调有控制的、流畅的滑行动作，可以是故意的或中性的，如滑梯、推拉门的滑动。"
    },
    {
      "word_to_compare": "gliding",
      "analysis": "“Gliding”（滑翔/滑行）多用于空中或水中的平滑移动，如鸟儿滑翔、船只滑行，强调轻盈、无动力的运动；而 “sliding” 更常用于固体表面之间的接触性移动，强调摩擦力极小但仍有接触，如冰面、轨道上的滑动。"
    },
    {
      "word_to_compare": "shifting",
      "analysis": "“Shifting”（转移/变动）泛指位置、状态或重心的改变，可以是突然的或抽象的，如政策转向、注意力转移；而 “sliding” 更强调连续、渐进、沿某一方向的物理或隐喻性移动，常带有缓慢、不可逆的意味，如滑向失败。"
    }
  ]
}