{
  "word": "slime",
  "pronunciation": "slahym",
  "concise_definition": "n. 黏液, 污泥; v. 使变黏滑, 用黏液覆盖",
  "forms": {
    "plural": "slimes",
    "third_person_singular": "slimes",
    "past_tense": "slimed",
    "past_participle": "slimed",
    "present_participle": "sliming"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A thick, sticky, and often wet substance, typically produced by living organisms such as mollusks, fungi, or bacteria, or found in polluted environments like muddy water or decaying matter.",
      "explanation_cn": "一种浓稠、黏腻、通常湿润的物质，通常由软体动物、真菌或细菌等生物产生，或存在于被污染的环境中，如泥泞的水或腐烂物质中。",
      "example_en": "The snail left a trail of slime behind it as it crawled across the garden path.",
      "example_cn": "蜗牛爬过花园小径时留下了一道黏液痕迹。"
    },
    {
      "pos": "noun",
      "explanation_en": "A colloquial or slang term for a contemptible or untrustworthy person, often implying moral weakness or sycophancy.",
      "explanation_cn": "俚语，指令人鄙视或不可信的人，常暗示其道德软弱或阿谀奉承。",
      "example_en": "He’s such a slime for betraying his friend’s secret to the boss.",
      "example_cn": "他把朋友的秘密告诉老板，真是个卑鄙小人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A fictional, often gelatinous or amorphous creature in fantasy or horror media, typically depicted as dangerous and corrosive.",
      "explanation_cn": "奇幻或恐怖作品中虚构的、通常呈凝胶状或无定形的生物，常被描绘为具有危险性和腐蚀性。",
      "example_en": "The dungeon was filled with glowing green slimes that dissolved anything they touched.",
      "example_cn": "地牢里充满了发光的绿色黏液怪，任何被它们碰到的东西都会被溶解。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover or coat something with a slimy substance, often unintentionally or as a result of decay or biological activity.",
      "explanation_cn": "用黏滑物质覆盖或涂覆某物，通常是非故意的，或由腐烂或生物活动引起。",
      "example_en": "The old boat had been slimed over with algae after months in the harbor.",
      "example_cn": "这艘旧船在港口停泊数月后，表面已布满藻类黏液。"
    },
    {
      "pos": "verb",
      "explanation_en": "To act in a sycophantic or subservient manner to gain favor, especially from someone in power.",
      "explanation_cn": "以阿谀奉承或卑躬屈膝的方式行事，以博取权势者的青睐。",
      "example_en": "He’s always sliming up to the manager, hoping for a promotion.",
      "example_cn": "他总是对经理溜须拍马，希望能得到晋升。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mucus",
      "analysis": "“Mucus”（黏液）是生物学上的专业术语，特指人体或动物体内由黏膜分泌的保护性液体，如鼻涕或痰。它强调生理功能和结构，中性或医学语境。而 “slime” 更泛化，可指任何黏稠物质，包括污秽、虚构或贬义情境，语义更宽泛且常带负面色彩。"
    },
    {
      "word_to_compare": "mud",
      "analysis": "“Mud”（泥浆）是由水和泥土混合形成的半固体物质，质地较粗，主要成分是矿物质。它不具有生物黏性或胶状特性。而 “slime” 更强调黏滑、胶质、可能含有机物的特性，常与生物分泌物或腐烂物相关，触感更黏腻。"
    },
    {
      "word_to_compare": "goo",
      "analysis": "“Goo”（胶状物）是口语中对任何黏稠、非固体物质的泛称，如胶水、糖浆或玩具黏液，通常无贬义，甚至用于儿童玩具。而 “slime” 除了可指类似物质外，还带有污秽、生物性或道德贬义的语义层次，语义更复杂，文化联想更丰富。"
    }
  ]
}