{
  "word": "sling",
  "pronunciation": "sling",
  "concise_definition": "n. 投石带, 吊带, 背带; v. 投掷, 吊挂, 背负",
  "forms": {
    "third_person_singular": "slings",
    "past_tense": "slung",
    "past_participle": "slung",
    "present_participle": "slinging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A strip of fabric or leather used to support an injured arm or shoulder, typically worn around the neck.",
      "explanation_cn": "一种用于支撑受伤手臂或肩膀的布带或皮带，通常系在脖子上。",
      "example_en": "After the accident, she wore a sling to keep her arm immobilized.",
      "example_cn": "事故发生后，她佩戴吊带以固定手臂。"
    },
    {
      "pos": "noun",
      "explanation_en": "A simple weapon consisting of a small pouch attached to two cords, used to hurl stones or other projectiles with great force.",
      "explanation_cn": "一种由两个绳索和一个小袋组成的简易武器，用于以极大的力量投掷石块或其他投射物。",
      "example_en": "David used a sling to defeat the giant Goliath in the biblical story.",
      "example_cn": "在圣经故事中，大卫用投石带击败了巨人歌利亚。"
    },
    {
      "pos": "noun",
      "explanation_en": "A strap or chain used to carry or suspend heavy objects, such as a cargo sling or a baby carrier.",
      "explanation_cn": "用于搬运或悬挂重物的带子或链条，如货物吊带或婴儿背带。",
      "example_en": "The workers used a metal sling to lift the engine onto the truck.",
      "example_cn": "工人们用金属吊带将发动机吊上卡车。"
    },
    {
      "pos": "verb",
      "explanation_en": "To throw something forcefully or casually, often with a swinging motion of the arm.",
      "explanation_cn": "以手臂摆动的方式用力或随意地投掷某物。",
      "example_en": "He slung the rock across the lake and watched it skip on the water.",
      "example_cn": "他把石头用力甩过湖面，看着它在水面上弹跳。"
    },
    {
      "pos": "verb",
      "explanation_en": "To carry or hang something by suspending it from a strap, chain, or similar support.",
      "explanation_cn": "通过将某物悬挂在带子、链条或其他支撑物上来携带或悬挂。",
      "example_en": "She slung her backpack over one shoulder and headed out the door.",
      "example_cn": "她把背包往肩上一甩，就出门了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "throw",
      "analysis": "“Throw” (投掷) 是一个通用动词，泛指任何用手臂力量将物体抛出的动作，不强调方式。而 “sling” 特指利用摆动或借助绳带、皮囊等装置进行的投掷，动作更具弧线性和力量感，常用于投石带或重物悬挂的语境。"
    },
    {
      "word_to_compare": "hang",
      "analysis": "“Hang” (悬挂) 指将物体固定在垂直或倾斜的支点上，通常保持静止，如挂画、挂衣服。而 “sling” 强调通过带子或吊索“悬吊”或“背负”物体，常带有动态或可移动的含义，如吊运货物或背婴儿，动作更灵活、更依赖支撑结构。"
    },
    {
      "word_to_compare": "strap",
      "analysis": "“Strap” (带子) 作为名词时指一种长条形的固定材料，作为动词时指用带子绑紧。而 “sling” 作为名词时特指一种用于承重或支撑的悬挂装置，其结构通常呈U形或环形，功能更偏向于承载和搬运，而非简单固定。作为动词时，“sling” 更强调动态的背负或投掷，而 “strap” 更强调静态的捆绑。"
    }
  ]
}