{
  "word": "slips",
  "pronunciation": "slips",
  "concise_definition": "n. 失误, 滑倒, 纸条; v. 滑动, 滑倒, 泄露",
  "forms": {
    "singular": "slip",
    "past_tense": "slipped",
    "past_participle": "slipped",
    "present_participle": "slipping",
    "third_person_singular": "slips"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small mistake or error, especially one that is minor or unintentional, often in speech, writing, or behavior.",
      "explanation_cn": "指轻微或无意的错误，尤其出现在言语、写作或行为中。",
      "example_en": "He made a slip of the tongue and called his boss by his son's name.",
      "example_cn": "他口误，把老板叫成了他儿子的名字。"
    },
    {
      "pos": "noun",
      "explanation_en": "A piece of paper, often small, used for writing a note, a ticket, or a receipt.",
      "explanation_cn": "指一张小纸片，常用于书写便条、票券或收据。",
      "example_en": "She wrote her phone number on a slip of paper and handed it to him.",
      "example_cn": "她把电话号码写在一张纸上递给了他。"
    },
    {
      "pos": "noun",
      "explanation_en": "A fall or loss of balance caused by stepping on a slippery surface.",
      "explanation_cn": "因踩在光滑表面上而发生的摔倒或失去平衡。",
      "example_en": "She had a slip on the icy sidewalk and hurt her ankle.",
      "example_cn": "她在结冰的人行道上滑了一跤，伤了脚踝。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move smoothly and quickly over a surface, often unintentionally or without proper grip.",
      "explanation_cn": "指在表面上顺畅而快速地移动，通常是无意的或因缺乏抓力所致。",
      "example_en": "The cat slipped under the fence and disappeared into the garden.",
      "example_cn": "猫从篱笆下溜了过去，消失在花园里。"
    },
    {
      "pos": "verb",
      "explanation_en": "To accidentally reveal information that was meant to be kept secret.",
      "explanation_cn": "指无意中泄露了本应保密的信息。",
      "example_en": "He slipped and told her about the surprise party before the big day.",
      "example_cn": "他不小心说漏了嘴，提前告诉她关于惊喜派对的事。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mistake",
      "analysis": "“Mistake”（错误）是更通用的词，泛指任何不正确的行为或判断，可能涉及严重后果；而 “slip” 通常指轻微、偶然、非故意的失误，语气更轻，常用于口语。"
    },
    {
      "word_to_compare": "gaffe",
      "analysis": "“Gaffe”（失言/失礼）特指在社交或公共场合中因不当言行造成的尴尬错误，带有社会性后果；而 “slip” 更中性，可指语言、动作或物理上的小失误，不一定涉及社交尴尬。"
    },
    {
      "word_to_compare": "slide",
      "analysis": "“Slide”（滑动）强调物体沿表面平稳移动的过程，常用于物理动作，如滑梯、冰面滑行；而 “slip” 更强调失去控制或意外的滑动，常带有负面或危险含义，如滑倒、泄露秘密。"
    }
  ]
}