{
  "word": "slipping",
  "pronunciation": "slip·ing",
  "concise_definition": "v. 滑动, 滑倒,  slipping (现在分词/动名词形式)",
  "forms": {
    "base_form": "slip",
    "third_person_singular": "slips",
    "past_tense": "slipped",
    "past_participle": "slipped",
    "present_participle": "slipping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move unintentionally or suddenly along a surface, especially due to lack of traction or a smooth, wet, or icy surface.",
      "explanation_cn": "指因缺乏摩擦力或表面光滑、湿滑、结冰而意外或突然地在表面上滑动。",
      "example_en": "She was slipping on the icy sidewalk and barely caught herself.",
      "example_cn": "她在结冰的人行道上滑倒了，勉强才稳住身体。"
    },
    {
      "pos": "verb",
      "explanation_en": "To gradually decline or deteriorate in quality, performance, or standards, often unnoticed or unintentionally.",
      "explanation_cn": "指质量、表现或标准逐渐下降或恶化，通常是不知不觉或非故意的。",
      "example_en": "His academic performance has been slipping since he started working part-time.",
      "example_cn": "自从他开始兼职工作以来，学业表现一直在下滑。"
    },
    {
      "pos": "verb",
      "explanation_en": "To let something escape or be lost unintentionally, such as a word, a secret, or an opportunity.",
      "explanation_cn": "指无意中让某物溜走、丢失或泄露，如词语、秘密或机会。",
      "example_en": "He slipped the truth out during the heated argument.",
      "example_cn": "在激烈的争论中，他无意中说出了真相。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, unintentional mistake or error, especially one that is minor or easily overlooked.",
      "explanation_cn": "指一个微小的、无意的错误或疏忽，通常不严重或容易被忽视。",
      "example_en": "It was just a slipping in his speech—he didn’t mean to offend anyone.",
      "example_cn": "这只是他讲话中的一个小口误——他并非有意冒犯任何人。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sliding",
      "analysis": "“Sliding” (滑动) 更强调沿一个表面平稳、持续的横向移动，常用于物理运动（如滑梯、冰面滑行），带有一定控制性或方向性；而 “slipping” 更强调失去控制、意外或不稳定的滑动，常伴随危险或失误。"
    },
    {
      "word_to_compare": "deteriorating",
      "analysis": "“Deteriorating” (恶化) 是一个更正式、更广泛的术语，用于描述任何系统、状态或条件的持续性衰退，涵盖健康、环境、关系等；而 “slipping” 在表示衰退时更口语化，常用于个人表现、标准或行为的轻微下滑，语气较轻。"
    },
    {
      "word_to_compare": "leaking",
      "analysis": "“Leaking” (泄露) 通常指信息、液体或气体从容器或保密系统中意外逸出，强调物理或保密层面的“外泄”；而 “slipping” 在表示信息泄露时更侧重于言语或行为中的无意识失误，不一定是系统性漏洞。"
    }
  ]
}