{
  "word": "slip",
  "pronunciation": "slip",
  "concise_definition": "v. 滑倒, 滑动, 溜走, 误说; n. 滑倒, 纸条, 失误",
  "forms": {
    "third_person_singular": "slips",
    "past_tense": "slipped",
    "past_participle": "slipped",
    "present_participle": "slipping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move smoothly and unintentionally along a surface, often due to lack of friction or loss of control.",
      "explanation_cn": "指因摩擦力不足或失去控制而沿着表面不自觉地滑动或滑行。",
      "example_en": "She slipped on the icy sidewalk and fell.",
      "example_cn": "她在结冰的人行道上滑倒了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move quietly or stealthily, often to escape notice or avoid being caught.",
      "explanation_cn": "指悄悄地、偷偷地移动，通常是为了不被注意或避免被抓住。",
      "example_en": "He slipped out of the room while no one was looking.",
      "example_cn": "趁没人注意，他悄悄溜出了房间。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make an unintentional mistake, especially in speech or writing, such as saying the wrong word or omitting something important.",
      "explanation_cn": "指无意中犯错，尤指说话或写作时说错词或遗漏重要内容。",
      "example_en": "I slipped and called my boss by the wrong name.",
      "example_cn": "我不小心把老板的名字叫错了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small piece of paper used for writing a brief message, note, or record, often temporary or informal.",
      "explanation_cn": "指用于书写简短信息、便条或记录的一小张纸，通常为临时或非正式用途。",
      "example_en": "She left a slip of paper with her phone number on the kitchen counter.",
      "example_cn": "她在厨房台面上留下了一张写有电话号码的纸条。"
    },
    {
      "pos": "noun",
      "explanation_en": "A minor mistake or error, especially one that is embarrassing or reveals a lapse in judgment or attention.",
      "explanation_cn": "指轻微的错误或过失，尤指令人尴尬或暴露判断或注意力疏忽的失误。",
      "example_en": "It was just a slip of the tongue—he didn’t mean to offend anyone.",
      "example_cn": "这不过是口误而已——他并非有意冒犯任何人。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "slide",
      "analysis": "“Slide” (滑动) 强调沿表面平稳、持续的移动，常用于物理动作，如滑梯、冰面滑行，通常不带有隐含的“无意”或“逃避”意味。而 “slip” 更强调失去控制、意外或偷偷摸摸的性质，常含负面或隐蔽的语义色彩。"
    },
    {
      "word_to_compare": "mistake",
      "analysis": "“Mistake” (错误) 是一个更广泛、更正式的词，泛指任何错误的判断、行为或决定。而 “slip” 作为名词时特指轻微、偶然、非故意的失误，如口误或笔误，语气更轻，常用于日常语境。"
    },
    {
      "word_to_compare": "escape",
      "analysis": "“Escape” (逃脱) 指主动、有意识地逃离危险、限制或责任，通常带有强烈的意图和紧迫感。而 “slip” 在表示“溜走”时，强调的是悄无声息、不引人注意的离开，动作更轻巧、隐蔽，不一定涉及危险或压力。"
    }
  ]
}