{
  "word": "slipped",
  "pronunciation": "slip·t",
  "concise_definition": "v. 滑倒, 滑落, 溜走, 泄露 (slip 的过去式和过去分词)",
  "forms": {
    "base_form": "slip",
    "third_person_singular": "slips",
    "past_tense": "slipped",
    "past_participle": "slipped",
    "present_participle": "slipping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To accidentally lose one's balance and slide or fall, often due to a smooth or wet surface.",
      "explanation_cn": "指因地面光滑或湿滑而意外失去平衡，滑倒或跌倒。",
      "example_en": "She slipped on the icy sidewalk and hurt her ankle.",
      "example_cn": "她在结冰的人行道上滑倒，伤了脚踝。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or cause something to move quietly, quickly, or unnoticed, often in a way that avoids detection.",
      "explanation_cn": "指悄悄地、迅速地移动或使某物移动，通常是为了避免被发现。",
      "example_en": "He slipped the note into her pocket without anyone noticing.",
      "example_cn": "他悄悄把纸条塞进她的口袋，没人注意到。"
    },
    {
      "pos": "verb",
      "explanation_en": "To unintentionally reveal a secret or make a mistake, especially in speech or writing.",
      "explanation_cn": "指无意中泄露秘密或犯错，尤指在言语或文字中。",
      "example_en": "She slipped and told him the surprise was planned for next week.",
      "example_cn": "她一时说漏嘴，告诉他惊喜是下周准备的。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pass or go by unnoticed or unremarked, especially in reference to time.",
      "explanation_cn": "指时间悄然流逝而不被注意或察觉。",
      "example_en": "The hours slipped away as they chatted on the porch.",
      "example_cn": "他们在门廊上聊天时，时间悄然流逝。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fell",
      "analysis": "“Fell” (跌倒) 是 “fall” 的过去式，强调从高处或直立状态垂直下落，通常伴随明显的重力作用和冲击。而 “slipped” 强调因表面湿滑或失去摩擦力而导致的意外滑动，动作更平缓，常伴随身体失控但不一定从高处落下。"
    },
    {
      "word_to_compare": "sneaked",
      "analysis": "“Sneaked” (偷偷摸摸地走) 强调有意识地隐蔽行动，带有明确的意图避免被发现。而 “slipped” 在表示悄悄移动时，语气更轻、更自然，有时甚至无意识，不一定带有恶意或计划性。"
    },
    {
      "word_to_compare": "leaked",
      "analysis": "“Leaked” (泄露) 通常用于信息、液体或气体的非自愿外泄，常带有负面后果，且多用于系统性或持续性的泄密。而 “slipped” 在表示泄露秘密时，更强调一次性的、无心的口误或笔误，语气更口语化、轻微。"
    },
    {
      "word_to_compare": "passed",
      "analysis": "“Passed” (经过/过去) 是中性词，仅表示时间或事物从某处经过或结束。而 “slipped” 在描述时间流逝时，带有更强烈的隐喻色彩，暗示时间在不知不觉中悄然溜走，常带有惋惜或感慨的情感色彩。"
    }
  ]
}