{
  "word": "slit",
  "pronunciation": "slit",
  "concise_definition": "n. 切口, 狭缝; v. 切开, 割开",
  "forms": {
    "third_person_singular": "slits",
    "past_tense": "slit",
    "past_participle": "slit",
    "present_participle": "slitting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long, narrow opening or cut made in a surface or material, often intentionally for functional or decorative purposes.",
      "explanation_cn": "指在表面或材料上人为切出的狭长开口，通常用于功能性或装饰性目的。",
      "example_en": "She adjusted the dress by pulling the slit higher up her leg.",
      "example_cn": "她通过将裙子的开衩提高来调整裙装。"
    },
    {
      "pos": "noun",
      "explanation_en": "A narrow gap or crack, especially one formed naturally or by damage, through which something can pass or be seen.",
      "explanation_cn": "指自然形成或因损坏而产生的狭小缝隙，常用于让物体通过或供人窥视。",
      "example_en": "A thin slit of light escaped through the cracked door.",
      "example_cn": "一道细窄的光线从门缝中透了出来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a long, narrow cut in something using a sharp object, such as a knife or blade.",
      "explanation_cn": "用刀具等锋利物体在某物上切出一道狭长的口子。",
      "example_en": "The surgeon slit the patient’s skin to access the underlying tissue.",
      "example_cn": "外科医生切开病人的皮肤以暴露下方组织。"
    },
    {
      "pos": "verb",
      "explanation_en": "To divide or separate something by cutting along a narrow line, often to allow access or movement.",
      "explanation_cn": "沿一条狭长的线切开某物，通常是为了提供通道或便于移动。",
      "example_en": "He slit the envelope open with a letter opener.",
      "example_cn": "他用拆信刀划开了信封。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cut",
      "analysis": "“Cut” (切割) 是一个更广泛、通用的词，指任何用工具分离或切断的行为，可以是短切、斜切、锯切等；而 “slit” 特指狭长、细窄的切口，强调形状和方向，通常更精确、更轻微。"
    },
    {
      "word_to_compare": "incision",
      "analysis": "“Incision” (切口) 是医学或正式语境中对切口的术语，强调专业性、规范性和目的性（如手术切口），语气更正式；而 “slit” 更口语化，可指日常或暴力行为中的切口，不一定是医疗用途。"
    },
    {
      "word_to_compare": "gash",
      "analysis": "“Gash” (深裂口) 指的是深而宽、常因暴力或意外造成的撕裂伤，带有破坏性和伤害性；而 “slit” 通常是窄而长的，可能出于设计、功能或精细操作，不一定伴随严重损伤。"
    }
  ]
}