{
  "word": "slug",
  "pronunciation": "sluhg",
  "concise_definition": "n. 软体动物, 慢吞吞的人, 弹丸; v. 猛击, 痛打",
  "forms": {
    "plural": "slugs",
    "third_person_singular": "slugs",
    "past_tense": "slugged",
    "past_participle": "slugged",
    "present_participle": "slugging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A slow-moving, shell-less mollusk that lives in damp environments and feeds on plants, often considered a garden pest.",
      "explanation_cn": "一种生活在潮湿环境中、无壳的软体动物，以植物为食，常被视为园艺害虫。",
      "example_en": "After the rain, several slugs crawled across the garden path.",
      "example_cn": "雨后，几条蛞蝓爬过了花园小径。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is lazy, slow-moving, or lacks energy or ambition; often used informally or pejoratively.",
      "explanation_cn": "指懒惰、行动迟缓或缺乏活力与抱负的人，常用于非正式或贬义语境。",
      "example_en": "He’s been a slug all weekend, sleeping in and watching TV.",
      "example_cn": "整个周末他都像个懒虫，赖床看电视。"
    },
    {
      "pos": "noun",
      "explanation_en": "A heavy, often lead projectile, especially one used in shotguns or as a type of ammunition; also refers to a metal disc used in printing or typesetting.",
      "explanation_cn": "一种沉重的弹丸，常用于霰弹枪或作为弹药；也指印刷或排版中使用的金属片。",
      "example_en": "The hunter loaded his shotgun with slugs for better range and stopping power.",
      "example_cn": "猎人给霰弹枪装上了弹丸，以获得更远的射程和更强的停止力。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hit someone or something hard, especially with the fist; to punch forcefully.",
      "explanation_cn": "用力击打某人或某物，尤指用拳头猛击。",
      "example_en": "The boxer slugged his opponent in the jaw and knocked him down.",
      "example_cn": "拳击手一拳打在对手下巴上，把他打倒在地。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move slowly or heavily, often with effort or reluctance; to trudge or plod.",
      "explanation_cn": "缓慢而沉重地移动，常带有吃力或不情愿的意味；蹒跚而行。",
      "example_en": "The team slugged through the mud after the storm.",
      "example_cn": "风暴过后，队员们艰难地在泥泞中跋涉。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "snail",
      "analysis": "“Snail” (蜗牛) 与 “slug” (蛞蝓) 都是软体动物，但蜗牛有外壳，而蛞蝓没有。两者在生态习性上相似，但“slug”在英语中更常被用作比喻，形容懒惰的人，而“snail”则多用于形容缓慢的进程（如 snail mail）。"
    },
    {
      "word_to_compare": "punch",
      "analysis": "“Punch” (拳击) 是一个更通用的动词，指任何形式的击打，而 “slug” 作为动词时特指用重拳猛击，带有更强的暴力和冲击力。例如：He punched the wall（他打了墙）vs. He slugged the thief（他一拳猛击小偷）。"
    },
    {
      "word_to_compare": "laziness",
      "analysis": "“Laziness” (懒惰) 是一个抽象名词，描述一种状态或性格特征，而 “slug” 作为名词时是具体的人或物的比喻性称呼，更具形象性和口语色彩。说某人是 a slug 比说 he is lazy 更生动、更带贬义。"
    }
  ]
}