{
  "word": "slump",
  "pronunciation": "sluhmp",
  "concise_definition": "v. 剧降, 垂下, 萎靡; n. 萧条, 低谷, 垂头丧气",
  "forms": {
    "third_person_singular": "slumps",
    "past_tense": "slumped",
    "past_participle": "slumped",
    "present_participle": "slumping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To sink or fall suddenly and heavily, often due to weakness, fatigue, or loss of morale; can describe physical posture or economic conditions.",
      "explanation_cn": "指因虚弱、疲劳或士气低落而突然沉重地下沉或下跌，可用于描述身体姿态或经济状况。",
      "example_en": "After the loss, the team slumped in performance and morale.",
      "example_cn": "输掉比赛后，球队的表现和士气都一落千丈。"
    },
    {
      "pos": "verb",
      "explanation_en": "To sit or stand with a bent or drooping posture, often showing exhaustion, sadness, or lack of energy.",
      "explanation_cn": "指以弯曲或下垂的姿态坐着或站着，通常表现出疲惫、悲伤或缺乏活力。",
      "example_en": "He slumped in his chair, too tired to speak.",
      "example_cn": "他瘫坐在椅子上，累得连话都不想说。"
    },
    {
      "pos": "noun",
      "explanation_en": "A period of low economic activity, reduced sales, or poor performance, often following a time of prosperity.",
      "explanation_cn": "指在繁荣之后出现的一段经济活动低迷、销售下降或表现不佳的时期。",
      "example_en": "The housing market entered a deep slump after the financial crisis.",
      "example_cn": "金融危机后，房地产市场陷入严重萧条。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden and significant drop in value, quantity, or quality, especially in sports or business results.",
      "explanation_cn": "指价值、数量或质量的突然显著下降，尤指在体育或商业成果中的表现下滑。",
      "example_en": "The player is in a slump, having failed to score in his last five games.",
      "example_cn": "这名球员正处于低谷期，最近五场比赛都未能得分。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "decline",
      "analysis": "“Decline” (衰退) 是一个更中性、更广泛的术语，指逐渐减少或恶化的过程，可用于人口、健康、经济等多个领域，强调趋势的持续性。而 “slump” 更强调突然的、显著的、有时是戏剧性的下跌，常带有情绪或物理姿态的联想。"
    },
    {
      "word_to_compare": "dip",
      "analysis": "“Dip” (短暂下降) 指轻微、短暂的下降，通常不严重，且预期会迅速恢复。例如股价小幅下跌。而 “slump” 暗示更严重、更持久的低谷，恢复需要时间，常伴随负面情绪或系统性问题。"
    },
    {
      "word_to_compare": "sink",
      "analysis": "“Sink” (下沉) 更侧重于物理位置的下降，如船沉没、情绪沉入低谷，常带有不可逆或灾难性的意味。而 “slump” 更常用于描述可恢复的状态变化，如经济 slump 或运动员 slump，强调暂时性而非毁灭性。"
    }
  ]
}