{
  "word": "smackdown",
  "pronunciation": "smak·doun",
  "concise_definition": "n. 激烈的对抗, 猛烈的抨击, 摔角比赛",
  "forms": {
    "plural": "smackdowns"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A violent or forceful confrontation, often physical, especially in the context of professional wrestling, where competitors engage in dramatic, high-impact matches.",
      "explanation_cn": "指激烈甚至暴力的对抗，尤其在职业摔角比赛中，选手进行戏剧性、高强度的较量。",
      "example_en": "The WWE SmackDown episode featured a brutal championship rematch.",
      "example_cn": "WWE《SmackDown》节目上演了一场激烈的冠军重赛。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sharp, public criticism or verbal attack, often in a confrontational or humiliating manner, intended to decisively defeat an opponent in debate or argument.",
      "explanation_cn": "指公开、尖锐的批评或言语攻击，通常以对抗性或羞辱性的方式进行，旨在在辩论或争论中彻底击败对手。",
      "example_en": "The senator delivered a devastating smackdown against the policy during the televised debate.",
      "example_cn": "这位参议员在电视辩论中对这项政策进行了毁灭性的抨击。"
    },
    {
      "pos": "noun",
      "explanation_en": "A colloquial term for any decisive and overwhelming defeat, whether verbal, competitive, or metaphorical.",
      "explanation_cn": "指任何决定性的、压倒性的失败，无论是言语上的、竞技上的还是隐喻性的。",
      "example_en": "After the review, the movie got a smackdown from critics — it scored only 12% on Rotten Tomatoes.",
      "example_cn": "影评发布后，这部电影遭到影评人痛批，在烂番茄上仅获得12%的评分。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fight",
      "analysis": "“Fight”（战斗）是通用词，泛指任何形式的冲突，可以是身体的、言语的或抽象的，语义范围更广，中性或正式。而 “smackdown” 更强调戏剧性、压倒性、公开性的激烈对抗，常带娱乐性或贬义色彩，语气更强、更口语化。"
    },
    {
      "word_to_compare": "debate",
      "analysis": "“Debate”（辩论）是结构化、理性的观点交锋，强调逻辑与证据，通常保持礼貌。而 “smackdown” 指的是情绪激烈、攻击性强、甚至带有羞辱性的言语打击，缺乏辩论的克制性，更接近“痛斥”而非“讨论”。"
    },
    {
      "word_to_compare": "confrontation",
      "analysis": "“Confrontation”（对抗）是中性术语，描述双方直接对峙，可能平静也可能激烈，不必然包含胜利或羞辱的成分。而 “smackdown” 隐含一方彻底击败另一方的结果，带有强烈的胜负分明和娱乐化倾向，尤其在媒体语境中使用频繁。"
    }
  ]
}