{
  "word": "smacked",
  "pronunciation": "smak·t",
  "concise_definition": "v. （smack 的过去式和过去分词）拍打，打耳光，发出啪嗒声；adj. （非正式）明显的，显著的",
  "forms": {
    "base_form": "smack",
    "present_participle": "smacking",
    "third_person_singular": "smacks"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To strike someone or something sharply with an open hand or a flat object, often producing a loud sound.",
      "explanation_cn": "用手掌或扁平物体猛烈拍打某人或某物，通常发出响亮的声音。",
      "example_en": "The teacher smacked the desk to get the students' attention.",
      "example_cn": "老师拍了拍桌子，以引起学生的注意。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hit someone on the face, especially as a form of punishment or anger.",
      "explanation_cn": "用手掌击打某人的脸部，通常作为惩罚或发泄愤怒的方式。",
      "example_en": "He smacked his son for lying about his grades.",
      "example_cn": "他因为儿子成绩造假而打了他一耳光。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a sharp, wet sound by pressing and releasing lips or a surface, often while eating or kissing.",
      "explanation_cn": "通过嘴唇或表面快速压合与分离发出清脆的湿响，常在进食或亲吻时发生。",
      "example_en": "She smacked her lips after tasting the delicious soup.",
      "example_cn": "她品尝完美味的汤后咂了咂嘴。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Informal: Used to emphasize that something is clear, obvious, or unmistakable, often in phrases like 'a smacked result' or 'a smacked truth'.",
      "explanation_cn": "非正式用法：用于强调某事清晰、明显或不容置疑，常用于短语如 'a smacked result' 或 'a smacked truth'。",
      "example_en": "It was a smacked contradiction — he said he was home, but the security footage showed otherwise.",
      "example_cn": "这明显是个矛盾——他说自己在家，但监控录像显示并非如此。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hit",
      "analysis": "“Hit”（击打）是更通用的动词，可指任何形式的打击，包括使用拳头、工具或物体，不强调方式或声音。而 “smacked” 特指用掌或扁平物拍打，常伴随响亮的啪嗒声，更具动作的具象性和听觉特征。"
    },
    {
      "word_to_compare": "slapped",
      "analysis": "“Slapped” 与 “smacked” 在表示打耳光时高度近义，但 “slapped” 更常用于描述快速、单次、带有情绪的面部击打，而 “smacked” 可用于身体其他部位，且语气更口语化、更粗暴，有时带有惩罚或教训的意味。"
    },
    {
      "word_to_compare": "clapped",
      "analysis": "“Clapped”（拍手）通常指双手合拍，用于表达赞赏或吸引注意，动作是主动且中性的。而 “smacked” 是单手击打他人或物体，常含负面情绪或强制性，语义上更具有攻击性或侵入性。"
    },
    {
      "word_to_compare": "obvious",
      "analysis": "当 “smacked” 作形容词使用时（非正式），它与 “obvious”（明显的）语义相近，但 “smacked” 更具口语色彩和强调语气，常用于口语中加强判断的确定性，如 “a smacked lie” 比 “an obvious lie” 更具情绪张力和俚语感。"
    }
  ]
}