{
  "word": "smarter",
  "pronunciation": "smahr·tər",
  "concise_definition": "adj. 更聪明的, 更机智的, 更有智慧的",
  "forms": {
    "positive": "smart",
    "comparative": "smarter",
    "superlative": "smartest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having a higher level of intelligence, quickness in learning, or ability to apply knowledge effectively compared to others or to a previous state.",
      "explanation_cn": "相较于他人或先前状态，具有更高水平的智力、学习速度或有效运用知识的能力。",
      "example_en": "She became smarter after studying neuroscience and learning how the brain processes information.",
      "example_cn": "她在学习神经科学并了解大脑如何处理信息后，变得更加聪明了。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Showing cleverness or resourcefulness in solving problems or making decisions, often in a practical or strategic way.",
      "explanation_cn": "在解决问题或做决策时表现出机智或巧思，通常以实际或策略性的方式体现。",
      "example_en": "It was smarter to take the highway than to get stuck in city traffic for hours.",
      "example_cn": "选择走高速公路而不是在城市交通中堵上几个小时，是更明智的做法。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used informally to describe someone who acts in a way that appears superior or condescending, sometimes with a hint of sarcasm.",
      "explanation_cn": "非正式用法，形容某人表现得高人一等或居高临下，有时带有讽刺意味。",
      "example_en": "Oh, you're so much smarter now that you read one article about AI?",
      "example_cn": "哦，你读了一篇关于人工智能的文章，现在就觉得自己聪明多了？"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "intelligent",
      "analysis": "“Intelligent”（有智力的）是描述智力水平的中性、正式词汇，强调认知能力的总体高度，如逻辑、记忆、理解力等。而 “smarter” 是其比较级，更常用于日常语境，强调相对优势，有时带有主观判断或比较意味，语气更口语化。"
    },
    {
      "word_to_compare": "clever",
      "analysis": "“Clever”（灵巧的）侧重于解决问题的机智、技巧或创造力，尤其在应对复杂或突发情况时表现出的敏捷思维。而 “smarter” 范围更广，可涵盖学习能力、知识积累和判断力，不一定强调技巧性。一个聪明的人可能不博学，但一个更聪明的人通常兼具知识与机敏。"
    },
    {
      "word_to_compare": "wiser",
      "analysis": "“Wiser”（更明智的）强调基于经验、判断和道德洞察力的成熟决策，常与年龄、阅历相关。而 “smarter” 更关注认知能力、反应速度或知识运用，不一定包含价值观或长远眼光。一个人可以更聪明但不更明智，反之亦然。"
    }
  ]
}