{
  "word": "smear",
  "pronunciation": "smir",
  "concise_definition": "v. 涂抹, 污蔑, 诽谤; n. 污迹, 诽谤",
  "forms": {
    "third_person_singular": "smears",
    "past_tense": "smear",
    "past_participle": "smear",
    "present_participle": "smearing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To spread a substance, especially a thick or sticky one, over a surface, often in a messy or uneven way.",
      "explanation_cn": "指将某种物质（尤其是粘稠或油腻的）涂抹在表面上，通常以杂乱或不均匀的方式。",
      "example_en": "She smeared butter all over the toast.",
      "example_cn": "她把黄油厚厚地涂在吐司上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To damage someone's reputation by spreading false or malicious information about them, often for political or personal gain.",
      "explanation_cn": "指通过散布关于某人的虚假或恶意信息来损害其声誉，通常出于政治或个人利益。",
      "example_en": "The politician was accused of smearing his opponent with unfounded rumors.",
      "example_cn": "这位政客被指控散布不实谣言来诽谤对手。"
    },
    {
      "pos": "noun",
      "explanation_en": "A mark or stain left by something that has been smeared, especially a greasy or dirty substance.",
      "explanation_cn": "指因涂抹而留下的污迹或斑痕，尤指油腻或污秽的痕迹。",
      "example_en": "There was a smear of lipstick on the coffee cup.",
      "example_cn": "咖啡杯上留有一道口红印。"
    },
    {
      "pos": "noun",
      "explanation_en": "A false and damaging accusation or story intended to harm someone's reputation.",
      "explanation_cn": "指为损害他人声誉而编造的虚假指控或故事。",
      "example_en": "The media exposed the smear campaign against the whistleblower.",
      "example_cn": "媒体揭露了针对举报人的诽谤运动。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "stain",
      "analysis": "“Stain”（污渍）通常指因渗透或化学作用而留下的难以清除的痕迹，多为无意造成的，如红酒渍、墨水渍。而 “smear” 更强调涂抹动作本身留下的痕迹，常是人为、表面性的，且可能带有粘性或油腻感。"
    },
    {
      "word_to_compare": "defame",
      "analysis": "“Defame”（诽谤）是法律术语，专指通过发表虚假陈述损害他人名誉，强调行为的违法性。而 “smear” 更口语化，常用于政治或媒体语境，强调手段的卑劣和传播的广泛性，不一定构成法律意义上的诽谤。"
    },
    {
      "word_to_compare": "daub",
      "analysis": "“Daub”（涂抹）与 “smear” 都可指涂抹物质，但 “daub” 通常暗示用刷子或工具进行有目的的、较均匀的涂抹（如刷漆），而 “smear” 更强调随意、凌乱、甚至粗暴的涂抹，常带有负面含义。"
    }
  ]
}