{
  "word": "smell",
  "pronunciation": "smel",
  "concise_definition": "n. 气味, 臭味; v. 闻, 闻到, 散发气味",
  "forms": {
    "third_person_singular": "smells",
    "past_tense": "smelled",
    "past_participle": "smelled",
    "present_participle": "smelling",
    "plural": "smells"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The sensation perceived by the nose when volatile chemical compounds in the air interact with olfactory receptors; can be pleasant, unpleasant, or neutral.",
      "explanation_cn": "当空气中的挥发性化学物质与嗅觉受体相互作用时，鼻子所感知到的感觉；可以是令人愉悦的、令人不快的或中性的。",
      "example_en": "The smell of fresh bread filled the kitchen.",
      "example_cn": "新鲜面包的香味充满了厨房。"
    },
    {
      "pos": "noun",
      "explanation_en": "A distinctive or characteristic odor associated with a person, place, or thing, often used metaphorically to imply a subtle sign or trace.",
      "explanation_cn": "与某人、某地或某物相关的独特或典型气味，常用于隐喻，表示某种微妙的迹象或痕迹。",
      "example_en": "There's a smell of corruption around the entire project.",
      "example_cn": "整个项目中似乎有一股腐败的气味。"
    },
    {
      "pos": "verb",
      "explanation_en": "To perceive an odor through the nose; to detect a scent by inhaling.",
      "explanation_cn": "通过鼻子感知气味；通过吸气察觉某种气味。",
      "example_en": "I can smell rain coming — the air feels heavy.",
      "example_cn": "我能闻到要下雨了——空气变得沉闷。"
    },
    {
      "pos": "verb",
      "explanation_en": "To emit or give off a particular odor, whether intentional or not.",
      "explanation_cn": "散发或释放出某种气味，无论有意还是无意。",
      "example_en": "The garbage bin smells terrible after being left in the sun all day.",
      "example_cn": "垃圾桶在阳光下放了一整天，臭气熏天。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "odor",
      "analysis": "“Odor” (气味) 是一个更正式、更中性的术语，常用于科学或书面语境中，专指可被嗅觉感知的化学物质。它通常不带有情感色彩，而 “smell” 更口语化，且常隐含好恶判断（如 bad smell）。"
    },
    {
      "word_to_compare": "scent",
      "analysis": "“Scent” (香味/气味) 通常特指令人愉悦的、自然的或精心调配的气味，如花香、香水味，常用于描述动物或植物释放的吸引性气味。而 “smell” 是更通用的词，可涵盖所有类型，包括难闻的气味。"
    },
    {
      "word_to_compare": "aroma",
      "analysis": "“Aroma” (芳香) 专指令人愉悦的、复杂的气味，尤其用于食物、饮料或香料（如咖啡的香气）。它带有高度正面的情感联想，而 “smell” 是中性词，可指任何气味，无论好坏。"
    }
  ]
}