{
  "word": "smith",
  "pronunciation": "smith",
  "concise_definition": "n. 金属匠, 铁匠; v. 锻造, 制造",
  "forms": {
    "plural": "smiths",
    "third_person_singular": "smiths",
    "past_tense": "smithed",
    "past_participle": "smithed",
    "present_participle": "smithing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A skilled craftsman who shapes metal by forging, especially iron or steel, often using a hammer and anvil to create tools, weapons, or decorative items.",
      "explanation_cn": "指通过锻造（通常使用锤子和铁砧）来加工金属（尤其是铁或钢）以制造工具、武器或装饰品的熟练工匠，尤指铁匠。",
      "example_en": "The blacksmith forged a horseshoe from a bar of hot iron.",
      "example_cn": "铁匠将一根烧红的铁条锻造成了一只马蹄铁。"
    },
    {
      "pos": "noun",
      "explanation_en": "A surname or occupational name derived from the trade of metalworking, commonly found in English-speaking countries (e.g., John Smith).",
      "explanation_cn": "指源自金属加工职业的姓氏，在英语国家中极为常见（如约翰·史密斯）。",
      "example_en": "Smith is one of the most common surnames in the United States.",
      "example_cn": "史密斯是美国最常见的姓氏之一。"
    },
    {
      "pos": "verb",
      "explanation_en": "To shape, forge, or create metal objects through skilled labor, often implying careful craftsmanship and strength.",
      "explanation_cn": "指通过熟练的劳动锻造或制造金属制品，常暗示精细的工艺与力量。",
      "example_en": "The artisan smithed a delicate silver pendant by hand.",
      "example_cn": "这位工匠手工锻造出了一枚精致的银质吊坠。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form or devise something with great effort or ingenuity, often metaphorically referring to creating ideas, plans, or solutions.",
      "explanation_cn": "比喻性地指通过极大的努力或智慧来构思、制定某物，如想法、计划或解决方案。",
      "example_en": "They smithed a clever strategy to outmaneuver their competitors.",
      "example_cn": "他们精心策划了一项巧妙的策略来超越竞争对手。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "artisan",
      "analysis": "“Artisan”（手艺人）泛指任何从事精细手工制作的人，涵盖木工、陶艺、皮革等广泛领域，强调技艺与个性化生产；而 “smith” 专指金属加工者，职业范围更窄，但技术性更强，常与高温、锻造等特定工艺相关。"
    },
    {
      "word_to_compare": "fabricate",
      "analysis": "“Fabricate”（制造/伪造）可指物理制造，也可指捏造事实，常含贬义；而 “smith” 作为动词时强调通过技艺和体力创造实体金属制品，具有正面或中性的工艺含义，不包含欺骗成分。"
    },
    {
      "word_to_compare": "blacksmith",
      "analysis": "“Blacksmith” 是 “smith” 的一种具体类型，特指锻造黑色金属（如铁）的工匠；而 “smith” 本身是更广泛的术语，可指金匠（goldsmith）、银匠（silversmith）等，涵盖所有金属加工者。"
    }
  ]
}