{
  "word": "smoking",
  "pronunciation": "smoh·king",
  "concise_definition": "n. 吸烟, 吸烟行为; adj. 吸烟的, 冒烟的",
  "forms": {
    "base_form": "smoke",
    "third_person_singular": "smokes",
    "past_tense": "smoked",
    "past_participle": "smoked",
    "present_participle": "smoking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act or habit of inhaling and exhaling the smoke from burning tobacco, typically in a cigarette, cigar, or pipe.",
      "explanation_cn": "指吸入并呼出燃烧烟草所产生的烟雾的行为或习惯，通常通过香烟、雪茄或烟斗进行。",
      "example_en": "Smoking is banned in most public places for health reasons.",
      "example_cn": "出于健康原因，大多数公共场所禁止吸烟。"
    },
    {
      "pos": "noun",
      "explanation_en": "The visible vapor or smoke emitted from something burning, especially in a context indicating fire or heat.",
      "explanation_cn": "指从燃烧物中冒出的可见烟雾，常用于表示火灾或高温的迹象。",
      "example_en": "There was smoking coming from the kitchen, so we called the fire department.",
      "example_cn": "厨房里冒出烟来，所以我们拨打了消防电话。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characterized by the act of smoking; often used to describe areas, policies, or products associated with tobacco use.",
      "explanation_cn": "与吸烟行为相关或由其特征定义的；常用于描述与烟草使用相关的区域、政策或产品。",
      "example_en": "The restaurant has a smoking section for customers who prefer it.",
      "example_cn": "这家餐厅设有吸烟区，供偏好吸烟的顾客使用。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used in compound terms to describe something extremely hot, intense, or excellent (e.g., 'smoking hot').",
      "explanation_cn": "用于复合词中，形容某物极其炎热、激烈或出色（如 'smoking hot'）。",
      "example_en": "She showed up in a smoking hot dress that turned all heads.",
      "example_cn": "她穿着一件火辣的连衣裙出现，吸引了所有人的目光。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tobacco",
      "analysis": "“Tobacco” (烟草) 指植物本身或其加工制品，是吸烟的物质基础，但不直接表示行为。而 “smoking” 强调的是使用烟草的动态行为或过程。例如，我们说 “tobacco use” 指使用烟草制品，而 “smoking” 特指通过燃烧吸入烟雾的方式。"
    },
    {
      "word_to_compare": "vapor",
      "analysis": "“Vapor” (蒸汽/气雾) 是一种更广泛的物理状态，指任何物质的气态形式，包括水蒸气、电子烟雾等，不必然涉及燃烧或烟草。而 “smoking” 通常特指由燃烧产生的、含有颗粒物的烟雾，具有明确的健康风险和文化语境。"
    },
    {
      "word_to_compare": "burning",
      "analysis": "“Burning” (燃烧) 是一个物理化学过程，泛指物质与氧气反应产生热和光，而 “smoking” 是燃烧过程中可能伴随的现象之一。并非所有燃烧都会冒烟（如酒精燃烧），但吸烟必然涉及燃烧。因此，“smoking” 是特定语境下的燃烧结果，而非过程本身。"
    }
  ]
}