{
  "word": "smoky",
  "pronunciation": "smoh·kee",
  "concise_definition": "adj. 有烟的, 烟雾弥漫的, 烟熏味的, 模糊的",
  "forms": {
    "comparative": "smokier",
    "superlative": "smokiest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Containing or resembling smoke; filled with smoke or a smoky odor, often from burning material.",
      "explanation_cn": "含有或类似于烟的；充满烟雾或烟熏气味，通常来自燃烧的物质。",
      "example_en": "The room was smoky after the fire in the fireplace.",
      "example_cn": "壁炉着火后，房间里充满了烟雾。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Having a flavor or aroma imparted by smoking, especially in food preparation.",
      "explanation_cn": "具有通过烟熏方式赋予的风味或香气，尤指在食品加工中。",
      "example_en": "She preferred the smoky taste of grilled salmon over the plain boiled version.",
      "example_cn": "她更喜欢烟熏三文鱼的味道，而不是清蒸的。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by a hazy, indistinct, or blurred appearance, often used to describe eyes or visual effects.",
      "explanation_cn": "具有模糊、不清晰或朦胧的外观，常用于形容眼睛或视觉效果。",
      "example_en": "Her smoky eyes made her look mysterious and alluring in the dim light.",
      "example_cn": "在昏暗的光线下，她烟熏般的眼妆让她显得神秘而迷人。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing a voice or sound that is low, rough, and slightly hoarse, as if affected by smoke.",
      "explanation_cn": "形容声音低沉、沙哑，仿佛被烟雾影响过。",
      "example_en": "He had a smoky voice that captivated everyone at the jazz club.",
      "example_cn": "他那沙哑低沉的嗓音让爵士俱乐部里的每个人都着迷。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "foggy",
      "analysis": "“Foggy” (有雾的) 指由空气中微小水滴形成的自然雾气，导致能见度降低，通常与天气相关，不涉及燃烧或气味。而 “smoky” 强调由燃烧产生的烟尘，常带有气味、颜色或质感，更偏向人为或污染源。"
    },
    {
      "word_to_compare": "hazy",
      "analysis": "“Hazy” (朦胧的) 描述一种模糊不清的视觉状态，可能由灰尘、热气或轻雾引起，语义较中性，不必然与烟有关。而 “smoky” 的模糊通常隐含烟的存在，带有更强烈的感官联想（如气味、颜色、音质）。"
    },
    {
      "word_to_compare": "charred",
      "analysis": "“Charred” (烧焦的) 指物体因高温而表面碳化、变黑，强调物理破坏和焦痕。而 “smoky” 仅描述烟雾的存在或影响，不一定伴随烧焦，如烟熏风味的食物可能完全未被烧毁。"
    }
  ]
}