{
  "word": "smoke",
  "pronunciation": "smōk",
  "concise_definition": "n. 烟, 烟雾; v. 吸烟, 冒烟, 熏制",
  "forms": {
    "third_person_singular": "smokes",
    "past_tense": "smoked",
    "past_participle": "smoked",
    "present_participle": "smoking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The visible suspension of carbon or other particles in air, typically produced by combustion or burning.",
      "explanation_cn": "由燃烧或焚烧产生的、悬浮在空气中的碳或其他微粒的可见混合物，通常呈灰白色或灰色。",
      "example_en": "The fire produced thick smoke that filled the room.",
      "example_cn": "大火产生了浓烟，充满了整个房间。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slang term for marijuana or other smoked substances, especially in casual or countercultural contexts.",
      "explanation_cn": "俚语，指大麻或其他可吸食的物质，尤其在非正式或反主流文化语境中使用。",
      "example_en": "He was arrested for possessing a small amount of smoke.",
      "example_cn": "他因持有少量大麻而被逮捕。"
    },
    {
      "pos": "verb",
      "explanation_en": "To inhale and exhale the smoke from a cigarette, cigar, or pipe as a habit or pleasure.",
      "explanation_cn": "作为习惯或享受，吸入并呼出香烟、雪茄或烟斗冒出的烟。",
      "example_en": "She stopped smoking after her doctor warned her about lung cancer.",
      "example_cn": "医生警告她有患肺癌的风险后，她戒烟了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To emit smoke or vapor, especially from burning or heating.",
      "explanation_cn": "因燃烧或加热而冒出烟或蒸汽。",
      "example_en": "The engine began to smoke after overheating.",
      "example_cn": "引擎过热后开始冒烟。"
    },
    {
      "pos": "verb",
      "explanation_en": "To preserve or flavor food by exposing it to smoke, typically from burning wood.",
      "explanation_cn": "通过将食物暴露在燃烧木材产生的烟中，以达到腌制或增味的目的。",
      "example_en": "They smoke salmon over alder wood to give it a rich, savory flavor.",
      "example_cn": "他们用赤杨木熏制三文鱼，使其味道浓郁鲜美。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fume",
      "analysis": "“Fume”（烟雾/蒸气）通常指由化学物质、高温或压力产生的刺鼻或有毒气体，常带有负面情绪色彩（如“怒气冲冲”）。而 “smoke” 更中性，主要指燃烧产生的可见颗粒物，不必然有毒或刺鼻。"
    },
    {
      "word_to_compare": "vapor",
      "analysis": "“Vapor”（水蒸气/气态）是物质在气态下的形态，通常是透明无色的，如水蒸气。而 “smoke” 是固体微粒悬浮在气体中形成的可见混合物，颜色通常为灰或黑，且常伴随燃烧。"
    },
    {
      "word_to_compare": "cigarette",
      "analysis": "“Cigarette”（香烟）是具体的物品，是吸烟的工具；而 “smoke” 是其燃烧后产生的产物或行为本身。可以说 “He lit a cigarette”（他点了一支烟），但不能说 “He lit a smoke”（除非是俚语用法）。"
    }
  ]
}