{
  "word": "smoked",
  "pronunciation": "smoʊkt",
  "concise_definition": "adj. 被烟熏的, 被吸烟的; v. 熏制, 吸烟, 彻底击败 (过去式/过去分词)",
  "forms": {
    "base_form": "smoke",
    "third_person_singular": "smokes",
    "present_participle": "smoking",
    "past_tense": "smoked",
    "past_participle": "smoked"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing food or other items that have been preserved or flavored by exposure to smoke, typically from burning wood or other organic materials.",
      "explanation_cn": "指通过暴露于燃烧木材或其他有机物产生的烟雾中而被熏制或调味的食物或其他物品。",
      "example_en": "She bought a smoked salmon sandwich for lunch.",
      "example_cn": "她午餐买了一个熏三文鱼三明治。"
    },
    {
      "pos": "verb",
      "explanation_en": "To inhale and exhale the smoke from a cigarette, cigar, or pipe as a habit or social activity.",
      "explanation_cn": "指作为习惯或社交活动，吸入并呼出香烟、雪茄或烟斗产生的烟雾。",
      "example_en": "He smoked for over 30 years before quitting last year.",
      "example_cn": "他在去年戒烟之前已经吸烟超过30年。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cook or preserve food by exposing it to smoke, often over a long period of time, to enhance flavor and extend shelf life.",
      "explanation_cn": "指通过长时间暴露于烟雾中来烹饪或保存食物，以增强风味并延长保质期。",
      "example_en": "The butcher smokes his hams for two weeks using applewood.",
      "example_cn": "肉贩用苹果木烟熏他的火腿长达两周。"
    },
    {
      "pos": "verb",
      "explanation_en": "To defeat someone overwhelmingly or decisively, especially in a competition or argument; slang usage.",
      "explanation_cn": "（俚语）指在比赛或争论中彻底击败某人，取得压倒性胜利。",
      "example_en": "Our team smoked them in the final match — 10 to 1!",
      "example_cn": "我们在决赛中彻底击败了他们——10比1！"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "smoke",
      "analysis": "“Smoke” 是动词或名词的原形，泛指烟雾本身或吸烟的行为；而 “smoked” 是其过去式/过去分词形式，表示动作已完成，或作为形容词描述被烟熏的状态。例如：He smokes (现在习惯) vs. He smoked (过去行为) vs. smoked meat (状态描述)。"
    },
    {
      "word_to_compare": "barbecued",
      "analysis": "“Barbecued” (烧烤的) 指通过明火或高温直接加热烹饪食物，常伴随酱料；而 “smoked” 强调低温慢熏，依靠烟雾渗透风味，不依赖直接热源。两者都用于肉类，但工艺和风味截然不同。"
    },
    {
      "word_to_compare": "burned",
      "analysis": "“Burned” (烧焦的) 指因过度加热导致碳化或损坏，通常带有负面含义；而 “smoked” 是一种受控的、有意的加工过程，目的是提升风味和保存性，不等于烧毁。例如：burned toast vs. smoked cheese。"
    }
  ]
}