{
  "word": "snake",
  "pronunciation": "snāk",
  "concise_definition": "n. 蛇, 阴险的人; v. 蛇行, 曲折前进",
  "forms": {
    "plural": "snakes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long, legless reptile with a scaly body that moves by slithering, often associated with danger or venom in many cultures.",
      "explanation_cn": "一种身体覆盖鳞片、无腿的爬行动物，通过蜿蜒爬行移动，在许多文化中常与危险或毒性相关联。",
      "example_en": "The hiker carefully stepped around the snake coiled on the trail.",
      "example_cn": "徒步者小心翼翼地绕开了盘踞在小径上的蛇。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is deceitful, treacherous, or untrustworthy, often pretending to be friendly while harboring malicious intent.",
      "explanation_cn": "指一个狡猾、背信弃义或不可信赖的人，常表面友善，实则心怀恶意。",
      "example_en": "He’s a snake—he promised to help me, then stole my idea.",
      "example_cn": "他是个卑鄙小人——答应帮我，却偷走了我的点子。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move in a winding or twisting path, like a snake; to navigate through something in a serpentine manner.",
      "explanation_cn": "以蜿蜒曲折的方式移动，像蛇一样；以蛇行的方式穿过某物。",
      "example_en": "The river snakes through the valley, creating beautiful curves.",
      "example_cn": "这条河蜿蜒穿过山谷，形成优美的曲线。"
    },
    {
      "pos": "verb",
      "explanation_en": "To act in a sly or underhanded way to achieve a goal, often by manipulating others or avoiding direct confrontation.",
      "explanation_cn": "以狡猾或不正当的方式行事，以达成目标，常通过操纵他人或回避正面冲突。",
      "example_en": "She snaked her way into the meeting by pretending to be a guest.",
      "example_cn": "她假装是客人，偷偷混进了会议。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "serpent",
      "analysis": "“Serpent”（蛇）是“snake”的文学性或正式同义词，常用于宗教、神话或诗歌语境中，带有更强的象征意义（如邪恶、诱惑），而 “snake” 更口语化、日常化，可指实际动物或比喻人。"
    },
    {
      "word_to_compare": "worm",
      "analysis": "“Worm”（蠕虫）指无脊椎的细长软体动物，体型更小、无鳞、无毒，常象征卑微或可鄙，但不具攻击性。而 “snake” 体型更大、有鳞、常具毒性，象征危险与欺骗，语义强度和文化联想远强于 “worm”。"
    },
    {
      "word_to_compare": "wind",
      "analysis": "“Wind”（蜿蜒）作为动词时，可描述路径的曲折，如道路蜿蜒，但它是中性描述，无负面含义。而 “snake” 作为动词时，常隐含狡猾、隐蔽或不正当的意图，带有道德评判色彩。"
    }
  ]
}