{
  "word": "snapping",
  "pronunciation": "snap·ing",
  "concise_definition": "v. 突然折断, 咔哒作响, 发怒地说话; n. 折断声, 咔哒声",
  "forms": {
    "base_form": "snap",
    "third_person_singular": "snaps",
    "past_tense": "snapped",
    "past_participle": "snapped",
    "present_participle": "snapping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To break suddenly and completely, especially with a sharp sound, often due to stress or pressure.",
      "explanation_cn": "指因受压或拉力而突然完全断裂，常伴随清脆的响声。",
      "example_en": "The branch snapped under the weight of the snow.",
      "example_cn": "树枝在积雪的重压下突然折断了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a short, sharp sound, such as when a finger is flicked against the thumb or a camera shutter closes.",
      "explanation_cn": "指发出短促而清脆的声音，例如用手指弹击拇指或相机快门闭合时的声音。",
      "example_en": "She snapped her fingers to get the waiter's attention.",
      "example_cn": "她弹响手指以引起服务员的注意。"
    },
    {
      "pos": "verb",
      "explanation_en": "To speak in a sharp, angry, or impatient tone, often abruptly or rudely.",
      "explanation_cn": "指以尖锐、愤怒或不耐烦的语气说话，通常突然且无礼。",
      "example_en": "He snapped at his colleague for being late again.",
      "example_cn": "他因同事再次迟到而厉声斥责。"
    },
    {
      "pos": "noun",
      "explanation_en": "A short, sharp sound made by something breaking or being quickly moved, such as a twig breaking or a camera shutter.",
      "explanation_cn": "指某物断裂或快速移动时发出的短促清脆的声音，如树枝折断或相机快门声。",
      "example_en": "The snapping of twigs in the woods alerted the hikers to the presence of animals.",
      "example_cn": "森林中树枝折断的咔哒声提醒徒步者有动物出没。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cracking",
      "analysis": "“Cracking”（开裂）通常指物体表面出现裂缝或部分断裂，声音可能较闷或持续，如冰面开裂或皮肤干裂。而 “snapping” 强调完全断裂并伴随突然、响亮的清脆声，更具爆发性和完整性。"
    },
    {
      "word_to_compare": "clicking",
      "analysis": "“Clicking”（咔嗒声）多指机械装置或小部件轻快、规律的碰撞声，如鼠标点击或门锁声，声音较短但通常不伴随物理断裂。而 “snapping” 常涉及材料断裂或弹性释放，声音更有力、更具破坏性。"
    },
    {
      "word_to_compare": "yelling",
      "analysis": "“Yelling”（大喊）指用高音量说话，强调声音的响度和情绪强度，但不涉及语调的突然性或攻击性。而 “snapping”（厉声斥责）特指因情绪失控而突然、尖锐、带有敌意地说话，更强调语气的转变和情绪的爆发。"
    }
  ]
}