{
  "word": "snare",
  "pronunciation": "snair",
  "concise_definition": "n. 陷阱, 圈套; v. 诱捕, 陷害",
  "forms": {
    "plural": "snares",
    "third_person_singular": "snares",
    "past_tense": "snared",
    "past_participle": "snared",
    "present_participle": "snaring"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A device, often consisting of a noose or trap, designed to catch animals by the neck, leg, or body, typically used in hunting or trapping.",
      "explanation_cn": "一种用于捕捉动物的装置，通常由套索或陷阱构成，通过套住动物的颈部、腿部或身体来实现捕获，常用于狩猎或捕兽。",
      "example_en": "The hunter set a snare along the deer trail to catch his prey.",
      "example_cn": "猎人在鹿群经过的小径上设了一个陷阱来捕捉猎物。"
    },
    {
      "pos": "noun",
      "explanation_en": "A situation or scheme designed to deceive or entrap someone, often through manipulation or false promises.",
      "explanation_cn": "一种旨在欺骗或诱使他人陷入困境的圈套或计谋，通常通过操纵或虚假承诺实现。",
      "example_en": "He fell into the snare of a fraudulent investment scheme.",
      "example_cn": "他落入了一个欺诈性投资计划的圈套。"
    },
    {
      "pos": "verb",
      "explanation_en": "To catch or trap someone or something, especially an animal, using a snare or similar device.",
      "explanation_cn": "使用陷阱或其他类似装置捕捉某人或某物，尤指动物。",
      "example_en": "The poachers snared several endangered birds last week.",
      "example_cn": "偷猎者上周用陷阱捕获了几只濒危鸟类。"
    },
    {
      "pos": "verb",
      "explanation_en": "To entice or deceive someone into a difficult or dangerous situation, often through manipulation or flattery.",
      "explanation_cn": "通过操纵或奉承诱使某人陷入困难或危险的境地。",
      "example_en": "She was snared by his charming words and ended up losing her savings.",
      "example_cn": "她被他迷人的言辞所诱骗，最终损失了积蓄。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of drum used in a drum kit, characterized by a sharp, crisp sound produced by snares (taut wires) stretched across the bottom head.",
      "explanation_cn": "鼓组中的一种鼓，其特点是通过底部鼓面张紧的金属丝（响弦）发出清脆、尖锐的声音。",
      "example_en": "The drummer hit the snare hard to emphasize the beat.",
      "example_cn": "鼓手用力敲击军鼓以强调节奏。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "trap",
      "analysis": "“Trap”（陷阱）是更通用的词，泛指任何用于捕捉或困住人或动物的装置或情境，涵盖物理和隐喻用法。“Snare” 更具体，常指带套索的物理陷阱，或带有欺骗性、情感操控的隐喻性圈套，语义上更具隐蔽性和狡诈感。"
    },
    {
      "word_to_compare": "lure",
      "analysis": "“Lure”（诱饵）强调吸引或引诱的行为，通常通过提供诱惑（如食物、利益）来实现，不必然导致被捕获。“Snare” 则强调最终的捕获或陷害结果，带有更强的强制性和负面后果。"
    },
    {
      "word_to_compare": "net",
      "analysis": "“Net”（网）是一种物理捕获工具，通常用于大面积覆盖捕捉（如捕鱼、捕鸟），强调覆盖和围困；而 “snare” 通常是点状、隐蔽的装置，依赖精准触发，更强调个体捕获和欺骗性。"
    }
  ]
}