{
  "word": "snowden",
  "pronunciation": "snow·den",
  "concise_definition": "n. 爱德华·斯诺登（美国前国家安全局承包商雇员，2013年曝光全球监控计划的泄密者）",
  "forms": {
    "plural": "snowdens"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to Edward Snowden, a former contractor for the U.S. National Security Agency (NSA) who, in 2013, leaked classified documents revealing extensive global surveillance programs conducted by the U.S. and its allies, sparking worldwide debate on privacy, government transparency, and national security.",
      "explanation_cn": "专有名词，指爱德华·斯诺登，美国国家安全局（NSA）前承包商雇员，2013年泄露了大量机密文件，揭露了美国及其盟友实施的广泛全球监控计划，引发了全球关于隐私权、政府透明度与国家安全的激烈辩论。",
      "example_en": "Snowden's revelations led to major reforms in surveillance laws across several democracies.",
      "example_cn": "斯诺登的揭露促使多个民主国家对监控法律进行了重大改革。"
    },
    {
      "pos": "noun",
      "explanation_en": "By extension, a person who exposes secret or unethical practices within a powerful institution, often at great personal risk; used metaphorically to describe whistleblowers in general.",
      "explanation_cn": "引申义，指在强大机构内部揭露秘密或不道德行为、常冒着巨大个人风险的人；常被用作对举报者的隐喻性称呼。",
      "example_en": "She became a modern-day Snowden after publishing internal reports on corporate data misuse.",
      "example_cn": "她在公布公司数据滥用的内部报告后，成为了一名现代版的‘斯诺登’。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "whistleblower",
      "analysis": "“Whistleblower”（举报者）是一个通用术语，泛指任何揭露组织内部不当行为的人，不特指某个人或事件。而 “Snowden” 作为专有名词，已成为一个文化符号，特指那些以高调、大规模方式揭露政府机密、引发全球关注的举报者，带有强烈的政治与媒体象征意义。"
    },
    {
      "word_to_compare": "leaker",
      "analysis": "“Leaker”（泄密者）是一个中性甚至略带贬义的词，泛指任何非法或未经授权泄露信息的人，可能动机多样（如金钱、报复、意识形态）。而 “Snowden” 通常被支持者视为道德英雄，被批评者视为叛国者，其形象承载了复杂的道德与政治评价，远超普通“leaker”的语义范围。"
    },
    {
      "word_to_compare": "traitor",
      "analysis": "“Traitor”（叛徒）是强烈贬义词，暗示对国家或组织的背叛，常由政府或反对者使用。而 “Snowden” 本人及其支持者拒绝这一标签，强调其行为是为公众利益而揭露违法监控。因此，“Snowden” 是一个充满争议的符号，其语义取决于使用者的政治立场，而 “traitor” 则是单向的道德谴责。"
    }
  ]
}