{
  "word": "snuff",
  "pronunciation": "snuhf",
  "concise_definition": "n. 鼻烟; v. 用鼻吸鼻烟, 熄灭, 使窒息",
  "forms": {
    "third_person_singular": "snuffs",
    "past_tense": "snuffed",
    "past_participle": "snuffed",
    "present_participle": "snuffing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Finely ground tobacco that is inhaled through the nose, traditionally used as a stimulant or recreational substance.",
      "explanation_cn": "一种研磨极细的烟草粉，通过鼻腔吸入，传统上用作兴奋剂或娱乐性物质。",
      "example_en": "He took a pinch of snuff from his ornate box and inhaled it gently.",
      "example_cn": "他从一个精致的盒子里取出一小撮鼻烟，轻轻吸入。"
    },
    {
      "pos": "verb",
      "explanation_en": "To inhale snuff through the nose, typically as a habitual or social practice.",
      "explanation_cn": "通过鼻腔吸入鼻烟，通常作为一种习惯性或社交行为。",
      "example_en": "In the 18th century, many gentlemen would snuff at formal gatherings.",
      "example_cn": "在18世纪，许多绅士在正式聚会时都会吸鼻烟。"
    },
    {
      "pos": "verb",
      "explanation_en": "To extinguish a flame or light, especially by pinching or pressing it out with the fingers or a tool.",
      "explanation_cn": "通过用手指或工具捏压来熄灭火焰或灯光。",
      "example_en": "She snuffed the candle before going to bed.",
      "example_cn": "她上床前吹灭了蜡烛。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause someone to die suddenly or violently, especially by suffocation or murder; often used in a figurative or dramatic sense.",
      "explanation_cn": "指突然或暴力地导致某人死亡，尤指通过窒息或谋杀；常用于比喻或戏剧性语境。",
      "example_en": "The villain snuffed out the hero’s life with a single stab.",
      "example_cn": "反派用一剑夺去了英雄的生命。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cigarette",
      "analysis": "“Cigarette”（香烟）是通过口腔吸入燃烧的烟草，而 “snuff” 是通过鼻腔吸入未燃烧的细磨烟草。两者虽都是烟草制品，但使用方式、生理影响和文化背景截然不同。"
    },
    {
      "word_to_compare": "extinguish",
      "analysis": "“Extinguish”（熄灭）是更通用的术语，适用于任何火焰或光源的熄灭，包括水、灭火器或自然冷却等方式；而 “snuff” 特指通过物理压迫（如用手指捏灭）来熄灭蜡烛或灯芯，带有更具体、更形象的动作含义。"
    },
    {
      "word_to_compare": "kill",
      "analysis": "“Kill”（杀死）是广泛使用的中性词，涵盖所有致死方式；而 “snuff” 在作为动词使用时，带有强烈的文学性、戏剧性甚至粗暴感，常用于小说或影视中，强调死亡的突然性和暴力性，语义色彩更浓烈。"
    }
  ]
}