{
  "word": "soaked",
  "pronunciation": "sohktd",
  "concise_definition": "adj. 湿透的, 浸透的; v. (soak 的过去式和过去分词) 浸泡, 浸透",
  "forms": {
    "base_form": "soak",
    "third_person_singular": "soaks",
    "present_participle": "soaking",
    "past_tense": "soaked",
    "past_participle": "soaked"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Completely wet through, typically from being immersed in liquid for a period of time; often implies an excessive or undesirable level of wetness.",
      "explanation_cn": "完全被液体浸透的，通常指长时间浸泡在液体中，常暗示湿得过度或令人不适的状态。",
      "example_en": "She arrived at the party soaked from the heavy rain.",
      "example_cn": "她因下大雨而浑身湿透地到达了派对。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to become thoroughly wet by immersing it in liquid, often for a specific purpose such as cleaning, softening, or absorbing.",
      "explanation_cn": "通过将某物浸入液体中使其完全变湿，通常用于清洁、软化或吸收等目的。",
      "example_en": "He soaked the dried beans overnight to make them easier to cook.",
      "example_cn": "他把干豆子泡了一整晚，以便更容易煮熟。"
    },
    {
      "pos": "verb",
      "explanation_en": "To absorb or take in a large amount of liquid, often passively or unintentionally.",
      "explanation_cn": "被动或无意中吸收大量液体。",
      "example_en": "The sponge soaked up all the spilled water.",
      "example_cn": "海绵吸干了所有洒出的水。"
    },
    {
      "pos": "verb",
      "explanation_en": "To charge excessively or exploit someone financially, especially in informal usage (e.g., 'soak someone for money').",
      "explanation_cn": "（非正式用法）指对某人收取过高费用或进行经济剥削。",
      "example_en": "The hotel soaks tourists for $200 a night just for a basic room.",
      "example_cn": "这家酒店仅提供基础房间，却向游客收取每晚200美元的天价。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "wet",
      "analysis": "“Wet” (湿的) 是一个通用词，仅表示表面或部分有水分，程度较轻；而 “soaked” 强调完全浸透，水分已深入材料内部，程度更深、更强烈。"
    },
    {
      "word_to_compare": "drenched",
      "analysis": "“Drenched” 与 “soaked” 非常接近，常可互换，但 “drenched” 更常用于描述被雨水或大量液体突然淋透的状态，带有更强的突发性和戏剧性；而 “soaked” 可用于任何浸泡过程，包括缓慢或有意的浸润。"
    },
    {
      "word_to_compare": "saturated",
      "analysis": "“Saturated” (饱和的) 是一个更科学或技术性的术语，指物质已达到吸收液体的最大容量，不能再吸收更多；而 “soaked” 更口语化，仅表示已充分浸湿，不一定达到物理饱和极限。"
    }
  ]
}