{
  "word": "socrates",
  "pronunciation": "suh·kraht·eez",
  "concise_definition": "n. 苏格拉底（古希腊哲学家）",
  "forms": {
    "none": "专有名词，无复数或词形变化"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Socrates (c. 470–399 BCE) was a classical Greek philosopher who is considered one of the founders of Western philosophy. He is best known for the Socratic method—a form of cooperative argumentative dialogue to stimulate critical thinking and illuminate ideas—though he wrote no texts himself; his ideas were recorded by his students, especially Plato.",
      "explanation_cn": "苏格拉底（约公元前470–399年）是古希腊哲学家，被公认为西方哲学的奠基人之一。他以“苏格拉底式对话法”闻名，这是一种通过合作性辩论激发批判性思维、揭示思想本质的对话方式。尽管他本人未留下任何著作，其思想主要由学生（尤其是柏拉图）记录流传。",
      "example_en": "Socrates famously claimed, 'I know that I know nothing,' emphasizing the importance of intellectual humility.",
      "example_cn": "苏格拉底曾著名地宣称：‘我唯一知道的就是我一无所知’，强调了智力谦逊的重要性。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who embodies the principles of Socratic inquiry—questioning assumptions, seeking truth through dialogue, and valuing ethical reasoning over dogma.",
      "explanation_cn": "指一个体现苏格拉底式探究精神的人——质疑假设、通过对话寻求真理，并重视伦理推理而非教条。",
      "example_en": "In the debate, she was a true socrates, patiently challenging every unexamined belief with calm, probing questions.",
      "example_cn": "在这场辩论中，她是一位真正的‘苏格拉底’，以平静而深入的问题，耐心地挑战每一个未经检验的信念。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "plato",
      "analysis": "“Plato”（柏拉图）是苏格拉底的学生，他通过对话录记录了苏格拉底的思想，并在此基础上发展出自己的哲学体系（如理念论）。苏格拉底注重提问与对话，强调过程；柏拉图则更倾向于构建系统化的理论。因此，苏格拉底是‘方法的开创者’，而柏拉图是‘体系的建立者’。"
    },
    {
      "word_to_compare": "aristotle",
      "analysis": "“Aristotle”（亚里士多德）是柏拉图的学生，他更注重经验观察与分类逻辑，奠定了科学方法的基础。与苏格拉底以对话追问道德本质不同，亚里士多德倾向于通过系统分析得出普遍规律。苏格拉底关注‘人应该如何生活’，而亚里士多德更关注‘事物的本质是什么’。"
    },
    {
      "word_to_compare": "philosopher",
      "analysis": "“Philosopher”（哲学家）是泛指研究哲学的人，而 “Socrates” 是一个具体的历史人物，代表了哲学的起源与特定方法。所有苏格拉底都是哲学家，但并非所有哲学家都采用苏格拉底式的提问法。因此，'Socrates' 是一个具有历史与方法论双重意义的专有名词，而 'philosopher' 是一个通用类别。"
    }
  ]
}