{
  "word": "soil",
  "pronunciation": "soyl",
  "concise_definition": "n. 土壤, 土地; v. 污染, 弄脏",
  "forms": {
    "plural": "soils",
    "third_person_singular": "soils",
    "past_tense": "soiled",
    "past_participle": "soiled",
    "present_participle": "soiling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The upper layer of earth in which plants grow, composed of organic matter, minerals, gases, liquids, and microorganisms that support life.",
      "explanation_cn": "地球表面可供植物生长的表层，由有机质、矿物质、气体、液体和微生物组成，是生命赖以生存的基础。",
      "example_en": "The farmer tested the soil to determine its nutrient content before planting.",
      "example_cn": "农民在种植前检测了土壤的养分含量。"
    },
    {
      "pos": "noun",
      "explanation_en": "A particular type or area of land, often used to refer to a country or region in a poetic or nationalistic context.",
      "explanation_cn": "特指某种类型或地区的土地，常用于诗歌或民族主义语境中，代指祖国或故土。",
      "example_en": "He fought bravely to defend his native soil.",
      "example_cn": "他英勇战斗，保卫自己的故土。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make something dirty or stained, especially by contact with dirt, feces, or other unclean substances.",
      "explanation_cn": "通过接触泥土、粪便或其他污物使某物变脏或弄污。",
      "example_en": "The children soiled their clothes while playing in the mud.",
      "example_cn": "孩子们在泥地里玩耍时把衣服弄脏了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To damage the reputation or purity of something, often used metaphorically to describe moral or ethical contamination.",
      "explanation_cn": "比喻性地指损害某物的声誉或纯洁性，常用于描述道德或伦理上的玷污。",
      "example_en": "The scandal soiled the politician's once-pristine image.",
      "example_cn": "这起丑闻玷污了这位政客曾经清白的形象。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "dirt",
      "analysis": "“Dirt” (污垢) 通常指具体的、琐碎的脏物，如灰尘、泥巴，语气较口语化，常用于日常语境。而 “soil” 作为名词时更正式，可指农业或地质意义上的土壤，作为动词时也更强调对纯洁性或声誉的玷污，语义范围更广。"
    },
    {
      "word_to_compare": "earth",
      "analysis": "“Earth” (大地) 是一个更宏大、更抽象的词，常指整个星球或自然界的土地，具有诗意或哲学意味。而 “soil” 更具体，强调其作为植物生长介质的物理和化学特性，常用于科学或农业语境。"
    },
    {
      "word_to_compare": "contaminate",
      "analysis": "“Contaminate” (污染) 通常用于科学或环境语境，强调引入有害物质（如化学物、病原体）导致不纯，侧重客观的物理/化学过程。而 “soil” 作为动词时，既可以指物理上的弄脏，也可用于道德层面的玷污，语义更丰富，情感色彩更强。"
    }
  ]
}