{
  "word": "solid",
  "pronunciation": "sah·lid",
  "concise_definition": "adj. 固体的, 坚实的, 可靠的; n. 固体",
  "forms": {
    "comparative": "solider",
    "superlative": "solidest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having a firm, hard, and non-liquid or non-gaseous state; physically dense and continuous without gaps or holes.",
      "explanation_cn": "指具有坚固、坚硬、非液态或非气态的物理状态；实体致密，无间隙或孔洞。",
      "example_en": "The ice remained solid even in the warm room.",
      "example_cn": "即使在温暖的房间里，冰块依然保持固态。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Reliable, stable, or strong in quality, character, or performance; not easily shaken or compromised.",
      "explanation_cn": "指在质量、品格或表现上可靠、稳定或坚固；不易被动摇或破坏。",
      "example_en": "She gave a solid performance that earned her critical acclaim.",
      "example_cn": "她的表现扎实稳健，赢得了评论界的一致好评。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Not based on speculation or theory; grounded in fact, evidence, or practical reality.",
      "explanation_cn": "指不基于推测或理论，而是建立在事实、证据或现实基础之上的。",
      "example_en": "We need solid evidence before we can draw any conclusions.",
      "example_cn": "在得出任何结论之前，我们需要确凿的证据。"
    },
    {
      "pos": "noun",
      "explanation_en": "A state of matter characterized by fixed shape and volume, as opposed to liquids or gases.",
      "explanation_cn": "指一种物质状态，具有固定的形状和体积，区别于液体或气体。",
      "example_en": "Water can exist in three states: solid, liquid, and gas.",
      "example_cn": "水可以以三种状态存在：固态、液态和气态。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "firm",
      "analysis": "“Firm”（坚固的）强调结构或质地的紧实和不易变形，常用于描述物体或态度，但不一定具有“solid”所包含的物理实体性或绝对可靠性。例如，一个“firm pillow”是支撑良好的，但未必是“solid”（实心）的。而 “solid” 更强调物质的完整性和不可穿透性。"
    },
    {
      "word_to_compare": "strong",
      "analysis": "“Strong”（强大的）侧重于承受外力、抵抗破坏的能力，常用于力量、意志或结构强度。而 “solid” 更强调物质的连续性、密度和可靠性，不一定涉及力量大小。例如，一块“solid wood”可能并不“strong”（如软木），但它是实心的。"
    },
    {
      "word_to_compare": "reliable",
      "analysis": "“Reliable”（可靠的）是抽象意义上的可信赖，常用于人、系统或信息。而 “solid” 在此语义上更具体，常用于描述质量、证据或表现的扎实程度，带有物理隐喻（如“solid ground”）。两者可互换，但 “solid” 更具形象感和物质基础。"
    }
  ]
}