{
  "word": "solids",
  "pronunciation": "sah·lihz",
  "concise_definition": "n. 固体, 固态物质, 坚实部分",
  "forms": {
    "singular": "solid"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Matter that has a fixed shape and volume, with particles closely packed together, resisting deformation; one of the four fundamental states of matter (along with liquids, gases, and plasmas).",
      "explanation_cn": "指具有固定形状和体积的物质，其粒子紧密排列，难以变形；是物质的四种基本状态之一（其他为液体、气体和等离子体）。",
      "example_en": "Ice, rock, and metal are all examples of solids.",
      "example_cn": "冰、岩石和金属都是固体的例子。"
    },
    {
      "pos": "noun",
      "explanation_en": "In mathematics or geometry, a three-dimensional object with length, width, and height, such as a cube, sphere, or pyramid.",
      "explanation_cn": "在数学或几何学中，指具有长、宽、高三个维度的物体，如立方体、球体或金字塔。",
      "example_en": "The lesson focused on calculating the volume of various solids.",
      "example_cn": "这节课的重点是计算各种立体图形的体积。"
    },
    {
      "pos": "noun",
      "explanation_en": "In music or art, a term sometimes used to describe a firm, well-defined structure or form, especially in contrast to fluid or abstract elements.",
      "explanation_cn": "在音乐或艺术中，有时用来形容坚实、明确的结构或形式，尤其相对于流动或抽象的元素而言。",
      "example_en": "The composition balances delicate melodies with solid harmonies.",
      "example_cn": "这首作品将细腻的旋律与坚实的和声相结合。"
    },
    {
      "pos": "noun",
      "explanation_en": "In cooking or nutrition, the solid components of food, especially as opposed to liquids or fats; often refers to the non-liquid residue after processing.",
      "explanation_cn": "在烹饪或营养学中，指食物中的固体成分，尤其相对于液体或脂肪而言；常指加工后残留的非液体部分。",
      "example_en": "The soup was strained to remove the solids before serving.",
      "example_cn": "上菜前，将汤过滤以去除固体残渣。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "liquids",
      "analysis": "“Liquids”（液体）与 “solids” 相对，具有固定体积但无固定形状，能流动并适应容器的形态。固体粒子排列紧密，不易流动；液体粒子间作用力较弱，可自由移动。两者在物理性质、分子结构和日常应用中形成鲜明对比。"
    },
    {
      "word_to_compare": "gases",
      "analysis": "“Gases”（气体）与 “solids” 在形态和分子运动上差异极大：气体无固定形状和体积，粒子间距大、运动剧烈；固体则结构稳定、密度高。气体易被压缩，固体几乎不可压缩，这是区分二者的核心物理特征。"
    },
    {
      "word_to_compare": "structures",
      "analysis": "“Structures”（结构）泛指任何有组织的系统或形态，可指建筑、生物组织或抽象体系，不特指物质状态。而 “solids” 专指物质的物理状态或几何实体，范围更窄、更具体。在数学语境中，两者可能重叠，但 “structures” 更强调功能与组织，而 “solids” 强调物质形态。"
    }
  ]
}