{
  "word": "solos",
  "pronunciation": "soh·lohz",
  "concise_definition": "n. 独奏, 独唱, 独舞; v. 独奏, 独唱, 独舞",
  "forms": {
    "singular": "solo"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A musical passage performed by a single musician or singer, often as a prominent feature within a larger composition, showcasing individual skill and expression.",
      "explanation_cn": "指由一位音乐家或歌手单独演奏或演唱的乐段，通常作为大型作品中的亮点，用以展示个人技巧与情感表达。",
      "example_en": "The saxophonist played a breathtaking solo during the jazz concert.",
      "example_cn": "在爵士音乐会上，萨克斯手演奏了一段令人叹为观止的独奏。"
    },
    {
      "pos": "noun",
      "explanation_en": "A performance by a single dancer, actor, or artist without accompaniment or ensemble, emphasizing individual artistry.",
      "explanation_cn": "指一位舞者、演员或艺术家在无伴奏或无群体配合的情况下进行的表演，突出个人艺术表现力。",
      "example_en": "Her solo in the modern dance piece moved the entire audience to tears.",
      "example_cn": "她在现代舞作品中的独舞感动了全场观众。"
    },
    {
      "pos": "verb",
      "explanation_en": "To perform alone, especially in music or dance, without the support of other performers.",
      "explanation_cn": "指独自表演，尤指在音乐或舞蹈中不依赖其他表演者支持。",
      "example_en": "The guitarist solos for three minutes in the middle of the song.",
      "example_cn": "吉他手在歌曲中间独奏了三分钟。"
    },
    {
      "pos": "verb",
      "explanation_en": "To act independently or without collaboration, often implying self-reliance or isolation.",
      "explanation_cn": "指独立行动，不与他人合作，常暗示自力更生或孤立状态。",
      "example_en": "He decided to solo the project after his team withdrew their support.",
      "example_cn": "在团队撤回支持后，他决定独自完成这个项目。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "duet",
      "analysis": "“Duet”（二重奏）指由两位表演者共同完成的音乐或舞蹈作品，强调合作与互动。而 “solo” 强调完全的个人表现，没有任何合作者，突出个体的主导性与独立性。"
    },
    {
      "word_to_compare": "ensemble",
      "analysis": "“Ensemble”（合奏/群舞）指多个表演者协同完成的整体演出，注重和谐与统一。与之相对，”solo“ 是从 ensemble 中剥离出来的个体部分，其核心价值在于突出个人风格与技艺。"
    },
    {
      "word_to_compare": "feature",
      "analysis": "“Feature”（主打/特别呈现）是一个更宽泛的术语，指在表演、电影或活动中被突出展示的元素，可能是独奏，也可能是某个角色或段落。而 “solo” 是一种具体的表演形式，特指由单一表演者完成的完整段落，具有明确的音乐或艺术结构。"
    }
  ]
}