{
  "word": "sort",
  "pronunciation": "sawrt",
  "concise_definition": "n. 种类, 类型; v. 分类, 整理, 选择",
  "forms": {
    "third_person_singular": "sorts",
    "past_tense": "sorted",
    "past_participle": "sorted",
    "present_participle": "sorting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A category or type of something, often used to refer to a group of things sharing similar characteristics.",
      "explanation_cn": "指具有相似特征的一类事物，常用于对物品、人或概念进行归类。",
      "example_en": "I'm not interested in that sort of music.",
      "example_cn": "我对那种类型的音乐不感兴趣。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing of a particular kind, often used in informal or slightly derogatory contexts (e.g., 'that sort of person').",
      "explanation_cn": "指某一类人或事物，常用于非正式语境，有时带有轻微贬义（如 '那种人'）。",
      "example_en": "He's not the sort of person you can trust with secrets.",
      "example_cn": "他不是那种可以托付秘密的人。"
    },
    {
      "pos": "verb",
      "explanation_en": "To arrange or group items according to type, quality, or other characteristics, often systematically.",
      "explanation_cn": "指根据类型、质量或其他特征对物品进行有条理的整理或归类。",
      "example_en": "She sorted the laundry into piles of whites and colors.",
      "example_cn": "她把洗衣物按白色和彩色分成了几堆。"
    },
    {
      "pos": "verb",
      "explanation_en": "To resolve or deal with a problem or situation, often implying bringing order or a solution.",
      "explanation_cn": "指解决或处理某个问题或情况，通常暗示使混乱变得有序或找到解决方案。",
      "example_en": "We need to sort out this misunderstanding before it gets worse.",
      "example_cn": "我们需要在事态恶化前解决这个误会。"
    },
    {
      "pos": "verb",
      "explanation_en": "To select or choose something appropriate from a range of options, often used in the phrase 'sort through'.",
      "explanation_cn": "指从多种选项中挑选出合适的一项，常用于短语 'sort through'（仔细筛选）。",
      "example_en": "He spent hours sorting through old letters to find the one he needed.",
      "example_cn": "他花了数小时翻找旧信件，想找那封他需要的信。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "type",
      "analysis": "“Type” (类型) 更强调本质上的分类，通常用于科学、技术或正式语境，指具有明确共同属性的类别。而 “sort” 更口语化，常用于日常表达，分类标准可能较模糊或主观。"
    },
    {
      "word_to_compare": "classify",
      "analysis": "“Classify” (分类) 是更正式、系统化的术语，常用于学术、法律或科学领域，强调依据明确标准进行层级划分。而 “sort” 更通用，动作更简单直接，不一定需要严格标准。"
    },
    {
      "word_to_compare": "organize",
      "analysis": "“Organize” (组织) 强调使事物有条理、结构化，可能包括排序、安排时间或空间，范围更广。而 “sort” 更专注于按类别分组，是组织过程中的一个具体步骤。"
    }
  ]
}