{
  "word": "soul",
  "pronunciation": "sohl",
  "concise_definition": "n. 灵魂, 精神, 人, 核心",
  "forms": {
    "plural": "souls"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The spiritual or immaterial part of a human being, often regarded as the seat of emotions, character, and consciousness, believed by many to survive physical death.",
      "explanation_cn": "人类身上精神或非物质的部分，常被视为情感、性格和意识的中心，许多人相信它在肉体死亡后仍能存在。",
      "example_en": "Many religions teach that the soul is eternal and continues to exist after death.",
      "example_cn": "许多宗教教导说，灵魂是永恒的，死后仍将继续存在。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person regarded as an embodiment of a particular quality, especially deep feeling, passion, or authenticity; often used to describe artists or performers with great emotional depth.",
      "explanation_cn": "指体现某种特质（尤其是深刻情感、激情或真实性）的人，常用于形容具有深厚情感表达力的艺术家或表演者。",
      "example_en": "She’s not just a singer—she’s a soul. Her voice moves people to tears.",
      "example_cn": "她不仅仅是一位歌手——她是一个有灵魂的人。她的歌声能让人热泪盈眶。"
    },
    {
      "pos": "noun",
      "explanation_en": "The essential or most important part of something, especially when it defines its true nature or character.",
      "explanation_cn": "指某物的本质或最重要部分，尤其当它定义了该物的真实性质或特征时。",
      "example_en": "The soul of this city is its vibrant street culture and historic architecture.",
      "example_cn": "这座城市的灵魂在于其充满活力的街头文化与历史建筑。"
    },
    {
      "pos": "noun",
      "explanation_en": "In music, a genre originating in African American communities in the 1950s and 1960s, characterized by strong rhythms, emotional vocals, and gospel influences.",
      "explanation_cn": "在音乐中，指20世纪50至60年代起源于非裔美国人社区的一种音乐流派，以强烈的节奏、富有情感的演唱和福音音乐影响为特征。",
      "example_en": "Aretha Franklin is known as the Queen of Soul for her powerful and heartfelt performances.",
      "example_cn": "艾瑞莎·弗兰克林因她充满力量与真挚情感的演唱被誉为灵魂乐女王。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "spirit",
      "analysis": "“Spirit” (精神) 更侧重于生命力、情绪或意志层面，常用于描述人的斗志、情绪状态或抽象的精神力量（如团队精神）。而 “soul” 更具宗教或哲学深度，强调个体存在的本质与永恒性，常与死亡、救赎等概念相连。"
    },
    {
      "word_to_compare": "mind",
      "analysis": "“Mind” (心智) 指理性思维、认知和意识活动，是逻辑与智力的中心。而 “soul” 更关注情感、道德与超越理性的存在层面，常被视为非理性、非科学可测量的内在核心。"
    },
    {
      "word_to_compare": "heart",
      "analysis": "“Heart” (心) 常用于比喻情感、爱与同情，如 ‘follow your heart’。它更贴近日常情感表达，而 ‘soul’ 更深邃、更形而上，不仅包含情感，还涉及身份、本质与永恒性。在文学中，‘soul’ 比 ‘heart’ 更具神圣性和终极意义。"
    }
  ]
}