{
  "word": "sourced",
  "pronunciation": "sawrst",
  "concise_definition": "adj. 有来源的, 有出处的; v. (source 的过去式和过去分词) 采购, 获取, 从...取得",
  "forms": {
    "base_form": "source",
    "past_tense": "sourced",
    "past_participle": "sourced",
    "present_participle": "sourcing",
    "third_person_singular": "sources"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing something whose origin or provider is known, verified, or explicitly identified, often to emphasize authenticity, reliability, or ethical provenance.",
      "explanation_cn": "指某物的来源已被知晓、核实或明确标注，常用于强调其真实性、可靠性或符合道德的出处。",
      "example_en": "The restaurant prides itself on sourced ingredients from local organic farms.",
      "example_cn": "这家餐厅以其使用来自本地有机农场的有来源食材而自豪。"
    },
    {
      "pos": "verb",
      "explanation_en": "To obtain or procure something, especially materials, goods, or information, from a particular place or supplier.",
      "explanation_cn": "指从特定地点或供应商处获取某物，尤指材料、商品或信息。",
      "example_en": "The company sources its raw materials from sustainable forests in Canada.",
      "example_cn": "该公司从加拿大可持续管理的森林中采购原材料。"
    },
    {
      "pos": "verb",
      "explanation_en": "To identify and establish a reliable origin or supplier for a product, service, or data, often as part of quality control or transparency efforts.",
      "explanation_cn": "指为产品、服务或数据识别并建立可靠的来源或供应商，常作为质量控制或透明度管理的一部分。",
      "example_en": "Journalists must source their information carefully to avoid spreading misinformation.",
      "example_cn": "记者必须谨慎核实信息来源，以避免传播错误信息。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "obtained",
      "analysis": "“Obtained” (获得) 是一个更通用的词，泛指通过任何方式得到某物，不强调来源的可追溯性或可靠性。而 “sourced” 特别强调对来源的主动寻找、甄选和确认，常用于供应链、新闻或伦理语境中，带有更强的专业性和责任意识。"
    },
    {
      "word_to_compare": "derived",
      "analysis": "“Derived” (衍生) 指某物从另一物中产生或推导而来，常用于抽象概念、化学成分或理论推导，强调逻辑或物理上的转化关系。而 “sourced” 更侧重于实际采购或获取行为，对象通常是实物或可追踪的信息，不涉及转化过程。"
    },
    {
      "word_to_compare": "procured",
      "analysis": "“Procured” (采购) 与 “sourced” 在商业语境中常可互换，但 “procured” 更侧重于完成购买或获取的行动本身，而 “sourced” 更强调寻找、评估和确定供应商的全过程，包含前期调研和关系建立，语义范围更广。"
    }
  ]
}