{
  "word": "source",
  "pronunciation": "sawrs",
  "concise_definition": "n. 来源, 信源, 起源, 电源; v. 获取, 从…采购",
  "forms": {
    "plural": "sources"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The origin or point from which something comes, is obtained, or is derived; can refer to physical, informational, or abstract origins.",
      "explanation_cn": "指某事物的起源、出处或获取途径，可指物质的、信息的或抽象的来源。",
      "example_en": "The river's source is a spring high in the mountains.",
      "example_cn": "这条河的源头是高山上的一处泉水。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person, document, or entity that provides information, especially in journalism or research; a reference or authority.",
      "explanation_cn": "指在新闻报道或研究中提供信息的人、文件或机构，即信息来源或引用依据。",
      "example_en": "The journalist cited anonymous sources for the report.",
      "example_cn": "记者引用了匿名信源来撰写这篇报道。"
    },
    {
      "pos": "noun",
      "explanation_en": "A supply of energy or power, such as electricity, fuel, or heat, that can be harnessed or utilized.",
      "explanation_cn": "指可被利用的能源或电力供应，如电能、燃料或热能。",
      "example_en": "Solar energy is a clean and renewable source of power.",
      "example_cn": "太阳能是一种清洁且可再生的能源。"
    },
    {
      "pos": "verb",
      "explanation_en": "To obtain or procure something from a particular place or supplier, especially in business or manufacturing contexts.",
      "explanation_cn": "指从特定地点或供应商处获取某物，常用于商业或制造语境中。",
      "example_en": "The company sources its raw materials from sustainable forests.",
      "example_cn": "该公司从可持续管理的森林采购原材料。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "origin",
      "analysis": "“Origin” (起源) 更强调事物最初的产生点或开端，常用于历史、文化或生物背景，侧重于时间上的起点。而 “source” 更广泛，可指任何获取或产生某物的渠道，包括物质、信息或能量，适用范围更广。"
    },
    {
      "word_to_compare": "origin",
      "analysis": "“Origin” (起源) 更强调事物最初的产生点或开端，常用于历史、文化或生物背景，侧重于时间上的起点。而 “source” 更广泛，可指任何获取或产生某物的渠道，包括物质、信息或能量，适用范围更广。"
    },
    {
      "word_to_compare": "resource",
      "analysis": "“Resource” (资源) 指可被利用来达成目标的材料、资产或能力，强调可用性和功能性。而 “source” 更关注事物的出处或产生地，不一定具有可消耗性。例如，石油是资源，而油田是其来源。"
    },
    {
      "word_to_compare": "root",
      "analysis": "“Root” (根源) 常用于比喻性语境，指问题或现象的根本原因，强调深层、隐性的基础。而 “source” 更直接、更表层，常用于可观察或可追踪的起点，如信息来源或水源。"
    }
  ]
}