{
  "word": "soviets",
  "pronunciation": "soh·veets",
  "concise_definition": "n. 苏维埃, 苏联的工人代表会议, 苏联",
  "forms": {
    "singular": "soviet"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A council or assembly of workers, soldiers, or peasants in Russia, especially during and after the 1917 Revolution, which served as a basic unit of political organization and later became the foundation of the Soviet government.",
      "explanation_cn": "指俄国在1917年革命期间及之后出现的工人、士兵或农民代表会议，作为基本的政治组织单位，后来成为苏联政府的基础。",
      "example_en": "The Bolsheviks seized power by gaining control of the soviets in Petrograd.",
      "example_cn": "布尔什维克通过控制彼得格勒的苏维埃夺取了政权。"
    },
    {
      "pos": "noun",
      "explanation_en": "A member of the government or political system of the Union of Soviet Socialist Republics (USSR), or anything related to the USSR.",
      "explanation_cn": "指苏联（苏维埃社会主义共和国联盟）政府或政治体制的成员，或与苏联有关的任何事物。",
      "example_en": "Soviet scientists made major contributions to space exploration in the 20th century.",
      "example_cn": "苏联科学家在20世纪为太空探索做出了重大贡献。"
    },
    {
      "pos": "noun",
      "explanation_en": "Used collectively to refer to the Union of Soviet Socialist Republics (USSR) itself, especially in Western contexts during the Cold War.",
      "explanation_cn": "常用于西方语境中，特别是在冷战时期，作为对苏维埃社会主义共和国联盟（苏联）本身的统称。",
      "example_en": "During the Cold War, tensions between the United States and the Soviets were at their peak.",
      "example_cn": "在冷战期间，美国与苏联之间的紧张关系达到顶峰。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "communists",
      "analysis": "“Communists”（共产主义者）指信奉共产主义意识形态的人或团体，是一个政治信仰群体；而 “soviets” 是指具体的组织形式（代表会议）或国家实体（苏联），其成员可能包括共产主义者，但并非所有苏维埃成员都是党员，且“soviets”更强调制度结构而非意识形态。"
    },
    {
      "word_to_compare": "Russians",
      "analysis": "“Russians”（俄罗斯人）是民族或国籍概念，指来自俄罗斯或具有俄罗斯血统的人；而 “soviets” 是政治和历史概念，指苏联体制下的公民或组织，涵盖苏联境内的多个民族（如乌克兰人、哈萨克人等），因此“soviets”是政治身份，而“Russians”是民族身份。"
    },
    {
      "word_to_compare": "councils",
      "analysis": "“Councils”（委员会/议会）是泛指任何由代表组成的决策团体，可存在于任何国家或组织中；而 “soviets” 是特指20世纪俄国革命后形成的、具有特定历史背景和政治功能的工人代表会议，具有强烈的历史和意识形态色彩，是“councils”的一种特殊类型。"
    }
  ]
}