{
  "word": "soviet",
  "pronunciation": "suh·vee·et",
  "concise_definition": "n. 苏维埃, 苏联的; adj. 苏联的, 苏维埃的",
  "forms": {
    "plural": "soviets"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A council or assembly of workers, soldiers, or peasants in Russia, especially during and after the 1917 Revolution, which served as a basic unit of political organization and later became the foundation of the Soviet government.",
      "explanation_cn": "指俄国在1917年革命期间及之后出现的工人、士兵或农民代表会议，作为基本的政治组织单位，后来成为苏联政府的基础。",
      "example_en": "The Bolsheviks seized power through the soviets, which claimed to represent the will of the working class.",
      "example_cn": "布尔什维克通过苏维埃夺取了政权，这些苏维埃声称代表工人阶级的意志。"
    },
    {
      "pos": "noun",
      "explanation_en": "A member of the government or political system of the Union of Soviet Socialist Republics (USSR), or the USSR itself as a historical state.",
      "explanation_cn": "指苏联（苏维埃社会主义共和国联盟）政府或政治体制的成员，或作为历史国家的苏联本身。",
      "example_en": "He was a loyal soviet official who served in the Communist Party for over thirty years.",
      "example_cn": "他是一名忠于苏联体制的官员，在共产党内服务了三十多年。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characteristic of the Soviet Union or its political system, especially during the 20th century.",
      "explanation_cn": "与苏联或其政治体制相关或具有其特征的，尤指20世纪时期。",
      "example_en": "The Cold War was defined by the ideological conflict between Western democracies and Soviet communism.",
      "example_cn": "冷战由西方民主国家与苏联共产主义之间的意识形态冲突所定义。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "communist",
      "analysis": "“Communist”（共产主义的/共产主义者）是一个意识形态术语，指信奉马克思主义、主张生产资料公有制和无阶级社会的人或思想。而 “soviet” 是一个政治制度或机构的名称，虽然苏联是共产主义国家，但“苏维埃”本身是其政权组织形式，不等于共产主义理念。一个国家可以是共产主义的但不采用苏维埃制度。"
    },
    {
      "word_to_compare": "russian",
      "analysis": "“Russian”（俄罗斯的/俄罗斯人）指地理、民族或文化上与俄罗斯相关的事物或人群，而 “soviet” 指的是1917年后以莫斯科为中心的跨民族政治实体——苏联。苏联包含多个民族，如乌克兰人、哈萨克人等，他们不是俄罗斯人，但都是苏联公民。因此，“soviet” 是政治身份，“russian” 是民族或地域身份。"
    },
    {
      "word_to_compare": "council",
      "analysis": "“Council”（委员会/议会）是一个通用词，泛指任何由成员组成的决策团体，如市议会、董事会等。而 “soviet” 是特指俄国革命后形成的、以工人和士兵代表为基础的革命性议会形式，具有特定的历史和政治内涵。虽然两者在结构上相似，但 “soviet” 承载了独特的意识形态和历史背景。"
    }
  ]
}