{
  "word": "spaces",
  "pronunciation": "speys",
  "concise_definition": "n. 空间, 间隔, 空白, 宇宙",
  "forms": {
    "singular": "space"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An empty or unoccupied area or volume, especially one that is available for use or movement; can refer to physical, conceptual, or abstract areas.",
      "explanation_cn": "指一个空的或未被占用的区域或体积，特别是可供使用或移动的空间；可指物理的、概念的或抽象的区域。",
      "example_en": "The apartment has plenty of storage spaces for all our belongings.",
      "example_cn": "这套公寓有足够的储物空间来存放我们所有的物品。"
    },
    {
      "pos": "noun",
      "explanation_en": "A gap or interval between two objects, points, or entities, often measured in distance or time.",
      "explanation_cn": "指两个物体、点或实体之间的间隙或间隔，通常以距离或时间来衡量。",
      "example_en": "There should be a space of at least two inches between the books on the shelf.",
      "example_cn": "书架上的书之间应留出至少两英寸的间隔。"
    },
    {
      "pos": "noun",
      "explanation_en": "A blank area in written or printed text, such as between words or lines, used for readability or formatting.",
      "explanation_cn": "指书面或印刷文本中用于提高可读性或排版的空白区域，如单词或行之间的空格。",
      "example_en": "The document looks cluttered because there are no spaces between the words.",
      "example_cn": "由于单词之间没有空格，这份文件看起来很拥挤。"
    },
    {
      "pos": "noun",
      "explanation_en": "The vast, seemingly infinite expanse beyond Earth's atmosphere, containing stars, planets, and other celestial bodies; outer space.",
      "explanation_cn": "指地球大气层之外广阔而看似无限的区域，包含恒星、行星及其他天体；即外层空间。",
      "example_en": "Astronauts train for months to prepare for life in space.",
      "example_cn": "宇航员需要接受数月的训练，以适应太空中的生活。"
    },
    {
      "pos": "noun",
      "explanation_en": "A designated area for a specific purpose, such as parking, seating, or activity; often used in compound forms.",
      "explanation_cn": "指为特定用途而划定的区域，如停车位、座位或活动区；常用于复合词中。",
      "example_en": "We couldn't find a parking space near the theater.",
      "example_cn": "我们在剧院附近找不到停车位。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "room",
      "analysis": "“Room” (空间/余地) 通常指可供人或物使用的内部空间，强调容纳性或可用性，常用于抽象语境（如“there’s no room for error”）。而 “space” 更广泛，可指物理、抽象或宇宙中的任何空隙，范围更广，且更中性客观。"
    },
    {
      "word_to_compare": "area",
      "analysis": "“Area” (区域) 强调一个有边界、可测量的平面范围，常用于地理、数学或规划语境（如“a residential area”）。而 “space” 更侧重于“空”的本质，不一定有明确边界，且可包含三维体积（如房间空间、太空）。"
    },
    {
      "word_to_compare": "gap",
      "analysis": "“Gap” (缺口/间隙) 通常指两个事物之间不连续的、有时是令人担忧的空缺，常带有负面或断裂的含义（如“a gap in knowledge”）。而 “space” 是中性词，仅描述空隙的存在，不隐含缺失或问题。"
    },
    {
      "word_to_compare": "volume",
      "analysis": "“Volume” (体积) 是一个精确的物理量度术语，指三维空间所占的大小，常用于科学或工程语境。而 “space” 是日常语言中更通用的词，不强调精确测量，更注重功能或感知上的空旷感。"
    }
  ]
}