{
  "word": "spans",
  "pronunciation": "spanz",
  "concise_definition": "v. 横跨, 跨越, 持续; n. 跨度, 跨越范围",
  "forms": {
    "base_form": "span",
    "third_person_singular": "spans",
    "past_tense": "spanned",
    "past_participle": "spanned",
    "present_participle": "spanning"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To extend across or cover a distance, period of time, or range of subjects, often connecting two points or extremes.",
      "explanation_cn": "指跨越一段距离、时间段或涵盖一系列主题，通常连接两个点或极端。",
      "example_en": "The bridge spans the river between the two cities.",
      "example_cn": "这座桥横跨于两座城市之间的河流之上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To last or continue over a specified period of time, especially when covering multiple stages or generations.",
      "explanation_cn": "指持续一段时间，尤其当涵盖多个阶段或世代时。",
      "example_en": "Her career spans over four decades of groundbreaking work in medicine.",
      "example_cn": "她的职业生涯跨越了四十余年，在医学领域取得了开创性成就。"
    },
    {
      "pos": "noun",
      "explanation_en": "The distance or time covered by something that extends across a gap or interval.",
      "explanation_cn": "指跨越某个间隙或间隔所覆盖的距离或时间。",
      "example_en": "The span of the archway is 30 meters, making it the widest in the region.",
      "example_cn": "这个拱门的跨度为30米，是该地区最宽的。"
    },
    {
      "pos": "noun",
      "explanation_en": "A range or scope of variation, often referring to a spectrum of possibilities, ages, or conditions.",
      "explanation_cn": "指变化的范围或幅度，常用于描述可能性、年龄或状况的连续谱系。",
      "example_en": "The survey covered a wide span of ages, from teenagers to seniors.",
      "example_cn": "这项调查涵盖了从青少年到老年人的广泛年龄段。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "covers",
      "analysis": "“Covers” (覆盖) 强调的是在表面上或范围内包含或涉及某事物，常用于信息、区域或责任的覆盖，不一定强调物理或时间上的连续延伸。而 “spans” 更强调从一端到另一端的完整贯穿或连接，具有更强的空间或时间连续性。"
    },
    {
      "word_to_compare": "extends",
      "analysis": "“Extends” (延伸) 指从某一点向外延长或扩展，通常强调线性或方向性的增长，但不一定连接两个明确的端点。而 “spans” 更强调连接两个具体端点或界限，具有明确的起止范围。"
    },
    {
      "word_to_compare": "lasts",
      "analysis": "“Lasts” (持续) 仅指时间上的延续，不涉及空间跨越或范围覆盖，语义较窄。而 “spans” 在表示时间时，不仅指持续，还隐含了跨越多个阶段、事件或时期的完整性，语义更丰富。"
    }
  ]
}