{
  "word": "spanning",
  "pronunciation": "span·ning",
  "concise_definition": "adj. 横跨的, 跨越的, 涵盖的",
  "forms": {
    "base_form": "span",
    "present_participle": "spanning",
    "past_tense": "spanned",
    "past_participle": "spanned"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Extending across or covering a wide range, distance, or period of time; connecting or linking two or more distinct points, areas, or phases.",
      "explanation_cn": "指跨越、覆盖广阔的距离、范围或时间段；连接或关联两个或多个不同的地点、领域或阶段。",
      "example_en": "The bridge is a remarkable engineering feat, spanning the entire width of the river.",
      "example_cn": "这座桥是一项杰出的工程成就，横跨整条河流的宽度。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Encompassing multiple categories, eras, or domains, often used to describe something that transcends boundaries or classifications.",
      "explanation_cn": "指涵盖多个类别、时代或领域，常用于描述超越界限或分类的事物。",
      "example_en": "Her career has been spanning spanning music, film, and activism for over three decades.",
      "example_cn": "她的职业生涯跨越音乐、电影和 activism 三大领域，已持续三十多年。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used in technical contexts to describe a process, system, or structure that operates across multiple components or levels simultaneously.",
      "explanation_cn": "在技术语境中，指一个过程、系统或结构同时作用于多个组件或层级。",
      "example_en": "The spanning tree protocol ensures a loop-free network topology.",
      "example_cn": "生成树协议确保了无环路的网络拓扑结构。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "covering",
      "analysis": "“Covering”（覆盖）强调在表面上的覆盖或包含，常用于物理遮盖或范围上的包含，如“覆盖面积”或“覆盖人群”。而 “spanning” 更强调从一端到另一端的连续跨越，具有空间或时间上的贯通性，更突出连接与延伸的动态感。"
    },
    {
      "word_to_compare": "extending",
      "analysis": "“Extending”（延伸）侧重于从某一点向外延长或扩展，通常是线性或单向的，如“延伸道路”。“Spanning” 则强调两端之间的完整连接，隐含“贯穿”或“横跨”的完整性，如“横跨峡谷的桥梁”。"
    },
    {
      "word_to_compare": "encompassing",
      "analysis": "“Encompassing”（包含）强调包容性，指将多个元素或方面纳入一个整体，常用于抽象概念，如“涵盖多种观点”。“Spanning” 更强调空间或时间上的跨越，不一定包含所有元素，但必须连接两端，更具物理或结构上的连通性。"
    }
  ]
}