{
  "word": "span",
  "pronunciation": "span",
  "concise_definition": "n. 跨度, 跨越, 持续时间; v. 跨越, 持续",
  "forms": {
    "third_person_singular": "spans",
    "past_tense": "spanned",
    "past_participle": "spanned",
    "present_participle": "spanning"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The distance or extent between two points, especially the length of a structure or gap that is crossed, such as a bridge or a period of time.",
      "explanation_cn": "指两个点之间的距离或范围，尤指跨越的结构（如桥梁）或时间段的长度。",
      "example_en": "The bridge has a span of 1,200 meters, connecting the two mountains.",
      "example_cn": "这座桥跨度为1200米，连接了两座山。"
    },
    {
      "pos": "noun",
      "explanation_en": "The period of time during which something lasts or continues to exist, often used to describe the duration of an activity, career, or historical era.",
      "explanation_cn": "指某事物持续存在或发生的时间段，常用于描述活动、职业生涯或历史时期的持续时间。",
      "example_en": "Her career spanned over five decades, during which she won numerous awards.",
      "example_cn": "她的职业生涯持续了五十多年，期间获得了众多奖项。"
    },
    {
      "pos": "verb",
      "explanation_en": "To extend or reach across a space, time, or range, covering or connecting two or more points or periods.",
      "explanation_cn": "指跨越空间、时间或范围，覆盖或连接两个或多个点或时期。",
      "example_en": "The mountain range spans three countries and includes several peaks over 4,000 meters.",
      "example_cn": "这条山脉横跨三个国家，包含数座海拔超过4000米的山峰。"
    },
    {
      "pos": "verb",
      "explanation_en": "To last through or cover a period of time, often implying continuity or endurance.",
      "explanation_cn": "指持续贯穿某一时间段，常暗示连续性或持久性。",
      "example_en": "The tradition has spanned generations, passed down from grandparents to grandchildren.",
      "example_cn": "这一传统代代相传，从祖父母传到孙辈。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "extent",
      "analysis": "“Extent”（范围、程度）强调某事物的广度或规模，通常用于抽象概念（如影响的范围），不强调连接或跨越的动作。而 “span” 更具体地指从一点到另一点的实际跨越或持续时间，具有空间或时间上的两端性。"
    },
    {
      "word_to_compare": "duration",
      "analysis": "“Duration”（持续时间）专指时间的长短，是一个纯粹的时间量词，中性且客观。而 “span” 不仅可指时间，还可指空间距离，且常带有“贯穿”“覆盖”的动态意象，语义更丰富。"
    },
    {
      "word_to_compare": "cross",
      "analysis": "“Cross”（穿过）强调从一端到另一端的移动或穿越动作，通常指瞬间或短暂的通过，如过马路。而 “span” 强调的是稳定地覆盖或连接两个端点，不强调移动过程，而是结果性的连接，如桥梁横跨河流。"
    }
  ]
}