{
  "word": "spartan",
  "pronunciation": "spahr·tuhn",
  "concise_definition": "adj. 斯巴达式的, 简朴的, 苛刻的; n. 斯巴达人",
  "forms": {
    "comparative": "spartaner",
    "superlative": "spartanest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Characterized by extreme simplicity, frugality, and self-discipline, often to the point of harshness or deprivation; reflecting the austere lifestyle of ancient Sparta.",
      "explanation_cn": "以极度简朴、节俭和自律为特征，常达到严苛或匮乏的程度；反映古斯巴达人的简朴生活方式。",
      "example_en": "He lived in a spartan apartment with only a bed, a chair, and a small table.",
      "example_cn": "他住在一间只有床、椅子和一张小桌子的简朴公寓里。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Marked by strict discipline, toughness, and emotional restraint, especially in the face of hardship or pain.",
      "explanation_cn": "以严格的纪律、坚韧和情感克制为特征，尤其在面对困难或痛苦时。",
      "example_en": "The soldiers displayed a spartan attitude toward suffering, enduring the cold without complaint.",
      "example_cn": "士兵们以斯巴达式的态度面对苦难，在严寒中默默忍受，毫无怨言。"
    },
    {
      "pos": "noun",
      "explanation_en": "A native or inhabitant of ancient Sparta, known for military prowess and rigid discipline.",
      "explanation_cn": "古斯巴达的本地人或居民，以军事才能和严格的纪律著称。",
      "example_en": "The spartan trained from childhood to be a fearless warrior.",
      "example_cn": "这名斯巴达人从小接受训练，成为无畏的战士。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "austere",
      "analysis": "“Austere”（严峻的、简朴的）强调形式上的严肃、无装饰和克制，常用于描述环境、风格或道德态度，如“austere room”或“austere lifestyle”。而 “spartan” 更具体地关联古斯巴达文化，带有更强的历史和军事色彩，暗示一种主动选择的苦行与坚韧。"
    },
    {
      "word_to_compare": "minimalist",
      "analysis": "“Minimalist”（极简主义的）侧重于美学上的简化，追求‘少即是多’的设计哲学，通常不带有苦行或牺牲的意味，甚至可能很精致。而 “spartan” 强调的是匮乏、克制和生存必需，常隐含牺牲与不适，不追求美感。"
    },
    {
      "word_to_compare": "stern",
      "analysis": "“Stern”（严厉的）主要形容人的态度、表情或规则的严格和不容妥协，如“a stern teacher”。它描述的是行为或情绪上的严肃性，而 “spartan” 描述的是生活方式或环境的物质与精神状态，更偏向于客观条件而非主观态度。"
    }
  ]
}