{
  "word": "spark",
  "pronunciation": "spahrk",
  "concise_definition": "n. 火花, 火星; v. 引发, 激发, 产生",
  "forms": {
    "plural": "sparks",
    "third_person_singular": "sparks",
    "past_tense": "sparked",
    "past_participle": "sparked",
    "present_participle": "sparking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A tiny particle of fire or a brief flash of light produced by friction, electricity, or combustion, often seen as a brief, bright burst.",
      "explanation_cn": "指因摩擦、电击或燃烧而产生的微小火粒或短暂闪光，通常表现为短暂而明亮的光点。",
      "example_en": "A spark from the fireplace landed on the rug and nearly started a fire.",
      "example_cn": "壁炉里飞出的一颗火星落在地毯上，差点引发火灾。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small but significant beginning or trigger that initiates a larger event, process, or change, especially in abstract contexts like ideas, emotions, or movements.",
      "explanation_cn": "指引发更大事件、过程或变化的微小但关键的开端或导火索，尤其用于抽象语境，如思想、情感或社会运动。",
      "example_en": "The protest began as a small demonstration, but the police response was the spark that ignited nationwide unrest.",
      "example_cn": "抗议最初只是一次小规模示威，但警方的反应成了点燃全国性动荡的导火索。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to begin or initiate a process, especially an idea, emotion, or activity, often unexpectedly or suddenly.",
      "explanation_cn": "指引发某事物的开始，尤其是思想、情感或活动，通常带有突然或意外的性质。",
      "example_en": "Her passionate speech sparked a wave of public support for the new policy.",
      "example_cn": "她充满激情的演讲激起了公众对新政策的广泛支持。"
    },
    {
      "pos": "verb",
      "explanation_en": "To produce small flashes of light or fire, typically through electrical discharge or friction.",
      "explanation_cn": "指通过电击或摩擦产生微小的闪光或火星。",
      "example_en": "The old wiring sparked when the circuit overloaded.",
      "example_cn": "当电路过载时，老化的电线迸出了火花。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "trigger",
      "analysis": "“Trigger” (触发) 更强调一个直接、机械或系统性的启动机制，常用于技术、心理或生理语境，如“触发警报”或“触发创伤记忆”。而 “spark” 更具形象性和情感色彩，常用于比喻性语境，暗示一种更微妙、更富有生命力的开端。"
    },
    {
      "word_to_compare": "ignite",
      "analysis": "“Ignite” (点燃) 通常指使某物真正燃烧起来，或使激烈的情绪、冲突或运动全面爆发，语义强度高于 “spark”。“Spark” 是最初的微小火星，而 “ignite” 是火焰的全面燃起。两者常构成递进关系：spark → ignite。"
    },
    {
      "word_to_compare": "stimulate",
      "analysis": "“Stimulate” (刺激) 是一个更正式、更广泛的术语，指通过外部因素促进某种反应或发展，常用于生理、经济或教育领域（如刺激经济增长）。它强调持续性影响，而 “spark” 更侧重于瞬间的、突发性的启动作用。"
    }
  ]
}