{
  "word": "sparring",
  "pronunciation": "spahr·ing",
  "concise_definition": "n. 拳击练习, 训练性对打; v. (spare) 进行拳击练习, 争论",
  "forms": {
    "base_form": "spar",
    "third_person_singular": "spars",
    "past_tense": "sparred",
    "past_participle": "sparred",
    "present_participle": "sparring"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A practice session in boxing or martial arts where participants engage in controlled, non-competitive fighting to improve technique, timing, and reflexes.",
      "explanation_cn": "拳击或武术中的训练性对打，参与者进行有控制的非竞赛性搏击，以提高技术、节奏和反应能力。",
      "example_en": "The boxer spent an hour in sparring before the championship match.",
      "example_cn": "这位拳击手在锦标赛前进行了一个小时的对打训练。"
    },
    {
      "pos": "noun",
      "explanation_en": "A verbal exchange characterized by playful or competitive argument, often used to test ideas or assert dominance without serious conflict.",
      "explanation_cn": "一种带有游戏性或竞争性的言语交锋，常用于测试观点或确立主导地位，但不构成真正冲突。",
      "example_en": "Their sparring over policy details was more like a debate than a fight.",
      "example_cn": "他们就政策细节的争论更像是一场辩论，而非真正的争吵。"
    },
    {
      "pos": "verb",
      "explanation_en": "To engage in a practice fight, especially in boxing or martial arts, to develop skill and conditioning.",
      "explanation_cn": "进行拳击或武术中的训练性对打，以提升技能和体能。",
      "example_en": "She spars with her coach every morning to stay sharp.",
      "example_cn": "她每天早上都和教练对打，以保持状态。"
    },
    {
      "pos": "verb",
      "explanation_en": "To engage in a light, often witty or teasing verbal exchange, especially in a competitive or intellectual context.",
      "explanation_cn": "在竞争性或智力语境中进行轻松、机智或调侃性的言语交锋。",
      "example_en": "The two politicians were sparring over tax reform during the debate.",
      "example_cn": "两位政客在辩论中就税收改革展开了唇枪舌剑。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fighting",
      "analysis": "“Fighting” (战斗) 指真实的、具有攻击性和伤害意图的冲突，通常以胜负或伤害为目的；而 “sparring” 是有控制的、非伤害性的练习，目的是训练而非取胜。"
    },
    {
      "word_to_compare": "bickering",
      "analysis": "“Bickering” (争吵) 指琐碎、情绪化、常带怨气的言语争执，通常缺乏建设性；而 “sparring” 在言语语境中更偏向机智、策略性、甚至带有幽默感的交锋，目的常是测试观点或展示智慧。"
    },
    {
      "word_to_compare": "drilling",
      "analysis": "“Drilling” (操练) 指重复性地练习单一动作或技能，强调机械性重复；而 “sparring” 是动态的、互动的、模拟真实情境的练习，强调反应、适应和策略运用。"
    }
  ]
}