{
  "word": "spawn",
  "pronunciation": "spawⁿ",
  "concise_definition": "v. 产生, 繁殖; n. 后代, 子嗣",
  "forms": {
    "third_person_singular": "spawns",
    "past_tense": "spawned",
    "past_participle": "spawned",
    "present_participle": "spawning"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To produce or generate offspring, especially in large numbers, typically used for fish, amphibians, or other aquatic animals.",
      "explanation_cn": "指（尤指鱼类、两栖类等水生动物）大量产卵或繁殖后代。",
      "example_en": "Salmon spawn in freshwater rivers after migrating from the ocean.",
      "example_cn": "鲑鱼在从海洋洄游至淡水河流后产卵。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to come into existence, often in large quantities or with negative connotations, such as problems, ideas, or entities.",
      "explanation_cn": "指引发某事物的产生，常用于描述大量出现的事物，尤指问题、思想或实体，有时带有负面含义。",
      "example_en": "The economic crisis spawned a wave of unemployment across the region.",
      "example_cn": "经济危机引发了该地区大规模的失业潮。"
    },
    {
      "pos": "noun",
      "explanation_en": "The offspring or progeny produced by an animal, especially fish or amphibians; also used metaphorically to refer to the result or product of something.",
      "explanation_cn": "指动物（尤指鱼类或两栖类）所产的卵或后代；也可比喻性地指某事物所产生的结果或产物。",
      "example_en": "The lake was filled with the spawn of trout, visible as clusters of tiny eggs.",
      "example_cn": "湖中布满了鳟鱼产下的卵，成簇可见。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "produce",
      "analysis": "“Produce” (生产/产生) 是一个通用词，适用于任何事物的生成，包括物品、食物、艺术作品等，中性且广泛。而 “spawn” 更强调大量、有时是突然或不受欢迎的产物，常用于生物繁殖或负面后果的语境，语义色彩更强烈。"
    },
    {
      "word_to_compare": "generate",
      "analysis": "“Generate” (生成) 常用于抽象概念、能量或数据的产生，如生成电力、生成报告，强调过程的机制性。而 “spawn” 更具形象性，常与生命、生物或具有传染性/扩散性的结果相关，带有更生动的意象。"
    },
    {
      "word_to_compare": "offspring",
      "analysis": "“Offspring” (后代) 是 “spawn” 作为名词时的近义词，但 “offspring” 更正式、更常用于人类或高等动物，语气中性或正面；而 “spawn” 作为名词时，常用于非人类生物，且在比喻用法中可能带有贬义（如‘the spawn of evil’）。"
    }
  ]
}