{
  "word": "spectra",
  "pronunciation": "spek·truh",
  "concise_definition": "n. 光谱, 谱系, 范围",
  "forms": {
    "singular": "spectrum"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The range of colors produced when light is dispersed by a prism, representing the electromagnetic radiation emitted or absorbed by a substance.",
      "explanation_cn": "指当光通过棱镜色散时产生的颜色范围，代表物质所发射或吸收的电磁辐射。",
      "example_en": "The scientist analyzed the star's spectrum to determine its chemical composition.",
      "example_cn": "科学家分析了这颗恒星的光谱，以确定其化学成分。"
    },
    {
      "pos": "noun",
      "explanation_en": "A broad range or continuum of related qualities, positions, or values, often used metaphorically to describe variation within a category.",
      "explanation_cn": "指某一类别内相关品质、立场或数值的广泛范围或连续体，常用于隐喻性描述事物的多样性。",
      "example_en": "The political spectrum includes everything from extreme conservatism to radical liberalism.",
      "example_cn": "政治光谱涵盖了从极端保守主义到激进自由主义的广泛立场。"
    },
    {
      "pos": "noun",
      "explanation_en": "In physics and chemistry, the characteristic pattern of radiation or absorption at different wavelengths, used to identify elements or compounds.",
      "explanation_cn": "在物理和化学中，指在不同波长下辐射或吸收的特征模式，用于识别元素或化合物。",
      "example_en": "Each element has a unique spectral signature that can be detected in laboratory analysis.",
      "example_cn": "每种元素都有独特的光谱特征，可在实验室分析中被检测出来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "spectrum",
      "analysis": "“Spectra” 是 “spectrum” 的复数形式，两者本质相同，但 “spectrum” 更常用于单数语境中泛指一个光谱或范围，而 “spectra” 强调多个不同的光谱或范围，常用于科学研究中对比多个样本或现象。"
    },
    {
      "word_to_compare": "range",
      "analysis": "“Range” (范围) 是一个更通用的词，泛指从最低到最高的区间，可用于数量、温度、音高等多种语境，但不特指物理上的电磁波分布。而 “spectra” 专指与波长、频率相关的物理现象，具有更强的专业性和技术性。"
    },
    {
      "word_to_compare": "continuum",
      "analysis": "“Continuum” (连续体) 强调一种无间断的、渐变的过渡状态，常用于哲学或抽象概念（如意识连续体）。虽然 “spectra” 有时被比喻为连续体，但它本质上是可测量、可分割的物理数据集合，具有明确的离散峰值或波段。"
    }
  ]
}