{
  "word": "spectral",
  "pronunciation": "spek·truhl",
  "concise_definition": "adj. 幽灵的, 幻影的, 光谱的",
  "forms": {
    "comparative": "spectraler",
    "superlative": "spectrallest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or resembling a specter or ghost; appearing as an ethereal, otherworldly, or haunting presence.",
      "explanation_cn": "与幽灵或鬼魂相关或相似的；呈现出超自然、缥缈或令人毛骨悚然的形态。",
      "example_en": "The spectral figure drifted through the mist, silent and unseen by the living.",
      "example_cn": "那个幽灵般的身影在薄雾中飘荡，凡人无法看见。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Of or relating to a spectrum, especially in physics or optics, referring to the range of wavelengths of light or electromagnetic radiation.",
      "explanation_cn": "与光谱相关的，尤其在物理学或光学中，指光或电磁辐射的波长范围。",
      "example_en": "The astronomer analyzed the spectral lines to determine the star's chemical composition.",
      "example_cn": "天文学家分析了光谱线，以确定这颗恒星的化学成分。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by a pale, faint, or ghostly quality, often used to describe colors, sounds, or images that seem unreal or detached from reality.",
      "explanation_cn": "具有苍白、微弱或幽灵般的特质，常用于形容颜色、声音或图像显得不真实或脱离现实。",
      "example_en": "Her spectral voice echoed through the empty hallway, barely audible.",
      "example_cn": "她那幽灵般的声音在空荡的走廊中回荡，几乎听不见。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ghostly",
      "analysis": "“Ghostly” (鬼魂般的) 更直接地指代与鬼魂或超自然现象相关的特征，情感色彩更强烈，常用于文学或恐怖语境。而 “spectral” 除了有鬼魂的含义外，还广泛用于科学语境（如光谱），语义范围更广，语气更中性或学术。"
    },
    {
      "word_to_compare": "ethereal",
      "analysis": "“Ethereal” (空灵的) 强调轻盈、优美、超凡脱俗的美感，常用于描述艺术、音乐或自然景象，带有正面或诗意的联想。而 “spectral” 更强调虚幻、阴森或非实体性，常带有神秘或令人不安的意味。"
    },
    {
      "word_to_compare": "spectroscopic",
      "analysis": "“Spectroscopic” (光谱学的) 是一个高度专业的术语，专指使用光谱仪进行分析的方法或技术，仅用于科学领域。而 “spectral” 是更通用的形容词，可指光谱本身或其特性，也可用于比喻义，适用范围远大于 “spectroscopic”。"
    }
  ]
}