{
  "word": "spending",
  "pronunciation": "spen·ding",
  "concise_definition": "n. 消费, 支出; v. 花费, 消耗",
  "forms": {
    "base_form": "spend",
    "third_person_singular": "spends",
    "past_tense": "spent",
    "past_participle": "spent",
    "present_participle": "spending"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of using money to purchase goods or services, or the total amount of money spent over a period of time, often in the context of personal, business, or government budgets.",
      "explanation_cn": "指使用金钱购买商品或服务的行为，或在特定时期内支出的总金额，常用于个人、企业或政府预算的语境中。",
      "example_en": "Government spending on healthcare has increased significantly this year.",
      "example_cn": "今年政府在医疗保健方面的支出显著增加。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of using up resources, time, or energy, not necessarily monetary, often implying wasteful or excessive use.",
      "explanation_cn": "指消耗资源、时间或精力的行为，不一定涉及金钱，常暗示浪费或过度使用。",
      "example_en": "The project's spending of time on unnecessary meetings delayed the deadline.",
      "example_cn": "该项目在不必要的会议上的时间消耗导致了截止日期的延误。"
    },
    {
      "pos": "verb",
      "explanation_en": "To use money to buy goods or services; to pay for something.",
      "explanation_cn": "指用金钱购买商品或服务；支付某物的费用。",
      "example_en": "She spends a lot of money on books and travel.",
      "example_cn": "她花很多钱买书和旅行。"
    },
    {
      "pos": "verb",
      "explanation_en": "To use up or consume time, energy, or other resources, often in a way that is considered inefficient or excessive.",
      "explanation_cn": "指消耗时间、精力或其他资源，常带有低效或过度的含义。",
      "example_en": "Don't spend your energy arguing with people who won't listen.",
      "example_cn": "别把精力浪费在跟不愿听你说话的人争论上。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "expenditure",
      "analysis": "“Expenditure”（支出）是更正式、更精确的术语，通常用于财务或经济报告中，专指金钱的流出，强调会计意义上的支出行为。而 “spending” 更口语化，涵盖范围更广，可指金钱、时间或精力的消耗，语义更灵活。"
    },
    {
      "word_to_compare": "consumption",
      "analysis": "“Consumption”（消费）侧重于对商品或服务的使用和耗尽，常用于经济学中描述需求端行为，强调“使用”而非“支付”动作。而 “spending” 更强调支付行为本身，是消费的前提。例如：消费可能发生在使用食物时，但支出发生在购买食物时。"
    },
    {
      "word_to_compare": "outlay",
      "analysis": "“Outlay”（支出）通常指一次性或特定项目的资金投入，常用于商业或投资语境，带有“预先支付”的含义，语气较正式。而 “spending” 更通用，可指持续性、日常性或非计划性的开销，适用范围更广。"
    }
  ]
}