{
  "word": "spicy",
  "pronunciation": "spahy·shee",
  "concise_definition": "adj. 辛辣的, 刺激的, 火辣的, 大胆的",
  "forms": {
    "comparative": "spicier",
    "superlative": "spiciest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having a strong, pungent, or hot flavor, typically due to the presence of chili peppers or other hot spices; describing food that stimulates the taste buds and may cause a burning sensation.",
      "explanation_cn": "指因含有辣椒或其他辛辣香料而具有强烈、刺激、灼热风味的，常使味蕾产生刺激感甚至灼烧感的食物。",
      "example_en": "The curry was so spicy that I had to drink milk to cool my mouth.",
      "example_cn": "这道咖喱太辣了，我不得不喝牛奶来缓解口腔的灼热感。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Figuratively, describing something that is exciting, provocative, or含有争议性或挑逗性的内容，常用于形容言论、故事或娱乐内容。",
      "explanation_cn": "比喻意义上，形容某事物令人兴奋、具有挑衅性或含有争议性、挑逗性内容，常用于形容言论、故事或娱乐内容。",
      "example_en": "The journalist broke the story with some spicy details about the politician's private life.",
      "example_cn": "这位记者披露了关于这位政客私生活的某些劲爆细节。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Informally, describing something as lively, energetic, or full of zest, often in a playful or flirtatious context.",
      "explanation_cn": "非正式用法，形容某事物充满活力、热情或趣味，常用于轻松或调情的语境中。",
      "example_en": "She gave him a spicy smile that made his heart skip a beat.",
      "example_cn": "她朝他投去一个火辣辣的微笑，让他心跳漏了一拍。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hot",
      "analysis": "“Hot” (热的) 主要指物理温度高，也可用于形容辣味，但语义更宽泛，常用于描述天气、食物温度或情绪。“Spicy” 更专指由香料引起的味觉刺激，且在比喻义上更常用于描述内容的“劲爆”或“挑逗性”，而 “hot” 在此语境中较少使用。"
    },
    {
      "word_to_compare": "pungent",
      "analysis": "“Pungent” (刺鼻的) 强调强烈而令人不悦的气味或味道，常用于描述大蒜、奶酪或化学物质的气味，带有负面色彩。“Spicy” 虽然也指强烈味道，但通常带有积极或令人愉悦的意味，尤其在饮食语境中。"
    },
    {
      "word_to_compare": "bold",
      "analysis": "“Bold” (大胆的) 指具有勇气、自信或鲜明风格，常用于形容设计、言论或决策。“Spicy” 在比喻义上与之部分重叠，但更强调感官刺激、挑逗或戏剧性，而 “bold” 更侧重于决断力和创新性，不必然带有感官或情感上的煽动性。"
    }
  ]
}