{
  "word": "spiked",
  "pronunciation": "spaɪkt",
  "concise_definition": "adj. 带尖刺的, 突然增加的; v. 使尖锐, 使突然增加",
  "forms": {
    "base_form": "spike",
    "past_tense": "spiked",
    "past_participle": "spiked",
    "present_participle": "spiking",
    "plural_noun": "spikes"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having sharp points or projections, typically used to describe physical objects designed to pierce or deter access.",
      "explanation_cn": "带有尖锐的刺或突出物，通常用于描述旨在刺穿或阻止进入的物理物体。",
      "example_en": "The top of the fence was lined with spiked iron rails to prevent intruders.",
      "example_cn": "围栏顶部装有带刺的铁条，以防止入侵者翻越。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing a sudden and sharp increase in a quantity, especially in data, prices, or demand.",
      "explanation_cn": "形容数量（如数据、价格或需求）突然急剧上升。",
      "example_en": "There was a spiked interest in the product after the viral social media post.",
      "example_cn": "在社交媒体帖子走红后，该产品的需求突然激增。"
    },
    {
      "pos": "verb",
      "explanation_en": "To add a substance, especially alcohol or drugs, to a drink without the knowledge of the person consuming it.",
      "explanation_cn": "在饮品中偷偷加入某种物质（尤其是酒精或毒品），而饮用者并不知情。",
      "example_en": "She suspected her drink had been spiked at the party.",
      "example_cn": "她怀疑自己在派对上的饮料被人下了药。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to rise sharply or suddenly, often used in economic or statistical contexts.",
      "explanation_cn": "使某物突然急剧上升，常用于经济或统计语境。",
      "example_en": "The news spiked the stock prices of the tech company.",
      "example_cn": "这则新闻导致这家科技公司的股价飙升。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pricked",
      "analysis": "“Pricked”（刺穿）强调轻而短暂的刺入动作，通常不带有持续性或防御性目的，如针尖轻刺。而 “spiked” 指的是具有尖刺结构的物体，强调其设计用途是长期威慑或造成伤害，语义更强烈且具结构性。"
    },
    {
      "word_to_compare": "surged",
      "analysis": "“Surged”（激增）与 “spiked” 在描述突然上升时可互换，但 “surged” 更常用于描述持续性的、有力量感的上升（如海浪、人流），而 “spiked” 更强调短暂、尖锐、峰值明显的突增，常用于图表或数据中描述瞬间高峰。"
    },
    {
      "word_to_compare": "drugged",
      "analysis": "“Drugged”（下药）是 “spiked” 在饮品中加入药物这一特定含义的近义词，但 “drugged” 更泛指任何使他人失去意识或能力的药物行为，而 “spiked” 专指通过饮品投药，具有更强的语境限定性和隐秘性。"
    }
  ]
}