{
  "word": "spills",
  "pronunciation": "spils",
  "concise_definition": "n. 溢出, 泄漏; v. 溢出, 泄漏, 洒出",
  "forms": {
    "base_form": "spill",
    "third_person_singular": "spills",
    "past_tense": "spilled",
    "past_participle": "spilled",
    "present_participle": "spilling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An accidental release or leakage of a liquid or other substance, often resulting in a mess or hazard.",
      "explanation_cn": "指液体或其他物质意外泄漏或溢出，通常造成混乱或危险。",
      "example_en": "The oil spill contaminated the coastline and harmed marine life.",
      "example_cn": "这次石油泄漏污染了海岸线，危害了海洋生物。"
    },
    {
      "pos": "noun",
      "explanation_en": "A minor accident or mishap, especially one involving the loss or waste of something, often used in the phrase 'a spill of secrets' or 'a spill of information'.",
      "explanation_cn": "指轻微的事故或失误，尤其涉及某物的丢失或浪费，常用于比喻性表达，如‘泄密’或‘信息外泄’。",
      "example_en": "The politician's secret meeting was a major spill that made headlines.",
      "example_cn": "这位政治家的秘密会面是一次重大泄密，登上了新闻头条。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause or allow a liquid or loose substance to flow or fall out accidentally from its container.",
      "explanation_cn": "指使液体或松散物质意外从容器中流出或洒落。",
      "example_en": "She spilled coffee all over her laptop keyboard.",
      "example_cn": "她把咖啡洒在了笔记本电脑键盘上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reveal information unintentionally or indiscreetly, especially something that was meant to be kept secret.",
      "explanation_cn": "指无意中或不谨慎地泄露信息，尤其是本应保密的内容。",
      "example_en": "He spilled the beans about the surprise party before the big day.",
      "example_cn": "他在大日子之前不小心说出了惊喜派对的秘密。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "leak",
      "analysis": "“Leak” (泄漏) 通常指液体、气体或信息缓慢、持续地从缝隙或薄弱处逸出，常带有隐蔽性或系统性，如管道漏水、机密文件泄露。而 “spill” 更强调突然、一次性、可见的溢出或洒落，动作更明显、更剧烈。"
    },
    {
      "word_to_compare": "overflow",
      "analysis": "“Overflow” (溢出) 专指容器因装得太满而液体或物质从顶部或边缘溢出，强调容量超限。而 “spill” 可以发生在任何容器倾斜、破损或操作失误时，不一定是因为装得太满。"
    },
    {
      "word_to_compare": "disclose",
      "analysis": "“Disclose” (披露) 是正式、有意识地公开信息，常用于法律或官方语境，带有主动性。而 “spill” 在表示信息泄露时，带有负面、无意或不谨慎的含义，常含责备色彩，如 ‘spill the beans’ 是口语化表达。"
    }
  ]
}