{
  "word": "spinning",
  "pronunciation": "spih·ning",
  "concise_definition": "n. 旋转, 纺纱; adj. 旋转的, 纺织的; v. 旋转, 纺纱 (spin 的现在分词)",
  "forms": {
    "base_form": "spin",
    "third_person_singular": "spins",
    "past_tense": "spun",
    "past_participle": "spun",
    "present_participle": "spinning"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To rotate rapidly around an axis, often in a continuous or circular motion, either physically or metaphorically.",
      "explanation_cn": "指围绕一个轴心快速旋转，通常为持续或圆周运动，可指物理上的转动，也可用于比喻意义。",
      "example_en": "The children were spinning in circles until they became dizzy.",
      "example_cn": "孩子们转着圈，直到头晕目眩。"
    },
    {
      "pos": "verb",
      "explanation_en": "To twist and draw out fibers (such as wool or cotton) into thread or yarn, typically using a spinning wheel or spindle.",
      "explanation_cn": "指将纤维（如羊毛或棉花）捻转并拉伸成纱线或细线，通常使用纺车或纺锤进行。",
      "example_en": "In ancient times, women spent hours spinning wool to make clothing.",
      "example_cn": "在古代，女性会花数小时纺羊毛来制作衣物。"
    },
    {
      "pos": "verb",
      "explanation_en": "To present information in a particular way, especially to influence perception or create a favorable impression, often with bias or manipulation.",
      "explanation_cn": "指以特定方式呈现信息，尤其为了影响他人看法或制造有利印象，常带有偏见或操纵性质。",
      "example_en": "The politician spun the scandal as a minor misunderstanding.",
      "example_cn": "这位政客将这场丑闻描述为一场小小的误会。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or process of spinning, especially in the context of textile production or amusement.",
      "explanation_cn": "指旋转或纺纱的行为或过程，尤其在纺织生产或娱乐情境中。",
      "example_en": "The spinning of the wheel created a soothing, rhythmic sound.",
      "example_cn": "轮子的旋转发出了一种令人放松的节奏声。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rotating",
      "analysis": "“Rotating” (旋转) 是一个更中性、技术性的术语，强调物体围绕轴心的周期性运动，常用于机械或物理语境。而 “spinning” 更常用于描述快速、自由或持续的旋转，带有更生动或情感化的色彩，也常用于比喻义（如信息操控）。"
    },
    {
      "word_to_compare": "twisting",
      "analysis": "“Twisting” (扭转) 指将物体的一部分相对于另一部分进行弯曲或缠绕，通常不涉及完整的圆周运动。而 “spinning” 强调围绕中心轴的完整旋转，常伴随离心力或连续性，如纺纱或陀螺转动。"
    },
    {
      "word_to_compare": "weaving",
      "analysis": "“Weaving” (编织) 是将纱线交叉排列以制成布料的过程，是纺织的后续步骤。而 “spinning” 是将纤维加工成纱线的前期步骤。两者虽同属纺织流程，但动作本质不同：spinning 是线的生成，weaving 是线的组合。"
    }
  ]
}