{
  "word": "spin",
  "pronunciation": "spīn",
  "concise_definition": "v. 旋转, 编造, 纺纱; n. 旋转, 纺织, 偏见性叙述",
  "forms": {
    "third_person_singular": "spins",
    "past_tense": "spun",
    "past_participle": "spun",
    "present_participle": "spinning"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To rotate or cause to rotate rapidly around an axis, often in a continuous or circular motion.",
      "explanation_cn": "指围绕一个轴心快速旋转，或使某物做连续的圆周运动。",
      "example_en": "The children laughed as they spun around in circles.",
      "example_cn": "孩子们一边转圈一边大笑。"
    },
    {
      "pos": "verb",
      "explanation_en": "To create or present information in a particular way, especially to influence perception or to favor a specific interpretation, often misleadingly.",
      "explanation_cn": "指以特定方式构建或呈现信息，尤其为了影响他人看法或偏向某种解释，常带有误导性。",
      "example_en": "The politician tried to spin the scandal as a misunderstanding.",
      "example_cn": "这位政客试图将这场丑闻包装成一场误会。"
    },
    {
      "pos": "verb",
      "explanation_en": "To draw out and twist fibers (such as wool or cotton) into thread or yarn.",
      "explanation_cn": "指将纤维（如羊毛或棉花）拉伸并捻转成纱线或线。",
      "example_en": "She learned to spin wool on a traditional spinning wheel.",
      "example_cn": "她学会了用传统的纺车纺羊毛。"
    },
    {
      "pos": "noun",
      "explanation_en": "A rapid rotation or turning motion, often used to describe the movement of objects like a top or a ball.",
      "explanation_cn": "指快速的旋转或转动，常用于描述陀螺或球类等物体的运动。",
      "example_en": "The pitcher threw a fastball with a sharp spin.",
      "example_cn": "投手投出了一颗带有强烈旋转的快速球。"
    },
    {
      "pos": "noun",
      "explanation_en": "A biased or slanted interpretation of facts, especially in media or politics, designed to shape public opinion.",
      "explanation_cn": "指对事实的有偏见或倾向性的解读，尤其在媒体或政治中，旨在塑造公众舆论。",
      "example_en": "The news outlet was accused of giving the story a liberal spin.",
      "example_cn": "该新闻机构被指责对这则新闻做了自由派的倾向性报道。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rotate",
      "analysis": "“Rotate” (旋转) 是一个更中性、技术性的术语，强调围绕轴心的规律性运动，常用于机械或天体运动。而 “spin” 更常用于描述快速、自由或不规则的旋转，带有更强的动感和口语色彩。"
    },
    {
      "word_to_compare": "twist",
      "analysis": "“Twist” (扭转) 指将物体的一部分相对于另一部分进行弯曲或缠绕，通常不涉及完整的圆周运动。而 “spin” 强调围绕中心轴的完整旋转，不强调弯曲或变形。在比喻义上，“twist” 常用于指歪曲事实，而 “spin” 更强调有策略地包装信息以影响看法。"
    },
    {
      "word_to_compare": "narrative",
      "analysis": "“Narrative” (叙述) 是一个中性词，泛指对事件的讲述方式。而 “spin” 作为名词时特指带有偏见或宣传目的的叙述，隐含操纵意图。一个 “narrative” 可以是客观的，但一个 “spin” 几乎总是主观的、有倾向性的。"
    }
  ]
}