{
  "word": "spins",
  "pronunciation": "spinz",
  "concise_definition": "n. 旋转, 快速转动; v. 旋转, 编造, 操纵舆论",
  "forms": {
    "base_form": "spin",
    "third_person_singular": "spins",
    "past_tense": "spun",
    "past_participle": "spun",
    "present_participle": "spinning"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A single complete rotation or turn around an axis, often rapid or continuous.",
      "explanation_cn": "指围绕一个轴心完成的一次完整旋转，通常快速或持续进行。",
      "example_en": "The dancer performed a series of elegant spins on stage.",
      "example_cn": "舞者在舞台上完成了一系列优雅的旋转。"
    },
    {
      "pos": "noun",
      "explanation_en": "A brief, fast ride or journey, especially in a vehicle, often for pleasure.",
      "explanation_cn": "指短暂而快速的乘车或出行，常用于娱乐目的。",
      "example_en": "We went for a spin in the new convertible after dinner.",
      "example_cn": "晚饭后，我们开着新买的敞篷车兜了一圈。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to rotate rapidly around an axis, either physically or metaphorically.",
      "explanation_cn": "指使某物围绕轴心快速旋转，可以是物理上的，也可以是比喻性的。",
      "example_en": "The potter spun the clay on the wheel to shape the vase.",
      "example_cn": "陶匠在转盘上旋转黏土，塑造出花瓶的形状。"
    },
    {
      "pos": "verb",
      "explanation_en": "To present information in a biased or misleading way to influence public perception, especially in politics or media.",
      "explanation_cn": "指以有偏见或误导性的方式呈现信息，以影响公众认知，尤指在政治或媒体中操纵舆论。",
      "example_en": "The politician tried to spin the scandal as a misunderstanding.",
      "example_cn": "这位政客试图将这场丑闻包装成一场误会。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rotate",
      "analysis": "“Rotate” (旋转) 是一个更中性、技术性的术语，强调围绕轴心的规律性运动，常用于机械或科学语境。而 “spin” 更常用于描述快速、自由或不规则的旋转，带有更强的动感和口语色彩。"
    },
    {
      "word_to_compare": "twirl",
      "analysis": "“Twirl” (旋转/转动) 通常指优雅、轻盈或小范围的旋转，常用于描述头发、裙子或舞蹈动作，带有审美和细腻的意味。而 “spin” 更强调速度和力量，范围更广，可指剧烈或失控的转动。"
    },
    {
      "word_to_compare": "fabricate",
      "analysis": "“Fabricate” (捏造) 指完全虚构或伪造事实，具有明确的欺骗意图，语义更重、更负面。而 “spin” 虽然也涉及操纵，但通常是在真实信息基础上进行选择性呈现或重新诠释，目的是引导而非完全造假。"
    }
  ]
}