{
  "word": "spinner",
  "pronunciation": "spín·ər",
  "concise_definition": "n. 旋转物, 转盘, 纺纱工, 网络弹窗",
  "forms": {
    "plural": "spinners"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A device or object designed to rotate, often for entertainment, sport, or functional purposes, such as a fidget spinner or a spinning top.",
      "explanation_cn": "指设计用于旋转的装置或物体，常用于娱乐、运动或功能性目的，例如减压陀螺或旋转陀螺。",
      "example_en": "Children love playing with fidget spinners to help them focus.",
      "example_cn": "孩子们喜欢玩减压陀螺来帮助集中注意力。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person whose job is to spin fibers, especially wool or cotton, into thread or yarn.",
      "explanation_cn": "指以纺纱为职业的人，尤其是将羊毛或棉花纺成纱线的人。",
      "example_en": "In medieval times, the spinner was a vital part of every household.",
      "example_cn": "在中世纪，纺纱工是每个家庭中不可或缺的角色。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of online advertisement that automatically opens a new browser window or tab, often unexpectedly and disruptively.",
      "explanation_cn": "指一种网络广告，会自动弹出新的浏览器窗口或标签页，通常出人意料且具有干扰性。",
      "example_en": "The website was filled with annoying spinners that ruined the browsing experience.",
      "example_cn": "这个网站充斥着烦人的弹窗广告，破坏了浏览体验。"
    },
    {
      "pos": "noun",
      "explanation_en": "In baseball or cricket, a player who specializes in delivering spin bowling, using finger or wrist action to make the ball turn in the air.",
      "explanation_cn": "在棒球或板球中，指专门使用手指或手腕动作使球在空中旋转的投球手。",
      "example_en": "The spinner bowled a perfect off-break that deceived the batsman.",
      "example_cn": "这位旋转投球手投出了一记完美的内旋球，骗过了击球手。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rotor",
      "analysis": "“Rotor”（转子）是工程术语，特指机械系统中旋转的部件，如直升机旋翼或电机转子，强调其作为动力系统核心组件的功能性。而 “spinner” 更广泛，可指任何旋转物体，包括非机械的、娱乐性的或抽象的旋转物，语义更生活化。"
    },
    {
      "word_to_compare": "spinning_top",
      "analysis": "“Spinning top”（旋转陀螺）是 “spinner” 的一个具体子类，专指传统玩具中靠惯性旋转的锥形物体。而 “spinner” 可涵盖现代设计的减压玩具、广告弹窗甚至投球技术，语义范围更广。"
    },
    {
      "word_to_compare": "ad_popup",
      "analysis": "“Ad_popup”（广告弹窗）是网络术语，专指用户主动触发或被动弹出的广告窗口，强调其侵入性。而 “spinner” 在此语境下是口语化、略带贬义的替代词，常用于描述那些自动、无预警且干扰性强的弹窗，语气更生动、非正式。"
    }
  ]
}