{
  "word": "spindle",
  "pronunciation": "spin·dul",
  "concise_definition": "n. 纺锤, 轴, 转轴; v. 用纺锤纺纱",
  "forms": {
    "plural": "spindles"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long, thin, cylindrical rod or shaft, typically used in machinery to support or rotate components, such as in a lathe, drill, or spinning wheel.",
      "explanation_cn": "一种细长的圆柱形杆或轴，通常用于机械中支撑或带动部件，例如车床、钻床或纺车上的核心部件。",
      "example_en": "The lathe's spindle rotates the workpiece at high speed.",
      "example_cn": "车床的主轴以高速旋转工件。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slender stick used in hand-spinning to twist fibers into yarn or thread, often with a weighted bobbin at the bottom.",
      "explanation_cn": "一种用于手工纺纱的细长棒，通常底部配有重锤，用于将纤维捻成纱线或线。",
      "example_en": "She used a wooden spindle to spin wool into fine thread.",
      "example_cn": "她用一根木制纺锤将羊毛纺成细线。"
    },
    {
      "pos": "noun",
      "explanation_en": "A vertical support or decorative post, especially in a staircase railing or balustrade, often made of wood or metal.",
      "explanation_cn": "一种垂直的支撑杆或装饰柱，尤指楼梯扶手或栏杆中的立柱，通常由木材或金属制成。",
      "example_en": "The old mansion had elegant wooden spindles in its staircase railing.",
      "example_cn": "这座古老宅邸的楼梯扶手上有精美的木制立柱。"
    },
    {
      "pos": "verb",
      "explanation_en": "To spin fibers into yarn or thread using a spindle.",
      "explanation_cn": "使用纺锤将纤维捻成纱线或线。",
      "example_en": "In ancient times, women would spindle wool every evening.",
      "example_cn": "在古代，妇女们每天晚上都会用纺锤纺羊毛。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "shaft",
      "analysis": "“Shaft”（轴）是更通用的术语，泛指任何长而细的杆状机械部件，用于传递动力或支撑旋转部件，如传动轴、电梯井道。而 “spindle” 是一种特定类型的轴，通常更细、更轻，专用于旋转或纺纱，常出现在纺织机械或精密工具中。"
    },
    {
      "word_to_compare": "rod",
      "analysis": "“Rod”（杆）指任何细长的固体条状物，用途广泛，可为金属、塑料或木材，不一定用于旋转或支撑。而 “spindle” 特指具有旋转功能或纺纱功能的细轴，具有明确的机械或工艺目的，语义更专业。"
    },
    {
      "word_to_compare": "post",
      "analysis": "“Post”（柱子）通常指用于支撑或分隔的垂直结构，如门柱、灯柱，强调承重和结构功能，一般不旋转。而 “spindle” 在建筑语境中虽也指栏杆立柱，但其形态更纤细、常成组排列，且源于纺织术语，具有历史语义关联。"
    }
  ]
}