{
  "word": "spirit",
  "pronunciation": "spir·it",
  "concise_definition": "n. 精神, 灵魂, 意志, 酒精",
  "forms": {
    "plural": "spirits"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The non-physical part of a person that is the seat of emotions and character; the essence of a person's being, often considered immortal or transcendent.",
      "explanation_cn": "人的非物理部分，是情感与性格的所在，常被视为不朽或超越物质的存在，即灵魂或精神。",
      "example_en": "She has a strong spirit that helps her overcome every challenge.",
      "example_cn": "她拥有坚强的精神，使她能够克服每一个挑战。"
    },
    {
      "pos": "noun",
      "explanation_en": "The prevailing mood, attitude, or intention of a group, movement, or time period, often referring to the underlying essence rather than literal words.",
      "explanation_cn": "指一个群体、运动或时代所普遍体现的情绪、态度或意图，强调其内在本质而非字面含义。",
      "example_en": "The spirit of the law is more important than its exact wording.",
      "example_cn": "法律的精神比其确切措辞更为重要。"
    },
    {
      "pos": "noun",
      "explanation_en": "A supernatural being or ghost, often believed to be the soul of a deceased person that appears to the living.",
      "explanation_cn": "指超自然的存在或鬼魂，通常被认为是已故之人的灵魂，会显现于生者面前。",
      "example_en": "The old house is said to be haunted by the spirits of its former owners.",
      "example_cn": "据说这座老房子被前主人的鬼魂所困扰。"
    },
    {
      "pos": "noun",
      "explanation_en": "A strong alcoholic drink, such as whiskey or vodka, distilled from fermented substances.",
      "explanation_cn": "指通过发酵物蒸馏而成的烈性酒精饮料，如威士忌或伏特加。",
      "example_en": "He ordered a glass of whiskey, his favorite spirit.",
      "example_cn": "他点了一杯威士忌，这是他最爱的烈酒。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "soul",
      "analysis": "“Soul” (灵魂) 更具宗教或哲学色彩，常指人类内在永恒、神圣的本质，强调道德与神性维度；而 “spirit” 更广泛，可指情绪、活力或超自然存在，语义范围更广，有时可与 “soul” 互换，但更偏向动态与能量层面。"
    },
    {
      "word_to_compare": "mind",
      "analysis": "“Mind” (心智) 指认知、思维、意识等理性功能，是大脑的产物；而 “spirit” 更侧重情感、意志与生命力，常超越理性范畴，具有非理性或超验的含义。两者分别代表理性与非理性的核心。"
    },
    {
      "word_to_compare": "ghost",
      "analysis": "“Ghost” (幽灵) 专指死者灵魂的可见显现，带有恐怖或迷信色彩，是 “spirit” 在超自然语境下的具体化表现；而 “spirit” 作为抽象名词，可指任何非物质的存在或能量，不一定是亡者之魂。"
    },
    {
      "word_to_compare": "alcohol",
      "analysis": "“Alcohol” (酒精) 是化学术语，泛指乙醇类化合物，是物质层面的科学概念；而 “spirit” 在此语境下是文化与日常用语，特指蒸馏烈酒，带有社会与消费语境，如 ‘spirits bar’。"
    }
  ]
}