{
  "word": "spiritual",
  "pronunciation": "spir·i·choo·uhl",
  "concise_definition": "adj. 精神的, 灵性的, 宗教的",
  "forms": {
    "comparative": "spiritual",
    "superlative": "spiritual"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to the human spirit or soul as opposed to material or physical things; concerned with matters of the soul, faith, or religious belief.",
      "explanation_cn": "指与人的精神或灵魂相关，而非物质或肉体层面的；关注灵魂、信仰或宗教信念的事物。",
      "example_en": "She found peace through spiritual practices like meditation and prayer.",
      "example_cn": "她通过冥想和祈祷等灵性实践找到了内心的平静。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Not literal or physical; existing in a non-material, abstract, or symbolic sense, often used to describe emotional or moral depth.",
      "explanation_cn": "非字面或非物理的；以非物质、抽象或象征的方式存在，常用于描述情感或道德上的深度。",
      "example_en": "The novel has a spiritual quality that resonates with readers long after they finish it.",
      "example_cn": "这部小说具有一种灵性的特质，让读者在读完后仍久久共鸣。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Connected with religion or religious experience, especially in a personal or non-institutional way.",
      "explanation_cn": "与宗教或宗教体验相关，尤其指个人化、非制度化的宗教体验。",
      "example_en": "He identifies as spiritual but not religious, preferring personal connection over organized worship.",
      "example_cn": "他自认为是灵性的而非宗教的，更倾向于个人的连接而非有组织的礼拜。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "religious",
      "analysis": "“Religious”（宗教的）强调与特定宗教体系、教义、仪式或组织的关联，具有制度性和规范性。而 “spiritual” 更侧重个人内在体验、意义追寻和超越性感受，不一定依赖任何正式宗教。一个人可以是 spiritual 但不 religious。"
    },
    {
      "word_to_compare": "mental",
      "analysis": "“Mental”（心理的/精神的）指与大脑、思维、认知功能相关，属于心理学或神经科学范畴。而 “spiritual” 涉及的是超越理性的存在意义、灵魂或宇宙联结，属于哲学或宗教体验层面，二者维度不同。"
    },
    {
      "word_to_compare": "emotional",
      "analysis": "“Emotional”（情感的）描述的是情绪反应，如喜悦、悲伤、愤怒等，是心理和生理的即时反应。而 “spiritual” 指的是深层的、持久的内在觉醒或与更高力量的连接，通常伴随宁静、敬畏或顿悟，超越情绪波动。"
    }
  ]
}