{
  "word": "spirits",
  "pronunciation": "spir·ihts",
  "concise_definition": "n. 精神, 情绪, 酒精饮料, 灵魂",
  "forms": {
    "singular": "spirit"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The non-physical part of a person that is the seat of emotions and character; the inner self or emotional state.",
      "explanation_cn": "指人的非物质部分，作为情感与性格的中心，也可泛指人的情绪或精神状态。",
      "example_en": "After hearing the good news, her spirits lifted immediately.",
      "example_cn": "听到这个好消息后，她的情绪立刻高涨起来。"
    },
    {
      "pos": "noun",
      "explanation_en": "Alcoholic drinks, especially distilled liquors such as whiskey, vodka, or gin, as opposed to beer or wine.",
      "explanation_cn": "指酒精饮料，尤指蒸馏酒，如威士忌、伏特加或金酒，区别于啤酒或葡萄酒。",
      "example_en": "The bar specializes in fine spirits and classic cocktails.",
      "example_cn": "这家酒吧专营优质烈酒和经典鸡尾酒。"
    },
    {
      "pos": "noun",
      "explanation_en": "The soul or ghost of a deceased person, often believed to linger in the physical world.",
      "explanation_cn": "指已故之人的灵魂或幽灵，常被认为在物质世界中徘徊。",
      "example_en": "Locals say the old mansion is haunted by the spirits of its former owners.",
      "example_cn": "当地居民说，这座老宅子被前主人的幽灵所困扰。"
    },
    {
      "pos": "noun",
      "explanation_en": "The prevailing mood or attitude of a group or community, especially in a collective context such as a team or nation.",
      "explanation_cn": "指一个群体或社区的普遍情绪或态度，尤其用于团队、军队或国家等集体语境中。",
      "example_en": "The team's spirits were high despite the long season of losses.",
      "example_cn": "尽管经历了漫长的失利期，球队的士气依然高昂。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mood",
      "analysis": "“Mood”（情绪）指短暂、易变的心理状态，通常用于描述个人当下的感受，如开心、烦躁等，不涉及深层性格或超自然含义。而 “spirits” 可以指更持久或集体性的情绪状态，且常用于复数形式，强调情绪的波动性或整体氛围。"
    },
    {
      "word_to_compare": "alcohol",
      "analysis": "“Alcohol”（酒精）是化学术语，泛指乙醇类物质，可指饮料中的成分或工业用途。而 “spirits” 是文化语境中的具体指称，特指蒸馏烈酒，带有社会和消费语境，不用于科学描述。"
    },
    {
      "word_to_compare": "soul",
      "analysis": "“Soul”（灵魂）通常具有宗教或哲学深度，强调人的本质、道德核心或永恒存在，语义更庄重、抽象。而 “spirits” 在指灵魂时更常用于民间信仰、鬼怪传说或文学语境，语义更轻、更具神秘色彩，有时甚至带有轻佻或通俗意味。"
    }
  ]
}