{
  "word": "splash",
  "pronunciation": "splash",
  "concise_definition": "n. 溅起, 水花; v. 溅, 泼洒; n. 一抹, 一点; n. 炫目展示",
  "forms": {
    "third_person_singular": "splashes",
    "past_tense": "splashed",
    "past_participle": "splashed",
    "present_participle": "splashing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small amount of liquid that is thrown or moves suddenly through the air, often making a sound as it hits a surface.",
      "explanation_cn": "指少量液体突然飞溅或移动，通常在撞击表面时发出声音，如水花、溅起的水滴。",
      "example_en": "The children laughed as they jumped into the puddle and created a big splash.",
      "example_cn": "孩子们跳进水坑时发出大大的水花，开心地笑了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause liquid to move suddenly and forcefully in all directions, often hitting nearby surfaces.",
      "explanation_cn": "使液体突然猛烈地向各个方向飞溅，通常会溅到附近的物体表面。",
      "example_en": "She splashed water on her face to wake up.",
      "example_cn": "她往脸上泼水以让自己清醒。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small amount of a color or substance added to something, especially to add visual interest or contrast.",
      "explanation_cn": "指少量添加到某物中的颜色或物质，尤其用于增添视觉趣味或对比效果，如一抹色彩。",
      "example_en": "The painting had a splash of red to draw attention to the center.",
      "example_cn": "这幅画中点缀了一抹红色，以吸引视线聚焦于中心。"
    },
    {
      "pos": "noun",
      "explanation_en": "A noticeable and often ostentatious display or publicity, especially in media or advertising.",
      "explanation_cn": "指引人注目的、常常是炫耀性的展示或宣传，尤其在媒体或广告中。",
      "example_en": "The new smartphone launch received a huge splash in the tech press.",
      "example_cn": "这款新智能手机的发布在科技媒体上引起了巨大轰动。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "spill",
      "analysis": "“Spill” (洒出) 指液体或颗粒物意外地从容器中流出或散落，强调无意识或事故性，通常不伴随飞溅的动态或声音。而 “splash” 强调液体被主动或猛烈地抛洒，常伴有声音和视觉冲击，更具动感和表现力。"
    },
    {
      "word_to_compare": "spray",
      "analysis": "“Spray” (喷洒) 指液体被分散成细小的雾状或颗粒状，通常通过压力或喷嘴实现，如喷雾器。它更均匀、更细密，而 “splash” 是大块液体的突然飞溅，颗粒更大、更不规则。"
    },
    {
      "word_to_compare": "blaze",
      "analysis": "“Blaze” (闪耀/烈火) 通常用于形容强烈的光、火或色彩的耀眼表现，多用于视觉上的强烈冲击。而 “splash” 虽也可用于比喻性的“醒目展示”，但其本义与液体相关，更偏向于动态、短暂、具象的视觉效果，而非持续的光亮。"
    }
  ]
}