{
  "word": "splinter",
  "pronunciation": "splin·tər",
  "concise_definition": "n. 木屑, 碎片; v. 分裂, 碎裂",
  "forms": {
    "third_person_singular": "splinters",
    "past_tense": "splintered",
    "past_participle": "splintered",
    "present_participle": "splintering",
    "plural": "splinters"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A thin, sharp fragment broken off from a larger piece of wood, glass, or other brittle material, often causing injury.",
      "explanation_cn": "从木材、玻璃或其他脆性材料上断裂下来的一片细小、尖锐的碎片，常会造成刺伤。",
      "example_en": "He got a splinter in his finger while handling the old wooden fence.",
      "example_cn": "他在处理那道旧木栅栏时，手指被扎进了一片木屑。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small group that has split off from a larger organization, often due to ideological or political differences.",
      "explanation_cn": "因意识形态或政治分歧而从一个更大组织中分裂出来的小团体。",
      "example_en": "A splinter group of the party formed its own political movement.",
      "example_cn": "该政党的一群分裂分子组建了自己的政治运动。"
    },
    {
      "pos": "verb",
      "explanation_en": "To break or cause to break into small, sharp fragments, especially along natural lines of weakness.",
      "explanation_cn": "使某物沿其薄弱处断裂成细小、尖锐的碎片，尤指木材或玻璃等材料。",
      "example_en": "The old chair splintered when he sat down too hard.",
      "example_cn": "他用力过猛地坐下时，那把旧椅子裂开了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To divide or cause to divide into factions or opposing groups, especially within an organization.",
      "explanation_cn": "使（组织、团体）分裂成派系或对立群体。",
      "example_en": "The scandal splintered the once-unified party into several rival factions.",
      "example_cn": "这场丑闻使原本统一的政党分裂成了几个相互竞争的派系。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fragment",
      "analysis": "“Fragment”（碎片）是更通用的词，泛指任何被打破或分离出来的小部分，不特指形状或材质，可用于抽象概念（如记忆碎片）。而 “splinter” 特指尖锐、细长的碎片，多用于木材、玻璃等硬质材料，且常带有危险或刺痛的语义色彩。"
    },
    {
      "word_to_compare": "shard",
      "analysis": "“Shard”（碎片）通常指玻璃、陶瓷或金属等坚硬材料破裂后形成的锋利碎片，强调其坚硬和危险性，常用于考古或灾难语境。而 “splinter” 更常用于有机材料如木材，形状更细长，语义上更贴近日常生活中被刺伤的情景。"
    },
    {
      "word_to_compare": "schism",
      "analysis": "“Schism”（分裂）是正式术语，专指宗教、政治或组织内部因教义或原则分歧而产生的深刻、制度性分裂，语义更严肃、抽象。而 “splinter” 作为动词或名词时，更强调分裂的动态过程或分裂后形成的小团体，语气较口语化，常用于描述非正式或临时性的派系分离。"
    }
  ]
}