{
  "word": "splits",
  "pronunciation": "splihts",
  "concise_definition": "n. 分裂, 分割, 跨步, 马步; v. 分裂, 分开, 分担",
  "forms": {
    "singular": "split",
    "past_tense": "split",
    "past_participle": "split",
    "present_participle": "splitting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A division or separation of something into parts, often along a natural or forced line; can refer to physical, social, or ideological fragmentation.",
      "explanation_cn": "指某物沿自然或强制的界限被分割成部分，可指物理上的、社会上的或意识形态上的分裂。",
      "example_en": "The company faced a major split among its board members over the merger.",
      "example_cn": "公司董事会成员在合并问题上出现了重大分歧。"
    },
    {
      "pos": "noun",
      "explanation_en": "A gymnastic or dance movement in which the legs are extended in opposite directions, typically front and back or left and right, forming a straight line.",
      "explanation_cn": "体操或舞蹈动作，双腿向相反方向伸展（通常为前后或左右），形成一条直线。",
      "example_en": "She nailed the splits during her floor routine at the competition.",
      "example_cn": "她在比赛的自由体操中完美完成了劈叉动作。"
    },
    {
      "pos": "verb",
      "explanation_en": "To divide or cause something to separate into two or more parts, often suddenly or violently.",
      "explanation_cn": "将某物或使其突然或剧烈地分成两个或多个部分。",
      "example_en": "The tree split in two during the storm.",
      "example_cn": "风暴中，那棵树被劈成了两半。"
    },
    {
      "pos": "verb",
      "explanation_en": "To share or divide something, especially costs or responsibilities, among two or more parties.",
      "explanation_cn": "将某物（尤指费用或责任）分摊给两个或多个方。",
      "example_en": "They decided to split the bill evenly between the five of them.",
      "example_cn": "他们决定五个人平分账单。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "division",
      "analysis": "“Division” (分割) 是一个更正式、更广泛的术语，常用于组织、数学或抽象概念的划分，如“公司部门”或“数字除法”。而 “split” 更口语化，常暗示一种突然、不完全或带有冲突性的分离，如人际关系或物体的断裂。"
    },
    {
      "word_to_compare": "separation",
      "analysis": "“Separation” (分离) 强调状态的脱离或距离的产生，常用于情感、空间或法律语境（如夫妻分居）。它更侧重于结果状态，而 “split” 更强调动作或事件本身，且常用于非正式语境，如“团队分裂”或“分摊费用”。"
    },
    {
      "word_to_compare": "straddle",
      "analysis": "“Straddle” (跨坐/骑跨) 是指双腿跨在某物上，如骑在马背上或站在物体两侧，但不一定是完全伸展成直线。而 “split” 在体操语境中特指双腿完全伸直、呈180度的姿势，是“straddle”的一种极限形式，更具技术性和规范性。"
    }
  ]
}