{
  "word": "split",
  "pronunciation": "split",
  "concise_definition": "v. 分裂, 分开, 分割; n. 分裂, 分开, 一份",
  "forms": {
    "third_person_singular": "splits",
    "past_tense": "split",
    "past_participle": "split",
    "present_participle": "splitting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To divide or cause something to separate into two or more parts, often by force or cutting.",
      "explanation_cn": "指通过外力或切割使某物分成两个或多个部分。",
      "example_en": "The axe split the log cleanly in two.",
      "example_cn": "斧头把木头干净利落地劈成了两半。"
    },
    {
      "pos": "verb",
      "explanation_en": "To separate or part ways with someone, often abruptly or permanently.",
      "explanation_cn": "指与某人分开、断绝关系，常带有突然或永久的意味。",
      "example_en": "After five years of marriage, they decided to split.",
      "example_cn": "结婚五年后，他们决定分手。"
    },
    {
      "pos": "verb",
      "explanation_en": "To share or divide something, especially money or responsibilities, among two or more people.",
      "explanation_cn": "指在两人或多人之间分配某物，尤指金钱或责任。",
      "example_en": "We split the bill evenly between us.",
      "example_cn": "我们平摊了账单。"
    },
    {
      "pos": "noun",
      "explanation_en": "A division or separation, especially one that creates a gap or break in something.",
      "explanation_cn": "指某物的分裂或分离，尤指造成缺口或断裂的分界。",
      "example_en": "There was a deep split in the company’s leadership.",
      "example_cn": "公司管理层出现了严重分歧。"
    },
    {
      "pos": "noun",
      "explanation_en": "A portion or share of something that has been divided, especially in informal contexts like money or food.",
      "explanation_cn": "指被分割后所得的一部分，常用于非正式语境中，如金钱或食物。",
      "example_en": "He took his split of the winnings and left.",
      "example_cn": "他拿走了自己那份奖金就走了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "divide",
      "analysis": "“Divide” (分割) 更中性、更广泛，常用于数学、组织或抽象概念的划分，强调将整体划分为若干部分，不一定有破坏性。而 “split” 更常暗示物理上的断裂、突然的分离或情感上的决裂，语气更强烈。"
    },
    {
      "word_to_compare": "separate",
      "analysis": "“Separate” (分离) 强调使原本在一起的事物不再接触或结合，但不一定造成物理上的断裂，常用于空间、状态或关系的隔离。而 “split” 更强调从一个整体中被强行或明显地切开，常带有破裂的意味。"
    },
    {
      "word_to_compare": "break",
      "analysis": "“Break” (打破) 通常指因外力导致的损坏或断裂，常带有负面或意外的含义，如玻璃破碎。而 “split” 可以是自然的、计划的或中性的分裂，如木头沿纹理裂开，或两人友好地分账。"
    }
  ]
}