{
  "word": "spoiling",
  "pronunciation": "spoy·lihng",
  "concise_definition": "v. 毁坏, 腐坏, 纵容, 使厌倦",
  "forms": {
    "base_form": "spoil",
    "third_person_singular": "spoils",
    "past_tense": "spoiled",
    "past_participle": "spoiled",
    "present_participle": "spoiling"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To cause food or other organic matter to become unfit for use by decay or bacterial action, often due to exposure to air, heat, or time.",
      "explanation_cn": "指因暴露于空气、高温或时间推移而导致食物或其他有机物腐败、变质，失去食用或使用价值。",
      "example_en": "The milk was left out too long and is now spoiling.",
      "example_cn": "牛奶放得太久，现在已经变质了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To damage or ruin something, especially by careless or harmful actions, often reducing its value, quality, or enjoyment.",
      "explanation_cn": "指因粗心或有害行为而破坏或毁坏某物，通常降低其价值、质量或可享受性。",
      "example_en": "The constant noise from the construction site is spoiling our vacation.",
      "example_cn": "建筑工地的持续噪音正在破坏我们的假期。"
    },
    {
      "pos": "verb",
      "explanation_en": "To overindulge a child or person, especially by giving them too many privileges or material things, leading to bad behavior or entitlement.",
      "explanation_cn": "指过度溺爱孩子或某人，给予过多特权或物质，导致其行为不良或产生优越感。",
      "example_en": "She's been spoiling her grandson with toys and candy every day.",
      "example_cn": "她每天都给孙子买玩具和糖果，把他宠坏了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reveal key plot details of a movie, book, or show before someone has experienced it, thereby diminishing their enjoyment.",
      "explanation_cn": "指在他人尚未观看或阅读前，提前泄露电影、书籍或剧集的关键情节，从而破坏其观赏乐趣。",
      "example_en": "Don't spoil the ending for me—I haven't watched the finale yet!",
      "example_cn": "别剧透结局——我还没看大结局呢！"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rotting",
      "analysis": "“Rotting” (腐烂) 专指有机物因微生物作用而发生的自然分解过程，强调物理和生物变化，通常用于食物、植物或尸体。而 “spoiling” 范围更广，可包括非生物性破坏（如破坏体验）或人为纵容，不局限于生物腐败。"
    },
    {
      "word_to_compare": "damaging",
      "analysis": "“Damaging” (损害) 是一个中性词，泛指对某物造成伤害或不利影响，不隐含程度或意图。而 “spoiling” 常带有更强烈的负面情感色彩，尤其在指“破坏体验”或“溺爱”时，暗示一种本可避免的、因疏忽或过度而造成的损失。"
    },
    {
      "word_to_compare": "coddling",
      "analysis": "“Coddling” (娇惯) 与 “spoiling” 在“溺爱”义项上高度重合，但 “coddling” 更强调过度保护、避免困难，而 “spoiling” 更侧重于给予过多物质或特权，导致行为失范。两者常互换，但 “spoiling” 更口语化且带有更明显的批评意味。"
    }
  ]
}