{
  "word": "sponsoring",
  "pronunciation": "spahn·sawr·ing",
  "concise_definition": "v. 赞助, 资助, 支持",
  "forms": {
    "base_form": "sponsor",
    "third_person_singular": "sponsors",
    "past_tense": "sponsored",
    "past_participle": "sponsored",
    "present_participle": "sponsoring"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To provide financial or material support for an event, organization, activity, or individual, typically in exchange for advertising or public recognition.",
      "explanation_cn": "为某项活动、组织、事件或个人提供资金或物资支持，通常以换取广告宣传或公众认可作为回报。",
      "example_en": "The company is sponsoring the local marathon to increase brand visibility.",
      "example_cn": "该公司正在赞助当地马拉松赛，以提升品牌知名度。"
    },
    {
      "pos": "verb",
      "explanation_en": "To act as a guarantor or advocate for someone, especially in a formal or official context, such as sponsoring a visa application or a candidate for office.",
      "explanation_cn": "在正式或官方场合中为某人担任担保人或倡导者，例如为签证申请或候选人提供担保。",
      "example_en": "Her employer is sponsoring her work visa so she can continue living and working in the country.",
      "example_cn": "她的雇主正在为她担保工作签证，以便她能继续在该国生活和工作。"
    },
    {
      "pos": "verb",
      "explanation_en": "To take responsibility for initiating or supporting a project, proposal, or initiative, often by providing resources or influence.",
      "explanation_cn": "主动承担起发起或支持某项计划、提案或倡议的责任，通常通过提供资源或影响力来实现。",
      "example_en": "The senator is sponsoring a bill to improve public transportation infrastructure.",
      "example_cn": "这位参议员正在推动一项改善公共交通基础设施的法案。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "funding",
      "analysis": "“Funding”（资金支持）强调提供金钱资源本身，是一个中性名词或动词，不必然包含宣传或关系建立的意图。而 “sponsoring” 不仅提供资金，还隐含了品牌关联、宣传回报或身份绑定，具有更强的营销和公关属性。"
    },
    {
      "word_to_compare": "supporting",
      "analysis": "“Supporting”（支持）是一个更广泛、更模糊的词，可以指情感、道义、体力或资源上的帮助，不一定涉及金钱或商业回报。而 “sponsoring” 通常特指有明确目的（如品牌曝光）的经济支持，具有契约性和策略性。"
    },
    {
      "word_to_compare": "backing",
      "analysis": "“Backing”（支持/后盾）常用于政治或组织语境，指权威性或影响力上的支持，可能不涉及金钱，如‘political backing’。而 ‘sponsoring’ 更强调实际资源投入（尤其是资金）和公开的关联性，常用于商业和活动场景。"
    }
  ]
}