{
  "word": "sponge",
  "pronunciation": "spunj",
  "concise_definition": "n. 海绵, 吸水物; v. 吸收, 依赖他人生活",
  "forms": {
    "plural": "sponges",
    "third_person_singular": "sponges",
    "past_tense": "sponged",
    "past_participle": "sponged",
    "present_participle": "sponging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A porous, absorbent material, either natural (from sea animals) or synthetic, used for cleaning, bathing, or absorbing liquids.",
      "explanation_cn": "一种多孔、可吸水的材料，可以是天然的（来自海洋生物）或人造的，常用于清洁、沐浴或吸收液体。",
      "example_en": "She used a soft sponge to wash the dishes without scratching them.",
      "example_cn": "她用一块柔软的海绵洗碗，以免刮花碗碟。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who takes advantage of others by relying on them for food, money, or shelter without offering anything in return.",
      "explanation_cn": "指依靠他人提供食物、金钱或住所而不给予任何回报的人，常带有贬义。",
      "example_en": "He's been living with his brother for years — a real sponge who never pays rent.",
      "example_cn": "他多年来一直住在哥哥家——是个从不付房租的寄生虫。"
    },
    {
      "pos": "verb",
      "explanation_en": "To absorb or take in a liquid, substance, or information quickly and completely.",
      "explanation_cn": "指迅速而彻底地吸收液体、物质或信息。",
      "example_en": "The towel sponged up the spilled water in seconds.",
      "example_cn": "毛巾几秒钟就吸干了洒出的水。"
    },
    {
      "pos": "verb",
      "explanation_en": "To live at the expense of others by taking advantage of their generosity or resources.",
      "explanation_cn": "指利用他人的慷慨或资源，靠他人供养而生活。",
      "example_en": "After losing his job, he sponged off his parents for months.",
      "example_cn": "失业后，他靠父母养活了好几个月。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cloth",
      "analysis": "“Cloth”（布料）是用于擦拭或覆盖的平面材料，通常不具备多孔吸水结构，也不强调吸收能力。而 “sponge” 特指具有高度吸水性和多孔结构的材料，功能更专一于吸收液体。"
    },
    {
      "word_to_compare": "absorb",
      "analysis": "“Absorb” 是一个通用动词，表示任何物质或能量被摄入或接纳，可用于液体、光线、知识等。而 “sponge” 作为动词时，特指像海绵一样快速、彻底地吸收，常带有形象化和口语色彩，且常用于非正式语境中。"
    },
    {
      "word_to_compare": "parasite",
      "analysis": "“Parasite”（寄生虫）是生物学或比喻意义上完全依赖宿主生存的生物，通常带有强烈的负面道德评判。而 “sponge” 作为比喻用法时，语气较轻，更侧重于懒惰或占便宜的行为，不一定涉及生理依赖，常用于日常口语。"
    }
  ]
}