{
  "word": "sponsors",
  "pronunciation": "spahn·sawrz",
  "concise_definition": "n. 赞助商, 赞助者; v. 赞助, 资助",
  "forms": {
    "singular": "sponsor",
    "third_person_singular": "sponsors",
    "past_tense": "sponsored",
    "past_participle": "sponsored",
    "present_participle": "sponsoring"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An individual, organization, or company that provides financial or other support to an event, person, activity, or cause in exchange for promotional exposure or other benefits.",
      "explanation_cn": "指为某项活动、事件、个人或事业提供资金或其他支持的个人、组织或公司，以换取宣传曝光或其他回报。",
      "example_en": "The marathon was sponsored by several major sports brands.",
      "example_cn": "这场马拉松由几家大型运动品牌赞助。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who vouches for or guarantees another, especially in legal, immigration, or institutional contexts.",
      "explanation_cn": "指在法律、移民或机构环境中为他人作担保或背书的人。",
      "example_en": "She needed a sponsor to apply for her student visa.",
      "example_cn": "她需要一位担保人才能申请学生签证。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provide financial or material support for an event, organization, or individual, typically to gain advertising or public recognition.",
      "explanation_cn": "指为某项活动、组织或个人提供资金或物资支持，通常是为了获得广告宣传或公众认可。",
      "example_en": "The tech company sponsors the annual innovation conference.",
      "example_cn": "这家科技公司赞助了年度创新大会。"
    },
    {
      "pos": "verb",
      "explanation_en": "To act as a guarantor or advocate for someone, especially in formal or official settings.",
      "explanation_cn": "指在正式或官方场合中为某人作担保或倡导。",
      "example_en": "His uncle sponsored his application for permanent residency.",
      "example_cn": "他的叔叔为他申请永久居留权提供了担保。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "patrons",
      "analysis": "“Patrons”（赞助人/资助者）通常指长期、文化或艺术领域的支持者，带有更高雅、非商业化的色彩，如艺术画廊的资助者。而 “sponsors” 更强调商业回报，常用于市场推广和活动资助，目的性更强。"
    },
    {
      "word_to_compare": "donors",
      "analysis": "“Donors”（捐赠者）指无偿提供资金或物品的人或组织，通常用于慈善、公益或非营利领域，不期待直接商业回报。而 “sponsors” 的支持通常附带广告、品牌曝光等交换条件，具有互惠性质。"
    },
    {
      "word_to_compare": "backers",
      "analysis": "“Backers”（支持者）含义较广，可指任何形式的支持，包括资金、资源或政治声援，常用于创业或政治竞选语境，不一定涉及公开宣传。而 “sponsors” 更强调公开的、品牌导向的资助关系，通常有明确的标识和曝光要求。"
    }
  ]
}