{
  "word": "sponsor",
  "pronunciation": "spahn·sor",
  "concise_definition": "n. 赞助者, 赞助商; v. 赞助, 资助",
  "forms": {
    "third_person_singular": "sponsors",
    "past_tense": "sponsored",
    "past_participle": "sponsored",
    "present_participle": "sponsoring"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person, organization, or company that provides financial or other support for an event, activity, person, or cause, often in exchange for publicity or brand association.",
      "explanation_cn": "指为某项活动、事件、个人或事业提供资金或其他支持的个人、组织或公司，通常是为了换取宣传或品牌关联。",
      "example_en": "The marathon was sponsored by a major sports apparel brand.",
      "example_cn": "这场马拉松由一家大型运动服饰品牌赞助。"
    },
    {
      "pos": "noun",
      "explanation_en": "In legal or political contexts, a person who formally supports or recommends another, especially for immigration or official status.",
      "explanation_cn": "在法律或政治语境中，指正式支持或推荐他人（如移民或获得官方身份）的人。",
      "example_en": "She needs a sponsor to apply for a work visa in this country.",
      "example_cn": "她需要一位担保人来申请这个国家的工作签证。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provide financial or material support for an event, organization, or individual, typically to gain visibility or promote a brand.",
      "explanation_cn": "为某项活动、组织或个人提供资金或物资支持，通常是为了获得曝光度或推广品牌。",
      "example_en": "The tech company sponsored the international robotics competition.",
      "example_cn": "这家科技公司赞助了国际机器人竞赛。"
    },
    {
      "pos": "verb",
      "explanation_en": "To formally recommend or support someone for a position, status, or legal process, especially in immigration or institutional contexts.",
      "explanation_cn": "在移民或机构语境中，正式推荐或支持某人获得某种职位、身份或法律程序资格。",
      "example_en": "His uncle agreed to sponsor his application for permanent residency.",
      "example_cn": "他的叔叔同意为他申请永久居留权提供担保。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fund",
      "analysis": "“Fund” (资助) 强调提供资金支持，是一个更中性、更广泛的经济行为，不一定包含宣传或品牌关联的目的。而 “sponsor” 不仅提供资金，还隐含了商业回报或形象绑定的意图，常用于市场营销语境。"
    },
    {
      "word_to_compare": "support",
      "analysis": "“Support” (支持) 是一个更宽泛的词，可以包括情感、道义、体力或资金上的帮助，不必然涉及商业利益。而 “sponsor” 特指有明确目的（如品牌推广）的资源投入，具有更强的商业性和策略性。"
    },
    {
      "word_to_compare": "back",
      "analysis": "“Back” (支持/ backing) 常用于非正式语境，指在政治、事业或项目上给予支持，可能包括资金、影响力或声望，但不一定涉及公开的商业赞助行为。而 “sponsor” 更正式，通常伴随公开标识、广告或合同义务。"
    }
  ]
}