{
  "word": "sponsored",
  "pronunciation": "spahn·sawr·d",
  "concise_definition": "adj. 由...赞助的, v. 赞助, 资助",
  "forms": {
    "base_form": "sponsor",
    "third_person_singular": "sponsors",
    "past_tense": "sponsored",
    "past_participle": "sponsored",
    "present_participle": "sponsoring"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Funded, supported, or promoted by an organization, individual, or entity, typically for commercial or promotional purposes.",
      "explanation_cn": "由某个组织、个人或实体提供资金、支持或推广的，通常用于商业或宣传目的。",
      "example_en": "The sponsored segment of the show featured a new line of energy drinks.",
      "example_cn": "该节目的赞助环节推广了一款新型能量饮料。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provide financial or other support to an event, activity, person, or organization in exchange for advertising or public recognition.",
      "explanation_cn": "为某项活动、事件、个人或组织提供资金或其他支持，以换取广告宣传或公众认可。",
      "example_en": "The tech company sponsored the international robotics competition to increase brand visibility.",
      "example_cn": "这家科技公司赞助了国际机器人竞赛，以提升品牌知名度。"
    },
    {
      "pos": "verb",
      "explanation_en": "To officially recommend or endorse someone for a position, role, or candidacy, often in a formal or institutional context.",
      "explanation_cn": "在正式或机构性语境中，正式推荐或支持某人担任某一职位、角色或候选人身份。",
      "example_en": "She was sponsored by her department to attend the leadership training program.",
      "example_cn": "她由所在部门推荐参加领导力培训项目。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "advertising",
      "analysis": "“Advertising” (广告) 指通过媒体主动传播信息以促进销售或认知，是单向的信息发布行为。而 “sponsored” 强调的是资金或资源的投入关系，赞助方可能不直接发布广告，但通过支持活动获得品牌曝光，是一种更间接、更融合的推广方式。"
    },
    {
      "word_to_compare": "funded",
      "analysis": "“Funded” (资助) 侧重于提供资金支持，通常用于科研、公益或非营利项目，不必然包含宣传或品牌推广的意图。而 “sponsored” 通常隐含商业回报，赞助者期望获得品牌曝光、市场影响或公众好感，具有明确的营销目的。"
    },
    {
      "word_to_compare": "endorsed",
      "analysis": "“Endorsed” (背书/支持) 指个人或权威机构公开表示支持某人或某物，常基于信任或声誉，不一定涉及金钱支持。而 “sponsored” 必然包含实质性的资源投入（如资金、物资、服务），是一种更深度、更结构化的合作关系。"
    }
  ]
}