{
  "word": "spoon",
  "pronunciation": "spoon",
  "concise_definition": "n. 勺子, 挖取工具; v. 用勺子舀, 与人亲密依偎",
  "forms": {
    "plural": "spoons"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small utensil consisting of a shallow bowl at the end of a handle, used for eating, serving, or measuring food.",
      "explanation_cn": "一种带有手柄、末端为浅碗状的小工具，用于进食、盛放或量取食物。",
      "example_en": "She stirred her tea with a silver spoon.",
      "example_cn": "她用一把银勺搅拌茶水。"
    },
    {
      "pos": "noun",
      "explanation_en": "A unit of measurement in cooking, typically equal to about 15 milliliters (a tablespoon) or 5 milliliters (a teaspoon), depending on context.",
      "explanation_cn": "烹饪中的一种容量单位，通常指约15毫升（汤匙）或5毫升（茶匙），具体取决于语境。",
      "example_en": "Add two spoons of sugar to the batter.",
      "example_cn": "在面糊中加入两勺糖。"
    },
    {
      "pos": "noun",
      "explanation_en": "A position or posture in which two people lie close together, one behind the other, often associated with intimacy or affection.",
      "explanation_cn": "一种亲密姿势，两人背对背躺卧，一人在另一人身后紧贴，常用于表达亲密或爱意。",
      "example_en": "They fell asleep in spoon position, her back against his chest.",
      "example_cn": "他们以依偎的姿势入睡，她的背贴着他的胸膛。"
    },
    {
      "pos": "verb",
      "explanation_en": "To use a spoon to lift or transfer food, especially from a container or dish.",
      "explanation_cn": "用勺子舀取或转移食物，尤指从容器或盘子中舀出。",
      "example_en": "He spooned the soup into his bowl.",
      "example_cn": "他把汤舀进自己的碗里。"
    },
    {
      "pos": "verb",
      "explanation_en": "To lie in the intimate position known as 'spooning' with someone, typically in bed.",
      "explanation_cn": "与某人以‘依偎’姿势躺卧，通常指在床上亲密依偎。",
      "example_en": "They spooned under the blanket, listening to the rain.",
      "example_cn": "他们在毯子下依偎着，听着雨声。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ladle",
      "analysis": "“Ladle”（大勺）是一种更大、更深的勺子，通常用于从锅或大容器中舀取液体或汤，强调容量和功能性，多用于烹饪或服务场合。而 “spoon” 更通用，尺寸较小，适用于进食、测量或亲密姿势，用途更广泛。"
    },
    {
      "word_to_compare": "fork",
      "analysis": "“Fork”（叉子）是用于刺取或固定食物的工具，通常有尖齿，适用于固体食物；而 “spoon” 用于舀取、盛放流质或半流质食物，功能互补。两者在餐具中分工明确，前者侧重“穿刺”，后者侧重“盛装”。"
    },
    {
      "word_to_compare": "cuddle",
      "analysis": "“Cuddle”（拥抱、依偎）是泛指身体亲密接触的行为，可发生在任何姿势中；而 “spoon” 作为动词时特指一种具体的依偎姿势——一人在后、紧贴另一人背部。因此，“spoon” 是 “cuddle” 的一种具体形式，更具身体姿态的限定性。"
    }
  ]
}