{
  "word": "sport",
  "pronunciation": "spawrt",
  "concise_definition": "n. 运动, 体育活动; v. 佩戴, 显示, 从事运动",
  "forms": {
    "third_person_singular": "sports",
    "past_tense": "sported",
    "past_participle": "sported",
    "present_participle": "sporting",
    "plural": "sports"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A physical activity governed by rules and engaged in competitively or recreationally, typically requiring skill and physical exertion.",
      "explanation_cn": "指受规则约束、以竞争或娱乐为目的进行的体力活动，通常需要技巧和体能。",
      "example_en": "Football and tennis are popular sports around the world.",
      "example_cn": "足球和网球是全球受欢迎的运动。"
    },
    {
      "pos": "noun",
      "explanation_en": "A particular type of athletic competition or event, often organized at professional or amateur levels.",
      "explanation_cn": "指某种特定的体育竞赛或赛事，通常在职业或业余层面组织。",
      "example_en": "The Olympics is the world's largest sporting event.",
      "example_cn": "奥运会是世界上规模最大的体育赛事。"
    },
    {
      "pos": "noun",
      "explanation_en": "A fashionable or distinctive item of clothing or accessory worn to display style or status.",
      "explanation_cn": "指为展示风格或身份而佩戴的时尚或独特的服饰或配饰。",
      "example_en": "He was sporting a new pair of designer sunglasses.",
      "example_cn": "他戴着一副新潮的设计师太阳镜。"
    },
    {
      "pos": "verb",
      "explanation_en": "To wear or display something, especially something noticeable or unusual, often with pride or showiness.",
      "explanation_cn": "指佩戴或展示某物，尤其是引人注目或不寻常的东西，常带有自豪或炫耀的意味。",
      "example_en": "She was sporting a bright red hat at the party.",
      "example_cn": "她在派对上戴着一顶鲜红色的帽子。"
    },
    {
      "pos": "verb",
      "explanation_en": "To participate in a sport or physical activity, especially in a casual or recreational manner.",
      "explanation_cn": "指参与某项运动或体力活动，尤指以休闲或娱乐的方式进行。",
      "example_en": "He still sports tennis every weekend with his friends.",
      "example_cn": "他每周六日仍和朋友打网球。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "game",
      "analysis": "“Game” (游戏) 通常指具有明确规则和胜负的娱乐性活动，可以是体育性的（如篮球），也可以是非体力的（如棋类）。而 “sport” 更强调身体活动、竞技性和规则体系，范围比 “game” 更窄，但更侧重于体能表现。"
    },
    {
      "word_to_compare": "activity",
      "analysis": "“Activity” (活动) 是一个泛指词，涵盖任何有目的的行为，包括学习、工作、休闲等，不特指体育或竞争。而 “sport” 是 “activity” 的一个子集，专指有组织、有规则的体力竞技活动。"
    },
    {
      "word_to_compare": "display",
      "analysis": "“Display” (展示) 作为动词时，泛指将某物公开展示，不带有 “sport” 所蕴含的炫耀、时尚或个性表达的意味。例如，商店展示商品是中性的，而 “sporting a tattoo” 则带有个人风格或态度的表达。"
    }
  ]
}