{
  "word": "spotlight",
  "pronunciation": "spot·light",
  "concise_definition": "n. 聚光灯, 注目, 焦点; v. 使成为焦点, 突出显示",
  "forms": {
    "plural": "spotlights",
    "third_person_singular": "spotlights",
    "past_tense": "spotlighted",
    "past_participle": "spotlighted",
    "present_participle": "spotlighting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A strong, focused beam of light used in theaters or performances to illuminate a specific person or area, drawing attention to it.",
      "explanation_cn": "指在剧院或表演中使用的强烈、集中的光束，用于照亮特定人物或区域，以吸引观众注意。",
      "example_en": "The dancer moved gracefully into the spotlight as the music began.",
      "example_cn": "音乐响起时，舞者优雅地步入聚光灯下。"
    },
    {
      "pos": "noun",
      "explanation_en": "Intense public attention or scrutiny, often due to fame, controversy, or media coverage.",
      "explanation_cn": "指因名气、争议或媒体报道而引发的强烈公众关注或审视。",
      "example_en": "The politician has been in the spotlight since the scandal broke.",
      "example_cn": "自从丑闻曝光以来，这位政治家一直备受关注。"
    },
    {
      "pos": "verb",
      "explanation_en": "To draw attention to someone or something, especially in a public or prominent way, often through media or official recognition.",
      "explanation_cn": "指以公开或显著的方式将注意力引向某人或某事，通常通过媒体或官方认可实现。",
      "example_en": "The documentary spotlights the struggles of rural teachers in remote areas.",
      "example_cn": "这部纪录片突出了偏远地区乡村教师的艰难处境。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "limelight",
      "analysis": "“Limelight”（聚光灯）是“spotlight”的文学化或历史化表达，原指19世纪剧院中用石灰发光的照明方式，现多用于比喻公众关注。两者在比喻义上可互换，但 “limelight” 更具文学色彩，常用于正式或书面语境，而 “spotlight” 更通用、口语化，且可作动词使用。"
    },
    {
      "word_to_compare": "focus",
      "analysis": "“Focus”（焦点）是一个更广泛、更抽象的词，可指任何注意力集中点，不一定是公开或媒体化的。它可以是思维、镜头或讨论的中心。而 “spotlight” 强调的是被公开、强烈、甚至戏剧性地暴露于公众视野中，带有更强烈的情感和视觉冲击力。"
    },
    {
      "word_to_compare": "highlight",
      "analysis": "“Highlight”（突出）指通过强调使某事物更显眼，常用于图像编辑、报告或演讲中，强调重要部分，但不必然伴随公众关注。而 “spotlight” 不仅强调突出，还隐含了被广泛注视、甚至被审视的意味，常用于新闻、名人或社会事件语境中。"
    }
  ]
}