{
  "word": "sprays",
  "pronunciation": "sprays",
  "concise_definition": "n. 喷雾, 喷洒物; v. 喷射, 喷洒",
  "forms": {
    "singular": "spray",
    "third_person_singular": "sprays",
    "past_tense": "sprayed",
    "past_participle": "sprayed",
    "present_participle": "spraying"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A fine stream or burst of liquid or other substance ejected through a small opening, often under pressure.",
      "explanation_cn": "指通过小孔在压力下喷出的细小液流或其他物质，通常用于清洁、冷却或施加化学物质。",
      "example_en": "She used a spray of perfume to freshen up the room.",
      "example_cn": "她喷了一点香水来让房间焕然一新。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of product designed to be dispensed as a fine mist, such as hair spray, insect spray, or paint spray.",
      "explanation_cn": "指设计为以细雾形式释放的产品，如发胶、杀虫剂或喷漆。",
      "example_en": "The garden was covered in a thin layer of herbicide spray.",
      "example_cn": "花园里覆盖了一层除草剂喷雾。"
    },
    {
      "pos": "verb",
      "explanation_en": "To discharge a liquid or other substance in a fine stream or mist, typically using a nozzle or device.",
      "explanation_cn": "指使用喷嘴或装置将液体或其他物质以细流或雾状喷出。",
      "example_en": "The firefighter sprayed water on the burning building.",
      "example_cn": "消防员向着火的大楼喷水。"
    },
    {
      "pos": "verb",
      "explanation_en": "To apply a substance by spraying it onto a surface, often for protective, decorative, or medicinal purposes.",
      "explanation_cn": "指通过喷洒方式将某种物质施加到表面，常用于保护、装饰或医疗目的。",
      "example_en": "Farmers spray pesticides on crops to prevent insect damage.",
      "example_cn": "农民在作物上喷洒杀虫剂以防止虫害。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mist",
      "analysis": "“Mist”（薄雾）指自然形成或轻柔飘散的微小水滴，通常不具压力或人为控制，多用于描述天气或环境现象。而 “spray” 强调人为施加、有方向性和压力的喷射动作或产物，更具功能性。"
    },
    {
      "word_to_compare": "drip",
      "analysis": "“Drip”（滴落）指液体缓慢、单点地落下，通常因重力作用，速度慢且无压力。而 “spray” 是高速、分散、多点的喷射，覆盖范围更广，动力更强。两者在形态和机制上截然不同。"
    },
    {
      "word_to_compare": "fog",
      "analysis": "“Fog”（雾）是一种悬浮在空气中的密集水滴集合，属于自然气象现象，无方向性且不可控。而 “spray” 是人为制造的、有目标的喷射物，常用于工业、美容或农业场景，具有明确用途。"
    }
  ]
}