{
  "word": "spreads",
  "pronunciation": "spredz",
  "concise_definition": "n. 传播, 蔓延, 抹酱, 铺开; v. 传播, 蔓延, 铺开, 摊开",
  "forms": {
    "base_form": "spread",
    "third_person_singular": "spreads",
    "past_tense": "spread",
    "past_participle": "spread",
    "present_participle": "spreading"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To extend or stretch out over a wider area, often by moving or distributing something physically or metaphorically.",
      "explanation_cn": "指将某物在更大范围内延伸、铺开或分布，可以是物理上的展开，也可以是比喻性的扩散。",
      "example_en": "She spreads butter evenly on the toast.",
      "example_cn": "她把黄油均匀地抹在吐司上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause information, a disease, or an idea to move from one person, place, or group to another, often rapidly or uncontrollably.",
      "explanation_cn": "指使信息、疾病或观念从一个人、地方或群体传播到另一个，常带有迅速或不可控的意味。",
      "example_en": "Rumors spread quickly through the office after the announcement.",
      "example_cn": "公告发布后，谣言在办公室里迅速传开。"
    },
    {
      "pos": "verb",
      "explanation_en": "To extend or open out (a surface, fabric, or object) to cover a larger area, often for use or display.",
      "explanation_cn": "指将表面、织物或物体展开以覆盖更大区域，常用于使用或展示目的。",
      "example_en": "They spread a blanket on the grass for the picnic.",
      "example_cn": "他们在草地上铺开一条毯子用于野餐。"
    },
    {
      "pos": "noun",
      "explanation_en": "A food item, typically a thick, spreadable substance, served on bread or crackers, such as jam, cheese, or hummus.",
      "explanation_cn": "指一种浓稠、可涂抹的食物，通常涂在面包或饼干上，如果酱、奶酪或鹰嘴豆泥。",
      "example_en": "For breakfast, he chose honey as his favorite spread.",
      "example_cn": "早餐时，他选了蜂蜜作为最爱的涂抹酱。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large, elaborate meal served on a table with a wide variety of dishes laid out for guests to serve themselves.",
      "explanation_cn": "指一种丰盛的自助式餐食，桌上摆满各种菜肴供客人自取。",
      "example_en": "The holiday party featured a lavish spread of roasted meats, salads, and desserts.",
      "example_cn": "节日派对上摆满了烤肉、沙拉和甜点的丰盛自助餐。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "distribute",
      "analysis": "“Distribute” (分发) 强调有组织、有目的地将物品或信息分给多个接收者，常用于商业或行政语境，如分发传单或奖金。而 “spread” 更强调自然、扩散式的传播，常带有无序或广泛蔓延的意味，如谣言或疾病的传播。"
    },
    {
      "word_to_compare": "extend",
      "analysis": "“Extend” (延伸) 指在原有基础上延长或扩大范围，通常保持原有形态或结构，如延长会议时间或延伸道路。而 “spread” 更强调横向铺开、覆盖更大面积，常伴随形态的展开或分散，如布料铺开或火势蔓延。"
    },
    {
      "word_to_compare": "diffuse",
      "analysis": "“Diffuse” (扩散) 是一个更学术或科学的词，强调物质或能量在空间中均匀分散，常用于物理或化学语境，如光线扩散或气味扩散。而 “spread” 更口语化，适用范围更广，可指物理、社会或抽象事物的传播，且不强调均匀性。"
    },
    {
      "word_to_compare": "buffet",
      "analysis": "“Buffet” (自助餐) 与 “spread” 作为名词时意义相近，都指丰盛的自助餐。但 “buffet” 是更标准、正式的术语，常用于酒店或宴会场合；而 “spread” 更口语化，带有亲切、随意甚至夸张的色彩，常用于非正式语境，如家庭聚会。"
    }
  ]
}