{
  "word": "spreading",
  "pronunciation": "spred·ing",
  "concise_definition": "v. 扩散, 传播, 延伸, 铺开 (spread 的现在分词和动名词形式)",
  "forms": {
    "base_form": "spread",
    "past_tense": "spread",
    "past_participle": "spread",
    "present_participle": "spreading",
    "third_person_singular": "spreads"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To extend or expand over a wider area or among more people, often gradually or uncontrollably.",
      "explanation_cn": "指逐渐或不受控制地扩展到更广的区域或传播给更多人。",
      "example_en": "The wildfire was spreading rapidly due to strong winds.",
      "example_cn": "由于强风，野火正在迅速蔓延。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause information, ideas, beliefs, or diseases to be transmitted from one person or place to another.",
      "explanation_cn": "指使信息、思想、信仰或疾病在人与人、地区与地区之间传播。",
      "example_en": "Social media has been instrumental in spreading awareness about climate change.",
      "example_cn": "社交媒体在传播关于气候变化的意识方面发挥了重要作用。"
    },
    {
      "pos": "verb",
      "explanation_en": "To distribute or lay something out over a surface, often in a thin or even layer.",
      "explanation_cn": "指将某物均匀地铺开或分布在表面上。",
      "example_en": "She was spreading butter on her toast.",
      "example_cn": "她正在把黄油涂在吐司上。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or process of extending, transmitting, or distributing something over an area or among people.",
      "explanation_cn": "指某物在区域或人群中扩展、传播或分发的行为或过程。",
      "example_en": "The spreading of the rumor caused panic in the neighborhood.",
      "example_cn": "谣言的传播在社区中引起了恐慌。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "dispersing",
      "analysis": "“Dispersing” (分散) 强调将原本集中的人或物分开并散布到不同方向，常带有“消散”或“瓦解”的意味，如人群疏散、烟雾消散。而 “spreading” 更强调从中心向外扩展或覆盖，不一定意味着原有聚集状态的消失。"
    },
    {
      "word_to_compare": "propagating",
      "analysis": "“Propagating” (繁殖/传播) 多用于生物学（如植物繁殖）或正式语境中的思想/信仰传播，带有系统性、有意识推动的含义。而 “spreading” 更通用、更口语化，可指自然或无意识的扩散过程，如疾病或潮流的传播。"
    },
    {
      "word_to_compare": "extending",
      "analysis": "“Extending” (延伸) 通常指在原有基础上沿某一方向延长，如延长一条路、延长一个期限，强调线性或连续的延伸。而 “spreading” 更强调二维或三维的扩张，覆盖范围更广，不一定是线性的，如油污扩散、谣言传播。"
    }
  ]
}