{
  "word": "spread",
  "pronunciation": "spred",
  "concise_definition": "v. 传播, 散布, 展开, 延伸; n. 传播, 范围, 抹酱",
  "forms": {
    "third_person_singular": "spreads",
    "past_tense": "spread",
    "past_participle": "spread",
    "present_participle": "spreading"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To extend or distribute over a wide area or among many people, often referring to ideas, information, diseases, or physical objects.",
      "explanation_cn": "指将某物（如思想、信息、疾病或物理对象）扩展或分布到广阔区域或众多人群中。",
      "example_en": "Rumors spread quickly through social media during the crisis.",
      "example_cn": "危机期间，谣言通过社交媒体迅速传播。"
    },
    {
      "pos": "verb",
      "explanation_en": "To extend or stretch out something flat or open, such as a cloth, arms, or wings.",
      "explanation_cn": "指将某物（如布料、手臂或翅膀）展开或伸展开来。",
      "example_en": "She spread a blanket over the grass for the picnic.",
      "example_cn": "她把一条毯子铺在草地上用于野餐。"
    },
    {
      "pos": "verb",
      "explanation_en": "To apply a substance evenly over a surface, such as butter, jam, or paint.",
      "explanation_cn": "指将某种物质（如黄油、果酱或油漆）均匀地涂抹在表面上。",
      "example_en": "He spread peanut butter on his toast for breakfast.",
      "example_cn": "他早餐在吐司上涂了花生酱。"
    },
    {
      "pos": "noun",
      "explanation_en": "A range or extent of variation, often referring to the difference between high and low values (e.g., in prices, scores, or opinions).",
      "explanation_cn": "指某种变化的范围或幅度，常用于描述高低值之间的差异（如价格、分数或意见）。",
      "example_en": "There was a wide spread in the test scores, indicating varied levels of understanding.",
      "example_cn": "测试分数差异很大，表明理解水平参差不齐。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of food spread, typically a thick, soft substance applied to bread or crackers, such as cheese, hummus, or pâté.",
      "explanation_cn": "指一种用于涂抹在面包或饼干上的浓稠软质食物，如奶酪、鹰嘴豆泥或鹅肝酱。",
      "example_en": "The party featured a variety of cheese spreads and fresh vegetables.",
      "example_cn": "派对上提供了多种奶酪抹酱和新鲜蔬菜。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "distribute",
      "analysis": "“Distribute” (分发) 强调有组织地将物品或信息分配给特定的接收者，通常带有计划性和目的性，如分发传单或奖金。而 “spread” 更强调无序、自然或扩散式的传播，常用于描述信息、情绪或疾病的蔓延。"
    },
    {
      "word_to_compare": "extend",
      "analysis": "“Extend” (延伸) 指在空间、时间或范围上延长或扩大某物的边界，通常保持原有形态，如延长会议时间或延伸道路。“Spread” 则更强调横向展开、铺开或扩散，常伴随覆盖面积的增加，且不一定有方向性。"
    },
    {
      "word_to_compare": "scatter",
      "analysis": "“Scatter” (散播) 指将物体或信息随机、零散地抛洒或分布，强调分散和不集中，如撒种子或散传单。“Spread” 则更倾向于连续、均匀或覆盖式的扩散，如油在水面上扩散，或谣言在人群中蔓延，更具连贯性和渗透性。"
    }
  ]
}