{
  "word": "springs",
  "pronunciation": "springs",
  "concise_definition": "n. 春天, 泉水, 弹簧; v. 跳跃, 跃起",
  "forms": {
    "singular": "spring"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The season between winter and summer, characterized by warming temperatures, blooming plants, and renewed natural activity.",
      "explanation_cn": "冬季与夏季之间的季节，以气温回暖、植物开花和自然活动复苏为特征。",
      "example_en": "We planted flowers in the spring to brighten up the garden.",
      "example_cn": "我们在春天种了花，让花园更加绚丽。"
    },
    {
      "pos": "noun",
      "explanation_en": "A natural source of water that flows from the ground, often forming streams or pools.",
      "explanation_cn": "指从地下自然涌出的水源，常形成溪流或水池。",
      "example_en": "The hikers stopped to drink from a clear mountain spring.",
      "example_cn": "徒步者们停下来饮用清澈的山泉。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device made of metal or other elastic material that returns to its original shape after being compressed or stretched, used to store and release energy.",
      "explanation_cn": "由金属或其他弹性材料制成的装置，在受压或拉伸后能恢复原状，用于储存和释放能量。",
      "example_en": "The mattress contains hundreds of coil springs for added comfort.",
      "example_cn": "这张床垫含有数百个螺旋弹簧，以增加舒适度。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move suddenly and quickly upward or forward, often with energy or force.",
      "explanation_cn": "指突然而迅速地向上或向前跃动，常带有力量或活力。",
      "example_en": "The cat sprang onto the windowsill when it saw the bird.",
      "example_cn": "猫看到鸟时猛地跳上了窗台。"
    },
    {
      "pos": "verb",
      "explanation_en": "To appear or emerge suddenly, often unexpectedly.",
      "explanation_cn": "指突然出现或涌现，常出人意料。",
      "example_en": "A new café has sprung up on the corner since last month.",
      "example_cn": "自从上个月以来，街角突然开了一家新咖啡馆。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "season",
      "analysis": "“Season”（季节）是更广泛的类别，包括春、夏、秋、冬四个阶段。而 “spring” 是其中特定的一个季节，强调新生、复苏和温暖的开始，具有更具体的自然和文化意象。"
    },
    {
      "word_to_compare": "fountain",
      "analysis": "“Fountain”（喷泉）是人工建造的、通常具有装饰性且有控制水流的装置，而 “spring” 是自然形成的水源，未经人为干预。两者都涉及水的涌出，但来源和性质不同。"
    },
    {
      "word_to_compare": "jump",
      "analysis": "“Jump”（跳跃）是通用动词，指任何有意识的向上或向前的腾跃动作，可为缓慢或剧烈；而 “spring” 强调动作的突然性、爆发力和弹性，常带有本能或自然的意味，如动物扑跃或弹簧回弹。"
    }
  ]
}