{
  "word": "spring",
  "pronunciation": "spring",
  "concise_definition": "n. 春天, 泉水, 弹簧, 跳跃; v. 跳跃, 涌出, 迅速发生",
  "forms": {
    "third_person_singular": "springs",
    "past_tense": "sprang",
    "past_participle": "sprung",
    "present_participle": "springing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The season between winter and summer, characterized by warmer weather, blooming plants, and renewed growth in nature.",
      "explanation_cn": "冬季与夏季之间的季节，以天气转暖、植物开花和自然界复苏为特征。",
      "example_en": "We planted flowers in the spring to brighten up the garden.",
      "example_cn": "我们在春天种花，让花园更加绚丽。"
    },
    {
      "pos": "noun",
      "explanation_en": "A natural source of water that flows from the ground, often forming a stream or pool.",
      "explanation_cn": "从地下自然涌出的水源，常形成溪流或水池。",
      "example_en": "The hikers stopped to drink from the clear spring at the foot of the mountain.",
      "example_cn": "徒步者们在山脚下停下来，饮用那清澈的泉水。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device made of metal or other elastic material that returns to its original shape after being compressed or stretched, used to store and release energy.",
      "explanation_cn": "由金属或其他弹性材料制成的装置，在受压或拉伸后能恢复原状，用于储存和释放能量。",
      "example_en": "The mattress contains hundreds of springs for extra comfort.",
      "example_cn": "这张床垫里有数百个弹簧，以提供更舒适的支撑。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move suddenly and quickly upward or forward, often with force or energy.",
      "explanation_cn": "突然而迅速地向上或向前跃动，通常带有力量或活力。",
      "example_en": "The cat sprang onto the windowsill when it saw the bird.",
      "example_cn": "猫看到鸟时，猛地跳上了窗台。"
    },
    {
      "pos": "verb",
      "explanation_en": "To emerge or flow out suddenly, especially of water or other liquids.",
      "explanation_cn": "突然冒出或涌出，尤指水或其他液体。",
      "example_en": "A spring of water burst through the cracked pavement.",
      "example_cn": "一股泉水从裂开的人行道中喷涌而出。"
    },
    {
      "pos": "verb",
      "explanation_en": "To occur suddenly or unexpectedly, often referring to problems, changes, or events.",
      "explanation_cn": "突然或意外地发生，常用于指问题、变化或事件。",
      "example_en": "A dispute sprang up between the two neighbors over the fence.",
      "example_cn": "两位邻居因篱笆问题突然发生了争执。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "season",
      "analysis": "“Season”（季节）是泛指一年中的四个时期（春、夏、秋、冬），是一个中性、广义的术语。而 “spring” 特指春季，具有鲜明的自然特征（如花开、回暖），语义更具体、更具形象性。"
    },
    {
      "word_to_compare": "fountain",
      "analysis": "“Fountain”（喷泉）是人工建造的、有控制地喷水的装置，常用于装饰或公共空间。而 “spring” 是自然形成的水源，强调其原始性和未受人工干预的特性。"
    },
    {
      "word_to_compare": "jump",
      "analysis": "“Jump”（跳跃）是通用动词，指任何有意识的、通常双脚离地的运动，可缓慢或剧烈。“Spring” 作为动词时，强调突然、有力、富有弹性的跃动，常带有本能或爆发性，语义更生动、更具动态感。"
    },
    {
      "word_to_compare": "source",
      "analysis": "“Source”（源头）是抽象或广义的起源，可指信息、资源、原因等的起点。而 “spring” 作为名词特指水的自然源头，具有物理实体性，语义更具体、更偏向自然地理范畴。"
    }
  ]
}