{
  "word": "sprung",
  "pronunciation": "sprung",
  "concise_definition": "v. (spring 的过去分词) 弹跳, 突然出现, 爆发, 修复",
  "forms": {
    "base_form": "spring",
    "past_tense": "sprang",
    "past_participle": "sprung",
    "present_participle": "springing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To have moved suddenly upward or outward by a quick, forceful motion, often due to pressure or elasticity.",
      "explanation_cn": "指因压力或弹性而突然向上或向外弹起、跃动，强调动作的迅速和力量。",
      "example_en": "The ball sprung high into the air after hitting the ground.",
      "example_cn": "球撞到地面后猛地弹向空中。"
    },
    {
      "pos": "verb",
      "explanation_en": "To have appeared or emerged suddenly, often unexpectedly or without warning.",
      "explanation_cn": "指某事物突然出现或浮现，通常出人意料或毫无预兆。",
      "example_en": "A secret passage had sprung up behind the bookshelf.",
      "example_cn": "书架后面突然出现了一条秘密通道。"
    },
    {
      "pos": "verb",
      "explanation_en": "To have caused something to break or become damaged, especially due to sudden force or strain (e.g., a sprung hinge or a sprung floor).",
      "explanation_cn": "指因突然的外力或压力导致某物变形、损坏或松动，常用于机械结构或建筑部件。",
      "example_en": "The door wouldn't close because the hinge was sprung.",
      "example_cn": "门关不上了，因为铰链已经变形了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To have paid or incurred a cost, especially unexpectedly or reluctantly (used in phrases like 'sprung for' or 'sprung the bill').",
      "explanation_cn": "指（尤指不情愿或意外地）支付了费用，常用于口语表达如 'sprung for' 或 'sprung the bill'。",
      "example_en": "He sprung for a luxury hotel even though he was on a tight budget.",
      "example_cn": "尽管预算紧张，他还是花大价钱住进了豪华酒店。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "jumped",
      "analysis": "“Jumped” (跳跃) 是 “spring” 的普通近义词，但更通用、中性，不强调弹性或突然性。而 “sprung” 常带有因内在张力或弹性而爆发的意味，更具物理动力感。例如：a frog jumped vs. the trap sprung shut。"
    },
    {
      "word_to_compare": "emerged",
      "analysis": "“Emerging” (出现) 强调从隐藏或不明显状态中逐渐显现，过程较缓慢或渐进。而 “sprung” 暗示的是瞬间、剧烈、出人意料的出现，更具爆发性和戏剧性。例如：a solution emerged over time vs. a problem sprung up overnight。"
    },
    {
      "word_to_compare": "broke",
      "analysis": "“Broke” (断裂) 指物体因外力而断裂或损坏，强调结构完整性被破坏。而 “sprung” 在指损坏时，特指因应力导致的变形或错位，但未完全断裂，如弹簧变形、门框扭曲，仍保留部分功能。"
    },
    {
      "word_to_compare": "paid",
      "analysis": "“Paid” (支付) 是中性、标准的表达，而 “sprung” 在支付语境中带有强烈的情感色彩——常暗示不情愿、冲动或超出预期的花费，语气更口语化、生动。例如：I paid $100 vs. I sprung $100 for it — 后者暗示‘真肉疼’。"
    }
  ]
}