{
  "word": "squats",
  "pronunciation": "skwots",
  "concise_definition": "n. 深蹲（动作）; v. 占用（无权占用的房屋）; n. （复数）非法占用的住所",
  "forms": {
    "singular": "squat",
    "third_person_singular": "squats",
    "past_tense": "squatted",
    "past_participle": "squatted",
    "present_participle": "squatting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A physical exercise in which a person lowers their body by bending the knees while keeping the back straight and feet flat on the ground, commonly used to strengthen the legs and glutes.",
      "explanation_cn": "一种健身动作，练习者通过弯曲膝盖、保持背部挺直、双脚平贴地面来降低身体重心，常用于增强腿部和臀部肌肉。",
      "example_en": "She added squats to her daily workout routine to build lower-body strength.",
      "example_cn": "她将深蹲加入每日锻炼计划，以增强下肢力量。"
    },
    {
      "pos": "verb",
      "explanation_en": "To occupy an empty building or land without legal permission or payment, typically as a form of protest or due to housing shortage.",
      "explanation_cn": "在没有合法许可或支付费用的情况下，占用空置的建筑物或土地，通常作为抗议手段或因住房短缺所致。",
      "example_en": "Artists squatted in the abandoned factory and turned it into a community art space.",
      "example_cn": "艺术家们占用了这座废弃工厂，将其改造成一个社区艺术空间。"
    },
    {
      "pos": "noun",
      "explanation_en": "An illegally occupied building or dwelling, especially one used by people without permanent housing.",
      "explanation_cn": "指被非法占用的建筑物或住所，尤指无固定居所者所居住的地方。",
      "example_en": "The city council is debating how to deal with the growing number of squats in the downtown area.",
      "example_cn": "市政府正在讨论如何应对市中心日益增多的非法占用住所。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "lunges",
      "analysis": "“Lunges”（弓步）与 “squats”（深蹲）都是下肢训练动作，但深蹲是垂直方向的上下运动，主要锻炼大腿前侧和臀部；而弓步是前后移动的步法，更强调单腿稳定性和髋关节灵活性。两者虽同属力量训练，但动作轨迹和肌肉激活模式不同。"
    },
    {
      "word_to_compare": "occupy",
      "analysis": "“Occupy”（占据）是一个更广泛、中性的动词，指占据任何空间或位置，不带有非法或抗议的含义；而 “squat” 特指无权占用空置房产，常隐含社会抗议或生存需求的背景，语义更具政治与法律色彩。"
    },
    {
      "word_to_compare": "shantytown",
      "analysis": "“Shantytown”（棚户区）指由大量非法或临时搭建的简陋房屋组成的聚居区，是长期形成的居住形态；而 “squat” 既可以指单个非法占用行为，也可以指被占用的单个建筑，规模更小、更个体化。"
    }
  ]
}