{
  "word": "squat",
  "pronunciation": "skwot",
  "concise_definition": "v. 蹲下, 蹲坐; n. 蹲姿, 蹲起运动; adj. 一无所有的, 微不足道的",
  "forms": {
    "third_person_singular": "squats",
    "past_tense": "squat",
    "past_participle": "squat",
    "present_participle": "squatting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To lower the body by bending the knees and sitting back on the heels or thighs, often with the feet flat on the ground.",
      "explanation_cn": "通过弯曲膝盖并将身体下蹲，臀部靠近脚跟或大腿，通常双脚平放在地面上。",
      "example_en": "The children squatted down to watch the ants crawl across the path.",
      "example_cn": "孩子们蹲下来观察蚂蚁沿着小路爬行。"
    },
    {
      "pos": "verb",
      "explanation_en": "To occupy a property or building without legal permission or payment, often temporarily.",
      "explanation_cn": "未经合法许可或付费而占用房产或建筑物，通常为临时性行为。",
      "example_en": "Artists began to squat in the abandoned warehouse to create studios.",
      "example_cn": "艺术家们开始非法占用废弃的仓库，将其改造成工作室。"
    },
    {
      "pos": "noun",
      "explanation_en": "A physical exercise in which a person lowers their body by bending the knees while keeping the back straight, commonly used to build leg strength.",
      "explanation_cn": "一种通过弯曲膝盖、保持背部挺直来降低身体的锻炼动作，常用于增强腿部力量。",
      "example_en": "He added squats to his daily workout routine to improve his lower body fitness.",
      "example_cn": "他将深蹲加入每日锻炼计划，以增强下肢力量。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used to emphasize the absence or insignificance of something, often in the phrase 'not a squat' or 'zero squat'.",
      "explanation_cn": "用于强调某物的缺失或微不足道，常用于短语 'not a squat' 或 'zero squat' 中。",
      "example_en": "After the robbery, he had not a squat left in his wallet.",
      "example_cn": "被抢之后，他钱包里连一分钱都没剩下。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "crouch",
      "analysis": "“Crouch”（蜷伏）指身体低伏，通常是为了隐蔽或准备跳跃，重心更靠前，膝盖弯曲但臀部不一定下压，动作更紧张、短暂。而 “squat” 更强调稳定地坐在脚跟或大腿上，动作更持久、更正式，常用于锻炼或休息。"
    },
    {
      "word_to_compare": "sit",
      "analysis": "“Sit”（坐）通常指臀部完全落在支撑物（如椅子、地面）上，腿部呈直角或自然弯曲；而 “squat” 是臀部悬空或接近地面，依靠腿部肌肉支撑，不依赖外部支撑物，是一种更主动的姿势。"
    },
    {
      "word_to_compare": "occupy",
      "analysis": "“Occupy”（占据）是中性或正式用语，泛指占据空间、职位或资源，不带有非法含义；而 “squat” 作为动词时特指非法占用空置房产，带有法律和道德上的负面色彩，语义更具体、更具社会语境。"
    }
  ]
}