{
  "word": "squeezing",
  "pronunciation": "skwē·zɪŋ",
  "concise_definition": "n. 挤压, 挤压行为; v. 挤压, 压紧, 勒索 (现在分词形式)",
  "forms": {
    "base_form": "squeeze",
    "third_person_singular": "squeezes",
    "past_tense": "squeezed",
    "past_participle": "squeezed",
    "present_participle": "squeezing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To press or compress something firmly, often to extract a liquid or to reduce its volume by applying external force.",
      "explanation_cn": "指用力按压或压缩某物，通常是为了挤出液体或通过外力减小其体积。",
      "example_en": "She was squeezing lemon juice into the tea to add a tangy flavor.",
      "example_cn": "她正在把柠檬汁挤进茶里，以增添一丝酸味。"
    },
    {
      "pos": "verb",
      "explanation_en": "To force or cram something into a limited space, often causing discomfort or tightness.",
      "explanation_cn": "指将某物强行塞进狭小的空间，通常导致不适或拥挤感。",
      "example_en": "The passengers were squeezing into the overcrowded subway car.",
      "example_cn": "乘客们正挤进一辆超载的地铁车厢里。"
    },
    {
      "pos": "verb",
      "explanation_en": "To obtain something, especially money or information, by applying pressure or coercion, often unfairly or unethically.",
      "explanation_cn": "指通过施加压力或胁迫手段（常为不公平或不道德的方式）获取某物，尤其是金钱或信息。",
      "example_en": "The lender was accused of squeezing extra fees out of struggling borrowers.",
      "example_cn": "该贷款机构被指控向经济困难的借款人勒索额外费用。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or process of squeezing; often used to describe a tight or difficult situation caused by pressure.",
      "explanation_cn": "指挤压的动作或过程；常用来描述由压力造成的紧张或困难局面。",
      "example_en": "The squeezing of the budget left the department with barely enough funds to operate.",
      "example_cn": "预算的紧缩使该部门几乎无法维持正常运作。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pressing",
      "analysis": "“Pressing”（按压）强调持续施加压力，但不一定导致形变或内容物被挤出，常用于抽象语境（如 pressing need）。而 “squeezing” 更强调通过外力造成物理压缩或内容物被逼出，动作更具破坏性或强制性。"
    },
    {
      "word_to_compare": "crushing",
      "analysis": "“Crushing”（压碎）指施加极大压力导致物体破裂或彻底变形，程度比 “squeezing” 更剧烈、更具破坏性。例如压碎核桃 vs. 挤柠檬汁。前者是毁灭性的，后者是提取性的。"
    },
    {
      "word_to_compare": "compressing",
      "analysis": "“Compressing”（压缩）是中性技术术语，常用于物理或工程语境，指在控制条件下减少体积，不带情感色彩。而 “squeezing” 常带有主观意图，甚至负面含义（如勒索、逼迫），语义更丰富且情感更强。"
    }
  ]
}