{
  "word": "stabilization",
  "pronunciation": "stuh·buh·luh·zey·shuhn",
  "concise_definition": "n. 稳定, 稳固, 稳定化",
  "forms": {
    "plural": "stabilizations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of making something stable or more stable, especially by reducing fluctuations, changes, or disturbances in a system, economy, or condition.",
      "explanation_cn": "指通过减少系统、经济或状况中的波动、变化或干扰，使其变得更加稳定的过程。",
      "example_en": "The government's fiscal policies aimed at the stabilization of inflation rates.",
      "example_cn": "政府的财政政策旨在稳定通货膨胀率。"
    },
    {
      "pos": "noun",
      "explanation_en": "The state of being stabilized, particularly in medical, engineering, or environmental contexts, where a previously unstable condition is brought under control.",
      "explanation_cn": "指处于稳定状态，尤其在医疗、工程或环境背景下，指原本不稳定的状况已被控制。",
      "example_en": "After emergency surgery, the patient's vital signs showed signs of stabilization.",
      "example_cn": "紧急手术后，病人的生命体征显示出稳定化的迹象。"
    },
    {
      "pos": "noun",
      "explanation_en": "In geology or construction, the act of reinforcing soil, rock, or structures to prevent movement, collapse, or erosion.",
      "explanation_cn": "在地质学或建筑工程中，指通过加固土壤、岩石或结构以防止移动、坍塌或侵蚀的行为。",
      "example_en": "The stabilization of the cliff face prevented further landslides during the rainy season.",
      "example_cn": "对悬崖面的加固防止了雨季进一步发生滑坡。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "stability",
      "analysis": "“Stability” (稳定性) 是一个名词，指一种状态或属性，即某物处于稳定的状态；而 “stabilization” 强调的是实现这种状态的过程或动作。前者是结果，后者是手段。例如：We seek stability（我们追求稳定） vs. The stabilization took months（稳定化过程持续了数月）。"
    },
    {
      "word_to_compare": "equilibrium",
      "analysis": "“Equilibrium” (平衡) 通常指系统内部各力量相互抵消而达到的动态平衡状态，多用于物理、化学或经济领域，强调力量的对等；而 “stabilization” 更广泛，可指任何使不稳定的系统趋于平静或可控的过程，不一定要求力量对等。"
    },
    {
      "word_to_compare": "consolidation",
      "analysis": "“Consolidation” (巩固/整合) 指将分散的部分合并为一个更强大、更统一的整体，常用于组织、资金或权力的整合；而 “stabilization” 侧重于消除波动和混乱，使系统不再动荡，不必然涉及合并或整合。例如：公司合并是 consolidation，而控制通货膨胀是 stabilization。"
    }
  ]
}