{
  "word": "stable",
  "pronunciation": "stey·buhl",
  "concise_definition": "adj. 稳定的, 坚固的, 不易变化的; n. 马厩",
  "forms": {
    "comparative": "more stable",
    "superlative": "most stable"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Not likely to change, fall, or collapse; firm, steady, or secure in structure, condition, or behavior.",
      "explanation_cn": "指结构、状态或行为上不易改变、倾倒或崩溃的；坚固、平稳或可靠的。",
      "example_en": "The table has a stable base that prevents it from wobbling.",
      "example_cn": "这张桌子有一个稳固的底座，防止它摇晃。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Consistent and reliable over time, especially in terms of emotions, performance, or financial status.",
      "explanation_cn": "指在情绪、表现或财务状况等方面长时间保持一致和可靠。",
      "example_en": "She has a stable job and a predictable income, which gives her peace of mind.",
      "example_cn": "她有一份稳定的工作和可预测的收入，这让她感到安心。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Of a person, emotionally balanced and not prone to sudden mood swings or irrational behavior.",
      "explanation_cn": "指一个人情绪平衡，不易出现突然的情绪波动或非理性行为。",
      "example_en": "Despite the stress, he remained calm and stable throughout the crisis.",
      "example_cn": "尽管压力很大，他在危机中仍保持冷静和情绪稳定。"
    },
    {
      "pos": "noun",
      "explanation_en": "A building or structure where horses are kept and cared for.",
      "explanation_cn": "用于饲养和照料马匹的建筑物或结构。",
      "example_en": "The farmer walks to the stable every morning to feed the horses.",
      "example_cn": "农夫每天早上都去马厩喂马。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "steady",
      "analysis": "“Steady” (稳定的) 强调持续、不间断的平稳状态，常用于描述速度、节奏或手部动作的稳定，如“steady hand”（稳定的手）。而 “stable” 更侧重于整体结构或系统的抗干扰能力，适用于更宏观或长期的状态，如经济、情绪或建筑的稳定性。"
    },
    {
      "word_to_compare": "firm",
      "analysis": "“Firm” (坚固的) 通常指物理上的坚硬或不可动摇，如“firm ground”（坚实的地面）或“firm decision”（坚定的决定）。它强调抵抗外力的能力，但不一定包含时间维度上的持续性。而 “stable” 不仅指物理坚固，更强调在变化环境中保持不变的特性，适用范围更广。"
    },
    {
      "word_to_compare": "constant",
      "analysis": "“Constant” (恒定的) 强调在时间上毫无变化，通常用于数值、频率或行为的重复性，如“constant noise”（持续的噪音）。而 “stable” 允许一定程度的波动，只要整体趋势保持平衡，如“stable temperature”（温度稳定）并不意味着完全不变，而是波动在可接受范围内。"
    }
  ]
}