{
  "word": "stacking",
  "pronunciation": "stak·ing",
  "concise_definition": "n. 叠放, 堆积, 堆叠行为",
  "forms": {
    "base_form": "stack",
    "present_participle": "stacking",
    "past_tense": "stacked",
    "past_participle": "stacked"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The action or process of arranging objects in a vertical pile or layer, often for efficiency, storage, or structural stability.",
      "explanation_cn": "指将物体以垂直堆叠或分层的方式排列，通常为了提高效率、节省空间或增强结构稳定性。",
      "example_en": "The stacking of books on the shelf made it easier to find the ones we needed.",
      "example_cn": "将书本整齐堆叠在书架上，使我们更容易找到需要的书。"
    },
    {
      "pos": "noun",
      "explanation_en": "The practice of accumulating or layering multiple elements, often in a strategic or excessive manner, such as in gaming, finance, or data processing.",
      "explanation_cn": "指在游戏、金融或数据处理等领域中，策略性或过度地累积或叠加多个要素，以增强效果或实现特定目标。",
      "example_en": "In this game, stacking buffs can dramatically increase your character's power.",
      "example_cn": "在这个游戏中，叠加增益效果可以显著提升角色的战斗力。"
    },
    {
      "pos": "noun",
      "explanation_en": "In photography or video editing, the technique of combining multiple exposures or layers to enhance detail, brightness, or artistic effect.",
      "explanation_cn": "在摄影或视频编辑中，指通过叠加多张曝光或图层来增强细节、亮度或艺术效果的技术。",
      "example_en": "Astrophotographers use stacking to reduce noise and reveal faint stars in long-exposure images.",
      "example_cn": "天文摄影师使用堆叠技术来降低噪点，并在长曝光图像中显现微弱的恒星。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "piling",
      "analysis": "“Piling” (堆积) 更强调随意、无序或过量地堆放物体，常带有负面含义，如“piling up trash”（垃圾堆积）。而 “stacking” 更强调有组织、整齐、有目的性的垂直排列，通常用于正面或中性语境。"
    },
    {
      "word_to_compare": "layering",
      "analysis": "“Layering” (分层) 强调在水平或平面方向上逐层叠加，常用于服装、绘画、地质或数字设计中，每一层具有独立功能或视觉效果。而 “stacking” 更强调垂直方向上的累积，结构更紧凑，常用于物理物体或数据处理。"
    },
    {
      "word_to_compare": "accumulation",
      "analysis": "“Accumulation” (积累) 是一个更抽象的术语，泛指数量或数量的逐渐增加，不强调物理排列方式。它可以是时间、资源、情感等的积累。而 “stacking” 是一种具体的物理或操作行为，强调物体的排列形式。"
    }
  ]
}