{
  "word": "staggered",
  "pronunciation": "stæg·ər·d",
  "concise_definition": "adj. 错开的, 交错的; v. (stagger 的过去式和过去分词) 摇晃, 蹒跚",
  "forms": {
    "base_form": "stagger",
    "present_participle": "staggering",
    "past_tense": "staggered",
    "past_participle": "staggered",
    "third_person_singular": "staggeres"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Arranged in a non-simultaneous or offset manner, especially over time, to avoid congestion or distribute load evenly.",
      "explanation_cn": "指在时间或安排上错开、不同时进行，以避免拥堵或均匀分配负荷。",
      "example_en": "The company implemented staggered work hours to reduce crowding in the office.",
      "example_cn": "公司实行错峰上班时间，以减少办公室的拥挤。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Having a zigzag or uneven pattern, often describing physical movement or alignment.",
      "explanation_cn": "指具有之字形或不规则的模式，常用于描述身体动作或排列方式。",
      "example_en": "The staggered rows of chairs created a better view for everyone in the auditorium.",
      "example_cn": "交错排列的座椅让礼堂里的每个人都有更好的视野。"
    },
    {
      "pos": "verb",
      "explanation_en": "To walk or move unsteadily, as if about to fall, often due to injury, fatigue, or intoxication.",
      "explanation_cn": "指因受伤、疲劳或醉酒等原因而步履蹒跚、摇晃不定地行走或移动。",
      "example_en": "After the long hike, he staggered back to camp, exhausted.",
      "example_cn": "长途徒步后，他精疲力竭地蹒跚回到营地。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause someone or something to move unsteadily or to be shocked or stunned.",
      "explanation_cn": "指使某人或某物失去平衡，或使某人感到震惊、目瞪口呆。",
      "example_en": "The news of the merger staggered the entire industry.",
      "example_cn": "合并的消息令整个行业震惊不已。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "alternating",
      "analysis": "“Alternating” (交替的) 强调两种或多种事物按固定顺序轮流出现，如白天与黑夜交替。而 “staggered” 更强调时间或空间上的错位分布，不一定有规律的循环，重点在于避免重叠或平衡压力。"
    },
    {
      "word_to_compare": "uneven",
      "analysis": "“Uneven” (不平的、不均匀的) 是一个更宽泛的词，泛指表面、分布或程度上的不规则，可用于地形、收入、质量等。而 “staggered” 通常特指有意识安排的错开结构，具有功能性目的，如错峰、分批。"
    },
    {
      "word_to_compare": "reel",
      "analysis": "“Reel” (眩晕、摇晃) 通常描述因冲击或震惊而产生的短暂头晕或失去方向感，多用于心理或情绪层面，如 “reel from the news”。而 “stagger” 更强调身体上的物理摇晃，动作更明显、持续，常伴随行走困难。"
    }
  ]
}