{
  "word": "stains",
  "pronunciation": "staynz",
  "concise_definition": "n. 污渍, 染色, 污点; v. 污染, 染色, 使玷污",
  "forms": {
    "singular": "stain",
    "third_person_singular": "stains",
    "past_tense": "stained",
    "past_participle": "stained",
    "present_participle": "staining"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A discoloration or mark left on a surface, typically caused by contact with a substance that changes its color or appearance, often unintentionally and difficult to remove.",
      "explanation_cn": "指因接触某种物质而在表面留下的变色痕迹或污渍，通常是无意中造成的，且难以清除。",
      "example_en": "The red wine left a stubborn stain on the white carpet.",
      "example_cn": "红酒在白色地毯上留下了一个顽固的污渍。"
    },
    {
      "pos": "noun",
      "explanation_en": "A moral or reputational blemish; a mark of disgrace or shame that tarnishes someone's character or public image.",
      "explanation_cn": "指道德或声誉上的污点，即损害某人品格或公众形象的耻辱性污迹。",
      "example_en": "His involvement in the scandal left a stain on his political career.",
      "example_cn": "他卷入丑闻，给自己的政治生涯留下了污点。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a discoloration or mark on a surface by coming into contact with a coloring substance, often unintentionally.",
      "explanation_cn": "指因与着色物质接触而在表面造成变色或污迹，通常是无意的。",
      "example_en": "Be careful not to stain your shirt with ink.",
      "example_cn": "小心别让墨水弄脏了你的衬衫。"
    },
    {
      "pos": "verb",
      "explanation_en": "To taint or corrupt morally or reputationally; to damage the purity or integrity of something.",
      "explanation_cn": "指在道德或声誉上玷污、腐蚀；损害某物的纯洁性或完整性。",
      "example_en": "The corruption scandal stained the entire administration.",
      "example_cn": "腐败丑闻玷污了整个政府的声誉。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "spot",
      "analysis": "“Spot” (斑点) 通常指小而明显的污渍或色块，可能更局部、更易清除，且不一定带有负面含义（如‘spot of tea’）。而 “stain” 更强调持久性、渗透性和难以去除的特性，常带有负面或污损的语义。"
    },
    {
      "word_to_compare": "mark",
      "analysis": "“Mark” (痕迹) 是一个更中性的词，泛指任何可见的印迹，可以是人为的、自然的、有益的或无害的（如‘a mark of approval’）。而 “stain” 特指因污染或腐蚀造成的不良痕迹，隐含污秽或损害的意味。"
    },
    {
      "word_to_compare": "blemish",
      "analysis": "“Blemish” (瑕疵) 多用于描述外观上的缺陷，尤其在皮肤、表面或声誉上，常带有美学或道德评判色彩。它与 “stain” 在道德语境中可互换，但 “blemish” 更抽象、更常用于比喻，而 “stain” 更具象，常指物理性污渍。"
    }
  ]
}