{
  "word": "stain",
  "pronunciation": "stayn",
  "concise_definition": "n. 污渍, 污点; v. 污染, 沾染, 着色",
  "forms": {
    "third_person_singular": "stains",
    "past_tense": "stained",
    "past_participle": "stained",
    "present_participle": "staining"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A discoloration or mark left on a surface, typically caused by a substance that has been absorbed or spilled, often difficult to remove.",
      "explanation_cn": "指因液体、物质渗入或溅洒而在表面留下的变色痕迹，通常难以清除。",
      "example_en": "There was a red wine stain on the white carpet.",
      "example_cn": "白色地毯上有一处红酒污渍。"
    },
    {
      "pos": "noun",
      "explanation_en": "A mark or reputation that damages someone's character or standing, often due to a scandal or wrongdoing.",
      "explanation_cn": "指因丑闻或不当行为而对某人品格或声誉造成的损害性污点。",
      "example_en": "The politician's corruption scandal left a permanent stain on his legacy.",
      "example_cn": "这位政客的腐败丑闻给他的声誉留下了永久的污点。"
    },
    {
      "pos": "verb",
      "explanation_en": "To mark or discolor a surface by spilling, soaking, or applying a substance that leaves a lasting color or blemish.",
      "explanation_cn": "指通过泼洒、渗透或涂抹某种物质，使表面留下持久的颜色或污迹。",
      "example_en": "Be careful not to stain your shirt with ink.",
      "example_cn": "小心别把墨水弄到衬衫上弄脏了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To taint or corrupt someone's reputation, character, or purity, often morally or ethically.",
      "explanation_cn": "指在道德或伦理上玷污、败坏某人的声誉、品格或纯洁性。",
      "example_en": "The false accusations stained her reputation in the community.",
      "example_cn": "这些虚假指控玷污了她在社区中的声誉。"
    },
    {
      "pos": "verb",
      "explanation_en": "To color or dye a material, especially wood, with a transparent or semi-transparent pigment to enhance its appearance.",
      "explanation_cn": "指用透明或半透明的颜料为材料（尤其是木材）上色，以增强其外观。",
      "example_en": "He stained the wooden table a rich walnut color.",
      "example_cn": "他把木桌染成了深核桃色。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "spot",
      "analysis": "“Spot”（斑点）通常指小而明显的污渍或标记，常为暂时性或表面性的，不一定深入材料内部；而 “stain” 更强调污渍已渗入并可能难以清除，具有持久性。此外，“spot” 可用于中性或正面语境（如星点），而 “stain” 多带负面含义。"
    },
    {
      "word_to_compare": "mark",
      "analysis": "“Mark”（痕迹）是一个更宽泛的词，泛指任何可见的印迹，可以是划痕、压痕、笔迹等，不一定是污渍；而 “stain” 特指由液体或染料引起的颜色变化，具有化学或物理渗透性。所有 stain 都是 mark，但并非所有 mark 都是 stain。"
    },
    {
      "word_to_compare": "taint",
      "analysis": "“Taint”（玷污）与 “stain” 在比喻义上相近，都可指声誉受损，但 “taint” 更强调污染的扩散性和腐蚀性，常用于抽象概念（如思想、制度），语气更正式、更严重；而 “stain” 更具象，常用于具体污渍或个人声誉的污点，语义范围更广。"
    }
  ]
}