{
  "word": "staining",
  "pronunciation": "steyn·ing",
  "concise_definition": "n. 染色, 着色, 污渍; v. 染色, 污染, 使玷污",
  "forms": {
    "base_form": "stain",
    "third_person_singular": "stains",
    "past_tense": "stained",
    "past_participle": "stained",
    "present_participle": "staining"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A mark or discoloration left on a surface due to the absorption or attachment of a colored substance, often unwanted or difficult to remove.",
      "explanation_cn": "由于有色物质被吸收或附着在表面而留下的痕迹或变色，通常为不希望出现且难以清除的污渍。",
      "example_en": "The red wine left a stubborn staining on the white carpet.",
      "example_cn": "红酒在白色地毯上留下了一道顽固的污渍。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process or result of applying a dye or pigment to a material, especially in biology or histology to enhance visibility under a microscope.",
      "explanation_cn": "在材料上施加染料或色素的过程或结果，尤其在生物学或组织学中用于增强显微镜下的可见性。",
      "example_en": "The histologist used a special staining technique to highlight the cell nuclei.",
      "example_cn": "组织学家使用了一种特殊的染色技术来突出细胞核。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a mark or discoloration on a surface by applying a colored substance, often unintentionally or detrimentally.",
      "explanation_cn": "通过施加有色物质在表面上造成痕迹或变色，通常是非故意的或有害的。",
      "example_en": "Be careful not to stain your shirt with the ink pen.",
      "example_cn": "小心别让钢笔墨水弄脏了你的衬衫。"
    },
    {
      "pos": "verb",
      "explanation_en": "To imbue or affect something with a particular quality, often negative, that taints its reputation or character.",
      "explanation_cn": "使某事物带有某种特质，尤其是负面的，从而玷污其声誉或品格。",
      "example_en": "The scandal stained his reputation for integrity.",
      "example_cn": "这起丑闻玷污了他正直的声誉。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "dyeing",
      "analysis": "“Dyeing”（染色）是主动、有目的的着色过程，通常用于纺织品或材料，强调均匀、持久的色彩改变，是技术性操作。而 “staining” 可以是无意的、局部的，且常带有负面含义，如污渍或不均匀着色。"
    },
    {
      "word_to_compare": "discoloring",
      "analysis": "“Discoloring”（变色）泛指任何颜色的改变，可能是褪色、氧化或污染所致，不一定是由于外来染料。而 “staining” 特指由外部物质附着或渗透引起的颜色变化，通常指污渍或染色痕迹。"
    },
    {
      "word_to_compare": "tainting",
      "analysis": "“Tainting”（玷污）多用于抽象语境，如声誉、信任或道德，强调污染或腐蚀本质。而 “staining” 在比喻用法中虽可类似，但更常保留其物理污渍的意象，更具形象性和感官性。"
    }
  ]
}