{
  "word": "stained",
  "pronunciation": "steynd",
  "concise_definition": "adj. 染色的, 有污渍的, 有污点的; v. 染色, 污染, 败坏（过去式和过去分词）",
  "forms": {
    "base_form": "stain",
    "third_person_singular": "stains",
    "present_participle": "staining",
    "past_tense": "stained",
    "past_participle": "stained"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Marked by a discoloration or spot caused by the absorption of a substance, often unwanted or undesirable, such as dirt, liquid, or pigment.",
      "explanation_cn": "因吸收某种物质（通常是不希望的，如污垢、液体或颜料）而出现变色或污渍的。",
      "example_en": "She removed the stained shirt from the laundry pile.",
      "example_cn": "她把那件有污渍的衬衫从洗衣堆里拿了出来。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Tainted or morally corrupted, often used metaphorically to describe a reputation, record, or character that has been damaged by unethical behavior.",
      "explanation_cn": "比喻性地指声誉、记录或品格因不道德行为而受到玷污或败坏的。",
      "example_en": "The politician's career was stained by allegations of corruption.",
      "example_cn": "这位政客的生涯因涉嫌腐败而蒙上污点。"
    },
    {
      "pos": "verb",
      "explanation_en": "To mark or discolor a surface by letting a substance, especially a liquid or pigment, come into contact with it and leave a permanent or lasting impression.",
      "explanation_cn": "通过让某种物质（尤其是液体或颜料）接触表面，使其留下永久或持久的痕迹或变色。",
      "example_en": "The red wine stained the white carpet.",
      "example_cn": "红酒把白色的地毯染上了污渍。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "spotted",
      "analysis": "“Spotted”（有斑点的）强调表面出现多个分散的小点或斑块，通常指视觉上明显但面积较小的瑕疵，如衣服上的小污点或动物皮毛的斑点。而 “stained” 更强调因渗透或吸收导致的大面积、较深的变色，常带有污损或不可逆的含义。"
    },
    {
      "word_to_compare": "discolored",
      "analysis": "“Discolored”（变色的）是一个更中性的术语，泛指任何颜色的改变，可能是由于老化、光照或化学反应，不一定由污渍引起。而 “stained” 特指由外来物质（如液体、油渍）造成的颜色污染，通常带有负面含义。"
    },
    {
      "word_to_compare": "tainted",
      "analysis": "“Tainted”（被污染的/被败坏的）与 “stained” 在比喻义上高度相似，都可指声誉或道德的玷污。但 “tainted” 更常用于法律、科学或食品安全语境，指物质被有害物污染（如 tainted meat），而 “stained” 更常用于描述声誉、名誉等抽象概念的道德污点，语气更具文学性。"
    }
  ]
}