{
  "word": "stalking",
  "pronunciation": "staw·ling",
  "concise_definition": "n. 跟踪, 纠缠, 猎捕; v. 跟踪, 纠缠",
  "forms": {
    "third_person_singular": "stalks",
    "past_tense": "stalked",
    "past_participle": "stalked",
    "present_participle": "stalking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of following or harassing someone persistently and often secretly, typically causing fear or distress; commonly associated with obsessive behavior and illegal intrusion into a person's life.",
      "explanation_cn": "指持续、通常秘密地跟踪或骚扰某人，常导致恐惧或痛苦；多与强迫性行为和对他人生活的非法侵扰相关。",
      "example_en": "The victim reported years of stalking by an ex-partner who sent threatening messages daily.",
      "example_cn": "受害者报告称，前伴侣多年来每天发送威胁信息，对她进行跟踪骚扰。"
    },
    {
      "pos": "verb",
      "explanation_en": "To follow or pursue someone stealthily and persistently, often with obsessive intent, especially in a way that violates personal boundaries or safety.",
      "explanation_cn": "指以隐秘且持续的方式跟踪或追逐某人，通常带有强迫性意图，尤其会侵犯个人界限或安全。",
      "example_en": "He was arrested for stalking his neighbor, frequently appearing outside her home at night.",
      "example_cn": "他因跟踪邻居而被捕，经常在夜间出现在她家门外。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move quietly and cautiously, especially while hunting or observing prey; often used in the context of wildlife behavior.",
      "explanation_cn": "指悄无声息、谨慎地移动，尤其在狩猎或观察猎物时；常用于描述野生动物的行为。",
      "example_en": "The lion stalked its prey through the tall grass, barely making a sound.",
      "example_cn": "狮子在高草中悄无声息地接近猎物，几乎不发出任何声响。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "harassing",
      "analysis": "“Harassing”（骚扰）泛指任何形式的持续性令人不适的行为，如言语侮辱、电话骚扰等，不一定包含物理跟踪。而 “stalking” 特指带有监视、尾随、侵入私人空间的强迫性行为，法律上通常被视为更严重的犯罪行为。"
    },
    {
      "word_to_compare": "surveilling",
      "analysis": "“Surveilling”（监视）通常指系统性、有组织的观察，常用于执法、情报或商业场景，不一定带有情感或个人动机。而 “stalking” 是个人化、情绪驱动的，常伴随痴迷、控制欲和对受害者的心理压迫。"
    },
    {
      "word_to_compare": "tracking",
      "analysis": "“Tracking”（追踪）是一个中性词，可指追踪动物足迹、物流包裹或GPS定位，完全不涉及侵犯或威胁。而 “stalking” 在现代语境中几乎专指非法、侵扰性的跟踪行为，带有强烈的负面道德和法律含义。"
    }
  ]
}