{
  "word": "stalks",
  "pronunciation": "stawks",
  "concise_definition": "n. 茎, 茎秆; v. 暗中跟踪, 潜行接近",
  "forms": {
    "singular": "stalk",
    "third_person_singular": "stalks",
    "past_tense": "stalked",
    "past_participle": "stalked",
    "present_participle": "stalking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The main stem or axis of a plant that supports leaves, flowers, or fruits, often long and slender, and responsible for transporting water and nutrients.",
      "explanation_cn": "植物的主茎或轴，用于支撑叶子、花朵或果实，通常细长，负责输送水分和养分。",
      "example_en": "The sunflower's tall stalks swayed gently in the breeze.",
      "example_cn": "向日葵高高的茎秆在微风中轻轻摇曳。"
    },
    {
      "pos": "noun",
      "explanation_en": "The slender, edible stem of certain vegetables, such as rhubarb or celery, often used in cooking.",
      "explanation_cn": "某些蔬菜（如大黄或芹菜）可食用的细长茎部，常用于烹饪。",
      "example_en": "She chopped the celery stalks finely for the soup.",
      "example_cn": "她把芹菜茎切成细末，加入汤中。"
    },
    {
      "pos": "verb",
      "explanation_en": "To follow or pursue someone secretly and persistently, often causing fear or distress, typically in a harassing or obsessive manner.",
      "explanation_cn": "秘密而持续地跟踪或追击某人，通常带有骚扰或痴迷的性质，令对方感到恐惧或不安。",
      "example_en": "The celebrity was stalked by an obsessed fan for months.",
      "example_cn": "这位名人被一名狂热粉丝跟踪了数月之久。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move stealthily or cautiously, especially while hunting or spying, often with the intent to approach unnoticed.",
      "explanation_cn": "以隐蔽或谨慎的方式移动，尤其在狩猎或监视时，旨在不被察觉地接近目标。",
      "example_en": "The hunter stalked the deer through the thick underbrush.",
      "example_cn": "猎人悄悄地穿过茂密的灌木丛，向鹿靠近。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "stem",
      "analysis": "“Stem”（茎）是植物学中更通用的术语，泛指植物的主干部分，而 “stalk” 更常用于描述具体、细长、支撑花或叶的茎，尤其在日常语境中。例如，花梗称为 “flower stalk”，而植物整体主干则称 “main stem”。"
    },
    {
      "word_to_compare": "twig",
      "analysis": "“Twig”（小枝）指植物上最细小的分枝，通常柔软且脆弱，而 “stalk” 更粗壮、更长，是支撑结构的主要部分。两者在尺寸和功能上有明显层级差异。"
    },
    {
      "word_to_compare": "harass",
      "analysis": "“Harass”（骚扰）泛指反复的、令人困扰的行为，可以是言语、邮件或肢体干扰，但不必然包含跟踪行为。而 “stalk” 特指持续、秘密的跟踪，常伴随威胁感和心理压迫，是更严重、更具侵入性的行为。"
    },
    {
      "word_to_compare": "pursue",
      "analysis": "“Pursue”（追逐）可以是公开、合法或积极的行为，如追求目标、梦想或某人；而 “stalk” 带有负面、非法或侵扰的含义，强调未经同意的隐秘跟随，具有明显的负面情感色彩。"
    }
  ]
}