{
  "word": "stamp",
  "pronunciation": "stamp",
  "concise_definition": "n. 邮票, 印章, 压印; v. 跺脚, 盖章, 压印",
  "forms": {
    "plural": "stamps",
    "third_person_singular": "stamps",
    "past_tense": "stamped",
    "past_participle": "stamped",
    "present_participle": "stamping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small adhesive label issued by a postal authority, bearing a design and denomination, used to indicate payment of postage for mail.",
      "explanation_cn": "由邮政部门发行的小型粘贴标签，带有图案和面值，用于表明邮件已支付邮资。",
      "example_en": "She collected rare stamps from around the world.",
      "example_cn": "她收集了来自世界各地的稀有邮票。"
    },
    {
      "pos": "noun",
      "explanation_en": "A mark made by pressing a device (often engraved) onto a surface to leave an impression, typically for authentication, identification, or official purposes.",
      "explanation_cn": "通过将一个装置（通常为雕刻过的）压在表面上而留下的印记，常用于认证、识别或官方用途，如印章或图章。",
      "example_en": "The document required the company's official stamp to be valid.",
      "example_cn": "这份文件必须加盖公司公章才有效。"
    },
    {
      "pos": "verb",
      "explanation_en": "To press or strike something firmly onto a surface to leave a mark or impression, especially with a stamp or seal.",
      "explanation_cn": "用力将某物压在表面上以留下印记，尤指使用印章或图章。",
      "example_en": "He stamped his signature on the contract.",
      "example_cn": "他在合同上盖了签名章。"
    },
    {
      "pos": "verb",
      "explanation_en": "To bring one's foot down heavily on the ground, often to express anger, impatience, or emphasis.",
      "explanation_cn": "用力跺脚，常用于表达愤怒、不耐烦或强调。",
      "example_en": "The child stamped his foot in frustration.",
      "example_cn": "孩子因沮丧而跺了跺脚。"
    },
    {
      "pos": "verb",
      "explanation_en": "To mark or designate something with a distinctive characteristic, often implying official endorsement or categorization.",
      "explanation_cn": "以某种显著特征标记或界定某物，常暗示官方认可或分类。",
      "example_en": "The region was stamped as a protected wildlife area.",
      "example_cn": "该地区被划定为受保护的野生动物区。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "seal",
      "analysis": "“Seal”（封印）通常指用于封闭或认证文件的正式印记，常为蜡封或金属印章，强调权威性和封闭性；而 “stamp” 更广泛，可用于邮票、普通印章或临时标记，不一定具有法律封存功能。"
    },
    {
      "word_to_compare": "mark",
      "analysis": "“Mark”（标记）是一个更通用的词，泛指任何可见的痕迹或符号，可以是无意的（如污渍）或随意的（如记号）；而 “stamp” 特指通过压印方式留下的、通常具有规范性或官方性的印记，更具目的性和标准化。"
    },
    {
      "word_to_compare": "imprint",
      "analysis": "“Imprint”（压印/烙印）强调留下持久的、有时是无形的印记，可用于物理痕迹（如模具压痕）或抽象影响（如童年经历对人格的烙印）；而 “stamp” 更侧重于具体的、可见的、机械性压印动作，常用于实体物品。"
    }
  ]
}