{
  "word": "stamped",
  "pronunciation": "stampt",
  "concise_definition": "adj. 盖章的, 盖印的; v. 盖章, 盖印 (stamp 的过去式和过去分词)",
  "forms": {
    "base_form": "stamp",
    "third_person_singular": "stamps",
    "present_participle": "stamping",
    "past_tense": "stamped",
    "past_participle": "stamped"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Marked with an official or decorative impression, typically made by pressing a die or seal onto a surface, often to indicate approval, authenticity, or completion.",
      "explanation_cn": "指通过压印印章或模具在表面留下官方或装饰性印记，通常用于表明批准、真实性或已完成状态。",
      "example_en": "The passport was stamped with the entry visa by customs officials.",
      "example_cn": "护照上被海关官员盖上了入境签证章。"
    },
    {
      "pos": "verb",
      "explanation_en": "To press a mark, design, or impression firmly onto a surface, especially using a stamp or seal, often for official, legal, or decorative purposes.",
      "explanation_cn": "指用力将标记、图案或印记压印到表面，通常使用印章或印模，用于官方、法律或装饰目的。",
      "example_en": "She stamped her signature on the contract to finalize the agreement.",
      "example_cn": "她在合同上盖了签名章以最终确认协议。"
    },
    {
      "pos": "verb",
      "explanation_en": "To mark something with a distinctive or repetitive pattern, often to indicate origin, ownership, or quality (e.g., a manufacturer's stamp on goods).",
      "explanation_cn": "指在物品上压印具有辨识度或重复性的图案，以表明来源、所有权或质量（如商品上的制造商印记）。",
      "example_en": "The silverware was stamped with the maker's hallmark to verify its purity.",
      "example_cn": "这套银器上刻有制造商的印记，以证明其纯度。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "marked",
      "analysis": "“Marked” (标记的) 是一个更宽泛的词，泛指任何可见的痕迹、符号或特征，可以是手写、涂画或自然形成，不一定涉及压印工具。而 “stamped” 特指通过印章或模具施加的、具有明确形状和压力的印记，更具正式性和标准化特征。"
    },
    {
      "word_to_compare": "imprinted",
      "analysis": "“Imprinted” (印刻的) 与 “stamped” 非常接近，常可互换，但 “imprinted” 更强调印记与表面的融合或持久性，有时用于抽象语境（如记忆被印刻在心中）。而 “stamped” 更常用于物理对象和官方场景，如邮票、文件、金属制品。"
    },
    {
      "word_to_compare": "sealed",
      "analysis": "“Sealed” (封印的) 指用蜡、胶或特殊材料封闭某物以确保其完整性或保密性，如信封封印。它强调“封闭”功能，而 “stamped” 强调“标记”功能。一个文件可以被盖章（stamped）但未封印（sealed），反之亦然。"
    }
  ]
}