{
  "word": "stamping",
  "pronunciation": "stam·ping",
  "concise_definition": "n. 盖章, 压印, 踏步; v. 盖章, 压印, 踏步 (stamp 的现在分词)",
  "forms": {
    "base_form": "stamp",
    "third_person_singular": "stamps",
    "past_tense": "stamped",
    "past_participle": "stamped",
    "present_participle": "stamping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The action or process of pressing a design, mark, or inscription onto a surface using a die, seal, or tool, often to authenticate, identify, or decorate.",
      "explanation_cn": "指使用模具、印章或工具将图案、标记或文字压印到表面的行为或过程，常用于认证、标识或装饰。",
      "example_en": "The document bears the official stamping of the government agency.",
      "example_cn": "这份文件上有政府机构的官方盖章。"
    },
    {
      "pos": "noun",
      "explanation_en": "A mark or impression left by such an action, especially a distinctive emblem or signature on an object.",
      "explanation_cn": "指通过压印动作留下的印记，尤指物体上具有辨识性的徽章或签名。",
      "example_en": "The antique vase had a rare stamping from the Ming dynasty.",
      "example_cn": "这件古董花瓶上有明代罕见的压印标记。"
    },
    {
      "pos": "verb",
      "explanation_en": "To press or strike something firmly and noisily, especially with the foot, to express anger, impatience, or emphasis.",
      "explanation_cn": "指用脚用力、响亮地踩踏，以表达愤怒、不耐烦或强调。",
      "example_en": "He was stamping his feet in the cold, waiting for the bus.",
      "example_cn": "他在寒冷中跺着脚，等着公交车。"
    },
    {
      "pos": "verb",
      "explanation_en": "To produce a printed mark or design on a surface by applying pressure with a stamp or die, often in manufacturing or official documentation.",
      "explanation_cn": "指通过用印章或模具施加压力，在表面形成印刷标记或图案，常用于制造业或官方文件处理。",
      "example_en": "The factory is stamping serial numbers onto each component for quality control.",
      "example_cn": "工厂正在为每个零部件压印序列号以进行质量控制。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sealing",
      "analysis": "“Sealing”（封印）强调封闭或确保某物不可被篡改，常用于信封、容器或法律文件的封口，目的是防止访问或泄露。而 “stamping” 更侧重于在表面留下可见的标记或图案，不一定具有封闭功能，更多用于识别或认证。"
    },
    {
      "word_to_compare": "imprinting",
      "analysis": "“Imprinting”（印记）通常指一种持久的、有时是心理或生物层面的深刻印记，如动物幼崽对父母的依附，或信息在记忆中的固化。它更抽象、更持久。而 “stamping” 是物理性的、机械的压印行为，强调动作和即时结果。"
    },
    {
      "word_to_compare": "treading",
      "analysis": "“Treading”（踩踏）泛指行走或脚部接触地面的动作，中性且无特定目的。而 “stamping” 是一种用力、有节奏、常带情绪的踩踏，带有明确意图，如表达情绪、制造噪音或完成压印动作。"
    }
  ]
}