{
  "word": "stampede",
  "pronunciation": "stam·peed",
  "concise_definition": "n. 惊跑, 人群狂奔; v. 使惊跑, 使狂奔",
  "forms": {
    "third_person_singular": "stampedes",
    "past_tense": "stampeded",
    "past_participle": "stampeded",
    "present_participle": "stampeding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sudden, panicked rush of a large group of animals or people, typically caused by fear or excitement, often resulting in chaos and danger.",
      "explanation_cn": "指大量动物或人群因恐惧或兴奋而突然、恐慌性地狂奔，通常导致混乱和危险。",
      "example_en": "The loud gunshot triggered a stampede among the cattle.",
      "example_cn": "一声巨响引发了牛群的惊奔。"
    },
    {
      "pos": "noun",
      "explanation_en": "A mass rush of people toward something, especially in a competitive or emotionally charged situation, such as a sale or emergency.",
      "explanation_cn": "指在竞争激烈或情绪高涨的情况下，大量人群蜂拥而至，如抢购促销商品或紧急疏散时的拥挤场面。",
      "example_en": "There was a stampede for the front-row tickets as soon as they went on sale.",
      "example_cn": "门票一开售，人们便蜂拥抢购前排座位。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a group of animals or people to run suddenly and wildly in panic.",
      "explanation_cn": "指使一群动物或人群因恐慌而突然狂奔。",
      "example_en": "The fireworks stampeded the horses into the woods.",
      "example_cn": "烟花把马群吓得冲进了树林。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or act in a hurried, uncontrolled, and often irrational manner due to mass excitement or pressure.",
      "explanation_cn": "指因群体性兴奋或压力而匆忙、失控甚至非理性地行动。",
      "example_en": "The media stampeded into the courtroom as the celebrity arrived.",
      "example_cn": "当这位名人抵达时，媒体记者们蜂拥冲进法庭。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rout",
      "analysis": "“Rout” (溃败/溃逃) 强调因失败或打击而产生的混乱逃窜，通常用于军事或竞争语境，带有被击败的含义。而 “stampede” 更侧重于因恐惧或兴奋引发的自发性狂奔，不一定与失败相关。"
    },
    {
      "word_to_compare": "rush",
      "analysis": "“Rush” (冲/急奔) 是一个更通用的词，指快速移动，可以是有组织的（如急救队冲向现场），也可以是无序的。而 “stampede” 特指因恐慌或情绪失控导致的无序、危险的大规模奔逃，语义更强烈且具负面色彩。"
    },
    {
      "word_to_compare": "flock",
      "analysis": "“Flock” (群聚) 描述动物或人群像鸟群一样自然、有序地聚集，通常没有恐慌或危险的意味。而 “stampede” 则完全相反，强调失控、混乱和潜在的破坏性。"
    }
  ]
}