{
  "word": "standards",
  "pronunciation": "stan·dardz",
  "concise_definition": "n. 标准, 规范, 水平",
  "forms": {
    "singular": "standard"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A level of quality, attainment, or performance that is established as a rule or guideline by an authority, organization, or consensus, used to measure or judge something.",
      "explanation_cn": "由权威机构、组织或共识确立的、用以衡量或评判某事物的质量、成就或表现水平的规则或准则。",
      "example_en": "The factory must meet international safety standards for its products.",
      "example_cn": "该工厂必须使其产品符合国际安全标准。"
    },
    {
      "pos": "noun",
      "explanation_en": "A typical or ideal level of quality, behavior, or condition that serves as a benchmark for comparison or aspiration.",
      "explanation_cn": "作为比较基准或追求目标的典型或理想质量、行为或状态水平。",
      "example_en": "Her work sets a high standard for everyone in the team.",
      "example_cn": "她的工作为团队中的每个人树立了高标准。"
    },
    {
      "pos": "noun",
      "explanation_en": "A recognized measure or unit used in science, industry, or commerce to ensure consistency and accuracy (e.g., the standard kilogram or standard time zones).",
      "explanation_cn": "在科学、工业或商业中用于确保一致性和准确性的公认计量单位或基准（如国际千克原器或标准时区）。",
      "example_en": "The national institute maintains the official standards for weight and measurement.",
      "example_cn": "国家研究院负责维护官方的重量与测量标准。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "criterion",
      "analysis": "“Criterion”（标准、准则）是单数形式，通常指用于判断或决策的单一具体标准，常用于学术、评估或逻辑语境中，强调“评判依据”。而 “standards” 多为复数，泛指一套系统性的规范或要求，涵盖范围更广，常用于制度、行业或社会层面。"
    },
    {
      "word_to_compare": "norm",
      "analysis": "“Norm”（规范）侧重于社会、文化或群体中普遍接受的行为或状态，通常是习惯性或默认的，不一定由正式机构制定。而 “standards” 更强调正式、可测量、可执行的规则，常带有强制性或认证性质。例如，社会规范是“人们通常怎么做”，而标准是“必须怎么做”。"
    },
    {
      "word_to_compare": "benchmark",
      "analysis": "“Benchmark”（基准）通常指用于比较和衡量绩效的参考点，常用于商业、技术或管理领域，强调“对标”和“最佳实践”。它往往是标准的一种具体体现，但更侧重于动态比较和改进，而 “standards” 更偏向于静态的、被广泛认可的规则体系。"
    }
  ]
}