{
  "word": "standing",
  "pronunciation": "stán-ding",
  "concise_definition": "n. 地位, 身份, 站立; adj. 持续的, 固定的",
  "forms": {
    "noun": "standing",
    "adjective": "standing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The position or rank of a person or organization in society, a profession, or a particular context, often reflecting respect, reputation, or authority.",
      "explanation_cn": "指个人或组织在社会、职业或特定情境中的地位或等级，通常体现其声望、声誉或权威。",
      "example_en": "She has a high standing in the legal community.",
      "example_cn": "她在法律界享有很高的地位。"
    },
    {
      "pos": "noun",
      "explanation_en": "The state of being upright on one's feet; physical posture.",
      "explanation_cn": "指身体直立的状态；生理上的站立姿势。",
      "example_en": "The audience rose to their feet in standing ovation.",
      "example_cn": "观众全体起立，报以热烈的掌声。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Existing continuously or permanently, not temporary or changing; often used to describe rules, committees, or positions that are always in effect.",
      "explanation_cn": "指持续存在或永久性的，非临时或变动的；常用于描述始终有效的规则、委员会或职位。",
      "example_en": "The company has a standing order to recycle all paper waste.",
      "example_cn": "公司有持续执行的政策，要求回收所有纸张废弃物。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Designed to remain in place or be used repeatedly without modification, especially in the context of agreements or arrangements.",
      "explanation_cn": "指设计为保持原状或重复使用而不作修改的，尤其用于协议或安排。",
      "example_en": "He has a standing invitation to visit us anytime.",
      "example_cn": "他随时都可以来拜访我们，这是长期有效的邀请。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "status",
      "analysis": "“Status”（地位）更侧重于社会或组织结构中的正式等级或身份，常用于描述权力、阶级或社会层级；而 “standing” 更强调因行为、声誉或成就所赢得的尊重和评价，更具主观性和动态性。"
    },
    {
      "word_to_compare": "position",
      "analysis": "“Position”（位置/职位）通常指具体的职务、地点或观点，具有空间或组织上的明确性；而 “standing” 更抽象，强调的是在他人眼中所处的声誉或威望层面，不一定与具体头衔相关。"
    },
    {
      "word_to_compare": "persistent",
      "analysis": "“Persistent”（持续的）强调某事物不断重复发生或顽强存在，常含贬义（如persistent problem）；而 “standing” 作为形容词时，强调的是制度性、正式性或长期有效的状态，中性或褒义，如 standing order（长期指令）。"
    }
  ]
}