{
  "word": "stand",
  "pronunciation": "stand",
  "concise_definition": "v. 站立, 坚持, 位于; n. 售货台, 支架, 立场",
  "forms": {
    "third_person_singular": "stands",
    "past_tense": "stood",
    "past_participle": "stood",
    "present_participle": "standing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To be in an upright position on the feet, without sitting or lying down.",
      "explanation_cn": "指双脚着地，保持直立姿势，不坐或不躺。",
      "example_en": "She stood by the window, watching the rain fall.",
      "example_cn": "她站在窗边，看着雨落下。"
    },
    {
      "pos": "verb",
      "explanation_en": "To maintain a firm position or opinion, especially in the face of opposition or pressure.",
      "explanation_cn": "指在面对反对或压力时坚持某种立场、观点或原则。",
      "example_en": "He refused to compromise and stood his ground on the issue of environmental protection.",
      "example_cn": "他拒绝妥协，在环境保护问题上坚持了自己的立场。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be located or situated in a particular place.",
      "explanation_cn": "指某物或某人位于某个特定位置。",
      "example_en": "The church stands at the top of the hill.",
      "example_cn": "教堂坐落在山顶上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small structure or counter from which goods or food are sold, often in a public place.",
      "explanation_cn": "指在公共场所出售商品或食品的小型柜台或摊位。",
      "example_en": "We bought fresh fruit from a street stand near the market.",
      "example_cn": "我们在市场附近的一个街头摊位买了新鲜水果。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device or structure designed to hold something in an upright or fixed position.",
      "explanation_cn": "指用于将某物保持直立或固定位置的装置或支架。",
      "example_en": "He placed his guitar on a music stand before practicing.",
      "example_cn": "他练习前把吉他放在了乐谱架上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A position or attitude adopted toward a particular issue or belief, especially one that is publicly declared.",
      "explanation_cn": "指对某一问题或信念所采取的公开立场或态度。",
      "example_en": "The company's stand on employee privacy has drawn both praise and criticism.",
      "example_cn": "该公司对员工隐私的立场引发了赞誉与批评。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "remain",
      "analysis": "“Remain” (保持) 强调状态的持续不变，通常用于抽象状态（如情绪、身份），不涉及身体姿势或物理位置。而 “stand” 在表示‘坚持立场’时更强调主动、坚定的态度，且常带有对抗性或道德立场的意味。"
    },
    {
      "word_to_compare": "tolerate",
      "analysis": "“Tolerate” (容忍) 指被动地接受或忍耐某种不理想的情况，不包含立场的坚持或抵抗。而 “stand” 在表示立场时是主动的、有原则的，甚至可能引发冲突，如 ‘stand up for’ 某种正义。"
    },
    {
      "word_to_compare": "support",
      "analysis": "“Support” (支持) 通常指提供帮助、资源或背书，可以是物质或情感上的。而 “stand” 作为名词时指的是一种立场或态度，更侧重于信念的表达，而非行动上的援助。例如：‘stand for justice’ 强调信念，而 ‘support justice’ 强调行动。"
    }
  ]
}