{
  "word": "stardust",
  "pronunciation": "stahr·dust",
  "concise_definition": "n. 星尘, 繁星般的微粒, 梦幻般的魅力",
  "forms": {
    "plural": "stardusts"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Tiny particles of dust believed to originate from stars, especially in astronomical or poetic contexts; often used to evoke the cosmic and ethereal nature of the universe.",
      "explanation_cn": "指被认为源自恒星的微小尘埃颗粒，尤其在天文学或诗意语境中使用，常用来唤起宇宙的浩瀚与超凡脱俗的氛围。",
      "example_en": "The telescope captured images of stardust swirling around the newborn star.",
      "example_cn": "望远镜捕捉到了围绕新生恒星旋转的星尘图像。"
    },
    {
      "pos": "noun",
      "explanation_en": "A metaphorical term for something magical, glamorous, or enchanting, often associated with fame, romance, or the allure of Hollywood or the entertainment industry.",
      "explanation_cn": "一种隐喻性表达，指某种充满魔力、光彩夺目或令人着迷的事物，常与名人光环、浪漫情怀或好莱坞及娱乐业的魅力相关联。",
      "example_en": "She still carries the stardust of her youth, even after decades away from the spotlight.",
      "example_cn": "即使离开聚光灯数十年，她身上仍保留着青春时代的那份星光魅力。"
    },
    {
      "pos": "noun",
      "explanation_en": "A fine, sparkling substance resembling dust made of crushed gemstones or glitter, used in cosmetics, crafts, or decorative arts.",
      "explanation_cn": "一种类似由碎宝石或亮片制成的细小闪亮物质，常用于化妆品、手工艺或装饰艺术中。",
      "example_en": "The bride’s dress was adorned with shimmering stardust that caught the light with every step.",
      "example_cn": "新娘的礼服上点缀着闪烁的星尘，在每一步行走时都折射出光芒。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "dust",
      "analysis": "“Dust”（灰尘）泛指任何细小的颗粒物，通常带有负面含义，如污垢、脏乱。而 “stardust” 是一种诗意或科学化的表达，强调其来源（恒星）和美感，具有浪漫或宇宙的象征意义，语义上更崇高、更富想象力。"
    },
    {
      "word_to_compare": "glitter",
      "analysis": "“Glitter”（亮片/闪光）指人工制造的、用于视觉装饰的微小反光片，强调物理上的闪亮效果，常用于手工或时尚领域。而 “stardust” 更偏向自然生成、神秘或隐喻性的光辉，不仅指视觉效果，更承载情感与象征意义。"
    },
    {
      "word_to_compare": "cosmic dust",
      "analysis": "“Cosmic dust”（宇宙尘）是天文学中的专业术语，指星际空间中的微粒，强调科学性和客观性。而 “stardust” 是更通俗、更具文学色彩的表达，常用于诗歌、歌曲或大众文化中，带有情感共鸣和浪漫化倾向，两者在语境上一为科学，一为艺术。"
    }
  ]
}