{
  "word": "star",
  "pronunciation": "stahr",
  "concise_definition": "n. 恒星, 明星, 重要人物; v. 担任主角",
  "forms": {
    "plural": "stars"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A massive, luminous sphere of plasma held together by gravity, emitting light and heat through nuclear fusion in its core.",
      "explanation_cn": "指由引力维系的、通过核心核聚变释放光和热的巨大发光等离子体球体，即天文学中的恒星。",
      "example_en": "The North Star has been used for navigation for centuries.",
      "example_cn": "北极星几个世纪以来一直被用于导航。"
    },
    {
      "pos": "noun",
      "explanation_en": "A famous and highly popular person in entertainment, sports, or other public fields, often admired for their talent or charisma.",
      "explanation_cn": "指在娱乐、体育或其他公众领域中著名且广受欢迎的人物，常因其才华或魅力而受到钦佩。",
      "example_en": "She became a global star after her breakout role in the film.",
      "example_cn": "她在电影中一鸣惊人后，成为全球明星。"
    },
    {
      "pos": "noun",
      "explanation_en": "A symbol or shape resembling a star, often used to denote excellence, rating, or importance (e.g., a five-star hotel).",
      "explanation_cn": "指形状类似星星的符号，常用于表示卓越、等级或重要性（如五星级酒店）。",
      "example_en": "The restaurant received three stars in the Michelin Guide.",
      "example_cn": "这家餐厅在米其林指南中获得了三颗星。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be the main performer or central figure in a film, play, or other production.",
      "explanation_cn": "指在电影、戏剧或其他演出中担任主角或核心人物。",
      "example_en": "Tom Hanks starred in the critically acclaimed movie 'Forrest Gump'.",
      "example_cn": "汤姆·汉克斯主演了广受好评的电影《阿甘正传》。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "celebrity",
      "analysis": "“Celebrity”（名人）泛指因知名度而被公众熟知的人，不一定有突出才能，可能仅因曝光度或八卦新闻成名。而 “star” 强调在专业领域内因卓越表现而获得的明星地位，更具成就性和艺术性。"
    },
    {
      "word_to_compare": "planet",
      "analysis": "“Planet”（行星）是围绕恒星运行的天体，本身不发光，仅反射光。它与 “star” 在天文学上是互补但本质不同的概念：恒星是光源，行星是受光体。在比喻用法中，行星常指依附于明星的次要人物，而 “star” 是中心。"
    },
    {
      "word_to_compare": "icon",
      "analysis": "“Icon”（偶像/象征）指具有深远文化或精神象征意义的人物或符号，往往超越时代，承载集体记忆或信仰。而 “star” 更侧重于当下的流行性和公众吸引力，可能随时间褪色。一个 icon 可能曾是 star，但并非所有 star 都能成为 icon。"
    }
  ]
}