{
  "word": "stash",
  "pronunciation": "stash",
  "concise_definition": "n. 隐藏物, 秘密储藏; v. 隐藏, 储藏",
  "forms": {
    "third_person_singular": "stashes",
    "past_tense": "stashed",
    "past_participle": "stashed",
    "present_participle": "stashing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A hidden or secret store of something, often valuable or illicit, kept away from public view or discovery.",
      "explanation_cn": "指隐藏起来、不为人知的某物储藏，通常为贵重或非法物品，刻意避开公众视线或发现。",
      "example_en": "The detective found a stash of stolen jewelry beneath the floorboards.",
      "example_cn": "侦探在地板下发现了一处藏匿的被盗珠宝。"
    },
    {
      "pos": "noun",
      "explanation_en": "A reserve supply kept for future use, especially in informal or emergency contexts.",
      "explanation_cn": "指为将来使用而保留的储备物资，尤其用于非正式或紧急情况。",
      "example_en": "She keeps a stash of chocolate in her desk drawer for stressful days.",
      "example_cn": "她把一盒巧克力藏在抽屉里，以备压力大的日子食用。"
    },
    {
      "pos": "verb",
      "explanation_en": "To store or hide something secretly, often in a small or inconspicuous place.",
      "explanation_cn": "指将某物秘密地存放或藏匿，通常藏在狭小或不起眼的地方。",
      "example_en": "He stashed his savings in a hollow tree to avoid his family's questions.",
      "example_cn": "他把积蓄藏在一棵空心树里，以免家人追问。"
    },
    {
      "pos": "verb",
      "explanation_en": "To accumulate or collect something in secret over time, often for personal use or future advantage.",
      "explanation_cn": "指秘密地逐渐积累某物，通常是为了个人使用或未来获益。",
      "example_en": "The soldiers stashed food and water before the siege began.",
      "example_cn": "士兵们在围城开始前秘密囤积了食物和水。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "store",
      "analysis": "“Store” (储存) 是中性词，泛指将物品放在某个地方以备后用，不隐含秘密性。而 “stash” 强调隐藏、保密，常带有规避监管、审查或他人发现的意图。"
    },
    {
      "word_to_compare": "hoard",
      "analysis": "“Hoard” (囤积) 通常带有贬义，暗示过度积累、贪婪或病态地保存物品，常用于描述囤积物资、金钱或废物。“Stash” 则更中性，可指合理或必要的秘密储备，如应急物资。"
    },
    {
      "word_to_compare": "cache",
      "analysis": "“Cache” (缓存/藏匿处) 多用于技术语境（如计算机缓存）或军事/探险语境，指有组织、有目的的隐蔽存储，常为临时性或功能性用途。“Stash” 更口语化，范围更广，可指任何私藏，无论是否系统化。"
    }
  ]
}