{
  "word": "stating",
  "pronunciation": "stay·ting",
  "concise_definition": "v. 陈述, 说明, 表述 (state 的现在分词/动名词形式)",
  "forms": {
    "base_form": "state",
    "third_person_singular": "states",
    "past_tense": "stated",
    "past_participle": "stated",
    "gerund": "stating"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To express or declare something clearly and formally, often in words, writing, or a public declaration, with the intent to communicate information or a position.",
      "explanation_cn": "以清晰、正式的方式用语言、文字或公开声明表达或宣告某事，旨在传达信息或立场。",
      "example_en": "The lawyer was stating the facts of the case to the jury.",
      "example_cn": "律师正在向陪审团陈述案件的事实。"
    },
    {
      "pos": "verb",
      "explanation_en": "To present a claim, opinion, or argument in a direct and unambiguous manner, often to establish a basis for further discussion or action.",
      "explanation_cn": "以直接且明确的方式提出主张、观点或论点，通常为后续讨论或行动奠定基础。",
      "example_en": "In her speech, she was stating her position on climate change with great conviction.",
      "example_cn": "在她的演讲中，她以坚定的信念陈述了自己对气候变化的立场。"
    },
    {
      "pos": "verb",
      "explanation_en": "To formally record or document a fact, condition, or requirement, especially in legal, technical, or official contexts.",
      "explanation_cn": "在法律、技术或官方语境中，正式记录或记载某一事实、状况或要求。",
      "example_en": "The contract is stating that payment must be made within 30 days.",
      "example_cn": "合同中明确规定付款必须在30天内完成。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "asserting",
      "analysis": "“Asserting” (断言) 强调以自信甚至强硬的方式表达观点，常带有主张权利或坚持立场的意味，可能隐含争议性或对抗性。而 “stating” 更中性，侧重于客观传达信息，不必然带有情绪或立场强度。"
    },
    {
      "word_to_compare": "declaring",
      "analysis": "“Declaring” (宣布) 通常用于正式、权威或公开的场合，如政府、组织或个人发布重大决定，具有仪式性或法律效力。而 “stating” 更通用，可用于日常交流或非正式语境，不必然具有权威性。"
    },
    {
      "word_to_compare": "expressing",
      "analysis": "“Expressing” (表达) 范围更广，可涵盖情感、态度、艺术或非语言形式（如表情、动作），而 “stating” 专指通过语言或文字清晰、理性地传达信息，更强调内容的明确性和逻辑性。"
    }
  ]
}