{
  "word": "station",
  "pronunciation": "stey·shun",
  "concise_definition": "n. 车站, 站点, 职位, 身份; v. 驻扎, 安置",
  "forms": {
    "plural": "stations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A place where people or vehicles stop, especially for boarding or alighting, such as a train, bus, or subway stop.",
      "explanation_cn": "指人们或交通工具停靠的地方，特别是用于上下车的火车、公共汽车或地铁站。",
      "example_en": "We waited at the subway station for the next train.",
      "example_cn": "我们在地铁站等候下一班列车。"
    },
    {
      "pos": "noun",
      "explanation_en": "A fixed position or role assigned to a person within an organization or system, often implying responsibility or status.",
      "explanation_cn": "指个人在组织或体系中被分配的固定职位或角色，通常带有责任或身份的含义。",
      "example_en": "He holds a senior station in the company as director of operations.",
      "example_cn": "他担任公司运营总监，拥有高级职位。"
    },
    {
      "pos": "noun",
      "explanation_en": "A facility or location equipped for a specific function, such as a research station, broadcasting station, or military outpost.",
      "explanation_cn": "指为特定功能而配备的设施或地点，如科研站、广播站或军事前哨。",
      "example_en": "The Antarctic research station conducts climate studies year-round.",
      "example_cn": "南极科研站全年开展气候研究。"
    },
    {
      "pos": "verb",
      "explanation_en": "To assign or place someone in a particular position or location, especially for duty or service.",
      "explanation_cn": "指将某人指派或安置在特定位置或地点，通常用于执行任务或服务。",
      "example_en": "The army stationed troops along the border to monitor activity.",
      "example_cn": "军队在边境驻扎部队以监控活动。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "stop",
      "analysis": "“Stop” (停靠点) 是一个更通用、更口语化的词，泛指交通工具短暂停留的地点，不强调设施或功能。而 “station” 通常指有正式设施、服务和管理的固定站点，语义更正式、更具体。"
    },
    {
      "word_to_compare": "post",
      "analysis": "“Post” (岗位/哨位) 与 “station” 在表示职位或驻扎地时有重叠，但 “post” 更常用于军事、外交或执勤岗位，强调职责和守卫性质；而 “station” 可用于更广泛的组织结构，包括商业、科研或交通领域。"
    },
    {
      "word_to_compare": "location",
      "analysis": "“Location” (地点) 是一个中性、泛指的空间概念，不隐含功能、职责或服务。而 “station” 不仅指地点，还承载特定用途、组织角色或系统功能，语义更丰富、更具结构性。"
    }
  ]
}