{
  "word": "states",
  "pronunciation": "steyts",
  "concise_definition": "n. 州, 国家, 状态, 情形",
  "forms": {
    "singular": "state"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A politically organized body of people under a single government, especially one of the constituent divisions of a federal nation such as the United States or Australia.",
      "explanation_cn": "指在单一政府下组织起来的人民群体，尤指联邦制国家（如美国或澳大利亚）的组成部分——州。",
      "example_en": "California and Texas are two of the largest states in the United States.",
      "example_cn": "加利福尼亚州和德克萨斯州是美国最大的两个州。"
    },
    {
      "pos": "noun",
      "explanation_en": "The condition or mode of being of a person, thing, or system at a particular time, often referring to physical, mental, or emotional conditions.",
      "explanation_cn": "指某人、某物或某系统在特定时间所处的状况或存在形式，常用于描述身体、心理或情绪状态。",
      "example_en": "She is in a fragile state after the accident.",
      "example_cn": "事故发生后，她的身体状况十分脆弱。"
    },
    {
      "pos": "noun",
      "explanation_en": "A nation or sovereign political entity, especially when referring to countries in international contexts.",
      "explanation_cn": "指一个国家或主权政治实体，尤其在国际语境中使用。",
      "example_en": "The United Nations includes 193 member states.",
      "example_cn": "联合国包括193个成员国。"
    },
    {
      "pos": "noun",
      "explanation_en": "The official position or declaration of a government, organization, or individual on a particular issue.",
      "explanation_cn": "指政府、组织或个人就某一特定问题所采取的正式立场或声明。",
      "example_en": "The state of the company on the merger remains unchanged.",
      "example_cn": "该公司对合并的立场没有改变。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "country",
      "analysis": "“Country”（国家）强调地理、文化、民族和历史的统一性，通常用于非正式或泛指的语境；而 “state” 更侧重于政治和法律意义上的主权实体，常用于正式或国际关系语境。例如，我们说 “the United States is a country” 也可以说 “the United States is a state”，但后者更强调其作为国际法主体的身份。"
    },
    {
      "word_to_compare": "condition",
      "analysis": "“Condition”（状况）通常指具体、可观察的物理或健康状态，如 ‘medical condition’；而 ‘state’ 更抽象，可涵盖心理、政治、系统性等更广泛的语境，如 ‘state of mind’ 或 ‘state of the economy’。‘State’ 的语义范围更广，也更具哲学性。"
    },
    {
      "word_to_compare": "nation",
      "analysis": "“Nation”（民族/国家）强调共同的语言、文化、历史和身份认同，是一个社会文化概念；而 ‘state’ 是一个政治和行政概念，指拥有领土、政府和主权的实体。一个 nation 可以没有 state（如库尔德人），一个 state 也可以包含多个 nation（如瑞士）。"
    }
  ]
}