{
  "word": "steamed",
  "pronunciation": "stēmd",
  "concise_definition": "adj. 蒸的, 蒸煮过的; v. 蒸 (steam 的过去式和过去分词)",
  "forms": {
    "base_form": "steam",
    "present_participle": "steaming",
    "third_person_singular": "steams"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Cooked by exposing food to steam, typically to preserve flavor, texture, and nutrients without adding fat.",
      "explanation_cn": "通过蒸汽加热烹制的食物，通常用于保留食物的风味、口感和营养，且无需添加油脂。",
      "example_en": "She ordered steamed fish with ginger and soy sauce for dinner.",
      "example_cn": "她晚餐点了一份姜和酱油蒸鱼。"
    },
    {
      "pos": "adjective",
      "explanation_en": "In a state of being heated or moistened by steam, often describing the condition of food just after cooking.",
      "explanation_cn": "指因蒸汽而处于加热或湿润状态，常用于描述食物刚蒸好时的状况。",
      "example_en": "The steamed buns were still warm and fluffy when served.",
      "example_cn": "上桌时，蒸包依然温热松软。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cook food using steam generated by boiling water, as a method of gentle and healthy preparation.",
      "explanation_cn": "利用沸水产生的蒸汽来烹煮食物，是一种温和且健康的烹饪方式。",
      "example_en": "He steamed the vegetables for ten minutes to keep them crisp.",
      "example_cn": "他将蔬菜蒸了十分钟，以保持其爽脆口感。"
    },
    {
      "pos": "verb",
      "explanation_en": "To become filled or heated with steam, often used intransitively to describe the process of steam rising or accumulating.",
      "explanation_cn": "指被蒸汽充满或受热，常用于不及物动词，描述蒸汽上升或积聚的过程。",
      "example_en": "The windows steamed up after the shower.",
      "example_cn": "淋浴后，窗户上蒙上了一层水汽。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "boiled",
      "analysis": "“Boiled”（煮沸的）指将食物直接浸入沸水中烹煮，可能导致营养流失和质地变软；而 “steamed”（蒸的）是利用蒸汽间接加热，能更好地保留食物的原味、色泽和营养，烹饪过程更温和。"
    },
    {
      "word_to_compare": "roasted",
      "analysis": "“Roasted”（烤制的）是通过干热（如烤箱或明火）使食物表面焦化、内部熟透，带来浓郁香气和酥脆口感；而 “steamed” 不使用油脂或高温直接接触，口感更清淡、湿润，适合追求健康饮食的人群。"
    },
    {
      "word_to_compare": "blanched",
      "analysis": "“Blanched”（焯水的）是将食物短暂浸入沸水后立即冷却，主要用于去腥、褪色或预处理；而 “steamed” 是持续加热直至完全熟透，目的是完成烹饪而非仅做预处理。"
    }
  ]
}