{
  "word": "steam",
  "pronunciation": "stēm",
  "concise_definition": "n. 蒸汽, 热气; v. 蒸, 蒸煮, 冒蒸汽",
  "forms": {
    "third_person_singular": "steams",
    "past_tense": "steamed",
    "past_participle": "steamed",
    "present_participle": "steaming"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The invisible gaseous substance produced when water is heated to its boiling point and turns into vapor; often visible as white clouds when it cools.",
      "explanation_cn": "水被加热至沸点后转化为的气态物质，通常在冷却时呈现为白色云雾状，即我们所见的‘蒸汽’。",
      "example_en": "The kettle began to whistle as steam rose from the boiling water.",
      "example_cn": "水烧开时，蒸汽从水壶中升起，发出哨声。"
    },
    {
      "pos": "noun",
      "explanation_en": "The power or energy generated by steam, especially in engines or heating systems, used to drive machinery or produce electricity.",
      "explanation_cn": "指由蒸汽产生的动力或能量，常用于驱动发动机或供热系统，以推动机械或发电。",
      "example_en": "The old locomotive was powered by steam generated in its boiler.",
      "example_cn": "这台老式机车由锅炉中产生的蒸汽驱动。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cook food using the heat and moisture of steam, typically in a specialized pot or appliance.",
      "explanation_cn": "利用蒸汽的热量和湿气来烹煮食物，通常使用专用的蒸锅或电器。",
      "example_en": "She steamed the broccoli for five minutes to preserve its nutrients.",
      "example_cn": "她将西兰花蒸了五分钟，以保留其营养成分。"
    },
    {
      "pos": "verb",
      "explanation_en": "To emit or release steam, especially from a hot surface or liquid.",
      "explanation_cn": "指从热表面或液体中释放或冒出蒸汽。",
      "example_en": "The pavement was still steaming after the rain stopped.",
      "example_cn": "雨停后，路面仍在冒蒸汽。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be filled with or overcome by intense emotion, often anger, so that one acts impulsively or loses control.",
      "explanation_cn": "指因强烈情绪（尤其是愤怒）而充满或被控制，导致冲动行事或失去理智。",
      "example_en": "He was steaming mad when he found out about the betrayal.",
      "example_cn": "当他发现被背叛时，气得暴跳如雷。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "vapor",
      "analysis": "“Vapor”（水汽）是更广义的术语，泛指任何物质的气态形式，包括酒精、汽油等挥发物；而 “steam” 特指水在高温下形成的气态水，具有高温、高能量的特性。蒸汽是水蒸气的一种，但并非所有水蒸气都叫蒸汽（如室温下的水汽不叫蒸汽）。"
    },
    {
      "word_to_compare": "gas",
      "analysis": "“Gas”（气体）是物质的三态之一，泛指所有气态物质，如氧气、二氧化碳；而 “steam” 是特定于水的气态形式，且通常在高温下产生。蒸汽是气体的一种，但气体不一定是蒸汽。"
    },
    {
      "word_to_compare": "boil",
      "analysis": "“Boil”（沸腾）是水达到沸点并剧烈转化为蒸汽的过程，是一个物理变化的动词；而 “steam” 作为动词时，强调的是蒸汽的产生或利用，不一定是剧烈沸腾。例如，你可以用蒸汽蒸食物（steaming），但水不一定在沸腾（可能低于沸点仍能产生蒸汽）。"
    }
  ]
}