{
  "word": "steadily",
  "pronunciation": "sted·uh·lee",
  "concise_definition": "adv. 稳定地, 持续地, 逐步地",
  "forms": {
    "comparative": "more steadily",
    "superlative": "most steadily"
  },
  "definitions": [
    {
      "pos": "adverb",
      "explanation_en": "In a consistent, uninterrupted, and predictable manner, without sudden changes or fluctuations; often implying progress or movement that is slow but sure.",
      "explanation_cn": "以一种持续、不间断且可预测的方式，没有突然的变化或波动；常暗示一种缓慢但坚定的进步或移动。",
      "example_en": "The company has been steadily increasing its market share over the past five years.",
      "example_cn": "过去五年中，该公司一直在稳步扩大其市场份额。"
    },
    {
      "pos": "adverb",
      "explanation_en": "With firmness and determination, especially in maintaining a position, pace, or course despite challenges or distractions.",
      "explanation_cn": "以坚定和果断的态度，尤其在面对挑战或干扰时仍能保持某种立场、节奏或方向。",
      "example_en": "She walked steadily toward the exit, ignoring the shouting around her.",
      "example_cn": "她坚定地朝出口走去，对周围的叫喊置若罔闻。"
    },
    {
      "pos": "adverb",
      "explanation_en": "In a gradual and continuous way, often used to describe improvement, growth, or decline that occurs over time without abrupt shifts.",
      "explanation_cn": "以一种渐进且持续的方式，常用于描述随着时间推移而发生的改善、增长或衰退，且无剧烈波动。",
      "example_en": "His confidence has been steadily growing since he started public speaking.",
      "example_cn": "自从他开始公开演讲以来，他的自信心一直在稳步增长。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "constantly",
      "analysis": "“Constantly”（不断地）强调动作或状态的持续发生，几乎无间断，有时带有负面含义（如‘不断打扰’）。而 ‘steadily’ 更强调节奏的稳定性和可预测性，不一定是高频，但一定是平稳的，常用于描述趋势或进展。"
    },
    {
      "word_to_compare": "gradually",
      "analysis": "“Gradually”（逐渐地）侧重于变化过程的缓慢性，强调从一端到另一端的过渡，但不一定强调过程中的稳定性。‘Steadily’ 则在‘缓慢’的基础上增加了‘稳定’的含义，排除了反复或倒退的可能性。"
    },
    {
      "word_to_compare": "uniformly",
      "analysis": "“Uniformly”（均匀地）强调在空间或时间上完全一致、无差异的分布或变化，常用于物理或数学语境。‘Steadily’ 更偏向于动态过程中的持续性和可靠性，允许一定程度的微小波动，只要整体趋势不变。"
    }
  ]
}