{
  "word": "steamer",
  "pronunciation": "stee·muhr",
  "concise_definition": "n. 蒸汽船, 蒸汽机, 蒸锅, 熨斗",
  "forms": {
    "plural": "steamers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A ship propelled by a steam engine, historically used for passenger transport and cargo delivery before the advent of diesel and gas turbines.",
      "explanation_cn": "指由蒸汽机驱动的船只，历史上在柴油和燃气涡轮出现之前广泛用于客运和货运。",
      "example_en": "The old steamer sailed across the Atlantic in the 19th century, carrying immigrants to America.",
      "example_cn": "这艘古老的蒸汽船在19世纪横渡大西洋，运送移民前往美洲。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device that uses steam to cook food, typically consisting of stacked tiers where food is placed above boiling water.",
      "explanation_cn": "指利用蒸汽烹饪食物的器具，通常由多层蒸笼组成，食物置于沸水上方受热。",
      "example_en": "She prepared dumplings in a traditional bamboo steamer.",
      "example_cn": "她用传统的竹制蒸锅蒸了饺子。"
    },
    {
      "pos": "noun",
      "explanation_en": "An appliance that generates steam to remove wrinkles from clothing, often used as an alternative to an iron.",
      "explanation_cn": "指通过产生蒸汽来去除衣物褶皱的器具，常作为熨斗的替代品。",
      "example_en": "He used a handheld steamer to freshen up his suit before the meeting.",
      "example_cn": "他在会议前用便携式蒸汽熨斗让西装恢复平整。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of electric or gas-powered machine that produces steam for industrial or cleaning purposes, such as in carpet cleaning or sterilization.",
      "explanation_cn": "指用于工业或清洁目的（如地毯清洁或消毒）的产生蒸汽的电动或燃气设备。",
      "example_en": "The cleaning crew used a powerful steamer to sanitize the hotel carpets.",
      "example_cn": "清洁人员使用强力蒸汽机对酒店地毯进行消毒。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "boat",
      "analysis": "“Boat”（船）是泛指所有小型水上交通工具，不特指动力方式；而 “steamer” 特指以蒸汽机为动力的船只，属于“boat”的一种历史类型。现代语境中，“boat” 更常用，而 “steamer” 多用于历史或文学语境。"
    },
    {
      "word_to_compare": "pot",
      "analysis": "“Pot”（锅）通常指直接加热的容器，用于煮、炖等；而 “steamer” 是通过蒸汽间接加热食物，不与水直接接触，能更好地保留营养和原味。两者功能相似但加热方式不同。"
    },
    {
      "word_to_compare": "iron",
      "analysis": "“Iron”（熨斗）通过直接接触高温金属板压平衣物，而 “steamer” 利用高温蒸汽穿透纤维，无需接触表面，更适合精致面料（如丝绸、羊毛）且不易烫伤。两者都是去皱工具，但使用方式和适用材质不同。"
    }
  ]
}