{
  "word": "steady",
  "pronunciation": "sted·ee",
  "concise_definition": "adj. 稳定的, 稳固的, 持续的; v. 使稳定, 使镇定",
  "forms": {
    "comparative": "steadier",
    "superlative": "steadiest",
    "third_person_singular": "steadies",
    "past_tense": "steadied",
    "past_participle": "steadied",
    "present_participle": "steadying"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Not changing or fluctuating; remaining firm, constant, or reliable over time, especially in terms of balance, performance, or condition.",
      "explanation_cn": "不变化或波动的；在时间上保持坚定、恒定或可靠，尤其指平衡、表现或状态的稳定。",
      "example_en": "She has a steady job at the bank and can count on a reliable income.",
      "example_cn": "她在银行有一份稳定的工作，可以依靠稳定的收入。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Firmly fixed or not easily moved or disturbed; physically stable or unshakable.",
      "explanation_cn": "牢固固定、不易移动或扰动的；身体上稳定或不可动摇的。",
      "example_en": "He gave her a steady hand to help her cross the icy path.",
      "example_cn": "他伸出稳定的手帮助她走过结冰的小路。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Happening continuously or at a regular rate, without sudden changes or interruptions.",
      "explanation_cn": "持续发生或以规律速率进行，没有突然变化或中断的。",
      "example_en": "The band played a steady rhythm throughout the concert.",
      "example_cn": "乐队在整个音乐会中保持着稳定的节奏。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make or become more stable, calm, or secure, especially after a period of instability or disturbance.",
      "explanation_cn": "使某物或某人变得更稳定、平静或安全，尤其在经历不稳定或动荡之后。",
      "example_en": "The doctor administered medication to steady his heartbeat.",
      "example_cn": "医生给他服药以稳定心跳。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strengthen one's resolve or composure, especially in a moment of stress or shock.",
      "explanation_cn": "在压力或震惊时刻增强自己的决心或镇定。",
      "example_en": "She took a deep breath to steady herself before speaking.",
      "example_cn": "她在发言前深吸一口气，让自己镇定下来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "stable",
      "analysis": "“Stable” (稳定的) 更强调系统性、结构性的稳固，常用于物理、经济或心理状态的长期不变性，语气更正式。而 “steady” 更侧重于动态过程中的持续性和一致性，常用于描述动作、节奏或情绪的平稳。"
    },
    {
      "word_to_compare": "constant",
      "analysis": "“Constant” (恒定的) 强调不间断、无变化的持续性，常用于数值、频率或状态的绝对不变。而 “steady” 可以容忍轻微波动，只要整体趋势保持一致，更强调可靠性而非绝对不变。"
    },
    {
      "word_to_compare": "firm",
      "analysis": "“Firm” (坚固的) 主要强调物理上的坚硬或不可动摇，常用于物体或态度的坚定。而 “steady” 不仅指物理稳定，也广泛用于情绪、节奏、发展等抽象层面的平稳，语义范围更广。"
    }
  ]
}