{
  "word": "steal",
  "pronunciation": "steehl",
  "concise_definition": "v. 偷, 盗, 窃取; n. 便宜货",
  "forms": {
    "third_person_singular": "steals",
    "past_tense": "stole",
    "past_participle": "stolen",
    "present_participle": "stealing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To take someone else's property or possessions without permission or legal right, typically in a secretive or dishonest manner.",
      "explanation_cn": "指在未经允许或没有合法权利的情况下，以秘密或不诚实的方式拿走他人的财产或物品。",
      "example_en": "Someone stole my wallet from my backpack while I was on the bus.",
      "example_cn": "我在公交车上时，有人从我的背包里偷走了钱包。"
    },
    {
      "pos": "verb",
      "explanation_en": "To appropriate or use someone else's ideas, work, or creativity without giving credit, often in artistic, academic, or professional contexts.",
      "explanation_cn": "指在艺术、学术或职业语境中，未经许可或未注明出处，擅自使用他人的想法、作品或创意。",
      "example_en": "The article was accused of stealing ideas from a lesser-known blogger.",
      "example_cn": "这篇文章被指控剽窃了一位不太知名博主的观点。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or act quickly and quietly to avoid notice, often in a sneaky or furtive way.",
      "explanation_cn": "指以迅速而安静的方式行动，以避免被注意，常带有偷偷摸摸的意味。",
      "example_en": "He stole out of the room without saying goodbye.",
      "example_cn": "他悄悄溜出房间，连再见都没说。"
    },
    {
      "pos": "noun",
      "explanation_en": "Something acquired at a price much lower than its actual value; a bargain or excellent deal.",
      "explanation_cn": "指以远低于实际价值的价格购得之物；一种极划算的交易或便宜货。",
      "example_en": "This vintage coat was a real steal at only $20!",
      "example_cn": "这件复古外套只卖20美元，真是捡到宝了！"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rob",
      "analysis": "“Rob” (抢劫) 强调使用暴力、威胁或恐吓从某人身上或某处直接夺取财物，通常涉及面对面的冲突，如抢劫银行或路人。而 “steal” 更侧重于秘密、非暴力的窃取行为，不一定有直接接触。"
    },
    {
      "word_to_compare": "plagiarize",
      "analysis": "“Plagiarize” (剽窃) 是 “steal” 在知识产权语境中的特定形式，专指抄袭文字、思想或创意而不注明来源。它比 “steal” 更学术化、更具体，仅用于智力成果的非法使用，而 “steal” 可用于任何物品或行为的非法占有。"
    },
    {
      "word_to_compare": "pilfer",
      "analysis": "“Pilfer” (偷窃小物) 与 “steal” 意思相近，但语气更轻，通常指偷窃小额、不重要的物品，如办公室文具或零食，带有轻微贬义或滑稽色彩。而 “steal” 是中性通用词，可涵盖从偷钱包到偷创意的各种行为。"
    }
  ]
}