{
  "word": "steer",
  "pronunciation": "stir",
  "concise_definition": "v. 驾驶, 指导, 引导; n. 公牛",
  "forms": {
    "third_person_singular": "steers",
    "past_tense": "steered",
    "past_participle": "steered",
    "present_participle": "steering"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To control the direction of a vehicle, especially by turning a wheel or handle, such as a car, boat, or airplane.",
      "explanation_cn": "指通过转动方向盘、舵柄等装置来控制车辆（如汽车、船或飞机）的行进方向。",
      "example_en": "She steered the car skillfully through the narrow streets.",
      "example_cn": "她娴熟地驾驶汽车穿行于狭窄的街道中。"
    },
    {
      "pos": "verb",
      "explanation_en": "To guide or direct someone or something toward a particular course, goal, or outcome, often in a metaphorical sense.",
      "explanation_cn": "指在比喻意义上引导某人或某事朝特定方向、目标或结果发展，常用于领导、决策或管理语境。",
      "example_en": "The CEO steered the company through a period of financial crisis.",
      "example_cn": "首席执行官带领公司度过了财务危机时期。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to move in a particular direction, often by applying force or influence.",
      "explanation_cn": "指通过施加力量或影响，使某物朝特定方向移动或转变。",
      "example_en": "The media steered public opinion toward support for the new policy.",
      "example_cn": "媒体引导公众舆论支持这项新政策。"
    },
    {
      "pos": "noun",
      "explanation_en": "A castrated male bovine, typically raised for meat; often used in North American English to refer to a young bull.",
      "explanation_cn": "指被阉割的公牛，通常用于肉用；在北美英语中常指年轻的公牛。",
      "example_en": "The rancher sold his steers at the annual livestock auction.",
      "example_cn": "牧场主在年度牲畜拍卖会上卖掉了他的阉牛。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "guide",
      "analysis": "“Guide” (引导) 是一个更广泛、更中性的词，可用于任何类型的指引，包括方向、建议或教育，不一定涉及控制或操纵。而 “steer” 更强调主动掌控方向，常带有较强的主导性和目的性，尤其在驾驶或决策语境中。"
    },
    {
      "word_to_compare": "direct",
      "analysis": "“Direct” (指挥/指导) 更侧重于下达命令或明确指示，常用于组织、项目或人员管理，强调权威性。而 “steer” 更强调通过微妙影响或持续调整来引导，语气更柔和，常用于比喻性语境，如引导舆论或趋势。"
    },
    {
      "word_to_compare": "navigate",
      "analysis": "“Navigate” (航行/应对) 强调在复杂或不确定环境中找到路径，常用于抽象语境（如 navigate a difficult conversation）。它更关注过程中的判断与适应，而 “steer” 更关注对方向的主动控制，常用于有明确操控手段（如方向盘）的情境。"
    }
  ]
}