{
  "word": "stem",
  "pronunciation": "stem",
  "concise_definition": "n. 茎, 柱, 杆; v. 阻止, 阻断, 来自",
  "forms": {
    "third_person_singular": "stems",
    "past_tense": "stemmed",
    "past_participle": "stemmed",
    "present_participle": "stemming"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The main supportive structure of a plant, connecting the roots to the leaves and flowers, through which water and nutrients are transported.",
      "explanation_cn": "植物的主要支撑结构，连接根部与叶和花，负责输送水分和养分。",
      "example_en": "The rose's stem was long and thorny, rising gracefully from the soil.",
      "example_cn": "玫瑰的茎又长又带刺，优雅地从土壤中升起。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slender, shaft-like part of an object that serves as a base or handle, such as the stem of a wine glass or a pipe.",
      "explanation_cn": "指物体中细长如杆的部分，用作基座或手柄，例如酒杯的杯柄或烟斗的烟杆。",
      "example_en": "She held the wine glass by its delicate stem to avoid warming the liquid.",
      "example_cn": "她握住酒杯细长的杯柄，以免手温影响酒液。"
    },
    {
      "pos": "verb",
      "explanation_en": "To stop or slow the progress or growth of something, especially something undesirable, by taking direct action.",
      "explanation_cn": "通过采取直接行动阻止或减缓某事物（尤指不良事物）的进展或增长。",
      "example_en": "The government is trying to stem the flow of illegal immigrants across the border.",
      "example_cn": "政府正试图阻止非法移民跨越边境。"
    },
    {
      "pos": "verb",
      "explanation_en": "To originate or derive from a particular source or cause.",
      "explanation_cn": "指源于或来自某个特定的来源或原因。",
      "example_en": "His interest in science stems from childhood experiments with magnets.",
      "example_cn": "他对科学的兴趣源于童年时对磁铁的实验。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "stalk",
      "analysis": "“Stalk”（茎秆）通常特指植物中较粗壮、直立的茎，尤其用于描述草本植物或谷物的茎，有时带有更具体的形态含义（如“ stalk of corn”）。而 “stem” 更通用，可指植物、酒杯、烟斗等各类细长支撑结构，语义范围更广。"
    },
    {
      "word_to_compare": "halt",
      "analysis": "“Halt”（停止）强调动作的突然中断，常用于物理运动或进程的完全停止，如“halt the car”。而 “stem” 更强调通过干预来减缓或控制趋势的蔓延，常用于抽象或持续性的问题（如疫情、移民），带有“源头控制”的隐喻。"
    },
    {
      "word_to_compare": "originate",
      "analysis": "“Originate”（起源）是中性词，仅表示某事物的来源或开端，不包含因果控制或干预的含义。而 “stem” 在表示“源于”时，常隐含一种因果链条或来源的追溯，语气更书面化，且常用于解释原因（如“stem from a misunderstanding”）。"
    }
  ]
}