{
  "word": "stems",
  "pronunciation": "stemz",
  "concise_definition": "n. 茎, 柄; v. 起源于, 阻止",
  "forms": {
    "singular": "stem",
    "third_person_singular": "stems",
    "past_tense": "stemmed",
    "past_participle": "stemmed",
    "present_participle": "stemming"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The main supportive structure of a plant that connects the roots to the leaves and flowers, transporting water and nutrients.",
      "explanation_cn": "植物的主干结构，连接根部与叶和花，负责输送水分和养分。",
      "example_en": "The sunflower's tall stem held the heavy flower head high above the ground.",
      "example_cn": "向日葵高高的茎将沉重的花盘高高托起，远离地面。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slender part that connects a smaller object to a larger one, such as the handle of a cup or the shaft of a pen.",
      "explanation_cn": "连接较小物体与较大物体的细长部分，如杯子的柄或笔的杆身。",
      "example_en": "She picked up the wine glass by its delicate stem.",
      "example_cn": "她捏着酒杯纤细的杯柄拿起了酒杯。"
    },
    {
      "pos": "verb",
      "explanation_en": "To originate or arise from a particular source or cause; to have a root or origin in something.",
      "explanation_cn": "指源于某种特定来源或原因；以某事物为根源或起因。",
      "example_en": "Many of today's social problems stem from economic inequality.",
      "example_cn": "当今许多社会问题源于经济不平等。"
    },
    {
      "pos": "verb",
      "explanation_en": "To stop or prevent the flow or spread of something, especially by cutting off its source.",
      "explanation_cn": "指通过切断源头来阻止或遏制某物的流动或扩散。",
      "example_en": "The government tried to stem the tide of illegal immigration.",
      "example_cn": "政府试图遏制非法移民的浪潮。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "root",
      "analysis": "“Root” (根) 指事物最根本、最原始的起源，常用于抽象语境中强调深层原因。而 “stem” 作为动词时，更强调从源头上阻止或作为中间连接点，作为名词时则指植物的主干，是根与叶之间的过渡结构，比 “root” 更接近表层。"
    },
    {
      "word_to_compare": "originate",
      "analysis": "“Originate” (起源) 是一个更正式、更抽象的动词，仅表示“从某处开始”，不包含“阻止”或“连接”的含义。而 “stem” 作为动词时，既可表示“源于”，也可表示“阻止”，具有双重语义，且常用于具体或形象化的语境中。"
    },
    {
      "word_to_compare": "handle",
      "analysis": "“Handle” (把手) 通常指便于手持操作的部件，强调功能性与人机交互，多用于工具或容器。而 “stem” 作为名词时，特指细长、脆弱、非主要承重的连接部分，如酒杯柄或花茎，更强调形态和美学特征，而非实用性。"
    }
  ]
}