{
  "word": "step",
  "pronunciation": "step",
  "concise_definition": "n. 步骤, 脚步, 一步; v. 走, 踏, 迈步",
  "forms": {
    "plural": "steps",
    "third_person_singular": "steps",
    "past_tense": "stepped",
    "past_participle": "stepped",
    "present_participle": "stepping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A single movement of the foot when walking or running, involving lifting and placing the foot on the ground.",
      "explanation_cn": "行走或奔跑时脚的一次动作，包括抬起并放回地面。",
      "example_en": "She took a cautious step forward, listening for any sound.",
      "example_cn": "她小心翼翼地向前迈了一步，倾听着任何声响。"
    },
    {
      "pos": "noun",
      "explanation_en": "A stage or phase in a process, sequence, or plan; a specific action taken toward achieving a goal.",
      "explanation_cn": "在过程、序列或计划中的一个阶段或环节；为实现目标而采取的具体行动。",
      "example_en": "The first step to learning a language is mastering pronunciation.",
      "example_cn": "学习一门语言的第一步是掌握发音。"
    },
    {
      "pos": "noun",
      "explanation_en": "A raised platform or flat surface in a series, such as in a staircase or theater, designed for standing or sitting.",
      "explanation_cn": "一系列中抬高的平台或平坦表面，如楼梯或剧院中的台阶，用于站立或就座。",
      "example_en": "He climbed the steps to the podium and began his speech.",
      "example_cn": "他走上讲台的台阶，开始发表演讲。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move by lifting and setting down the foot in walking or running.",
      "explanation_cn": "通过抬起并放下脚来行走或奔跑。",
      "example_en": "The cat stepped quietly across the floor, avoiding the creaky boards.",
      "example_cn": "猫悄无声息地走过地板，避开了吱呀作响的木板。"
    },
    {
      "pos": "verb",
      "explanation_en": "To take a particular action or make a decision as part of a process or plan.",
      "explanation_cn": "作为过程或计划的一部分采取特定行动或做出决定。",
      "example_en": "The government has stepped in to stabilize the economy.",
      "example_cn": "政府已介入以稳定经济。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "stage",
      "analysis": "“Stage”（阶段）强调发展或过程中的一个完整部分，通常具有明确的起止和特征，常用于抽象过程（如项目阶段、人生阶段）。而 “step” 更侧重于具体的、可操作的行动单元，常用于序列性任务中，更强调动作的连续性和可执行性。"
    },
    {
      "word_to_compare": "stride",
      "analysis": "“Stride”（大步）指跨出较长、有力的步伐，强调步幅和速度，常带有自信或果断的意味。而 “step” 是中性词，泛指任何大小的脚部动作，不带情感色彩，适用范围更广。"
    },
    {
      "word_to_compare": "move",
      "analysis": "“Move”（移动）是更宽泛的词，可指身体任何部位的位移，或抽象意义上的行动（如政治举措）。而 “step” 在作动词时特指用脚移动，作名词时更常用于指计划中的一个具体、有目的的行动，比 “move” 更具结构性和序列性。"
    }
  ]
}