{
  "word": "steroids",
  "pronunciation": "steh·roidz",
  "concise_definition": "n. 类固醇, 激素类药物",
  "forms": {
    "singular": "steroid"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A class of organic compounds characterized by a molecular structure of four fused rings, including hormones such as testosterone and cortisol, which regulate various physiological processes like metabolism, immune function, and sexual development.",
      "explanation_cn": "一类具有四个融合环状结构的有机化合物，包括睾酮和皮质醇等激素，用于调节新陈代谢、免疫功能和性发育等多种生理过程。",
      "example_en": "Corticosteroids are often prescribed to reduce inflammation in autoimmune diseases.",
      "example_cn": "皮质类固醇常被用于治疗自身免疫性疾病以减轻炎症。"
    },
    {
      "pos": "noun",
      "explanation_en": "Synthetic substances designed to mimic the effects of male sex hormones (androgens), commonly used by athletes to enhance muscle mass, strength, and performance, often illegally and with serious health risks.",
      "explanation_cn": "人工合成的物质，旨在模拟雄性性激素（雄激素）的作用，常被运动员非法使用以增强肌肉质量、力量和运动表现，但伴随严重的健康风险。",
      "example_en": "The athlete was banned for testing positive for anabolic steroids.",
      "example_cn": "该运动员因检测出含有合成类固醇而被禁赛。"
    },
    {
      "pos": "noun",
      "explanation_en": "Medications used in dermatology and other fields to treat conditions such as eczema, asthma, and allergic reactions by suppressing the immune system or reducing inflammation.",
      "explanation_cn": "用于皮肤病学及其他领域治疗湿疹、哮喘和过敏反应的药物，通过抑制免疫系统或减轻炎症发挥作用。",
      "example_en": "Topical steroid creams are effective for relieving itchy skin caused by eczema.",
      "example_cn": "外用类固醇药膏对缓解湿疹引起的皮肤瘙痒非常有效。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hormones",
      "analysis": "“Hormones”（激素）是体内自然分泌的化学信使，调节生长、代谢、情绪等多种功能，范围广泛，包括胰岛素、甲状腺素等。而 “steroids” 是激素的一个子类，特指具有特定四环化学结构的激素，如性激素和皮质醇。所有类固醇都是激素，但并非所有激素都是类固醇。"
    },
    {
      "word_to_compare": "supplements",
      "analysis": "“Supplements”（营养补充剂）泛指用于补充饮食中缺失营养素的物质，如维生素、蛋白质粉等，通常合法且副作用较小。而 “steroids” 是强效药物，不属于营养补充范畴，滥用会导致严重健康问题，如肝损伤、心血管疾病和心理依赖。"
    },
    {
      "word_to_compare": "drugs",
      "analysis": "“Drugs”（药物）是广义术语，涵盖所有用于治疗、预防或诊断疾病的化学物质，包括抗生素、止痛药等。而 “steroids” 是特定类型的药物，具有明确的化学结构和生理作用机制，常因滥用被单独分类和监管。"
    }
  ]
}