{
  "word": "stereo",
  "pronunciation": "stehr·ee·oh",
  "concise_definition": "n. 立体声系统, 立体声的; adj. 立体声的",
  "forms": {
    "plural": "stereos"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A system or device that reproduces sound using two or more speakers to create the illusion of sound coming from different directions, enhancing spatial depth and realism.",
      "explanation_cn": "指使用两个或多个扬声器重现声音，以制造声音来自不同方向的错觉，从而增强空间感和真实感的音响系统或设备。",
      "example_en": "He bought a new stereo for his living room to enjoy high-quality music.",
      "example_cn": "他为客厅买了一套新的立体声系统，以享受高品质的音乐。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or producing sound in stereo, where separate audio signals are delivered to left and right channels to simulate natural hearing.",
      "explanation_cn": "指与立体声相关或能产生立体声的，即通过左右声道分别传输独立的音频信号，以模拟自然听觉体验。",
      "example_en": "The concert was recorded in stereo for a more immersive listening experience.",
      "example_cn": "这场音乐会以立体声录制，以提供更具沉浸感的聆听体验。"
    },
    {
      "pos": "noun",
      "explanation_en": "A stereotypical or overly simplistic mental image of a person or thing, often used in the phrase 'stereotype' (though 'stereo' alone is a shortened form in informal usage).",
      "explanation_cn": "指对人或事物的一种刻板、过于简化的心理印象（在非正式语境中，'stereo' 是 'stereotype' 的缩略形式）。",
      "example_en": "The movie perpetuates the stereo of the nerdy scientist with glasses and a lab coat.",
      "example_cn": "这部电影延续了戴眼镜、穿白大褂的书呆子科学家的刻板印象。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "surround",
      "analysis": "“Surround”（环绕声）是一种更高级的音频系统，通常使用五个或更多扬声器，从多个方向包围听众，创造三维声场。而 “stereo” 仅使用两个声道（左/右），空间感较有限，但更简单、普及。"
    },
    {
      "word_to_compare": "mono",
      "analysis": "“Mono”（单声道）指所有声音通过单一通道播放，缺乏左右声场的分离感，声音显得平面化。而 “stereo” 通过双声道提供方向感和空间层次，听觉体验更丰富、自然。"
    },
    {
      "word_to_compare": "stereotype",
      "analysis": "“Stereotype”（刻板印象）是完整术语，指对某群体或事物的固定、过度简化的看法；“stereo” 作为其口语缩略形式，在非正式语境中可指代该含义，但单独使用时更常指音响系统，需依赖语境判断。"
    }
  ]
}