{
  "word": "sterilization",
  "pronunciation": "stuh·ruh·luh·zey·shun",
  "concise_definition": "n. 消毒, 灭菌, 绝育",
  "forms": {
    "plural": "sterilizations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of completely eliminating all forms of microbial life, including bacteria, viruses, fungi, and spores, from an object, surface, or environment, typically using heat, chemicals, or radiation.",
      "explanation_cn": "指通过热力、化学物质或辐射等手段彻底消除物体、表面或环境中所有微生物（包括细菌、病毒、真菌和孢子）的生命活动的过程。",
      "example_en": "Surgical instruments must undergo sterilization before use to prevent infection.",
      "example_cn": "手术器械在使用前必须经过灭菌处理，以防止感染。"
    },
    {
      "pos": "noun",
      "explanation_en": "The medical procedure of rendering a person or animal incapable of reproducing, often through surgical removal or blocking of reproductive organs.",
      "explanation_cn": "指通过外科手术切除或阻断生殖器官，使人类或动物丧失繁殖能力的医疗程序。",
      "example_en": "The government implemented a policy of compulsory sterilization in the 1970s, which was later widely condemned.",
      "example_cn": "20世纪70年代，政府实施了强制绝育政策，后遭到广泛谴责。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process of making something free from contamination or impurities, especially in food processing or laboratory settings.",
      "explanation_cn": "指在食品加工或实验室环境中，使某物免受污染或杂质影响的过程，常用于保持无菌环境。",
      "example_en": "Sterilization of the lab equipment ensured that the culture remained uncontaminated.",
      "example_cn": "对实验室设备的灭菌确保了培养物未受污染。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "disinfection",
      "analysis": "“Disinfection”（消毒）仅指减少或消除病原微生物，但不一定能杀死所有微生物（如孢子），常用于日常环境清洁；而 “sterilization” 是更彻底的过程，要求完全消灭所有生命形式，多用于医疗和实验室等高要求场景。"
    },
    {
      "word_to_compare": "decontamination",
      "analysis": "“Decontamination”（去污）泛指清除有害物质（包括化学、放射性或生物性污染物），范围更广，不局限于生物体；而 “sterilization” 专指消灭生物性微生物，目标更精确、更严格。"
    },
    {
      "word_to_compare": "castration",
      "analysis": "“Castration”（阉割）特指移除雄性动物的睾丸，是绝育的一种具体手段；而 “sterilization” 是更广义的术语，包括结扎、切除子宫等男女均可使用的绝育方法，不限于外科切除。"
    }
  ]
}