{
  "word": "stewart",
  "pronunciation": "stoo·er",
  "concise_definition": "n. 管家, 总管; (历史)苏格兰王室姓氏",
  "forms": {
    "plural": "stewards"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person employed to manage the affairs of a household, estate, or organization, especially one responsible for overseeing servants, finances, and daily operations.",
      "explanation_cn": "指受雇管理家庭、庄园或组织事务的人，尤其负责监督仆人、财务和日常运作。",
      "example_en": "The stewart arranged the banquet and ensured all guests were properly attended to.",
      "example_cn": "管家安排了宴会，并确保所有宾客都得到了妥善接待。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who manages the affairs of a public event, such as a ship, train, or aircraft, often responsible for passenger service and safety.",
      "explanation_cn": "指负责管理公共活动（如船舶、火车或飞机）事务的人，通常负责乘客服务与安全。",
      "example_en": "The flight steward offered drinks and checked seatbelts before takeoff.",
      "example_cn": "空乘人员在起飞前提供饮料并检查安全带。"
    },
    {
      "pos": "noun",
      "explanation_en": "A surname historically associated with the royal house of Scotland, from which the British monarchy descended; also used as a family name in English-speaking countries.",
      "explanation_cn": "指历史上与苏格兰王室相关的姓氏，英国王室即由此传承；亦作为英语国家中的家族姓氏使用。",
      "example_en": "The Stewart dynasty ruled Scotland and later England from the 14th to the 17th century.",
      "example_cn": "斯图亚特王朝从14世纪到17世纪统治苏格兰，后统治英格兰。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "butler",
      "analysis": "“Butler”（男管家）通常指在贵族或富裕家庭中负责餐厅、酒类和正式服务的高级仆人，地位较高且更侧重礼仪与餐饮管理；而 “steward” 范围更广，可涵盖家庭、船舶、航空等多种管理角色，不一定局限于贵族家庭。"
    },
    {
      "word_to_compare": "manager",
      "analysis": "“Manager”（经理）是一个更通用的商业术语，指负责组织、计划和监督工作的人员，常用于企业或部门层面；“steward” 则更强调服务性、执行性职责，尤其在传统或非企业环境中使用，如船上或活动中。"
    },
    {
      "word_to_compare": "caretaker",
      "analysis": "“Caretaker”（看管人）主要指负责照看财产、建筑或动物的人，职责偏重于维护和看守，而非管理事务或服务他人；而 “steward” 的职责更主动，包括组织、协调和提供服务，具有更强的管理职能。"
    }
  ]
}