{
  "word": "steward",
  "pronunciation": "stoo·uhrd",
  "concise_definition": "n. 乘务员, 管理人, 监督者",
  "forms": {
    "plural": "stewards"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person responsible for managing or overseeing the welfare, comfort, or affairs of others, especially on an airplane, ship, or train.",
      "explanation_cn": "指负责管理或监督他人福祉与舒适度的人，尤指在飞机、轮船或火车上提供服务的乘务员。",
      "example_en": "The flight steward ensured all passengers were seated and wearing their seatbelts before takeoff.",
      "example_cn": "航班乘务员在起飞前确保所有乘客都已就座并系好安全带。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who manages or administers resources, property, or affairs on behalf of others, often with a sense of responsibility and ethical care.",
      "explanation_cn": "指代表他人管理资源、财产或事务的人，常带有责任感和道德关怀的意味。",
      "example_en": "As a steward of the environment, she advocated for sustainable practices in her community.",
      "example_cn": "作为环境的守护者，她倡导社区采用可持续的做法。"
    },
    {
      "pos": "noun",
      "explanation_en": "A man who serves at a formal event, such as a banquet or wedding, often responsible for serving food and drink and ensuring smooth operations.",
      "explanation_cn": "指在正式活动（如宴会或婚礼）中提供服务的男性，通常负责上菜、斟酒并确保活动顺利进行。",
      "example_en": "The wedding stewards guided guests to their tables and distributed programs with precision.",
      "example_cn": "婚礼侍者精准地引导宾客入座并分发节目单。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "attendant",
      "analysis": "“Attendant”（服务员/陪同者）泛指任何提供服务或陪伴的人，范围更广，可指医院护工、停车场管理员等，不强调管理或责任。而 “steward” 更侧重于对人、资源或环境的主动管理与照护，常带有更高层次的责任感。"
    },
    {
      "word_to_compare": "manager",
      "analysis": "“Manager”（管理者）通常指在组织或企业中拥有正式职权、负责决策和绩效的人，强调权威与控制。而 “steward” 更强调服务性、守护性和道德义务，不一定拥有正式权力，常用于非营利或伦理语境中。"
    },
    {
      "word_to_compare": "caretaker",
      "analysis": "“Caretaker”（看护者）主要指照看某物（如房屋、动物）或某人（如病人）以防止其受损或忽视，侧重于被动保护。而 “steward” 不仅是保护，更包含积极管理、优化和提升的含义，常用于资源、环境或公共利益的长期维护。"
    }
  ]
}