{
  "word": "sticks",
  "pronunciation": "stikz",
  "concise_definition": "n. 棍子, 木棒; v. 粘贴, 坚持, 插入",
  "forms": {
    "singular": "stick",
    "third_person_singular": "sticks",
    "past_tense": "stuck",
    "past_participle": "stuck",
    "present_participle": "sticking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long, thin piece of wood or other rigid material, typically used as a tool, weapon, or support.",
      "explanation_cn": "一根长而细的木头或其他坚硬材料，通常用作工具、武器或支撑物。",
      "example_en": "The children gathered sticks to build a campfire.",
      "example_cn": "孩子们捡来木棍生篝火。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, thin piece of food, such as a carrot stick or potato stick, often served as a snack.",
      "explanation_cn": "一种小而细长的食物，如胡萝卜条或土豆条，常作为零食食用。",
      "example_en": "She dipped the carrot sticks into hummus for a healthy snack.",
      "example_cn": "她把胡萝卜条蘸着鹰嘴豆泥当健康零食吃。"
    },
    {
      "pos": "verb",
      "explanation_en": "To adhere or become fixed to a surface, often due to stickiness or pressure.",
      "explanation_cn": "因黏性或压力而附着或固定在表面上。",
      "example_en": "The glue made the paper stick to the table.",
      "example_cn": "胶水让纸粘在了桌子上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To continue to support or remain loyal to a person, cause, or decision despite difficulties.",
      "explanation_cn": "尽管遇到困难，仍坚持支持某人、某事业或某个决定。",
      "example_en": "Even when things got tough, she stuck with her team.",
      "example_cn": "即使情况变得艰难，她仍然坚持支持她的团队。"
    },
    {
      "pos": "verb",
      "explanation_en": "To insert or push something firmly into a surface or position.",
      "explanation_cn": "将某物牢固地插入或推入某表面或位置。",
      "example_en": "He stuck a pin into the map to mark the location.",
      "example_cn": "他把一枚图钉插进地图，标记出位置。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rod",
      "analysis": "“Rod”（杆）通常指更坚硬、更均匀、常用于工业或钓鱼等专业用途的细长金属或合成材料制品，强调结构强度和功能性；而 “stick” 更口语化，多指天然、不规则的木棍，常用于日常或非正式语境。"
    },
    {
      "word_to_compare": "bar",
      "analysis": "“Bar”（条、棒）通常指较粗、较厚、形状规则的固体物，如巧克力棒、金属条，强调其块状和可分割性；而 “stick” 更细长、更轻，常用于手持或临时用途，如木棍、冰棒。"
    },
    {
      "word_to_compare": "adhere",
      "analysis": "“Adhere”（粘附）是正式术语，强调物理或抽象上的牢固附着，常用于科学、医学或法律语境；而 “stick” 更口语化，涵盖从物理黏附到情感坚持的广泛含义，语义更灵活、更生活化。"
    }
  ]
}