{
  "word": "stiff",
  "pronunciation": "stif",
  "concise_definition": "adj. 僵硬的, 刻板的, 拘谨的; n. 尸体; v. 拖欠, 拒付",
  "forms": {
    "comparative": "stiffer",
    "superlative": "stiffest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Not flexible or able to bend easily; rigid in physical structure or movement.",
      "explanation_cn": "指在物理结构或动作上缺乏柔韧性，难以弯曲或移动。",
      "example_en": "The mattress was so stiff that I couldn't sleep comfortably.",
      "example_cn": "这张床垫太硬了，我睡得不舒服。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Formal, unnatural, or lacking in ease and spontaneity, especially in behavior or expression.",
      "explanation_cn": "形容行为或表达方式过于正式、不自然，缺乏轻松和自发性。",
      "example_en": "His stiff smile didn't fool anyone at the party.",
      "example_cn": "他在派对上僵硬的微笑并没有骗过任何人。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Unwilling to compromise or change; inflexible in attitude or opinion.",
      "explanation_cn": "指态度或观点上不愿妥协或改变，固执僵化。",
      "example_en": "She gave a stiff refusal to the proposal, leaving no room for negotiation.",
      "example_cn": "她断然拒绝了这项提议，不留任何协商余地。"
    },
    {
      "pos": "noun",
      "explanation_en": "A dead body, especially one that is to be buried or examined.",
      "explanation_cn": "指尸体，尤指准备下葬或接受检查的尸体。",
      "example_en": "The coroner examined the stiff at the crime scene.",
      "example_cn": "法医在犯罪现场检查了尸体。"
    },
    {
      "pos": "verb",
      "explanation_en": "To refuse to pay for something, especially a bill or debt, often deliberately or dishonestly.",
      "explanation_cn": "故意或不诚实拒绝支付账单或债务。",
      "example_en": "He stiffed the waiter by walking out without paying his share.",
      "example_cn": "他没付自己的那份账就走了，赖了服务员的小费。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rigid",
      "analysis": "“Rigid”（僵硬的）强调结构或规则上的绝对不可变性，常用于制度、规则或身体的物理状态，语气更正式、更绝对。而 “stiff” 更常用于描述身体的不灵活或态度的不自然，语气更口语化，有时带有轻微贬义。"
    },
    {
      "word_to_compare": "formal",
      "analysis": "“Formal”（正式的）仅指符合礼仪或规范，不一定带有不自然或僵硬的负面含义。而 “stiff” 在描述行为时，常暗示因过度拘谨而导致的不自在或缺乏真诚，带有情感上的距离感。"
    },
    {
      "word_to_compare": "dead",
      "analysis": "“Dead”（死的）是描述生命状态的中性词，而 “stiff” 作为名词时特指尸体，常用于口语或文学语境，带有更具体、更形象的视觉联想（如尸体僵硬的状态），语义更生动、更具场景感。"
    }
  ]
}