{
  "word": "stimulate",
  "pronunciation": "stim·yuh·leyt",
  "concise_definition": "v. 刺激, 激发, 促进",
  "forms": {
    "third_person_singular": "stimulates",
    "past_tense": "stimulated",
    "past_participle": "stimulated",
    "present_participle": "stimulating"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To encourage or incite a reaction, activity, or process, often by providing a trigger or incentive that prompts increased energy, interest, or output.",
      "explanation_cn": "指通过提供刺激、诱因或触发因素，促使某种反应、活动或过程发生或增强，通常表现为提高能量、兴趣或产出。",
      "example_en": "The teacher used interactive games to stimulate students' interest in history.",
      "example_cn": "老师通过互动游戏激发了学生对历史的兴趣。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a physiological or biological response in an organ, tissue, or system, such as increasing blood flow, nerve activity, or metabolic rate.",
      "explanation_cn": "指引起器官、组织或系统的生理或生物反应，例如增加血流、神经活动或新陈代谢速率。",
      "example_en": "Caffeine stimulates the central nervous system, making people feel more alert.",
      "example_cn": "咖啡因刺激中枢神经系统，使人感觉更清醒。"
    },
    {
      "pos": "verb",
      "explanation_en": "To promote economic or industrial growth by encouraging investment, consumption, or innovation.",
      "explanation_cn": "指通过鼓励投资、消费或创新来促进经济或工业增长。",
      "example_en": "The government introduced tax breaks to stimulate small business development.",
      "example_cn": "政府推出了税收减免政策以促进中小企业发展。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "encourage",
      "analysis": "“Encourage” (鼓励) 更侧重于通过支持、安慰或正面激励来增强某人的信心或意愿，语气较温和，常用于情感或行为层面。而 “stimulate” 更强调通过外部刺激引发直接反应或生理/功能变化，更具主动性与物理性。"
    },
    {
      "word_to_compare": "prompt",
      "analysis": "“Prompt” (促使) 指通过直接的信号或原因引发某种行为或反应，通常更即时、更具体，常用于指令或触发机制。而 “stimulate” 的刺激作用可能更持续、更广泛，常涉及系统性或长期性的激活，如刺激经济或大脑活动。"
    },
    {
      "word_to_compare": "activate",
      "analysis": "“Activate” (激活) 强调使原本处于休眠或关闭状态的事物开始运作，常用于技术或机械语境（如激活账户、激活免疫系统）。而 “stimulate” 更强调在已运作的基础上增强其强度、频率或效率，不一定是从零开始。"
    }
  ]
}