{
  "word": "stimulated",
  "pronunciation": "stim·yuh·leyt·id",
  "concise_definition": "adj. 被激发的, 被刺激的; v. 激发, 刺激（动词 stimulate 的过去式和过去分词）",
  "forms": {
    "base_form": "stimulate",
    "third_person_singular": "stimulates",
    "past_tense": "stimulated",
    "past_participle": "stimulated",
    "present_participle": "stimulating",
    "noun_form": "stimulation"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To encourage or incite a reaction, activity, or process, often by introducing a stimulus that prompts increased function or response.",
      "explanation_cn": "通过引入某种刺激物来促使某种反应、活动或过程发生，通常用于激发功能增强或响应行为。",
      "example_en": "The new tax incentives stimulated investment in renewable energy.",
      "example_cn": "新的税收激励措施刺激了对可再生能源的投资。"
    },
    {
      "pos": "verb",
      "explanation_en": "To arouse interest, curiosity, or emotional response in someone, often through engaging content or experience.",
      "explanation_cn": "通过引人入胜的内容或体验，激发某人的兴趣、好奇心或情感反应。",
      "example_en": "The teacher used interactive games to stimulate the students' curiosity about science.",
      "example_cn": "老师用互动游戏激发了学生对科学的好奇心。"
    },
    {
      "pos": "verb",
      "explanation_en": "In physiology, to activate a nerve, muscle, or organ to produce a response, such as increased heartbeat or muscle contraction.",
      "explanation_cn": "在生理学中，指激活神经、肌肉或器官以产生反应，如心跳加快或肌肉收缩。",
      "example_en": "The doctor stimulated the patient's nerves with a mild electrical current.",
      "example_cn": "医生用微弱的电流刺激了患者的神经。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "encourage",
      "analysis": "“Encourage”（鼓励）侧重于通过支持、安慰或正面激励来促进某种行为，语气更温和、情感性更强，常用于人际关系或心理层面。而 “stimulated” 更强调通过外部刺激物引发直接、可观察的反应，常用于生理、经济或技术语境。"
    },
    {
      "word_to_compare": "trigger",
      "analysis": "“Trigger”（触发）强调一个明确的、有时是突然的因果关系，常用于负面或紧急情境（如触发警报、触发创伤反应）。“Stimulated” 则更中性或积极，暗示一种持续或可控制的激发过程，而非瞬间爆发。"
    },
    {
      "word_to_compare": "motivate",
      "analysis": "“Motivate”（激励）通常指激发内在动力或意愿，强调主观驱动力（如目标、价值观）。“Stimulated” 更侧重于外部因素引起的反应，不一定涉及内在动机。例如，广告可以刺激消费，但未必真正激励消费者认同产品。"
    }
  ]
}