{
  "word": "stimulus",
  "pronunciation": "stim·yuh·luhs",
  "concise_definition": "n. 刺激, 刺激物, 激励因素",
  "forms": {
    "plural": "stimuli"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A thing or event that causes a response or reaction, especially in biological, psychological, or economic contexts, by activating a system or triggering a change.",
      "explanation_cn": "指在生物、心理或经济等语境中，能够引发反应或行为变化的外部事物或事件，通过激活某种系统来触发响应。",
      "example_en": "The bright light served as a stimulus for the pupil to contract.",
      "example_cn": "强光促使瞳孔收缩，起到了刺激作用。"
    },
    {
      "pos": "noun",
      "explanation_en": "An economic measure, such as government spending or tax cuts, designed to boost activity and growth in an economy.",
      "explanation_cn": "指政府为促进经济活动和增长而采取的措施，如财政支出增加或减税，旨在激发消费和投资。",
      "example_en": "The government introduced a $1 trillion stimulus package to revive the post-pandemic economy.",
      "example_cn": "政府推出了1万亿美元的经济刺激计划，以振兴疫情后的经济。"
    },
    {
      "pos": "noun",
      "explanation_en": "A psychological or sensory input that prompts a behavioral or neurological response, often used in experiments to study learning or perception.",
      "explanation_cn": "指在心理学或神经科学实验中，用以引发行为或神经反应的感官输入或心理提示，常用于研究学习或感知机制。",
      "example_en": "In the experiment, the sound of a bell was used as a stimulus to condition the dogs' salivation.",
      "example_cn": "在实验中，铃声被用作刺激，以条件化狗的唾液分泌反应。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "trigger",
      "analysis": "“Trigger” (触发器) 强调直接引发某种反应或事件的瞬间性动作或条件，常用于描述因果关系中的“导火索”。它更侧重于“启动”机制，而 “stimulus” 更广泛，可指持续或反复作用的激励因素，不一定具有突发性。"
    },
    {
      "word_to_compare": "incentive",
      "analysis": "“Incentive” (激励) 通常指人为设计的奖励或诱因，用于鼓励特定行为，尤其在经济或管理语境中，带有明确目的性（如奖金、优惠）。而 “stimulus” 可以是自然或客观存在的，不一定包含奖励意图，如光线、声音等物理刺激。"
    },
    {
      "word_to_compare": "prompt",
      "analysis": "“Prompt” (提示) 多用于语言、行为或技术系统中，指一种温和的提醒或引导，帮助某人采取行动。它常带有辅助性、非强制性，而 “stimulus” 更强调生理或系统层面的直接激活作用，反应更本能或自动化。"
    }
  ]
}