{
  "word": "sting",
  "pronunciation": "sting",
  "concise_definition": "n. 刺痛, 针刺感; v. 刺, 使疼痛, 使感到痛苦",
  "forms": {
    "third_person_singular": "stings",
    "past_tense": "stung",
    "past_participle": "stung",
    "present_participle": "stinging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sharp, sudden pain caused by an insect bite or venomous touch, often accompanied by inflammation or irritation.",
      "explanation_cn": "由昆虫叮咬或毒液接触引起的尖锐、突然的疼痛，常伴随红肿或刺激感。",
      "example_en": "The bee's sting left a swollen, itchy mark on her arm.",
      "example_cn": "蜜蜂的蜇刺在她手臂上留下了一个肿胀发痒的痕迹。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sharp, bitter, or resentful feeling, often caused by criticism, betrayal, or disappointment.",
      "explanation_cn": "一种尖锐、苦涩或怨恨的情绪，通常由批评、背叛或失望引起。",
      "example_en": "There was a sting of jealousy in her voice when she mentioned his success.",
      "example_cn": "当她提到他的成功时，语气中带着一丝嫉妒的刺痛。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pierce or wound with a sharp organ, especially as done by insects or marine animals, often injecting venom.",
      "explanation_cn": "用尖锐器官刺入或伤害，尤指昆虫或海洋生物所为，常伴随毒液注入。",
      "example_en": "The wasp stung him on the hand while he was gardening.",
      "example_cn": "他在园艺时，黄蜂在手上蜇了他一下。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a sharp, unpleasant emotional reaction, such as shame, regret, or anger.",
      "explanation_cn": "引起一种尖锐而不愉快的情绪反应，如羞愧、懊悔或愤怒。",
      "example_en": "His harsh words stung her deeply, even though he didn't mean to hurt her.",
      "example_cn": "他刻薄的话深深刺伤了她，尽管他本无意伤害她。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bite",
      "analysis": "“Bite”（咬）通常指用牙齿或类似结构夹住或撕裂，多用于动物或人类的攻击行为，强调物理性的咬合动作。而 “sting” 特指通过毒刺或毒腺注入毒液造成的疼痛，多用于昆虫、水母等，强调化学性伤害和刺痛感。"
    },
    {
      "word_to_compare": "pain",
      "analysis": "“Pain”（疼痛）是泛指身体或心理上的不适感，范围广泛，可轻可重，无特定成因。而 “sting” 是一种特定类型的疼痛——尖锐、短暂、局部，常带有突然性和情绪上的刺痛感，更具象且富有情感色彩。"
    },
    {
      "word_to_compare": "lash",
      "analysis": "“Lash”（抽打、责骂）可作动词指用鞭子抽打，或用言语猛烈抨击；作名词时指鞭子或愤怒的言语。它强调的是猛烈、连续的打击，而 “sting” 更强调瞬间、集中、深入的刺痛，无论是生理还是心理层面，都更细微、更私密。"
    }
  ]
}