{
  "word": "stings",
  "pronunciation": "stings",
  "concise_definition": "n. 刺痛, 针刺感; v. 刺痛, 使痛苦, 使懊恼",
  "forms": {
    "singular": "sting",
    "third_person_singular": "stings",
    "past_tense": "stung",
    "past_participle": "stung",
    "present_participle": "stinging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sharp, painful sensation caused by an insect bite or contact with a venomous organism, such as a bee, wasp, or jellyfish.",
      "explanation_cn": "由昆虫叮咬或接触有毒生物（如蜜蜂、黄蜂或水母）引起的尖锐刺痛感。",
      "example_en": "The bee's sting left a red, swollen mark on her arm.",
      "example_cn": "蜜蜂的蜇刺在她手臂上留下了一个红肿的痕迹。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sharp, emotionally painful remark or experience that causes distress or humiliation.",
      "explanation_cn": "一句尖锐、令人痛苦的言语或经历，引发困扰或羞辱感。",
      "example_en": "His cruel comment was a bitter sting to her self-esteem.",
      "example_cn": "他那句刻薄的话对她自尊心造成了沉重的打击。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a sharp, burning pain, typically by touching or being bitten by a venomous creature.",
      "explanation_cn": "通过接触或被有毒生物叮咬而引起尖锐的灼痛感。",
      "example_en": "The jellyfish stung him as he swam near the shore.",
      "example_cn": "当他靠近岸边游泳时，水母蜇了他。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause emotional pain or distress through a harsh remark, criticism, or unfair situation.",
      "explanation_cn": "通过严厉的言辞、批评或不公平的处境引起情感上的痛苦或困扰。",
      "example_en": "The review stung because it pointed out flaws he had ignored.",
      "example_cn": "这篇评论令人难受，因为它指出了他一直忽视的缺陷。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bite",
      "analysis": "“Bite”（咬）通常指动物用牙齿造成的物理伤害，强调的是咬合动作和撕裂感，如狗咬、蚊子咬。而 “sting” 特指通过毒刺或毒腺注入毒素引起的刺痛，多见于昆虫或海洋生物，带有化学性伤害的特征。"
    },
    {
      "word_to_compare": "pain",
      "analysis": "“Pain”（疼痛）是广义的不适感，涵盖所有类型的生理或心理痛苦。而 “sting” 是一种特定类型的疼痛——短暂、尖锐、局部，常伴随突然性和情绪冲击，更强调瞬间的、令人不快的刺激。"
    },
    {
      "word_to_compare": "wound",
      "analysis": "“Wound”（伤口）指身体组织的结构性损伤，通常有开放性创口，愈合周期较长。而 “sting” 通常是表皮或神经末梢的短暂刺激，不造成明显组织破坏，更多是感觉层面的反应，而非器质性损伤。"
    }
  ]
}