{
  "word": "stirring",
  "pronunciation": "stur·ing",
  "concise_definition": "adj. 激励人心的, 动人的; v. 搅动, 激起",
  "forms": {
    "base_form": "stir",
    "third_person_singular": "stirs",
    "past_tense": "stirred",
    "past_participle": "stirred",
    "present_participle": "stirring"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Evoking strong emotions, especially inspiration, patriotism, or determination; deeply moving and uplifting.",
      "explanation_cn": "激发强烈情感，尤其是激励、爱国情怀或决心；感人至深且鼓舞人心的。",
      "example_en": "The president delivered a stirring speech that moved the entire nation.",
      "example_cn": "总统发表了一篇感人至深的演讲，激励了整个国家。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Causing agitation or excitement, often in a political or social context; inciting action or passion.",
      "explanation_cn": "在政治或社会语境中引发动荡或激动，常指激起行动或热情。",
      "example_en": "The stirring protests against injustice drew thousands to the streets.",
      "example_cn": "反对不公的激昂抗议吸引了成千上万人走上街头。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or cause to move in a circular or mixing motion, typically with a spoon or similar object.",
      "explanation_cn": "用勺子或其他类似工具以圆形或搅拌的方式移动或使某物移动。",
      "example_en": "She stirred the soup gently to blend the flavors.",
      "example_cn": "她轻轻搅拌汤，使味道融合。"
    },
    {
      "pos": "verb",
      "explanation_en": "To arouse or provoke a feeling, memory, or reaction, especially an emotional one.",
      "explanation_cn": "激起、唤起某种情感、记忆或反应，尤指情感上的反应。",
      "example_en": "The old photograph stirred memories of her childhood.",
      "example_cn": "那张旧照片唤起了她对童年的回忆。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "inspiring",
      "analysis": "“Inspiring” (鼓舞人心的) 更侧重于激发积极的动机、希望或创造力，语气通常更温和、持久。而 “stirring” 更强调情感的强烈波动和即时的震撼力，常用于演讲、音乐或抗议等具有强烈感染力的场合。"
    },
    {
      "word_to_compare": "moving",
      "analysis": "“Moving” (感人的) 强调引发悲伤、同情或温情等细腻情感，常用于艺术、文学或个人故事中。而 “stirring” 更偏向于激发斗志、激情或集体行动，情感更外放、更具号召力。"
    },
    {
      "word_to_compare": "agitate",
      "analysis": "“Agitate” (煽动) 通常带有负面含义，指故意激起不满或混乱，常用于政治操控或社会骚乱。而 “stirring” 作为动词时，可以是中性或正面的，如激起热情或回忆，语义范围更广，情感色彩更丰富。"
    }
  ]
}