{
  "word": "stir",
  "pronunciation": "stur",
  "concise_definition": "v. 搅拌, 激起, 动荡; n. 搅动, 骚动",
  "forms": {
    "third_person_singular": "stirs",
    "past_tense": "stirred",
    "past_participle": "stirred",
    "present_participle": "stirring"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move a liquid or mixture around in a circular motion, typically with a spoon or other object, to combine ingredients or distribute heat evenly.",
      "explanation_cn": "用勺子或其他工具以圆形动作搅动液体或混合物，以使成分混合均匀或热量分布均匀。",
      "example_en": "She stirred the soup gently to prevent it from burning.",
      "example_cn": "她轻轻搅拌汤，以免烧焦。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a feeling, emotion, or reaction to arise, often unexpectedly or strongly; to provoke or excite.",
      "explanation_cn": "引起某种情感、情绪或反应，通常带有意外性或强烈性；激发或煽动。",
      "example_en": "His speech stirred deep emotions among the audience.",
      "example_cn": "他的演讲激起了听众内心深处的情感。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause unrest, disturbance, or agitation in a group or society, often by inciting action or controversy.",
      "explanation_cn": "在群体或社会中引起不安、骚动或动荡，通常通过煽动行动或争议。",
      "example_en": "The protest leader was accused of stirring up trouble in the neighborhood.",
      "example_cn": "这位抗议领袖被指控在社区中煽动事端。"
    },
    {
      "pos": "noun",
      "explanation_en": "A movement or disturbance, especially one that causes excitement, agitation, or public attention.",
      "explanation_cn": "一种移动或扰动，尤指引起兴奋、骚动或公众关注的事件。",
      "example_en": "There was a stir in the crowd when the celebrity appeared.",
      "example_cn": "当这位名人出现时，人群中一阵骚动。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mix",
      "analysis": "“Mix” (混合) 强调将两种或多种物质结合成一个整体，结果通常是均匀的，不强调动作过程。而 “stir” 更侧重于搅拌的动作本身，不一定导致完全融合，有时仅用于使成分分布均匀或防止沉淀。"
    },
    {
      "word_to_compare": "agitate",
      "analysis": "“Agitate” (煽动/使不安) 与 “stir” 在表示“激起情绪或骚动”时意义接近，但 “agitate” 更正式、更强烈，常用于政治或社会运动语境，带有明确的意图性；而 “stir” 更口语化，适用范围更广，可指轻微的情绪波动或日常的骚动。"
    },
    {
      "word_to_compare": "rouse",
      "analysis": "“Rouse” (唤醒/激起) 通常指从沉寂、冷漠或睡眠状态中唤醒，强调从静止到活跃的转变，常用于情感或行动的激发（如 rouse anger）。而 “stir” 更广泛，可指从无到有地引发情绪，不一定需要先前的静止状态。"
    }
  ]
}