{
  "word": "stokes",
  "pronunciation": "stohks",
  "concise_definition": "v. 煽动, 拨旺, 促进; n. 斯托克斯 (姓氏或术语)",
  "forms": {
    "third_person_singular": "stokes",
    "past_tense": "stoked",
    "past_participle": "stoked",
    "present_participle": "stoking"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To stir up or intensify feelings, especially anger, fear, or excitement, often deliberately to provoke a reaction.",
      "explanation_cn": "指故意煽动或加剧某种情绪，尤其是愤怒、恐惧或兴奋，以引发某种反应。",
      "example_en": "The politician's speech was designed to stoke fears about immigration.",
      "example_cn": "这位政治家的演讲旨在煽动人们对移民的恐惧。"
    },
    {
      "pos": "verb",
      "explanation_en": "To feed or stir up a fire, especially by adding fuel or using a poker to increase the flame.",
      "explanation_cn": "指向火中添柴或用火钳拨动，以使火焰更旺。",
      "example_en": "He stoked the fire before settling down for the night.",
      "example_cn": "他睡前往火里添了柴，让火更旺一些。"
    },
    {
      "pos": "verb",
      "explanation_en": "To promote or encourage the development or growth of something, such as an industry or a trend.",
      "explanation_cn": "指促进或推动某事物（如产业或趋势）的发展或增长。",
      "example_en": "Government incentives have stoked innovation in renewable energy.",
      "example_cn": "政府激励措施推动了可再生能源领域的创新。"
    },
    {
      "pos": "noun",
      "explanation_en": "A surname, notably associated with Sir George Gabriel Stokes, a 19th-century physicist and mathematician known for Stokes' law and Stokes' theorem.",
      "explanation_cn": "姓氏，尤指19世纪物理学家与数学家乔治·加布里埃尔·斯托克斯爵士，以其提出的斯托克斯定律和斯托克斯定理闻名。",
      "example_en": "Stokes' law describes the drag force on a sphere moving through a viscous fluid.",
      "example_cn": "斯托克斯定律描述了球体在粘性流体中运动时所受的阻力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "incite",
      "analysis": "“Incite” (煽动) 与 “stoke” 在煽动情绪或暴力行为时语义接近，但 “incite” 更正式、更常用于法律或政治语境，强调直接鼓动非法或极端行为；而 “stoke” 更口语化，常用于比喻性表达，如煽动情绪、火势或趋势，语气稍显间接。"
    },
    {
      "word_to_compare": "fuel",
      "analysis": "“Fuel” (助长) 作为动词时，常与 “stoke” 互换，尤其在比喻意义上（如 fuel anger），但 “fuel” 更强调提供持续的“能量来源”，而 “stoke” 更强调主动拨动、搅动的动作，带有更强的干预性和动态感。"
    },
    {
      "word_to_compare": "promote",
      "analysis": "“Promote” (促进) 是中性或正面词汇，指通过积极手段推动发展，如推广产品或提升职位；而 “stoke” 在促进发展时往往隐含某种操纵性或加剧性，可能带有负面色彩，如 stoke tensions（加剧紧张）。"
    }
  ]
}