{
  "word": "stones",
  "pronunciation": "stōnz",
  "concise_definition": "n. 石头, 石块, 结石, 石英表",
  "forms": {
    "singular": "stone"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small piece of rock, typically found in nature, used in construction, landscaping, or as a material for tools and monuments.",
      "explanation_cn": "指自然界中常见的小块岩石，常用于建筑、景观设计，或作为工具和纪念碑的材料。",
      "example_en": "The garden path was lined with smooth river stones.",
      "example_cn": "花园小径两侧铺满了光滑的河石。"
    },
    {
      "pos": "noun",
      "explanation_en": "A hard, solid mass formed in the body, especially in the kidneys, gallbladder, or urinary tract, often causing pain or medical complications.",
      "explanation_cn": "指人体内（如肾脏、胆囊或泌尿道）形成的坚硬固体块状物，常引起疼痛或健康问题，俗称‘结石’。",
      "example_en": "He was hospitalized after passing a kidney stone.",
      "example_cn": "他在排出一颗肾结石后被送入医院。"
    },
    {
      "pos": "noun",
      "explanation_en": "A precious or semi-precious gemstone, such as a diamond, ruby, or emerald, often used in jewelry.",
      "explanation_cn": "指钻石、红宝石或祖母绿等珍贵或半珍贵的宝石，常用于制作珠宝。",
      "example_en": "The crown was set with rare stones collected from around the world.",
      "example_cn": "这顶王冠镶嵌着来自世界各地的稀有宝石。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of watch that uses a quartz crystal to keep time, commonly referred to as a 'quartz watch' in everyday language.",
      "explanation_cn": "指使用石英晶体计时的表，日常语言中常称为‘石英表’。",
      "example_en": "She prefers wearing a simple stone watch over a mechanical one.",
      "example_cn": "她更喜欢戴一款简单的石英表，而不是机械表。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rock",
      "analysis": "“Rock”（岩石）通常指更大、更原始的地质结构，强调自然形成的巨大岩体；而 “stone” 更常用于指被人类采集、加工或使用的较小块状物，语义范围更具体、更贴近日常使用。"
    },
    {
      "word_to_compare": "pebble",
      "analysis": "“Pebble”（鹅卵石）特指被水流长期冲刷后变得圆滑的小石头，尺寸通常更小、形态更圆润；而 “stone” 是一个更宽泛的术语，可涵盖任何大小和形状的岩石碎片，不强调形态。"
    },
    {
      "word_to_compare": "gem",
      "analysis": "“Gem”（宝石）专指具有高价值、美观和稀有性的矿物晶体，如钻石、红宝石；而 “stone” 可泛指任何石头，包括普通岩石或非贵重矿物。当 “stone” 指宝石时，它是一个更通俗、非专业的说法。"
    }
  ]
}