{
  "word": "stone",
  "pronunciation": "stōn",
  "concise_definition": "n. 石头, 石块, 宝石; v. 用石头打, 以石处死",
  "forms": {
    "plural": "stones"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small piece of rock, typically found in nature, used in construction, landscaping, or as a raw material for tools and monuments.",
      "explanation_cn": "指自然界中常见的小块岩石，常用于建筑、景观设计或作为制作工具和纪念碑的原材料。",
      "example_en": "The path was lined with smooth river stones.",
      "example_cn": "小径两侧铺满了光滑的河石。"
    },
    {
      "pos": "noun",
      "explanation_en": "A precious or semi-precious gem, such as a diamond, ruby, or emerald, often used in jewelry.",
      "explanation_cn": "指钻石、红宝石或祖母绿等珍贵或半珍贵的宝石，常用于制作珠宝。",
      "example_en": "She wore a necklace with a single large emerald stone.",
      "example_cn": "她戴着一条镶有一颗大绿宝石的项链。"
    },
    {
      "pos": "noun",
      "explanation_en": "A hard, rounded mass of mineral matter formed in the body, especially in the kidney or gallbladder, causing medical issues.",
      "explanation_cn": "指人体内形成的坚硬矿物质团块，尤指肾结石或胆结石，可引发健康问题。",
      "example_en": "He was hospitalized after passing a kidney stone.",
      "example_cn": "他在排出一颗肾结石后被送入医院。"
    },
    {
      "pos": "verb",
      "explanation_en": "To throw stones at someone or something, often as an act of aggression or punishment.",
      "explanation_cn": "指用石头投掷某人或某物，常作为攻击或惩罚的行为。",
      "example_en": "The crowd began to stone the abandoned building out of anger.",
      "example_cn": "人群因愤怒开始向那座废弃建筑投掷石块。"
    },
    {
      "pos": "verb",
      "explanation_en": "To execute someone by throwing stones at them, historically used as a form of capital punishment.",
      "explanation_cn": "指以投石方式处死某人，历史上曾作为一种死刑方式。",
      "example_en": "In ancient times, adultery could be punished by stoning.",
      "example_cn": "在古代，通奸可能被判处石刑。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rock",
      "analysis": "“Rock” (岩石) 通常指更大、更整体的地质结构，强调自然形成的巨大岩体；而 “stone” 更常用于指较小、可搬运的碎块，或在人工语境中（如建筑、珠宝）使用。在口语中，“rock” 更偏向自然地貌，而 “stone” 更具实用性和文化象征意义。"
    },
    {
      "word_to_compare": "pebble",
      "analysis": "“Pebble” (鹅卵石) 是 “stone” 的一种子类，特指被水流长期冲刷后变得圆滑的小石子，尺寸更小、形态更规则。而 “stone” 是一个更宽泛的术语，涵盖从碎石到巨石的各种形态。"
    },
    {
      "word_to_compare": "gem",
      "analysis": "“Gem” (宝石) 是 “stone” 在珠宝语境下的特指，强调其稀有性、美观性和经济价值。所有 gem 都是 stone，但并非所有 stone 都是 gem。前者是价值导向的分类，后者是物质形态的分类。"
    }
  ]
}