{
  "word": "strap",
  "pronunciation": "strap",
  "concise_definition": "n. 带子, 腰带; v. 用带子绑, 束紧",
  "forms": {
    "plural": "straps",
    "third_person_singular": "straps",
    "past_tense": "strapped",
    "past_participle": "strapped",
    "present_participle": "strapping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long, narrow strip of material, such as leather, fabric, or plastic, used to fasten, hold, or support something.",
      "explanation_cn": "由皮革、织物或塑料等材料制成的长而窄的带子，用于固定、支撑或连接某物。",
      "example_en": "The suitcase had a leather strap to make it easier to carry.",
      "example_cn": "这个行李箱有一条皮带，方便携带。"
    },
    {
      "pos": "noun",
      "explanation_en": "A narrow band worn as part of clothing, especially on shoes, watches, or bras, to secure or decorate.",
      "explanation_cn": "作为服装一部分佩戴的窄带，常用于鞋子、手表或内衣上，起固定或装饰作用。",
      "example_en": "She adjusted the strap of her watch before the meeting.",
      "example_cn": "她在会议前调整了手表的表带。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fasten or secure something tightly with a strap or straps, often to prevent movement or ensure safety.",
      "explanation_cn": "用带子将某物紧紧绑住或固定，通常是为了防止移动或确保安全。",
      "example_en": "The children were strapped into their car seats for the journey.",
      "example_cn": "孩子们在旅途中被安全带固定在汽车座椅上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hit or beat someone with a strap or similar object, often as a form of punishment.",
      "explanation_cn": "用带子或类似物品抽打某人，常作为一种惩罚方式。",
      "example_en": "In the past, teachers sometimes strapped misbehaving students.",
      "example_cn": "过去，老师有时会用皮带惩罚行为不端的学生。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "belt",
      "analysis": "“Belt”（腰带）通常指环绕身体（尤其是腰部）的较宽、较硬的带子，主要用于固定衣物或携带物品，具有明确的服饰功能。而 “strap” 更通用，可指任何窄带，用途更广泛，包括固定设备、鞋带、手表带等，不一定围绕身体。"
    },
    {
      "word_to_compare": "band",
      "analysis": "“Band”（带、环）泛指任何环状或条状物，可以是弹性材料（如发带）、金属环（如手镯）或抽象概念（如乐队）。它不强调“系紧”功能，而 “strap” 更强调通过系缚实现固定或约束的作用。"
    },
    {
      "word_to_compare": "tie",
      "analysis": "“Tie”（系带、领带）通常指用于打结固定的细长物，如领带、鞋带，强调“打结”动作和装饰性。而 “strap” 多通过扣环、搭扣等方式固定，不依赖打结，更注重结构支撑或安全约束，功能性更强。"
    }
  ]
}