{
  "word": "strains",
  "pronunciation": "strānz",
  "concise_definition": "n. 压力, 张力, 扭伤, 品种; v. 竭力, 过度使用, 过滤",
  "forms": {
    "singular": "strain"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A state of mental or physical stress caused by demanding circumstances, often leading to tension, fatigue, or emotional strain.",
      "explanation_cn": "由苛刻环境引起的心理或生理压力状态，常导致紧张、疲劳或情绪上的负担。",
      "example_en": "The demands of her job put a great strain on her family life.",
      "example_cn": "工作的压力对她的家庭生活造成了巨大负担。"
    },
    {
      "pos": "noun",
      "explanation_en": "A physical injury caused by overstretching or tearing a muscle or tendon, typically due to excessive force or improper movement.",
      "explanation_cn": "因过度拉伸或撕裂肌肉或肌腱而导致的物理损伤，通常由过度用力或不正确的动作引起。",
      "example_en": "He suffered a muscle strain during the marathon.",
      "example_cn": "他在马拉松比赛中拉伤了肌肉。"
    },
    {
      "pos": "noun",
      "explanation_en": "A particular variety or subtype of a species, especially in biology or agriculture, often distinguished by specific genetic traits.",
      "explanation_cn": "生物或农业中某一物种的特定品种或亚型，通常由特定的遗传特征所区分。",
      "example_en": "This strain of bacteria is resistant to most antibiotics.",
      "example_cn": "这种细菌菌株对大多数抗生素具有抗性。"
    },
    {
      "pos": "verb",
      "explanation_en": "To exert or stretch something to its limit, often beyond its normal capacity, causing stress or risk of damage.",
      "explanation_cn": "将某物推向极限，通常超出其正常承受能力，导致压力或损坏风险。",
      "example_en": "The bridge was strained by the weight of the overloaded trucks.",
      "example_cn": "桥梁因超载卡车的重量而承受了巨大压力。"
    },
    {
      "pos": "verb",
      "explanation_en": "To filter or separate a liquid from solid particles by passing it through a mesh or porous material.",
      "explanation_cn": "通过让液体经过网状或多孔材料，将其与固体颗粒分离或过滤。",
      "example_en": "She strained the soup to remove the vegetables.",
      "example_cn": "她把汤过滤了一下，去掉蔬菜。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "stress",
      "analysis": "“Stress” (压力) 是一个更广泛的心理或生理反应术语，泛指任何引起紧张状态的外部或内部刺激。而 “strain” 更强调因过度使用或负荷导致的物理或情感上的具体负担，常带有“被拉伸至极限”的意象，更具动作性和结果性。"
    },
    {
      "word_to_compare": "pressure",
      "analysis": "“Pressure” (压力) 通常指外部施加的力量或要求，如社会期待、时间限制等，是客观存在的外力。而 “strain” 更侧重于个体承受这种外力后所产生的内在紧张、疲劳或损伤，是压力作用后的结果。"
    },
    {
      "word_to_compare": "variety",
      "analysis": "“Variety” (品种/多样性) 是一个通用词，泛指不同种类或类型，常用于描述外观、风格或选择的多样性。而 “strain” 在生物学语境中特指具有稳定遗传特征的亚种或菌株，强调基因层面的差异，比 “variety” 更专业、更精确。"
    },
    {
      "word_to_compare": "filter",
      "analysis": "“Filter” (过滤) 是一个更通用的动词，指任何去除杂质或分离成分的过程，可应用于空气、水、数据等。而 “strain” 作为动词时，特指用物理网具（如滤布、筛子）分离固体与液体，动作更具体、更传统，常用于厨房或实验室场景。"
    }
  ]
}