{
  "word": "straining",
  "pronunciation": "stray·ning",
  "concise_definition": "adj. 费力的, 紧张的, 令人吃力的; v. (strain 的现在分词) 拉紧, 过度使用, 筛选",
  "forms": {
    "base_form": "strain",
    "third_person_singular": "strains",
    "past_tense": "strained",
    "past_participle": "strained",
    "present_participle": "straining"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing something that requires great effort, causes tension, or is mentally or physically exhausting.",
      "explanation_cn": "形容某事物需要极大的努力，造成紧张，或在精神或身体上令人精疲力竭。",
      "example_en": "The straining silence after the announcement made everyone uneasy.",
      "example_cn": "公告后的紧张沉默让每个人都感到不安。"
    },
    {
      "pos": "verb",
      "explanation_en": "To exert force or pressure beyond normal limits, often resulting in stress, damage, or extreme effort.",
      "explanation_cn": "指施加超出正常限度的力量或压力，常导致压力、损伤或极度费力。",
      "example_en": "He was straining to lift the heavy box, his muscles trembling.",
      "example_cn": "他竭尽全力抬起沉重的箱子，肌肉都在颤抖。"
    },
    {
      "pos": "verb",
      "explanation_en": "To filter or pass a liquid or mixture through a mesh or porous material to separate solids from liquids.",
      "explanation_cn": "指通过网状或多孔材料过滤液体或混合物，以分离固体与液体。",
      "example_en": "She was straining the broth to remove the herbs and spices.",
      "example_cn": "她正在过滤汤，以去除香草和香料。"
    },
    {
      "pos": "verb",
      "explanation_en": "To stretch or extend something to its limit, often to the point of breaking or distorting.",
      "explanation_cn": "指将某物拉伸或延伸至极限，常达到断裂或变形的程度。",
      "example_en": "The bridge was straining under the weight of the overloaded trucks.",
      "example_cn": "这座桥在超载卡车的重压下岌岌可危。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "stressing",
      "analysis": "“Stressing”（强调/施压）侧重于心理或情感上的压力，常用于表达对某事的重视或焦虑，如“stressing the importance of safety”。而 “straining” 更强调物理或生理上的过度用力或承受极限，带有更明显的身体负担感。"
    },
    {
      "word_to_compare": "filtering",
      "analysis": "“Filtering”（过滤）是中性术语，泛指任何分离固体与液体的过程，可使用多种工具或方法。而 “straining” 特指使用筛网、布或类似工具进行粗略过滤，常用于厨房或日常语境，带有更具体、更手工化的含义。"
    },
    {
      "word_to_compare": "exerting",
      "analysis": "“Exerting”（施加）泛指使用力量、努力或影响，可以是温和或持续的，如“exerting influence”。而 “straining” 暗示力量已接近或超过极限，带有紧张、吃力甚至危险的语义色彩，强度更高。"
    }
  ]
}