{
  "word": "straw",
  "pronunciation": "straw",
  "concise_definition": "n. 麦秆, 稻草, 吸管; adj. 稻草的, 无价值的",
  "forms": {
    "plural": "straws"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A thin, hollow tube made from the dried stem of a cereal plant (such as wheat or rice), traditionally used for drinking liquids or as bedding for animals.",
      "explanation_cn": "由谷物植物（如小麦或水稻）干燥茎秆制成的细长中空管状物，传统上用于吸饮液体，或作为动物的垫料。",
      "example_en": "She sipped her lemonade through a straw.",
      "example_cn": "她用吸管啜饮着柠檬水。"
    },
    {
      "pos": "noun",
      "explanation_en": "A thin plastic or paper tube used for drinking beverages, especially in modern contexts.",
      "explanation_cn": "现代语境中用于饮用饮料的细长塑料或纸制管状物。",
      "example_en": "The restaurant switched to biodegradable straws to reduce plastic waste.",
      "example_cn": "这家餐厅改用可生物降解吸管以减少塑料垃圾。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, insignificant thing or person, often used in the phrase 'the straw that broke the camel's back' to denote the final, minor cause of a major outcome.",
      "explanation_cn": "指微不足道的事物或人，常用于短语 '压垮骆驼的最后一根稻草'，表示导致重大后果的最后微小原因。",
      "example_en": "Losing her keys was the straw that broke the camel's back after a long, stressful week.",
      "example_cn": "在漫长而紧张的一周后，丢钥匙成了压垮她的最后一根稻草。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Made of straw; used to describe something cheap, flimsy, or of little value.",
      "explanation_cn": "由稻草制成的；用于形容廉价、脆弱或毫无价值的事物。",
      "example_en": "He built a straw house to prove how weak it was against the wind.",
      "example_cn": "他建了一座稻草屋，以证明它在风中多么脆弱。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "reed",
      "analysis": "“Reed”（芦苇）是一种高大的水生植物，茎秆中空但更粗壮坚韧，常用于制作乐器或编织物。而 “straw” 来自谷物茎秆，更细、更脆，主要用于吸饮或填充，两者在植物来源和用途上有明显区别。"
    },
    {
      "word_to_compare": "hay",
      "analysis": "“Hay”（干草）是割下后晒干的草本植物，主要用于牲畜饲料，通常为捆状；而 “straw” 是谷物收割后剩下的干燥茎秆，纤维更硬、营养更低，主要用于垫料或工艺品。两者虽都来自植物，但来源部位和用途不同。"
    },
    {
      "word_to_compare": "stick",
      "analysis": "“Stick”（小棍）泛指任何细长的木棍或硬物，材质多样，用途广泛；而 “straw” 特指植物茎秆制成的中空管状物，质地轻软，主要用于吸饮或象征微不足道之物。两者在结构和语义上存在本质差异。"
    }
  ]
}