{
  "word": "stray",
  "pronunciation": "stray",
  "concise_definition": "v. 迷路, 偏离; adj. 迷路的, 偏离的",
  "forms": {
    "third_person_singular": "strays",
    "past_tense": "strayed",
    "past_participle": "strayed",
    "present_participle": "straying"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To wander away from the right path, group, or expected course, often unintentionally or without a clear destination.",
      "explanation_cn": "指无意中离开正确的路径、群体或应遵循的路线，通常没有明确的目的地。",
      "example_en": "The dog strayed from its owner and ended up in the next town.",
      "example_cn": "这只狗离开了主人，最后到了邻近的城镇。"
    },
    {
      "pos": "verb",
      "explanation_en": "To deviate from a standard, rule, or expected behavior, especially in thought, speech, or action.",
      "explanation_cn": "指在思想、言语或行为上偏离标准、规则或预期方式。",
      "example_en": "He strayed from the topic during the debate and talked about his personal life.",
      "example_cn": "他在辩论中偏离了主题，谈起了自己的私人生活。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Not belonging to anyone; having wandered away from home or its proper place, especially referring to animals.",
      "explanation_cn": "无主的；离开了家或应处之地的，尤指动物。",
      "example_en": "They took in a stray cat that was wandering near the alley.",
      "example_cn": "他们收留了一只在小巷附近游荡的流浪猫。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Not connected with the main subject or group; isolated or incidental.",
      "explanation_cn": "与主要主题或群体无关的；孤立的或偶然的。",
      "example_en": "She made a few stray remarks about her childhood during the interview.",
      "example_cn": "她在采访中偶然提到了几句童年往事。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "wander",
      "analysis": "“Wander” (漫游) 强调无目的、悠闲地移动，常带有诗意或放松的意味，不一定有偏离正轨的负面含义。而 “stray” 更强调偏离了应走的路径或规范，常隐含错误、危险或失控的意味。"
    },
    {
      "word_to_compare": "drift",
      "analysis": "“Drift” (漂移) 指缓慢、被动地移动，常因外力或缺乏方向感而发生，多用于水流、思绪或趋势。它更中性，而 “stray” 更强调主动或无意的偏离，且常涉及道德、行为或归属的失范。"
    },
    {
      "word_to_compare": "lost",
      "analysis": "“Lost” (迷路的) 是一个状态描述，强调完全失去方向或位置，通常需要帮助才能回归。而 “stray” 可以是暂时的、轻微的偏离，不一定完全失去方向，有时甚至可自行返回。例如，一只 stray dog 可能只是在附近游荡，而 a lost dog 则可能完全不知身在何处。"
    }
  ]
}