{
  "word": "stretcher",
  "pronunciation": "stret·chur",
  "concise_definition": "n. 担架, 伸展器, 伸展装置",
  "forms": {
    "plural": "stretchers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A portable device, typically made of fabric and rigid frames, used to carry people who are injured or unable to walk, especially in medical or emergency situations.",
      "explanation_cn": "一种便携式装置，通常由织物和刚性框架构成，用于运送受伤或无法行走的人，尤其在医疗或紧急情况下使用。",
      "example_en": "The paramedics loaded the injured hiker onto a stretcher and rushed him to the ambulance.",
      "example_cn": "急救人员将受伤的徒步者抬上担架，迅速送往救护车。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device or tool used to stretch or extend materials, such as fabric, wire, or muscle tissue, often in industrial, athletic, or medical contexts.",
      "explanation_cn": "一种用于拉伸或延展材料（如织物、金属丝或肌肉组织）的装置，常用于工业、运动或医疗场景。",
      "example_en": "The physical therapist used a leg stretcher to help the patient regain flexibility after surgery.",
      "example_cn": "理疗师使用腿部伸展器帮助患者在手术后恢复柔韧性。"
    },
    {
      "pos": "noun",
      "explanation_en": "A long, narrow piece of wood or metal used in construction or carpentry to span and support a gap, often called a 'stretcher bar' in framing.",
      "explanation_cn": "在建筑或木工中用于跨越并支撑间隙的长条形木料或金属，常被称为‘拉条’或‘撑条’。",
      "example_en": "The artist mounted the canvas on a wooden stretcher to keep it taut for painting.",
      "example_cn": "艺术家将画布固定在木制画框拉条上，以保持其绷紧便于作画。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "gurney",
      "analysis": "“Gurney”（医用推床）通常指医院中带轮子的、更宽大、更稳固的移动床，用于在院内转运病人，常配有可调节部件。而 “stretcher” 更通用，多为可折叠、轻便的担架，常用于户外、急救或临时搬运，结构更简单。"
    },
    {
      "word_to_compare": "litter",
      "analysis": "“Litter”（担架/便携式担架）是“stretcher”的同义词，尤其在军事或历史语境中使用，但现代英语中较少见。它更强调由多人抬运的原始形式，而 “stretcher” 是现代标准术语，涵盖更广泛的类型和用途。"
    },
    {
      "word_to_compare": "rack",
      "analysis": "“Rack”（架子/支架）泛指用于支撑、悬挂或固定物品的结构，如酒架、健身架等，不具备运输功能。而 “stretcher” 专用于承载人体或拉伸材料，具有明确的功能导向，结构设计围绕“承重”或“延展”展开。"
    }
  ]
}