{
  "word": "stretches",
  "pronunciation": "strach·iz",
  "concise_definition": "n. 拉伸, 伸展, 伸展动作; v. 拉伸, 延伸, 扩展",
  "forms": {
    "singular": "stretch",
    "third_person_singular": "stretches",
    "past_tense": "stretched",
    "past_participle": "stretched",
    "present_participle": "stretching"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A movement or action in which muscles or body parts are extended to their full length to improve flexibility or relieve tension.",
      "explanation_cn": "指为提高柔韧性或缓解紧张而将肌肉或身体部位伸展至最大限度的动作。",
      "example_en": "She did five minutes of stretches before her morning run.",
      "example_cn": "她晨跑前做了五分钟的拉伸动作。"
    },
    {
      "pos": "noun",
      "explanation_en": "A continuous period or area of something, often implying length or duration beyond the usual or expected.",
      "explanation_cn": "指某事物持续的一段时期或延伸的一片区域，常暗示其长度或持续时间超出通常或预期范围。",
      "example_en": "There was a long stretch of empty desert between the two towns.",
      "example_cn": "两座城镇之间有一段漫长的荒漠地带。"
    },
    {
      "pos": "verb",
      "explanation_en": "To extend or lengthen something physically, such as limbs, muscles, or a surface, often to reach or cover more space.",
      "explanation_cn": "指在物理上将肢体、肌肉或表面拉长或延展，通常是为了触及或覆盖更大的空间。",
      "example_en": "He stretched his arms above his head to wake up.",
      "example_cn": "他把双臂举过头顶伸展身体以醒神。"
    },
    {
      "pos": "verb",
      "explanation_en": "To extend the limits of something, such as resources, time, or capacity, often to the point of strain or near exhaustion.",
      "explanation_cn": "指将某事物（如资源、时间或能力）的极限推向极限，常接近紧张或耗尽的状态。",
      "example_en": "The budget was stretched to cover all the necessary expenses.",
      "example_cn": "预算被压缩到极限以支付所有必要开支。"
    },
    {
      "pos": "verb",
      "explanation_en": "To exaggerate or distort the truth, often to make a story more dramatic or to gain advantage.",
      "explanation_cn": "指夸大或歪曲事实，常为使故事更具戏剧性或获取优势。",
      "example_en": "He stretched the facts to make his achievement sound more impressive.",
      "example_cn": "他夸大了事实，使自己的成就听起来更了不起。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "extension",
      "analysis": "“Extension”（延伸）强调在原有基础上增加长度、时间或范围，通常是正式或结构性的延长，如建筑扩建、合同延期。而 “stretch” 更强调动态的拉伸动作或非正式的、有时是过度的延伸，甚至带有夸张的意味。"
    },
    {
      "word_to_compare": "expand",
      "analysis": "“Expand”（扩展）指在体积、规模或范围上向外扩大，强调空间或容量的增加，如公司扩张、气球膨胀。而 “stretch” 更侧重于拉长、延展，常涉及张力或极限，如拉伸肌肉或资金被拉到极限。"
    },
    {
      "word_to_compare": "range",
      "analysis": "“Range”（范围）是一个名词，指某事物所覆盖的区间或幅度，如温度范围、音域。它描述的是一个静态的区间，而 “stretch” 作为名词时强调的是这个区间本身的长度或连续性，常带有主观感受，如‘a long stretch of road’。"
    }
  ]
}