{
  "word": "stretching",
  "pronunciation": "strach·ting",
  "concise_definition": "n. 拉伸, 伸展; v. 拉伸, 延伸, 扩展 (动词原形: stretch)",
  "forms": {
    "base_form": "stretch",
    "third_person_singular": "stretches",
    "past_tense": "stretched",
    "past_participle": "stretched",
    "present_participle": "stretching"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of extending or lengthening the body or a part of the body, especially to improve flexibility, prevent injury, or prepare for physical activity.",
      "explanation_cn": "指伸展身体或身体某部分的动作，尤其用于提高柔韧性、预防受伤或为体育活动做准备。",
      "example_en": "Yoga classes often begin with ten minutes of stretching to warm up the muscles.",
      "example_cn": "瑜伽课通常以十分钟的拉伸动作开始，以热身肌肉。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of extending something beyond its normal limits, such as a material, a budget, or a time frame, often to the point of strain or risk.",
      "explanation_cn": "指将某物（如材料、预算或时间）延伸至其正常范围之外，常达到紧张或风险的边缘。",
      "example_en": "The company's stretching of its resources led to serious operational problems.",
      "example_cn": "公司对资源的过度使用导致了严重的运营问题。"
    },
    {
      "pos": "verb",
      "explanation_en": "To extend or lengthen something physically, such as muscles, limbs, or a surface, often by pulling or expanding.",
      "explanation_cn": "指通过拉或扩张使某物在物理上伸展或延长，如肌肉、肢体或表面。",
      "example_en": "She was stretching her arms above her head to relieve tension.",
      "example_cn": "她将双臂举过头顶以缓解紧张。"
    },
    {
      "pos": "verb",
      "explanation_en": "To extend the scope, duration, or capacity of something beyond its usual or intended limits, often in a way that strains credibility or resources.",
      "explanation_cn": "指将某物的范围、持续时间或容量扩展至超出其通常或预期的限度，常导致可信度或资源的紧张。",
      "example_en": "The politician stretched the truth to make his argument more convincing.",
      "example_cn": "这位政客歪曲了事实，以使他的论点更具说服力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "extension",
      "analysis": "“Extension” (延伸/延长) 是一个中性名词，指在时间、空间或范围上的客观延长，常用于技术、建筑或时间管理语境，如“网络扩展”或“截止日期延长”。而 “stretching” 更强调动作过程，常带有主动拉伸、用力或过度使用的意味，情感色彩更强烈。"
    },
    {
      "word_to_compare": "expansion",
      "analysis": "“Expansion” (扩张) 指体积、规模或范围的扩大，通常是系统性、结构性的增长，如公司扩张、城市扩张。它强调增长的广度，而 “stretching” 更侧重于对现有结构施加张力，可能伴随变形或极限挑战，甚至有负面含义（如资源被拉伸过度）。"
    },
    {
      "word_to_compare": "flexing",
      "analysis": "“Flexing” (弯曲/收缩) 指肌肉的收缩或关节的弯曲动作，常用于健身语境中强调力量展示，如“肱二头肌弯曲”。而 “stretching” 是相反的动作——拉长肌肉和肌腱，目的是放松和增加柔韧性。两者在运动中互补，但目标和生理机制截然不同。"
    }
  ]
}