{
  "word": "stretch",
  "pronunciation": "stretʃ",
  "concise_definition": "v. 伸展, 拉伸, 延伸; n. 伸展, 一段, 距离",
  "forms": {
    "third_person_singular": "stretches",
    "past_tense": "stretched",
    "past_participle": "stretched",
    "present_participle": "stretching"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To extend or pull something to make it longer or wider, often by applying force; can refer to physical movement or expansion of materials.",
      "explanation_cn": "指通过施加力量使某物（如身体、绳索、布料）变长或变宽，常用于描述身体的伸展或材料的拉伸。",
      "example_en": "She stretched her arms above her head after waking up.",
      "example_cn": "她醒来后将双臂举过头顶伸展了一下。"
    },
    {
      "pos": "verb",
      "explanation_en": "To extend the limits of something, such as time, resources, or ability, often to the point of strain or beyond normal capacity.",
      "explanation_cn": "指将时间、资源或能力等推至极限，甚至超出正常范围，常带有勉强或吃力的意味。",
      "example_en": "The budget was stretched to cover all the necessary expenses.",
      "example_cn": "预算被勉强用来支付所有必要开支。"
    },
    {
      "pos": "verb",
      "explanation_en": "To exaggerate or distort the truth, often to make a story more impressive or to gain an advantage.",
      "explanation_cn": "指夸大或歪曲事实，通常是为了让故事听起来更引人注目或获取某种优势。",
      "example_en": "He stretched the facts to make his experience sound more impressive.",
      "example_cn": "他夸大了事实，使自己的经历听起来更了不起。"
    },
    {
      "pos": "noun",
      "explanation_en": "A continuous length or area of something, such as a road, river, or period of time.",
      "explanation_cn": "指某物（如道路、河流或时间段）的一段连续长度或区域。",
      "example_en": "We drove for miles along a quiet stretch of highway.",
      "example_cn": "我们沿着一段宁静的高速公路开了好几英里。"
    },
    {
      "pos": "noun",
      "explanation_en": "An act of stretching the body or a part of it, especially to relieve tension or improve flexibility.",
      "explanation_cn": "指身体或身体某部分的伸展动作，尤指为缓解紧张或提高柔韧性而进行的伸展。",
      "example_en": "Yoga includes many stretches to improve mobility and reduce stress.",
      "example_cn": "瑜伽包含许多伸展动作，以提高活动能力并减轻压力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "extend",
      "analysis": "“Extend” (延伸) 更强调在原有基础上向外延长或扩大范围，常用于时间、空间或服务的扩展，语气中性，不带拉伸的物理张力。而 “stretch” 更强调通过外力拉长或压紧，常伴随紧张感或极限状态，如拉伸肌肉或夸大事实。"
    },
    {
      "word_to_compare": "expand",
      "analysis": "“Expand” (扩张) 指体积、规模或范围的扩大，通常是均匀或全方位的，如气球膨胀、公司扩张。而 “stretch” 更侧重于单向的拉长或拉伸，常有变形或紧绷的含义，如拉伸橡皮筋或勉强应付预算。"
    },
    {
      "word_to_compare": "strain",
      "analysis": "“Strain” (拉紧/竭力) 强调因过度用力而导致的压力或损伤，常为负面结果。而 “stretch” 可以是中性或积极的（如运动伸展），只有在过度时才接近 “strain” 的含义。例如：stretch a muscle（拉伸肌肉）是正常行为，但 strain a muscle（拉伤肌肉）则是受伤。"
    }
  ]
}