{
  "word": "stricken",
  "pronunciation": "strik·n",
  "concise_definition": "adj. 遭受...的, 受影响的, 被击中的; v. (strike 的过去分词) 击打, 使痛苦, 使受灾",
  "forms": {
    "base_form": "strike",
    "past_tense": "struck",
    "past_participle": "stricken",
    "present_participle": "striking"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Affected severely by something negative, such as disease, disaster, or grief; often used to describe people or areas suffering from hardship or calamity.",
      "explanation_cn": "遭受严重负面事件影响的，如疾病、灾难或悲痛；常用于描述遭受苦难或灾祸的人或地区。",
      "example_en": "The stricken village had no access to clean water or medical aid.",
      "example_cn": "受灾的村庄无法获得清洁的水源或医疗援助。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Overcome by a strong emotion, especially sorrow, guilt, or remorse; often used to describe someone visibly shaken by emotional distress.",
      "explanation_cn": "被强烈情绪（尤其是悲伤、内疚或悔恨）所笼罩；常用于描述因情感痛苦而明显动摇的人。",
      "example_en": "She was stricken with grief after hearing the news of her father's death.",
      "example_cn": "听到父亲去世的消息后，她悲痛欲绝。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause sudden and severe harm, damage, or affliction to someone or something, often unexpectedly or violently.",
      "explanation_cn": "突然且严重地伤害、损害或折磨某人或某物，通常带有意外性或暴力性。",
      "example_en": "A lightning strike stricken the old oak tree, splitting it in two.",
      "example_cn": "一道闪电击中了那棵老橡树，将它劈成两半。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "affected",
      "analysis": "“Affected” (受影响的) 是一个更中性、更宽泛的词，可用于任何类型的影响，包括正面或轻微的。而 “stricken” 强调的是严重、痛苦或灾难性的冲击，情感或物理层面的伤害程度更深，带有强烈的负面色彩。"
    },
    {
      "word_to_compare": "afflicted",
      "analysis": "“Afflicted” (受苦的) 与 “stricken” 在描述疾病或苦难时非常接近，常可互换。但 “afflicted” 更常用于长期、持续性的痛苦（如被疾病折磨），而 “stricken” 更强调突然发生的打击或瞬间的冲击，更具戏剧性和突发性。"
    },
    {
      "word_to_compare": "hit",
      "analysis": "“Hit” (击中) 是一个更口语化、更通用的词，可用于物理打击或比喻性影响（如“被市场打击”）。它缺乏 “stricken” 所蕴含的严重性、庄重感和情感深度。在正式语境中，“stricken” 更具文学性和表现力。"
    }
  ]
}