{
  "word": "strike",
  "pronunciation": "straik",
  "concise_definition": "v. 打击, 罢工, 击中, 突然发生; n. 打击, 罢工, 击中, 一击",
  "forms": {
    "third_person_singular": "strikes",
    "past_tense": "struck",
    "past_participle": "struck",
    "present_participle": "striking"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To hit or deliver a forceful blow, often with the hand, a weapon, or an object, causing impact or damage.",
      "explanation_cn": "指用手、武器或其他物体给予猛烈一击，造成冲击或损害。",
      "example_en": "The boxer struck his opponent with a powerful left hook.",
      "example_cn": "拳击手用一记强有力的左勾拳击中了对手。"
    },
    {
      "pos": "verb",
      "explanation_en": "To refuse to work as a form of protest, typically organized by workers to demand better conditions or pay.",
      "explanation_cn": "指工人为了要求更好的工作条件或薪资而集体拒绝工作，作为一种抗议形式。",
      "example_en": "The teachers went on strike to demand smaller class sizes.",
      "example_cn": "教师们举行罢工，要求减少班级人数。"
    },
    {
      "pos": "verb",
      "explanation_en": "To occur suddenly or unexpectedly, especially in reference to natural events or disasters.",
      "explanation_cn": "指（尤指自然灾害）突然发生或袭来。",
      "example_en": "A storm struck the coast without warning.",
      "example_cn": "一场风暴毫无预警地袭击了海岸。"
    },
    {
      "pos": "noun",
      "explanation_en": "A forceful blow or impact, often resulting in damage or injury.",
      "explanation_cn": "指一次猛烈的打击或撞击，通常导致损害或伤害。",
      "example_en": "The lightning strike destroyed the old oak tree.",
      "example_cn": "雷击摧毁了那棵老橡树。"
    },
    {
      "pos": "noun",
      "explanation_en": "A work stoppage organized by employees to protest working conditions or to demand changes.",
      "explanation_cn": "指员工为抗议工作条件或要求改变而组织的停工行动。",
      "example_en": "The strike lasted for three weeks and disrupted public transportation.",
      "example_cn": "这次罢工持续了三周，扰乱了公共交通。"
    },
    {
      "pos": "noun",
      "explanation_en": "In baseball, a legal pitch that the batter either swings at and misses, or does not swing at but is within the strike zone.",
      "explanation_cn": "在棒球中，指击球手挥棒未中，或未挥棒但球位于好球区内的合法投球。",
      "example_en": "He was called out on a third strike.",
      "example_cn": "他在第三次好球时被三振出局。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hit",
      "analysis": "“Hit” (击中) 是一个更通用的词，泛指任何形式的接触或撞击，可以是轻微的，也可以是剧烈的，语义范围更广。而 “strike” 更强调力量、突然性和目的性，常用于正式或文学语境，如“strike a deal”（达成协议）或“strike a pose”（摆姿势）。"
    },
    {
      "word_to_compare": "protest",
      "analysis": "“Protest” (抗议) 是一个广义的动词或名词，指表达反对意见的行为，形式多样（如游行、集会、标语）。而 “strike” 是一种特定类型的抗议，特指通过停止工作来施压，具有经济和组织性特征，是抗议的一种具体手段。"
    },
    {
      "word_to_compare": "attack",
      "analysis": "“Attack” (攻击) 通常带有敌意和侵略性，常用于军事、暴力或言语层面的主动进攻。而 “strike” 虽然也可指攻击，但更中性，可指物理打击、自然事件或劳工行动，语义更广泛，不一定包含恶意意图。"
    }
  ]
}