{
  "word": "strip",
  "pronunciation": "strɪp",
  "concise_definition": "n. 条, 带; v. 剥去, 剥夺, 擦除",
  "forms": {
    "third_person_singular": "strips",
    "past_tense": "stripped",
    "past_participle": "stripped",
    "present_participle": "stripping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long, narrow piece of something, such as fabric, metal, or land, often used for functional or decorative purposes.",
      "explanation_cn": "指某物（如布料、金属或土地）形成的狭长条状物，常用于功能或装饰目的。",
      "example_en": "She wore a silk strip around her head as a headband.",
      "example_cn": "她把一条丝绸带子系在头上当发带。"
    },
    {
      "pos": "noun",
      "explanation_en": "A narrow piece of land, especially one separating two areas, such as a median strip between lanes of traffic.",
      "explanation_cn": "指狭长的一块土地，尤指分隔两个区域的地带，如道路中间的隔离带。",
      "example_en": "The highway had a grassy strip dividing the northbound and southbound lanes.",
      "example_cn": "这条高速公路有一条草地隔离带分隔了南北向的车道。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove something covering or attached to a surface, often forcibly or completely, such as paint, clothing, or layers.",
      "explanation_cn": "指强行或彻底地移除覆盖物或附着物，如油漆、衣物或表层。",
      "example_en": "They stripped the old wallpaper off the walls before repainting.",
      "example_cn": "他们在重新粉刷前把墙上的旧墙纸全撕掉了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To deprive someone of something valuable or essential, such as rights, possessions, or status.",
      "explanation_cn": "指剥夺某人有价值或必需的东西，如权利、财产或地位。",
      "example_en": "The corrupt official was stripped of his title and imprisoned.",
      "example_cn": "这名腐败官员被剥夺了头衔并被监禁。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove clothing from someone, often in a sexual or humiliating context, or to perform a striptease.",
      "explanation_cn": "指脱去某人的衣服，常带有性暗示或羞辱意味，或指跳脱衣舞。",
      "example_en": "The dancer began to strip slowly as the music grew louder.",
      "example_cn": "随着音乐渐强，舞者开始缓缓脱衣。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "band",
      "analysis": "“Band”（带子）通常指具有弹性、环绕性或装饰性的条状物，如发带、臂章，强调其环绕或连接功能；而 “strip” 更强调狭长、扁平的形态，不一定具有弹性或环绕性，常用于描述物理形态而非功能。"
    },
    {
      "word_to_compare": "peel",
      "analysis": "“Peel”（剥皮）特指从表面一层层地剥离，尤其用于有机物如水果、树皮，动作较温和、渐进；而 “strip” 更强调彻底、强力地移除，可适用于非有机物（如油漆、权利），且常带有强制性或破坏性。"
    },
    {
      "word_to_compare": "deprive",
      "analysis": "“Deprive”（剥夺）是抽象意义上的剥夺，通常用于权利、机会、资源等，语气正式；而 “strip” 在作动词时虽也可用于抽象意义，但更口语化，且常隐含动作的暴力性或突然性，如 “stripped of citizenship” 比 “deprived of citizenship” 更具冲击力。"
    }
  ]
}