{
  "word": "stripping",
  "pronunciation": "strɪp·ɪŋ",
  "concise_definition": "n. 剥离, 剥夺, 去除; v. 剥离 (strip 的现在分词)",
  "forms": {
    "base_form": "strip",
    "third_person_singular": "strips",
    "past_tense": "stripped",
    "past_participle": "stripped",
    "present_participle": "stripping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act or process of removing a layer, covering, or outer part from something, often forcibly or systematically.",
      "explanation_cn": "指从某物上移除一层、覆盖物或外部部分的行为或过程，通常带有强制性或系统性。",
      "example_en": "The stripping of the old paint revealed the original wood grain beneath.",
      "example_cn": "去除旧漆后，露出了下面原有的木纹。"
    },
    {
      "pos": "noun",
      "explanation_en": "The removal of rights, privileges, or possessions from a person or group, often as a punitive or political act.",
      "explanation_cn": "指从个人或群体身上剥夺权利、特权或财产，通常作为惩罚或政治手段。",
      "example_en": "The stripping of his citizenship sparked international outrage.",
      "example_cn": "剥夺他的公民身份引发了国际社会的愤怒。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of performance in which clothing is gradually removed, often for entertainment purposes (e.g., striptease).",
      "explanation_cn": "一种逐渐脱去衣物的表演形式，通常用于娱乐目的（如脱衣舞）。",
      "example_en": "The club featured nightly stripping acts that drew large crowds.",
      "example_cn": "这家俱乐部每晚都有脱衣舞表演，吸引了大量观众。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove a covering, layer, or outer material from something, especially by force or mechanical means.",
      "explanation_cn": "指通过力量或机械手段从某物上移除覆盖物、层或外层材料。",
      "example_en": "They were stripping the wallpaper off the walls before repainting.",
      "example_cn": "他们在重新粉刷之前正在剥掉墙纸。"
    },
    {
      "pos": "verb",
      "explanation_en": "To deprive someone of something valuable, such as power, status, or possessions.",
      "explanation_cn": "指剥夺某人有价值的东西，如权力、地位或财产。",
      "example_en": "The scandal led to the stripping of his military honors.",
      "example_cn": "这起丑闻导致他被剥夺了军功荣誉。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "removal",
      "analysis": "“Removal” (移除) 是一个更中性、通用的词，泛指任何类型的移除行为，不强调方式或意图。而 “stripping” 通常暗示一种彻底、强制或系统性的去除，常带有负面或激烈的情感色彩。"
    },
    {
      "word_to_compare": "peeling",
      "analysis": "“Peeling” (剥落) 通常指自然或轻微的分层脱落，如水果皮、墙皮脱落，动作较温和、被动。而 “stripping” 更强调主动、用力或工具辅助的去除，常用于工业或惩罚性语境。"
    },
    {
      "word_to_compare": "deprivation",
      "analysis": "“Deprivation” (剥夺) 专指权利、资源或基本需求的丧失，多用于社会、心理或法律语境，是抽象名词。而 “stripping” 作为名词时虽可指剥夺，但更常用于具体动作（如剥皮、脱衣），语义范围更广，也更具视觉冲击力。"
    }
  ]
}