{
  "word": "stripe",
  "pronunciation": "strīp",
  "concise_definition": "n. 条纹, 带状物; v. 使成条纹",
  "forms": {
    "plural": "stripes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long, narrow band of a different color, texture, or material from its surroundings, often used for decoration, identification, or contrast.",
      "explanation_cn": "指与周围环境在颜色、质地或材质上不同的长而窄的带状物，常用于装饰、识别或形成对比。",
      "example_en": "The tiger's coat is marked with distinctive black stripes.",
      "example_cn": "老虎的皮毛上有明显的黑色条纹。"
    },
    {
      "pos": "noun",
      "explanation_en": "A narrow band or strip of material, especially one used as a badge of rank, status, or affiliation (e.g., in uniforms or flags).",
      "explanation_cn": "指一种窄条状材料，尤指用作军衔、身份或隶属关系标志的条纹（如制服或旗帜上的条纹）。",
      "example_en": "The general wore three gold stripes on his sleeve to indicate his rank.",
      "example_cn": "将军袖子上有三条金条纹，以表明他的军衔。"
    },
    {
      "pos": "noun",
      "explanation_en": "A narrow band of color or pattern on a surface, especially in digital displays or financial contexts (e.g., credit card stripe).",
      "explanation_cn": "指表面上的一条窄色带或图案，尤其用于数字显示或金融语境中（如信用卡的磁条）。",
      "example_en": "Swipe your card along the stripe to complete the transaction.",
      "example_cn": "将卡片沿磁条刷过以完成交易。"
    },
    {
      "pos": "verb",
      "explanation_en": "To mark or cover with stripes, especially in a patterned or alternating fashion.",
      "explanation_cn": "指以条纹状标记或覆盖某物，通常以有规律或交替的方式。",
      "example_en": "The artist striped the wall with alternating bands of blue and white.",
      "example_cn": "这位艺术家用交替的蓝白条纹装饰了墙壁。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "band",
      "analysis": "“Band”（带、条）泛指任何狭窄的条状物，可以是功能性的（如橡皮筋）或装饰性的，但不特指颜色或图案的交替。而 “stripe” 强调的是视觉上颜色、材质或纹理的纵向条纹，具有明显的对比性。"
    },
    {
      "word_to_compare": "line",
      "analysis": "“Line”（线）是几何意义上的细长痕迹，可以是直线、曲线，不一定有宽度或颜色差异；而 “stripe” 是有宽度的、具有视觉辨识度的色带，通常用于装饰或标识，比 “line” 更具实体性和色彩表现力。"
    },
    {
      "word_to_compare": "bar",
      "analysis": "“Bar”（条、杆）通常指较厚、较硬的固体条状物（如金属条、巧克力条），或用于表示限制（如酒吧、禁令条）。而 “stripe” 是扁平、柔软、表面的装饰性条纹，多用于纺织品、动物皮毛或电子设备，强调图案而非结构。"
    }
  ]
}