{
  "word": "stripes",
  "pronunciation": "strahypz",
  "concise_definition": "n. 条纹, 纵纹, 条状物",
  "forms": {
    "singular": "stripe"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long, narrow band of a different color, texture, or material from its surroundings, typically running parallel to other similar bands; often used for decoration, identification, or symbolic meaning.",
      "explanation_cn": "指与周围环境在颜色、质地或材质上不同的长而窄的带状区域，通常平行排列，常用于装饰、识别或象征意义。",
      "example_en": "The tiger's coat is marked with distinctive black and orange stripes.",
      "example_cn": "老虎的皮毛上有着鲜明的黑色和橙色条纹。"
    },
    {
      "pos": "noun",
      "explanation_en": "A pattern or design consisting of such bands, commonly seen in clothing, flags, or architecture, often conveying status, affiliation, or style.",
      "explanation_cn": "指由此类带状物组成的图案或设计，常见于服装、旗帜或建筑中，常用于传达身份、隶属关系或风格。",
      "example_en": "The police officer wore a uniform with white stripes on the sleeves to indicate rank.",
      "example_cn": "警察的制服袖子上有白色条纹，用以表明军衔。"
    },
    {
      "pos": "noun",
      "explanation_en": "A series of alternating light and dark bands, especially in natural phenomena such as zebra markings or striped minerals.",
      "explanation_cn": "指交替出现的明暗条纹，尤指自然界中的斑马纹路或条纹矿物等现象。",
      "example_en": "The marble countertop had natural stripes running through it, giving it a unique appearance.",
      "example_cn": "大理石台面上有天然形成的条纹，使其外观独具特色。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "streaks",
      "analysis": "“Streaks”（条痕/条状痕迹）通常指不规则、非连续的线状痕迹，常由自然过程或偶然形成，如云中的光带、头发中的白发。而 “stripes” 强调规则、平行、重复的带状结构，具有设计性或系统性。"
    },
    {
      "word_to_compare": "lines",
      "analysis": "“Lines”（线条）是一个更宽泛的术语，泛指任何细长的痕迹或边界，可以是直线、曲线、虚线等，不一定具有颜色或材质的对比。而 “stripes” 特指具有颜色或质地差异的平行带状线，强调视觉对比和图案性。"
    },
    {
      "word_to_compare": "bands",
      "analysis": "“Bands”（带状物）泛指任何横向或纵向的条状区域，可以是颜色、材质或功能上的分隔，但不一定平行或重复。而 “stripes” 特指多个平行、重复出现的带状物，构成一种图案模式，更具装饰性和规律性。"
    }
  ]
}