{
  "word": "strikes",
  "pronunciation": "strahyks",
  "concise_definition": "n. 罢工, 击打, 打击, 好球; v. 击打, 罢工, 突然发生",
  "forms": {
    "singular": "strike",
    "third_person_singular": "strikes",
    "past_tense": "struck",
    "past_participle": "struck",
    "present_participle": "striking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A collective stoppage of work by employees as a form of protest, typically to demand better wages, working conditions, or rights.",
      "explanation_cn": "指员工为抗议、要求提高工资、改善工作条件或争取权利而集体停工的行为。",
      "example_en": "The factory workers went on strike after their pay was cut by 20%.",
      "example_cn": "工厂工人在工资被削减20%后举行了罢工。"
    },
    {
      "pos": "noun",
      "explanation_en": "A forceful blow or hit delivered with the hand, an object, or a weapon.",
      "explanation_cn": "指用手、物体或武器施加的有力一击。",
      "example_en": "The boxer landed a powerful strike to his opponent’s jaw.",
      "example_cn": "拳击手一记重拳击中了对手的下巴。"
    },
    {
      "pos": "noun",
      "explanation_en": "An unexpected or sudden event, often with negative consequences, such as a natural disaster or a sudden economic downturn.",
      "explanation_cn": "指突然发生的事件，常带有负面后果，如自然灾害或经济急剧下滑。",
      "example_en": "The region was hit by a series of strikes — floods, fires, and power outages.",
      "example_cn": "该地区接连遭受了一系列打击——洪水、火灾和停电。"
    },
    {
      "pos": "noun",
      "explanation_en": "In baseball, a pitch that the batter does not swing at but is within the strike zone, or a swing and miss.",
      "explanation_cn": "在棒球中，指击球手未挥棒但位于好球区内的投球，或挥棒未击中的投球。",
      "example_en": "He was called out on three strikes.",
      "example_cn": "他因三次好球而被三振出局。"
    },
    {
      "pos": "verb",
      "explanation_en": "To deliver a forceful blow or hit, often with the hand, a tool, or a weapon.",
      "explanation_cn": "指用手、工具或武器施加有力的一击。",
      "example_en": "The hammer struck the nail with a loud clang.",
      "example_cn": "锤子重重地敲在钉子上，发出响亮的叮当声。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cease work collectively as a form of protest or negotiation tactic.",
      "explanation_cn": "指为抗议或谈判策略而集体停工。",
      "example_en": "Teachers are striking for better school funding.",
      "example_cn": "教师们为争取更好的学校经费而罢工。"
    },
    {
      "pos": "verb",
      "explanation_en": "To occur suddenly or unexpectedly, especially in a damaging or dramatic way.",
      "explanation_cn": "指突然或意外地发生，尤指以破坏性或戏剧性的方式。",
      "example_en": "A storm struck the coast without warning.",
      "example_cn": "一场风暴毫无预警地袭击了海岸。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "attack",
      "analysis": "“Attack” (攻击) 更强调主动的、有敌意的进攻行为，常用于军事、语言或心理层面，带有明确的侵略意图。而 “strike” 可以是物理打击，也可以是突然发生的事件，不一定带有敌意，如罢工或自然灾害。"
    },
    {
      "word_to_compare": "protest",
      "analysis": "“Protest” (抗议) 是一个更广泛的术语，泛指任何形式的公开反对行为，包括示威、静坐、签名等。而 “strike” 是一种特定类型的抗议，特指通过停止工作来施压，具有经济和组织性特征。"
    },
    {
      "word_to_compare": "hit",
      "analysis": "“Hit” (击中) 是一个更通用、口语化的词，可指任何接触性碰撞，程度较轻，用途广泛（如 hit the button, hit the road）。而 “strike” 更强调力量、突然性和目的性，常用于正式语境或描述重大事件，如 strike a deal（达成协议）、strike gold（发现黄金）。"
    }
  ]
}