{
  "word": "strong",
  "pronunciation": "strawng",
  "concise_definition": "adj. 强壮的, 强大的, 坚强的, 浓烈的",
  "forms": {
    "comparative": "stronger",
    "superlative": "strongest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having great physical power or force; able to withstand great pressure, stress, or strain.",
      "explanation_cn": "具有强大的体力或力量；能够承受巨大的压力、应力或拉力。",
      "example_en": "He is strong enough to lift the heavy box by himself.",
      "example_cn": "他力气大到可以独自举起这个沉重的箱子。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Having a powerful effect, influence, or intensity, especially in terms of emotion, flavor, or argument.",
      "explanation_cn": "具有强烈的效果、影响力或浓度，尤其用于描述情感、味道或论点。",
      "example_en": "She gave a strong argument against the proposed policy.",
      "example_cn": "她对这项拟议政策提出了有力的反驳。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Firmly fixed, established, or determined; not easily changed or broken.",
      "explanation_cn": "牢固确立、坚定或果断的；不易被改变或破坏的。",
      "example_en": "They have a strong commitment to environmental sustainability.",
      "example_cn": "他们对环境可持续性有着坚定的承诺。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Of a substance or liquid that has a high concentration or potency, especially in taste, smell, or chemical effect.",
      "explanation_cn": "指物质或液体具有高浓度或高效力，尤其在味道、气味或化学作用方面。",
      "example_en": "The coffee was too strong for her taste.",
      "example_cn": "这杯咖啡对她来说太浓了。"
    },
    {
      "pos": "adjective",
      "explanation_en": "In sports or competition, referring to a person or team that is highly skilled, dominant, or likely to win.",
      "explanation_cn": "在体育或竞赛中，指某人或某队技术高超、占主导地位或极有可能获胜。",
      "example_en": "The defending champions are a strong favorite to win again this year.",
      "example_cn": "卫冕冠军今年再次夺冠的可能性极大。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "powerful",
      "analysis": "“Powerful” (强有力的) 更强调内在能量、影响力或控制力，常用于抽象概念如权力、声音、语言或政治影响力。而 “strong” 更侧重于物理力量或坚韧性，适用范围更广，包括身体、情感和物质层面。"
    },
    {
      "word_to_compare": "robust",
      "analysis": "“Robust” (强健的) 强调在压力、变化或困难条件下仍能保持功能或稳定，常用于系统、经济或健康语境，带有“耐用”“抗干扰”的含义。而 “strong” 更直接表达力量本身，不一定包含适应性或耐久性的隐含意义。"
    },
    {
      "word_to_compare": "intense",
      "analysis": "“Intense” (强烈的) 描述的是程度的高度集中或激烈，常用于情绪、感觉或活动，如 intense pain 或 intense focus。它强调的是“浓度”而非“力量”。“Strong” 可以描述强度，但更常用于能力、结构或持久性，如 strong wind（强风）而非 intense wind。"
    }
  ]
}