{
  "word": "stroking",
  "pronunciation": "stroh·king",
  "concise_definition": "n. 抚摸, 擦拭, 搓揉; v. 抚摸, 擦拭 (stroke 的现在分词)",
  "forms": {
    "base_form": "stroke",
    "third_person_singular": "strokes",
    "past_tense": "stroked",
    "past_participle": "stroked",
    "present_participle": "stroking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of moving one's hand or an object gently and repeatedly over a surface, especially to show affection, comfort, or to soothe.",
      "explanation_cn": "用手或物体在表面轻柔、重复地移动，通常用于表达爱意、安慰或抚慰。",
      "example_en": "She gave the cat a gentle stroking on its back, and it purred contentedly.",
      "example_cn": "她轻轻抚摸着猫的背部，猫心满意足地呼噜起来。"
    },
    {
      "pos": "noun",
      "explanation_en": "A single movement of a brush, oar, or other tool across a surface, especially in art, rowing, or swimming.",
      "explanation_cn": "画笔、桨或其他工具在表面上的一次移动，尤指在绘画、划船或游泳中的动作。",
      "example_en": "The painter added a final stroking of gold to the horizon to enhance the sunset.",
      "example_cn": "画家在地平线上添上最后一笔金色，以增强日落的效果。"
    },
    {
      "pos": "noun",
      "explanation_en": "In medicine or psychology, a therapeutic or symbolic gesture involving light touch to convey care or reduce anxiety.",
      "explanation_cn": "在医学或心理学中，指通过轻柔触碰传递关怀或减轻焦虑的治疗性或象征性动作。",
      "example_en": "The nurse’s gentle stroking of the child’s hand helped calm him before the injection.",
      "example_cn": "护士轻柔地抚摸孩子的手，帮助他在打针前平静下来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move one's hand or a tool gently and repeatedly over a surface, typically to comfort, soothe, or create an effect.",
      "explanation_cn": "用手或工具在表面上轻柔、重复地移动，通常用于安慰、抚慰或产生某种效果。",
      "example_en": "He was stroking the dog’s fur as they sat together on the porch.",
      "example_cn": "他们一起坐在门廊上时，他正轻轻抚摸着狗的毛发。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a single sweeping movement with a brush, oar, or similar tool, especially in artistic or athletic contexts.",
      "explanation_cn": "在艺术或运动语境中，用画笔、桨等工具做出一次流畅的挥动动作。",
      "example_en": "The rower began stroking rhythmically as the boat glided forward.",
      "example_cn": "划手开始有节奏地划桨，小船缓缓向前滑行。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "caressing",
      "analysis": "“Caressing” (爱抚) 比 “stroking” 更强调情感的亲密性和温柔的性意味，常用于浪漫或性语境中，带有更强烈的感官和情感色彩。而 “stroking” 更中性，可广泛用于人、动物或无生命物体的轻触行为。"
    },
    {
      "word_to_compare": "rubbing",
      "analysis": "“Rubbing” (摩擦) 指施加压力并来回移动，通常用于清洁、取暖或缓解疼痛，动作更用力、更机械。而 “stroking” 是轻柔、流畅、无压力的移动，强调舒适与安抚，而非功能性的摩擦。"
    },
    {
      "word_to_compare": "brushing",
      "analysis": "“Brushing” (轻扫) 指快速、短暂地掠过表面，常带有轻微接触或无意触碰的意味，如“brushing off dust”。而 “stroking” 是持续、有意识、缓慢的移动，通常带有情感意图或艺术目的。"
    }
  ]
}