{
  "word": "strokes",
  "pronunciation": "strōks",
  "concise_definition": "n. 笔画, 擦拭, 中风, 按摩, 挥动",
  "forms": {
    "singular": "stroke"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A single movement of a pen, brush, or other writing/drawing tool, forming part of a letter, symbol, or artwork.",
      "explanation_cn": "指用笔、刷子或其他书写/绘画工具所作的单次移动，构成字母、符号或艺术作品的一部分。",
      "example_en": "The calligrapher's strokes were elegant and fluid.",
      "example_cn": "这位书法家的笔画优雅而流畅。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden medical event caused by interrupted blood flow to the brain, leading to loss of neurological function.",
      "explanation_cn": "指因大脑血流中断而导致神经功能丧失的突发性医疗事件，俗称中风。",
      "example_en": "He suffered a stroke last year and has been recovering with physical therapy.",
      "example_cn": "他去年中风了，目前正在接受物理治疗康复中。"
    },
    {
      "pos": "noun",
      "explanation_en": "A single motion of rubbing, patting, or moving something with the hand or an object, often to soothe or clean.",
      "explanation_cn": "指用手或工具对某物进行一次轻柔的擦拭、轻拍或移动动作，常用于安抚或清洁。",
      "example_en": "She gave the cat a gentle stroke on the head.",
      "example_cn": "她轻轻抚摸了猫的头。"
    },
    {
      "pos": "noun",
      "explanation_en": "A single complete movement in swimming, rowing, or other rhythmic physical activity, such as one cycle of arm motion in freestyle swimming.",
      "explanation_cn": "指游泳、划船或其他有节奏的身体活动中的一次完整动作，例如自由泳中手臂的一次完整划动。",
      "example_en": "The swimmer took 50 strokes to reach the other end of the pool.",
      "example_cn": "这位游泳者划了50下就游到了泳池的另一端。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden, forceful, and often damaging impact or blow, such as from lightning or a hammer.",
      "explanation_cn": "指突然、猛烈且常具破坏性的撞击或打击，例如雷击或锤击。",
      "example_en": "The tree was struck by a stroke of lightning during the storm.",
      "example_cn": "暴风雨中，一棵树被闪电击中。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "brushstroke",
      "analysis": "“Brushstroke”（笔触）是“stroke”在绘画语境中的特指，专指画笔在画布上留下的痕迹，强调艺术表现力和风格。而 “stroke” 更通用，可涵盖书写、击打、中风等多种含义。"
    },
    {
      "word_to_compare": "hit",
      "analysis": "“Hit”（打击）泛指任何形式的撞击，通常强调冲击力和结果，多用于暴力或碰撞场景。而 “stroke” 在表示打击时，常带有突然性、一次性或自然力量（如雷击）的意味，语义更文学化或医学化。"
    },
    {
      "word_to_compare": "tap",
      "analysis": "“Tap”（轻拍）指轻柔、短暂的触碰，通常无情感或治疗意图，如敲门或轻敲键盘。而 “stroke” 在表示抚摸时，隐含温柔、安抚或持续的接触，情感色彩更浓。"
    },
    {
      "word_to_compare": "attack",
      "analysis": "“Attack”（攻击）指有预谋或持续性的敌对行为，常用于医学、军事或社会语境。而 “stroke” 作为中风时，是突发、非故意的生理事件，无主观意图，属于医学术语而非行为描述。"
    }
  ]
}