{
  "word": "stroke",
  "pronunciation": "strōk",
  "concise_definition": "n. 中风, 挥击, 笔画, 一击; v. 抚摸, 挥击, 画笔触",
  "forms": {
    "third_person_singular": "strokes",
    "past_tense": "strokes",
    "past_participle": "strokes",
    "present_participle": "stroking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sudden loss of brain function due to interruption of blood flow to the brain, often causing paralysis, speech difficulties, or death.",
      "explanation_cn": "指由于大脑血流中断导致的突发性脑功能丧失，常引起瘫痪、言语障碍甚至死亡。",
      "example_en": "He suffered a stroke last year and has been recovering with physical therapy.",
      "example_cn": "他去年中风，目前正在接受物理治疗康复中。"
    },
    {
      "pos": "noun",
      "explanation_en": "A single movement of a tool, such as a pen, brush, or oar, or a blow delivered with a weapon or hand.",
      "explanation_cn": "指使用工具（如笔、刷子、桨）的一次动作，或用武器或手给予的一击。",
      "example_en": "The artist added a final stroke to complete the painting.",
      "example_cn": "艺术家添上最后一笔，完成了这幅画。"
    },
    {
      "pos": "noun",
      "explanation_en": "A single movement in rowing or swimming, or the rhythm of such movement.",
      "explanation_cn": "指划船或游泳中的一次划动动作，或这种动作的节奏。",
      "example_en": "The crew maintained a steady stroke throughout the race.",
      "example_cn": "整个比赛过程中，船员保持了稳定的划桨节奏。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move one's hand gently over a surface, especially to show affection or comfort.",
      "explanation_cn": "指用手轻轻抚过某物表面，尤指表达爱意或安慰。",
      "example_en": "She stroked the cat's fur softly as it purred.",
      "example_cn": "猫发出呼噜声时，她轻轻抚摸着它的毛发。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hit or strike something with a sweeping motion, especially with a weapon or tool.",
      "explanation_cn": "指以挥动的动作击打某物，尤指用武器或工具。",
      "example_en": "He stroked the ball with his racket and won the point.",
      "example_cn": "他用球拍一击打中球，赢得了这一分。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "attack",
      "analysis": "“Attack” (攻击) 强调有敌意或侵略性的行为，通常用于军事、辩论或体育对抗语境，带有明确的对抗意图。而 “stroke” 作为一击时，可以是中性的、技术性的动作，不一定含敌意，如绘画中的笔触或划船动作。"
    },
    {
      "word_to_compare": "touch",
      "analysis": "“Touch” (触碰) 指轻微、短暂的接触，常用于表达情感或感知，语义更温和、更轻柔。而 “stroke” 作为抚摸时，强调连续、有节奏的滑动动作，带有更明显的安抚或亲密意味，如抚摸宠物或爱人。"
    },
    {
      "word_to_compare": "blow",
      "analysis": "“Blow” (打击) 通常指由力量驱动的、突然的、可能造成伤害的一击，常用于暴力或意外场景。而 “stroke” 作为一击时，更强调动作的流畅性与技巧性，如书法中的笔画或网球中的击球，不一定伴随破坏性。"
    }
  ]
}