{
  "word": "structures",
  "pronunciation": "struhk·cherz",
  "concise_definition": "n. 结构, 建筑物, 组织体系",
  "forms": {
    "singular": "structure"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A thing constructed or built, especially a building or other physical entity with a defined shape and purpose, often designed to serve a specific function.",
      "explanation_cn": "指有特定形状和用途的建造物，尤其是建筑物或其他实体结构，通常为实现某种功能而设计。",
      "example_en": "The ancient Roman aqueduct is an impressive example of engineering structure.",
      "example_cn": "古罗马水道是工程结构的杰出范例。"
    },
    {
      "pos": "noun",
      "explanation_en": "The arrangement or organization of parts or elements within a system, whether physical, social, economic, or conceptual, that determines how it functions or behaves.",
      "explanation_cn": "指一个系统（无论是物理的、社会的、经济的还是概念的）中各组成部分或要素的排列与组织方式，决定了其运作或行为模式。",
      "example_en": "The structure of the company includes departments for marketing, finance, and human resources.",
      "example_cn": "这家公司的组织结构包括市场、财务和人力资源等部门。"
    },
    {
      "pos": "noun",
      "explanation_en": "A framework or underlying pattern that supports or gives form to something abstract, such as ideas, theories, or social norms.",
      "explanation_cn": "指支撑或赋予抽象事物（如思想、理论或社会规范）形式的框架或基本模式。",
      "example_en": "The structure of the legal system ensures justice is applied consistently.",
      "example_cn": "法律体系的结构确保了司法的一致性。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "building",
      "analysis": "“Building”（建筑物）特指用于居住、工作或活动的实体构造物，如房屋、办公楼等，是“structure”的一种具体类型。而 “structure” 范围更广，可指桥梁、塔楼、组织系统等非建筑性构造，甚至抽象体系。"
    },
    {
      "word_to_compare": "framework",
      "analysis": "“Framework”（框架）强调支撑性、基础性的结构，通常是抽象或非实体的，如政策框架、思维框架。它更侧重于提供支持和指导，而 “structure” 可以是实体的，也可以是抽象的，且更强调整体的组织形态和组成部分的相互关系。"
    },
    {
      "word_to_compare": "system",
      "analysis": "“System”（系统）指由相互关联的组件构成的、具有特定功能的整体，常用于自然、技术或社会领域。它强调功能性和互动性，而 “structure” 更关注组成部分的排列方式和形式。一个系统通常有结构，但结构不一定构成完整系统。"
    }
  ]
}