{
  "word": "struggles",
  "pronunciation": "struh·guhlz",
  "concise_definition": "n. 斗争, 挣扎, 努力; v. 挣扎, 奋斗, 努力",
  "forms": {
    "base_form": "struggle",
    "third_person_singular": "struggles",
    "past_tense": "struggled",
    "past_participle": "struggled",
    "present_participle": "struggling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A determined effort to overcome difficulty, opposition, or adversity, often involving physical, emotional, or mental exertion.",
      "explanation_cn": "指为克服困难、反对或逆境而做出的坚定努力，通常涉及身体、情感或精神上的付出。",
      "example_en": "Her struggles to balance work and family life inspired many.",
      "example_cn": "她为平衡工作与家庭生活所作的努力激励了很多人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A prolonged or intense conflict, either physical (e.g., battle) or abstract (e.g., ideological, economic, or personal)",
      "explanation_cn": "指持续或激烈的冲突，可以是身体上的（如战斗），也可以是抽象的（如意识形态、经济或个人层面的斗争）。",
      "example_en": "The country has been through decades of political struggles.",
      "example_cn": "这个国家经历了数十年的政治斗争。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make great efforts to achieve something despite difficulties or resistance, often with visible strain or hardship.",
      "explanation_cn": "指在面临困难或阻力时，付出巨大努力去实现某事，通常伴随着明显的吃力或艰辛。",
      "example_en": "He struggles to speak English fluently, but he never gives up.",
      "example_cn": "他努力说流利的英语，但从不放弃。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fight or contend physically or metaphorically, often in a desperate or uneven manner.",
      "explanation_cn": "指在身体上或隐喻意义上进行搏斗或抗争，通常以一种绝望或力量悬殊的方式进行。",
      "example_en": "The climbers struggled against the freezing wind and icy rocks.",
      "example_cn": "登山者们与刺骨的寒风和结冰的岩石搏斗。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fight",
      "analysis": "“Fight” (战斗/斗争) 更强调直接的对抗行为，常用于身体冲突或明确的敌对情境，如战争或争吵。而 “struggle” 更广泛，可包含内在的、持续的、非直接对抗的努力，如与情绪、习惯或环境的对抗。"
    },
    {
      "word_to_compare": "effort",
      "analysis": "“Effort” (努力) 是一个中性词，泛指付出的精力或劳动，不必然包含困难或阻力。而 “struggle” 隐含了强烈的障碍、痛苦或艰难，带有情感张力和紧迫感。"
    },
    {
      "word_to_compare": "strive",
      "analysis": "“Strive” (努力奋斗) 更强调有目标、有方向的积极进取，语气较正面，常用于追求理想或成就。而 “struggle” 更多强调过程中的阻力和痛苦，可能带有无奈或被动的色彩。"
    }
  ]
}