{
  "word": "struggle",
  "pronunciation": "struh·gul",
  "concise_definition": "v. 挣扎, 奋斗, 努力; n. 挣扎, 奋斗, 斗争",
  "forms": {
    "third_person_singular": "struggles",
    "past_tense": "struggled",
    "past_participle": "struggled",
    "present_participle": "struggling"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To make great efforts to achieve something difficult, often in the face of obstacles, resistance, or hardship.",
      "explanation_cn": "指在面对困难、阻力或逆境时，付出巨大努力去实现某目标。",
      "example_en": "She struggled to finish her degree while working full-time.",
      "example_cn": "她在全职工作的同时努力完成了学业。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fight or contend physically or metaphorically, often in a forceful or desperate manner.",
      "explanation_cn": "指在身体上或隐喻意义上进行激烈对抗或争斗，常带有奋力或绝望的意味。",
      "example_en": "The soldiers struggled for control of the hill.",
      "example_cn": "士兵们为争夺山头而激烈战斗。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or act with great difficulty, as if physically constrained or weighed down.",
      "explanation_cn": "指行动艰难，仿佛受到物理上的束缚或重压。",
      "example_en": "He struggled through the snowdrifts to reach the cabin.",
      "example_cn": "他艰难地跋涉过积雪，终于到达小屋。"
    },
    {
      "pos": "noun",
      "explanation_en": "A prolonged or intense effort to overcome difficulty, opposition, or adversity.",
      "explanation_cn": "指为克服困难、反对或逆境而进行的持久或激烈的努力。",
      "example_en": "The struggle for civil rights changed the course of American history.",
      "example_cn": "争取民权的斗争改变了美国历史的进程。"
    },
    {
      "pos": "noun",
      "explanation_en": "A physical contest or grappling between two or more parties, often in sports or combat.",
      "explanation_cn": "指两个或多个个体之间的身体对抗或搏斗，常用于体育或格斗场景。",
      "example_en": "The final match was a fierce struggle between the two champions.",
      "example_cn": "决赛是两位冠军之间的一场激烈搏斗。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fight",
      "analysis": "“Fight” (战斗/斗争) 更强调直接的对抗行为，常用于身体冲突或明确的敌对关系，如战争、争吵。而 “struggle” 更广泛，可包含内在的心理挣扎、长期的艰难努力，不一定涉及直接对抗。"
    },
    {
      "word_to_compare": "endeavor",
      "analysis": "“Endeavor” (努力/尝试) 是一个更正式、更中性的词，强调有目的、有计划的努力，通常不带有情感上的沉重感。而 “struggle” 暗示了过程中的痛苦、阻力或困难，情感色彩更强烈。"
    },
    {
      "word_to_compare": "strive",
      "analysis": "“Strive” (力求/奋斗) 与 “struggle” 都表示努力，但 “strive” 更强调积极向上、有目标地追求理想，语气更正面；而 “struggle” 常隐含着被压迫、受阻或艰难的处境，带有更多负面或沉重的语义。"
    }
  ]
}