{
  "word": "strung",
  "pronunciation": "strung",
  "concise_definition": "adj. 紧张的, 紧绷的; v. (string 的过去式和过去分词) 悬挂, 编排, 连接",
  "forms": {
    "base_form": "string",
    "present_participle": "stringing",
    "third_person_singular": "strings"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "In a state of nervous tension or emotional strain; feeling overwrought or on edge due to stress or anxiety.",
      "explanation_cn": "处于紧张或情绪压力状态；因压力或焦虑而感到神经紧绷、易怒或不安。",
      "example_en": "After working three shifts in a row, she was completely strung out and couldn't sleep.",
      "example_cn": "连续上了三个班后，她完全绷紧了，根本睡不着。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Tightly stretched or pulled, especially in reference to physical objects like wires, ropes, or musical strings.",
      "explanation_cn": "被紧紧拉伸或绷紧的，尤其指电线、绳索或乐器琴弦等物体。",
      "example_en": "The guitar strings were strung tightly to produce a higher pitch.",
      "example_cn": "吉他弦被绷得很紧，以产生更高的音调。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hang or arrange objects in a line or sequence, often by threading or attaching them to a support.",
      "explanation_cn": "将物体以线状或序列方式悬挂或排列，通常通过穿线或固定在支撑物上来实现。",
      "example_en": "They strung lights across the garden for the evening party.",
      "example_cn": "他们为晚上的派对在花园里挂上了彩灯。"
    },
    {
      "pos": "verb",
      "explanation_en": "To connect or link a series of things together, often in a narrative or logical sequence.",
      "explanation_cn": "将一系列事物连接或串联起来，常用于叙述或逻辑顺序中。",
      "example_en": "The movie strung together a series of unrelated events into a coherent plot.",
      "example_cn": "这部电影将一系列不相关的情节串联成一个连贯的剧情。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tense",
      "analysis": "“Tense”（紧张的）是更通用的形容词，描述心理或肌肉的紧绷状态，可指短期或长期的紧张；而 “strung”（尤其作 strung out）更口语化，常强调因过度疲劳或压力导致的神经衰弱或情绪崩溃，带有更强烈的负面情绪色彩。"
    },
    {
      "word_to_compare": "stretched",
      "analysis": "“Stretched”（拉伸的）侧重物理上的延展或拉长，如布料被拉伸；而 “strung” 在物理语境中特指通过悬挂、穿线或绷紧的方式固定，如琴弦、灯串，强调“被系于某物上”的动作结果。"
    },
    {
      "word_to_compare": "linked",
      "analysis": "“Linked”（连接的）强调两个或多个事物之间的关联性，常用于抽象关系（如数据、概念）；而 “strung” 在动词用法中更强调线性排列或串联的过程，常带有视觉上的“一串”意象，如珠子串成项链、事件串成故事。"
    }
  ]
}