{
  "word": "studying",
  "pronunciation": "stuh·dee·ing",
  "concise_definition": "v. 学习, 研究, 专心致志地学习",
  "forms": {
    "base_form": "study",
    "third_person_singular": "studies",
    "past_tense": "studied",
    "past_participle": "studied",
    "present_participle": "studying"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To engage in the active process of learning or acquiring knowledge, typically through reading, memorization, analysis, or practice, often with the goal of mastering a subject or preparing for an exam.",
      "explanation_cn": "指通过阅读、记忆、分析或练习等方式主动学习或获取知识，通常旨在掌握某一学科或为考试做准备。",
      "example_en": "She is studying biology at university and hopes to become a researcher.",
      "example_cn": "她正在大学学习生物学，希望成为一名研究人员。"
    },
    {
      "pos": "verb",
      "explanation_en": "To examine or observe something carefully and systematically in order to understand its nature, structure, or behavior.",
      "explanation_cn": "指为了理解某事物的性质、结构或行为而进行细致而系统的观察或研究。",
      "example_en": "Scientists are studying the effects of climate change on polar ice caps.",
      "example_cn": "科学家们正在研究气候变化对极地冰盖的影响。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pay close attention to someone or something in order to learn from their behavior or patterns.",
      "explanation_cn": "指密切注意某人或某事物，以从中学习其行为模式或规律。",
      "example_en": "He spent months studying the habits of birds before writing his book.",
      "example_cn": "他在写书之前花了数月时间观察鸟类的习性。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "learning",
      "analysis": "“Learning” (学习) 是一个更广泛、更通用的词，泛指任何获得知识或技能的过程，可以是无意识的（如通过经验）或有意识的。“Studying” 则特指有目的、有组织、通常需要专注和努力的系统性学习行为，如读书、做笔记、复习等。"
    },
    {
      "word_to_compare": "researching",
      "analysis": "“Researching” (研究) 强调通过调查、实验、收集数据等方式探索未知或验证假设，通常具有学术性或科学性。而 “studying” 可以包括阅读已有资料、理解概念，不一定涉及原创性探索。研究是学习的一种高级形式，但学习不一定是研究。"
    },
    {
      "word_to_compare": "reviewing",
      "analysis": "“Reviewing” (复习/回顾) 指重新审视已经学过的内容，目的是巩固记忆或加深理解。它通常是学习过程中的一个阶段，而 “studying” 包含了从初次接触新知识到深入掌握的全过程。复习是学习的一部分，但学习不等于复习。"
    }
  ]
}