{
  "word": "study",
  "pronunciation": "stuh·dee",
  "concise_definition": "n. 学习, 研究, 书房; v. 学习, 研究, 仔细观察",
  "forms": {
    "third_person_singular": "studies",
    "past_tense": "studied",
    "past_participle": "studied",
    "present_participle": "studying"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of learning or acquiring knowledge through reading, observation, or research, often in an academic or systematic context.",
      "explanation_cn": "通过阅读、观察或研究来学习或获取知识的行为，通常在学术或系统性语境中进行。",
      "example_en": "She spent hours in the library doing research for her study on ancient civilizations.",
      "example_cn": "她花了数小时在图书馆查阅资料，进行关于古代文明的研究。"
    },
    {
      "pos": "noun",
      "explanation_en": "A detailed examination or analysis of a subject, often published as a report or paper in academic or scientific fields.",
      "explanation_cn": "对某一主题进行的详细调查或分析，通常以报告或论文形式在学术或科学领域发表。",
      "example_en": "The study published in Nature revealed new insights into climate change patterns.",
      "example_cn": "发表在《自然》杂志上的这项研究揭示了气候变化模式的新见解。"
    },
    {
      "pos": "noun",
      "explanation_en": "A room or area designated for reading, writing, or scholarly work, especially in a home.",
      "explanation_cn": "专用于阅读、写作或学术工作的房间或区域，尤指家庭中的书房。",
      "example_en": "He retreated to his study to finish the manuscript before the deadline.",
      "example_cn": "他退到书房里，在截止日期前完成了手稿。"
    },
    {
      "pos": "verb",
      "explanation_en": "To devote time and effort to learning or understanding a subject, especially through reading, memorization, or practice.",
      "explanation_cn": "投入时间和精力去学习或理解某一主题，尤指通过阅读、记忆或练习。",
      "example_en": "He studies biology every evening after dinner.",
      "example_cn": "他每天晚饭后都学习生物学。"
    },
    {
      "pos": "verb",
      "explanation_en": "To observe or examine something carefully in order to understand its nature, structure, or behavior.",
      "explanation_cn": "仔细观察或审视某物，以理解其性质、结构或行为。",
      "example_en": "The artist studied the light falling on the model’s face to capture the subtle shadows.",
      "example_cn": "这位艺术家仔细观察了照在模特脸上的光线，以捕捉微妙的阴影。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "learn",
      "analysis": "“Learn” (学习) 强调通过经验或教学获得知识或技能，结果导向，常用于掌握某项能力（如学会游泳）。而 “study” 更强调过程，指有意识地、系统地投入时间进行阅读、分析或研究，不一定立即产生掌握的结果。"
    },
    {
      "word_to_compare": "research",
      "analysis": "“Research” (研究) 是 “study” 的一种高级形式，特指为发现新知识或验证假设而进行的系统性调查，通常包含实验、数据收集和分析。而 “study” 可以是更广泛的、非实验性的学习行为，包括阅读教材或复习课程。"
    },
    {
      "word_to_compare": "examine",
      "analysis": "“Examine” (检查/审查) 侧重于对具体对象进行细致的观察或检验，常用于医疗、法律或物理检查场景（如医生检查病人）。而 “study” 更强调持续性的、深入的思考和理解，范围更广，可应用于抽象概念或长期项目。"
    }
  ]
}