{
  "word": "studio",
  "pronunciation": "stoo·dee·oh",
  "concise_definition": "n. 工作室, 演播室, 录音室, 画室",
  "forms": {
    "plural": "studios"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A room or building designed for creative work, especially for artists, musicians, or filmmakers, where equipment and space are provided for producing art, music, or media content.",
      "explanation_cn": "指专为艺术家、音乐家或电影制作人设计的房间或建筑，配备专门的设备和空间，用于创作艺术、音乐或媒体内容。",
      "example_en": "The painter spent hours in her studio, perfecting the brushstrokes of her latest landscape.",
      "example_cn": "这位画家在画室里花了数小时，精心打磨她最新一幅风景画的笔触。"
    },
    {
      "pos": "noun",
      "explanation_en": "A facility equipped for recording audio or video, such as a radio, television, or music recording studio, often with soundproofing and professional equipment.",
      "explanation_cn": "指配备有隔音设施和专业设备的音频或视频录制场所，如广播、电视或音乐录音室。",
      "example_en": "The band recorded their new album in a downtown studio with state-of-the-art acoustics.",
      "example_cn": "这支乐队在市中心一家配备先进声学设备的录音室录制了他们的新专辑。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small apartment or living space, especially in urban areas, that combines the living room, bedroom, and kitchen into one open area, often rented by students or young professionals.",
      "explanation_cn": "指城市中一种小型公寓或居住空间，通常将客厅、卧室和厨房合并为一个开放区域，常由学生或年轻专业人士租住。",
      "example_en": "After graduating, she moved into a cozy studio near campus with a tiny kitchenette.",
      "example_cn": "毕业后，她搬进了一间靠近校园、带小厨房的舒适单间公寓。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "workshop",
      "analysis": "“Workshop” (工作坊/车间) 通常指一个用于实际操作、制造或动手实践的场所，强调生产、修理或集体协作的活动，如木工车间或写作工作坊。而 “studio” 更侧重于艺术创作、设计或媒体制作，氛围更偏向个人化、创意性，而非工业或技术性。"
    },
    {
      "word_to_compare": "atelier",
      "analysis": "“Atelier” (画室/工作室) 是法语借词，特指艺术家（尤其是画家或雕塑家）的个人创作空间，带有浓厚的艺术传统和精英色彩。它与 “studio” 在含义上高度重叠，但 “atelier” 更具文化历史感，常用于艺术史语境，而 “studio” 是更通用、现代的英语词汇。"
    },
    {
      "word_to_compare": "apartment",
      "analysis": "“Apartment” (公寓) 是泛指住宅单元，强调居住功能，结构通常包括独立的卧室、客厅和卫生间。而 “studio” 作为居住空间时，是公寓的一种特殊类型，其特点是空间一体化，没有隔断卧室，因此 “studio” 是 “apartment” 的子类，但功能和布局更紧凑、更偏向于单身或极简生活方式。"
    }
  ]
}