{
  "word": "stumbled",
  "pronunciation": "stuhm·buhl",
  "concise_definition": "v. 绊倒, 跌跌撞撞地走, 结结巴巴地说, 出错",
  "forms": {
    "base_form": "stumble",
    "third_person_singular": "stumbles",
    "past_tense": "stumbled",
    "past_participle": "stumbled",
    "present_participle": "stumbling"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To trip or lose one's balance while walking or running, often due to an obstacle or uneven ground, resulting in a stumble or fall.",
      "explanation_cn": "指在行走或奔跑时因碰到障碍物或地面不平而绊倒或失去平衡，通常导致跌倒或踉跄。",
      "example_en": "She stumbled over a loose brick and nearly fell down the stairs.",
      "example_cn": "她被一块松动的砖头绊了一下，差点从楼梯上摔下去。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move in an unsteady, awkward, or hesitant manner, often suggesting physical or emotional discomfort.",
      "explanation_cn": "指以不稳、笨拙或犹豫的方式移动，常暗示身体或情绪上的不适。",
      "example_en": "He stumbled into the room, exhausted after the long journey.",
      "example_cn": "他踉踉跄跄地走进房间，长途跋涉后精疲力尽。"
    },
    {
      "pos": "verb",
      "explanation_en": "To speak hesitantly or incorrectly, especially by mispronouncing words or pausing awkwardly while talking.",
      "explanation_cn": "指说话时犹豫不决、结结巴巴，或因发音错误、停顿生硬而显得不流畅。",
      "example_en": "He stumbled over his words when asked about the missing documents.",
      "example_cn": "当被问到那些缺失的文件时，他说话结结巴巴。"
    },
    {
      "pos": "verb",
      "explanation_en": "To come across something unexpectedly or by chance, often in a negative or surprising context.",
      "explanation_cn": "指意外或偶然地发现某物，常带有负面或令人惊讶的语境。",
      "example_en": "While cleaning the attic, they stumbled upon an old family diary.",
      "example_cn": "打扫阁楼时，他们意外发现了一本旧家庭日记。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tripped",
      "analysis": "“Tripped” (被绊倒) 通常特指脚被物体绊住而失去平衡，强调动作的直接原因（如被线、石头绊倒），是 “stumble” 的一种具体形式。而 “stumble” 范围更广，可包括因疲劳、醉酒或情绪紧张导致的踉跄，不一定有可见障碍物。"
    },
    {
      "word_to_compare": "fumbled",
      "analysis": "“Fumbled” (笨拙地处理) 主要用于手部动作，指因紧张或不熟练而弄掉、抓不稳或操作失误，如 fumble with keys 或 fumble a response。而 “stumble” 更多用于脚步或言语的不稳，两者虽都含“笨拙”义，但身体部位和语境不同。"
    },
    {
      "word_to_compare": "blundered",
      "analysis": "“Blundered” (犯严重错误) 强调因愚蠢、粗心或判断失误而造成重大过失，常用于决策、言语或行为后果严重的场合，如 blundered in negotiations。而 “stumbled” 在言语语境中仅指表达不流畅，不必然意味着严重错误，语气更轻、更偶然。"
    }
  ]
}