{
  "word": "stumps",
  "pronunciation": "stuhmps",
  "concise_definition": "n. 树桩, 桩柱, 木桩; v. 使绊倒, 阻碍",
  "forms": {
    "singular": "stump",
    "plural": "stumps"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The remaining part of a tree trunk after the tree has been cut down; often rough and uneven, left protruding from the ground.",
      "explanation_cn": "树木被砍伐后残留在地面上的树干部分，通常粗糙不平，突出于地面。",
      "example_en": "The children played hide-and-seek behind the old tree stumps in the forest.",
      "example_cn": "孩子们在森林里旧树桩后面玩捉迷藏。"
    },
    {
      "pos": "noun",
      "explanation_en": "A short, thick post or pillar used to support something, such as a fence, a cricket wicket, or a building foundation.",
      "explanation_cn": "用于支撑某物（如围栏、板球门柱或建筑地基）的短而粗的柱子或桩。",
      "example_en": "The fence was held up by wooden stumps driven into the soil.",
      "example_cn": "围栏由打入土壤中的木桩支撑着。"
    },
    {
      "pos": "noun",
      "explanation_en": "In cricket, one of the three vertical posts that make up the wicket; also refers to the act of dismissing a batsman by hitting the stumps with the ball.",
      "explanation_cn": "在板球运动中，构成门柱的三根垂直木柱之一；也可指用球击中门柱使击球手出局的行为。",
      "example_en": "The bowler knocked over the stumps with a perfect yorker.",
      "example_cn": "投球手用一记完美的约克球击倒了门柱。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause someone to stumble or trip, especially by catching their foot on something like a stump or obstacle.",
      "explanation_cn": "使某人绊倒，通常是因为脚被树桩或其他障碍物绊住。",
      "example_en": "She stumped over a root while hiking and nearly fell.",
      "example_cn": "她在徒步时被一根树根绊了一下，差点摔倒。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hinder or prevent progress, especially by creating an obstacle or impasse; often used in the phrase 'stump someone' to mean to confuse or puzzle them.",
      "explanation_cn": "阻碍或阻止进展，通常通过制造障碍或僵局；也常用于短语 'stump someone'，意为使某人困惑或难倒。",
      "example_en": "The complex question stumped even the most experienced researchers.",
      "example_cn": "这个复杂的问题难倒了最有经验的研究人员。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "stump",
      "analysis": "“Stump” 是单数形式，指单个树桩或木桩；“stumps” 是其复数形式，用于描述多个树桩或木桩。在动词用法中，两者形式相同（stump/stumps），但“stumps”用于第三人称单数，如“He stumps over obstacles.”"
    },
    {
      "word_to_compare": "log",
      "analysis": "“Log”（原木）指被砍伐后尚未削去树皮或未被截断的完整树干，通常较长且完整；而 “stump” 是树被砍伐后留在地上的残余部分，短而粗，通常不完整。两者在形态和用途上截然不同。"
    },
    {
      "word_to_compare": "obstacle",
      "analysis": "“Obstacle”（障碍）是泛指任何阻碍前进的事物，可以是抽象的（如政策障碍）或具体的（如路障）；而 “stump” 作为动词时特指因物理障碍（如树桩）导致绊倒，作为名词时特指树桩或木桩，语义范围更窄、更具体。"
    }
  ]
}