{
  "word": "stumble",
  "pronunciation": "stuh·muhl",
  "concise_definition": "v. 绊倒, 跌跌撞撞地走, 结结巴巴地说; n. 绊倒, 失误",
  "forms": {
    "third_person_singular": "stumbles",
    "past_tense": "stumbled",
    "past_participle": "stumbled",
    "present_participle": "stumbling"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To trip or lose one's balance while walking or running, often due to an obstacle or uneven ground, resulting in a sudden, uncontrolled movement.",
      "explanation_cn": "指在行走或奔跑时因碰到障碍物或地面不平而绊倒或失去平衡，导致突然、不受控制的动作。",
      "example_en": "She stumbled over a loose stone and nearly fell.",
      "example_cn": "她被一块松动的石头绊了一下，差点摔倒。"
    },
    {
      "pos": "verb",
      "explanation_en": "To speak hesitantly or incorrectly, especially by mispronouncing words or pausing awkwardly, often due to nervousness or lack of preparation.",
      "explanation_cn": "指说话时犹豫不决、词不达意，常因紧张或准备不足而发音错误或停顿尴尬。",
      "example_en": "He stumbled through his presentation, forgetting key points.",
      "example_cn": "他结结巴巴地做完演讲，忘记了关键要点。"
    },
    {
      "pos": "verb",
      "explanation_en": "To come upon something unexpectedly or by chance, especially something valuable or significant.",
      "explanation_cn": "指偶然或意外地发现某物，尤指有价值或重要的事物。",
      "example_en": "They stumbled upon an ancient artifact while hiking in the mountains.",
      "example_cn": "他们在山中徒步时偶然发现了一件古代文物。"
    },
    {
      "pos": "noun",
      "explanation_en": "A moment of failure, error, or misstep, especially in performance or judgment.",
      "explanation_cn": "指在表现或判断中的一次失误、错误或失策。",
      "example_en": "The politician's gaffe was a major stumble in his campaign.",
      "example_cn": "这位政治家的失言是他竞选活动中的一次重大失误。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "trip",
      "analysis": "“Trip”（绊倒）通常指脚被物体勾住而短暂失去平衡，动作较轻、较突然，不一定导致摔倒；而 “stumble” 更强调整个身体的不稳，可能伴随踉跄、摇晃甚至摔倒，语义范围更广。"
    },
    {
      "word_to_compare": "falter",
      "analysis": "“Falter”（犹豫、动摇）多用于描述动作或言语的不稳定，强调意志或信心的动摇，常用于抽象语境（如信心 falter）；而 “stumble” 在言语语境中更侧重于语言表达的物理性卡顿，如结巴或发音错误，更具动作性。"
    },
    {
      "word_to_compare": "blunder",
      "analysis": "“Blunder”（严重失误）指因愚蠢、疏忽或判断错误造成的重大过失，通常带有负面评价；而 “stumble” 作为名词时虽也指失误，但语气更轻，常用于非严重或偶然性的错误，甚至可带偶然发现的中性或积极含义。"
    }
  ]
}