{
  "word": "stunts",
  "pronunciation": "stuhnts",
  "concise_definition": "n. 惊险特技, 奇特举动, 限制性措施",
  "forms": {
    "singular": "stunt"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A dangerous or impressive physical feat performed for entertainment, especially in films, circuses, or sports, often requiring skill, courage, and training.",
      "explanation_cn": "指为娱乐目的而表演的危险或令人惊叹的体能动作，常见于电影、马戏团或体育赛事中，通常需要技巧、勇气和训练。",
      "example_en": "The actor performed his own stunts in the action movie, including a 30-foot fall from a building.",
      "example_cn": "这位演员在动作片中亲自完成了所有特技，包括从建筑物上30英尺高的地方跳下。"
    },
    {
      "pos": "noun",
      "explanation_en": "An unusual or exaggerated action intended to attract attention, often for publicity or political effect, sometimes considered gimmicky or theatrical.",
      "explanation_cn": "指为吸引注意而采取的不寻常或夸张的行为，常用于宣传或政治目的，有时显得做作或戏剧化。",
      "example_en": "The politician's stunt of sleeping in a cardboard box drew media attention but was criticized as insincere.",
      "example_cn": "这位政客睡纸板箱的作秀行为吸引了媒体关注，但被批评为不真诚。"
    },
    {
      "pos": "noun",
      "explanation_en": "A restrictive measure or limitation imposed to control or suppress growth, progress, or activity, often used in economic or organizational contexts.",
      "explanation_cn": "指为控制或抑制增长、进展或活动而施加的限制性措施，常用于经济或组织语境中。",
      "example_en": "Budget stunts forced the department to delay essential equipment upgrades.",
      "example_cn": "预算限制迫使该部门推迟了必要设备的升级。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "trick",
      "analysis": "“Trick”（把戏/诡计）通常指一种欺骗性或巧妙的手段，目的是误导或获得优势，不一定具有身体表演性质。而 “stunt” 更强调公开的、视觉化的、有时是危险的体能表演，且常用于娱乐或宣传目的。"
    },
    {
      "word_to_compare": "feat",
      "analysis": "“Feat”（壮举）泛指任何需要非凡能力或勇气的成就，可以是智力、体力或道德层面的，语义更广泛且中性。而 “stunt” 更具体地指向表演性、娱乐性或吸引眼球的体能行为，有时带有轻浮或哗众取宠的意味。"
    },
    {
      "word_to_compare": "gimmick",
      "analysis": "“Gimmick”（噱头）指为吸引注意而设计的花招或小把戏，通常带有贬义，暗示缺乏实质内容。虽然某些 “stunts” 可被视为 gimmicks，但并非所有 stunt 都是空洞的——许多特技是高度专业化的技能，而 gimmick 则几乎总是贬义的。"
    }
  ]
}