{
  "word": "stung",
  "pronunciation": "stuhng",
  "concise_definition": "v. 刺痛, 被蜇, 感到痛苦（ sting 的过去式和过去分词）",
  "forms": {
    "base_form": "sting",
    "third_person_singular": "stings",
    "present_participle": "stinging",
    "past_tense": "stung",
    "past_participle": "stung"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To pierce the skin with a sharp organ (such as a bee's stinger) and inject venom, causing pain or irritation.",
      "explanation_cn": "指用尖锐器官（如蜜蜂的毒刺）刺入皮肤并注入毒液，引起疼痛或刺激。",
      "example_en": "The bee stung her on the hand, and she immediately cried out in pain.",
      "example_cn": "蜜蜂蜇了她的手，她立刻痛苦地叫了起来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a sharp, burning, or painful sensation, either physically or emotionally.",
      "explanation_cn": "指引起剧烈的刺痛感，无论是身体上的还是情感上的。",
      "example_en": "The saltwater stung her cuts, making her wince.",
      "example_cn": "海水渗进她的伤口，刺得她直皱眉。"
    },
    {
      "pos": "verb",
      "explanation_en": "To feel a sharp emotional pain or regret, often due to betrayal, criticism, or disappointment.",
      "explanation_cn": "指因背叛、批评或失望而感到强烈的情感痛苦或懊悔。",
      "example_en": "He was stung by her harsh words and didn't speak to her for weeks.",
      "example_cn": "她刻薄的话刺伤了他，他好几个星期都没理她。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be affected by a sudden, unpleasant financial loss or cost, often unexpectedly.",
      "explanation_cn": "指突然遭受意想不到的经济损失或费用负担。",
      "example_en": "They were stung by unexpected repair bills after buying the old house.",
      "example_cn": "他们买下这栋老房子后，被突如其来的维修账单狠狠坑了一笔。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bite",
      "analysis": "“Bite”（咬）通常指用牙齿或类似结构夹住并可能撕裂皮肤，多用于动物或昆虫的攻击，但不必然涉及毒液。而 “stung” 特指通过毒刺或毒腺注入毒液造成的疼痛，具有明确的毒理特征。"
    },
    {
      "word_to_compare": "hurt",
      "analysis": "“Hurt”（受伤/疼痛）是一个通用词，涵盖各种程度和类型的疼痛，包括钝痛、酸痛或心理创伤，语义宽泛。而 “stung” 强调一种尖锐、突然、局部的刺痛感，常带有生理或情感上的强烈冲击。"
    },
    {
      "word_to_compare": "pained",
      "analysis": "“Pained”（痛苦的）是形容词，描述一种持续或深层的不适感，常用于表达情绪或身体上的忍耐性痛苦。而 “stung” 是动词的过去式，强调动作的瞬间性和尖锐性，更具动态和爆发性，常用于描述被外界刺激触发的反应。"
    }
  ]
}