{
  "word": "sub",
  "pronunciation": "suhb",
  "concise_definition": "n. 代课教师, 代替者; v. 代替, 代班",
  "forms": {
    "third_person_singular": "subs",
    "past_tense": "subbed",
    "past_participle": "subbed",
    "present_participle": "subbing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who temporarily takes the place of another, especially a teacher who fills in for an absent teacher in a school setting.",
      "explanation_cn": "指临时替代他人的人，尤指在学校中代替缺席教师的代课教师。",
      "example_en": "The students were quiet when the regular teacher was away, but they tested the sub's patience.",
      "example_cn": "当正课老师不在时，学生们还算安静，但他们却在考验代课老师的耐心。"
    },
    {
      "pos": "noun",
      "explanation_en": "A substitute player who enters a game to replace another player, commonly used in sports such as soccer, basketball, or football.",
      "explanation_cn": "指在体育比赛中替换上场的替补队员，常见于足球、篮球或橄榄球等运动。",
      "example_en": "The coach brought on a sub in the 70th minute to freshen up the attack.",
      "example_cn": "教练在第70分钟换上一名替补球员，以增强进攻火力。"
    },
    {
      "pos": "verb",
      "explanation_en": "To temporarily replace someone in their role or duties, especially in a professional or organized setting.",
      "explanation_cn": "指临时接替某人的职责或岗位，尤指在职业或有组织的环境中。",
      "example_en": "She subbed for her colleague during the conference while he attended a training session.",
      "example_cn": "她替同事代班参加了会议，而同事则去参加培训了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To insert or replace one thing with another, especially in media or editing contexts (e.g., substituting a word, image, or audio clip).",
      "explanation_cn": "指在媒体或编辑语境中，用一个事物替换另一个事物（如替换词语、图像或音频片段）。",
      "example_en": "The editor subbed out the original quote for a more accurate one from the interview transcript.",
      "example_cn": "编辑将原始引语替换为采访记录中更准确的一句。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "replacement",
      "analysis": "“Replacement” (替代者/替换物) 是一个名词，泛指任何被用来替代原物的人或物，强调结果而非行为。而 “sub” 作为名词时特指临时性替代，常用于教育或体育场景，带有即时性和短期性。"
    },
    {
      "word_to_compare": "stand-in",
      "analysis": "“Stand-in” (替身) 多用于影视或表演领域，指在拍摄时代替主要演员完成非关键镜头的人，通常不参与正式演出。而 “sub” 更广泛用于日常或职业场景，如代课、代班，强调职责的临时承接，而非形象替代。"
    },
    {
      "word_to_compare": "substitute",
      "analysis": "“Substitute” 是 “sub” 的完整形式，语义完全相同，但更正式、更通用，可用于任何领域（如食品、化学、教育等）。而 “sub” 是其口语化、缩略形式，多用于非正式语境，尤其在美式英语中常见于学校和体育场景。"
    }
  ]
}