{
  "word": "subjects",
  "pronunciation": "suhb·juhkts",
  "concise_definition": "n. 主题, 科目, 人, 臣民, 实验对象",
  "forms": {
    "singular": "subject"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A topic or area of study, especially in an educational context, that is taught or examined separately.",
      "explanation_cn": "指在教育环境中被单独教授或考核的一个主题或学习领域。",
      "example_en": "Mathematics and history are core subjects in most school curricula.",
      "example_cn": "数学和历史是大多数学校课程的核心科目。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that is being discussed, studied, or described in a particular context.",
      "explanation_cn": "指在特定语境中被讨论、研究或描述的人或事物。",
      "example_en": "The painting is a portrait of a young woman, the subject of the artist's most famous work.",
      "example_cn": "这幅画描绘了一位年轻女性，是这位艺术家最著名作品的主体。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is under the authority or control of a government or ruler, especially in a monarchy.",
      "explanation_cn": "指处于政府或统治者权威或控制之下的人，尤指君主制国家的臣民。",
      "example_en": "The king called upon his subjects to support the war effort.",
      "example_cn": "国王号召他的臣民支持战争努力。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or animal that is observed or tested in a scientific experiment.",
      "explanation_cn": "指在科学实验中被观察或测试的人或动物。",
      "example_en": "The study involved 50 human subjects who were monitored over six months.",
      "example_cn": "这项研究涉及50名被监测六个月的人体实验对象。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "topic",
      "analysis": "“Topic”（话题）泛指任何被讨论或写作的议题，语义更宽泛、更口语化，不一定具有系统性或教育性。而 “subject” 更常用于正式教育体系中，指有明确课程结构和教学目标的学科或领域。"
    },
    {
      "word_to_compare": "object",
      "analysis": "“Object”（对象）在科学语境中有时可与 “subject” 互换，但 “object” 更强调被研究的客体，常用于物理或哲学语境；而 “subject” 强调被观察或体验的主体，尤其在心理学、医学实验中更常用，暗示其有感知或反应能力。"
    },
    {
      "word_to_compare": "citizen",
      "analysis": "“Citizen”（公民）指享有法律权利和义务的国家成员，强调法律地位和政治参与；而 “subject”（臣民）多用于君主制语境，暗示服从权威，缺乏现代公民的自主权利，语义上更具历史和政治色彩。"
    }
  ]
}