{
  "word": "sublime",
  "pronunciation": "suh·blahym",
  "concise_definition": "adj. 崇高的, 卓越的, 极美的; v. 使升华, 使崇高",
  "forms": {
    "comparative": "sublimer",
    "superlative": "sublimest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Of such excellence, beauty, or grandeur as to inspire awe or admiration; transcending the ordinary and evoking a sense of the majestic or spiritual.",
      "explanation_cn": "指具有如此卓越的品质、美感或宏伟气势，令人敬畏或钦佩；超越平凡，唤起对崇高或神圣之物的感知。",
      "example_en": "The view from the mountaintop was sublime, with clouds drifting below like a sea of white.",
      "example_cn": "从山顶俯瞰，景色壮丽非凡，云朵在脚下如白色海洋般飘浮。"
    },
    {
      "pos": "adjective",
      "explanation_en": "So intense or extreme as to be almost overwhelming, especially in a positive or awe-inspiring way.",
      "explanation_cn": "指程度如此强烈或极端，几乎令人难以承受，尤指以积极或令人敬畏的方式呈现。",
      "example_en": "She delivered a sublime performance that left the audience speechless.",
      "example_cn": "她献上了一场令人屏息的精彩演出，令观众哑口无言。"
    },
    {
      "pos": "verb",
      "explanation_en": "To elevate or refine something to a higher, more spiritual or intellectual level; to transform by removing impurities or base elements.",
      "explanation_cn": "指将某物提升至更高、更精神化或理智化的层次；通过去除杂质或低俗成分而使其升华。",
      "example_en": "The poet sought to sublime the raw emotions of grief into timeless art.",
      "example_cn": "这位诗人试图将悲痛的原始情感升华成永恒的艺术。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "beautiful",
      "analysis": "“Beautiful” (美丽的) 是一个通用词，用于描述视觉或感官上的愉悦，范围广泛，可适用于日常事物。而 “sublime” 不仅包含美感，更强调一种超越性的崇高感、庄严感或精神震撼，常用于自然、艺术或道德层面的极致体验。"
    },
    {
      "word_to_compare": "magnificent",
      "analysis": "“Magnificent” (宏伟的) 强调规模、豪华或视觉上的壮丽，常用于建筑、庆典等外在表现。而 “sublime” 更侧重内在的深刻情感冲击和精神升华，不一定依赖于规模，甚至可以是寂静、渺小之物所引发的敬畏感。"
    },
    {
      "word_to_compare": "exquisite",
      "analysis": "“Exquisite” (精美的) 指细节精致、工艺完美，常用于工艺品、味道或感官体验的细腻层面。它强调的是完美无瑕的技艺，而 “sublime” 强调的是整体所激发的崇高情感，可能包含粗犷、震撼甚至恐怖的元素，如风暴或深渊。"
    }
  ]
}