{
  "word": "submitted",
  "pronunciation": "suhb·mit·id",
  "concise_definition": "adj. 递交的, 提交的; v. 提交, 呈交 (submit 的过去式和过去分词)",
  "forms": {
    "base_form": "submit",
    "third_person_singular": "submits",
    "past_tense": "submitted",
    "past_participle": "submitted",
    "present_participle": "submitting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To formally present or deliver something, such as a document, application, or proposal, to an authority, organization, or person for consideration, review, or approval.",
      "explanation_cn": "指正式地呈交、递交某物（如文件、申请或提案）给权威机构、组织或个人，以供考虑、审查或批准。",
      "example_en": "She submitted her thesis to the university committee last week.",
      "example_cn": "她上周将论文提交给了大学委员会。"
    },
    {
      "pos": "verb",
      "explanation_en": "To yield or surrender to the will, authority, or control of another, often reluctantly or after resistance.",
      "explanation_cn": "指（通常不情愿或经过抵抗后）屈从于他人的意志、权威或控制。",
      "example_en": "After hours of negotiation, the rebels finally submitted to the government's demands.",
      "example_cn": "经过数小时的谈判，叛军最终屈服于政府的要求。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that has been formally presented or delivered, especially in an official or formal context.",
      "explanation_cn": "形容某物已被正式递交或呈交，尤其用于正式场合。",
      "example_en": "The submitted applications will be reviewed by the selection panel.",
      "example_cn": "提交的申请将由选拔小组进行审核。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "filed",
      "analysis": "“Filed” (归档/呈交) 通常指将文件正式存入官方记录系统，强调程序性归档，多用于法律或行政语境。而 “submitted” 更强调主动递交的动作，不一定已完成归档，且适用范围更广，包括学术、商业或个人申请。"
    },
    {
      "word_to_compare": "delivered",
      "analysis": "“Delivered” (递送/交付) 侧重于物理或形式上的传递，如送信、送货或发表演讲，不一定涉及权威审查。而 “submitted” 隐含了接受方具有审查或决策权，具有更强的正式性和目的性。"
    },
    {
      "word_to_compare": "yielded",
      "analysis": "“Yielded” (让步/屈服) 与 “submitted” 在表示屈从时语义接近，但 “yielded” 更强调在压力下让出权利、空间或控制权，常用于交通、谈判或领土争端；而 “submitted” 更强调心理或意志上的彻底服从，常用于政治、组织或个人关系中。"
    }
  ]
}