{
  "word": "subscriber",
  "pronunciation": "səb·skraɪ·bər",
  "concise_definition": "n. 订阅者, 会员, 投资人",
  "forms": {
    "plural": "subscribers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person or organization that pays for regular access to a service, publication, or content, typically on a recurring basis such as monthly or annually.",
      "explanation_cn": "指为获得定期服务、出版物或内容而付费的人或组织，通常按月或按年持续付费。",
      "example_en": "The newspaper has over 50,000 subscribers who receive the print edition every morning.",
      "example_cn": "这份报纸有五万多名订阅者，每天早晨都能收到纸质版。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who signs up for or commits to a service, platform, or channel, especially in digital contexts such as YouTube, newsletters, or streaming services.",
      "explanation_cn": "指在数字环境中注册或承诺使用某项服务、平台或频道的人，例如 YouTube 频道、电子报或流媒体服务。",
      "example_en": "Her YouTube channel has more than a million subscribers who watch her weekly tutorials.",
      "example_cn": "她的 YouTube 频道拥有超过一百万订阅者，观看她每周的教学视频。"
    },
    {
      "pos": "noun",
      "explanation_en": "In finance, a person who agrees to purchase shares in a company during its formation or capital increase, often before shares are publicly offered.",
      "explanation_cn": "在金融领域，指在公司成立或增资时同意认购股份的人，通常在股份公开募股之前。",
      "example_en": "The startup secured funding from several key subscribers who committed to buying equity in the early stage.",
      "example_cn": "这家初创公司从几位关键投资人处获得融资，他们承诺在早期阶段认购公司股份。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "member",
      "analysis": "“Member”（成员）泛指属于某个组织、团体或俱乐部的人，其关系可能基于自愿加入、资格或身份，不一定涉及付费。而 “subscriber” 强调通过付费获得持续服务或内容访问权，具有明确的商业契约性质。"
    },
    {
      "word_to_compare": "audience",
      "analysis": "“Audience”（观众/受众）指接收信息或内容的群体，是被动的接收者，不必然有主动订阅行为。而 “subscriber” 是主动选择付费或注册以持续获取内容的个体，具有更高的参与度和忠诚度。"
    },
    {
      "word_to_compare": "customer",
      "analysis": "“Customer”（顾客）指购买商品或服务的个人，交易通常是一次性的或非持续性的。而 “subscriber” 的核心特征是持续性付费关系，强调长期互动和定期交付，如月度会员制。"
    }
  ]
}