{
  "word": "subsidies",
  "pronunciation": "suhb·sid·eez",
  "concise_definition": "n. 补贴, 津贴, 财政援助",
  "forms": {
    "singular": "subsidy"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Financial assistance provided by a government or organization to support a specific industry, business, or group of people, often to reduce costs, encourage production, or promote social welfare.",
      "explanation_cn": "政府或组织为支持特定行业、企业或群体而提供的财政援助，通常用于降低生产成本、鼓励产出或促进社会福利。",
      "example_en": "The government granted agricultural subsidies to help farmers cope with rising fertilizer prices.",
      "example_cn": "政府向农民提供农业补贴，以帮助他们应对化肥价格上涨。"
    },
    {
      "pos": "noun",
      "explanation_en": "A payment or benefit given to lower the price of a good or service for consumers, making it more affordable or accessible.",
      "explanation_cn": "为降低商品或服务价格、使其更易负担或获取而向消费者提供的付款或福利。",
      "example_en": "Electric vehicle subsidies have made clean transportation more affordable for middle-income families.",
      "example_cn": "电动汽车补贴使清洁能源交通对中等收入家庭更加可负担。"
    },
    {
      "pos": "noun",
      "explanation_en": "Support provided to sustain an activity or sector that would otherwise be unprofitable or unsustainable, often for strategic or political reasons.",
      "explanation_cn": "为维持本无利可图或不可持续的活动或行业而提供的支持，通常出于战略或政治考量。",
      "example_en": "The state continues to provide subsidies to its coal industry despite environmental concerns.",
      "example_cn": "尽管存在环境问题，该国仍继续向煤炭行业提供补贴。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "grants",
      "analysis": "“Grants”（拨款）通常是无须偿还的财政支持，常用于教育、科研或非营利项目，强调资金的无偿性和特定用途；而 “subsidies” 更侧重于通过降低价格或成本来间接支持经济活动，常用于商业或产业领域，具有持续性和市场调节性质。"
    },
    {
      "word_to_compare": "tax breaks",
      "analysis": "“Tax breaks”（税收减免）是通过减少应缴税款来提供经济激励，属于间接财政支持；而 “subsidies” 是直接的资金转移或支付，形式更明确、更易量化。两者目的相似，但实现方式不同：一个是减少支出，一个是增加收入。"
    },
    {
      "word_to_compare": "benefits",
      "analysis": "“Benefits”（福利）通常指个人或家庭从社会保障体系中获得的援助，如失业救济、医疗补助，侧重于社会安全网；而 “subsidies” 更多面向企业、行业或公共产品，目的是影响市场行为或经济结构，范围更广、更具政策导向性。"
    }
  ]
}