{
  "word": "substitute",
  "pronunciation": "suhb·stuh·tyoot",
  "concise_definition": "n. 替代品, 代替者; v. 替代, 代替",
  "forms": {
    "plural": "substitutes",
    "third_person_singular": "substitutes",
    "past_tense": "substituted",
    "past_participle": "substituted",
    "present_participle": "substituting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person or thing that takes the place of another, especially when the original is unavailable, absent, or unsuitable.",
      "explanation_cn": "指在原有人或物不可用、缺席或不适宜时，取而代之的人或物。",
      "example_en": "The coach brought in a substitute goalkeeper after the starter got injured.",
      "example_cn": "主力门将受伤后，教练换上了一名替补门将。"
    },
    {
      "pos": "noun",
      "explanation_en": "A material or item used in place of another, often due to scarcity, cost, or convenience, even if not identical.",
      "explanation_cn": "指因稀缺、成本或便利而被用来替代另一种材料或物品的替代品，即使二者并不完全相同。",
      "example_en": "Many bakers use honey as a substitute for sugar in their recipes.",
      "example_cn": "许多烘焙师在食谱中用蜂蜜代替糖。"
    },
    {
      "pos": "verb",
      "explanation_en": "To replace one person or thing with another, especially temporarily or out of necessity.",
      "explanation_cn": "指用另一个人或物替换某人或某物，通常是临时的或出于必要。",
      "example_en": "She substituted butter with olive oil to make the cake healthier.",
      "example_cn": "她用橄榄油代替黄油，使蛋糕更健康。"
    },
    {
      "pos": "verb",
      "explanation_en": "To perform the duties or role of someone else in their absence.",
      "explanation_cn": "指在他人缺席时承担其职责或角色。",
      "example_en": "The assistant manager substituted for the director during the conference.",
      "example_cn": "助理经理在会议期间代替了总监的职责。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "replacement",
      "analysis": "“Replacement” (替代物/替代者) 更强调最终的、永久性的替换，通常意味着原物已被淘汰或不再使用。而 “substitute” 更常用于临时性或权宜性的替代，不一定意味着永久变更。"
    },
    {
      "word_to_compare": "alternative",
      "analysis": "“Alternative” (替代方案) 指在多个选项中可供选择的另一方案，强调选择的多样性，不一定是因原物缺失而被迫使用。而 “substitute” 通常隐含原物不可用，必须用它来填补空缺，带有功能性替代的意味。"
    },
    {
      "word_to_compare": "swap",
      "analysis": "“Swap” (交换) 指双方互换位置或物品，是双向行为，强调对等交换。而 “substitute” 是单向的替代行为，通常是一个事物取代另一个，不涉及返还或互换。"
    }
  ]
}