{
  "word": "suckers",
  "pronunciation": "suhk·uhrz",
  "concise_definition": "n. 容易上当的人, 吸盘, 吸管, 吸吮者",
  "forms": {
    "singular": "sucker"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who is easily deceived or tricked, often because of their naivety or excessive trust; used informally and sometimes derogatorily.",
      "explanation_cn": "指因天真或过度信任而容易被欺骗或愚弄的人，常用于非正式语境，有时带有贬义。",
      "example_en": "He bought the fake watch at a high price—he's such a sucker for shiny things.",
      "example_cn": "他花高价买了那块假表——他就是对闪亮的东西毫无抵抗力。"
    },
    {
      "pos": "noun",
      "explanation_en": "A structure or organ in animals or plants that functions to attach or draw in fluids, such as the adhesive discs on an octopus's tentacles or the mouthparts of insects.",
      "explanation_cn": "指动物或植物中用于附着或吸吮液体的结构或器官，例如章鱼触手上的吸盘或昆虫的口器。",
      "example_en": "The leech attached itself to the skin with its suckers.",
      "example_cn": "水蛭用它的吸盘贴在了皮肤上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A straw or tube used for drinking liquids, especially in informal or colloquial contexts.",
      "explanation_cn": "指用于吸饮液体的吸管，尤其在非正式或口语语境中。",
      "example_en": "Can you pass me a sucker for this milkshake?",
      "example_cn": "你能把吸管递给我吗？这奶昔要吸着喝。"
    },
    {
      "pos": "noun",
      "explanation_en": "A plant shoot or stem that grows from the base of a plant or from its roots, often removed to encourage better growth of the main plant.",
      "explanation_cn": "指从植物基部或根部长出的枝条或嫩芽，常被修剪以促进主株更好地生长。",
      "example_en": "The gardener trimmed the suckers from the tomato plant to improve fruit production.",
      "example_cn": "园丁修剪了番茄植株上的侧枝，以提高果实产量。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fool",
      "analysis": "“Fool”（傻瓜）泛指缺乏智慧或判断力的人，语气较中性或文学化；而 “sucker” 更强调因轻信或贪心而被利用的被动受害状态，带有更强的口语化和贬义色彩，常暗示被欺骗的可悲性。"
    },
    {
      "word_to_compare": "吸盘 (suction cup)",
      "analysis": "“吸盘”是中文对物理吸附装置的直译，强调其功能是依靠负压吸附表面，多用于工业或家居场景；而 “sucker” 作为英语词，既可指物理吸盘，也可引申为人物，语义更丰富，且在口语中常用于比喻。"
    },
    {
      "word_to_compare": "straw",
      "analysis": "“Straw”（吸管）是标准术语，专指用于饮用的细管，中性且无歧义；而 “sucker” 作为吸管的非正式说法，多见于美式口语，常用于儿童语境或轻松场合，语义范围更广，可能引发歧义。"
    }
  ]
}