{
  "word": "sucker",
  "pronunciation": "suhk·er",
  "concise_definition": "n. 容易上当的人, 吸盘, 吸管, 吸食者",
  "forms": {
    "plural": "suckers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who is easily deceived or cheated, often because they are overly trusting or gullible.",
      "explanation_cn": "指因过于信任或轻信而容易被欺骗或占便宜的人。",
      "example_en": "He bought the fake watch at a high price—he’s such a sucker for shiny things.",
      "example_cn": "他花高价买了那块假表——他就是对闪亮的东西毫无抵抗力。"
    },
    {
      "pos": "noun",
      "explanation_en": "A structure or organ in animals that functions to suck or attach by creating suction, such as the mouthparts of an insect or the adhesive discs of an octopus.",
      "explanation_cn": "指动物体内用于吸吮或通过负压吸附的结构或器官，如昆虫的口器或章鱼的吸盘。",
      "example_en": "The leech attached itself to the skin with its suckers.",
      "example_cn": "水蛭用它的吸盘贴在了皮肤上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A tube or device used for drawing liquids, especially one used to drink through, such as a plastic straw.",
      "explanation_cn": "指用于吸饮液体的管状装置，尤指塑料吸管。",
      "example_en": "She sipped her smoothie through a colorful sucker.",
      "example_cn": "她通过一根彩色吸管啜饮着奶昔。"
    },
    {
      "pos": "noun",
      "explanation_en": "A plant shoot or stem that grows from the base of a plant or tree, often considered undesirable in gardening.",
      "explanation_cn": "指从植物或树木基部生长出的枝条，园艺中常被视为有害的萌蘖。",
      "example_en": "The gardener removed the suckers from the apple tree to encourage better fruit production.",
      "example_cn": "园丁移除了苹果树上的萌蘖，以促进更好的结果。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fool",
      "analysis": "“Fool”（傻瓜）泛指缺乏智慧或判断力的人，语气较中性或贬义，但不一定强调被欺骗的经历。而 “sucker” 更强调因轻信而被利用或占便宜的特定情境，带有更强的口语化和贬损色彩，常隐含‘活该被坑’的意味。"
    },
    {
      "word_to_compare": "straw",
      "analysis": "“Straw”（吸管）是中性、标准的术语，用于描述饮用液体的工具，无情感色彩。而 “sucker” 作为吸管的非正式说法，常用于口语或儿童语境，有时带有轻微贬义或戏谑语气，如‘你真像个吸管，只会吸’。"
    },
    {
      "word_to_compare": "sprout",
      "analysis": "“Sprout”（萌芽）指植物新长出的嫩芽，通常为中性或积极含义，强调生长的开始。而 “sucker” 在植物语境中特指从根部或主干非预期位置长出的枝条，常被视为干扰正常生长的赘生物，带有负面评价。"
    }
  ]
}