{
  "word": "sudanese",
  "pronunciation": "soo·duh·neez",
  "concise_definition": "adj. 苏丹的, 苏丹人的; n. 苏丹人, 苏丹语",
  "forms": {
    "plural": "Sudanese"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or originating from Sudan, a country in northeastern Africa, including its culture, people, language, or geography.",
      "explanation_cn": "与苏丹（非洲东北部国家）相关或源自苏丹的，包括其文化、人民、语言或地理特征。",
      "example_en": "Sudanese cuisine is known for its use of spices and grilled meats.",
      "example_cn": "苏丹菜以其香料和烤肉而闻名。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Denoting the people or ethnic groups native to Sudan, such as the Nubians, Beja, or Dinka.",
      "explanation_cn": "指苏丹的原住民或民族群体，如努比亚人、贝贾人或丁卡人。",
      "example_en": "Many Sudanese communities maintain traditional oral storytelling practices.",
      "example_cn": "许多苏丹社群仍保留着传统的口头叙事习俗。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is a native or citizen of Sudan.",
      "explanation_cn": "指苏丹的原住民或公民。",
      "example_en": "The Sudanese have endured decades of political instability and civil conflict.",
      "example_cn": "苏丹人经历了数十年的政治动荡和内战。"
    },
    {
      "pos": "noun",
      "explanation_en": "The Arabic-based language spoken by many in Sudan, often referred to as Sudanese Arabic.",
      "explanation_cn": "指苏丹许多地区使用的以阿拉伯语为基础的语言，常被称为苏丹阿拉伯语。",
      "example_en": "Sudanese is the most widely spoken language in daily life across the country.",
      "example_cn": "苏丹语是全国日常生活中使用最广泛的语言。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "Sudan",
      "analysis": "“Sudan” 是国家名称，作为专有名词指地理或政治实体；而 “Sudanese” 是形容词或名词，用于描述与该国相关的属性或人群。两者不可互换，但常在语境中共同出现。"
    },
    {
      "word_to_compare": "African",
      "analysis": "“African” 是一个更广泛的地理文化术语，泛指整个非洲大陆的人或事物；而 “Sudanese” 是其下位概念，特指苏丹这一国家的属性。所有苏丹人都是非洲人，但并非所有非洲人都是苏丹人。"
    },
    {
      "word_to_compare": "Arabic",
      "analysis": "“Arabic” 指标准阿拉伯语或其广泛使用的方言体系，是整个阿拉伯世界的通用语言；而 “Sudanese”（作为语言义项）特指苏丹地区使用的阿拉伯语变体，具有独特的词汇、发音和语法特征，是阿拉伯语的一个区域性分支。"
    }
  ]
}