{
  "word": "sugar",
  "pronunciation": "shoo·guhr",
  "concise_definition": "n. 糖, 甜味剂; v. 用糖调味, 使变甜",
  "forms": {
    "plural": "sugars"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sweet, crystalline substance derived from plants such as sugarcane or sugar beets, used to add sweetness to food and drink; chemically, it primarily refers to sucrose.",
      "explanation_cn": "一种从甘蔗或甜菜等植物中提取的甜味晶体物质，用于为食品和饮料增添甜味；化学上主要指蔗糖。",
      "example_en": "She added a teaspoon of sugar to her coffee.",
      "example_cn": "她在咖啡里加了一茶匙糖。"
    },
    {
      "pos": "noun",
      "explanation_en": "Any of various sweet-tasting carbohydrates, including glucose, fructose, and lactose, that occur naturally in fruits, milk, and honey.",
      "explanation_cn": "泛指各种天然存在于水果、牛奶和蜂蜜中的甜味碳水化合物，包括葡萄糖、果糖和乳糖。",
      "example_en": "Fruits contain natural sugars that provide energy without added calories.",
      "example_cn": "水果中含有天然糖分，能提供能量而无需额外添加热量。"
    },
    {
      "pos": "noun",
      "explanation_en": "Something sweet or pleasant, often used metaphorically to describe affectionate or flattering words or behavior.",
      "explanation_cn": "比喻意义上指甜美或令人愉悦的事物，常用于形容亲切或奉承的话语或行为。",
      "example_en": "He gave her nothing but sugar and compliments all evening.",
      "example_cn": "整个晚上他都对她甜言蜜语，不断奉承。"
    },
    {
      "pos": "verb",
      "explanation_en": "To add sugar to something, especially food or drink, to make it sweeter.",
      "explanation_cn": "在食物或饮料中加入糖，使其变得更甜。",
      "example_en": "She sugared her tea before drinking it.",
      "example_cn": "她喝茶之前在茶里加了糖。"
    },
    {
      "pos": "verb",
      "explanation_en": "To coat or cover something with sugar, often for preservation or decoration.",
      "explanation_cn": "用糖覆盖或包裹某物，常用于保存或装饰目的。",
      "example_en": "The baker sugared the edges of the pastry for a sparkling finish.",
      "example_cn": "面包师在糕点边缘撒上糖，使其呈现出闪亮的外观。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sweetener",
      "analysis": "“Sweetener”（甜味剂）是一个更广泛的术语，泛指任何能赋予甜味的物质，包括人工合成的（如阿斯巴甜、糖精）和天然的（如蜂蜜、甜菊糖）。而 “sugar” 特指从植物中提取的天然碳水化合物，尤其是蔗糖，具有明确的化学定义和热量值。"
    },
    {
      "word_to_compare": "honey",
      "analysis": "“Honey”（蜂蜜）是一种天然的甜味物质，由蜜蜂采集花蜜制成，含有多种糖分（果糖、葡萄糖）以及微量营养素和芳香物质。虽然它也是一种糖，但 “honey” 强调其天然来源、独特风味和营养价值，而 “sugar” 通常指精炼后纯净的蔗糖，味道单一、无其他成分。"
    },
    {
      "word_to_compare": "candy",
      "analysis": "“Candy”（糖果）是含有糖的加工食品，通常还包含香料、色素和脂肪，是一种含糖的零食产品。而 “sugar” 是糖果的主要成分，但本身不是食品，而是调味或原料。可以说，糖是糖果的原料，糖果是糖的载体。"
    }
  ]
}