{
  "word": "sun",
  "pronunciation": "sun",
  "concise_definition": "n. 太阳, 日光, 日子, 光明",
  "forms": {
    "plural": "suns"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The star at the center of the solar system, around which the Earth and other planets revolve; the source of light and heat for Earth.",
      "explanation_cn": "太阳系的中心恒星，地球及其他行星围绕其运转；为地球提供光和热的天体。",
      "example_en": "The sun rose slowly over the horizon, painting the sky in shades of orange and pink.",
      "example_cn": "太阳缓缓从地平线上升起，将天空染成橙粉相间的色彩。"
    },
    {
      "pos": "noun",
      "explanation_en": "Any similar star in another solar system, especially when referred to in astronomical contexts.",
      "explanation_cn": "在天文学语境中，指其他恒星系统中类似太阳的恒星。",
      "example_en": "Astronomers have discovered thousands of exoplanets orbiting other suns in our galaxy.",
      "example_cn": "天文学家已在我们的银河系中发现了数千颗围绕其他恒星运行的系外行星。"
    },
    {
      "pos": "noun",
      "explanation_en": "A period of daylight or a day as measured by the position of the sun; often used poetically or idiomatically.",
      "explanation_cn": "指由太阳位置所衡量的一段白昼时间，或泛指一天；常用于诗意或习语表达。",
      "example_en": "She spent her childhood under the sun, playing barefoot in the fields.",
      "example_cn": "她在阳光下度过了童年，在田野里赤脚奔跑。"
    },
    {
      "pos": "noun",
      "explanation_en": "A symbol of light, warmth, life, or authority; often used metaphorically in literature and culture.",
      "explanation_cn": "象征光明、温暖、生命或权威；常在文学和文化中用作隐喻。",
      "example_en": "He was the sun of the family, bringing warmth and joy to everyone around him.",
      "example_cn": "他是家中的太阳，为身边所有人带来温暖与欢乐。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "star",
      "analysis": "“Star”（恒星）是一个泛指天体的术语，指宇宙中任何发光的球状天体，而 “sun” 特指我们太阳系的中心恒星。在非天文学语境中，人们通常只用 “sun” 指代地球的光源，而 “star” 多用于指夜空中其他遥远的恒星。"
    },
    {
      "word_to_compare": "daylight",
      "analysis": "“Daylight”（日光）指太阳升起后到日落前的自然光线，强调的是光本身，而非光源实体。而 “sun” 指的是发光的天体本身，是产生 daylight 的源头。例如，我们说 “enjoy the sunlight”（享受阳光），但说 “the sun is shining”（太阳在照耀）。"
    },
    {
      "word_to_compare": "shine",
      "analysis": "“Shine”（发光）是动词，描述太阳或其他光源发出光的行为，而 “sun” 是名词，指发出光的实体。二者词性不同，但常在语义上关联：太阳是 shine 的主体，而 shine 是太阳的典型动作。"
    }
  ]
}