{
  "word": "superintendent",
  "pronunciation": "soo·per·in·ten·dent",
  "concise_definition": "n. 主管, 负责人, 校长, 警长",
  "forms": {
    "plural": "superintendents"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who is in charge of an organization, institution, or system, especially one with multiple departments or locations, responsible for overall management and supervision.",
      "explanation_cn": "指负责管理一个组织、机构或系统的人员，尤其指拥有多个部门或分支机构的单位，承担总体管理和监督职责。",
      "example_en": "The school superintendent announced new curriculum guidelines for the upcoming academic year.",
      "example_cn": "校长宣布了下一学年的新课程指南。"
    },
    {
      "pos": "noun",
      "explanation_en": "In law enforcement, the highest-ranking officer in a police department, typically overseeing multiple precincts or divisions.",
      "explanation_cn": "在执法部门中，指警局中最高级别的官员，通常负责监督多个警区或部门。",
      "example_en": "The superintendent led the investigation into the city-wide robbery spree.",
      "example_cn": "警长领导了对全市系列抢劫案的调查。"
    },
    {
      "pos": "noun",
      "explanation_en": "In construction or maintenance, a person responsible for supervising workers and ensuring that projects are completed according to plans and regulations.",
      "explanation_cn": "在建筑或维护领域，指负责监督工人、确保项目按计划和规范完成的管理人员。",
      "example_en": "The building superintendent inspected the fire safety systems before the occupancy permit was issued.",
      "example_cn": "大楼管理员在颁发入住许可证前检查了消防系统。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "director",
      "analysis": "“Director”（主管/总监）通常用于企业、艺术或行政机构中，强调战略规划和决策，职位层级可能更高，但不一定直接管理日常运营。而 “superintendent” 更侧重于实际的现场监督和执行管理，常用于公共机构或技术性系统中。"
    },
    {
      "word_to_compare": "manager",
      "analysis": "“Manager”（经理）是一个通用词，适用于各种规模和类型的组织，职责范围可大可小。而 “superintendent” 通常指更高层级、更全面的监督角色，尤其在政府、教育或公共设施领域，具有更强的权威性和系统性。"
    },
    {
      "word_to_compare": "chief",
      "analysis": "“Chief”（首领/长官）是更口语化或传统的称呼，常用于警察、消防等机构中，如 “chief of police”。它强调身份和等级，但不一定明确职责范围；而 “superintendent” 是正式头衔，明确包含管理、监督和行政责任，更具制度性。"
    }
  ]
}