{
  "word": "supplement",
  "pronunciation": "suhp·luh·muhnt",
  "concise_definition": "n. 补充物, 补品; v. 补充, 增补",
  "forms": {
    "plural": "supplements",
    "third_person_singular": "supplements",
    "past_tense": "supplemented",
    "past_participle": "supplemented",
    "present_participle": "supplementing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Something added to complete or enhance something else, especially a nutrient or vitamin taken to improve health or compensate for dietary deficiencies.",
      "explanation_cn": "指为补充或增强某物而添加的部分，尤指为改善健康或弥补饮食不足而服用的营养素或维生素。",
      "example_en": "Many people take vitamin D supplements to support bone health.",
      "example_cn": "许多人服用维生素D补充剂以促进骨骼健康。"
    },
    {
      "pos": "noun",
      "explanation_en": "An additional section or part added to a book, document, or publication to provide extra information not included in the original version.",
      "explanation_cn": "指为书籍、文件或出版物添加的额外部分，以提供原始版本中未包含的补充信息。",
      "example_en": "The publisher released a supplement to the encyclopedia with updated entries on recent scientific discoveries.",
      "example_cn": "出版社发布了百科全书的增补版，加入了关于最新科学发现的更新条目。"
    },
    {
      "pos": "verb",
      "explanation_en": "To add something to make up for a deficiency or to improve completeness, often in the context of diet, information, or resources.",
      "explanation_cn": "指通过添加某些内容来弥补不足或增强完整性，常用于饮食、信息或资源的语境中。",
      "example_en": "The dietitian recommended supplementing his meals with protein shakes.",
      "example_cn": "营养师建议他用蛋白粉来补充正餐。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provide additional material that complements or extends the original content, such as in publications or data sets.",
      "explanation_cn": "指提供补充性材料以增强或扩展原始内容，例如在出版物或数据集中。",
      "example_en": "The research paper was supplemented with detailed charts and statistical analyses.",
      "example_cn": "这篇研究论文附上了详细图表和统计分析作为补充。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "addition",
      "analysis": "“Addition” (添加物) 是一个更通用的词，泛指任何被加入的事物，不强调是否为弥补不足或增强功能。而 “supplement” 更特指为了完善、弥补缺陷或增强原有内容而添加的部分，具有明确的补偿性或辅助性目的。"
    },
    {
      "word_to_compare": "adjunct",
      "analysis": "“Adjunct” (附属物) 指与主要事物相关但非核心的附加部分，常用于正式或学术语境，强调其辅助性地位，但不一定用于弥补缺失。而 “supplement” 更强调功能上的补充作用，常用于营养、信息或资源的缺失场景。"
    },
    {
      "word_to_compare": "enhancement",
      "analysis": "“Enhancement” (提升/改进) 指对原有事物进行优化或加强，使其质量或性能更好，通常不包含“弥补缺失”的含义。而 “supplement” 更侧重于填补空白或不足，而非单纯提升水平。例如，补充维生素是为了解决缺乏，而增强免疫力是提升现有能力。"
    }
  ]
}