{
  "word": "supporting",
  "pronunciation": "suhp·port·ing",
  "concise_definition": "adj. 支持的, 辅助的, 从属的",
  "forms": {
    "base_form": "support",
    "comparative": "more supporting",
    "superlative": "most supporting"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Providing assistance, encouragement, or resources to help someone or something succeed or function effectively; not primary but essential to the main effort.",
      "explanation_cn": "提供帮助、鼓励或资源以促进某人或某事物的成功或有效运作；虽非主要，但对核心事务至关重要。",
      "example_en": "She played a supporting role in the film, helping the lead actor deliver a powerful performance.",
      "example_cn": "她在电影中饰演配角，帮助主角呈现出有力的表演。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used to describe evidence, arguments, or materials that reinforce or substantiate a main claim or position.",
      "explanation_cn": "用于描述用来强化或证实主要主张或立场的证据、论点或材料。",
      "example_en": "The report included several supporting documents to verify the data.",
      "example_cn": "该报告附有若干支持性文件以核实数据。"
    },
    {
      "pos": "adjective",
      "explanation_en": "In theater, film, or performance, referring to a character or actor whose role is secondary to the main protagonist but still contributes significantly to the narrative.",
      "explanation_cn": "在戏剧、电影或表演中，指角色或演员虽非主角，但对叙事有重要贡献。",
      "example_en": "His supporting performance earned him critical acclaim, even though he wasn't the lead.",
      "example_cn": "尽管他不是主角，但其配角表演赢得了广泛赞誉。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "auxiliary",
      "analysis": "“Auxiliary”（辅助的）更强调功能性上的补充，常用于技术、机械或系统语境，如辅助电源、辅助设备，侧重于“非核心但可启用”的属性。而 “supporting” 更广泛用于人际、情感或叙事语境，强调情感或结构上的支持作用。"
    },
    {
      "word_to_compare": "subsidiary",
      "analysis": "“Subsidiary”（附属的）通常指法律或组织结构中的从属关系，如子公司是母公司的附属实体，具有独立性但受控于主实体。而 “supporting” 不一定涉及组织隶属，仅表示功能上的协助，语义更轻、更灵活。"
    },
    {
      "word_to_compare": "supplementary",
      "analysis": "“Supplementary”（补充的）强调在原有基础上增加额外内容以完善整体，如补充教材、补充说明，常用于教育或学术场景。而 “supporting” 更侧重于“支撑”主干，是结构性的依赖，而非单纯添加。"
    }
  ]
}