{
  "word": "surface",
  "pronunciation": "sər·fis",
  "concise_definition": "n. 表面, 表象; v. 浮出, 出现",
  "forms": {
    "plural": "surfaces",
    "third_person_singular": "surfaces",
    "past_tense": "surfaced",
    "past_participle": "surfaced",
    "present_participle": "surfacing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The outer or top layer of a physical object or area, which can be seen or touched; the boundary between two different media (e.g., air and water).",
      "explanation_cn": "指一个物体或区域的最外层或顶部，可以被看见或触摸；两个不同介质（如空气与水）之间的分界面。",
      "example_en": "The surface of the lake was smooth as glass after the wind died down.",
      "example_cn": "风停后，湖面如镜般平静。"
    },
    {
      "pos": "noun",
      "explanation_en": "The outward appearance or impression of something, often concealing a deeper or different reality; a superficial level of understanding or behavior.",
      "explanation_cn": "指某事物的外在表现或印象，常掩盖了更深层或不同的真实情况；一种肤浅的理解或行为层面。",
      "example_en": "He maintained a calm surface, but inside he was panicking.",
      "example_cn": "他表面上镇定自若，内心却惊慌失措。"
    },
    {
      "pos": "verb",
      "explanation_en": "To come up to or appear at the surface, especially after being hidden, submerged, or unnoticed for a period of time.",
      "explanation_cn": "指从隐藏、淹没或被忽视的状态中浮现或出现，尤指到达表面。",
      "example_en": "After weeks of silence, the truth finally surfaced.",
      "example_cn": "经过数周的沉默，真相终于浮出水面。"
    },
    {
      "pos": "verb",
      "explanation_en": "To treat or prepare a surface, especially by cleaning, smoothing, or coating it for aesthetic or functional purposes.",
      "explanation_cn": "指对表面进行处理，例如清洁、打磨或涂覆，以达到美观或功能性的目的。",
      "example_en": "The carpenter sanded and varnished the table to surface it properly.",
      "example_cn": "木匠打磨并上漆，以妥善处理桌面表面。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "skin",
      "analysis": "“Skin” (皮肤/表皮) 通常特指生物体最外层的组织，如动物或人的皮肤，具有生理功能；而 “surface” 更广泛，可指任何物体（包括无生命物）的外层，不强调生物属性。"
    },
    {
      "word_to_compare": "appearance",
      "analysis": "“Appearance” (外观/表象) 更侧重于视觉印象或给人的整体感觉，常用于抽象语境（如人的仪表、事物的呈现方式）；而 “surface” 在作‘表象’解时，隐含‘浅层、非本质’的贬义色彩，常与深层真相形成对比。"
    },
    {
      "word_to_compare": "top",
      "analysis": "“Top” (顶部) 指物体的最高点或最上部分，强调空间位置；而 “surface” 强调的是整个外层接触面，不一定是最高点。例如，一个球体的表面是整个外层，但它的 top 只是一个点。"
    }
  ]
}