{
  "word": "surf",
  "pronunciation": "sɜːrf",
  "concise_definition": "v. 冲浪, 浏览; n. 冲浪, 波浪",
  "forms": {
    "third_person_singular": "surfs",
    "past_tense": "surfed",
    "past_participle": "surfed",
    "present_participle": "surfing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To ride on the crest of a wave using a surfboard, typically as a recreational activity in the ocean.",
      "explanation_cn": "指使用冲浪板在海浪的浪尖上滑行，通常作为一种在海洋中的休闲活动。",
      "example_en": "Every weekend, he drives to the coast to surf the big waves.",
      "example_cn": "每个周末，他都会开车去海边冲大浪。"
    },
    {
      "pos": "verb",
      "explanation_en": "To browse or navigate through information, especially on the internet, in a casual or aimless way.",
      "explanation_cn": "指随意地浏览或在互联网上查找信息，通常没有明确目标。",
      "example_en": "She spent the evening surfing social media and watching videos.",
      "example_cn": "她整个晚上都在浏览社交媒体和看视频。"
    },
    {
      "pos": "noun",
      "explanation_en": "The waves breaking on the shore, especially those suitable for surfing; the act or condition of waves breaking.",
      "explanation_cn": "指拍打在岸边的海浪，尤指适合冲浪的波浪；或指波浪拍打的状态或现象。",
      "example_en": "The surf was rough today, so the lifeguards closed the beach.",
      "example_cn": "今天海浪很汹涌，救生员关闭了海滩。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of surfing, especially as a sport or pastime.",
      "explanation_cn": "指冲浪这一行为，尤其作为一项运动或消遣方式。",
      "example_en": "He has been surfing since he was ten and now competes professionally.",
      "example_cn": "他十岁就开始冲浪，如今已是职业选手。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "wave",
      "analysis": "“Wave” (波浪) 是一个更广泛的术语，泛指任何水体表面的起伏运动，包括海浪、声波、电磁波等。而 “surf” 作为名词时特指适合冲浪的、拍打岸边的海浪，具有明确的运动和使用场景。"
    },
    {
      "word_to_compare": "browse",
      "analysis": "“Browse” (浏览) 与 “surf” 在互联网语境下常可互换，但 “browse” 更中性、更普遍，可用于图书馆、商店或网站的任意查找行为；而 “surf” 带有更轻松、随意、甚至漫无目的的意味，常用于描述网络冲浪的休闲感。"
    },
    {
      "word_to_compare": "ride",
      "analysis": "“Ride” (骑/乘) 是一个更通用的动词，可指骑马、乘车、乘风等；当用于冲浪时，可以说 “ride the waves”，但 “surf” 是专指使用冲浪板在浪尖上滑行的特定行为，具有技术性和文化内涵，是更精确的术语。"
    }
  ]
}