{
  "word": "surprise",
  "pronunciation": "suhr·praiz",
  "concise_definition": "n. 惊讶, 意外; v. 使惊讶, 给予惊喜",
  "forms": {
    "third_person_singular": "surprises",
    "past_tense": "surprised",
    "past_participle": "surprised",
    "present_participle": "surprising",
    "noun_plural": "surprises"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An unexpected event, occurrence, or piece of information that causes a feeling of astonishment or wonder, often due to its suddenness or unanticipated nature.",
      "explanation_cn": "指一个出乎意料的事件、发生或信息，因其突然性或不可预见性而引发惊讶或惊叹的情绪。",
      "example_en": "The surprise party left her speechless with joy.",
      "example_cn": "这场惊喜派对让她欣喜得说不出话来。"
    },
    {
      "pos": "noun",
      "explanation_en": "A gift, event, or experience deliberately arranged to delight someone by being unexpected.",
      "explanation_cn": "指特意安排的礼物、活动或体验，旨在通过出人意料的方式让人感到愉悦。",
      "example_en": "He gave her a surprise vacation to Paris for their anniversary.",
      "example_cn": "他为他们的周年纪念日送了她一个去巴黎的惊喜旅行。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause someone to feel sudden astonishment or shock, often by something unexpected or unprepared for.",
      "explanation_cn": "指因某件出乎意料或毫无准备的事情，使某人感到突然的惊讶或震惊。",
      "example_en": "The sudden announcement surprised everyone in the meeting.",
      "example_cn": "这个突如其来的宣布让会议中的所有人都感到惊讶。"
    },
    {
      "pos": "verb",
      "explanation_en": "To catch someone off guard, especially in a way that reveals something hidden or exposes a weakness.",
      "explanation_cn": "指出其不意地抓住某人，常用于揭露隐藏的事物或暴露弱点。",
      "example_en": "The detective surprised the thief by appearing behind him.",
      "example_cn": "侦探从背后突然出现，让小偷措手不及。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "shock",
      "analysis": "“Shock”（震惊）比 “surprise” 更强烈，通常带有负面或创伤性的情感色彩，如因噩耗、事故或严重背叛而震惊。而 “surprise” 可以是中性或积极的，如惊喜派对或意外的好消息。"
    },
    {
      "word_to_compare": "astonishment",
      "analysis": "“Astonishment”（惊愕）是更正式、更强烈的书面语，强调因极度意外而产生的心理震撼，常用于描述难以置信的事件。而 “surprise” 更口语化，适用范围更广，情感强度较低。"
    },
    {
      "word_to_compare": "unexpected",
      "analysis": "“Unexpected”（意想不到的）是形容词，仅描述事物的性质，不表达情绪反应；而 “surprise” 既是名词也是动词，直接指代情绪体验或引发该情绪的行为。例如：an unexpected gift（一份意想不到的礼物） vs. a surprise gift（一份惊喜礼物）。"
    }
  ]
}