{
  "word": "surrender",
  "pronunciation": "suh·ren·duhr",
  "concise_definition": "v. 投降, 屈服, 交出; n. 投降, 屈服",
  "forms": {
    "third_person_singular": "surrenders",
    "past_tense": "surrendered",
    "past_participle": "surrendered",
    "present_participle": "surrendering"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To give up resistance or control to an enemy or opponent, often under pressure or after a struggle, especially in a military or conflict context.",
      "explanation_cn": "指在压力或斗争后向敌人或对手放弃抵抗或控制权，尤其用于军事或冲突语境。",
      "example_en": "After a long siege, the army had no choice but to surrender.",
      "example_cn": "经过长期围困，军队别无选择，只能投降。"
    },
    {
      "pos": "verb",
      "explanation_en": "To yield or give in to a force, emotion, or influence, often reluctantly, acknowledging that one cannot or should not resist further.",
      "explanation_cn": "指不情愿地向某种力量、情绪或影响屈服，承认自己无法或不应再继续抵抗。",
      "example_en": "She finally surrendered to her feelings and admitted she loved him.",
      "example_cn": "她最终屈服于自己的感情，承认自己爱着他。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hand over possession or control of something, often formally or under legal authority.",
      "explanation_cn": "指正式或在法律授权下交出某物的占有权或控制权。",
      "example_en": "The suspect surrendered his weapons to the police.",
      "example_cn": "嫌疑人向警方交出了武器。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of giving up resistance, control, or possession; the state of yielding.",
      "explanation_cn": "指放弃抵抗、控制或占有权的行为；屈服的状态。",
      "example_en": "The surrender of the fortress marked the end of the rebellion.",
      "example_cn": "要塞的投降标志着叛乱的结束。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "yield",
      "analysis": "“Yield” (让步/屈服) 通常指在压力下暂时或部分地让出权利、空间或立场，语气较温和，常用于交通、谈判或情绪场景。而 “surrender” 更彻底、更正式，常暗示完全放弃抵抗或控制，带有更强的失败或无奈色彩。"
    },
    {
      "word_to_compare": "capitulate",
      "analysis": "“Capitulate” (投降/屈服) 与 “surrender” 意义高度重合，但更正式、更常用于书面语或历史文献，尤其指在战争或政治谈判中正式签署投降协议。它比 “surrender” 更具仪式性和结构性，情感色彩更冷峻。"
    },
    {
      "word_to_compare": "give in",
      "analysis": "“Give in” (让步) 是口语化表达，多用于个人情感或日常争执中，如向孩子妥协或放弃争论。它语气轻松，不涉及权力或武力的彻底丧失。而 “surrender” 更庄重，常涉及重大利益、安全或尊严的彻底放弃。"
    }
  ]
}