{
  "word": "surrogate",
  "pronunciation": "suh·ruh·gut",
  "concise_definition": "n. 代理人, 代用品, 代母",
  "forms": {
    "plural": "surrogates"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person or thing that acts or is used in place of another, especially when the original is unavailable, unfit, or unable to perform a role.",
      "explanation_cn": "指代替另一个人或事物的人或物，尤其当原主体无法使用、不适合或无法履行其职责时。",
      "example_en": "She agreed to be a surrogate mother for her sister, carrying the baby to term.",
      "example_cn": "她同意作为姐姐的代母，为她怀胎十月。"
    },
    {
      "pos": "noun",
      "explanation_en": "A substitute or replacement for something, especially in a technical, symbolic, or functional context, where the original is impractical or impossible to use.",
      "explanation_cn": "指在技术、象征或功能语境中，用于替代原物的代用品，通常因为原物不切实际或无法使用。",
      "example_en": "The digital signature serves as a surrogate for a handwritten one in online contracts.",
      "example_cn": "在在线合同中，数字签名充当了手写签名的代用品。"
    },
    {
      "pos": "noun",
      "explanation_en": "In political or legal contexts, a person authorized to represent another in a specific duty or vote, such as an elector chosen to cast a ballot on behalf of someone else.",
      "explanation_cn": "在政治或法律语境中，指被授权代表他人履行特定职责或投票的人，例如代表他人投票的选举人。",
      "example_en": "The party selected a surrogate to speak at the rally while the candidate was recovering from surgery.",
      "example_cn": "该政党选派了一名代理人代为在集会上发言，而候选人正在从手术中恢复。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "representative",
      "analysis": "“Representative”（代表）通常指被正式选举或任命来代表一个群体、组织或选区的人，强调合法性和制度性授权。而 “surrogate” 更强调临时性、替代性，不一定有正式程序，有时甚至带有“替代缺失者”的意味。"
    },
    {
      "word_to_compare": "substitute",
      "analysis": "“Substitute”（替代品）是更通用的词，泛指任何被用来代替原物的人或物，常用于日常语境（如替补球员、替代食材）。而 “surrogate” 更常用于具有情感、法律或象征意义的替代，如代母、数字签名，带有更强的语义深度和正式性。"
    },
    {
      "word_to_compare": "proxy",
      "analysis": "“Proxy”（代理人/委托书）特指在授权下代表他人行使权利，尤其在投票、法律或商业决策中，常以书面形式授权。它与 “surrogate” 在法律语境中部分重叠，但 “proxy” 更强调授权机制，而 “surrogate” 更强调角色的替代性，有时甚至无需明确授权。"
    }
  ]
}