{
  "word": "survey",
  "pronunciation": "sər·vā",
  "concise_definition": "n. 调查, 概览, 评估; v. 调查, 审视, 评估",
  "forms": {
    "third_person_singular": "surveys",
    "past_tense": "surveyed",
    "past_participle": "surveyed",
    "present_participle": "surveying"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A systematic collection of data from a sample of individuals, typically to understand opinions, behaviors, or characteristics of a larger population.",
      "explanation_cn": "指系统性地从一组样本个体中收集数据，以了解更大群体的意见、行为或特征。",
      "example_en": "The university conducted a survey to assess student satisfaction with campus dining services.",
      "example_cn": "这所大学进行了一项调查，以评估学生对校园餐饮服务的满意度。"
    },
    {
      "pos": "noun",
      "explanation_en": "An overview or general examination of a subject, area, or situation, often summarizing key points or trends.",
      "explanation_cn": "指对某一主题、领域或情况的全面概览或检查，通常总结关键要点或趋势。",
      "example_en": "The book provides a comprehensive survey of modern art movements in Europe.",
      "example_cn": "这本书对欧洲现代艺术运动进行了全面的概览。"
    },
    {
      "pos": "noun",
      "explanation_en": "A detailed measurement and mapping of land or physical features, often for construction, legal, or geographic purposes.",
      "explanation_cn": "指为建筑、法律或地理目的而对土地或地形特征进行的详细测量与绘图。",
      "example_en": "The survey showed that the property boundary extended five feet beyond the fence.",
      "example_cn": "测量结果显示，该地产边界比围栏向外延伸了五英尺。"
    },
    {
      "pos": "verb",
      "explanation_en": "To systematically collect information from a group of people, usually through questionnaires or interviews.",
      "explanation_cn": "指通过问卷或访谈等方式系统性地从一群人中收集信息。",
      "example_en": "Researchers surveyed over 1,000 households about their energy consumption habits.",
      "example_cn": "研究人员调查了超过一千户家庭的能源使用习惯。"
    },
    {
      "pos": "verb",
      "explanation_en": "To examine or inspect something carefully, often to assess its condition, value, or suitability.",
      "explanation_cn": "指仔细检查或审视某事物，通常是为了评估其状况、价值或适用性。",
      "example_en": "The architect surveyed the site before designing the new building.",
      "example_cn": "建筑师在设计新建筑之前对现场进行了勘查。"
    },
    {
      "pos": "verb",
      "explanation_en": "To measure and map land or physical features accurately for legal, engineering, or planning purposes.",
      "explanation_cn": "指为法律、工程或规划目的而精确测量和绘制土地或地形特征。",
      "example_en": "The land was surveyed by a licensed professional to establish property lines.",
      "example_cn": "这块土地由持证专业人员进行了测量，以确定地产边界。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "poll",
      "analysis": "“Poll”（民意调查）特指收集公众对特定问题或候选人的意见，通常用于政治或社会趋势，形式较单一（如选择题）。而 “survey” 范围更广，可涵盖行为、习惯、满意度等多维度数据，形式也更灵活（如开放题、量表）。"
    },
    {
      "word_to_compare": "review",
      "analysis": "“Review”（回顾/评审）强调对已有内容、作品或表现进行评价或总结，常用于书籍、电影、绩效等。而 “survey” 更侧重于收集原始数据或提供系统性概览，不一定是评价，而是描述或分析现状。"
    },
    {
      "word_to_compare": "inspection",
      "analysis": "“Inspection”（检查）通常指对物体、设施或系统进行技术性或合规性检查，强调细节和标准符合性（如建筑安全检查）。而 “survey” 在作为动词时更广泛，可包含观察、评估和测绘，常用于宏观或初步判断，不一定涉及严格标准。"
    }
  ]
}