{
  "word": "surveyor",
  "pronunciation": "sər·vey·er",
  "concise_definition": "n. 测量员, 估价师, 调查员",
  "forms": {
    "plural": "surveyors"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A professional who measures and maps land, boundaries, and physical features to determine property lines, prepare construction plans, or assess land value.",
      "explanation_cn": "指专业测量土地、边界和地形特征，以确定地产界限、绘制施工图或评估土地价值的人员。",
      "example_en": "The surveyor marked the exact boundary between the two properties with stakes and GPS equipment.",
      "example_cn": "测量员用木桩和GPS设备标出了两块地产之间的精确边界。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who conducts official inspections or assessments, especially of buildings, infrastructure, or conditions for legal, insurance, or planning purposes.",
      "explanation_cn": "指为法律、保险或规划目的，对建筑物、基础设施或状况进行官方检查或评估的人员。",
      "example_en": "The insurance company sent a surveyor to evaluate the damage after the storm.",
      "example_cn": "保险公司派了一名评估师在风暴后对损坏情况进行评估。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who gathers data through systematic observation or questioning, especially in social, market, or public opinion research.",
      "explanation_cn": "指通过系统观察或问卷调查收集数据的人，尤其在社会、市场或民意研究中。",
      "example_en": "The surveyor interviewed over 500 residents to understand their views on urban development.",
      "example_cn": "调查员采访了500多位居民，以了解他们对城市发展的看法。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "geographer",
      "analysis": "“Geographer”（地理学家）侧重于研究地球表面的自然与人文特征及其空间关系，通常从事理论研究或地图绘制，不直接参与实地测量或法律边界确定。而 “surveyor” 是实践型职业，专注于精确测量和数据采集，常具有法律效力。"
    },
    {
      "word_to_compare": "appraiser",
      "analysis": "“Appraiser”（估价师）主要评估资产（如房产、艺术品）的市场价值，其工作可能基于调查数据，但不涉及实地测量或地形测绘。而 “surveyor” 在评估房产时，会先进行精确的边界和结构测量，是估价的前提。"
    },
    {
      "word_to_compare": "inspector",
      "analysis": "“Inspector”（检查员）通常负责检查合规性、安全标准或法规执行情况（如建筑安全、卫生条件），其重点是判断是否符合规范，而非测量或绘图。而 “surveyor” 的核心任务是收集空间数据，即使涉及检查，也以量化测量为基础。"
    }
  ]
}