{
  "word": "surveyed",
  "pronunciation": "sər·vād",
  "concise_definition": "v. 调查, 审查, 测量, 俯瞰",
  "forms": {
    "base_form": "survey",
    "third_person_singular": "surveys",
    "past_tense": "surveyed",
    "past_participle": "surveyed",
    "present_participle": "surveying"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To systematically collect information from a group of people through questions, often to understand opinions, behaviors, or characteristics.",
      "explanation_cn": "指通过问卷、访谈等方式系统性地从一群人中收集信息，以了解其观点、行为或特征。",
      "example_en": "The researchers surveyed over 1,000 households to assess public attitudes toward climate change.",
      "example_cn": "研究人员调查了超过一千户家庭，以评估公众对气候变化的态度。"
    },
    {
      "pos": "verb",
      "explanation_en": "To examine or inspect something carefully, often to evaluate its condition, structure, or value.",
      "explanation_cn": "指仔细检查或审查某物，通常是为了评估其状况、结构或价值。",
      "example_en": "The engineer surveyed the damaged bridge before recommending repairs.",
      "example_cn": "工程师在建议维修前仔细检查了受损的桥梁。"
    },
    {
      "pos": "verb",
      "explanation_en": "To measure and map the features of an area of land, typically for construction, legal boundaries, or geographic purposes.",
      "explanation_cn": "指测量并绘制一块土地的地形、边界或特征，通常用于建筑、法律界线或地理目的。",
      "example_en": "The land was surveyed last week to determine property lines for the new housing development.",
      "example_cn": "上周对该地块进行了测量，以确定新住宅区的产权边界。"
    },
    {
      "pos": "verb",
      "explanation_en": "To look over or observe something from a high or broad perspective, often to gain an overview.",
      "explanation_cn": "指从高处或广阔的角度俯瞰或观察某物，以获得整体概览。",
      "example_en": "From the hilltop, we surveyed the entire valley spread out below us.",
      "example_cn": "从山顶上，我们俯瞰着下方延展的整个山谷。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "poll",
      "analysis": "“Poll”（民意调查）特指通过提问收集公众意见，通常用于政治或社会趋势，范围较窄且结构化程度高。而 “surveyed” 的范围更广，可涵盖行为、环境、物理特征等，不仅限于意见收集。"
    },
    {
      "word_to_compare": "inspect",
      "analysis": "“Inspect”（检查）强调对物体或系统进行细致、正式的审查，常用于安全、质量或合规目的，如检查设备或建筑。而 “surveyed” 在此语境下更强调系统性、全面性，可能包含测量、绘图或数据收集，范围更广。"
    },
    {
      "word_to_compare": "assess",
      "analysis": "“Assess”（评估）侧重于对价值、重要性或状况做出判断，通常在收集信息之后进行。而 “surveyed” 是获取信息的过程，是评估的前提步骤。例如：先调查（survey）再评估（assess）需求。"
    },
    {
      "word_to_compare": "overlook",
      "analysis": "“Overlook”（俯瞰）仅指从高处观看，常无主动收集信息的意图，可能带有疏忽的含义（如 overlook a mistake）。而 “surveyed” 在此义项中隐含主动、系统性地观察并获取信息，具有明确目的性。"
    }
  ]
}