{
  "word": "surviving",
  "pronunciation": "sər·vaɪ·vɪŋ",
  "concise_definition": "adj. 幸存的, 生存下来的; v. (survive 的现在分词) 幸存, 挺过",
  "forms": {
    "base_form": "survive",
    "third_person_singular": "survives",
    "past_tense": "survived",
    "past_participle": "survived",
    "present_participle": "surviving"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Remaining alive or in existence after a dangerous, destructive, or life-threatening event; having endured and continued to exist despite adversity.",
      "explanation_cn": "在经历危险、破坏性或威胁生命事件后仍存活或存在的；在逆境中坚持并继续存在。",
      "example_en": "The surviving members of the team were rescued after three days in the wilderness.",
      "example_cn": "团队中幸存的成员在荒野中坚持了三天后获救。"
    },
    {
      "pos": "verb",
      "explanation_en": "To continue to live or exist after an event that has killed or destroyed others; to endure or outlast something.",
      "explanation_cn": "在导致他人死亡或毁灭的事件后仍继续生存或存在；经受住并超越某事物。",
      "example_en": "She survived the earthquake by taking shelter under a sturdy table.",
      "example_cn": "她躲在一张坚固的桌子下，幸免于地震。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remain functional, relevant, or in use despite changes, obsolescence, or competition.",
      "explanation_cn": "在变化、过时或竞争中仍保持功能、相关性或使用状态。",
      "example_en": "This classic novel is still surviving in school curricula despite modern trends.",
      "example_cn": "尽管有现代潮流，这部经典小说仍被保留在学校课程中。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "living",
      "analysis": "“Living” (活着的) 强调当前的生命状态，泛指所有有生命的存在，不强调是否经历过灾难或危险。而 “surviving” 隐含了从某种威胁或危机中侥幸存活下来的含义，带有更强的对抗性和经历感。"
    },
    {
      "word_to_compare": "enduring",
      "analysis": "“Enduring” (持久的/忍耐的) 更侧重于长期承受压力、痛苦或困难，强调忍耐力和持续性，常用于抽象事物（如痛苦、关系）。而 “surviving” 更强调从具体危机中活下来，是生存的即时结果，而非长期坚持的过程。"
    },
    {
      "word_to_compare": "remaining",
      "analysis": "“Remaining” (剩下的) 是一个中性词，仅表示在其他部分被移除或消失后所留下的部分，不涉及生死或抗争。而 “surviving” 暗示了某种淘汰机制或灾难性事件，只有少数能存活下来，具有强烈的对比和情感色彩。"
    }
  ]
}