{
  "word": "susceptibility",
  "pronunciation": "suh·sep·tuh·bil·uh·tee",
  "concise_definition": "n. 易感性, 敏感性, 倾向性",
  "forms": {
    "plural": "susceptibilities"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The quality or state of being likely to be affected by something, especially a disease, influence, or external factor; a lack of resistance or protection.",
      "explanation_cn": "指容易受到某种影响（尤其是疾病、外界因素或情感作用）的特性或状态，即缺乏抵抗力或防护能力。",
      "example_en": "Children have a higher susceptibility to respiratory infections during winter.",
      "example_cn": "儿童在冬季更容易感染呼吸道疾病。"
    },
    {
      "pos": "noun",
      "explanation_en": "A tendency to be influenced or affected by a particular idea, emotion, or persuasion, often in a psychological or social context.",
      "explanation_cn": "指在心理或社会语境中，容易受到某种思想、情感或劝说影响的倾向性。",
      "example_en": "His susceptibility to flattery made him an easy target for manipulators.",
      "example_cn": "他容易被奉承所打动，因此成为操纵者的目标。"
    },
    {
      "pos": "noun",
      "explanation_en": "In physics or engineering, the degree to which a material responds to an external field, such as magnetic or electric susceptibility.",
      "explanation_cn": "在物理或工程学中，指材料对外部场（如磁场或电场）产生响应的程度，如磁化率或电极化率。",
      "example_en": "The material's magnetic susceptibility determines how strongly it becomes magnetized in an applied field.",
      "example_cn": "该材料的磁化率决定了它在施加磁场中被磁化的强弱程度。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sensitivity",
      "analysis": "“Sensitivity”（敏感性）通常指对刺激的反应程度，可以是生理、情感或技术层面的，强调反应的敏锐度，不一定包含易受伤害或缺乏抵抗力的含义。而 “susceptibility” 更强调被动地、容易被影响或感染的脆弱性，常带有负面或风险含义。"
    },
    {
      "word_to_compare": "vulnerability",
      "analysis": "“Vulnerability”（脆弱性）与 “susceptibility” 非常接近，都指易受伤害的状态，但 “vulnerability” 更广泛用于安全、系统、心理或社会层面，强调暴露于风险或攻击下的状态；而 “susceptibility” 更常用于医学、生物学或物理科学中，强调对特定因素（如病原体、磁场）的反应倾向。"
    },
    {
      "word_to_compare": "proneness",
      "analysis": "“Proneness”（倾向性）指某种行为或状况发生的自然倾向，常用于描述习惯或性格特征（如 proneness to anger）。它与 “susceptibility” 都可表示“容易发生”，但 “proneness” 更侧重于内在倾向，而 “susceptibility” 更强调外部因素作用下的被动反应。"
    }
  ]
}