{
  "word": "suspended",
  "pronunciation": "suh·spen·dɪd",
  "concise_definition": "adj. 暂停的, 暂缓的, 悬挂的; v. 暂停, 暂缓, 悬挂 (suspend 的过去式和过去分词)",
  "forms": {
    "base_form": "suspend",
    "present_participle": "suspending",
    "past_tense": "suspended",
    "past_participle": "suspended",
    "third_person_singular": "suspends"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Temporarily stopped or delayed, especially by official authority, pending further action or decision; not yet finalized or resolved.",
      "explanation_cn": "指被官方暂时中止或推迟，等待进一步行动或决定；尚未最终确定或解决的状态。",
      "example_en": "The student was suspended from school for violating the code of conduct.",
      "example_cn": "这名学生因违反行为准则而被停学。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Hanging in the air or from a point above, not supported from below; physically suspended.",
      "explanation_cn": "指悬挂在空中或上方某点，下方无支撑；物理意义上的悬挂状态。",
      "example_en": "The chandelier was suspended from the ceiling by thin metal cables.",
      "example_cn": "吊灯由细金属缆绳悬挂在天花板上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To temporarily remove someone from a position, privilege, or activity, often as a punishment or precaution.",
      "explanation_cn": "指作为惩罚或预防措施，暂时剥夺某人的职位、特权或参与资格。",
      "example_en": "The athlete was suspended from competition after testing positive for banned substances.",
      "example_cn": "该运动员因药检呈阳性而被禁止参赛。"
    },
    {
      "pos": "verb",
      "explanation_en": "To delay or postpone the implementation, effect, or progress of something, often indefinitely.",
      "explanation_cn": "指推迟某事的实施、效果或进展，常为无限期推迟。",
      "example_en": "The government suspended all non-essential travel during the pandemic.",
      "example_cn": "疫情期间，政府暂停了所有非必要旅行。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "stopped",
      "analysis": "“Stopped” (停止) 表示动作或过程完全终止，通常意味着永久性或明确的结束。而 “suspended” 强调暂时性，暗示未来可能恢复。例如，‘The project was stopped’ 意味着项目被取消；‘The project was suspended’ 意味着它可能在将来重启。"
    },
    {
      "word_to_compare": "hanged",
      "analysis": "“Hanged” (绞死) 是动词 hang 的过去式，特指以绳索处决人，具有法律或暴力含义。而 “suspended” 作为 hang 的过去分词时，仅表示物理上的悬挂，无死亡或惩罚的含义，如‘a lamp was suspended from the ceiling’。两者语义和语境完全不同。"
    },
    {
      "word_to_compare": "delayed",
      "analysis": "“Delayed” (延迟) 强调时间上的推迟，通常因外部因素（如交通、天气）造成，不涉及权威干预或纪律处分。而 “suspended” 常带有正式决定或制度性干预的色彩，如学校、组织或法律体系的正式暂停。"
    }
  ]
}