{
  "word": "sustainable",
  "pronunciation": "suh·sṭeɪ·nə·bəl",
  "concise_definition": "adj. 可持续的, 能持续的, 可维持的",
  "forms": {
    "comparative": "more sustainable",
    "superlative": "most sustainable"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Capable of being maintained or continued over the long term without depleting resources or causing severe environmental harm, especially in the context of economic, social, and ecological balance.",
      "explanation_cn": "指在不耗尽资源或不造成严重环境破坏的前提下，能够长期维持或持续进行的，尤其强调经济、社会与生态之间的平衡。",
      "example_en": "Sustainable agriculture practices help preserve soil quality and reduce water waste.",
      "example_cn": "可持续的农业实践有助于保持土壤质量并减少水资源浪费。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Designed or implemented in a way that meets current needs without compromising the ability of future generations to meet theirs, often applied to energy, consumption, and development.",
      "explanation_cn": "指以满足当前需求而不损害后代满足其需求的能力的方式设计或实施的，常用于能源、消费和发展领域。",
      "example_en": "The city has adopted sustainable urban planning to reduce carbon emissions and improve public transit.",
      "example_cn": "该市已采用可持续的城市规划，以减少碳排放并改善公共交通。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Capable of being supported or upheld over time, especially in terms of financial, social, or organizational stability.",
      "explanation_cn": "指在财务、社会或组织层面能够长期维持或支撑的，不依赖不可持续的投入或模式。",
      "example_en": "The nonprofit organization relies on sustainable funding models rather than one-time donations.",
      "example_cn": "该非营利组织依赖可持续的资金模式，而非一次性捐款。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "environmental",
      "analysis": "“Environmental”（环境的）是一个广义词，仅指与自然环境相关的事物，但不必然意味着可长期维持。例如，一项环保政策可能是临时的或无效的。而 “sustainable” 强调的是长期可行性与资源再生能力，是更深层的系统性标准。"
    },
    {
      "word_to_compare": "renewable",
      "analysis": "“Renewable”（可再生的）特指资源本身可以自然恢复，如太阳能、风能。它是 “sustainable” 的一个重要组成部分，但不是全部。一个系统可以使用可再生资源，但若管理不当（如过度开采或浪费），仍不可持续。因此，“sustainable” 范围更广，包含管理、经济与社会维度。"
    },
    {
      "word_to_compare": "enduring",
      "analysis": "“Enduring”（持久的）强调时间上的长久存在，但不涉及资源消耗或生态影响。例如，一种传统习俗可能是 enduring 的，但未必是 sustainable 的。而 “sustainable” 必须包含对环境与资源的负责任使用，具有明确的伦理与科学内涵。"
    }
  ]
}