{
  "word": "swagger",
  "pronunciation": "swag·er",
  "concise_definition": "v. 大摇大摆地走, 自负地炫耀; n. 大摇大摆的步伐, 自负的态度",
  "forms": {
    "third_person_singular": "swaggers",
    "past_tense": "swaggered",
    "past_participle": "swaggered",
    "present_participle": "swaggering"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To walk or behave in a very confident, often arrogant or boastful manner, displaying self-assurance or superiority.",
      "explanation_cn": "以极其自信、常常带有傲慢或炫耀的方式行走或举止，表现出自我肯定或优越感。",
      "example_en": "He swaggered into the room like he owned the place.",
      "example_cn": "他大摇大摆地走进房间，仿佛这里是他的地盘。"
    },
    {
      "pos": "verb",
      "explanation_en": "To speak or act with exaggerated confidence or bravado, often to impress others or mask insecurity.",
      "explanation_cn": "以夸张的自信或虚张声势的方式说话或行动，通常是为了给他人留下印象或掩饰内心的不安。",
      "example_en": "The politician swaggered about his achievements, though many doubted their validity.",
      "example_cn": "这位政客夸耀自己的成就，尽管许多人对它们的真实性表示怀疑。"
    },
    {
      "pos": "noun",
      "explanation_en": "A confident, often arrogant way of walking or behaving that conveys self-importance or bravado.",
      "explanation_cn": "一种自信甚至傲慢的走路或行为方式，传达出自命不凡或虚张声势的态度。",
      "example_en": "He had a swagger in his step that made everyone notice him.",
      "example_cn": "他走路时带着一种大摇大摆的架势，让所有人都注意到他。"
    },
    {
      "pos": "noun",
      "explanation_en": "An air of boldness or arrogance; a style marked by overconfidence or flamboyance.",
      "explanation_cn": "一种大胆或傲慢的气质；一种以过度自信或浮夸为特征的风格。",
      "example_en": "The band's music had a swagger that defined the rock 'n' roll era.",
      "example_cn": "这支乐队的音乐具有一种定义了摇滚乐时代的 swagger 风格。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "strut",
      "analysis": "“Strut” (昂首阔步) 与 “swagger” 非常相似，都指带着骄傲或炫耀的姿态走路，但 “strut” 更强调挺胸抬头、步伐夸张的物理动作，常带贬义；而 “swagger” 不仅指走路，还可用于言语或整体态度，语义范围更广，且有时带有风格化或文化上的正面含义（如音乐、时尚中的 swagger）。"
    },
    {
      "word_to_compare": "boast",
      "analysis": "“Boast” (吹嘘) 专指用语言夸耀自己的成就或优点，是纯粹的言语行为；而 “swagger” 是一种综合性的身体语言或气质表现，可能不说话也能传达自负，它更强调非语言的自信姿态。"
    },
    {
      "word_to_compare": "arrogance",
      "analysis": "“Arrogance” (傲慢) 是一个抽象名词，描述一种态度或性格特质，强调对他人的轻视；而 “swagger” 是这种态度的外在表现形式，是可见的行为或风格。一个人可以有 arrogance 而不 swagger，但 swagger 通常暗示了 arrogance 的存在。"
    }
  ]
}