{
  "word": "swap",
  "pronunciation": "swahp",
  "concise_definition": "v. 交换, 互换; n. 交换, 互换",
  "forms": {
    "third_person_singular": "swaps",
    "past_tense": "swapped",
    "past_participle": "swapped",
    "present_participle": "swapping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To exchange one thing for another, typically of the same type or value, often in a direct or informal transaction.",
      "explanation_cn": "指以一件事物与另一件事物进行交换，通常为同类或等值之物，常用于直接或非正式的交易。",
      "example_en": "The two players swapped jerseys after the match as a sign of respect.",
      "example_cn": "比赛结束后，两名球员互换了球衣以示尊重。"
    },
    {
      "pos": "verb",
      "explanation_en": "To replace one person or thing with another in a particular role or position, often temporarily.",
      "explanation_cn": "指在某个角色或位置上用另一个人或事物替代，通常为临时性替换。",
      "example_en": "The coach swapped the goalkeeper with a substitute during halftime.",
      "example_cn": "教练在中场休息时用替补门将换下了原门将。"
    },
    {
      "pos": "verb",
      "explanation_en": "In finance, to exchange financial instruments (e.g., interest rates, currencies, or assets) under a contractual agreement.",
      "explanation_cn": "在金融领域，指根据合同协议交换金融工具（如利率、货币或资产）。",
      "example_en": "The banks entered into a currency swap to hedge against exchange rate fluctuations.",
      "example_cn": "两家银行进行了货币互换，以对冲汇率波动风险。"
    },
    {
      "pos": "noun",
      "explanation_en": "An act or instance of exchanging one thing for another.",
      "explanation_cn": "指一次交换行为或交换事件。",
      "example_en": "The swap of roles between the two siblings helped them understand each other better.",
      "example_cn": "两个兄弟姐妹互换角色的经历帮助他们更好地理解了对方。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "exchange",
      "analysis": "“Exchange” (交换) 是更广泛、更正式的词，可用于任何类型的互换，包括抽象概念（如意见、信息）或实物。而 “swap” 更常用于非正式语境，强调直接、对等、有时是随意的物品或角色互换，语气更口语化。"
    },
    {
      "word_to_compare": "trade",
      "analysis": "“Trade” (交易) 通常隐含经济价值或利益的考量，常用于商业或市场语境，如贸易协定、以物易物。而 “swap” 更强调对等交换，不一定涉及金钱或市场价值，如孩子交换玩具。"
    },
    {
      "word_to_compare": "replace",
      "analysis": "“Replace” (替换) 指用一个新事物完全取代旧事物，旧物通常被移除或废弃，不强调双向性。而 “swap” 是双向互换，双方都给出并获得某物，具有对等性和互动性。"
    }
  ]
}