{
  "word": "swapping",
  "pronunciation": "swop·ing",
  "concise_definition": "v. 交换, 调换; n. 交换行为",
  "forms": {
    "base_form": "swap",
    "third_person_singular": "swaps",
    "past_tense": "swapped",
    "past_participle": "swapped",
    "present_participle": "swapping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To exchange one thing for another, typically of similar type or value, often in a mutual or reciprocal arrangement.",
      "explanation_cn": "指以一件事物与另一件事物进行互换，通常为同类或价值相近之物，常涉及双方的相互协议。",
      "example_en": "The students were swapping lunch items because they didn't like what they had.",
      "example_cn": "学生们因为不喜欢自己带的食物，于是互相交换了午餐。"
    },
    {
      "pos": "verb",
      "explanation_en": "To replace one person, thing, or element with another in a system, role, or position, often temporarily or strategically.",
      "explanation_cn": "指在系统、角色或位置中用另一人、物或元素替换原有者，常为临时性或策略性操作。",
      "example_en": "The coach decided to swap the goalkeeper with the backup player in the 70th minute.",
      "example_cn": "教练在第70分钟决定用替补门将换下首发门将。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or instance of exchanging one thing for another; often used in contexts such as trade, sports, or digital data.",
      "explanation_cn": "指交换某一事物为另一事物的行为或实例，常用于贸易、体育或数字数据等语境。",
      "example_en": "There was a major swap of players between the two teams during the transfer window.",
      "example_cn": "在转会窗口期间，两支球队之间进行了一次重大的球员交换。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "exchange",
      "analysis": "“Exchange” (交换) 是更广泛、更正式的术语，可用于抽象概念（如意见、信息、礼物）或具体物品，强调双向互动。而 “swapping” 更口语化，常用于非正式场合，尤其强调直接、快速或对等的物物互换，如交换玩具、午餐或球员。"
    },
    {
      "word_to_compare": "trade",
      "analysis": "“Trade” (交易) 常带有经济或价值评估的含义，隐含以物易物或货币交换，强调等价交换或利益获取。而 “swapping” 更中性，不一定涉及价值衡量，可能只是出于偏好或便利，如交换衣服或书籍。"
    },
    {
      "word_to_compare": "substitute",
      "analysis": "“Substitute” (替代) 指用一个事物代替另一个，通常是因为原物不可用或不合适，且不一定是双向或互惠的。而 “swapping” 强调双方互换，彼此都获得对方的东西，具有对等性和互动性。"
    }
  ]
}