{
  "word": "swat",
  "pronunciation": "swot",
  "concise_definition": "v. 拍打, 猛击; n. 突击队, 突击行动",
  "forms": {
    "third_person_singular": "swats",
    "past_tense": "swatted",
    "past_participle": "swatted",
    "present_participle": "swatting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To strike or hit something suddenly and forcefully, especially with the hand or a flat object, often to kill or drive away an insect or small animal.",
      "explanation_cn": "指突然且用力地拍打某物，通常用手或扁平物体，目的是杀死或驱赶昆虫或小动物。",
      "example_en": "She swatted the fly away with a newspaper.",
      "example_cn": "她用一张报纸把苍蝇拍走了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To carry out a sudden, forceful, and often violent police or military operation, typically to resolve a high-risk situation such as a hostage crisis or armed standoff.",
      "explanation_cn": "指执行一次突然、强力且常具暴力性的警察或军事行动，通常用于处理高风险情况，如人质劫持或武装对峙。",
      "example_en": "The police swatted the armed suspect's hideout at dawn.",
      "example_cn": "警方在黎明时分突袭了武装嫌犯的藏身之处。"
    },
    {
      "pos": "noun",
      "explanation_en": "A specialized police unit trained to handle dangerous or high-risk situations, such as armed confrontations or hostage rescues.",
      "explanation_cn": "指经过专门训练、应对危险或高风险情况（如武装对抗或人质营救）的警察特种部队。",
      "example_en": "The SWAT team entered the building with tactical precision.",
      "example_cn": "特警队以战术精准性进入了大楼。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden, forceful blow or strike, often delivered with the hand.",
      "explanation_cn": "指一次突然而有力的拍打或击打，通常用手完成。",
      "example_en": "He gave the mosquito a quick swat before it could bite.",
      "example_cn": "他在蚊子叮咬前迅速拍了一掌。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hit",
      "analysis": "“Hit” (击打) 是一个通用词，泛指任何形式的打击，力度和意图可大可小，无特定方式或目的。而 “swat” 特指一种快速、短促、带有驱赶或消灭意图的拍打动作，常用于昆虫或突击行动语境，更具动作的突然性和目的性。"
    },
    {
      "word_to_compare": "raid",
      "analysis": "“Raid” (突袭) 与 “swat” 在军事或执法语境中可互换，但 “raid” 更广泛用于描述对地点的突然袭击，如突袭赌场、毒品窝点，不一定涉及高危对峙。而 “swat” 特指由特种部队执行的、针对高风险暴力事件的战术性突袭，强调专业性和危险性。"
    },
    {
      "word_to_compare": "blow",
      "analysis": "“Blow” (一击) 指任何形式的打击，可以是拳击、锤击或撞击，强调力量和冲击，但不强调动作的突然性或拍打方式。而 “swat” 特指用手掌或扁平物的拍击，动作更轻、更快，常用于小目标（如昆虫）或比喻性语境。"
    }
  ]
}