{
  "word": "sway",
  "pronunciation": "sway",
  "concise_definition": "v. 影响, 使动摇; n. 影响力, 摇摆",
  "forms": {
    "third_person_singular": "sways",
    "past_tense": "swayed",
    "past_participle": "swayed",
    "present_participle": "swaying"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To influence someone's opinions, decisions, or beliefs, often gradually or subtly, leading them to adopt a particular viewpoint or course of action.",
      "explanation_cn": "指逐渐或微妙地影响某人的观点、决定或信念，使其采纳某种特定立场或行动方案。",
      "example_en": "The politician's speech swayed many voters to support the new policy.",
      "example_cn": "这位政治家的演讲使许多选民转而支持这项新政策。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move rhythmically back and forth or from side to side, often due to external force or balance, such as wind or motion.",
      "explanation_cn": "指因外力或平衡作用而有节奏地前后或左右摇摆。",
      "example_en": "The trees swayed gently in the evening breeze.",
      "example_cn": "树木在晚风中轻轻摇曳。"
    },
    {
      "pos": "noun",
      "explanation_en": "The power or influence one person or group has over others, especially in shaping opinions or decisions.",
      "explanation_cn": "指一个人或群体对他人观点或决定所施加的影响力或控制力。",
      "example_en": "She has a lot of sway in the company's hiring decisions.",
      "example_cn": "她在公司的招聘决策中拥有很大的影响力。"
    },
    {
      "pos": "noun",
      "explanation_en": "A rhythmic motion of swaying, especially one that is smooth and continuous.",
      "explanation_cn": "指一种有节奏的摇摆动作，尤指平稳而持续的摆动。",
      "example_en": "The sway of the ship made her feel seasick.",
      "example_cn": "船的摇晃使她感到晕船。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "influence",
      "analysis": "“Influence” (影响) 是一个更广泛、更中性的词，泛指任何改变他人思想或行为的力量，可以是正面或负面、直接或间接的。而 “sway” 更强调一种动态的、往往带有情感或心理层面的引导，常暗示说服或操控，语气更生动、更具主动性。"
    },
    {
      "word_to_compare": "persuade",
      "analysis": "“Persuade” (劝说) 强调通过逻辑、论证或言语使某人同意或采取行动，是一个有意识、有目的的沟通过程。而 “sway” 可以是无意识的、环境性的或情绪性的，不一定需要直接对话，例如通过氛围、权威或魅力间接影响。"
    },
    {
      "word_to_compare": "oscillate",
      "analysis": "“Oscillate” (振荡/摆动) 是一个科学或技术性术语，专指在两个固定点之间规律性来回运动，如钟摆或电流。它强调物理运动的周期性和精确性。而 “sway” 作为动词或名词时，更常用于描述自然、柔和、非机械的摆动，如树木、人群或情绪的波动。"
    }
  ]
}