{
  "word": "sweating",
  "pronunciation": "swet·ing",
  "concise_definition": "v. 出汗, 流汗; n. 出汗, 流汗的过程",
  "forms": {
    "base_form": "sweat",
    "third_person_singular": "sweats",
    "past_tense": "sweated",
    "past_participle": "sweated",
    "present_participle": "sweating"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To excrete moisture through the skin as a physiological response to heat, physical exertion, or stress, in order to regulate body temperature.",
      "explanation_cn": "作为对高温、体力活动或压力的生理反应，通过皮肤排出水分，以调节体温。",
      "example_en": "He was sweating heavily after running five miles in the midday sun.",
      "example_cn": "他在正午的阳光下跑了五英里后大汗淋漓。"
    },
    {
      "pos": "verb",
      "explanation_en": "To feel anxious or worried, often while waiting for an outcome; used figuratively to describe mental or emotional strain.",
      "explanation_cn": "指因等待结果而感到焦虑或担忧，常用于比喻性地描述心理或情绪上的紧张状态。",
      "example_en": "She was sweating over the exam results, unable to focus on anything else.",
      "example_cn": "她为考试成绩焦虑不已，无法专心做其他事。"
    },
    {
      "pos": "verb",
      "explanation_en": "To exert intense effort or pressure to achieve a goal, often under time constraints or high stakes.",
      "explanation_cn": "指在时间紧迫或高风险情况下，付出巨大努力或施加压力以达成目标。",
      "example_en": "The team was sweating to finish the project before the deadline.",
      "example_cn": "团队拼命赶工，只为在截止日期前完成项目。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or process of sweating; the moisture secreted by the skin.",
      "explanation_cn": "出汗的行为或过程；皮肤分泌出的水分。",
      "example_en": "After the workout, he wiped away the sweat with a towel.",
      "example_cn": "锻炼后，他用毛巾擦去汗水。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "perspiring",
      "analysis": "“Perspiring” 是 “sweating” 的更正式或委婉说法，常用于书面语或礼貌语境中，强调生理性的水分分泌，较少带有焦虑或压力的引申义。两者在生理意义上可互换，但 “perspiring” 不用于比喻义（如 ‘perspiring over a deadline’ 不自然）。"
    },
    {
      "word_to_compare": "glistening",
      "analysis": "“Glistening” (闪亮、泛光) 描述的是物体表面因湿润而反射光线的视觉状态，它可能是汗水、露水或油脂造成的。它是一个形容词，描述结果，而非动作本身。而 “sweating” 是一个动词，强调产生汗水的过程。"
    },
    {
      "word_to_compare": "stressing",
      "analysis": "“Stressing” (强调、施压) 通常指心理或语言上的强调，或对某人施加压力。虽然在比喻义中 “sweating” 可以表示焦虑，但 “stressing” 更直接指向主动施加压力或过度关注某事，不涉及生理出汗。两者在比喻用法中语义重叠但来源不同。"
    }
  ]
}