{
  "word": "sweeps",
  "pronunciation": "swēps",
  "concise_definition": "v. 扫除, 扫过, 横扫; n. 扫除, 扫掠, 大规模行动",
  "forms": {
    "base_form": "sweep",
    "third_person_singular": "sweeps",
    "past_tense": "swept",
    "past_participle": "swept",
    "present_participle": "sweeping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move quickly and smoothly across a surface, often clearing or covering it in the process, typically with a sweeping motion.",
      "explanation_cn": "指以流畅的弧线或大范围动作快速掠过某表面，通常伴随清除或覆盖该区域的动作。",
      "example_en": "The broom sweeps the dust into a corner.",
      "example_cn": "扫帚把灰尘扫到了角落里。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove dirt, debris, or unwanted material from a surface using a brush, broom, or similar tool.",
      "explanation_cn": "指使用刷子、扫帚等工具清除表面的灰尘、杂物或其他不需要的物质。",
      "example_en": "She sweeps the floor every morning before work.",
      "example_cn": "她每天早上上班前都会扫地。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move through an area rapidly and thoroughly, often with force or dominance, as in a military or political context.",
      "explanation_cn": "指以迅猛之势全面穿过某一区域，常用于军事或政治语境，表示压倒性地控制或清除。",
      "example_en": "The opposition party swept the elections, winning every seat.",
      "example_cn": "反对党在选举中大获全胜，赢得了所有席位。"
    },
    {
      "pos": "noun",
      "explanation_en": "A single act of sweeping, especially the removal of dirt or debris; also refers to a broad, sweeping movement.",
      "explanation_cn": "指一次清扫动作，尤指清除灰尘或杂物；也可泛指宽广、流畅的移动轨迹。",
      "example_en": "A quick sweep of the floor removed all the fallen leaves.",
      "example_cn": "快速扫一遍地板，就清除了所有落叶。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large-scale, decisive action or campaign that achieves widespread success or removal, often in politics, sports, or business.",
      "explanation_cn": "指在政治、体育或商业中取得广泛成功的大规模行动或运动，常带有压倒性胜利的含义。",
      "example_en": "The company's new marketing strategy led to a sweep of industry awards.",
      "example_cn": "公司新的营销策略使其横扫了所有行业奖项。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "clean",
      "analysis": "“Clean”（清洁）是一个更广泛的术语，泛指使某物变得干净，可以包括擦拭、冲洗、消毒等多种方式，不强调动作的幅度或轨迹。而 “sweep” 特指用扫帚或类似工具进行的横向或弧形清扫动作，更具体、更具动作感。"
    },
    {
      "word_to_compare": "brush",
      "analysis": "“Brush”（刷）通常指用较小、较硬的刷子进行轻柔或局部的清理，动作范围小，力度较轻，如刷牙、刷衣服。而 “sweep” 强调大范围、覆盖性的动作，常用于地面或大面积区域，力度更强、范围更广。"
    },
    {
      "word_to_compare": "ravage",
      "analysis": "“Ravage”（破坏）强调造成严重损害或毁灭，常用于自然灾害或战争带来的破坏，带有负面和毁灭性含义。而 “sweep” 在表示大规模行动时（如选举大胜）通常是中性或正面的，强调效率和彻底性，而非破坏。"
    }
  ]
}