{
  "word": "sweet",
  "pronunciation": "swēt",
  "concise_definition": "adj. 甜的, 甜美的; n. 甜食, 甜点",
  "forms": {
    "comparative": "sweeter",
    "superlative": "sweetest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having a taste characterized by sugar or honey, often pleasant and not sour or bitter; describing the primary flavor of foods like candy, fruit, or desserts.",
      "explanation_cn": "具有由糖或蜂蜜带来的味道，通常令人愉悦，不酸也不苦；用于描述糖果、水果或甜点等食物的主要风味。",
      "example_en": "The strawberries were so sweet that I ate three bowls.",
      "example_cn": "这些草莓非常甜，我吃了三大碗。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Pleasing to the senses, especially in a gentle, kind, or soothing way; describing something emotionally or aesthetically delightful.",
      "explanation_cn": "以温和、善良或舒缓的方式令感官愉悦；形容在情感或审美上令人愉快的事物。",
      "example_en": "She gave me a sweet smile that made my whole day better.",
      "example_cn": "她给了我一个甜美的微笑，让我的一整天都变好了。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Not harsh or severe; describing a tone, climate, or situation that is mild, gentle, or favorable.",
      "explanation_cn": "不严厉或不苛刻的；形容语调、气候或情境温和、柔和或有利。",
      "example_en": "We enjoyed a sweet spring breeze that carried the scent of flowers.",
      "example_cn": "我们享受着一阵带着花香的和煦春风。"
    },
    {
      "pos": "noun",
      "explanation_en": "A food item that is rich in sugar and typically consumed as a dessert or snack, such as candy, cake, or pastry.",
      "explanation_cn": "一种富含糖分、通常作为甜点或零食食用的食物，如糖果、蛋糕或糕点。",
      "example_en": "After dinner, we had chocolate cake as a sweet.",
      "example_cn": "晚饭后，我们吃了巧克力蛋糕作为甜点。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sugary",
      "analysis": "“Sugary”（含糖的）更侧重于描述食物中糖分含量高，常带有负面含义，暗示过量或不健康。而 “sweet” 是中性或正面的，强调味道的愉悦性，不一定指糖分极高。例如，天然水果是 sweet，但未必是 sugary。"
    },
    {
      "word_to_compare": "delicious",
      "analysis": "“Delicious”（美味的）是更广泛的感官评价，涵盖所有令人愉悦的味道，包括咸、鲜、辣等。而 “sweet” 仅特指味觉中的甜味，范围更窄。一个菜可以 delicious 但不 sweet，比如烤肉。"
    },
    {
      "word_to_compare": "kind",
      "analysis": "“Kind”（善良的）常用于形容人的性格或行为，与 “sweet” 在情感表达上部分重叠，但 “sweet” 更强调温柔、亲切的外在表现，常用于描述语气、微笑或举止，而 “kind” 更强调道德上的善意和体贴。"
    }
  ]
}