{
  "word": "sweep",
  "pronunciation": "swēp",
  "concise_definition": "v. 扫除, 扫过, 横扫, 大获全胜; n. 扫除, 扫掠, 大胜",
  "forms": {
    "third_person_singular": "sweeps",
    "past_tense": "swept",
    "past_participle": "swept",
    "present_participle": "sweeping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To clean a surface by moving a broom or similar tool across it to remove dirt or debris.",
      "explanation_cn": "用扫帚或其他工具在表面上移动，以清除灰尘或杂物。",
      "example_en": "She swept the floor every morning before starting work.",
      "example_cn": "她每天早上工作前都会扫地。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move quickly and smoothly over or across a surface, often with force or in a wide arc.",
      "explanation_cn": "快速而流畅地在表面上移动，通常带有力量或呈大弧线范围。",
      "example_en": "The wind swept through the trees, rustling the leaves.",
      "example_cn": "风呼啸着掠过树林，树叶沙沙作响。"
    },
    {
      "pos": "verb",
      "explanation_en": "To win decisively or overwhelmingly in a contest, election, or competition.",
      "explanation_cn": "在比赛、选举或竞争中以压倒性优势获胜。",
      "example_en": "The candidate swept the state in the general election.",
      "example_cn": "这位候选人在大选中横扫该州。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of cleaning by sweeping, or the amount of area cleared in one motion.",
      "explanation_cn": "清扫的动作，或一次清扫所覆盖的区域范围。",
      "example_en": "A quick sweep of the room revealed no signs of intrusion.",
      "example_cn": "快速扫视一遍房间，没有发现任何入侵痕迹。"
    },
    {
      "pos": "noun",
      "explanation_en": "A wide, sweeping movement or range, often describing a broad arc or extent.",
      "explanation_cn": "一种宽广、大范围的移动或覆盖范围，常形容大弧线或广阔区域。",
      "example_en": "The painter used a broad sweep of color to capture the horizon.",
      "example_cn": "画家用大笔触的色彩描绘了地平线。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "clean",
      "analysis": "“Clean” (清洁) 是一个更广泛的通用词，泛指去除污垢或使某物干净，方式多样（如擦拭、冲洗、消毒）。而 “sweep” 特指用扫帚等工具进行的物理清扫动作，强调动作方式和工具，范围更具体。"
    },
    {
      "word_to_compare": "brush",
      "analysis": "“Brush” (刷) 通常指用刷子轻柔、短促地移动以清除表面灰尘，动作较轻、范围较小，常用于细节处理（如刷衣服、刷牙）。而 “sweep” 动作更有力、覆盖范围更广，常用于地面或大面积区域。"
    },
    {
      "word_to_compare": "dominate",
      "analysis": "“Dominate” (支配/主导) 强调在竞争中持续控制或压倒对手，侧重于权力或影响力。而 “sweep” 在表示胜利时，强调的是结果的彻底性和一次性压倒性，常用于选举或赛事中一次性大胜，更具戏剧性和爆发力。"
    }
  ]
}