{
  "word": "sweeping",
  "pronunciation": "swep·ing",
  "concise_definition": "adj. 广泛的, 全面的, 大规模的; v. 打扫, 扫除, 横扫",
  "forms": {
    "base_form": "sweep",
    "third_person_singular": "sweeps",
    "past_tense": "swept",
    "past_participle": "swept",
    "present_participle": "sweeping"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing something that is extensive, comprehensive, or far-reaching in scope, effect, or impact; often implying a dramatic or decisive change.",
      "explanation_cn": "形容某事物在范围、影响或效果上广泛、全面或深远的，常暗示一种戏剧性或决定性的变革。",
      "example_en": "The new policy brought about sweeping reforms in the education system.",
      "example_cn": "这项新政策引发了教育体系的全面改革。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterizing a motion or action that covers a large area in a single, smooth movement, often with a sense of grandeur or force.",
      "explanation_cn": "形容一种以单一、流畅动作覆盖大面积的运动或行为，常带有宏伟或有力的意味。",
      "example_en": "She made a sweeping gesture with her arm, inviting everyone to sit down.",
      "example_cn": "她手臂一挥，示意大家坐下。"
    },
    {
      "pos": "verb",
      "explanation_en": "To clean a surface by moving a broom or similar tool across it to remove dirt or debris.",
      "explanation_cn": "用扫帚或类似工具在表面上来回移动以清除灰尘或杂物。",
      "example_en": "He swept the floor before the guests arrived.",
      "example_cn": "客人到来之前，他把地板扫了一遍。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move quickly and forcefully across or through an area, often in a dominant or overwhelming manner.",
      "explanation_cn": "快速而有力地穿过或掠过某一区域，常带有主导或压倒性的气势。",
      "example_en": "The army swept through the valley, capturing every village in its path.",
      "example_cn": "军队横扫山谷，沿途攻占了每一个村庄。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "comprehensive",
      "analysis": "“Comprehensive”（全面的）强调覆盖所有方面、无遗漏，常用于描述计划、分析或覆盖范围，偏重系统性和完整性。而 “sweeping” 更强调规模之大、影响之广，常带有强烈动态感或变革性，语气更强烈、更具冲击力。"
    },
    {
      "word_to_compare": "extensive",
      "analysis": "“Extensive”（广泛的）侧重于空间、时间或范围上的广度，语气中性，常用于客观描述，如 extensive research（广泛的研究）。而 “sweeping” 不仅指范围广，还隐含程度深、影响剧烈，常用于政治、社会变革等语境，带有主观评价色彩。"
    },
    {
      "word_to_compare": "broad",
      "analysis": "“Broad”（广泛的）是最通用的词，可指宽度、范围或视野的宽广，语气平和，如 broad agreement（广泛共识）。而 “sweeping” 比 “broad” 更具动态性和决断性，常用于描述一次性、大规模的行动或变化，如 sweeping changes（彻底变革）。"
    },
    {
      "word_to_compare": "scan",
      "analysis": "“Scan”（扫描）指快速、表面地查看或检查，如扫描文档或扫描二维码，动作轻快但不深入。而 “sweep”（扫过）强调覆盖整个区域，动作更彻底、更有力，常用于物理清扫或军事行动，语义强度远高于 “scan”。"
    }
  ]
}