{
  "word": "swept",
  "pronunciation": "swept",
  "concise_definition": "v. 扫除, 扫过, (风、水等) 吹过, (情绪、潮流等) 迅速席卷",
  "forms": {
    "base_form": "sweep",
    "third_person_singular": "sweeps",
    "present_participle": "sweeping",
    "past_tense": "swept",
    "past_participle": "swept"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To clean a surface by moving a broom or similar tool across it to remove dirt or debris.",
      "explanation_cn": "用扫帚或其他工具在表面上来回移动，以清除灰尘或杂物。",
      "example_en": "She swept the floor every morning before starting work.",
      "example_cn": "她每天早上工作前都会扫地。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move quickly and forcefully across or through a space, often with wind, water, or other forces.",
      "explanation_cn": "指以快速而有力的方式穿过或掠过某个空间，通常由风、水或其他力量推动。",
      "example_en": "A cold wind swept through the valley, chilling everyone instantly.",
      "example_cn": "一阵寒风席卷过山谷，瞬间让所有人感到寒冷。"
    },
    {
      "pos": "verb",
      "explanation_en": "To affect or influence a large group of people suddenly and intensely, often referring to emotions, trends, or movements.",
      "explanation_cn": "指突然且强烈地影响或席卷一大群人，常用于描述情绪、潮流或运动的蔓延。",
      "example_en": "A wave of patriotism swept the nation after the victory.",
      "example_cn": "胜利后，一股爱国热情席卷了全国。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove or clear something completely and decisively, often in a competitive or decisive context.",
      "explanation_cn": "指彻底而果断地清除或移除某物，常用于竞争或决定性的情境中。",
      "example_en": "The team swept the championship series in three straight games.",
      "example_cn": "这支队伍以三连胜横扫了冠军系列赛。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "clean",
      "analysis": "“Clean” (清洁) 是一个更宽泛的词，泛指去除污垢或使某物干净，方式多样（如擦拭、冲洗、吸尘）。而 “swept” 特指用扫帚等工具进行的物理清扫动作，强调动作方式和工具，语义更具体。"
    },
    {
      "word_to_compare": "blow",
      "analysis": "“Blow” (吹) 指空气或其他介质的自然移动，通常不包含清除或整理的意图。而 “swept” 在描述风或水流时，隐含了“清除”或“覆盖”的结果，带有更强的动态性和影响力，常用于文学性表达。"
    },
    {
      "word_to_compare": "ravage",
      "analysis": "“Ravage” (破坏) 强调造成严重损害或毁灭，常用于自然灾害或战争后的场景，语义负面且强烈。而 “swept” 在描述潮流或情绪时，可以是中性甚至积极的（如‘swept the nation’），不必然包含破坏性。"
    },
    {
      "word_to_compare": "clear",
      "analysis": "“Clear” (清除) 是一个通用动词，可指移除障碍、清理空间或消除干扰，方式多样。而 “swept” 更具象，特指通过扫的动作实现清除，常用于物理空间，且带有动作的连贯性和速度感。"
    }
  ]
}