{
  "word": "swings",
  "pronunciation": "swiŋz",
  "concise_definition": "n. 摇摆, 秋千, 剧烈变动; v. 摇摆, 摇动, 转向",
  "forms": {
    "singular": "swing",
    "third_person_singular": "swings",
    "past_tense": "swung",
    "past_participle": "swung",
    "present_participle": "swinging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A back-and-forth motion, often rhythmic, such as the movement of a pendulum, a child on a playground swing, or a golf club.",
      "explanation_cn": "一种前后或上下有节奏的摆动，例如钟摆的运动、儿童在游乐场秋千上的摆动，或高尔夫球杆的挥动。",
      "example_en": "The child laughed as she rode higher on the swings.",
      "example_cn": "孩子在秋千上荡得越来越高，开心地笑了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of playground equipment consisting of a seat suspended by ropes or chains, designed for swinging back and forth.",
      "explanation_cn": "一种游乐设施，由绳索或链条悬挂一个座位，供人前后摆动玩耍。",
      "example_en": "The park has three new swings for toddlers and one for older children.",
      "example_cn": "公园里有三个专为幼儿设计的新秋千，还有一个供大孩子使用的。"
    },
    {
      "pos": "noun",
      "explanation_en": "A significant change or shift in opinion, direction, or preference, often in politics or market trends.",
      "explanation_cn": "指观点、方向或偏好的重大转变，常用于政治或市场趋势中。",
      "example_en": "There was a dramatic swing in voter support toward the opposition party.",
      "example_cn": "选民对反对党的支持出现了显著的转向。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move back and forth or in a wide arc, typically under one's own power or by external force.",
      "explanation_cn": "指在自身力量或外力作用下前后或呈大弧线摆动。",
      "example_en": "The branches swung violently in the storm.",
      "example_cn": "树枝在风暴中猛烈地摇摆。"
    },
    {
      "pos": "verb",
      "explanation_en": "To change one's position, preference, or allegiance, especially in a political or social context.",
      "explanation_cn": "指在政治或社会语境中改变立场、偏好或忠诚对象。",
      "example_en": "After the debate, many undecided voters swung toward the candidate with the clearer policy plan.",
      "example_cn": "辩论之后，许多犹豫不决的选民转向了政策更清晰的候选人。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "swing",
      "analysis": "“Swing” 是名词和动词的原形，而 “swings” 是其复数形式或第三人称单数形式。在语义上，当用作名词复数时，通常指多个秋千或多次摆动；作为动词第三人称单数时，强调动作的持续性或习惯性，如 “The pendulum swings every two seconds.”"
    },
    {
      "word_to_compare": "oscillate",
      "analysis": "“Oscillate” (振荡) 是一个更技术性、科学化的词汇，常用于物理或工程语境，指在两个状态之间规律性地来回变化，如电压或频率的振荡。而 “swing” 更口语化，涵盖物理摆动、情绪或立场的转变，语义范围更广。"
    },
    {
      "word_to_compare": "fluctuate",
      "analysis": "“Fluctuate” (波动) 强调数量、水平或状态的不稳定变化，常用于经济、温度或情绪等抽象领域，如价格波动。它不包含物理运动的意象，而 “swings” 常带有明显的空间运动或方向性转变的视觉联想。"
    }
  ]
}