{
  "word": "swing",
  "pronunciation": "swing",
  "concise_definition": "v. 摇摆, 摆动; n. 摇摆, 摆动, 秋千",
  "forms": {
    "third_person_singular": "swings",
    "past_tense": "swung",
    "past_participle": "swung",
    "present_participle": "swinging"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move back and forth or in a curved arc, typically suspended or attached at one end, like a pendulum or a child on a swing.",
      "explanation_cn": "指像钟摆或荡秋千的孩子那样，围绕一个支点做前后或弧形的摆动。",
      "example_en": "The tree branch swung gently in the wind.",
      "example_cn": "树枝在风中轻轻摇摆。"
    },
    {
      "pos": "verb",
      "explanation_en": "To change one's opinion, preference, or allegiance, especially in a decisive or sudden way, often under pressure or influence.",
      "explanation_cn": "指在压力或影响下，突然或果断地改变观点、偏好或立场。",
      "example_en": "After the debate, several voters swung from supporting the incumbent to backing the challenger.",
      "example_cn": "辩论之后，几位选民从支持现任者转向支持挑战者。"
    },
    {
      "pos": "noun",
      "explanation_en": "A seat suspended by ropes or chains, designed for a person to sit on and move back and forth, commonly found in playgrounds.",
      "explanation_cn": "指用绳索或链条悬挂、供人坐上去前后摆动的座椅，常见于游乐场。",
      "example_en": "The children laughed as they swung higher and higher.",
      "example_cn": "孩子们一边荡得越来越高，一边大笑。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sweeping movement or motion, especially with a weapon, tool, or arm, often implying force or energy.",
      "explanation_cn": "指一种有力或充满能量的挥动动作，尤指使用武器、工具或手臂时的大幅度摆动。",
      "example_en": "He delivered a powerful swing with the baseball bat.",
      "example_cn": "他用棒球棒使出一记有力的挥击。"
    },
    {
      "pos": "noun",
      "explanation_en": "A significant shift or change in direction, trend, or public opinion, often used in political or economic contexts.",
      "explanation_cn": "指方向、趋势或公众意见的重大转变，常用于政治或经济语境中。",
      "example_en": "The election resulted in a dramatic swing toward the center-right party.",
      "example_cn": "这次选举导致公众意见大幅转向中间偏右政党。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sway",
      "analysis": "“Sway” (摇晃/影响) 通常指缓慢、柔和的摆动，或指通过影响力使他人改变立场，更强调心理或情感上的作用。而 “swing” 的摆动更有力、更明显，且在政治语境中更常用于描述立场的突然转变。"
    },
    {
      "word_to_compare": "oscillate",
      "analysis": "“Oscillate” (振荡/波动) 是一个更正式、科学的术语，常用于物理或抽象概念（如电压、民意）的周期性变化，强调规律性和重复性。而 “swing” 更口语化，常用于描述非规律性的、有方向性的摆动或转变。"
    },
    {
      "word_to_compare": "fluctuate",
      "analysis": "“Fluctuate” (波动) 指数值、情绪或状况在一定范围内上下不定地变化，通常没有明确的方向性，如价格波动。而 “swing” 暗示一种明确的、有时是剧烈的转向，常从一个极端到另一个极端。"
    }
  ]
}