{
  "word": "swipe",
  "pronunciation": "swīp",
  "concise_definition": "v. 挥动, 滑动, 抢夺; n. 挥动, 滑动, 一击",
  "forms": {
    "third_person_singular": "swipes",
    "past_tense": "swiped",
    "past_participle": "swiped",
    "present_participle": "swiping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move something quickly and forcefully in a particular direction, often with a sweeping motion, typically using the hand or an object.",
      "explanation_cn": "指以快速而有力的挥动动作在某个方向移动某物，通常用手或工具做出扫动。",
      "example_en": "She swiped her hand across the table, knocking over the glass.",
      "example_cn": "她用手一挥，把桌上的玻璃杯打翻了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move a finger or stylus across a touchscreen to navigate or select items, as on a smartphone or tablet.",
      "explanation_cn": "指在智能手机或平板电脑的触摸屏上用手指或触控笔滑动，以进行导航或选择项目。",
      "example_en": "Swipe left to skip the song, or right to like it.",
      "example_cn": "向左滑动跳过这首歌，向右滑动点赞。"
    },
    {
      "pos": "verb",
      "explanation_en": "To steal or take something quickly and stealthily, often in a casual or opportunistic manner.",
      "explanation_cn": "指迅速而隐秘地偷走或拿走某物，通常带有随意或趁机而为的性质。",
      "example_en": "Someone swiped my wallet from my back pocket while I was on the bus.",
      "example_cn": "我在公交车上时，有人从我后口袋偷走了钱包。"
    },
    {
      "pos": "noun",
      "explanation_en": "A quick, sweeping motion, especially with the hand or an object, often used to describe a strike or movement.",
      "explanation_cn": "指快速的扫动动作，尤指用手或工具做出的击打或移动。",
      "example_en": "He gave the door a final swipe with his rag to remove the dust.",
      "example_cn": "他用抹布最后擦了一下门，把灰尘清除干净。"
    },
    {
      "pos": "noun",
      "explanation_en": "An act of stealing something quickly or a single attempt to swipe, especially in the context of dating apps or theft.",
      "explanation_cn": "指一次快速的偷窃行为，或在约会应用中的一次滑动操作。",
      "example_en": "I made a swipe at the app and matched with someone interesting.",
      "example_cn": "我在应用上滑了一下，匹配到了一个有趣的人。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sweep",
      "analysis": "“Sweep”（扫）强调覆盖大面积的连续、平稳的运动，常用于清洁或扫除，如扫地、扫雪。而 “swipe” 更强调短促、有力、方向明确的一次性动作，常带有攻击性或随意性，范围较小。"
    },
    {
      "word_to_compare": "slip",
      "analysis": "“Slip”（滑动/溜走）强调因光滑或疏忽而无意中移动或逃脱，如滑倒、偷溜。而 “swipe” 是有意识、主动的动作，常用于偷窃或操作屏幕，带有明确目的性。"
    },
    {
      "word_to_compare": "tap",
      "analysis": "“Tap”（轻敲）是短暂、轻柔的触碰，常用于激活设备或引起注意，如轻点屏幕。而 “swipe” 是长距离的滑动动作，用于导航或清除，动作幅度更大、更连续。"
    }
  ]
}