{
  "word": "swoop",
  "pronunciation": "swooop",
  "concise_definition": "v. 俯冲, 突袭, 抓取; n. 俯冲, 突袭",
  "forms": {
    "third_person_singular": "swoops",
    "past_tense": "swooped",
    "past_participle": "swooped",
    "present_participle": "swooping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move quickly and suddenly downward, especially in a curved path, as a bird of prey does when attacking its target.",
      "explanation_cn": "指像猛禽一样迅速而突然地向下俯冲，通常呈弧线轨迹，用于攻击目标。",
      "example_en": "The hawk swooped down and snatched the mouse from the grass.",
      "example_cn": "鹰俯冲而下，从草丛中抓走了那只老鼠。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a sudden, swift attack or move to seize something, often unexpectedly or in large numbers.",
      "explanation_cn": "指突然、迅速地发动袭击或行动，以夺取某物，常带有出其不意或群体行动的意味。",
      "example_en": "Shoppers swooped on the discounted items as soon as the store opened.",
      "example_cn": "商店一开门，顾客们便蜂拥而上抢购打折商品。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden, swift downward movement or attack, especially by a bird or a group of people.",
      "explanation_cn": "指突然而迅速的向下移动或袭击，尤指鸟类或人群的行动。",
      "example_en": "The swoop of the falcon was so fast that the rabbit had no time to escape.",
      "example_cn": "游隼的俯冲如此迅捷，兔子根本来不及逃跑。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden, large-scale effort to collect or capture something, often in a surprise operation.",
      "explanation_cn": "指一次突然的大规模行动，旨在收集或捕获某物，常带有突袭性质。",
      "example_en": "Police carried out a swoop on the illegal gambling den and arrested ten people.",
      "example_cn": "警方对非法赌场展开突袭，逮捕了十人。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "dive",
      "analysis": "“Dive” (俯冲/跳水) 通常指垂直或倾斜地向下运动，可以是主动的（如跳水）或被动的（如飞机俯冲），但不一定带有攻击性或突然性。而 “swoop” 强调弧线轨迹、速度和攻击意图，常用于捕食或突袭场景。"
    },
    {
      "word_to_compare": "ambush",
      "analysis": "“Ambush” (伏击) 是一种有预谋的隐蔽攻击，强调隐藏和等待时机，而 “swoop” 更强调突然性和速度，常为无预兆的快速行动，不一定需要隐藏。例如，警察的突袭是 swoop，而埋伏在路边的袭击是 ambush。"
    },
    {
      "word_to_compare": "snatch",
      "analysis": "“Snatch” (抢夺) 侧重于快速抓取或夺取某物的动作本身，常用于手部动作或小范围争夺。而 “swoop” 不仅包含抓取，还包含一个完整的、动态的运动轨迹（如俯冲），常用于描述更大范围或更壮观的行动，如鸟类或人群的集体行动。"
    }
  ]
}