{
  "word": "swung",
  "pronunciation": "swung",
  "concise_definition": "v. (swing 的过去式和过去分词) 摇摆, 摆动, 挥动, 投票",
  "forms": {
    "base_form": "swing",
    "third_person_singular": "swings",
    "present_participle": "swinging",
    "past_tense": "swung",
    "past_participle": "swung"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move back and forth or in a curved path, typically while suspended or attached at one end, often with force or momentum.",
      "explanation_cn": "指以一端为支点，前后或沿弧线来回摆动，通常带有力量或惯性。",
      "example_en": "The child swung on the playground swing until she was dizzy.",
      "example_cn": "孩子在秋千上荡来荡去，直到头晕目眩。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move something forcefully through the air, especially with the arm or a tool, as in hitting or striking.",
      "explanation_cn": "指用力在空中挥动某物，尤其是用手臂或工具进行击打或挥动。",
      "example_en": "He swung the bat and hit a home run.",
      "example_cn": "他挥动球棒，打出了一记本垒打。"
    },
    {
      "pos": "verb",
      "explanation_en": "To change direction, opinion, or allegiance, especially suddenly or dramatically, often in response to external influence.",
      "explanation_cn": "指突然或显著地改变方向、观点或忠诚，通常受外界影响所致。",
      "example_en": "Public opinion swung in favor of the new policy after the debate.",
      "example_cn": "辩论之后，公众意见转向支持这项新政策。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cast a vote, especially in a formal election or decision-making process (used primarily in the phrase 'to swing one's vote').",
      "explanation_cn": "指投票，尤其用于正式选举或决策过程中（常用于短语 'swing one's vote'）。",
      "example_en": "The undecided senator swung his vote to support the bill.",
      "example_cn": "这位犹豫不决的参议员投出了支持该法案的一票。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "swing",
      "analysis": "“Swing” 是动词原形，表示一般性或习惯性的摆动或挥动行为；而 “swung” 是其过去式和过去分词形式，用于描述已经发生的动作。两者语义相同，仅时态不同。"
    },
    {
      "word_to_compare": "wave",
      "analysis": "“Wave” (挥动) 通常指手臂或物体在水平或垂直方向上快速、重复地移动，常用于打招呼或表达情绪，动作幅度较小且更轻柔。而 “swung” 强调更大的弧线运动和更强的动量，常用于击打或大幅度摆动。"
    },
    {
      "word_to_compare": "rotate",
      "analysis": "“Rotate” (旋转) 指围绕一个固定轴心做圆周运动，强调连续性和规律性，如地球自转。而 “swung” 描述的是非连续的、有惯性的弧线运动，不一定围绕中心轴，更偏向于单次或间歇性动作。"
    },
    {
      "word_to_compare": "flip",
      "analysis": "“Flip” (翻转) 指快速地上下或前后翻动，常为180度的突然转向，动作短促且具有反转性质。而 “swung” 是长弧线运动，强调动量和轨迹，不必然包含方向反转。"
    }
  ]
}