{
  "word": "systemic",
  "pronunciation": "sis·tem·ik",
  "concise_definition": "adj. 系统的, 全身性的, 体制内的",
  "forms": {
    "comparative": "more systemic",
    "superlative": "most systemic"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or affecting an entire system, especially a complex organization or structure such as a body, economy, or government, rather than just one part.",
      "explanation_cn": "指涉及或影响整个系统，尤其是身体、经济或政府等复杂组织或结构，而非仅其中一个部分。",
      "example_en": "The disease caused systemic inflammation throughout the body.",
      "example_cn": "这种疾病引发了全身性的炎症。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Inherent in or embedded within the structure of a system, often implying deep-rooted, widespread, and persistent characteristics that are difficult to change.",
      "explanation_cn": "指内在于某个系统结构之中，通常暗示着根深蒂固、广泛存在且难以改变的特性。",
      "example_en": "Racial bias is a systemic problem in many institutions.",
      "example_cn": "种族偏见是许多机构中一个体制性问题。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Affecting or involving the whole body, especially in medical contexts, as opposed to localized effects.",
      "explanation_cn": "在医学语境中，指影响或涉及整个身体，而非局部区域。",
      "example_en": "The patient showed systemic symptoms including fever, fatigue, and weight loss.",
      "example_cn": "患者表现出全身性症状，包括发热、疲劳和体重减轻。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "general",
      "analysis": "“General”（普遍的）指广泛存在或适用于多数情况，但不一定涉及系统结构本身。它可以是表面的、非结构性的。而 “systemic” 强调问题或特征根植于系统内部结构，是系统运作方式的一部分，具有更深的结构性和根本性。"
    },
    {
      "word_to_compare": "widespread",
      "analysis": "“Widespread”（广泛的）仅描述影响范围大，可能只是地理或数量上的扩散，不涉及系统性原因。例如，某种病毒可能在多个地区广泛传播，但未必是体制性问题。而 “systemic” 指的是问题源于系统本身的机制或设计缺陷，即使范围不大，也可能具有系统性。"
    },
    {
      "word_to_compare": "structural",
      "analysis": "“Structural”（结构性的）与 “systemic” 非常接近，常可互换，但 “structural” 更侧重于物理或组织架构层面（如建筑结构、组织层级），而 “systemic” 更强调整个系统内部的动态、功能和相互关联，涵盖更广，包括规则、文化、流程等非物理层面。"
    }
  ]
}