{
  "word": "tab",
  "pronunciation": "tab",
  "concise_definition": "n. 标签, 小票, 账单, 小舌; v. 贴标签, 记账, 轻敲",
  "forms": {
    "plural": "tabs"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small piece of paper, plastic, or metal attached to something to provide information, identification, or a means of opening (e.g., a tag on clothing or a browser tab).",
      "explanation_cn": "附着在物品上以提供信息、标识或开启功能的小片纸、塑料或金属，例如衣物上的标签或浏览器中的标签页。",
      "example_en": "She checked the tab on the shirt to see the size and care instructions.",
      "example_cn": "她查看了衬衫上的标签，以了解尺码和洗涤说明。"
    },
    {
      "pos": "noun",
      "explanation_en": "A bill or account for goods or services received, especially one that is settled later (e.g., a restaurant tab).",
      "explanation_cn": "指已接受但尚未支付的商品或服务账单，通常允许事后结算，例如餐厅的记账单。",
      "example_en": "He put his drinks on tab and paid at the end of the night.",
      "example_cn": "他把酒水记在账上，晚上结束时一起结账。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small flap or projection on an object, especially one used for pulling or fastening (e.g., the tab on a zipper).",
      "explanation_cn": "指物体上用于拉动或固定的小片或凸起部分，例如拉链上的拉片。",
      "example_en": "The tab on the zipper was broken, so she couldn't close her jacket.",
      "example_cn": "拉链的拉片坏了，所以她无法拉上夹克。"
    },
    {
      "pos": "verb",
      "explanation_en": "To attach a label or tag to something, often for identification or categorization.",
      "explanation_cn": "在某物上贴上标签，通常用于识别或分类。",
      "example_en": "The librarian tabbed each book with a color-coded system for easy retrieval.",
      "example_cn": "图书管理员为每本书贴上了带颜色编码的标签，以便于查找。"
    },
    {
      "pos": "verb",
      "explanation_en": "To record a charge or expense on someone's account, especially in a bar or restaurant.",
      "explanation_cn": "将消费或费用记入某人的账户，尤其在酒吧或餐厅中。",
      "example_en": "The bartender tabbed the customer's order to his room number.",
      "example_cn": "调酒师将顾客的点单记到了他的房间账上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To tap lightly or repeatedly, especially with a finger or small object.",
      "explanation_cn": "轻敲或反复轻击，尤指用手指或小物件。",
      "example_en": "He tabbed his fingers on the table while waiting for the results.",
      "example_cn": "他在等待结果时用手指轻敲桌面。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "label",
      "analysis": "“Label”（标签）更侧重于信息性内容，如名称、说明或分类，常用于商品、文件或数据的标识；而 “tab” 除了可作标签外，还特指物理上可操作的小片（如拉链拉片、浏览器标签页），强调功能性或可交互性。"
    },
    {
      "word_to_compare": "bill",
      "analysis": "“Bill”（账单）是正式的、通常书面的费用清单，用于结算；而 “tab” 更口语化，常用于非正式场合，指临时记账、可后续结清的消费记录，如酒吧或俱乐部的赊账。"
    },
    {
      "word_to_compare": "tag",
      "analysis": "“Tag”（标签）与 “tab” 在某些语境下可互换（如衣服标签），但 “tag” 更常指永久性或信息性标识，而 “tab” 更强调可操作性（如可拉动、可翻页），如浏览器标签页或拉链拉片。"
    }
  ]
}