{
  "word": "tables",
  "pronunciation": "tay·buhlz",
  "concise_definition": "n. 桌子, 表格, 会议桌, 餐桌",
  "forms": {
    "singular": "table"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A piece of furniture with a flat top and one or more legs, used for placing objects, eating, working, or displaying items.",
      "explanation_cn": "一种具有平坦台面和一条或多条腿的家具，用于放置物品、用餐、工作或展示物件。",
      "example_en": "She placed the vase on the wooden table near the window.",
      "example_cn": "她把花瓶放在窗边的木桌上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A structured arrangement of data in rows and columns, used to present information clearly and systematically, often in reports, research, or databases.",
      "explanation_cn": "以行和列形式组织的数据排列，用于清晰、系统地呈现信息，常用于报告、研究或数据库中。",
      "example_en": "The research paper included a table comparing the efficiency of five different algorithms.",
      "example_cn": "这篇研究论文包含了一个比较五种不同算法效率的表格。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of people seated around a table, especially for a formal meeting, negotiation, or meal; can also refer to the act of postponing consideration of a matter.",
      "explanation_cn": "围坐在桌旁的一群人，尤指用于正式会议、谈判或用餐；也可指搁置某事项的审议。",
      "example_en": "The peace talks were held at the negotiating table.",
      "example_cn": "和平谈判在谈判桌上进行。"
    },
    {
      "pos": "noun",
      "explanation_en": "A list of scheduled events or times, such as train schedules, class timetables, or sports fixtures.",
      "explanation_cn": "一系列安排好的事件或时间列表，如列车时刻表、课程表或体育赛事安排。",
      "example_en": "I checked the train timetable to make sure I wouldn't miss my connection.",
      "example_cn": "我查了列车时刻表，以确保不会错过转乘。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "desk",
      "analysis": "“Desk”（书桌）通常指专为工作或学习设计的家具，常带有抽屉或储物空间，强调功能性与个人使用；而 “table” 更通用，可用于用餐、会议、展示等多种用途，结构通常更简单，不强调储物功能。"
    },
    {
      "word_to_compare": "chart",
      "analysis": "“Chart”（图表）是数据的视觉化呈现，如柱状图、饼图或折线图，强调趋势和关系；而 “table” 是以行列形式呈现精确数值，适合查阅具体数据，不强调图形化表达。"
    },
    {
      "word_to_compare": "counter",
      "analysis": "“Counter”（柜台）通常指商店、服务台或厨房中用于接待顾客或操作的长条形台面，常与服务、交易或工作流程相关；而 “table” 更中性，主要用于放置物品或供人围坐，不必然涉及服务功能。"
    }
  ]
}