{
  "word": "tackled",
  "pronunciation": "tak·ld",
  "concise_definition": "v. 应对, 处理, 攻击, 抱摔",
  "forms": {
    "base_form": "tackle",
    "third_person_singular": "tackles",
    "present_participle": "tackling",
    "past_tense": "tackled",
    "past_participle": "tackled"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To deal with a difficult problem or situation in a determined and effective way, often requiring effort, strategy, or courage.",
      "explanation_cn": "指以坚定和有效的方式应对一个困难的问题或情况，通常需要付出努力、策略或勇气。",
      "example_en": "The government has finally tackled the issue of air pollution with strict new regulations.",
      "example_cn": "政府终于通过严格的新规应对了空气污染问题。"
    },
    {
      "pos": "verb",
      "explanation_en": "To physically confront and bring down an opponent, especially in sports like football or rugby, by grabbing and holding them to stop their progress.",
      "explanation_cn": "指在足球、橄榄球等运动中，通过抓住并抱住对手以阻止其前进的物理性对抗动作。",
      "example_en": "The linebacker tackled the running back just short of the goal line.",
      "example_cn": "线卫在对方跑卫即将达阵前将他扑倒在地。"
    },
    {
      "pos": "verb",
      "explanation_en": "To begin to deal with a task or project, especially one that is large or complex, often implying a proactive or systematic approach.",
      "explanation_cn": "指着手处理一项任务或项目，尤其是庞大或复杂的工作，常暗示一种主动或系统性的处理方式。",
      "example_en": "She tackled the mountain of paperwork on her desk first thing in the morning.",
      "example_cn": "她一大早就着手处理桌上堆积如山的文件。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "address",
      "analysis": "“Address” (处理/应对) 更中性、正式，常用于书面语或专业语境，强调‘提及’或‘开始处理’，但不一定包含行动的强度或决心。而 “tackled” 暗示更积极、有力甚至激烈的应对，带有克服困难的意味。"
    },
    {
      "word_to_compare": "confront",
      "analysis": "“Confront” (面对/直面) 强调直视问题或对手，常带有心理或情感上的对抗，如面对恐惧或冲突。而 “tackled” 更侧重于采取实际措施去解决或制服，动作性更强，常用于具体任务或物理性对抗。"
    },
    {
      "word_to_compare": "solve",
      "analysis": "“Solve” (解决) 专指找到问题的正确答案或方法，结果导向明确，常用于数学、逻辑或技术问题。而 “tackled” 不保证问题已被解决，只强调已开始或正在努力处理，过程重于结果。"
    }
  ]
}