{
  "word": "tagging",
  "pronunciation": "tag·ing",
  "concise_definition": "n. 标记, 贴标签, 标签行为",
  "forms": {
    "base_form": "tag",
    "present_participle": "tagging",
    "past_tense": "tagged",
    "past_participle": "tagged"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of attaching a label, identifier, or metadata to content, objects, or digital items to categorize, organize, or track them for easier retrieval or analysis.",
      "explanation_cn": "指为内容、物体或数字项目附加标签、标识符或元数据，以便分类、组织或追踪，从而便于检索或分析。",
      "example_en": "Social media platforms rely heavily on tagging to help users discover related content.",
      "example_cn": "社交媒体平台高度依赖标签功能，以帮助用户发现相关内容。"
    },
    {
      "pos": "noun",
      "explanation_en": "The practice of marking physical objects or locations with identifiers, often for surveillance, ownership, or promotional purposes.",
      "explanation_cn": "指在实物或地点上做标记，通常用于监控、标明所有权或宣传目的。",
      "example_en": "The graffiti artist was arrested for tagging public buildings with his signature symbol.",
      "example_cn": "这位涂鸦艺术家因在公共建筑上喷涂自己的标志而被捕。"
    },
    {
      "pos": "noun",
      "explanation_en": "In sports or games, the act of touching a player or object to achieve a specific objective, such as in the game of tag.",
      "explanation_cn": "在体育或游戏中，指通过触碰某位玩家或物体以达成特定目标的行为，如玩‘捉人’游戏时的触碰动作。",
      "example_en": "The children were laughing as they played tagging in the park.",
      "example_cn": "孩子们在公园里玩捉人游戏，笑声不断。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "labeling",
      "analysis": "“Labeling”（贴标签）更侧重于为事物赋予一个明确的名称或分类，常用于正式或系统性的归类，如产品标签、医学诊断标签。而 “tagging” 更灵活、非正式，常用于数字环境中的动态分类，如社交媒体标签或用户自定义标记。"
    },
    {
      "word_to_compare": "marking",
      "analysis": "“Marking”（标记）是一个更广泛的术语，泛指任何形式的痕迹、符号或记号，可以是物理的（如划线、涂色）或抽象的（如评分）。而 “tagging” 特指带有功能性目的的标识，通常用于信息组织或追踪，具有更强的语义和结构意义。"
    },
    {
      "word_to_compare": "categorizing",
      "analysis": "“Categorizing”（分类）强调将事物按预设类别系统性分组，是一个逻辑或结构化的过程。而 “tagging” 更自由、多维，允许一个项目拥有多个标签，不依赖严格的层级体系，常用于非正式或用户生成的内容组织。"
    }
  ]
}