{
  "word": "tagged",
  "pronunciation": "tagd",
  "concise_definition": "v. 贴标签, 标记, 附上标签 (tag 的过去式和过去分词)",
  "forms": {
    "base_form": "tag",
    "third_person_singular": "tags",
    "present_participle": "tagging",
    "past_tense": "tagged",
    "past_participle": "tagged"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To attach a label, identifier, or metadata to something (e.g., a person, object, or digital file) for the purpose of categorization, tracking, or identification.",
      "explanation_cn": "为某物（如人、物体或数字文件）附加一个标签、标识符或元数据，以便进行分类、追踪或识别。",
      "example_en": "The photographer tagged all the images with location and date metadata.",
      "example_cn": "摄影师为所有照片添加了地点和日期的元数据标签。"
    },
    {
      "pos": "verb",
      "explanation_en": "To mark or identify someone or something by naming or labeling them, often publicly or digitally (e.g., on social media).",
      "explanation_cn": "通过命名或贴标签来标识某人或某物，通常是在公共或数字平台上（如社交媒体）。",
      "example_en": "She tagged her friend in the vacation photo on Instagram.",
      "example_cn": "她在 Instagram 上的度假照片中标记了她的朋友。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pursue and touch someone in a game (e.g., tag) as a way of identifying them as 'it' or caught.",
      "explanation_cn": "在游戏（如捉人游戏）中追逐并触碰某人，以标识其为‘它’或已被抓住。",
      "example_en": "The kids were playing tag, and he was tagged just as he reached the safe zone.",
      "example_cn": "孩子们在玩捉人游戏，他刚跑到安全区就被抓到了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To mark or deface a surface (e.g., a wall or train) with graffiti or writing, often illegally.",
      "explanation_cn": "非法在表面（如墙壁或火车）上涂写或标记，通常指涂鸦。",
      "example_en": "The abandoned warehouse was tagged with spray-painted gang symbols.",
      "example_cn": "那座废弃的仓库被喷上了帮派的涂鸦符号。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "labeled",
      "analysis": "“Labeled” (贴标签) 与 “tagged” 在许多语境中可互换，但 “labeled” 更常用于正式、系统性的分类（如产品标签、医学诊断标签），语气更中性或官方；而 “tagged” 更口语化，常用于数字环境（如社交媒体标记）或非正式场景（如涂鸦）。"
    },
    {
      "word_to_compare": "marked",
      "analysis": "“Marked” (标记) 是一个更宽泛的词，可指任何类型的可见记号，包括划痕、符号、记号笔痕迹等，不一定具有分类或识别功能。而 “tagged” 隐含了信息性或功能性目的，如用于搜索、追踪或归类。"
    },
    {
      "word_to_compare": "mentioned",
      "analysis": "“Mentioned” (提及) 指在语言或文字中提到某人或某物，不涉及物理或数字标签的附加。而 “tagged” 强调通过技术或物理手段将一个标识符与对象直接关联，具有可点击、可搜索或可追踪的特性。"
    }
  ]
}