{
  "word": "tail",
  "pronunciation": "tayl",
  "concise_definition": "n. 尾巴, 尾部, 尾随; v. 尾随, 跟踪",
  "forms": {
    "plural": "tails"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The posterior appendage extending from the body of an animal, typically used for balance, communication, or locomotion.",
      "explanation_cn": "动物身体后部延伸出的附属结构，通常用于保持平衡、交流或辅助运动。",
      "example_en": "The cat flicked its tail as it walked gracefully across the room.",
      "example_cn": "猫优雅地穿过房间时，尾巴轻轻摆动。"
    },
    {
      "pos": "noun",
      "explanation_en": "The rear or end part of something, such as the tail of a kite, a line of people, or a comet.",
      "explanation_cn": "指某物的后部或末端，如风筝的尾部、排队的队尾或彗星的彗尾。",
      "example_en": "The comet's tail stretched millions of kilometers across the night sky.",
      "example_cn": "这颗彗星的彗尾在夜空中延伸了数百万公里。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small or subordinate part of a larger whole, often used metaphorically (e.g., the tail of an economic trend).",
      "explanation_cn": "指较大整体中较小或从属的部分，常用于比喻（如经济趋势的尾部阶段）。",
      "example_en": "The tail end of the conference was dedicated to networking and informal discussions.",
      "example_cn": "会议的尾声部分专门用于社交和非正式交流。"
    },
    {
      "pos": "verb",
      "explanation_en": "To follow someone or something closely, often secretly or persistently.",
      "explanation_cn": "指紧随某人或某物，通常带有秘密或持续的意味。",
      "example_en": "The detective tailed the suspect for three days before making an arrest.",
      "example_cn": "侦探跟踪嫌疑人三天后才实施逮捕。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rear",
      "analysis": "“Rear”（后部）通常指物体或结构的背面或后方，强调空间位置，多用于车辆、建筑或军队阵型中，如“rear window”或“rear guard”。而 “tail” 更具体地指生物体自然延伸的末端部分，或具有动态、流动感的末端（如彗尾、队尾），语义更形象、更具生物或视觉特征。"
    },
    {
      "word_to_compare": "end",
      "analysis": "“End”（末端）是一个通用词，泛指任何事物的终止点，可指时间、空间或抽象概念的终点（如“the end of the movie”）。而 “tail” 通常保留物理形态的延续性，暗示一种与主体相连的、可观察的延伸部分，语义范围更窄、更具体。"
    },
    {
      "word_to_compare": "follow",
      "analysis": "“Follow”（跟随）是更广泛、中性的动词，可指物理跟随、追随理念、模仿行为等，不隐含隐蔽性。而 “tail” 作为动词时，特指秘密、持续、监视性的跟踪，常用于侦探、安保或情报语境，带有更强的隐秘性和目的性。"
    }
  ]
}