{
  "word": "tame",
  "pronunciation": "taym",
  "concise_definition": "adj. 驯服的, 温顺的; v. 驯服, 使温顺",
  "forms": {
    "third_person_singular": "tames",
    "past_tense": "tamed",
    "past_participle": "tamed",
    "present_participle": "taming",
    "comparative": "tamer",
    "superlative": "tamest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing an animal or person that has been trained or conditioned to be docile, obedient, or less wild or aggressive than naturally expected.",
      "explanation_cn": "形容动物或人经过训练或适应后变得温顺、顺从，不再像原本那样野性或具有攻击性。",
      "example_en": "The once-wild horse is now a tame and gentle companion.",
      "example_cn": "这匹曾经野性的马如今已成为温顺亲切的伙伴。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that is dull, unexciting, or lacking in spontaneity or danger, often in contrast to its natural or original state.",
      "explanation_cn": "形容某事物单调乏味、缺乏刺激或冒险性，常与它原本自然或原始的状态形成对比。",
      "example_en": "The city's nightlife used to be wild, but now it's become too tame for young people.",
      "example_cn": "这座城市夜生活过去很狂野，但现在对年轻人来说太乏味了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To train or subdue an animal or person to reduce wildness, aggression, or resistance, often through patience and consistent effort.",
      "explanation_cn": "通过耐心和持续的努力，训练或制服动物或人，以减少其野性、攻击性或反抗行为。",
      "example_en": "She spent months taming the stray dog until it would sit calmly beside her.",
      "example_cn": "她花了数月时间驯服这只流浪狗，直到它能安静地坐在她身边。"
    },
    {
      "pos": "verb",
      "explanation_en": "To bring something wild, chaotic, or uncontrollable under control or make it more manageable or orderly.",
      "explanation_cn": "使原本狂野、混乱或不可控的事物变得可控或更有条理。",
      "example_en": "The government is trying to tame inflation before it damages the economy.",
      "example_cn": "政府正试图控制通货膨胀，以免其损害经济。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "domesticate",
      "analysis": "“Domesticate” (驯化) 通常指长期、代际的生物适应过程，使野生动植物适应人类生活环境，如狗、猫、小麦等。它强调物种层面的遗传改变；而 “tame” 更侧重于个体行为的短期训练，不涉及基因变化。"
    },
    {
      "word_to_compare": "subdue",
      "analysis": "“Subdue” (压制/制服) 强调通过力量、权威或暴力手段使某人或某物屈服，常带有强制性；而 “tame” 更强调通过耐心、训练或温和方式使野性减弱，结果更倾向于和谐与合作。"
    },
    {
      "word_to_compare": "gentle",
      "analysis": "“Gentle” (温和的) 是描述性格或行为的天然属性，指不粗暴、不激烈；而 “tame” 是一个过程的结果，指原本野性或危险的事物被改变后变得温顺。一个天生温柔的人是 gentle，而一只曾咬人的狗被训练后不再攻击，是 tame。"
    }
  ]
}