{
  "word": "tangle",
  "pronunciation": "tang·gl",
  "concise_definition": "n. 缠结, 混乱; v. 缠绕, 混乱",
  "forms": {
    "third_person_singular": "tangles",
    "past_tense": "tangled",
    "past_participle": "tangled",
    "present_participle": "tangling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A confused or twisted mass of something, especially threads, wires, or hair, that is difficult to separate or untangle.",
      "explanation_cn": "指某种物品（尤其是线、电线或头发）形成的混乱、扭曲的团块，难以分开或解开。",
      "example_en": "She spent twenty minutes trying to undo the tangle in her hair after swimming.",
      "example_cn": "游泳后，她花了二十分钟才把头发里的乱结解开。"
    },
    {
      "pos": "noun",
      "explanation_en": "A complicated or confusing situation involving people, ideas, or systems, often with conflicting interests or unclear outcomes.",
      "explanation_cn": "指涉及人、想法或系统的一种复杂或混乱的局面，常伴有利益冲突或结果不明。",
      "example_en": "The legal tangle surrounding the inheritance took years to resolve.",
      "example_cn": "围绕遗产继承的法律纠纷花了数年才解决。"
    },
    {
      "pos": "verb",
      "explanation_en": "To twist or become twisted together in a confused or entangled way, often unintentionally.",
      "explanation_cn": "指（使）以混乱的方式缠绕或扭结在一起，通常是无意的。",
      "example_en": "The fishing line got tangled around the rock.",
      "example_cn": "鱼线缠在了石头上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To involve oneself in a complicated or difficult situation, often unwillingly or unexpectedly.",
      "explanation_cn": "指无意或意外地陷入复杂或困难的境地。",
      "example_en": "He tangled himself in a web of lies to cover up his mistake.",
      "example_cn": "他陷入了一张谎言的网中，以掩盖自己的错误。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "knit",
      "analysis": "“Knit”（编织）指有意识地、有秩序地将线、纤维等交织成紧密结构，如毛衣或组织；而 “tangle” 强调无序、混乱的缠绕，通常带有负面或麻烦的含义。"
    },
    {
      "word_to_compare": "entangle",
      "analysis": "“Entangle” 是 “tangle” 的更正式或强调形式，常用于抽象语境（如法律、政治纠葛），强调被深陷其中、难以脱身；而 “tangle” 更常用于物理缠绕或口语化表达，语气更轻。"
    },
    {
      "word_to_compare": "mess",
      "analysis": "“Mess”（混乱）泛指任何杂乱无章的状态，可以是空间、行为或思维上的；而 “tangle” 特指因缠绕、交织而形成的混乱，具有明显的物理或结构上的纠缠特征，语义更具体。"
    }
  ]
}