{
  "word": "tango",
  "pronunciation": "tan·go",
  "concise_definition": "n. 探戈舞, 探戈音乐; v. 跳探戈, 与...周旋",
  "forms": {
    "plural": "tangos"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A passionate and dramatic partner dance of Argentine origin, characterized by close embrace, sharp movements, and intricate footwork, typically performed to music in 2/4 or 4/4 time.",
      "explanation_cn": "一种起源于阿根廷的激情而富有戏剧性的双人舞蹈，以紧密的拥抱、锐利的动作和复杂的步法为特征，通常配合2/4或4/4拍的音乐进行。",
      "example_en": "They performed a stunning tango at the international dance competition.",
      "example_cn": "他们在国际舞蹈比赛中表演了一段令人惊叹的探戈。"
    },
    {
      "pos": "noun",
      "explanation_en": "The music that accompanies the tango dance, featuring a distinctive rhythm, often played with bandoneón, violin, piano, and double bass.",
      "explanation_cn": "用于伴奏探戈舞的音乐，具有独特的节奏，通常由班多钮手风琴、小提琴、钢琴和低音提琴演奏。",
      "example_en": "The café played classic tango tunes late into the night.",
      "example_cn": "这家咖啡馆深夜播放着经典的探戈曲目。"
    },
    {
      "pos": "verb",
      "explanation_en": "To dance the tango, especially in a romantic or intimate context.",
      "explanation_cn": "跳探戈舞，尤其在浪漫或亲密的语境中。",
      "example_en": "At the party, they tangoed under the dim lights, lost in the music.",
      "example_cn": "在派对上，他们在昏暗的灯光下跳起了探戈，沉醉于音乐之中。"
    },
    {
      "pos": "verb",
      "explanation_en": "To engage in a complex, often evasive or indirect interaction, especially in politics or negotiations, where parties move back and forth without reaching a clear resolution.",
      "explanation_cn": "指在政治或谈判中进行复杂、回避或间接的互动，双方来回周旋却未能达成明确结果。",
      "example_en": "The two countries have been tangoing over trade tariffs for months.",
      "example_cn": "这两个国家几个月来一直在贸易关税问题上互相周旋。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "waltz",
      "analysis": "“Waltz”（华尔兹）是一种优雅流畅的三拍子舞蹈，强调旋转和连贯的滑动动作，氛围较为浪漫柔和。而 “tango” 是二拍或四拍的舞蹈，动作顿挫有力，充满张力与戏剧性，情感表达更激烈、更具对抗性。"
    },
    {
      "word_to_compare": "salsa",
      "analysis": "“Salsa”（萨尔萨舞）起源于拉丁美洲，节奏欢快、动作自由奔放，强调臀部摆动和即兴发挥，社交性更强。相比之下，tango 更注重舞伴间的紧密连接与情感交流，动作更内敛、控制力更强，带有深沉的忧郁气质。"
    },
    {
      "word_to_compare": "dance",
      "analysis": "“Dance” 是泛指所有舞蹈形式的总称，而 “tango” 是一种具体的舞蹈类型，具有明确的历史、音乐和动作规范。当用作动词时，“dance” 可以泛指任何跳舞行为，而 “tango” 作为动词时特指跳探戈，或隐喻性地指代复杂周旋的行为，语义更具体且常含策略性意味。"
    }
  ]
}