{
  "word": "tap",
  "pronunciation": "tap",
  "concise_definition": "v. 轻敲, 利用, 取用; n. 水龙头, 轻敲, 抽取",
  "forms": {
    "third_person_singular": "taps",
    "past_tense": "tapped",
    "past_participle": "tapped",
    "present_participle": "tapping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To strike something lightly and repeatedly, especially with the fingers or a small object, often to attract attention or produce a sound.",
      "explanation_cn": "指用手指或小物体轻而快地敲击某物，常用于吸引注意或发出声音。",
      "example_en": "She tapped her fingers on the table while waiting for the results.",
      "example_cn": "她在等待结果时用手指轻敲桌面。"
    },
    {
      "pos": "verb",
      "explanation_en": "To connect to a source of supply (such as water, electricity, or a resource) in order to draw or use it, often by installing a pipe or line.",
      "explanation_cn": "指通过安装管道或线路连接到某种资源（如水、电）以获取或利用它。",
      "example_en": "The village tapped into the city's water supply to solve its drought problem.",
      "example_cn": "这个村庄接入了城市的供水系统以解决干旱问题。"
    },
    {
      "pos": "verb",
      "explanation_en": "To access or make use of a hidden or underutilized resource, often metaphorically (e.g., talent, potential, or funds).",
      "explanation_cn": "指利用某种隐藏或未被充分利用的资源，常用于比喻意义（如才能、潜力或资金）。",
      "example_en": "The startup tapped into the global market by hiring remote workers.",
      "example_cn": "这家初创公司通过雇佣远程员工，利用了全球市场。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device, usually a valve, used to control the flow of a liquid or gas from a container or pipe, commonly found on sinks and beer kegs.",
      "explanation_cn": "一种用于控制液体或气体从容器或管道中流出的装置，通常为阀门，常见于水槽和啤酒桶上。",
      "example_en": "He turned the tap to fill the glass with water.",
      "example_cn": "他拧开水龙头，往杯子里接水。"
    },
    {
      "pos": "noun",
      "explanation_en": "A light, quick strike or knock, especially with the fingers or a small object.",
      "explanation_cn": "指用手指或小物体轻快地敲击一下，尤指发出短促声响的动作。",
      "example_en": "He gave the door a gentle tap to announce his arrival.",
      "example_cn": "他轻轻敲了敲门，以示到来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "knock",
      "analysis": "“Knock” (敲击) 通常指更重、更明确的敲打动作，常用于表示请求进入或引起注意，带有更强的意图和声响；而 “tap” 更轻柔、短暂，常用于非侵入性或礼貌性的轻触，如轻敲桌面或门。"
    },
    {
      "word_to_compare": "extract",
      "analysis": "“Extract” (提取) 强调从某物中强行或系统性地取出某种成分，常用于化学、医学或技术语境，过程可能复杂；而 “tap” 更口语化，强调便捷地接入或利用现有资源，如取水、取电，动作更直接、自然。"
    },
    {
      "word_to_compare": "spigot",
      "analysis": "“Spigot” (龙头、塞子) 是 “tap” 在美式英语中作为名词时的同义词，专指液体流出的阀门装置，但 “spigot” 更常用于户外或工业场景（如酒桶、水管），而 “tap” 更通用，可用于日常家用、啤酒桶甚至比喻用法（如 tap into talent）。"
    }
  ]
}