{
  "word": "tar",
  "pronunciation": "tahr",
  "concise_definition": "n. 沥青, 焦油; v. 用沥青覆盖",
  "forms": {
    "plural": "tars",
    "third_person_singular": "tars",
    "past_tense": "tarred",
    "past_participle": "tarred",
    "present_participle": "tarring"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A thick, dark, sticky substance derived from coal, wood, or petroleum, used historically for waterproofing ships, roads, and roofs.",
      "explanation_cn": "一种从煤、木材或石油中提取的浓稠、深色、粘稠物质，历史上常用于船舶、道路和屋顶的防水处理。",
      "example_en": "The sailors coated the wooden hull with tar to protect it from seawater.",
      "example_cn": "水手们用沥青涂抹木制船体，以防止海水侵蚀。"
    },
    {
      "pos": "noun",
      "explanation_en": "A dark, sticky substance resembling tar, often used metaphorically to describe something unpleasant or morally corrupt.",
      "explanation_cn": "一种类似沥青的深色粘稠物，常用于比喻令人不快或道德败坏的事物。",
      "example_en": "The scandal was a tar-like smear on the politician's reputation.",
      "example_cn": "这场丑闻给这位政治家的声誉抹上了类似沥青般的污点。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover or coat something with tar, especially for waterproofing or preservation.",
      "explanation_cn": "用沥青覆盖或涂刷某物，尤指用于防水或防腐。",
      "example_en": "They tarred the roof to prevent leaks during the rainy season.",
      "example_cn": "他们给屋顶涂上沥青，以防止雨季漏水。"
    },
    {
      "pos": "verb",
      "explanation_en": "To associate someone or something negatively, often unfairly, by linking them to a disreputable person or thing (often used in the phrase 'tar with the same brush').",
      "explanation_cn": "通过将某人或某物与不名誉的人或事物联系起来，而对其做出负面评价（常用于短语 'tar with the same brush'）。",
      "example_en": "Don't tar all politicians with the same brush—some are genuinely dedicated to public service.",
      "example_cn": "不要一棍子打死所有政客——有些人确实真心致力于公共服务。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pitch",
      "analysis": "“Pitch”（松脂/焦油）与 “tar” 非常相似，都是粘稠的黑色物质，常用于防水。但 “pitch” 通常指从松树等植物中提取的天然树脂，而 “tar” 多为人工从煤或石油中提炼。在现代语境中，两者常可互换，但 “pitch” 更具自然来源的意味。"
    },
    {
      "word_to_compare": "asphalt",
      "analysis": "“Asphalt”（沥青）是现代道路铺设中最常用的材料，主要由石油提炼而成，质地比传统 “tar” 更稳定、更耐高温。虽然日常语言中常混用，但 “asphalt” 是工程术语，而 “tar” 更偏向传统或比喻用法。"
    },
    {
      "word_to_compare": "stain",
      "analysis": "“Stain”（污渍）指因接触而留下的颜色或污迹，通常是无意的、负面的残留物。而 “tar” 作为动词时，强调主动地、有意识地将负面标签强加于人或物，具有更强的修辞和道德评判色彩。"
    }
  ]
}