{
  "word": "tara",
  "pronunciation": "tah·rah",
  "concise_definition": "n. (印度) 塔拉女神；(意大利语) 天秤座；(商业) 毛重减去包装后的净重",
  "forms": {
    "plural": "taras"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "In Hinduism, Tara is a goddess associated with protection, compassion, and liberation; she is one of the ten Mahavidyas and is revered as a form of the divine feminine energy.",
      "explanation_cn": "在印度教中，塔拉是一位与保护、慈悲和解脱相关的女神，她是十位大智慧女神之一，被视为神圣女性能量的化身。",
      "example_en": "Devotees chant mantras to Tara for guidance through difficult times.",
      "example_cn": "信徒们吟诵塔拉的真言，以求在困境中获得指引。"
    },
    {
      "pos": "noun",
      "explanation_en": "In astrology and Western astronomy, Tara is an alternative spelling of 'Taurus', the zodiac sign represented by the bull, symbolizing stability and determination.",
      "explanation_cn": "在占星学和西方天文学中，Tara 是 'Taurus'（金牛座）的另一种拼写形式，该星座以公牛为象征，代表稳定与决心。",
      "example_en": "People born under Tara are often seen as reliable and grounded.",
      "example_cn": "金牛座出生的人通常被认为可靠而踏实。"
    },
    {
      "pos": "noun",
      "explanation_en": "In commerce and shipping, tara refers to the weight of packaging or container, subtracted from the gross weight to determine the net weight of the contents.",
      "explanation_cn": "在商业和运输中，塔拉指包装或容器的重量，从毛重中扣除后得出内容物的净重。",
      "example_en": "The tara of the shipping crate was 5 kg, so the net weight of the goods was 95 kg.",
      "example_cn": "运输箱的皮重为5公斤，因此货物的净重为95公斤。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "Taurus",
      "analysis": "“Taurus” 是标准的天文学和占星学术语，指黄道十二宫中的金牛座；而 “tara” 作为其非标准拼写，仅在少数语境或非正式场合中使用，且易与印度女神混淆，需注意语境区分。"
    },
    {
      "word_to_compare": "net weight",
      "analysis": "“Net weight” 是通用商业术语，指商品本身的实际重量；而 “tara” 是其计算中的一个组成部分（即包装重量），二者是相对概念，不能互换，但常在重量计算中共同出现。"
    },
    {
      "word_to_compare": "devi",
      "analysis": "“Devi” 是印度教中对所有女神的统称，泛指神圣女性；而 “Tara” 是其中一位具体女神的名字，属于 “devi” 的子集。使用 “devi” 更宽泛，而 “Tara” 更具体且具有特定神话背景。"
    }
  ]
}