{
  "word": "targeted",
  "pronunciation": "tahr·get·id",
  "concise_definition": "adj. 有针对性的, 专门针对的",
  "forms": {
    "comparative": "more targeted",
    "superlative": "most targeted"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Designed or directed specifically toward a particular person, group, goal, or outcome, often with precision and intentionality.",
      "explanation_cn": "专门设计或针对特定的人、群体、目标或结果，通常具有高度的精确性和目的性。",
      "example_en": "The company launched a targeted advertising campaign aimed at young professionals.",
      "example_cn": "该公司推出了一项针对年轻专业人士的精准广告活动。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by careful selection or customization to meet specific needs or conditions, often in contrast to broad or general approaches.",
      "explanation_cn": "以精心选择或定制为特征，以满足特定需求或条件，与广泛或笼统的方法形成对比。",
      "example_en": "Targeted medical treatments are more effective because they address the specific genetic markers of a disease.",
      "example_cn": "针对性的医疗治疗更有效，因为它们针对的是疾病的特定基因标志。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used in military or law enforcement contexts to describe actions or weapons aimed at specific individuals or locations to minimize collateral damage.",
      "explanation_cn": "用于军事或执法语境，指针对特定个人或地点采取的行动或武器，以最小化附带损害。",
      "example_en": "The military used targeted drone strikes to eliminate high-value targets without harming civilians.",
      "example_cn": "军方使用精准的无人机打击，以消灭高价值目标，同时避免伤害平民。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "specific",
      "analysis": "“Specific”（具体的）强调明确、非笼统，但不一定带有目的性或针对性。例如，'a specific date' 只是指出一个确切的时间点，而 'targeted campaign' 暗示了主动选择对象并意图影响它。'Targeted' 更强调意图和导向性。"
    },
    {
      "word_to_compare": "focused",
      "analysis": "“Focused”（集中的）强调注意力或资源集中在某一点上，但不一定意味着对象是被精心挑选的。例如，'a focused discussion' 指讨论不跑题，而 'targeted training' 意味着训练内容是为特定人群量身定制的。'Targeted' 更具策略性和选择性。"
    },
    {
      "word_to_compare": "customized",
      "analysis": "“Customized”（定制的）强调根据个人偏好或需求进行调整，常用于产品或服务。而 'targeted' 更侧重于识别并瞄准一个预设的群体或目标，不一定是个性化调整。例如，一个广告可以针对千禧一代（targeted），但未必为每个人定制（customized）。"
    }
  ]
}