{
  "word": "targeting",
  "pronunciation": "tär·ɡət·iŋ",
  "concise_definition": "n. 定位, 目标瞄准, 针对性策略",
  "forms": {
    "base_form": "target",
    "present_participle": "targeting",
    "past_tense": "targeted",
    "past_participle": "targeted"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of identifying and focusing on a specific group of people, markets, or objectives to maximize the effectiveness of a strategy, message, or action.",
      "explanation_cn": "指识别并集中于特定人群、市场或目标，以最大化策略、信息或行动的有效性。",
      "example_en": "The advertising campaign's success relied heavily on precise targeting of young urban professionals.",
      "example_cn": "这场广告活动的成功很大程度上依赖于对年轻城市专业人士的精准定位。"
    },
    {
      "pos": "noun",
      "explanation_en": "In military or security contexts, the process of selecting and directing resources (such as weapons or surveillance) toward a specific objective or threat.",
      "explanation_cn": "在军事或安全语境中，指选择并引导资源（如武器或监控）针对特定目标或威胁的过程。",
      "example_en": "The drone's targeting system locked onto the vehicle moving at high speed.",
      "example_cn": "无人机的瞄准系统锁定了那辆高速行驶的车辆。"
    },
    {
      "pos": "noun",
      "explanation_en": "In digital marketing or data analytics, the practice of using behavioral, demographic, or geographic data to deliver personalized content or ads to specific user segments.",
      "explanation_cn": "在数字营销或数据分析中，指利用行为、人口统计或地理数据，向特定用户群体推送个性化内容或广告的做法。",
      "example_en": "Social media platforms use advanced targeting to show users ads based on their browsing history and interests.",
      "example_cn": "社交媒体平台利用先进的定位技术，根据用户的浏览历史和兴趣展示广告。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "segmentation",
      "analysis": "“Segmentation” (细分) 指将整体市场或群体划分为若干具有相似特征的子群体，是定位前的分析步骤。而 “targeting” 是在细分基础上，选择其中一部分作为重点进攻或沟通的对象，是决策和行动阶段。"
    },
    {
      "word_to_compare": "focus",
      "analysis": "“Focus” (聚焦) 是一个更通用的词，泛指集中注意力或资源于某事物，不必然涉及数据驱动或策略性选择。而 “targeting” 更具技术性、策略性和目的性，常用于商业、军事或传播领域，强调对特定目标的精确瞄准。"
    },
    {
      "word_to_compare": "aiming",
      "analysis": "“Aiming” (瞄准) 更偏向物理或动作层面的指向，如瞄准目标射击，常用于字面意义。而 “targeting” 是一个更抽象、系统化的术语，涵盖策略规划、数据分析和长期执行，适用范围更广，语义更专业。"
    }
  ]
}