{
  "word": "target",
  "pronunciation": "tär·gət",
  "concise_definition": "n. 目标, 对象, 射击目标; v. 针对, 以...为目标",
  "forms": {
    "plural": "targets",
    "third_person_singular": "targets",
    "past_tense": "targeted",
    "past_participle": "targeted",
    "present_participle": "targeting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A specific goal or objective that one aims to achieve, often used in contexts such as business, sports, or personal development.",
      "explanation_cn": "指一个人或组织旨在实现的具体目标或目的，常用于商业、体育或个人发展等语境。",
      "example_en": "Our sales target for this quarter is to increase revenue by 15%.",
      "example_cn": "本季度我们的销售目标是将收入提高15%。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person, group, or thing that is the focus of an action, attack, or effort, often in a negative or critical context.",
      "explanation_cn": "指成为某种行动、攻击或努力焦点的人、群体或事物，常带有负面或批评意味。",
      "example_en": "The protesters targeted the government building with graffiti.",
      "example_cn": "抗议者用涂鸦攻击了政府大楼。"
    },
    {
      "pos": "noun",
      "explanation_en": "A physical object, such as a circular board, used as a point of aim in shooting or throwing games.",
      "explanation_cn": "指在射击或投掷游戏中用作瞄准点的实物，如圆形靶子。",
      "example_en": "He hit the bullseye on the target with his third arrow.",
      "example_cn": "他第三支箭射中了靶心。"
    },
    {
      "pos": "verb",
      "explanation_en": "To direct an action, effort, or message toward a specific person, group, or goal with intention.",
      "explanation_cn": "指有意识地将行动、努力或信息指向特定的人、群体或目标。",
      "example_en": "The advertising campaign targets young adults aged 18 to 25.",
      "example_cn": "这场广告活动针对的是18至25岁的年轻人。"
    },
    {
      "pos": "verb",
      "explanation_en": "To select or designate someone or something as the focus of an attack, criticism, or operation.",
      "explanation_cn": "指将某人或某物选定为攻击、批评或行动的对象。",
      "example_en": "Cybercriminals often target small businesses with phishing scams.",
      "example_cn": "网络罪犯常通过钓鱼诈骗针对小型企业。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "goal",
      "analysis": "“Goal” (目标) 更强调最终希望达成的结果，通常具有抽象性和长期性，如人生目标、教育目标。而 “target” 更具体、可量化，常带有时间限制和明确的衡量标准，如销售目标、绩效目标。"
    },
    {
      "word_to_compare": "objective",
      "analysis": "“Objective” (目标/目的) 与 “target” 非常接近，常可互换，但 “objective” 更正式，多用于战略规划或学术语境，强调逻辑性和系统性；“target” 更口语化，常用于日常管理和执行层面，强调可操作性和结果导向。"
    },
    {
      "word_to_compare": "aim",
      "analysis": "“Aim” (目标/意图) 可作名词或动词，侧重于方向或意图，常用于较模糊或非正式的语境，如 “My aim is to be healthier.” 而 “target” 更强调具体、可测量的终点，具有更强的执行力和结果导向。"
    }
  ]
}