{
  "word": "taste",
  "pronunciation": "tāst",
  "concise_definition": "n. 味道, 鉴赏力, 嗜好; v. 尝, 体验",
  "forms": {
    "third_person_singular": "tastes",
    "past_tense": "tasted",
    "past_participle": "tasted",
    "present_participle": "tasting",
    "plural": "tastes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The sensation produced in the mouth by a substance, especially in relation to its flavor, such as sweet, sour, bitter, salty, or umami.",
      "explanation_cn": "指物质在口中产生的感觉，尤其是其风味，如甜、酸、苦、咸或鲜味。",
      "example_en": "The wine had a rich, fruity taste with a hint of oak.",
      "example_cn": "这款酒味道浓郁果香，带有一丝橡木味。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person's ability to judge what is aesthetically pleasing or of high quality, especially in art, fashion, or design.",
      "explanation_cn": "指一个人判断艺术、时尚或设计中何为优美或高品质的能力，即审美鉴赏力。",
      "example_en": "Her interior design shows excellent taste—elegant but never ostentatious.",
      "example_cn": "她的室内设计展现了极佳的品位——优雅而不浮夸。"
    },
    {
      "pos": "noun",
      "explanation_en": "A personal preference or liking for something, often based on individual inclination rather than objective criteria.",
      "explanation_cn": "指个人对某事物的偏好或喜好，通常基于个人倾向而非客观标准。",
      "example_en": "My taste in music leans toward jazz and classical, while his is all pop.",
      "example_cn": "我的音乐品味偏向爵士和古典，而他的全是流行音乐。"
    },
    {
      "pos": "verb",
      "explanation_en": "To experience the flavor of something by putting it in the mouth and chewing or swallowing slightly.",
      "explanation_cn": "通过将食物或饮料放入口中咀嚼或轻咽来体验其味道。",
      "example_en": "She tasted the soup to see if it needed more salt.",
      "example_cn": "她尝了尝汤，看是否需要加盐。"
    },
    {
      "pos": "verb",
      "explanation_en": "To experience something briefly or partially, especially an emotion, situation, or experience.",
      "explanation_cn": "指短暂或部分地体验某种情感、情境或经历。",
      "example_en": "He tasted freedom for the first time after escaping prison.",
      "example_cn": "他逃出监狱后，第一次尝到了自由的滋味。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "flavor",
      "analysis": "“Flavor”（风味）更侧重于食物或饮料中复杂的香气与味道的综合体验，常包含嗅觉成分；而 “taste” 更局限于舌头感知的五种基本味觉（甜、酸、苦、咸、鲜）。在日常使用中，两者常互换，但 “flavor” 更丰富、更全面。"
    },
    {
      "word_to_compare": "preference",
      "analysis": "“Preference”（偏好）是一个更广泛、更中性的词，指在多个选项中选择某一个的倾向，不涉及审美或感官体验；而 “taste” 在表示喜好时，隐含了审美判断或文化修养的维度，如艺术品味、穿衣风格等。"
    },
    {
      "word_to_compare": "savor",
      "analysis": "“Savor”（细细品味）强调缓慢、专注地享受味道或体验，带有情感投入和延长感受的意味；而 “taste” 通常是短暂、初步的接触。例如：savor a meal（细细享用一餐） vs. taste the soup（尝一口汤）。"
    }
  ]
}