{
  "word": "tat",
  "pronunciation": "tat",
  "concise_definition": "n. 低劣的装饰品, 糟糕的刺绣; v. 用劣质装饰品点缀",
  "forms": {
    "plural": "tats",
    "third_person_singular": "tats",
    "past_tense": "tatted",
    "past_participle": "tatted",
    "present_participle": "tattings"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A decorative element, especially one made of knotted or looped thread, that is considered cheap, gaudy, or poorly made; often used to describe ornamental trim on clothing or household items.",
      "explanation_cn": "一种装饰性元素，通常由打结或环状的线制成，被认为廉价、俗艳或做工粗糙；常用于描述衣物或家居用品上的装饰边饰。",
      "example_en": "The dress was covered in cheap tat, making it look more like a carnival costume than formal wear.",
      "example_cn": "这件裙子上布满了廉价的装饰物，看起来更像狂欢节的服装，而不是正式礼服。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small tattoo, especially one that is poorly executed or considered trivial or unimportant.",
      "explanation_cn": "一个小型纹身，尤其是那些制作粗糙或被认为微不足道、无意义的纹身。",
      "example_en": "He got a tiny heart tat on his wrist when he was sixteen, and now he regrets it.",
      "example_cn": "他十六岁时在手腕上纹了一个小爱心，现在后悔了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To decorate something with cheap or gaudy ornaments, especially in a way that is considered tasteless.",
      "explanation_cn": "用廉价或俗艳的装饰品点缀某物，通常带有品味低下的意味。",
      "example_en": "They tatted the walls with plastic flowers and glitter to make the room look festive.",
      "example_cn": "他们用塑料花和亮片把墙壁装饰得花里胡哨，想让房间显得喜庆些。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "embroidery",
      "analysis": "“Embroidery”（刺绣）指技艺精湛、具有艺术价值的线绣装饰，强调手工精细和审美性；而 “tat” 则带有贬义，指粗糙、廉价、缺乏美感的类似装饰，二者在工艺水平和文化评价上形成鲜明对比。"
    },
    {
      "word_to_compare": "tattoo",
      "analysis": "“Tattoo”（纹身）是中性词，泛指皮肤上的永久性图案，可具艺术性或象征意义；而 “tat” 作为其非正式用法，特指那些低质量、随意或幼稚的纹身，带有明显的贬低和轻蔑语气。"
    },
    {
      "word_to_compare": "trinket",
      "analysis": "“Trinket”（小饰物）泛指廉价的小装饰品，如钥匙扣、手链等，多用于指独立的小物件；而 “tat” 更强调装饰行为或整体风格的低俗感，常用于描述大面积、杂乱的装饰效果，语义范围更广且更具批判性。"
    }
  ]
}