{
  "word": "tattoo",
  "pronunciation": "tuh·too",
  "concise_definition": "n. 文身, 刺青; v. 给...纹身",
  "forms": {
    "plural": "tattoos",
    "third_person_singular": "tattoos",
    "past_tense": "tattooed",
    "past_participle": "tattooed",
    "present_participle": "tattooing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A permanent design or pattern made by injecting ink into the skin, often for decorative, cultural, or symbolic purposes.",
      "explanation_cn": "通过将墨水注入皮肤而形成的永久性图案或设计，通常用于装饰、文化表达或象征意义。",
      "example_en": "She has a delicate tattoo of a bird on her wrist.",
      "example_cn": "她的手腕上有一个精致的鸟形文身。"
    },
    {
      "pos": "noun",
      "explanation_en": "A rhythmic, repetitive sound or pattern, especially one that mimics the tapping of a drum or the marking of time.",
      "explanation_cn": "一种有节奏的、重复的声音或模式，尤指模仿鼓点或计时敲击的声音。",
      "example_en": "The tattoo of rain on the roof kept him awake all night.",
      "example_cn": "雨点敲打屋顶的节奏声让他整夜未眠。"
    },
    {
      "pos": "verb",
      "explanation_en": "To mark the skin with ink to create a permanent design or pattern.",
      "explanation_cn": "通过在皮肤上注入墨水来形成永久性图案或设计。",
      "example_en": "He decided to tattoo his grandfather's initials on his arm.",
      "example_cn": "他决定在手臂上纹上祖父的首字母。"
    },
    {
      "pos": "verb",
      "explanation_en": "To repeat something rhythmically or persistently, often in a mechanical or habitual way.",
      "explanation_cn": "以有节奏或持续的方式重复某事，常带有机械性或习惯性。",
      "example_en": "The soldiers tattooed their boots on the ground in unison.",
      "example_cn": "士兵们整齐地用靴子有节奏地敲击地面。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mark",
      "analysis": "“Mark”（标记）泛指任何在表面留下的痕迹或符号，可以是临时的（如铅笔痕迹）或永久的（如疤痕），但不特指通过墨水注入皮肤的图案。而 “tattoo” 专指通过刺入皮肤的永久性艺术性标记，具有文化或个人意义。"
    },
    {
      "word_to_compare": "brand",
      "analysis": "“Brand”（烙印）通常指用高温灼烧皮肤或物体表面留下的永久性印记，常用于牲畜或作为惩罚/所有权标识，带有强制或压迫的含义。而 “tattoo” 是自愿的、艺术性的，强调审美与身份表达。"
    },
    {
      "word_to_compare": "inscription",
      "analysis": "“Inscription”（铭文）指刻写或镌刻在石头、金属、纪念碑等坚硬表面上的文字或符号，通常用于纪念或正式记录。它不涉及皮肤，也不具有纹身的私密性或身体艺术属性。"
    }
  ]
}