{
  "word": "tease",
  "pronunciation": "teez",
  "concise_definition": "v. 取笑, 戏弄, 挑逗; n. 取笑, 戏弄",
  "forms": {
    "third_person_singular": "teases",
    "past_tense": "teased",
    "past_participle": "teased",
    "present_participle": "teasing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To mock or make fun of someone in a playful or light-hearted way, often without malice, though it may sometimes cause mild offense.",
      "explanation_cn": "以轻松、玩笑的方式取笑或戏弄某人，通常并无恶意，但有时可能引起轻微冒犯。",
      "example_en": "They teased her about her new haircut, but she knew they meant it in good fun.",
      "example_cn": "他们取笑她的新发型，但她知道他们是出于善意的玩笑。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provoke or tantalize someone by offering something desirable but keeping it out of reach, often to create anticipation or frustration.",
      "explanation_cn": "通过提供诱人之物却故意不给予，来挑逗或激惹某人，常用于制造期待或挫败感。",
      "example_en": "He teased her with the promise of a surprise vacation, but wouldn't tell her where.",
      "example_cn": "他用一次惊喜旅行的承诺来挑逗她，却不愿告诉她目的地。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pull or separate fibers, such as hair or wool, into loose strands, often to create texture or volume.",
      "explanation_cn": "将毛发或羊毛等纤维拉成松散的缕状，常用于增加质感或蓬松度。",
      "example_en": "She teased her hair with a comb to add volume before the party.",
      "example_cn": "她用梳子把头发梳蓬松，以便在派对上更有造型感。"
    },
    {
      "pos": "noun",
      "explanation_en": "A playful or humorous remark intended to provoke a reaction, often in a friendly context.",
      "explanation_cn": "一种旨在引发反应的轻松幽默话语，通常在友好语境中使用。",
      "example_en": "His comment was just a tease—he didn't really mean it.",
      "example_cn": "他那句话只是开玩笑，并不是认真的。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mock",
      "analysis": "“Mock”（嘲笑）通常带有更强的贬义和敌意，强调通过模仿或讽刺来羞辱他人，而 “tease” 更偏向于无恶意的玩笑，常用于亲密关系中，语气更轻。"
    },
    {
      "word_to_compare": "taunt",
      "analysis": "“Taunt”（挑衅）是带有攻击性和挑衅性的言语，旨在激怒或伤害对方，常用于敌对情境；而 “tease” 通常不以伤害为目的，更多是社交互动中的调情或亲昵表达。"
    },
    {
      "word_to_compare": "flirt",
      "analysis": "“Flirt”（调情）特指以浪漫或性吸引力为目的的挑逗行为，语境通常涉及情感或性暗示；而 “tease” 的挑逗含义更广泛，可以是情感、物质或行为上的引诱，不一定涉及浪漫。"
    }
  ]
}