{
  "word": "teasing",
  "pronunciation": "tee·zing",
  "concise_definition": "n. 戏弄, 取笑, 挑逗; v. 戏弄, 取笑, 挑逗（tease 的现在分词和动名词形式）",
  "forms": {
    "base_form": "tease",
    "third_person_singular": "teases",
    "past_tense": "teased",
    "past_participle": "teased",
    "present_participle": "teasing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of playfully or mockingly provoking someone, often with humor or light-hearted remarks, without serious intent to harm.",
      "explanation_cn": "以幽默或戏谑的方式故意挑衅或逗弄某人，通常并无恶意，旨在制造轻松氛围。",
      "example_en": "His teasing about my cooking made everyone laugh, even me.",
      "example_cn": "他拿我的厨艺开玩笑，逗得大家哈哈大笑，连我自己也笑了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A flirtatious or suggestive behavior intended to arouse interest or desire without full commitment.",
      "explanation_cn": "一种带有挑逗意味的行为，旨在引发兴趣或欲望，但并不真正承诺进一步行动。",
      "example_en": "Their constant teasing kept the romantic tension alive throughout the summer.",
      "example_cn": "他们持续的挑逗让整个夏天的浪漫张力始终未消。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make fun of someone in a good-natured or joking way, often among friends or in familiar settings.",
      "explanation_cn": "以善意或玩笑的方式取笑某人，通常发生在朋友或熟悉的人之间。",
      "example_en": "They teased her about her new haircut, but she knew they meant no harm.",
      "example_cn": "他们取笑她的新发型，但她知道他们并无恶意。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provoke or tantalize someone by offering something desirable but keeping it out of reach.",
      "explanation_cn": "通过提供诱人之物却使其难以获得，来引诱或撩拨某人。",
      "example_en": "The bakery’s smell was teasing me as I walked past, but I couldn’t afford to buy anything.",
      "example_cn": "我走过面包店时，香味不断撩拨着我，但我买不起任何东西。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mocking",
      "analysis": "“Mocking”（嘲讽）带有更强的敌意或贬低意味，常用于公开羞辱或表达轻蔑，而 “teasing” 通常在亲密关系中进行，语气更轻快，不具伤害性。"
    },
    {
      "word_to_compare": "taunting",
      "analysis": "“Taunting”（挑衅/讥讽）强调以言语或行为激怒对方，常伴随挑衅和敌意，目的是引发愤怒或反应；而 “teasing” 更多是社交互动中的玩笑，通常双方都感到愉快。"
    },
    {
      "word_to_compare": "flirting",
      "analysis": "“Flirting”（调情）专指为建立浪漫或性吸引力而进行的暗示性互动，其目的明确指向情感或身体吸引；而 “teasing” 可用于非浪漫语境，如朋友间玩笑，其动机更广泛，不一定涉及性吸引力。"
    }
  ]
}