{
  "word": "teaser",
  "pronunciation": "tee·zur",
  "concise_definition": "n. 诱饵, 吊胃口的东西, 预告片",
  "forms": {
    "plural": "teasers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Something designed to provoke curiosity or interest by revealing only a small, intriguing part of a larger whole, often used in marketing or entertainment to generate anticipation.",
      "explanation_cn": "指通过揭示更大整体中一小部分引人入胜的内容，以激发好奇心或兴趣的事物，常用于营销或娱乐领域以制造期待感。",
      "example_en": "The studio released a 30-second teaser for the new superhero movie, leaving fans eager for more.",
      "example_cn": "制片公司发布了一段30秒的新超级英雄电影预告片，让粉丝们迫不及待地想看更多。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or remark that playfully provokes or mocks someone, often in a light-hearted or teasing manner.",
      "explanation_cn": "指以轻松、戏谑的方式逗弄或调侃他人的人或言语。",
      "example_en": "He’s always the teaser in the group, making fun of everyone’s funny habits.",
      "example_cn": "他总是团队里的逗乐者，爱拿大家的怪癖开玩笑。"
    },
    {
      "pos": "noun",
      "explanation_en": "In publishing or journalism, a short, attention-grabbing headline or snippet used to entice readers to read the full article.",
      "explanation_cn": "在出版或新闻领域，指用于吸引读者阅读完整文章的简短、引人注目的标题或片段。",
      "example_en": "The magazine’s teaser on the cover read: 'The Secret Behind the World’s Richest Man — Inside This Issue.'",
      "example_cn": "这本杂志封面上的诱饵标题写着：'世界最富有人背后的秘密——详见本期。'"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "preview",
      "analysis": "“Preview”（预览）是中性术语，指对完整内容的提前展示，通常完整、清晰，目的是让观众了解即将呈现的内容。而 “teaser” 更强调刻意保留关键信息，以制造悬念和渴望，通常更短、更碎片化，情感冲击更强。"
    },
    {
      "word_to_compare": "trailer",
      "analysis": "“Trailer”（预告片）是“teaser”的一种具体形式，通常用于电影或电视节目，时长较长（1–2分钟），结构完整，包含情节线索和音乐。而 “teaser” 更短（通常15–30秒），信息更少，更注重情绪和氛围的营造，而非叙事。"
    },
    {
      "word_to_compare": "taunt",
      "analysis": "“Taunt”（嘲弄）是带有敌意或侮辱性的言语挑衅，目的是伤害或激怒对方。而 “teaser” 在作为“逗弄者”时，通常不具恶意，更多是玩笑性质，甚至带有亲密感，语境更轻松。"
    }
  ]
}