{
  "word": "technology",
  "pronunciation": "tek·nol·uh·jee",
  "concise_definition": "n. 技术, 科技, 工艺",
  "forms": {
    "plural": "technologies"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The application of scientific knowledge for practical purposes, especially in industry, engineering, and manufacturing, involving tools, machines, systems, and methods.",
      "explanation_cn": "指将科学知识应用于实际目的，尤其在工业、工程和制造领域，涉及工具、机器、系统和方法。",
      "example_en": "Advances in medical technology have saved countless lives.",
      "example_cn": "医疗技术的进步挽救了无数生命。"
    },
    {
      "pos": "noun",
      "explanation_en": "The collective body of techniques, skills, and processes used to produce goods or services or to achieve specific objectives, often referring to digital or computer-based systems.",
      "explanation_cn": "指用于生产商品或服务或实现特定目标的全部技术、技能和流程的总和，常指数字或计算机系统。",
      "example_en": "The school integrates modern technology into every classroom to enhance learning.",
      "example_cn": "这所学校将现代科技融入每一间教室，以提升学习效果。"
    },
    {
      "pos": "noun",
      "explanation_en": "A specific system or method of technical application, often used in the plural form to denote different kinds of technological systems.",
      "explanation_cn": "指某种特定的技术应用系统，常以复数形式出现，表示不同类型的技术体系。",
      "example_en": "The company specializes in renewable energy technologies such as solar and wind power.",
      "example_cn": "该公司专精于太阳能和风能等可再生能源技术。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "science",
      "analysis": "“Science” (科学) 指通过观察、实验和推理系统地研究自然现象以获取知识的过程，强调理论和发现；而 “technology” 是科学知识的实际应用，强调实用性和成果。科学回答‘为什么’，技术回答‘怎么做’。"
    },
    {
      "word_to_compare": "invention",
      "analysis": "“Invention” (发明) 指首次创造出全新的设备、方法或过程，是一个具体的、原创性的成果；而 “technology” 是更广泛的概念，可以包含多个发明的整合与系统化应用。一个发明可能成为一项技术的一部分，但技术本身不一定是单一发明。"
    },
    {
      "word_to_compare": "engineering",
      "analysis": "“Engineering” (工程学) 是一门应用数学和科学原理来设计、构建和维护结构、机器、系统或过程的学科，侧重于设计过程和专业方法；而 “technology” 是工程实践的产物或工具，是工程成果的体现。工程是创造技术的手段，技术是工程的结果。"
    }
  ]
}