{
  "word": "tell",
  "pronunciation": "tel",
  "concise_definition": "v. 告诉, 讲述, 说出, 辨别",
  "forms": {
    "third_person_singular": "tells",
    "past_tense": "told",
    "past_participle": "told",
    "present_participle": "telling"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To communicate information, facts, or ideas to someone through speech or writing, often with the intention of informing or instructing.",
      "explanation_cn": "通过言语或文字向他人传达信息、事实或想法，通常旨在告知或指导。",
      "example_en": "She told me the meeting was postponed until next week.",
      "example_cn": "她告诉我会议已推迟到下周。"
    },
    {
      "pos": "verb",
      "explanation_en": "To narrate or recount a story, event, or experience, often in a detailed or engaging manner.",
      "explanation_cn": "叙述或复述一个故事、事件或经历，通常以详细或引人入胜的方式。",
      "example_en": "He told a fascinating tale about his travels across the Amazon.",
      "example_cn": "他讲述了一个关于自己穿越亚马逊之旅的精彩故事。"
    },
    {
      "pos": "verb",
      "explanation_en": "To perceive or distinguish something by observation, intuition, or subtle signs, often implying insight or judgment.",
      "explanation_cn": "通过观察、直觉或细微迹象来感知或辨别某事物，常暗示洞察力或判断力。",
      "example_en": "I could tell from her tone that she was upset.",
      "example_cn": "我从她的语气中听出她很不高兴。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give instructions or orders to someone, often in an authoritative or directive manner.",
      "explanation_cn": "以权威或指令性的方式向某人下达指示或命令。",
      "example_en": "The general told the troops to hold their position.",
      "example_cn": "将军命令士兵们坚守阵地。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "say",
      "analysis": "“Say” (说) 侧重于表达具体的话语内容，通常不强调信息的传递对象或意图，语气更中性。例如：He said, 'I'm tired.' 而 “tell” 必须带宾语（告诉谁），强调信息的定向传递，如：He told me he was tired. 因此 “tell” 更具互动性和目的性。"
    },
    {
      "word_to_compare": "inform",
      "analysis": "“Inform” (通知) 是更正式、更客观的词汇，常用于官方或书面语境，强调提供事实性信息，语气冷静。例如：The company informed employees of the policy change. “Tell” 更口语化，可包含情感、叙述或指令，适用范围更广。"
    },
    {
      "word_to_compare": "reveal",
      "analysis": "“Reveal” (揭示) 指原本隐藏或未知的信息被披露出来，常带有神秘性或戏剧性，强调‘揭露’的过程。例如：The report revealed corruption in the government. “Tell” 则不隐含信息是否被隐藏，只是单纯地传达，无论信息是公开的还是私密的。"
    },
    {
      "word_to_compare": "ascertain",
      "analysis": "“Ascertain” (查明) 是指通过调查或分析来确认事实，强调认知过程，常用于正式语境。例如：The detective ascertained the time of death. 而 “tell” 在表示‘辨别’时，是基于直觉、观察或经验的快速判断，不涉及系统性调查。"
    }
  ]
}