{
  "word": "temper",
  "pronunciation": "tem·puhr",
  "concise_definition": "n. 性情, 情绪; v. 调节, 缓和, 锻造",
  "forms": {
    "third_person_singular": "temper",
    "past_tense": "tempered",
    "past_participle": "tempered",
    "present_participle": "tempering"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person's natural disposition or usual mood, especially in terms of how easily they become angry or calm; refers to emotional balance or volatility.",
      "explanation_cn": "指一个人的天性或惯常情绪状态，尤其指其容易发怒或平静的程度；表示情绪的平衡性或不稳定性。",
      "example_en": "He has a short temper and often loses his patience in traffic.",
      "example_cn": "他脾气急躁，经常在堵车时失去耐心。"
    },
    {
      "pos": "noun",
      "explanation_en": "The degree of hardness and elasticity in metal, achieved through heating and cooling processes; a technical property in metallurgy.",
      "explanation_cn": "指金属经过加热和冷却处理后所获得的硬度与弹性程度；冶金学中的一个技术特性。",
      "example_en": "The sword was forged with perfect temper to ensure both strength and flexibility.",
      "example_cn": "这把剑经过完美的淬火处理，以确保其强度与韧性兼备。"
    },
    {
      "pos": "verb",
      "explanation_en": "To moderate or soften something, especially an extreme emotion, reaction, or quality, to make it more balanced or acceptable.",
      "explanation_cn": "指缓和或调和某种极端的情绪、反应或特质，使其更平衡或可接受。",
      "example_en": "She tried to temper her criticism with kindness to avoid hurting his feelings.",
      "example_cn": "她试图用善意来缓和自己的批评，以免伤害他的感情。"
    },
    {
      "pos": "verb",
      "explanation_en": "To heat and then cool a metal to improve its hardness and durability, especially to reduce brittleness.",
      "explanation_cn": "指通过加热然后冷却金属以提高其硬度和耐久性，特别是减少其脆性。",
      "example_en": "Blacksmiths temper steel blades to make them resistant to breaking under stress.",
      "example_cn": "铁匠通过淬火处理钢刃，使其在受压时不易断裂。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mood",
      "analysis": "“Mood”（情绪）泛指短暂的心理状态，如快乐、忧郁，通常不稳定且受环境影响；而 “temper” 更强调一个人长期、稳定的性情倾向，尤其是易怒程度，具有更强的个性特征和持久性。"
    },
    {
      "word_to_compare": "character",
      "analysis": "“Character”（性格）涵盖一个人全部的道德品质和行为模式，范围更广；而 “temper” 仅聚焦于情绪反应，特别是愤怒的控制能力，是性格的一个具体方面。"
    },
    {
      "word_to_compare": "adjust",
      "analysis": "“Adjust”（调整）是一个通用词，指为适应新情况而做出改变，可应用于物体、计划或行为；而 “temper” 作为动词时，特指通过克制或处理来缓和强度，尤其用于情绪或材料性能，带有更精确的语义边界。"
    },
    {
      "word_to_compare": "harden",
      "analysis": "“Harden”（变硬）仅强调增加硬度或变得冷酷，常含贬义；而 “temper” 在金属语境中是通过精确控制加热与冷却来实现硬度与韧性的平衡，是一种技术性、双向调节的过程，而非单向强化。"
    }
  ]
}