{
  "word": "tempered",
  "pronunciation": "tem·purd",
  "concise_definition": "adj. 经过调和的, 冷静的, 有节制的; (金属) 回火的",
  "forms": {
    "base_form": "temper",
    "present_participle": "tempering",
    "past_tense": "tempered",
    "past_participle": "tempered"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having been moderated or controlled, especially in terms of emotion or behavior, so as to be more balanced, reasonable, or less extreme.",
      "explanation_cn": "指情绪或行为经过调节或控制，变得更为平衡、理性或不那么极端。",
      "example_en": "She gave a tempered response to the provocative question, avoiding any hint of anger.",
      "example_cn": "她对这个挑衅性的问题作出了冷静的回应，没有流露出丝毫愤怒。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Of metal that has been heated and then cooled in a controlled way to increase its strength and reduce brittleness.",
      "explanation_cn": "指金属经过加热后再以受控方式冷却，以增强其强度并减少脆性。",
      "example_en": "The knife blade is made of tempered steel for durability and sharpness.",
      "example_cn": "这把刀的刀刃由回火钢制成，以确保耐用性和锋利度。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by a mixture of qualities that have been adjusted to achieve harmony or balance, often used metaphorically.",
      "explanation_cn": "指多种特质经过调整以达到和谐或平衡的状态，常用于隐喻意义。",
      "example_en": "His tempered optimism helped the team stay motivated without ignoring the risks.",
      "example_cn": "他适度的乐观态度帮助团队保持动力，同时又不忽视潜在风险。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "calm",
      "analysis": "“Calm” (平静的) 强调情绪上的安宁与无波动，常指缺乏激动或焦虑的状态。而 “tempered” 不仅指情绪稳定，更强调通过主动调节或克制使原本可能激烈的情绪变得适度和理性，带有过程性和意图性。"
    },
    {
      "word_to_compare": "balanced",
      "analysis": "“Balanced” (平衡的) 侧重于多种因素之间的均衡分布，常用于观点、时间、资源等抽象概念。而 “tempered” 更强调对原始强烈倾向的抑制或调和，尤其适用于情绪、性格或材料性能的改造，隐含‘原本过强’的前提。"
    },
    {
      "word_to_compare": "hardened",
      "analysis": "“Hardened” (变硬的) 通常指因经历或环境而变得冷漠、无情或缺乏弹性，常含贬义。而 “tempered” 在金属语境中指通过处理增强韧性而不失强度，在比喻义中则指增强理性与耐受力，是积极的优化，而非单纯的硬化。"
    }
  ]
}