{
  "word": "temple",
  "pronunciation": "tem·pl",
  "concise_definition": "n. 寺庙, 神庙, 会堂; (解剖学) 颞部",
  "forms": {
    "plural": "temples"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A building devoted to the worship of a deity or deities, often featuring sacred architecture, rituals, and religious symbolism in various cultures.",
      "explanation_cn": "用于供奉神灵的建筑物，通常具有神圣的建筑风格、仪式和宗教象征，广泛存在于不同文化中。",
      "example_en": "The ancient Greeks built grand temples to honor their gods, such as the Parthenon in Athens.",
      "example_cn": "古希腊人建造了宏伟的神庙来敬奉他们的神祇，例如雅典的帕特农神庙。"
    },
    {
      "pos": "noun",
      "explanation_en": "A place of worship or spiritual gathering for a particular religion or community, especially in non-Abrahamic traditions such as Hinduism or Buddhism.",
      "explanation_cn": "特定宗教或社群进行礼拜或精神集会的场所，尤指在印度教、佛教等非亚伯拉罕传统宗教中。",
      "example_en": "Visitors come from all over the world to meditate in the serene atmosphere of the Buddhist temple.",
      "example_cn": "游客们从世界各地前来这座佛教寺庙，在宁静的氛围中冥想。"
    },
    {
      "pos": "noun",
      "explanation_en": "The flat area on either side of the forehead, between the eye and the ear, which is part of the skull and contains the temporal bone.",
      "explanation_cn": "前额两侧、眼睛与耳朵之间的平坦区域，是头骨的一部分，包含颞骨。",
      "example_en": "He rubbed his temples to relieve the tension of his headache.",
      "example_cn": "他揉了揉太阳穴，以缓解头痛的紧张感。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "church",
      "analysis": "“Church”（教堂）特指基督教进行礼拜的场所，具有明确的教派传统和建筑风格（如尖顶、十字架）；而 “temple” 更广泛地用于非基督教宗教，如佛教、印度教或古希腊罗马宗教，其建筑形式和宗教内涵更具文化多样性。"
    },
    {
      "word_to_compare": "synagogue",
      "analysis": "“Synagogue”（犹太会堂）是犹太教进行祈祷、学习和社区活动的中心，其功能兼具宗教与教育；“temple” 在犹太教中有时也用作同义词（尤其在改革派中），但传统上更强调其作为古代耶路撒冷圣殿的象征，而现代犹太会堂不具神圣性。"
    },
    {
      "word_to_compare": "shrine",
      "analysis": "“Shrine”（神龛/圣地）通常指较小的、供奉特定神灵或圣物的场所，可能位于户外或建筑内部一角，强调对特定对象的崇拜；而 “temple” 是规模更大、结构更完整的宗教建筑，包含多个功能区域，如祭坛、殿堂和僧侣住所。"
    }
  ]
}