{
  "word": "tenders",
  "pronunciation": "ten·duhrs",
  "concise_definition": "n. 投标, 报价; v. 提供, 提交 (投标)",
  "forms": {
    "singular": "tender",
    "third_person_singular": "tenders",
    "past_tense": "tendered",
    "past_participle": "tendered",
    "present_participle": "tendering"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A formal offer or proposal, especially one submitted in response to a public or organizational invitation to supply goods or services, often involving competitive bidding.",
      "explanation_cn": "指正式的报价或提议，尤指应公共机构或组织邀请提交的供应商品或服务的投标，通常涉及竞争性竞价。",
      "example_en": "The city received seven tenders for the new bridge construction project.",
      "example_cn": "市政府收到了七个关于新桥建设项目投标书。"
    },
    {
      "pos": "noun",
      "explanation_en": "A legal or formal offer of payment, especially when the payer has fulfilled their obligation and the recipient refuses to accept it.",
      "explanation_cn": "指法律或正式的付款行为，尤其在付款方已履行义务而收款方拒绝接受时。",
      "example_en": "He made a tender of the owed amount, but the creditor refused to accept it.",
      "example_cn": "他提交了所欠款项的支付，但债权人拒绝接受。"
    },
    {
      "pos": "verb",
      "explanation_en": "To formally offer or submit a bid, proposal, or payment, especially in a business or legal context.",
      "explanation_cn": "指在商业或法律语境中正式提交投标、提议或付款。",
      "example_en": "Several companies tendered for the government contract last week.",
      "example_cn": "上周多家公司提交了政府合同的投标。"
    },
    {
      "pos": "verb",
      "explanation_en": "To offer something willingly or respectfully, often with a sense of humility or deference.",
      "explanation_cn": "指自愿或恭敬地提供某物，常带有谦逊或顺从的意味。",
      "example_en": "She tendered her resignation after the scandal broke.",
      "example_cn": "丑闻曝光后，她提交了辞呈。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bid",
      "analysis": "“Bid” (投标) 与 “tender” 在商业语境中常可互换，但 “bid” 更通用，可用于拍卖、体育竞赛或非正式报价；而 “tender” 更正式，通常用于政府或大型机构的公开采购流程，具有更强的法律和程序性含义。"
    },
    {
      "word_to_compare": "offer",
      "analysis": "“Offer” (提议) 是一个更宽泛的词，泛指任何形式的提议，不一定是竞争性的或正式的；而 “tender” 特指在特定规则下提交的、具有法律效力的正式报价，通常伴随详细条款和条件。"
    },
    {
      "word_to_compare": "submit",
      "analysis": "“Submit” (提交) 是一个动作性动词，泛指将文件、申请或信息呈交，不隐含竞争或报价的含义；而 “tender” 不仅是提交，还包含“正式报价”或“提供付款”的特定意图，语义更专一。"
    }
  ]
}