{
  "word": "tense",
  "pronunciation": "tens",
  "concise_definition": "adj. 紧张的, 紧绷的; n. 时态; v. 使紧张, 使绷紧",
  "forms": {
    "third_person_singular": "tenses",
    "past_tense": "tensed",
    "past_participle": "tensed",
    "present_participle": "tensing"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Feeling or showing nervousness, anxiety, or strain, often due to stress or pressure; characterized by a state of mental or physical tightness.",
      "explanation_cn": "感到或表现出紧张、焦虑或压力，通常由于压力或紧张所致；指心理或身体处于紧绷状态。",
      "example_en": "She gave a tense smile before the interview began.",
      "example_cn": "面试开始前，她勉强挤出一个紧张的微笑。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Stretched tight or rigid, often describing muscles, lines, or surfaces under strain.",
      "explanation_cn": "拉紧或僵硬的，常用于描述在压力下绷紧的肌肉、线条或表面。",
      "example_en": "The tension in his jaw was visible as he clenched his teeth.",
      "example_cn": "当他咬紧牙关时，下颌的紧绷感清晰可见。"
    },
    {
      "pos": "noun",
      "explanation_en": "In grammar, a form of a verb that indicates the time of an action or state (e.g., past, present, future).",
      "explanation_cn": "在语法中，指表示动作或状态发生时间的动词形式（如过去时、现在时、将来时）。",
      "example_en": "The past tense of 'run' is 'ran'.",
      "example_cn": "“run”的过去时是“ran”。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make or become tense, especially muscles or a surface, by pulling or tightening.",
      "explanation_cn": "使某物（尤指肌肉或表面）变紧或绷紧，通常通过拉扯或收缩实现。",
      "example_en": "He tensed his shoulders as the loud noise echoed through the hall.",
      "example_cn": "当巨大的噪音在大厅回荡时，他紧绷了肩膀。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "nervous",
      "analysis": "“Nervous”（紧张不安的）侧重于心理状态，通常因担忧、害怕或期待而产生，强调情绪上的不安。而 “tense” 不仅可指心理紧张，还可指身体的物理性紧绷，语义范围更广，且常带有更强烈的压迫感。"
    },
    {
      "word_to_compare": "strained",
      "analysis": "“Strained”（勉强的、吃力的）强调因过度用力或压力而导致的不自然状态，常用于形容声音、关系或肌肉的过度拉伸。它比 “tense” 更突出“超负荷”或“濒临破裂”的意味，而 “tense” 可以是正常范围内的适度紧绷。"
    },
    {
      "word_to_compare": "grammar tense",
      "analysis": "在语法语境中，'tense' 作为名词特指动词的时态系统，如一般现在时、过去完成时等。它与形容词用法完全无关，属于专业术语。其他类似词如 'aspect'（体）或 'mood'（语气）虽同属语法范畴，但不表示时间，因此不能与 'tense' 混用。"
    }
  ]
}