{
  "word": "tent",
  "pronunciation": "tent",
  "concise_definition": "n. 帐篷, v. 露营, 扎帐篷",
  "forms": {
    "plural": "tents",
    "third_person_singular": "tents",
    "past_tense": "tented",
    "past_participle": "tented",
    "present_participle": "tenting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A portable shelter made of fabric or other materials, typically supported by poles and ropes, used for temporary accommodation, especially in outdoor activities like camping.",
      "explanation_cn": "一种由织物或其他材料制成的便携式遮蔽物，通常由支柱和绳索支撑，用于临时住宿，尤其在露营等户外活动中。",
      "example_en": "We pitched our tent beside the lake and fell asleep to the sound of crickets.",
      "example_cn": "我们在湖边搭起帐篷，在蟋蟀的鸣叫声中入睡。"
    },
    {
      "pos": "verb",
      "explanation_en": "To live or stay temporarily in a tent, especially during outdoor activities such as camping or hiking.",
      "explanation_cn": "指临时住在帐篷中，尤其在露营或徒步等户外活动中。",
      "example_en": "The hikers tented near the summit to watch the sunrise.",
      "example_cn": "徒步者在山顶附近扎营，以便观看日出。"
    },
    {
      "pos": "verb",
      "explanation_en": "To extend or stretch out in a way that resembles a tent, often used figuratively to describe something that spreads or arches over an area.",
      "explanation_cn": "指以类似帐篷的方式伸展或张开，常用于比喻某物覆盖或拱起于某一区域。",
      "example_en": "The canopy of trees tented over the trail, creating a cool, shaded path.",
      "example_cn": "树木的树冠如帐篷般覆盖在小径上方，形成一条凉爽阴凉的小路。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "canopy",
      "analysis": "“Canopy”（树冠/顶篷）通常指由植物枝叶自然形成的覆盖层，或人工建造的永久性遮蔽结构，强调的是覆盖物本身，而非可移动的居住空间。而 “tent” 是可拆卸、便携的临时住所，具有明确的结构和用途。"
    },
    {
      "word_to_compare": "shelter",
      "analysis": "“Shelter”（庇护所）是一个更广泛的术语，泛指任何形式的保护性结构，包括房屋、洞穴、棚屋等，不一定由布料制成，也不一定用于户外。而 “tent” 是一种特定类型的、轻便的、临时性的遮蔽物，专为移动性设计。"
    },
    {
      "word_to_compare": "camp",
      "analysis": "“Camp”（露营）作为动词时，泛指在户外过夜的行为，可能包括搭帐篷、睡睡袋、生火等，是一个综合性活动。而 “tent” 作为动词，特指‘搭帐篷’这一具体行为，是‘camp’的一部分。作为名词时，‘camp’ 可指营地，而 ‘tent’ 是营地中的具体设施。"
    }
  ]
}