{
  "word": "terminals",
  "pronunciation": "tur·muh·nuhlz",
  "concise_definition": "n. 终端, 端点, 车站, 末端",
  "forms": {
    "singular": "terminal"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A physical or electronic device that serves as an endpoint for communication, data input, or output in a computer system or network.",
      "explanation_cn": "指在计算机系统或网络中用作通信、数据输入或输出的终点的物理或电子设备。",
      "example_en": "The bank customers use the automated teller terminals to withdraw cash.",
      "example_cn": "银行客户使用自动取款终端来提取现金。"
    },
    {
      "pos": "noun",
      "explanation_en": "A station or facility where passengers or goods arrive or depart, especially in transportation systems such as airports, train stations, or seaports.",
      "explanation_cn": "指乘客或货物抵达或出发的站点或设施，尤指机场、火车站或海港等交通系统中的终端站。",
      "example_en": "The international flight departed from Terminal 3 at JFK Airport.",
      "example_cn": "国际航班从约翰·肯尼迪机场的三号航站楼起飞。"
    },
    {
      "pos": "noun",
      "explanation_en": "The end point or extremity of a structure, system, or pathway, such as the ends of a wire, a road, or a pipeline.",
      "explanation_cn": "指某一结构、系统或路径的末端或终点，例如电线、道路或管道的两端。",
      "example_en": "The electrician checked both terminals of the battery to ensure proper connection.",
      "example_cn": "电工检查了电池的两个端点，以确保连接正确。"
    },
    {
      "pos": "noun",
      "explanation_en": "In medicine, a condition or stage at the end of a disease process, often implying a critical or final phase.",
      "explanation_cn": "在医学中，指疾病过程的末期阶段，常暗示为危重或最终阶段。",
      "example_en": "The patient was in terminal condition, and the family was prepared for the end.",
      "example_cn": "病人已处于临终状态，家属已做好心理准备。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "station",
      "analysis": "“Station”（车站/站点）泛指交通系统中的停靠点，强调功能性和服务性，不一定具有终端的“终点”含义。例如，地铁站可能是中途站。而 “terminal” 特指线路的起止点，具有明确的终结性。"
    },
    {
      "word_to_compare": "endpoint",
      "analysis": "“Endpoint”（端点）是技术术语，常用于网络或编程语境，强调逻辑上的终止位置，多为抽象概念。而 “terminal” 既可以是物理设备（如终端机），也可以是实体场所（如机场航站楼），语义范围更广，更具实体性。"
    },
    {
      "word_to_compare": "finish",
      "analysis": "“Finish”（终点）多用于比赛、过程或活动的结束点，强调时间或阶段的终结，常用于比喻语境（如“人生的终点”）。而 “terminal” 更强调空间或系统结构上的末端，且常用于技术、交通或医学等专业领域，语义更精确、正式。"
    },
    {
      "word_to_compare": "terminus",
      "analysis": "“Terminus”（终点站）是 “terminal” 的同义词，多用于铁路或公交系统，但更书面化、正式，且在现代英语中使用频率较低。而 “terminal” 是更通用、更常见的现代词汇，适用于多种语境，包括计算机和医学领域。"
    }
  ]
}