{
  "word": "terminal",
  "pronunciation": "tur·muh·nuhl",
  "concise_definition": "n. 终端, 站点, 极端; adj. 末端的, 终极的, 致命的",
  "forms": {
    "plural": "terminals",
    "comparative": "more terminal",
    "superlative": "most terminal"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A physical or electronic point of connection or access, especially at the end of a line or system, such as an airport terminal or a computer terminal.",
      "explanation_cn": "指系统或线路末端的物理或电子连接点或接入点，例如机场航站楼或计算机终端。",
      "example_en": "Passengers waited at the international terminal for their flight to Tokyo.",
      "example_cn": "乘客们在国际航站楼等待飞往东京的航班。"
    },
    {
      "pos": "noun",
      "explanation_en": "The end point of a process, journey, or condition, often implying finality or conclusion.",
      "explanation_cn": "指某个过程、旅程或状态的终点，常暗示终结或最终结果。",
      "example_en": "After years of illness, he reached the terminal stage of cancer.",
      "example_cn": "经过多年的疾病，他进入了癌症的终末阶段。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or situated at the end or extremity of something, especially in a physical or structural sense.",
      "explanation_cn": "指位于某物末端或极端位置的，尤其在物理或结构意义上。",
      "example_en": "The terminal end of the nerve connects to the muscle.",
      "example_cn": "神经的末端连接着肌肉。"
    },
    {
      "pos": "adjective",
      "explanation_en": "So severe or advanced that recovery is impossible; fatal or incurable, especially in medical contexts.",
      "explanation_cn": "指病情严重或发展到无法康复的程度；在医学语境中意为致命的或不可治愈的。",
      "example_en": "The doctor delivered the grim news: the disease was terminal.",
      "example_cn": "医生传达了这个沉重的消息：这种疾病已是晚期。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "end",
      "analysis": "“End” (终点) 是最通用的词，泛指任何事物的终止点，可用于抽象或具体情境（如故事的结尾、一天的结束）。而 “terminal” 更强调结构性或系统性的末端，常用于交通、技术或医学等专业语境，语义更精确且正式。"
    },
    {
      "word_to_compare": "final",
      "analysis": "“Final” (最终的) 强调顺序上的最后一项或决定性结果，常用于时间、步骤或决策（如最终答案、最终决定）。而 “terminal” 更侧重于空间或生理上的终点，尤其在医学中带有不可逆和致命的含义，情感色彩更沉重。"
    },
    {
      "word_to_compare": "extreme",
      "analysis": "“Extreme” (极端的) 指处于两个对立面的最远端，常用于描述程度、行为或条件（如极端天气、极端观点）。而 “terminal” 专指终点或终结状态，不强调程度的极端性，而是强调不可逆转的终结性，尤其在医学语境中具有特定含义。"
    }
  ]
}