{
  "word": "terraces",
  "pronunciation": "tehr·uhss",
  "concise_definition": "n. 台地, 阶梯状平台, 阳台",
  "forms": {
    "singular": "terrace"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A flat, level area of land, especially one created on a hillside by cutting into the slope and supported by a retaining wall, often used for agriculture or construction.",
      "explanation_cn": "指在山坡上通过削坡并用挡土墙支撑而形成的平坦平台，常用于农业耕作或建筑用途。",
      "example_en": "The ancient rice fields of the Philippines are built on dramatic terraces carved into the mountains.",
      "example_cn": "菲律宾的古老稻田建在陡峭的山体上，形成壮观的梯田。"
    },
    {
      "pos": "noun",
      "explanation_en": "A row of identical houses or buildings, each sharing side walls with its neighbors, typically arranged in a continuous line, often found in urban settings.",
      "explanation_cn": "指一排排彼此相连、共用侧墙的相同房屋或建筑，通常呈直线排列，常见于城市环境中。",
      "example_en": "They rented a charming cottage in a historic terrace near the city center.",
      "example_cn": "他们在市中心附近的一条历史悠久的联排房屋中租了一间迷人的小屋。"
    },
    {
      "pos": "noun",
      "explanation_en": "An outdoor platform attached to a building, often elevated and used for sitting, dining, or enjoying views, especially in residential or hospitality contexts.",
      "explanation_cn": "指附属于建筑物的室外平台，通常较高，用于休憩、用餐或观赏景色，常见于住宅或酒店环境中。",
      "example_en": "The hotel suite featured a private terrace with panoramic views of the ocean.",
      "example_cn": "酒店套房配有私人阳台，可俯瞰壮丽的海景。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "platform",
      "analysis": "“Platform”（平台）泛指任何平坦的支撑表面，可以是临时的、功能性的或结构上的，如火车站台、演讲台等，不强调阶梯状或依山而建的特征。而 “terrace” 特指具有层级结构、常与地形结合的平台，具有空间层次感和景观设计意图。"
    },
    {
      "word_to_compare": "balcony",
      "analysis": "“Balcony”（阳台）是建筑物外墙上的小型平台，通常由楼层延伸而出，仅供少数人使用，尺寸较小且不具农业或地形改造功能。而 “terrace” 通常更大，可容纳多人活动，甚至可作为独立的耕作或居住区域，常与自然地形结合。"
    },
    {
      "word_to_compare": "step",
      "analysis": "“Step”（台阶）是垂直方向上的单个抬升单元，用于连接不同高度的平面，强调的是垂直过渡。而 “terrace” 是由多个台阶或平台组成的水平区域，强调的是水平延展和整体平台结构，而非单个抬升动作。"
    }
  ]
}