{
  "word": "territorial",
  "pronunciation": "tuh·rit·uh·ree·uhl",
  "concise_definition": "adj. 领土的, 领地的, 有领地意识的",
  "forms": {
    "comparative": "more territorial",
    "superlative": "most territorial"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to a territory, especially a defined area of land under the control or jurisdiction of a particular group, nation, or individual.",
      "explanation_cn": "与领土有关的，特指受某一团体、国家或个人控制或管辖的特定地域。",
      "example_en": "The treaty defined the territorial boundaries between the two countries.",
      "example_cn": "该条约界定了两国之间的领土边界。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Showing aggression or defensiveness toward others who enter one's personal space, domain, or area of control, often used to describe animal or human behavior.",
      "explanation_cn": "对进入自己个人空间、领域或控制范围的他人表现出攻击性或防御性，常用于描述动物或人类的行为。",
      "example_en": "The dog became territorial when strangers approached its yard.",
      "example_cn": "当陌生人靠近它的院子时，这只狗变得极具领地意识。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by a strong desire to protect or maintain control over one's own domain, whether physical, professional, or psychological.",
      "explanation_cn": "以强烈渴望保护或维持对自己领域（无论是物理的、职业的还是心理的）的控制为特征的。",
      "example_en": "She was territorial about her workspace and didn't allow colleagues to rearrange her desk.",
      "example_cn": "她对自己的工作空间很有领地意识，不允许同事改动她的办公桌。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "national",
      "analysis": "“National”（国家的）强调与整个国家或民族相关的属性，如国家政策、国家认同，范围更广、更宏观；而 “territorial” 更聚焦于具体的地理区域或边界，强调对特定土地的控制权，不一定涉及民族或政治认同。"
    },
    {
      "word_to_compare": "possessive",
      "analysis": "“Possessive”（占有欲强的）泛指对人或物的强烈占有欲，常用于人际关系（如伴侣、物品），带有情感色彩；而 “territorial” 更强调对空间、领域或范围的排他性控制，常用于物理或组织边界，语义更偏向行为表现而非情感依附。"
    },
    {
      "word_to_compare": "regional",
      "analysis": "“Regional”（区域的）仅指地理上某一特定区域的特征或属性，是中性描述，不隐含控制或防御意图；而 “territorial” 暗示对该区域的主权主张、排他性或防御性行为，具有强烈的行为倾向和权力意味。"
    }
  ]
}