{
  "word": "terrace",
  "pronunciation": "tehr·eys",
  "concise_definition": "n. 露台, 台地, 梯田; v. 修筑台地",
  "forms": {
    "plural": "terraces",
    "third_person_singular": "terraces",
    "past_tense": "terraced",
    "past_participle": "terraced",
    "present_participle": "terracing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A flat, open area outside a building, typically at roof level or on a slope, used for sitting, dining, or gardening, often with a railing or wall for safety.",
      "explanation_cn": "指建筑物外部的平坦开放区域，通常位于屋顶或斜坡上，用于休憩、用餐或园艺，常配有栏杆或围墙以保障安全。",
      "example_en": "We enjoyed dinner on the terrace with a view of the ocean.",
      "example_cn": "我们在露台上享用晚餐，俯瞰着大海。"
    },
    {
      "pos": "noun",
      "explanation_en": "A level area of land created by cutting into a hillside, often used for agriculture or construction to prevent erosion and manage slope stability.",
      "explanation_cn": "指在山坡上开凿出的水平平台，常用于农业耕作或建筑，以防止水土流失并稳定斜坡。",
      "example_en": "The ancient rice terraces in the Philippines are a UNESCO World Heritage Site.",
      "example_cn": "菲律宾的古代梯田是联合国教科文组织世界遗产。"
    },
    {
      "pos": "verb",
      "explanation_en": "To create or arrange land in a series of level steps or platforms, especially on a hillside.",
      "explanation_cn": "指在山坡上开凿出一系列水平台阶或平台，通常用于农业或建筑目的。",
      "example_en": "Farmers terraced the steep hills to grow crops more efficiently.",
      "example_cn": "农民在陡峭的山坡上修筑梯田，以更高效地种植作物。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "patio",
      "analysis": "“Patio”（庭院）通常指紧邻房屋、由硬质材料（如混凝土或石板）铺成的平坦户外区域，主要用于休闲，一般不位于高处或斜坡上，也不具备梯田结构。而 “terrace” 可以是建筑顶部的露台，也可以是山坡上的阶梯式平台，功能和地形更广泛。"
    },
    {
      "word_to_compare": "balcony",
      "analysis": "“Balcony”（阳台）是建筑物楼层向外延伸的狭窄平台，通常由墙体或栏杆围合，仅服务于单个房间或单元，尺寸较小。而 “terrace” 面积更大，常为公共或共享空间，可容纳多人活动，且不一定依附于单层建筑。"
    },
    {
      "word_to_compare": "platform",
      "analysis": "“Platform”（平台）泛指任何用于支撑或站立的平坦表面，可以是临时的、功能性的（如火车站台），不一定具有景观或农业用途。而 “terrace” 特指具有地形改造特征（如梯级、坡面）或建筑美学意义的平台，强调其与自然地形的融合。"
    }
  ]
}