{
  "word": "tesla",
  "pronunciation": "tɛs·lə",
  "concise_definition": "n. 特斯拉（姓氏/品牌/磁感应强度单位）",
  "forms": {
    "plural": "teslas"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A surname of Nikola Tesla (1856–1943), the Serbian-American inventor and electrical engineer renowned for his contributions to the design of the modern alternating current (AC) electricity supply system.",
      "explanation_cn": "指塞尔维亚裔美国发明家兼电气工程师尼古拉·特斯拉（1856–1943）的姓氏，他因对现代交流电电力系统的开创性贡献而闻名。",
      "example_en": "Nikola Tesla's vision of wireless energy transmission was far ahead of his time.",
      "example_cn": "尼古拉·特斯拉关于无线能量传输的构想远远超越了他所处的时代。"
    },
    {
      "pos": "noun",
      "explanation_en": "A U.S.-based electric vehicle and clean energy company founded in 2003, named in honor of Nikola Tesla, known for producing high-performance electric cars, batteries, and solar energy products.",
      "explanation_cn": "一家于2003年成立的美国电动汽车与清洁能源公司，以尼古拉·特斯拉命名，以生产高性能电动汽车、电池和太阳能产品而著称。",
      "example_en": "She just bought a new Tesla Model S and loves its autonomous driving features.",
      "example_cn": "她刚买了一辆新款特斯拉Model S，非常喜欢它的自动驾驶功能。"
    },
    {
      "pos": "noun",
      "explanation_en": "The SI unit of magnetic flux density, equal to one weber per square meter, named in honor of Nikola Tesla.",
      "explanation_cn": "磁通量密度的国际单位制单位，等于每平方米一韦伯，以尼古拉·特斯拉的名字命名。",
      "example_en": "The MRI machine generates a magnetic field of 3 teslas.",
      "example_cn": "这台核磁共振成像设备产生的磁场强度为3特斯拉。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "volta",
      "analysis": "“Volta”（伏特）是意大利物理学家亚历山德罗·伏特的姓氏，也是电压单位“伏特”（volt）的来源，用于衡量电势差。而 “Tesla” 是磁感应强度单位，两者虽同为电学领域的奠基人，但所代表的物理量不同：伏特衡量电压，特斯拉衡量磁场强度。"
    },
    {
      "word_to_compare": "edison",
      "analysis": "“Edison”（爱迪生）是美国发明家托马斯·爱迪生的姓氏，以直流电系统和实用电灯泡闻名，常与特斯拉在‘电流之战’中形成对比。爱迪生代表实用主义与直流电，特斯拉代表前瞻性与交流电。两者都是科技史上的巨人，但技术路线和历史评价截然不同。"
    },
    {
      "word_to_compare": "brand",
      "analysis": "“Brand”（品牌）是一个泛指商业标识或产品系列的通用词，而 “Tesla” 作为品牌，特指由尼古拉·特斯拉之名衍生出的现代科技企业。它不仅是一个商业名称，更承载了科学遗产与创新精神的象征意义，远超普通品牌的文化内涵。"
    }
  ]
}