{
  "word": "texture",
  "pronunciation": "tek·scher",
  "concise_definition": "n. 质地, 纹理, 结构",
  "forms": {
    "plural": "textures"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The feel, appearance, or consistency of a surface or substance, especially as perceived by touch or sight; the arrangement of elements that gives a material its distinctive surface quality.",
      "explanation_cn": "指物体表面或物质的触感、外观或质地，尤其通过触觉或视觉感知到的特征；构成材料独特表面品质的元素排列方式。",
      "example_en": "The texture of the stone was rough and uneven, making it ideal for garden pathways.",
      "example_cn": "这种石头的质地粗糙不平，非常适合用作花园小径。"
    },
    {
      "pos": "noun",
      "explanation_en": "In art or design, the visual or tactile quality that suggests the surface characteristics of an object, often used to create realism or emotional impact.",
      "explanation_cn": "在艺术或设计中，指通过视觉或触觉暗示物体表面特征的品质，常用于营造真实感或情感冲击。",
      "example_en": "The painter used thick brushstrokes to enhance the texture of the tree bark in the landscape.",
      "example_cn": "画家用厚重的笔触增强了风景画中树皮的纹理感。"
    },
    {
      "pos": "noun",
      "explanation_en": "In food, the physical properties of a substance as experienced in the mouth, such as smoothness, crunchiness, or creaminess.",
      "explanation_cn": "在食品领域，指食物在口中所感受到的物理特性，如顺滑、酥脆或奶油般绵密的口感。",
      "example_en": "The texture of the custard was perfectly creamy, with no lumps.",
      "example_cn": "这款蛋奶冻的口感极其顺滑，没有任何颗粒。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "surface",
      "analysis": "“Surface”（表面）仅指物体最外层的物理边界，是一个纯粹的几何或空间概念，不包含质感或结构信息。而 “texture” 强调的是表面的细节特征，如粗糙、光滑、颗粒感等，是关于表面如何被感知的描述。"
    },
    {
      "word_to_compare": "pattern",
      "analysis": "“Pattern”（图案）指重复出现的视觉设计或结构，如条纹、格子、波浪等，强调的是规律性和可预测性。而 “texture” 更关注材料本身的微观结构和触感，即使没有重复性，也可以有纹理，如砂纸或毛毯。"
    },
    {
      "word_to_compare": "structure",
      "analysis": "“Structure”（结构）指事物内部的组织方式或组成部分之间的关系，通常是宏观或系统性的（如建筑结构、细胞结构）。而 “texture” 通常指表面或局部的物理特性，更偏向感官体验，而非整体组织逻辑。"
    }
  ]
}