{
  "word": "textured",
  "pronunciation": "tek·stshərd",
  "concise_definition": "adj. 有纹理的, 有质感的",
  "forms": {
    "comparative": "more textured",
    "superlative": "most textured"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having a surface with a distinct tactile or visual pattern, often created by material composition, weaving, carving, or other physical processes, which adds depth and interest.",
      "explanation_cn": "指表面具有明显触觉或视觉纹理的，通常由材料构成、编织、雕刻或其他物理工艺形成，从而增加层次感和视觉趣味。",
      "example_en": "The textured wallpaper added warmth and character to the otherwise plain room.",
      "example_cn": "有纹理的墙纸为原本单调的房间增添了温暖与个性。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing food or materials that have a varied or complex surface feel, often enhancing sensory experience or mouthfeel.",
      "explanation_cn": "用于描述食物或材料具有多样或复杂的表面触感，常能增强感官体验或口感。",
      "example_en": "The textured surface of the artisanal bread provided a satisfying crunch with each bite.",
      "example_cn": "手工面包表面的质感在每一口咬下时都带来令人满足的酥脆感。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used metaphorically to describe something complex, layered, or nuanced in nature, especially in storytelling, music, or character development.",
      "explanation_cn": "隐喻性地用于描述事物在本质上的复杂性、多层次性或细腻性，尤其用于叙事、音乐或人物塑造中。",
      "example_en": "Her character arc is textured, with contradictions and growth that feel authentic.",
      "example_cn": "她的角色弧线富有层次，充满矛盾与真实可信的成长。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rough",
      "analysis": "“Rough”（粗糙的）强调表面不平滑、有颗粒感或刺手感，常带有负面或粗粝的意味。而 “textured” 更中性或积极，强调有设计感、有美感的纹理，不一定是粗糙的，可以是细腻的凹凸或图案。"
    },
    {
      "word_to_compare": "patterned",
      "analysis": "“Patterned”（有图案的）侧重于重复的视觉设计，如条纹、格子或花卉图案，通常是二维的、装饰性的。而 “textured” 更强调三维的物理表面变化，可以通过触摸感知，不一定有重复图案。"
    },
    {
      "word_to_compare": "granular",
      "analysis": "“Granular”（颗粒状的）特指由微小颗粒组成的质地，常用于科学或技术语境，如沙子或数字数据的粒度。“Textured” 范围更广，可包含颗粒、编织、刮痕、压花等多种形式，不限于微观结构。"
    }
  ]
}