{
  "word": "therapies",
  "pronunciation": "thuh·rap·uh·zeez",
  "concise_definition": "n. 治疗法, 疗法, 康复手段",
  "forms": {
    "singular": "therapy"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A systematic method or treatment designed to cure or alleviate a physical, mental, or emotional disorder, often based on medical, psychological, or holistic principles.",
      "explanation_cn": "指为治愈或缓解身体、心理或情绪障碍而设计的系统性治疗方法，通常基于医学、心理学或整体性原则。",
      "example_en": "Cognitive behavioral therapy has been proven effective in treating anxiety disorders.",
      "example_cn": "认知行为疗法已被证明对治疗焦虑症有效。"
    },
    {
      "pos": "noun",
      "explanation_en": "A range of interventions used in rehabilitation, including physical, occupational, or speech therapy, aimed at restoring function or improving quality of life.",
      "explanation_cn": "指用于康复的一系列干预手段，包括物理治疗、职业治疗或言语治疗，旨在恢复功能或提高生活质量。",
      "example_en": "After the stroke, she underwent months of physical and speech therapies to regain mobility and communication skills.",
      "example_cn": "中风后，她接受了数月的物理和言语治疗，以恢复行动能力和沟通技能。"
    },
    {
      "pos": "noun",
      "explanation_en": "Alternative or complementary treatments used alongside conventional medicine, such as acupuncture, aromatherapy, or art therapy, to support healing and well-being.",
      "explanation_cn": "指与传统医学并用的替代或补充疗法，如针灸、芳香疗法或艺术疗法，以促进康复和整体健康。",
      "example_en": "Many patients turn to yoga and meditation as complementary therapies to reduce stress and improve sleep.",
      "example_cn": "许多患者选择瑜伽和冥想作为辅助疗法，以减轻压力并改善睡眠。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "treatment",
      "analysis": "“Treatment”（治疗）是一个更广泛、更通用的术语，泛指任何用于缓解或治愈疾病的手段，包括药物、手术、饮食调整等。而 “therapies” 更强调系统性、持续性的干预方法，尤其常用于心理、康复或替代医学领域，具有更强的程序性和专业性。"
    },
    {
      "word_to_compare": "cure",
      "analysis": "“Cure”（治愈）指彻底消除疾病或症状，强调结果的完全康复。而 “therapies” 指的是实现康复的过程或手段，不一定能带来彻底治愈，有时仅用于控制症状或改善生活质量。例如，糖尿病目前尚无治愈方法，但可通过多种疗法管理。"
    },
    {
      "word_to_compare": "intervention",
      "analysis": "“Intervention”（干预）是一个更中性的术语，泛指为改变某种状况而采取的行动，可用于社会、教育、环境等多个领域，不一定具有医疗性质。而 “therapies” 专指医学或心理康复领域的专业治疗手段，具有明确的临床目标和规范流程。"
    }
  ]
}