{
  "word": "thirst",
  "pronunciation": "thurst",
  "concise_definition": "n. 渴望, 口渴; v. 渴望",
  "forms": {
    "plural": "thirsts",
    "third_person_singular": "thirsts",
    "past_tense": "thirsted",
    "past_participle": "thirsted",
    "present_participle": "thirsting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A strong physical need for water or other liquids, often accompanied by a dry sensation in the mouth and throat.",
      "explanation_cn": "对水或其他液体的强烈生理需求，常伴有口腔和喉咙的干燥感。",
      "example_en": "After hiking for hours in the desert, he collapsed from thirst.",
      "example_cn": "在沙漠中徒步数小时后，他因口渴而晕倒。"
    },
    {
      "pos": "noun",
      "explanation_en": "A strong desire or craving for something abstract, such as knowledge, success, or justice.",
      "explanation_cn": "对某种抽象事物（如知识、成功或正义）的强烈渴望或渴求。",
      "example_en": "Her thirst for knowledge led her to earn three advanced degrees.",
      "example_cn": "她对知识的渴望促使她获得了三个高级学位。"
    },
    {
      "pos": "verb",
      "explanation_en": "To have a strong physical desire for water or other liquids.",
      "explanation_cn": "感到强烈的生理需求，想要喝水或其他液体。",
      "example_en": "The travelers thirsted after crossing the endless sand dunes.",
      "example_cn": "旅行者们穿越无尽的沙丘后口渴难耐。"
    },
    {
      "pos": "verb",
      "explanation_en": "To have an intense desire or longing for something, especially something unattainable or deeply valued.",
      "explanation_cn": "对某物产生强烈的渴望或向往，尤指难以获得或极为珍视的事物。",
      "example_en": "He thirsted for recognition after years of默默努力.",
      "example_cn": "经过多年的默默努力，他渴望得到认可。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hunger",
      "analysis": "“Hunger” (饥饿) 主要指对食物的生理需求，也可引申为对抽象事物（如权力、爱）的渴望，但其语义重心更偏向于“匮乏感”和“生存需求”；而 “thirst” 更强调一种持续、焦灼的渴求，尤其适用于液体或精神层面的渴望，语义上更具紧迫性和情感张力。"
    },
    {
      "word_to_compare": "desire",
      "analysis": "“Desire” (欲望) 是一个更广泛、更中性的词，泛指任何类型的愿望，可以是温和的或强烈的，不带有生理基础；而 “thirst” 通常暗示一种更强烈、更本能、甚至近乎痛苦的渴望，常带有生理或情感上的迫切性，语义色彩更浓烈。"
    },
    {
      "word_to_compare": "craving",
      "analysis": "“Craving” (强烈渴望) 与 “thirst” 在抽象用法上高度相似，都表示一种难以抑制的欲望，但 “craving” 更常用于成瘾性或感官性需求（如对甜食、烟酒的渴望），而 “thirst” 更常用于精神、智力或道德层面的追求，如对真理、正义的渴求，语义范围更广且更具文学性。"
    }
  ]
}