{
  "word": "thriller",
  "pronunciation": "thril·er",
  "concise_definition": "n. 惊悚片, 惊险小说, 令人激动的事物",
  "forms": {
    "plural": "thrillers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A genre of fiction, film, or drama characterized by suspense, tension, and excitement, often involving crime, mystery, or danger, designed to keep the audience on edge.",
      "explanation_cn": "一种小说、电影或戏剧体裁，以悬念、紧张和刺激为特征，常涉及犯罪、谜团或危险，旨在让观众始终保持紧张和关注。",
      "example_en": "The new Netflix series is a psychological thriller that keeps viewers guessing until the final episode.",
      "example_cn": "这部新Netflix剧集是一部心理惊悚片，让观众直到最后一集都猜不到结局。"
    },
    {
      "pos": "noun",
      "explanation_en": "A book or story that creates a strong sense of suspense and excitement, typically involving a race against time or a hidden threat.",
      "explanation_cn": "一种能营造强烈悬念与刺激感的书籍或故事，通常涉及与时间赛跑或隐藏的威胁。",
      "example_en": "She devoured every thriller by Agatha Christie during her vacation.",
      "example_cn": "她在度假期间一口气读完了阿加莎·克里斯蒂的所有惊悚小说。"
    },
    {
      "pos": "noun",
      "explanation_en": "An event or experience that is intensely exciting or emotionally stirring, often due to unpredictability or risk.",
      "explanation_cn": "一种因不可预测性或风险而带来强烈兴奋感或情感冲击的事件或体验。",
      "example_en": "The final minutes of the match were a real thriller as the underdog scored in stoppage time.",
      "example_cn": "比赛最后几分钟堪称一场惊心动魄的较量，弱队在伤停补时阶段进球。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "horror",
      "analysis": "“Horror”（恐怖片/恐怖小说）旨在引发恐惧、厌恶或惊骇，常涉及超自然元素、血腥暴力或心理扭曲；而 “thriller” 更侧重于制造紧张感和悬念，不一定包含恐怖元素，其核心是‘未知’与‘期待’，而非纯粹的恐惧。"
    },
    {
      "word_to_compare": "mystery",
      "analysis": "“Mystery”（推理/悬疑）的核心是解开一个谜题，如谁是凶手，过程强调逻辑与线索；而 “thriller” 更注重情绪张力和节奏推进，即使谜题未完全解开，也能通过紧张情节让观众保持兴奋。两者常重叠，但 thriller 的情感冲击更强。"
    },
    {
      "word_to_compare": "adventure",
      "analysis": "“Adventure”（冒险）强调探索、行动与英雄主义，通常有明确的目标和正面主角的胜利结局；而 “thriller” 更关注危险、压迫感和主角的生存挣扎，结局往往不确定，氛围更阴暗、心理更复杂。"
    }
  ]
}