{
  "word": "thriving",
  "pronunciation": "thrī·vɪŋ",
  "concise_definition": "adj. 繁荣的, 兴旺的, 茁壮成长的",
  "forms": {
    "base_form": "thrive",
    "third_person_singular": "thrives",
    "past_tense": "thrived",
    "past_participle": "thrived",
    "present_participle": "thriving"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "In a state of vigorous growth, success, or prosperity, often despite challenges; characterized by health, activity, and continued progress.",
      "explanation_cn": "处于旺盛生长、成功或繁荣的状态，即使面临挑战也持续活跃与进步；体现健康、活力和持续发展。",
      "example_en": "The city has a thriving arts scene with galleries, theaters, and street performances.",
      "example_cn": "这座城市拥有蓬勃发展的艺术场景，遍布画廊、剧院和街头表演。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing a business, economy, or system that is financially successful and expanding rapidly, often outperforming competitors or industry standards.",
      "explanation_cn": "形容企业、经济或系统财务上取得成功并迅速扩张，通常优于竞争对手或行业标准。",
      "example_en": "Her small bakery is thriving, with customers lining up every morning.",
      "example_cn": "她的小型面包店生意兴隆，每天早晨都有顾客排队。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used to describe living organisms (plants, animals, people) that are healthy, active, and growing well in their environment.",
      "explanation_cn": "用于描述在环境中健康、活跃且生长良好的生物（植物、动物、人）。",
      "example_en": "The children are thriving in their new school, showing improved confidence and grades.",
      "example_cn": "孩子们在新学校里茁壮成长，自信心和成绩都有显著提升。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "prosperous",
      "analysis": "“Prosperous”（富裕的、富足的）更侧重于经济或物质上的成功与富足，常用于描述财富积累或生活水平高，如国家、家庭或个人。而 “thriving” 不仅包含经济成功，还强调动态的活力、成长和生命力，适用范围更广，可用于生态系统、文化、教育等非经济领域。"
    },
    {
      "word_to_compare": "flourishing",
      "analysis": "“Flourishing”（繁荣的、欣欣向荣的）与 “thriving” 极为接近，常可互换，但 “flourishing” 更具文学性和诗意色彩，常用于描述自然、艺术或精神层面的蓬勃发展，如花朵绽放、思想活跃；而 “thriving” 更口语化、实用，常用于商业、健康或社会情境，强调实际成果和持续性。"
    },
    {
      "word_to_compare": "successful",
      "analysis": "“Successful”（成功的）是一个更宽泛的词，泛指达成目标或获得预期结果，不必然包含成长或活力的含义。例如，一个项目可能成功完成但不再发展。而 “thriving” 暗示持续的、积极的、动态的成长过程，强调的不仅是结果，更是过程中的生命力和扩张趋势。"
    }
  ]
}