{
  "word": "throttle",
  "pronunciation": "throt·l",
  "concise_definition": "n. 油门, 节流阀; v. 控制, 限制, 勒住",
  "forms": {
    "third_person_singular": "throttles",
    "past_tense": "throttled",
    "past_participle": "throttled",
    "present_participle": "throttling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A valve or device that regulates the flow of fuel or air into an engine, thereby controlling its power output.",
      "explanation_cn": "一种调节进入发动机的燃料或空气流量的阀门或装置，从而控制其动力输出。",
      "example_en": "He pushed the throttle forward to increase the speed of the boat.",
      "example_cn": "他向前推动油门以提高船速。"
    },
    {
      "pos": "noun",
      "explanation_en": "A metaphorical or figurative control mechanism that restricts or limits the intensity, growth, or activity of something.",
      "explanation_cn": "比喻性地指限制某事物强度、增长或活动的机制。",
      "example_en": "The government imposed a throttle on public spending to reduce the deficit.",
      "example_cn": "政府对公共支出实施了限制，以减少财政赤字。"
    },
    {
      "pos": "verb",
      "explanation_en": "To control or reduce the power, speed, or intensity of something, especially an engine or system.",
      "explanation_cn": "控制或降低某物（尤其是发动机或系统）的功率、速度或强度。",
      "example_en": "The pilot throttled back the engines to slow down during landing.",
      "example_cn": "飞行员在着陆时减小了发动机推力以减速。"
    },
    {
      "pos": "verb",
      "explanation_en": "To restrict or suppress something forcefully, often to the point of stifling or choking.",
      "explanation_cn": "强行限制或压制某事物，常达到窒息或扼杀的程度。",
      "example_en": "The new regulations are throttling innovation in the tech sector.",
      "example_cn": "新法规正在扼杀科技领域的创新。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "restrict",
      "analysis": "“Restrict” (限制) 是一个更通用的词，泛指对范围、数量或行为施加限制，不特指动力或流量控制。而 “throttle” 更强调通过物理或机制性手段主动降低强度，常带有突然或剧烈的控制意味，尤其在工程或经济语境中更具形象性。"
    },
    {
      "word_to_compare": "constrain",
      "analysis": "“Constrain” (约束) 侧重于外部条件或规则对自由或行动的限制，常含被动或被迫的意味。而 “throttle” 更强调主动施加压力以压制或减速，常用于描述对能量、增长或进程的直接干预，语气更强烈。"
    },
    {
      "word_to_compare": "regulate",
      "analysis": "“Regulate” (调节) 指使某事物保持在稳定或期望的范围内，通常是持续、精细的调整。而 “throttle” 更倾向于大幅降低或突然限制，常用于紧急或过度状态下的干预，调节的精度较低但力度更大。"
    }
  ]
}