{
  "word": "throws",
  "pronunciation": "thrawz",
  "concise_definition": "v. 投掷, 抛, 丢; n. 投掷动作, 一次投掷",
  "forms": {
    "base_form": "throw",
    "third_person_singular": "throws",
    "past_tense": "threw",
    "past_participle": "thrown",
    "present_participle": "throwing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To propel something through the air with a quick movement of the arm or hand, often with force or intention.",
      "explanation_cn": "指用手臂或手迅速用力地将某物向空中抛出，通常带有目的性或力量。",
      "example_en": "He throws the ball to his teammate with perfect accuracy.",
      "example_cn": "他以极高的精准度把球扔给队友。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to be in a particular state or position suddenly or carelessly, often implying disorder or abandonment.",
      "explanation_cn": "指突然或随意地使某物处于某种状态或位置，常暗示混乱或随意丢弃。",
      "example_en": "She throws her coat on the chair and rushes out the door.",
      "example_cn": "她把外套随手扔在椅子上，冲出了门。"
    },
    {
      "pos": "verb",
      "explanation_en": "To host or organize a social event, especially one that is formal or celebratory (often used in passive voice: 'a party is thrown').",
      "explanation_cn": "指举办或组织一场社交活动，尤其是正式或庆祝性质的聚会（常用于被动语态：'a party is thrown'）。",
      "example_en": "They threw a surprise birthday party for their daughter.",
      "example_cn": "他们为女儿举办了一场惊喜生日派对。"
    },
    {
      "pos": "noun",
      "explanation_en": "A single act of throwing something, especially in sports or physical activities.",
      "explanation_cn": "指一次投掷动作，尤其在体育或体力活动中。",
      "example_en": "His final throw in the javelin event broke the record.",
      "example_cn": "他在标枪比赛中的最后一次投掷打破了纪录。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of blanket or covering, typically lightweight and used for warmth, especially on a sofa or bed (British English usage).",
      "explanation_cn": "指一种轻便的毯子或覆盖物，常用于沙发或床上保暖（英式英语用法）。",
      "example_en": "She wrapped herself in a cozy wool throw while reading by the fireplace.",
      "example_cn": "她坐在壁炉旁读书时，用一条舒适的羊毛毯裹住自己。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "toss",
      "analysis": "“Toss” (轻抛) 指轻柔、随意或短暂的投掷动作，通常力量较小，常用于抛掷小物件（如硬币、纸团），语气较随意。而 “throws” 更强调力量、意图或正式性，适用范围更广，包括体育、情感表达和事件组织。"
    },
    {
      "word_to_compare": "fling",
      "analysis": "“Fling” (猛掷) 比 “throws” 更具情绪色彩，常暗示愤怒、厌烦或冲动，动作更猛烈、不加控制。例如：'She flung the book across the room.' 而 “throws” 可以是中性或有技巧性的动作，如投篮或投掷标枪。"
    },
    {
      "word_to_compare": "cast",
      "analysis": "“Cast” (投掷/抛出) 常用于更优雅、精准或技术性的语境，如钓鱼时的抛线（cast a line）、戏剧中的选角（cast actors），或象征性地表达“投射”（cast a shadow）。它比 “throws” 更具文学性或专业性，而 “throws” 更口语化、日常化。"
    }
  ]
}