{
  "word": "through",
  "pronunciation": "throo",
  "concise_definition": "prep. 穿过, 通过; adv. 完全地, 从头到尾, 结束",
  "forms": {
    "comparative": "",
    "superlative": ""
  },
  "definitions": [
    {
      "pos": "preposition",
      "explanation_en": "Moving from one side or end of something to the other, indicating physical passage or traversal.",
      "explanation_cn": "表示从某物的一侧或一端移动到另一侧或另一端，强调物理上的穿越或通过。",
      "example_en": "She walked through the forest to reach the lake.",
      "example_cn": "她穿过森林到达了湖边。"
    },
    {
      "pos": "preposition",
      "explanation_en": "By means of; using a process, medium, or system to achieve an outcome.",
      "explanation_cn": "表示通过某种方式、媒介或系统来实现结果，强调手段或途径。",
      "example_en": "We communicated through email because the phone line was down.",
      "example_cn": "由于电话线路中断，我们通过电子邮件进行沟通。"
    },
    {
      "pos": "preposition",
      "explanation_en": "During the entire duration of an activity or period of time; indicating completion or continuation until the end.",
      "explanation_cn": "指在整个活动或时间段内持续进行，强调从开始到结束的全过程。",
      "example_en": "He worked through the night to finish the report.",
      "example_cn": "他通宵工作以完成报告。"
    },
    {
      "pos": "adverb",
      "explanation_en": "From beginning to end; completely or thoroughly, often implying finality or exhaustion.",
      "explanation_cn": "表示从头到尾、完全彻底地，常暗示某种行为或状态的终结或耗尽。",
      "example_en": "I read the book through in one sitting.",
      "example_cn": "我一口气把这本书读完了。"
    },
    {
      "pos": "adverb",
      "explanation_en": "To or toward the other side; indicating movement to completion or arrival on the opposite side.",
      "explanation_cn": "表示移动到另一侧，强调到达对面或完成穿越的动作。",
      "example_en": "The train went through the tunnel and emerged on the other side.",
      "example_cn": "火车穿过隧道，在另一侧驶出。"
    },
    {
      "pos": "adverb",
      "explanation_en": "In a state of completion or finality; used to describe something that has been fully experienced or resolved.",
      "explanation_cn": "表示处于完成或终结的状态，用于描述某事已被充分经历或解决。",
      "example_en": "Are you through with your homework?",
      "example_cn": "你的作业做完了吗？"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "across",
      "analysis": "“Across”（横过）强调从一边到另一边的横向移动，通常用于平面或表面，如过马路、跨河。它不强调穿透或贯穿内部，而 “through” 强调从内部穿过，如穿过隧道、森林或人群。"
    },
    {
      "word_to_compare": "via",
      "analysis": "“Via”（经由）专指通过某种路径、方式或中转点，常用于交通或通信路线，如“travel via Paris”。它更正式，且不包含时间或完成的含义，而 “through” 可以涵盖方式、过程和时间的延续。"
    },
    {
      "word_to_compare": "until",
      "analysis": "“Until”（直到）表示时间的终点，强调动作在某个时间点停止，如“I waited until 5 p.m.”。而 “through” 表示动作持续到并包括那个时间点，如“I worked through 5 p.m.” 意为工作到5点并可能在5点结束，强调包含性而非截止性。"
    }
  ]
}