{
  "word": "thrust",
  "pronunciation": "thrust",
  "concise_definition": "n. 推力, 核心, 突击; v. 推, 用力插入, 突然提出",
  "forms": {
    "third_person_singular": "thrusts",
    "past_tense": "thrust",
    "past_participle": "thrust",
    "present_participle": "thrusting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A strong force that pushes or drives something forward, especially in physics or engineering contexts.",
      "explanation_cn": "指一种强烈的推动力，尤其在物理或工程语境中，用于推动某物向前运动。",
      "example_en": "The rocket's thrust overcame Earth's gravity and launched it into space.",
      "example_cn": "火箭的推力克服了地球引力，将其送入太空。"
    },
    {
      "pos": "noun",
      "explanation_en": "The central or most important point of an argument, idea, or situation; the essence or main point.",
      "explanation_cn": "指论点、想法或情境中的核心或最重要部分；本质或主旨。",
      "example_en": "The thrust of her speech was that education must be accessible to everyone.",
      "example_cn": "她演讲的核心观点是教育必须对所有人开放。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden, forceful forward movement, especially in military or competitive contexts.",
      "explanation_cn": "指突然而有力的向前推进，尤其用于军事或竞争性情境中。",
      "example_en": "The army launched a thrust toward the enemy's headquarters.",
      "example_cn": "军队向敌方指挥部发起了突击。"
    },
    {
      "pos": "verb",
      "explanation_en": "To push something forcefully forward or into something else, often with a sharp or sudden motion.",
      "explanation_cn": "指用力将某物向前或插入另一物中，通常带有突然或尖锐的动作。",
      "example_en": "He thrust the letter into her hands and walked away.",
      "example_cn": "他把信塞进她手里，然后走开了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To present or put forward an idea, argument, or accusation suddenly and forcefully.",
      "explanation_cn": "指突然而有力地提出某个观点、论点或指控。",
      "example_en": "The lawyer thrust the evidence into the courtroom, demanding immediate attention.",
      "example_cn": "律师突然将证据呈上法庭，要求立即关注。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "push",
      "analysis": "“Push” (推) 是一个更通用、更中性的词，指施加力量使物体远离施力者，动作通常较温和或持续。而 “thrust” 强调突然、猛烈、有方向性的强力推动，常带有攻击性或紧迫感。"
    },
    {
      "word_to_compare": "probe",
      "analysis": "“Probe” (探查/刺探) 指以试探性或探索性的方式深入某物，常用于调查或研究语境，强调谨慎和好奇心。而 “thrust” 是直接、有力的进攻性动作，不带试探性，更强调冲击力和目的性。"
    },
    {
      "word_to_compare": "core",
      "analysis": "“Core” (核心) 是一个名词，指事物的中心或本质部分，是静态的。而 “thrust” 作为名词时虽也可指“主旨”，但更强调动态的、驱动性的中心意图，常用于分析论点或运动的方向性，比 “core” 更具行动导向。"
    }
  ]
}