{
  "word": "thumb",
  "pronunciation": "thuhm",
  "concise_definition": "n. 拇指, v. 拇指弹动, 搭便车, 翻阅",
  "forms": {
    "plural": "thumbs"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The short, thick, opposable digit on the human hand, used for grasping and manipulating objects; it is the shortest and strongest of the five fingers.",
      "explanation_cn": "人类手上短而粗的可对生手指，用于抓握和操作物体；它是五指中最短但最强壮的一根。",
      "example_en": "She hurt her thumb while opening a jar.",
      "example_cn": "她开罐子时伤到了拇指。"
    },
    {
      "pos": "verb",
      "explanation_en": "To flick or tap something with the thumb, especially to signal or express impatience or dismissal.",
      "explanation_cn": "用拇指轻弹或轻拍某物，尤指用来示意、表达不耐烦或轻蔑。",
      "example_en": "He thumbed through the magazine without really reading it.",
      "example_cn": "他翻了翻杂志，但并没有认真阅读。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hitchhike, especially by standing by the roadside and extending the thumb to signal a passing vehicle for a ride.",
      "explanation_cn": "搭便车，尤指站在路边伸出拇指示意过往车辆搭载自己。",
      "example_en": "They thumbed a ride to the next town after their car broke down.",
      "example_cn": "他们的车抛锚后，便在路边搭便车去了下一个城镇。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, thumb-sized piece of something, especially food or paper, often used in phrases like 'a thumb of whiskey' or 'a thumb of paper'.",
      "explanation_cn": "指一小块类似拇指大小的东西，尤指食物或纸张，常用于短语如 'a thumb of whiskey'（一小杯威士忌）或 'a thumb of paper'（一小片纸）。",
      "example_en": "He poured himself a thumb of bourbon and sat by the fire.",
      "example_cn": "他给自己倒了一小杯波本威士忌，坐在火炉旁。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "finger",
      "analysis": "“Finger”（手指）泛指手上的任何一根手指，包括食指、中指等，而 “thumb” 是特指最粗短、可对生的那根手指，具有独特的功能（如抓握和捏取），在解剖学和语言使用中都与其他手指区分开来。"
    },
    {
      "word_to_compare": "index",
      "analysis": "“Index”（食指）是手的第二根手指，常用于指向或指示，而 “thumb” 则用于施力和抓握。在手势中，伸出食指表示指示，而伸出拇指则常表示赞同（如 'thumbs up'），两者在语义和文化象征上截然不同。"
    },
    {
      "word_to_compare": "hitchhike",
      "analysis": "“Hitchhike”（搭便车）是动词，泛指通过各种方式请求他人搭载，而 “thumb” 作为动词时特指通过伸出拇指这一经典动作来搭便车，是 “hitchhike” 的一种具体表现形式，更具画面感和文化代表性。"
    }
  ]
}