{
  "word": "thunder",
  "pronunciation": "thun·duhr",
  "concise_definition": "n. 雷, 雷声; v. 打雷, 隆隆作响",
  "forms": {
    "third_person_singular": "thunders",
    "past_tense": "thundered",
    "past_participle": "thundered",
    "present_participle": "thundering"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The loud, rumbling sound produced by the rapid expansion of air along the path of a lightning bolt during a storm.",
      "explanation_cn": "指雷暴中闪电通道周围空气迅速膨胀所产生的巨大轰鸣声。",
      "example_en": "We heard thunder rolling across the sky just before the rain started.",
      "example_cn": "雨开始下之前，我们听到天空中雷声滚滚。"
    },
    {
      "pos": "noun",
      "explanation_en": "A loud, powerful sound resembling the noise of thunder, often used metaphorically to describe a forceful or impressive utterance or action.",
      "explanation_cn": "指类似雷声的响亮、有力的声音，常用于比喻某人有力的发言或震撼性的行动。",
      "example_en": "The crowd erupted in thunder as the champion stepped onto the stage.",
      "example_cn": "当冠军走上舞台时，观众爆发出雷鸣般的欢呼。"
    },
    {
      "pos": "verb",
      "explanation_en": "To produce a loud, deep, rumbling sound, especially as a result of a storm or a powerful voice.",
      "explanation_cn": "指发出低沉、轰隆的响声，尤指雷暴时的自然现象或人发出的洪亮声音。",
      "example_en": "Dark clouds gathered and thundered in the distance.",
      "example_cn": "乌云聚集，远处雷声隆隆。"
    },
    {
      "pos": "verb",
      "explanation_en": "To speak or say something in a loud, forceful, and often angry or authoritative manner.",
      "explanation_cn": "指以响亮、有力、常带愤怒或权威的语气说话。",
      "example_en": "The judge thundered that the courtroom would be cleared if there was any more disruption.",
      "example_cn": "法官厉声宣布，如果再有干扰，法庭将清场。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "lightning",
      "analysis": "“Lightning” (闪电) 指的是雷暴中出现的强烈电光放电现象，是视觉上的瞬间闪光；而 “thunder” 是闪电引发的听觉效果——空气剧烈膨胀产生的声音。两者常同时发生，但本质不同：一个是光，一个是声。"
    },
    {
      "word_to_compare": "roar",
      "analysis": "“Roar” (咆哮) 通常用于描述动物（如狮子）或大型机械（如引擎）发出的低沉而持续的吼声，强调力量和压迫感；“thunder” 则特指自然雷声或比喻性的权威怒吼，更具突发性和震撼性，常与天气或权威语境相关。"
    },
    {
      "word_to_compare": "boom",
      "analysis": "“Boom” (轰鸣) 指一种突然、短促而响亮的爆炸声或低频震动声，如炮声或气球爆裂；而 “thunder” 是持续、滚动、回荡的低沉轰鸣，具有自然规律性和延展性，常用于形容连续的雷声或群体性的热烈反应。"
    }
  ]
}