{
  "word": "tibetan",
  "pronunciation": "tib·uh·tin",
  "concise_definition": "adj. 西藏的, 藏族的; n. 藏语, 藏族人",
  "forms": {
    "plural": "tibetans"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to Tibet, its people, culture, language, or geography; describing anything originating from or characteristic of the Tibetan Plateau and its indigenous population.",
      "explanation_cn": "与西藏、其人民、文化、语言或地理相关的；描述源自西藏高原或其原住民群体的任何事物。",
      "example_en": "Tibetan Buddhism has influenced art and meditation practices across Asia.",
      "example_cn": "藏传佛教对亚洲各地的艺术和冥想实践产生了深远影响。"
    },
    {
      "pos": "noun",
      "explanation_en": "A member of the ethnic group native to Tibet, known for their distinct language, religious traditions, and high-altitude adaptation.",
      "explanation_cn": "指原住于西藏的民族成员，以其独特的语言、宗教传统和对高海拔环境的适应能力而闻名。",
      "example_en": "Many Tibetans live in exile, preserving their cultural identity abroad.",
      "example_cn": "许多藏族人生活在流亡中，努力在海外保存他们的文化认同。"
    },
    {
      "pos": "noun",
      "explanation_en": "The Sino-Tibetan language spoken by the Tibetan people, written in a unique script derived from ancient Indian Brahmi characters.",
      "explanation_cn": "藏族人所使用的汉藏语系语言，使用一种源自古印度婆罗米文字的独特文字系统书写。",
      "example_en": "She studied Tibetan for five years to read ancient religious texts in their original form.",
      "example_cn": "她学习藏语五年，以便阅读原始形式的古代宗教典籍。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tibetan",
      "analysis": "“Tibetan” 是一个专指西藏地区及其民族、语言的术语，具有明确的地理和文化边界。它不同于泛指中国少数民族的词汇如 ‘minority’（少数民族），后者是法律或行政分类，不特指某一族群。与 ‘mongolian’（蒙古的/蒙古人）或 ‘uyghur’（维吾尔的/维吾尔人）类似，都是特定民族的专称。"
    },
    {
      "word_to_compare": "himalayan",
      "analysis": "“Himalayan”（喜马拉雅的）是一个地理术语，指喜马拉雅山脉区域，涵盖多个国家和民族，如尼泊尔人、不丹人、部分印度族群等。它不等同于 ‘Tibetan’，因为西藏只是喜马拉雅地区的一部分，且 ‘Himalayan’ 不特指藏族文化或语言。"
    },
    {
      "word_to_compare": "chinese",
      "analysis": "“Chinese”（中国的/中国人）是国家层面的统称，涵盖56个官方认定的民族，包括汉族和少数民族。而 ‘Tibetan’ 是其中的一个具体民族身份，具有独立的语言、宗教和文化传统。使用 ‘Chinese’ 来指代 ‘Tibetan’ 会抹杀其民族独特性，因此在文化语境中二者不可互换。"
    }
  ]
}