{
  "word": "tick",
  "pronunciation": "tik",
  "concise_definition": "n. 虱子, 啪嗒声, 勾选标记; v. 发出啪嗒声, 勾选, 计时",
  "forms": {
    "plural": "ticks",
    "third_person_singular": "ticks",
    "past_tense": "ticked",
    "past_participle": "ticked",
    "present_participle": "ticking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small parasitic arthropod that feeds on the blood of mammals, birds, and sometimes reptiles and amphibians, often transmitting diseases.",
      "explanation_cn": "一种以哺乳动物、鸟类，有时也以爬行动物和两栖动物的血液为食的小型寄生节肢动物，常传播疾病。",
      "example_en": "After hiking in the woods, she found a tick attached to her leg.",
      "example_cn": "在森林里徒步后，她发现腿上附着了一只蜱虫。"
    },
    {
      "pos": "noun",
      "explanation_en": "A short, sharp sound, such as that made by a clock or a mechanical device.",
      "explanation_cn": "一种短促而清脆的声音，如钟表或机械装置发出的声音。",
      "example_en": "The only sound in the room was the steady tick of the old grandfather clock.",
      "example_cn": "房间里唯一的声响是老式落地钟规律的滴答声。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small mark (✓) used to indicate that something is correct, selected, or completed.",
      "explanation_cn": "用于表示某事正确、已选择或已完成的小标记（✓）。",
      "example_en": "Please tick the box if you agree to the terms and conditions.",
      "example_cn": "如您同意条款和条件，请在方框内打勾。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a short, sharp, repetitive sound, especially like a clock.",
      "explanation_cn": "发出短促、清脆、重复的声音，尤指钟表的声音。",
      "example_en": "The clock ticked loudly in the silent hallway.",
      "example_cn": "时钟在寂静的走廊里发出响亮的滴答声。"
    },
    {
      "pos": "verb",
      "explanation_en": "To mark something with a checkmark to indicate selection, completion, or approval.",
      "explanation_cn": "用勾选标记（✓）来表示选择、完成或批准。",
      "example_en": "She ticked off all the items on her to-do list before leaving work.",
      "example_cn": "她下班前把待办事项清单上的所有项目都打上了勾。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bite",
      "analysis": "“Bite”（叮咬）指动物用牙齿或口器刺入皮肤并可能造成伤害或吸血的行为，强调动作本身和生理影响；而 “tick” 是指造成叮咬的生物（蜱虫）本身，或其叮咬后留下的持续附着状态，更侧重于寄生虫的身份和长期存在。"
    },
    {
      "word_to_compare": "beep",
      "analysis": "“Beep”（哔哔声）是一种高音调、电子化的声音，常用于警报或设备提示；而 “tick” 是低沉、机械、规律的滴答声，多与机械钟表或自然节奏相关，语义上更偏向传统、缓慢、稳定的计时感。"
    },
    {
      "word_to_compare": "check",
      "analysis": "“Check”（检查/核对）是一个更广泛的动词，指审查或确认某事；而 “tick” 作为动词时特指在列表或表格中打勾的动作，是 “check” 的一种具体执行方式。在英式英语中，“tick” 常替代 “check” 表示打勾，但语义范围更窄。"
    }
  ]
}