{
  "word": "ticket",
  "pronunciation": "tik·it",
  "concise_definition": "n. 票, 传票, 罚单; v. 开罚单",
  "forms": {
    "plural": "tickets"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A piece of paper or electronic document that serves as proof of payment or entitlement to enter a place, attend an event, or use a service.",
      "explanation_cn": "一张纸质或电子文件，用作支付凭证或进入场所、参加活动或使用服务的权利证明。",
      "example_en": "She bought a ticket to the concert and was excited to see her favorite band live.",
      "example_cn": "她买了一张音乐会的票，非常兴奋能亲眼看到她最喜欢的乐队演出。"
    },
    {
      "pos": "noun",
      "explanation_en": "An official notice issued by authorities, typically for a traffic violation or other minor offense, requiring payment of a fine.",
      "explanation_cn": "由当局签发的正式通知，通常针对交通违规或其他轻微违法行为，要求缴纳罚款。",
      "example_en": "He got a ticket for parking in a no-parking zone near the school.",
      "example_cn": "他在学校附近的禁停区停车，收到了一张罚单。"
    },
    {
      "pos": "noun",
      "explanation_en": "A chance or opportunity, especially in a competition or election, often used in phrases like 'a ticket to success' or 'a winning ticket'.",
      "explanation_cn": "一种机会或可能性，尤其在竞赛或选举中，常用于短语如 '通往成功的门票' 或 '中奖的票'。",
      "example_en": "Winning the scholarship was her ticket to a better future.",
      "example_cn": "赢得奖学金是她通往更好未来的机会。"
    },
    {
      "pos": "verb",
      "explanation_en": "To issue a ticket, especially a fine or citation, to someone for breaking a rule or law.",
      "explanation_cn": "签发一张罚单或传票，通常针对某人违反规则或法律的行为。",
      "example_en": "The officer ticketed him for speeding on the highway.",
      "example_cn": "警察因他在高速公路上超速而开出了罚单。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pass",
      "analysis": "“Pass”（通行证）通常指允许进入某地或使用某服务的许可，常为重复使用或长期有效（如地铁月票、员工通行证），而 “ticket” 通常是单次使用、有明确时间或事件限制的凭证。此外，'pass' 更强调权限，'ticket' 更强调交易或收费凭证。"
    },
    {
      "word_to_compare": "voucher",
      "analysis": "“Voucher”（代金券）是一种可兑换商品或服务的优惠凭证，常用于折扣、赠品或报销场景，其核心是价值兑换而非准入权。而 “ticket” 主要用于获取进入权或作为违规处罚依据，不强调折扣或财务补偿。"
    },
    {
      "word_to_compare": "citation",
      "analysis": "“Citation”（传票/书面通知）是法律或行政术语，泛指官方发出的违规通知，包括交通罚单、法庭传票等。在交通语境中，它与 “ticket” 几乎可互换，但 “citation” 更正式、更广泛，可涵盖非交通类违规；而 “ticket” 更口语化，常特指交通罚单。"
    }
  ]
}