{
  "word": "ties",
  "pronunciation": "tīz",
  "concise_definition": "n. 领带, 关系, 平局, 连接; v. 系, 连接, 使结成关系",
  "forms": {
    "singular": "tie",
    "third_person_singular": "ties",
    "past_tense": "tied",
    "past_participle": "tied",
    "present_participle": "tying"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long, narrow piece of fabric worn around the neck, typically with a suit or formal shirt, often as a fashion accessory or symbol of professionalism.",
      "explanation_cn": "一条长而窄的布料，通常与西装或正装衬衫搭配佩戴于颈部，常作为时尚配饰或专业身份的象征。",
      "example_en": "He wore a silk tie with his navy blue suit to the interview.",
      "example_cn": "他面试时穿了一套深蓝色西装，搭配一条丝绸领带。"
    },
    {
      "pos": "noun",
      "explanation_en": "A connection or bond between people, groups, or things, often emotional, social, or organizational in nature.",
      "explanation_cn": "人与人、群体或事物之间的联系或纽带，通常具有情感、社会或组织性质。",
      "example_en": "The two countries have strong economic ties.",
      "example_cn": "这两个国家有着紧密的经济联系。"
    },
    {
      "pos": "noun",
      "explanation_en": "A situation in which two or more competitors have the same score or result, especially in a game or contest.",
      "explanation_cn": "指两个或多个竞争者得分或结果相同的情况，尤指在比赛或竞赛中。",
      "example_en": "The match ended in a 2-2 tie, so both teams advanced to the next round.",
      "example_cn": "比赛以2比2平局结束，因此两队都晋级下一轮。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fasten or secure something with a cord, string, or ribbon; to bind or link physically.",
      "explanation_cn": "用绳子、带子或丝带将某物系紧或固定；物理上连接或捆绑。",
      "example_en": "She tied her shoelaces before running.",
      "example_cn": "她跑步前系好了鞋带。"
    },
    {
      "pos": "verb",
      "explanation_en": "To connect or link two or more things conceptually, emotionally, or institutionally.",
      "explanation_cn": "在概念上、情感上或制度上将两个或多个事物联系起来。",
      "example_en": "The novel ties together themes of loss, identity, and redemption.",
      "example_cn": "这部小说将失落、身份与救赎的主题联系在一起。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "neckwear",
      "analysis": "“Neckwear”（领饰）是一个更广泛的类别术语，包括领带、领结、围巾等所有颈部佩戴物。而 “tie” 特指那种长条形、通常打结于领口的正式领带，属于 “neckwear” 的子集。"
    },
    {
      "word_to_compare": "bond",
      "analysis": "“Bond”（纽带）强调更深层、更持久的情感或道德联系，如亲情、忠诚或信任，常用于抽象语境。而 “tie” 更中性，可指任何类型的连接，包括社会、组织或象征性联系，有时甚至较表面或功能性。"
    },
    {
      "word_to_compare": "draw",
      "analysis": "在体育语境中，”draw“（平局）与 ”tie“ 可互换，但 ”draw“ 更常用于英式英语，而 ”tie“ 在美式英语中更普遍。此外，”draw“ 也可指‘抽签’或‘绘画’，语义范围更广，而 ”tie“ 在此语境中专指结果相同。"
    }
  ]
}