{
  "word": "tight",
  "pronunciation": "tahyt",
  "concise_definition": "adj. 紧的, 严密的, 紧张的, 紧张的; adv. 紧紧地",
  "forms": {
    "comparative": "tighter",
    "superlative": "tightest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Firmly fixed or drawn together; not loose or slack, often referring to physical objects like clothing, containers, or connections.",
      "explanation_cn": "指物体被牢固地固定或拉紧，不松散或松弛，常用于描述衣物、容器或连接部位。",
      "example_en": "The lid on the jar is too tight to open by hand.",
      "example_cn": "这个罐子的盖子太紧了，用手打不开。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Closely packed or crowded; lacking space or freedom, often describing a situation or arrangement.",
      "explanation_cn": "指紧密排列或拥挤的，缺乏空间或自由，常用于描述情境或安排。",
      "example_en": "The concert venue was tight with fans waiting for tickets.",
      "example_cn": "演唱会场地挤满了等待购票的粉丝。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Strict or rigorous in control, rules, or standards; not lenient or flexible.",
      "explanation_cn": "指在控制、规则或标准上严格、严谨，不宽松或不灵活。",
      "example_en": "The school has tight discipline policies to ensure student safety.",
      "example_cn": "学校有严格的纪律政策以确保学生安全。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Financially strained or short on money; having limited resources or cash flow.",
      "explanation_cn": "指经济拮据、资金短缺，资源或现金流有限。",
      "example_en": "After paying rent, we're tight on cash until next payday.",
      "example_cn": "付完房租后，我们直到下个月发薪日都手头紧。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Closely connected or in a strong relationship, often used informally to describe friendships or family bonds.",
      "explanation_cn": "指关系密切或有牢固联系，常用于非正式语境中描述友谊或家庭纽带。",
      "example_en": "She and her brother are really tight; they talk every day.",
      "example_cn": "她和她哥哥关系非常亲密，每天都聊天。"
    },
    {
      "pos": "adverb",
      "explanation_en": "In a close or firm manner; not loosely or loosely fitted.",
      "explanation_cn": "以紧密或牢固的方式，不松散或松动地。",
      "example_en": "He tied the rope tight around the post.",
      "example_cn": "他把绳子紧紧地系在柱子上。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tight",
      "analysis": "“Tight” 作为形容词时，强调物理上的紧绷或抽象上的严格，而 “compact” 更侧重于空间利用高效、结构紧凑，常用于描述物体设计或布局，不带有压力或限制的含义。例如，一个紧凑的公寓（compact apartment）是空间利用合理，但不一定‘紧’得让人不舒服。"
    },
    {
      "word_to_compare": "strict",
      "analysis": "“Strict” 专指规则、纪律或标准的严格性，通常用于人或制度，而 “tight” 在表示‘严格’时更口语化，且可延伸至非规则领域，如‘tight budget’（紧缩预算）或‘tight grip’（紧握）。‘Strict’ 更正式，‘tight’ 更灵活多义。"
    },
    {
      "word_to_compare": "narrow",
      "analysis": "“Narrow” 强调宽度或范围的狭小，常用于空间、道路、选择或观点，如‘narrow road’或‘narrow escape’。而 ‘tight’ 更强调‘被拉紧’或‘受限制’的状态，不一定涉及宽度，如‘tight schedule’（紧凑的日程）或‘tight fit’（紧贴的贴合）。"
    }
  ]
}