{
  "word": "tile",
  "pronunciation": "tīl",
  "concise_definition": "n. 瓷砖, 瓦片; v. 铺瓷砖, 覆盖",
  "forms": {
    "plural": "tiles",
    "third_person_singular": "tiles",
    "past_tense": "tiled",
    "past_participle": "tiled",
    "present_participle": "tiling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A thin, flat, rectangular piece of baked clay, ceramic, stone, or other material, typically used to cover floors, walls, or roofs.",
      "explanation_cn": "一种由烧制黏土、陶瓷、石材或其他材料制成的薄而平的矩形片状物，通常用于铺设地板、墙壁或屋顶。",
      "example_en": "The bathroom walls are covered with white ceramic tiles.",
      "example_cn": "浴室的墙壁铺满了白色陶瓷瓷砖。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, square or rectangular piece of material used in games, puzzles, or decorative patterns, such as in a mosaic or checkerboard.",
      "explanation_cn": "用于游戏、拼图或装饰图案中的小块方形或矩形材料，例如马赛克或棋盘中的棋格。",
      "example_en": "She arranged the colored tiles into a beautiful mosaic pattern.",
      "example_cn": "她将彩色瓷砖排列成一幅美丽的马赛克图案。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover a surface, especially a floor or wall, with tiles.",
      "explanation_cn": "用瓷砖覆盖表面，尤指地板或墙壁。",
      "example_en": "They hired a contractor to tile the kitchen floor.",
      "example_cn": "他们聘请了一名承包商来铺设厨房地面的瓷砖。"
    },
    {
      "pos": "verb",
      "explanation_en": "To arrange or cover something in a pattern resembling tiles, often used metaphorically to describe overlapping or repeating elements.",
      "explanation_cn": "以类似瓷砖的模式排列或覆盖某物，常用于比喻描述重叠或重复的元素。",
      "example_en": "The satellite images were tiled together to form a complete map of the region.",
      "example_cn": "卫星图像被拼接在一起，形成了该地区的完整地图。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "slate",
      "analysis": "“Slate”（板岩）是一种天然岩石，常被用作屋顶瓦片或书写板，强调其天然材质和厚重感。而 “tile” 是人工制造的，材质多样（如陶瓷、玻璃），更广泛用于室内装饰和地面铺设。"
    },
    {
      "word_to_compare": "plank",
      "analysis": "“Plank”（木板）是长条形的木材或合成材料，常用于地板或墙面的铺装，强调纵向延伸和木质纹理。而 “tile” 是小块方形或矩形，强调规则几何排列和防水耐磨特性，多用于潮湿区域。"
    },
    {
      "word_to_compare": "mosaic",
      "analysis": "“Mosaic”（马赛克）是由大量小块材料（包括瓷砖）拼贴成的图案或图像，强调艺术性和整体构图。而 “tile” 本身是构成马赛克的基本单元，单独使用时通常指单一、重复的实用铺装材料。"
    }
  ]
}