{
  "word": "tip",
  "pronunciation": "tip",
  "concise_definition": "n. 小费, 建议, 顶端; v. 给小费, 倾斜, 泄露",
  "forms": {
    "plural": "tips",
    "third_person_singular": "tips",
    "past_tense": "tipped",
    "past_participle": "tipped",
    "present_participle": "tipping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small amount of money given voluntarily to someone who has provided a service, especially in the hospitality industry, as a gesture of appreciation.",
      "explanation_cn": "指自愿给予提供服务者（尤其在餐饮、酒店行业）的一小笔钱，作为对其服务的感谢。",
      "example_en": "She left a generous tip for the waiter after an excellent meal.",
      "example_cn": "在享用了一顿美味的餐点后，她给服务员留了一笔丰厚的小费。"
    },
    {
      "pos": "noun",
      "explanation_en": "A piece of useful advice or insight, often based on experience, intended to help someone succeed or avoid mistakes.",
      "explanation_cn": "指基于经验的实用建议或洞见，旨在帮助他人取得成功或避免错误。",
      "example_en": "Here’s a useful tip: always double-check your spelling before submitting the form.",
      "example_cn": "这里有一个实用建议：在提交表格前务必仔细检查拼写。"
    },
    {
      "pos": "noun",
      "explanation_en": "The pointed or narrow end of something, such as the tip of a pencil or a mountain.",
      "explanation_cn": "指某物的尖端或细窄部分，如铅笔尖或山峰的顶端。",
      "example_en": "He sharpened the tip of the pencil with a knife.",
      "example_cn": "他用小刀削尖了铅笔的笔尖。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give a small amount of money as a gratuity to someone who has provided a service.",
      "explanation_cn": "指为某人提供的服务而给予一小笔酬金。",
      "example_en": "We tipped the taxi driver $5 for helping with our luggage.",
      "example_cn": "我们给了出租车司机五美元小费，感谢他帮我们搬行李。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to lean or tilt to one side, often unexpectedly or accidentally.",
      "explanation_cn": "指使某物向一侧倾斜，通常是意外或非故意的。",
      "example_en": "The boat began to tip as the wind picked up.",
      "example_cn": "风力增强时，船开始倾斜。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reveal confidential or secret information, often to the press or authorities.",
      "explanation_cn": "指向媒体或当局泄露机密或秘密信息。",
      "example_en": "An anonymous source tipped off the police about the planned robbery.",
      "example_cn": "一位匿名消息来源向警方泄露了即将发生的抢劫计划。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "advice",
      "analysis": "“Advice” (建议) 是一个更广泛、更正式的词，泛指任何提供建议的行为或内容，不带有“实用技巧”的隐含意味。而 “tip” 更口语化，常指简短、具体、可立即操作的实用建议，常用于生活、工作场景中。"
    },
    {
      "word_to_compare": "gratuity",
      "analysis": "“Gratuity” (小费) 是 “tip” 的正式同义词，多用于法律或财务语境，语气更严肃。而 “tip” 是日常口语中最常用的词，情感色彩更自然、亲切。两者在指金钱时可互换，但语体不同。"
    },
    {
      "word_to_compare": "point",
      "analysis": "“Point” (点、尖端) 与 “tip” 在指物体末端时部分重叠，但 “point” 更强调几何意义上的尖锐端点，常用于数学或抽象语境（如论点的要点）；而 “tip” 更强调物理形态的末端，常用于具体物体（如笔尖、鱼钩尖）。"
    }
  ]
}