{
  "word": "tipped",
  "pronunciation": "tipped",
  "concise_definition": "adj. 给了小费的, 倾斜的, 被告知的; v. 给小费, 倾斜, 泄露 (tip 的过去式和过去分词)",
  "forms": {
    "base_form": "tip",
    "third_person_singular": "tips",
    "present_participle": "tipping",
    "past_tense": "tipped",
    "past_participle": "tipped"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having given a gratuity, especially to a service worker for good service; often used to describe someone who has acted generously in this way.",
      "explanation_cn": "指已向服务人员支付小费的，通常用于描述某人因服务良好而慷慨给予小费的行为。",
      "example_en": "The tipped waiter smiled warmly as he handed back the change.",
      "example_cn": "那位收到小费的侍者微笑着把零钱递了回来。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Leaning or tilted to one side, often due to imbalance or external force; describes a physical orientation.",
      "explanation_cn": "指因不平衡或外力而向一侧倾斜的状态，描述物体的物理姿态。",
      "example_en": "The old tree was tipped by the storm, its roots exposed to the air.",
      "example_cn": "那棵老树被风暴吹得倾斜了，根部暴露在空气中。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give a small amount of money as a gratuity to someone who has provided a service, especially in the hospitality industry.",
      "explanation_cn": "指为提供服务的人（尤其在餐饮或酒店行业）给予一小笔酬金作为感谢。",
      "example_en": "She tipped the taxi driver twenty dollars for helping with her luggage.",
      "example_cn": "她给了出租车司机二十美元小费，感谢他帮忙搬行李。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to lean or tilt from a vertical or horizontal position, often slightly.",
      "explanation_cn": "指使某物从垂直或水平位置略微倾斜。",
      "example_en": "He tipped his hat in greeting as he passed the old man.",
      "example_cn": "他经过那位老人时，微微脱帽致意。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reveal confidential or insider information, often secretly or to an advantage; commonly used in contexts of politics, business, or sports.",
      "explanation_cn": "指秘密泄露机密或内部信息，通常是为了获得某种优势，常用于政治、商业或体育语境。",
      "example_en": "An anonymous source tipped off the journalist about the corruption scandal.",
      "example_cn": "一位匿名消息源向记者泄露了这起腐败丑闻的内幕。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tip",
      "analysis": "“Tip” 是动词或名词的原形，泛指小费、倾斜动作或泄露信息的行为；而 “tipped” 是其过去式和过去分词形式，强调动作已完成。例如，“He tipped the waiter”（他给了侍者小费）是动作发生，而 “The waiter was tipped”（侍者收到了小费）是被动结果。"
    },
    {
      "word_to_compare": "tilted",
      "analysis": "“Tilted” 是 “tilt” 的过去式，与 “tipped” 在表示‘倾斜’时语义高度重叠，但 ‘tilted’ 更常用于正式或精确描述角度变化（如‘the screen was tilted 15 degrees’），而 ‘tipped’ 更口语化，常暗示轻微、偶然或不稳定的倾斜（如‘the cup tipped over’）。"
    },
    {
      "word_to_compare": "informed",
      "analysis": "“Informed”（告知）是更中性、正式的词，泛指提供信息，不隐含秘密或利益动机；而 “tipped” 在作为动词使用时，特指‘私下、非正式地泄露’信息，常带有‘内幕’或‘优势情报’的色彩，如‘tipped off’ 是固定搭配，强调信息的隐蔽性和策略性。"
    }
  ]
}