{
  "word": "tipping",
  "pronunciation": "tip·ihng",
  "concise_definition": "n. 给小费, 小费行为, 倾斜; v. 给小费, 使倾斜, 翻倒",
  "forms": {
    "base_form": "tip",
    "third_person_singular": "tips",
    "past_tense": "tipped",
    "past_participle": "tipped",
    "present_participle": "tipping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small amount of money given voluntarily to someone who provides a service, as a token of appreciation for good service.",
      "explanation_cn": "为感谢服务人员提供的优质服务而自愿给予的一小笔钱。",
      "example_en": "She left a generous tipping of 20% after the excellent dinner service.",
      "example_cn": "在享受了出色的晚餐服务后，她留下了20%的丰厚小费。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give a tip or tips to someone who has provided a service, especially in the hospitality industry.",
      "explanation_cn": "向提供服务的人（尤指餐饮、酒店行业）给予小费。",
      "example_en": "Customers often tip their waiters when the service is prompt and friendly.",
      "example_cn": "当服务迅速友好时，顾客通常会给服务员小费。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to lean, tilt, or turn over from a vertical or balanced position.",
      "explanation_cn": "使某物从垂直或平衡状态倾斜或翻倒。",
      "example_en": "The strong wind was tipping over the garden chairs.",
      "example_cn": "强风把花园里的椅子吹得东倒西歪。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a situation, decision, or balance to shift decisively in one direction, often from one state to another.",
      "explanation_cn": "使某种情况、决定或平衡发生决定性转变，通常从一种状态转向另一种状态。",
      "example_en": "The final vote was tipping the scales in favor of the new policy.",
      "example_cn": "最后一票使天平倾向了新政策。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "gratuity",
      "analysis": "“Gratuity”（小费）是“tipping”的名词形式，但更正式、更常用于书面语或法律语境，强调其作为服务报酬的法定或惯例性质。而 “tipping” 更侧重于行为本身，口语中更常用。"
    },
    {
      "word_to_compare": "tilt",
      "analysis": "“Tilt”（倾斜）与 “tip” 在物理倾斜意义上相近，但 “tilt” 更强调持续的、可控的倾斜角度，如相机倾斜、头部倾斜；而 “tip” 更常指突然的、失去平衡的翻倒动作，如杯子 tipping over。"
    },
    {
      "word_to_compare": "switch",
      "analysis": "“Switch”（切换）指有意识地从一个状态、选择或立场转向另一个，通常带有明确的决策过程。而 “tip” 在比喻义中（如 tipping the scales）强调的是微小力量导致的转折，常是被动或偶然的，带有不确定性。"
    }
  ]
}