{
  "word": "tips",
  "pronunciation": "tipz",
  "concise_definition": "n. 建议, 贴士, 小费; v. 给小费, 使倾斜",
  "forms": {
    "singular": "tip"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A piece of practical advice or helpful guidance, often based on experience, intended to improve performance or avoid common mistakes.",
      "explanation_cn": "指基于经验提供的实用建议或有益指导，旨在提升表现或避免常见错误。",
      "example_en": "Here are some tips for improving your public speaking skills.",
      "example_cn": "以下是一些提高公众演讲技巧的建议。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small amount of money given voluntarily to someone for service, especially in restaurants, hotels, or taxis, as a token of appreciation.",
      "explanation_cn": "指为服务人员（如餐厅、酒店或出租车司机）自愿给予的小额金钱，作为对其服务的感谢。",
      "example_en": "She left a generous tip for the waiter who went above and beyond.",
      "example_cn": "她给那位尽心尽力的服务员留下了丰厚的小费。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give a small amount of money as a gratuity to someone who has provided a service.",
      "explanation_cn": "指为提供服务的人给予小额酬金作为感谢。",
      "example_en": "We tipped the bellhop $10 for carrying our luggage.",
      "example_cn": "我们给行李员10美元小费，感谢他帮我们搬运行李。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to lean or tilt to one side, often slightly or unexpectedly.",
      "explanation_cn": "指使某物向一侧倾斜，通常指轻微或意外的倾斜。",
      "example_en": "The boat began to tip as the wind picked up.",
      "example_cn": "风力增强时，船开始倾斜。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "advice",
      "analysis": "“Advice” (建议) 是一个更广泛、更正式的词，泛指任何基于判断或经验的指导，可以是严肃的、长期的或战略性的。而 “tip” 更偏向于具体、实用、简短的建议，常用于日常生活或操作技巧中，语气更轻松。"
    },
    {
      "word_to_compare": "trick",
      "analysis": "“Trick” (窍门) 常指一种巧妙、非传统甚至略带欺骗性的方法，用于快速达成目的，有时带有“取巧”意味。而 “tip” 更强调正统、可靠、可复制的实用建议，不包含欺骗性。"
    },
    {
      "word_to_compare": "gratuity",
      "analysis": "“Gratuity” (小费) 是 “tip” 在金钱含义上的正式同义词，多用于法律、财务或书面语境中，语气更正式。而 “tip” 是日常口语中最常用的词，涵盖范围更广，也可作动词使用。"
    }
  ]
}