{
  "word": "titanic",
  "pronunciation": "tahy·tan·ik",
  "concise_definition": "adj. 巨大的, 极其庞大的; n. 泰坦尼克号",
  "forms": {
    "comparative": "titanic",
    "superlative": "titanic"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Of immense size, strength, or power; extraordinarily large or great, often to the point of being awe-inspiring or overwhelming.",
      "explanation_cn": "形容规模、力量或威力极其巨大，常达到令人敬畏或压倒性的程度。",
      "example_en": "The project required a titanic effort from the entire team.",
      "example_cn": "这个项目需要整个团队付出巨大的努力。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to the Titans of Greek mythology, who were primordial deities of immense power and size, often symbolizing primal force or grandeur.",
      "explanation_cn": "与希腊神话中的泰坦神族相关，泰坦是原始神祇，以巨大的体型和力量著称，常象征原始的力量或宏伟。",
      "example_en": "The titanic struggle between the gods and the Titans shaped the cosmos.",
      "example_cn": "诸神与泰坦之间的巨大斗争塑造了宇宙。"
    },
    {
      "pos": "noun",
      "explanation_en": "The RMS Titanic, a British passenger liner that sank in the North Atlantic Ocean in 1912 after striking an iceberg, becoming one of the deadliest peacetime maritime disasters in history.",
      "explanation_cn": "指英国豪华邮轮‘泰坦尼克号’，1912年在北大西洋撞上冰山后沉没，成为和平时期最致命的海难之一。",
      "example_en": "The movie 'Titanic' dramatized the tragic sinking of the ship and the love story between its passengers.",
      "example_cn": "电影《泰坦尼克号》戏剧化地再现了这艘船的悲剧性沉没及其乘客之间的爱情故事。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "gigantic",
      "analysis": "“Gigantic”（巨大的）强调尺寸或规模上的极端庞大，常用于日常语境，语气较直接。而 “titanic” 不仅指体积大，还隐含力量、气势或历史意义的宏伟，带有神话或史诗般的色彩，语义更丰富、更具文学性。"
    },
    {
      "word_to_compare": "enormous",
      "analysis": "“Enormous”（庞大的）是中性词，仅表示数量或程度上的巨大，多用于量化描述（如 enormous cost, enormous size）。而 “titanic” 常带有情感色彩，暗示一种压倒性的、近乎超自然的强度或规模，常用于比喻性表达。"
    },
    {
      "word_to_compare": "colossal",
      "analysis": "“Colossal”（巨大的）与 “titanic” 都有宏伟、震撼的含义，但 “colossal” 更侧重于物理上的庞大规模（如雕像、建筑），而 “titanic” 可用于抽象概念（如努力、灾难），并常与神话、历史事件或文化符号（如泰坦尼克号）紧密关联，语义更具文化负载。"
    }
  ]
}