{
  "word": "titles",
  "pronunciation": "tī·təlz",
  "concise_definition": "n. 标题, 头衔, 财产权, 电影/书籍名称",
  "forms": {
    "singular": "title"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A word or phrase that identifies or summarizes the content of a book, article, film, or other work, serving as a label for easy reference.",
      "explanation_cn": "用于标识或概括书籍、文章、电影或其他作品内容的词语或短语，作为便于引用的标签。",
      "example_en": "The title of her novel is 'The Silent Forest'.",
      "example_cn": "她的这部小说标题是《寂静森林》。"
    },
    {
      "pos": "noun",
      "explanation_en": "A formal designation or honorific granted to a person to indicate their rank, position, or status, especially in professional, royal, or social contexts.",
      "explanation_cn": "授予个人以表明其等级、职位或社会地位的正式称谓，常用于职业、王室或社交场合。",
      "example_en": "Dr. Smith holds the title of Professor Emeritus at Harvard University.",
      "example_cn": "史密斯博士拥有哈佛大学荣誉教授的头衔。"
    },
    {
      "pos": "noun",
      "explanation_en": "Legal ownership or right to possess property, especially real estate or a vehicle, establishing who has the lawful claim to it.",
      "explanation_cn": "对财产（尤其是房地产或车辆）拥有合法所有权或占有权的法律凭证，明确谁对该财产拥有合法主张。",
      "example_en": "After paying off the mortgage, they received the title to their new home.",
      "example_cn": "还清房贷后，他们拿到了新房的产权证书。"
    },
    {
      "pos": "noun",
      "explanation_en": "A name given to a specific section, chapter, or part within a larger work, helping to organize its structure.",
      "explanation_cn": "在较大作品中为某一章节或部分所赋予的名称，用于组织其结构。",
      "example_en": "Each chapter in the textbook has a clear title that reflects its main topic.",
      "example_cn": "教科书中的每一章都有一个清晰的标题，反映其主要内容。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "heading",
      "analysis": "“Heading”（标题/小标题）通常指文档或文章中用于分隔段落的简短文字，功能更偏向于结构组织，常用于报告、网页或列表中，语气较中性。而 “title” 更强调作品的整体命名，具有识别性和权威性。"
    },
    {
      "word_to_compare": "name",
      "analysis": "“Name”（名称）是一个更宽泛的词，泛指任何事物的称呼，可以是人名、地名或品牌名，不一定具有标识内容或法律意义。而 “title” 特指作品、职位或产权的正式命名，具有特定语境下的功能性和规范性。"
    },
    {
      "word_to_compare": "designation",
      "analysis": "“Designation”（指定称谓）强调通过官方或制度性程序赋予的名称，常用于职位、分类或项目编号，语气更正式、技术性更强。而 “title” 更常用于社会认可、文化表达或法律权利的语境，更具人文色彩。"
    }
  ]
}