{
  "word": "title",
  "pronunciation": "tī·təl",
  "concise_definition": "n. 标题, 题目, 称号, 头衔; v. 给...命名",
  "forms": {
    "plural": "titles"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A word or phrase that identifies or summarizes the content of a book, article, film, or other work, serving as a label to attract attention or convey the main topic.",
      "explanation_cn": "用于标识或概括书籍、文章、电影或其他作品内容的词语或短语，起到吸引注意或传达主题的作用。",
      "example_en": "The title of her novel is 'The Silent Forest'.",
      "example_cn": "她的小说标题是《寂静森林》。"
    },
    {
      "pos": "noun",
      "explanation_en": "A formal designation or honorific granted to a person, indicating their rank, position, or status, especially in professional, noble, or official contexts.",
      "explanation_cn": "授予个人的正式称谓或荣誉头衔，表明其在职业、贵族或官方语境中的等级、职位或身份。",
      "example_en": "Dr. Lee holds the title of Professor Emeritus at Harvard University.",
      "example_cn": "李博士拥有哈佛大学荣誉教授的头衔。"
    },
    {
      "pos": "noun",
      "explanation_en": "Legal ownership or right to possess something, especially property or land; the document that proves such ownership.",
      "explanation_cn": "对某物（尤其是财产或土地）的合法所有权或占有权；证明这种所有权的文件。",
      "example_en": "After paying off the mortgage, they received the title to their new home.",
      "example_cn": "还清房贷后，他们拿到了新房的产权证书。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give a title to a work, document, or creation, especially to label it for identification or presentation.",
      "explanation_cn": "为作品、文件或创作赋予标题，尤其用于标识或展示目的。",
      "example_en": "The artist titled the painting 'Whispers of the Wind'.",
      "example_cn": "这位艺术家将这幅画命名为《风的低语》。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "heading",
      "analysis": "“Heading”（标题/小标题）通常指文章、报告或文档中的段落标题，用于组织内容结构，多用于非正式或分节场景，如新闻小标题或章节标题。而 “title” 更强调整个作品的总称，具有整体性和权威性。"
    },
    {
      "word_to_compare": "name",
      "analysis": "“Name”（名称）是一个更宽泛的词，泛指任何事物的称呼，可以是人名、地名或品牌名，不一定具有说明性或正式性。而 “title” 通常带有功能性目的，如标识作品、表明身份或确立所有权，更具规范性和语境依赖性。"
    },
    {
      "word_to_compare": "rank",
      "analysis": "“Rank”（军衔/级别）专指在等级制度中的位置，如将军、上尉等，强调层级和权力关系。而 “title” 可以包含 rank，但范围更广，还包括荣誉性头衔（如爵士）、专业称谓（如博士）或作品名称，不一定涉及权力结构。"
    }
  ]
}