{
  "word": "toasted",
  "pronunciation": "tōs·tɪd",
  "concise_definition": "adj. 烤焦的, 烤过的, 微醉的",
  "forms": {
    "base_form": "toast",
    "comparative": "more toasted",
    "superlative": "most toasted"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Made brown and crisp by exposure to dry heat, typically referring to bread or other food items that have been heated until their surface is slightly charred and crunchy.",
      "explanation_cn": "指通过干热加热使表面变褐、变脆的食物，通常用于描述面包等被烤至略微焦脆的状态。",
      "example_en": "She enjoyed her breakfast with buttered toasted bread and a cup of coffee.",
      "example_cn": "她一边享用涂了黄油的烤面包，一边喝着咖啡，度过美好的早餐时光。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Slightly intoxicated or tipsy, often used informally to describe someone who has had too much alcohol but is not fully drunk.",
      "explanation_cn": "非正式用语，指人喝了过多酒精后微醺、有点醉的状态，但尚未完全醉倒。",
      "example_en": "After a few drinks at the party, he was completely toasted and couldn't find his keys.",
      "example_cn": "派对上喝了幾杯后，他完全醉了，连钥匙都找不到。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used in slang to describe something that is extremely cool, impressive, or popular, especially among younger generations.",
      "explanation_cn": "俚语用法，形容某事物极其酷炫、令人印象深刻或非常受欢迎，尤其在年轻人群体中。",
      "example_en": "That new sneaker design is totally toasted — everyone’s talking about it.",
      "example_cn": "那款新运动鞋设计太酷了——人人都在讨论。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "roasted",
      "analysis": "“Roasted”（烤制的）通常指在较高温度下长时间烘烤，常用于肉类或蔬菜，强调外焦里嫩的烹饪方式；而 “toasted” 多用于面包、坚果等较薄或易熟的食物，强调表面酥脆。此外，“roasted” 在俚语中也表示“严厉批评”，与 “toasted” 的“微醉”或“酷炫”含义不同。"
    },
    {
      "word_to_compare": "burnt",
      "analysis": "“Burnt”（烧焦的）带有负面含义，指因过度加热而炭化、不可食用；而 “toasted” 是一种理想状态，是适度加热后的金黄酥脆，通常为正面描述。例如，面包可以是 toasted，但不会说它是 burnt（除非真的做坏了）。"
    },
    {
      "word_to_compare": "drunk",
      "analysis": "“Drunk”（醉酒的）是描述酒精摄入过量的正式或中性术语，表示失去控制或判断力；而 “toasted” 是非正式、轻度的表达，暗示微醺状态，语气更轻松幽默，常用于社交语境中，不具贬义。"
    }
  ]
}