{
  "word": "toe",
  "pronunciation": "tō",
  "concise_definition": "n. 脚趾, 脚趾尖; v. 用脚尖触, 脚尖点地",
  "forms": {
    "plural": "toes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "One of the five digits at the end of the foot, used for balance, movement, and sometimes grip; the term can also refer to the front part of a shoe that covers the toes.",
      "explanation_cn": "脚末端的五个脚趾之一，用于保持平衡、移动，有时也用于抓握；也可指鞋子前端覆盖脚趾的部分。",
      "example_en": "She stubbed her toe on the corner of the table and winced in pain.",
      "example_cn": "她把脚趾撞到了桌子角上，疼得皱起了眉头。"
    },
    {
      "pos": "noun",
      "explanation_en": "The front part of a sock, shoe, or garment that covers or is designed for the toes.",
      "explanation_cn": "袜子、鞋子或衣物前端用于覆盖或适配脚趾的部分。",
      "example_en": "The toe of his sock had worn thin from too much running.",
      "example_cn": "他的袜子脚趾部分因长时间跑步而磨薄了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To touch or reach something with the toes, often in a careful or tentative way; to stand or move with the toes pointed forward or downward.",
      "explanation_cn": "用脚趾轻触或够到某物，通常带有谨慎或试探的意味；也可指站立或移动时脚尖向前或向下。",
      "example_en": "She toed the line before the race began, ensuring she was in the correct starting position.",
      "example_cn": "比赛开始前，她用脚尖抵着起跑线，确保自己处于正确的位置。"
    },
    {
      "pos": "verb",
      "explanation_en": "To turn or position something so that it aligns with the toes, especially in dance or sports contexts.",
      "explanation_cn": "在舞蹈或体育语境中，将某物调整为脚尖朝向的方向。",
      "example_en": "The ballet dancer toed in slightly to maintain proper form.",
      "example_cn": "这位芭蕾舞者略微内收脚尖以保持正确的姿势。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "finger",
      "analysis": "“Finger”（手指）是手的末端部分，与“toe”（脚趾）在身体结构上对应，但功能不同：手指用于精细操作（如抓握、书写），而脚趾主要用于平衡和推进。两者虽同为肢体末端，但语义上不重叠，仅在解剖学上形成类比。"
    },
    {
      "word_to_compare": "tip",
      "analysis": "“Tip”（尖端）是一个通用词，指任何物体的最前端，如笔尖、山尖、线头等。而“toe”特指脚的前端部分，具有明确的解剖学含义。虽然“toe”可引申为鞋尖，但其核心意义仍与人体结构绑定，而“tip”更抽象、更广泛。"
    },
    {
      "word_to_compare": "point",
      "analysis": "“Point”（点、尖端）强调尖锐或聚焦的末端，常用于描述方向、位置或动作（如指向、尖端）。而“toe”作为动词时虽可表示“用脚尖触”，但其语义范围更窄，仅限于脚部动作，且常与身体姿态或规范（如“toe the line”）相关，不具“point”所含的抽象或象征意义。"
    }
  ]
}