{
  "word": "tokens",
  "pronunciation": "tō·kənz",
  "concise_definition": "n. 代币, 标志, 象征, 令牌",
  "forms": {
    "singular": "token"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A physical or digital object used as a symbol of value, access, or authentication, often in place of currency or as a key to unlock a system.",
      "explanation_cn": "指用作价值、访问权限或身份验证象征的实体或数字对象，常替代货币或作为进入系统的钥匙。",
      "example_en": "Casinos use colored plastic tokens instead of cash for gambling.",
      "example_cn": "赌场用彩色塑料代币代替现金进行赌博。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small gesture or symbol intended to represent a larger sentiment, often used to acknowledge something without full commitment.",
      "explanation_cn": "指一种象征性的微小举动或物品，用于表达某种更深层的情感或态度，但通常不带有完全的承诺。",
      "example_en": "The company gave employees a holiday card as a token of appreciation.",
      "example_cn": "公司向员工赠送节日贺卡，以表达谢意。"
    },
    {
      "pos": "noun",
      "explanation_en": "In computer science, a unit of data or a sequence of characters that forms the smallest meaningful element in a programming language or text processing system.",
      "explanation_cn": "在计算机科学中，指编程语言或文本处理系统中构成最小有意义单元的数据片段或字符序列。",
      "example_en": "The compiler breaks the code into tokens such as keywords, identifiers, and operators.",
      "example_cn": "编译器将代码分解为关键字、标识符和运算符等令牌。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sign or indication of something, often used in phrases like 'a token of friendship' or 'a token resistance'.",
      "explanation_cn": "指某种事物的迹象或表现，常用于短语如‘友谊的象征’或‘象征性的抵抗’。",
      "example_en": "His apology was just a token gesture; he didn't truly mean it.",
      "example_cn": "他的道歉只是象征性的举动，并非真心实意。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "coin",
      "analysis": "“Coin”（硬币）特指金属铸造的货币单位，具有法定货币属性，而 “token” 更广泛，可以是非官方、非货币性的象征物，如游戏币、公交卡等。所有硬币都是货币，但并非所有代币都是货币。"
    },
    {
      "word_to_compare": "symbol",
      "analysis": "“Symbol”（符号）是抽象的代表，如心形代表爱，而 “token” 通常是具体的实物或数字对象，承载象征意义。符号可以是图形或概念，而代币是可持有、可传递的实体。"
    },
    {
      "word_to_compare": "badge",
      "analysis": "“Badge”（徽章）通常用于标识身份、职位或成就，具有明确的归属和权威性（如警徽、会员徽章），而 “token” 更强调功能性或象征性，不一定代表身份，如地铁代币或游戏道具。"
    },
    {
      "word_to_compare": "digit",
      "analysis": "“Digit”（数字）是数值的基本单位（0–9），在编程中是字符的最小组成，而 “token” 是语义层面的最小单位，可能由多个数字、字母或符号组成（如变量名、关键字）。一个 token 可能包含多个 digit，但一个 digit 不是 token。"
    }
  ]
}