{
  "word": "toledo",
  "pronunciation": "tuh·lee·doh",
  "concise_definition": "n. 托莱多（美国俄亥俄州城市；西班牙城市）",
  "forms": {
    "plural": "toledos"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A city in northwestern Ohio, United States, known for its manufacturing history, particularly in glass and automotive industries, and for the University of Toledo.",
      "explanation_cn": "美国俄亥俄州西北部的一座城市，以制造业历史闻名，尤其在玻璃和汽车工业领域，并拥有托莱多大学。",
      "example_en": "She moved to Toledo after graduating from college to work at a glass manufacturing plant.",
      "example_cn": "她大学毕业后搬到托莱多，在一家玻璃制造厂工作。"
    },
    {
      "pos": "noun",
      "explanation_en": "A historic city in central Spain, once the capital of the Visigothic Kingdom and later an important center of medieval culture, known for its cathedral, mosques, and synagogues reflecting its diverse religious heritage.",
      "explanation_cn": "西班牙中部的一座历史名城，曾是西哥特王国的首都，后成为中世纪文化的重要中心，以其大教堂、清真寺和犹太会堂闻名，体现了其多元宗教遗产。",
      "example_en": "The architecture of Toledo, Spain, blends Christian, Muslim, and Jewish influences in a unique way.",
      "example_cn": "西班牙托莱多的建筑以独特的方式融合了基督教、穆斯林和犹太教的影响。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of sword or blade originally made in Toledo, Spain, renowned for its exceptional quality, sharpness, and durability during the Middle Ages.",
      "explanation_cn": "一种原产于西班牙托莱多的剑或刀具，以中世纪时期卓越的品质、锋利度和耐用性而著称。",
      "example_en": "The knight wielded a forged Toledo blade that had been passed down through generations.",
      "example_cn": "这位骑士挥舞着一把世代相传的托莱多锻造宝剑。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cathedral",
      "analysis": "“Cathedral”（大教堂）指基督教主教座堂，是宗教建筑的专有名词；而 “Toledo” 是地名，虽然西班牙托莱多以大教堂闻名，但本身并非建筑类型，而是承载该建筑的城市名称。"
    },
    {
      "word_to_compare": "sword",
      "analysis": "“Sword”（剑）是泛指所有类型的刀剑武器；而 “Toledo” 作为名词时特指源自西班牙托莱多的高品质刀剑，具有地理和工艺上的专属性，属于品牌化的历史产品名称。"
    },
    {
      "word_to_compare": "city",
      "analysis": "“City”（城市）是通用名词，泛指任何城市；而 “Toledo” 是专有名词，特指美国俄亥俄州或西班牙的两座具体城市，具有唯一性和文化标识性，不能互换使用。"
    }
  ]
}