{
  "word": "toll",
  "pronunciation": "tohl",
  "concise_definition": "n. 通行费, 代价, 损失; v. 敲响, 造成损失",
  "forms": {
    "plural": "tolls",
    "third_person_singular": "tolls",
    "past_tense": "tolled",
    "past_participle": "tolled",
    "present_participle": "tollying"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A fee charged for the use of a road, bridge, tunnel, or other infrastructure, typically collected at a barrier or booth.",
      "explanation_cn": "指为使用道路、桥梁、隧道或其他基础设施而收取的费用，通常在收费站或障碍处收取。",
      "example_en": "Drivers must pay a $5 toll to cross the bridge.",
      "example_cn": "司机必须支付5美元的过桥费。"
    },
    {
      "pos": "noun",
      "explanation_en": "The negative impact or cost resulting from an event, often in terms of human life, health, or resources; a heavy burden or loss.",
      "explanation_cn": "指某事件所造成的负面影响或代价，常表现为生命、健康或资源的损失；一种沉重的负担或损耗。",
      "example_en": "The war took a terrible toll on the civilian population.",
      "example_cn": "这场战争给平民人口造成了惨重的伤亡。"
    },
    {
      "pos": "verb",
      "explanation_en": "To ring a bell slowly and solemnly, especially to mark a death or a solemn occasion.",
      "explanation_cn": "指缓慢而庄重地敲响钟声，通常用于纪念死亡或庄重的场合。",
      "example_en": "The church bell tolled thirteen times for the fallen soldiers.",
      "example_cn": "教堂的钟为阵亡士兵敲响了十三下。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause gradual damage, loss, or exhaustion over time; to wear away or deplete.",
      "explanation_cn": "指随着时间推移逐渐造成损害、损失或耗尽；使逐渐磨损或消耗。",
      "example_en": "Years of hard work had tolled on his health.",
      "example_cn": "多年的辛勤工作已损害了他的健康。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fee",
      "analysis": "“Fee”（费用）泛指为服务或权利支付的款项，范围更广，如咨询费、会员费，不一定与物理通道相关。而 “toll” 特指为使用特定基础设施（如公路、桥梁）支付的通行费，具有明确的物理场景和收取机制。"
    },
    {
      "word_to_compare": "cost",
      "analysis": "“Cost”（代价）是抽象的总支出，可指金钱、时间、精力等，适用范围极广。而 “toll” 作为名词时，特指因灾难、战争或长期压力造成的严重负面后果，带有情感重量和悲剧色彩，比 “cost” 更具冲击力和文学性。"
    },
    {
      "word_to_compare": "chime",
      "analysis": "“Chime”（鸣响）指钟或铃发出悦耳、轻快、有节奏的声音，常用于节日或报时，语义中性或积极。而 “toll” 指缓慢、沉重、哀悼式的敲钟，语义庄重甚至悲伤，常与死亡或灾难相关联。"
    }
  ]
}