{
  "word": "tone",
  "pronunciation": "tōn",
  "concise_definition": "n. 音调, 语气, 色调; v. 调整, 使柔和",
  "forms": {
    "plural": "tones",
    "third_person_singular": "tones",
    "past_tense": "toned",
    "past_participle": "toned",
    "present_participle": "toning"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The quality of a sound, especially in speech or music, that conveys emotion, attitude, or nuance, such as seriousness, sarcasm, or warmth.",
      "explanation_cn": "指声音（尤其在言语或音乐中）的特质，用以传达情感、态度或细微差别，如严肃、讽刺或温暖。",
      "example_en": "Her tone of voice suggested she was annoyed, even though her words were polite.",
      "example_cn": "她说话的语气暗示她很不耐烦，尽管她的言辞很礼貌。"
    },
    {
      "pos": "noun",
      "explanation_en": "The general character or atmosphere of something, such as a piece of writing, art, or an environment.",
      "explanation_cn": "指某事物（如文章、艺术作品或环境）的整体风格或氛围。",
      "example_en": "The tone of the novel is dark and melancholic, reflecting the protagonist's inner turmoil.",
      "example_cn": "这部小说的基调阴郁而忧伤，反映了主人公内心的挣扎。"
    },
    {
      "pos": "noun",
      "explanation_en": "A particular shade or hue of a color, especially one that is subtle or modified.",
      "explanation_cn": "指某种颜色的特定色调，尤其是微妙或经过调整的色彩。",
      "example_en": "The walls were painted in a soft tone of beige to create a calming effect.",
      "example_cn": "墙壁涂成了柔和的米色，以营造宁静的效果。"
    },
    {
      "pos": "verb",
      "explanation_en": "To adjust or modify something, especially to make it less intense, harsh, or bright; often used with 'down' or 'up'.",
      "explanation_cn": "指调整或修改某物，尤其是使其强度、刺眼度或鲜明度降低或提高，常与 'down' 或 'up' 连用。",
      "example_en": "The artist toned down the colors in the painting to make it more harmonious.",
      "example_cn": "艺术家将画中的色彩调柔和，使其更具和谐感。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pitch",
      "analysis": "“Pitch”（音高）是音乐或语音中声音频率的物理属性，是客观可测量的，如高音、低音。而 “tone” 更侧重于声音的整体质感和情感色彩，包含音高、音色、响度等综合因素，更具主观性和表现力。"
    },
    {
      "word_to_compare": "mood",
      "analysis": "“Mood”（情绪/气氛）指整体的情感状态或心理氛围，通常由环境、情节或背景共同营造，是更广泛、更抽象的概念。而 “tone” 更具体地体现在表达方式上，如语言、色彩或语气，是传达 mood 的手段之一。"
    },
    {
      "word_to_compare": "shade",
      "analysis": "“Shade”（色度）专指颜色的深浅变化，是视觉层面的细微差异，常用于绘画或设计领域。而 “tone” 在色彩语境中不仅包含深浅，还可能涉及冷暖、饱和度等更复杂的色彩属性，适用范围更广，也可用于非视觉领域（如语气）。"
    }
  ]
}