{
  "word": "tones",
  "pronunciation": "tōnz",
  "concise_definition": "n. 音调, 语气, 色调, 颜色",
  "forms": {
    "singular": "tone"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The quality of a sound, especially in speech or music, that conveys emotion, attitude, or nuance beyond the literal meaning of words.",
      "explanation_cn": "指声音（尤其在言语或音乐中）的特质，能够传达超越字面意义的情感、态度或细微差别。",
      "example_en": "Her tone of voice suggested she was annoyed, even though her words were polite.",
      "example_cn": "她的语气暗示她很不耐烦，尽管她说的话很礼貌。"
    },
    {
      "pos": "noun",
      "explanation_en": "A particular style or character of expression in writing, art, or behavior, often reflecting mood or intention.",
      "explanation_cn": "指在写作、艺术或行为中表现出的特定风格或特征，通常反映某种情绪或意图。",
      "example_en": "The article had a sarcastic tone that offended many readers.",
      "example_cn": "这篇文章带有讽刺的语气，冒犯了许多读者。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slight degree or variation of a color, especially a subtle or delicate shade.",
      "explanation_cn": "指某种颜色的轻微程度或变化，尤指细腻或柔和的色调。",
      "example_en": "The walls were painted in soft tones of beige and gray.",
      "example_cn": "墙壁涂成了柔和的米色和灰色调。"
    },
    {
      "pos": "noun",
      "explanation_en": "In music, a specific pitch or note, especially one that forms part of a scale or harmonic structure.",
      "explanation_cn": "在音乐中，指特定的音高或音符，尤其是构成音阶或和声结构的一部分。",
      "example_en": "The composer adjusted the tones to create a more harmonious melody.",
      "example_cn": "作曲家调整了音调，以创造更和谐的旋律。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pitch",
      "analysis": "“Pitch”（音高）是音乐术语，指声音在频率上的高低，是客观可测量的物理属性。而 “tone” 更广泛，既可指音高，也可包含音色、情感色彩等主观层面，常用于描述声音的整体质感。"
    },
    {
      "word_to_compare": "mood",
      "analysis": "“Mood”（情绪）指整体的情感氛围或心理状态，通常是抽象的、弥漫性的；而 “tone” 是通过语言、语气或色彩等具体表达方式体现出来的，是情绪的外在表现形式。例如，一篇文章的语气（tone）可以传达忧郁（mood）。"
    },
    {
      "word_to_compare": "shade",
      "analysis": "“Shade”（色度）特指颜色中加入黑色后形成的深浅变化，强调明暗维度；而 “tone” 在色彩语境中更广泛，可包含加入灰色或白色后的变化，更注重整体和谐与微妙的色彩过渡，常用于艺术与设计领域。"
    }
  ]
}