{
  "word": "toned",
  "pronunciation": "tōnd",
  "concise_definition": "adj. 有肌肉的, 体形紧致的; v. 使有肌肉, 使紧致（tone 的过去式和过去分词）",
  "forms": {
    "base_form": "tone",
    "third_person_singular": "tones",
    "past_tense": "toned",
    "past_participle": "toned",
    "present_participle": "toning"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having a firm, defined, and well-developed muscular appearance, especially as a result of exercise or physical training; describing a body that is lean and sculpted rather than flabby or soft.",
      "explanation_cn": "指因锻炼或体能训练而呈现出肌肉紧实、轮廓分明的外观，通常形容身体瘦削且线条优美，而非松软无力。",
      "example_en": "She has toned arms from months of weight training.",
      "example_cn": "她经过数月的力量训练，手臂变得紧致有力。"
    },
    {
      "pos": "verb",
      "explanation_en": "To improve the appearance and firmness of (a body part or muscle group) through exercise, often to reduce fat and increase muscle definition.",
      "explanation_cn": "通过锻炼来改善（某身体部位或肌群）的外观和紧实度，通常旨在减少脂肪并增强肌肉线条。",
      "example_en": "He tones his core every morning with yoga and planks.",
      "example_cn": "他每天早上通过瑜伽和平板支撑来锻炼核心肌群。"
    },
    {
      "pos": "verb",
      "explanation_en": "To adjust or modify the intensity, color, or quality of something, especially sound or color, to make it more subtle or harmonious.",
      "explanation_cn": "调整或修改某物（尤指声音或颜色）的强度、色调或质感，使其更柔和、更协调。",
      "example_en": "The photographer toned down the colors in the image to create a vintage look.",
      "example_cn": "摄影师降低了图片的色彩饱和度，以营造复古风格。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fit",
      "analysis": "“Fit”（健康的、体格健壮的）是一个更宽泛的词，泛指身体健康、体能良好，不一定强调肌肉线条。而 “toned” 更具体地指肌肉清晰、体脂较低的紧致外形，是“fit”的一种特定表现形式。"
    },
    {
      "word_to_compare": "sleek",
      "analysis": "“Sleek”（光滑的、流线型的）常用于形容外观光滑、有光泽或设计现代的事物，如汽车或头发，有时也可形容身材，但更侧重于视觉上的流畅感，而非肌肉的坚实度。而 “toned” 强调的是肌肉的结构和力量感。"
    },
    {
      "word_to_compare": "shaped",
      "analysis": "“Shaped”（塑形的）是一个较模糊的词，可指任何经过修饰或调整后的外形，如发型、身材或家具设计。它不必然包含肌肉或锻炼的含义。而 “toned” 特指通过锻炼获得的肌肉紧致状态，语义更精确、更偏向生理特征。"
    }
  ]
}