{
  "word": "tongues",
  "pronunciation": "tungz",
  "concise_definition": "n. 语言, 舌头, 舌状物",
  "forms": {
    "singular": "tongue"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A system of human communication using words spoken or signed, often referring to a specific language spoken by a particular group or nation.",
      "explanation_cn": "指人类通过口语或手语进行交流的系统，常指特定群体或国家所使用的某种语言。",
      "example_en": "She speaks three tongues: English, Spanish, and Mandarin.",
      "example_cn": "她会说三种语言：英语、西班牙语和普通话。"
    },
    {
      "pos": "noun",
      "explanation_en": "The muscular organ in the mouth used for tasting, swallowing, and speaking.",
      "explanation_cn": "口腔中用于品尝、吞咽和说话的肌肉器官。",
      "example_en": "He burned his tongue on the hot soup.",
      "example_cn": "他被热汤烫到了舌头。"
    },
    {
      "pos": "noun",
      "explanation_en": "A narrow, elongated part resembling a tongue, such as the flap of a shoe or a projection of land.",
      "explanation_cn": "指形状类似舌头的狭长部分，如鞋舌或陆地的延伸部分。",
      "example_en": "The tongue of the shoe was loose and needed to be tightened.",
      "example_cn": "鞋舌松了，需要系紧。"
    },
    {
      "pos": "noun",
      "explanation_en": "In religious contexts, especially in Pentecostal Christianity, the phenomenon of speaking in unintelligible utterances believed to be divine languages.",
      "explanation_cn": "在宗教语境中，尤其在五旬节派基督教中，指被认为来自神灵的、无法理解的言语现象，即‘说方言’。",
      "example_en": "During the service, some members began speaking in tongues.",
      "example_cn": "礼拜期间，一些信徒开始说方言。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "language",
      "analysis": "“Language” (语言) 是更正式、更广泛的术语，泛指任何人类交流系统，包括书面语、语法结构和词汇体系。而 “tongue” 更口语化，常用于非正式语境中指代某种语言，有时带有文化或情感色彩，如母语被称为 ‘mother tongue’。"
    },
    {
      "word_to_compare": "language",
      "analysis": "“Language” (语言) 是更正式、更广泛的术语，泛指任何人类交流系统，包括书面语、语法结构和词汇体系。而 “tongue” 更口语化，常用于非正式语境中指代某种语言，有时带有文化或情感色彩，如母语被称为 ‘mother tongue’。"
    },
    {
      "word_to_compare": "organ",
      "analysis": "“Organ” (器官) 是生物学中对身体功能结构的统称，如心脏、肺等，强调生理功能。而 “tongue” 作为器官的一种，特指口腔中的味觉与发音器官，语义更具体，且在非医学语境中常不被称作 ‘organ’。"
    },
    {
      "word_to_compare": "sliver",
      "analysis": "“Sliver” (薄片) 指细小、薄而长的碎片，如木屑或金属片，强调物理形态的碎片感。而 “tongue” 作为舌状物时，通常指具有功能性或结构性的延伸部分（如鞋舌、半岛），并非碎片，且常为整体的一部分。"
    }
  ]
}