{
  "word": "tonic",
  "pronunciation": "tahn·ik",
  "concise_definition": "n. 滋补品, 有提神作用的饮料, 语调的; adj. 有提神作用的, 滋补的",
  "forms": {
    "plural": "tonics"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A medicinal or health-promoting drink, traditionally used to improve digestion, boost energy, or restore general well-being, often containing herbs, minerals, or stimulants.",
      "explanation_cn": "一种药用或促进健康的饮料，传统上用于改善消化、增强精力或恢复整体健康，常含有草本、矿物质或兴奋剂成分。",
      "example_en": "She drank a bitter tonic every morning to aid her digestion.",
      "example_cn": "她每天早上喝一种苦味滋补剂以帮助消化。"
    },
    {
      "pos": "noun",
      "explanation_en": "A beverage, often carbonated and flavored, that is consumed for its refreshing or stimulating qualities, especially in the context of mixers in cocktails.",
      "explanation_cn": "一种碳酸饮料，通常带有风味，用于提神或解渴，尤其在鸡尾酒中作为混合基料使用。",
      "example_en": "Gin and tonic is a classic cocktail made with gin and tonic water.",
      "example_cn": "金酒加汤力水是一款经典的鸡尾酒，由金酒和汤力水调制而成。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Having a refreshing, invigorating, or restorative effect, especially on the mind or body.",
      "explanation_cn": "具有提神、振奋或恢复作用的，尤指对身心有益。",
      "example_en": "The mountain air provided a tonic for her tired spirit.",
      "example_cn": "山间的空气为她疲惫的精神带来了焕然一新的感觉。"
    },
    {
      "pos": "noun",
      "explanation_en": "In music, the first note of a diatonic scale, serving as the tonal center or foundation of a key.",
      "explanation_cn": "在音乐中，指一个音阶的第一个音，作为调性的中心或基础。",
      "example_en": "In the key of C major, C is the tonic.",
      "example_cn": "在C大调中，C音是主音。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "elixir",
      "analysis": "“Elixir”（灵丹妙药）通常指一种传说中能治愈百病或延长生命的神秘药水，带有神话或浪漫色彩；而 “tonic” 更偏向于实际使用的、有明确健康功效的日常滋补品，更现实和实用。"
    },
    {
      "word_to_compare": "stimulant",
      "analysis": "“Stimulant”（兴奋剂）专指能提高生理或神经活动的物质，如咖啡因或尼古丁，强调其药理作用；而 “tonic” 的范围更广，可包含提神饮料、心理恢复性体验，不一定具有直接的药理刺激性。"
    },
    {
      "word_to_compare": "refreshment",
      "analysis": "“Refreshment”（提神物）泛指任何能使人精神或身体恢复活力的东西，如饮料、休息或风景，语义更宽泛；而 “tonic” 更特指具有滋补或治疗性质的饮品或体验，带有更强的功能性含义。"
    }
  ]
}