{
  "word": "torment",
  "pronunciation": "tɔr·mənt",
  "concise_definition": "n. 折磨, 痛苦; v. 折磨, 使痛苦",
  "forms": {
    "third_person_singular": "torments",
    "past_tense": "tormented",
    "past_participle": "tormented",
    "present_participle": "tormenting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Severe physical or mental suffering, often caused by prolonged or intense pressure, cruelty, or distress.",
      "explanation_cn": "严重的身体或精神上的痛苦，通常由长期或强烈的压迫、残忍或困扰引起。",
      "example_en": "The prisoner endured years of torment in solitary confinement.",
      "example_cn": "这名囚犯在单独监禁中忍受了多年的折磨。"
    },
    {
      "pos": "noun",
      "explanation_en": "A source or cause of persistent anguish or distress, often used metaphorically to describe something that causes ongoing emotional pain.",
      "explanation_cn": "一种持续带来痛苦的根源或诱因，常用于比喻性地描述引发长期情感痛苦的事物。",
      "example_en": "His guilt became a constant torment, haunting him day and night.",
      "example_cn": "他的内疚成为一种持续的折磨，日夜萦绕着他。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause severe physical or emotional pain to someone, often deliberately or cruelly.",
      "explanation_cn": "有意或残忍地使某人遭受严重的身体或情感上的痛苦。",
      "example_en": "The bully tormented the new student with cruel jokes.",
      "example_cn": "那个霸凌者用恶毒的玩笑折磨新来的学生。"
    },
    {
      "pos": "verb",
      "explanation_en": "To disturb or afflict someone persistently with worry, doubt, or regret.",
      "explanation_cn": "以忧虑、怀疑或悔恨等情绪持续困扰或折磨某人。",
      "example_en": "She was tormented by doubts about whether she had made the right choice.",
      "example_cn": "她因怀疑自己是否做出了正确的选择而备受煎熬。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "punish",
      "analysis": "“Punish” (惩罚) 强调对错误行为施加的正式或制度性制裁，目的是纠正或威慑，通常具有道德或法律正当性。而 “torment” 更侧重于施加痛苦的过程本身，不一定有正当理由，常带有恶意或残忍的色彩。"
    },
    {
      "word_to_compare": "suffer",
      "analysis": "“Suffer” (遭受) 是一个中性词，指被动经历痛苦，不强调施加者或意图。而 “torment” 通常暗示有主动施加痛苦的主体，且痛苦是持续、刻意或残酷的。例如，一个人可以 suffer from illness（因病受苦），但只有被他人恶意对待时才可以说是被 torment。"
    },
    {
      "word_to_compare": "agony",
      "analysis": "“Agony” (极度痛苦) 是名词，指痛苦的状态或感受本身，强调强度和剧烈程度，但不包含施加行为。而 “torment” 既可以是名词（指痛苦的来源），也可以是动词（指施加痛苦的行为），具有更强的动态性和主动性。"
    }
  ]
}