{
  "word": "tormented",
  "pronunciation": "tɔr·mehn·tɪd",
  "concise_definition": "adj. 受折磨的, 痛苦的; v. 使痛苦, 拷打, 苦恼 (过去式和过去分词)",
  "forms": {
    "base_form": "torment",
    "third_person_singular": "torments",
    "past_tense": "tormented",
    "past_participle": "tormented",
    "present_participle": "tormenting"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Experiencing intense physical or emotional pain, often due to prolonged suffering, guilt, or inner conflict; characterized by anguish or distress.",
      "explanation_cn": "经历强烈的身体或情感痛苦，通常源于长期的折磨、内疚或内心冲突；表现出极度的痛苦或不安。",
      "example_en": "She was a tormented soul, haunted by memories of her childhood.",
      "example_cn": "她是一个饱受折磨的灵魂，被童年的回忆所困扰。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause someone severe physical or mental suffering, often deliberately or repeatedly; to harass or oppress with persistent pain or anxiety.",
      "explanation_cn": "故意或反复地使某人遭受严重的身体或精神痛苦；以持续的痛苦或焦虑折磨、骚扰或压迫。",
      "example_en": "The prisoner was tormented by guards who denied him sleep for days.",
      "example_cn": "这名囚犯被看守折磨得数日不得安眠。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be plagued or disturbed by a persistent thought, emotion, or fear, especially one that causes inner turmoil.",
      "explanation_cn": "被某种持续的想法、情绪或恐惧所困扰，尤其是那些引发内心动荡的念头。",
      "example_en": "He was tormented by doubt about whether he had made the right decision.",
      "example_cn": "他因怀疑自己是否做出了正确的决定而备受煎熬。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "agony",
      "analysis": "“Agony” (极度痛苦) 是一个名词，强调痛苦的极端状态，常用于描述身体或精神上的剧烈折磨，但不包含“施加”或“持续”的动作含义。而 “tormented” 作为形容词或动词，强调痛苦的来源和持续过程，常暗示有外部施加者或内在反复的折磨。"
    },
    {
      "word_to_compare": "distressed",
      "analysis": "“Distressed” (痛苦的、焦虑的) 语义较轻，多用于描述情绪上的不安或困扰，不一定涉及剧烈或长期的折磨。而 “tormented” 暗示更深层、更持久、甚至带有暴力或压迫性质的痛苦，情感强度更高。"
    },
    {
      "word_to_compare": "persecuted",
      "analysis": "“Persecuted” (迫害) 通常指因种族、宗教、政治等原因遭受系统性压迫或不公对待，强调社会或权力结构的恶意行为。而 “tormented” 更广泛，可包含心理、情感或自我折磨，不一定涉及外部压迫者，也可能是内在的挣扎。"
    }
  ]
}