{
  "word": "torpedo",
  "pronunciation": "tər·pē·dō",
  "concise_definition": "n. 鱼雷; v. 破坏, 摧毁",
  "forms": {
    "plural": "torpedoes",
    "third_person_singular": "torpedoes",
    "past_tense": "torpedoed",
    "past_participle": "torpedoed",
    "present_participle": "torpedoing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A self-propelled underwater weapon designed to explode upon contact with a ship or submarine, used primarily in naval warfare.",
      "explanation_cn": "一种自推进的水下武器，设计用于在接触舰船或潜艇时爆炸，主要用于海战。",
      "example_en": "The submarine launched a torpedo that struck the enemy battleship.",
      "example_cn": "这艘潜艇发射了一枚鱼雷，击中了敌方战列舰。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that unexpectedly ruins or sabotages a plan, project, or effort.",
      "explanation_cn": "指突然破坏或 sabotaging 某项计划、项目或努力的人或事物。",
      "example_en": "The last-minute budget cuts were a torpedo to the entire development timeline.",
      "example_cn": "最后一刻的预算削减彻底破坏了整个开发时间表。"
    },
    {
      "pos": "verb",
      "explanation_en": "To attack or destroy with a torpedo, especially in a military context.",
      "explanation_cn": "用鱼雷攻击或摧毁（尤指军事语境中）。",
      "example_en": "The destroyer torpedoed the enemy cruiser during the night engagement.",
      "example_cn": "驱逐舰在夜间交战中用鱼雷击沉了敌方巡洋舰。"
    },
    {
      "pos": "verb",
      "explanation_en": "To deliberately sabotage or destroy a plan, proposal, or initiative, often through underhanded or unexpected means.",
      "explanation_cn": "通过不正当或出人意料的手段蓄意破坏某项计划、提案或倡议。",
      "example_en": "His rivals torpedoed the reform bill by spreading false rumors about its author.",
      "example_cn": "他的对手通过散布关于提案作者的虚假谣言，破坏了这项改革法案。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "missile",
      "analysis": "“Missile”（导弹）是一个更广泛的术语，泛指任何由推进系统驱动、可远程制导的武器，可在空中、陆地或水中使用。而 “torpedo” 特指在水下运行的自推进武器，专用于攻击水下或水面目标。因此，所有 torpedo 都是 missile，但并非所有 missile 都是 torpedo。"
    },
    {
      "word_to_compare": "sabotage",
      "analysis": "“Sabotage”（破坏）是一个通用动词，指故意损坏或阻碍某事物，方式多样（如偷换零件、泄露信息等），不具特定工具或手段。而 “torpedo” 作为动词时，特指以突然、致命或毁灭性的方式破坏计划，常带有隐喻色彩，强调破坏的戏剧性和决定性。"
    },
    {
      "word_to_compare": "destroy",
      "analysis": "“Destroy”（摧毁）是通用动词，表示彻底毁坏，可指物理、情感或抽象层面的破坏，但不隐含特定方式或工具。而 “torpedo” 作为动词时，强调破坏是通过一种隐蔽、突然或策略性的手段实现的，常用于政治或商业语境，带有更强的意图性和阴谋色彩。"
    }
  ]
}