{
  "word": "torrent",
  "pronunciation": "tur·uhnt",
  "concise_definition": "n. 激流, 暴雨, 大量; v. 奔流, 猛冲",
  "forms": {
    "plural": "torrents"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A strong and fast-moving stream of water, often caused by heavy rain or melting snow, that rushes down a slope or channel.",
      "explanation_cn": "指由暴雨或融雪引起的、快速流动的强劲水流，通常沿山坡或河道奔涌而下。",
      "example_en": "The heavy rainfall caused a torrent to sweep through the valley.",
      "example_cn": "暴雨引发了山洪，冲垮了山谷。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large and overwhelming quantity of something, often moving rapidly or uncontrollably, such as emotions, words, or goods.",
      "explanation_cn": "指大量、汹涌而来的某物，常用于形容情感、言语或物品等以不可阻挡之势涌现。",
      "example_en": "A torrent of applause greeted the performer as she stepped on stage.",
      "example_cn": "表演者一登台，便迎来了如潮的掌声。"
    },
    {
      "pos": "noun",
      "explanation_en": "A method of distributing digital files over the internet using peer-to-peer (P2P) technology, where users share parts of the same file simultaneously.",
      "explanation_cn": "指一种利用点对点（P2P）技术在互联网上分发数字文件的方法，用户同时共享同一文件的不同部分。",
      "example_en": "He downloaded the movie using a torrent file from a shared network.",
      "example_cn": "他通过一个共享网络上的种子文件下载了这部电影。"
    },
    {
      "pos": "verb",
      "explanation_en": "To flow or move in a rapid, forceful, and uncontrolled manner, like a torrent of water.",
      "explanation_cn": "指像激流一样快速、猛烈且不受控制地流动或涌动。",
      "example_en": "Tears torrented down her face as she listened to the heartbreaking news.",
      "example_cn": "听到这个令人心碎的消息，泪水如泉涌般从她脸上流下。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "flood",
      "analysis": "“Flood” (洪水) 指大面积的水体淹没陆地，强调覆盖范围广、持续时间长，常为自然灾害；而 “torrent” 更强调水流的迅猛、集中和向下冲刷的动态，通常发生在狭窄通道或斜坡上，更具冲击力和速度感。"
    },
    {
      "word_to_compare": "deluge",
      "analysis": "“Deluge” (暴雨/洪流) 与 “torrent” 都可形容大量事物涌来，但 “deluge” 更常用于比喻性语境，如信息、请求的泛滥，语气更文学化；而 “torrent” 既可用于自然水流，也可用于比喻，但更强调物理上的速度和力量，更具视觉冲击力。"
    },
    {
      "word_to_compare": "stream",
      "analysis": "“Stream” (溪流) 指平稳、持续、缓慢流动的水体，常为自然、温和的意象；而 “torrent” 则是其极端反义词——湍急、猛烈、破坏性强。两者在速度、强度和情感色彩上形成鲜明对比。"
    },
    {
      "word_to_compare": "download",
      "analysis": "“Download” (下载) 是一个技术性动词，指从网络获取文件的单一动作；而 “torrent” 作为名词时指的是一种特定的文件分发机制，作为动词时则特指通过 P2P 网络进行的分布式下载，强调多人共享和并行传输，与普通下载有本质区别。"
    }
  ]
}