{
  "word": "tortured",
  "pronunciation": "tawr·chuhrd",
  "concise_definition": "adj. 受折磨的, 痛苦的; v. (torture 的过去式和过去分词) 拷问, 使痛苦",
  "forms": {
    "base_form": "torture",
    "past_tense": "tortured",
    "past_participle": "tortured",
    "present_participle": "torturing",
    "third_person_singular": "tortures"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing someone who has endured severe physical or emotional pain, often as a result of deliberate cruelty or prolonged suffering.",
      "explanation_cn": "形容某人经历了严重的身体或情感痛苦，通常源于蓄意的残忍或长期的煎熬。",
      "example_en": "The tortured prisoner spoke in whispers, his voice broken by days of abuse.",
      "example_cn": "那位受尽折磨的囚犯低声说话，他的声音因数日的虐待而嘶哑。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used figuratively to describe something that is overly strained, forced, or unnatural, especially in language, expression, or reasoning.",
      "explanation_cn": "比喻性地用于形容语言、表达或推理中过于牵强、做作或不自然的状态。",
      "example_en": "His tortured prose was filled with convoluted metaphors that obscured rather than clarified meaning.",
      "example_cn": "他的文字艰涩难懂，充斥着错综复杂的隐喻，反而掩盖了本意。"
    },
    {
      "pos": "verb",
      "explanation_en": "To inflict severe physical or mental pain on someone, typically to punish, extract information, or satisfy cruelty.",
      "explanation_cn": "对某人施加严重的身体或精神痛苦，通常用于惩罚、逼供或满足残忍的欲望。",
      "example_en": "The dictator tortured dissidents to silence opposition.",
      "example_cn": "独裁者拷问异见者以压制反对声音。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "maltreated",
      "analysis": "“Maltreated”（虐待）范围更广，泛指任何形式的不当对待，包括忽视、侮辱或粗暴行为，但不一定包含系统性或极端的肉体折磨。而 “tortured” 强调有意识、有目的的极端痛苦，通常涉及制度化或残忍的手段。"
    },
    {
      "word_to_compare": "suffered",
      "analysis": "“Suffered”（遭受）是一个中性词，泛指经历痛苦，可能是自然原因（如疾病、灾难）或人为因素，不隐含施害者的恶意。而 “tortured” 明确指向由他人蓄意施加的痛苦，带有强烈的道德谴责意味。"
    },
    {
      "word_to_compare": "strained",
      "analysis": "“Strained”（紧张的/勉强的）常用于形容语言或关系的不自然，与 “tortured” 在比喻义上部分重叠，但 “strained” 程度较轻，多指勉强维持或不够流畅；而 “tortured” 在比喻用法中暗示极度扭曲、令人不适，带有更强烈的负面评价。"
    }
  ]
}