{
  "word": "torture",
  "pronunciation": "tawr·cher",
  "concise_definition": "n. 酷刑, 折磨; v. 拷打, 使痛苦",
  "forms": {
    "third_person_singular": "tortures",
    "past_tense": "tortured",
    "past_participle": "tortured",
    "present_participle": "torturing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The deliberate infliction of severe physical or psychological pain on a person, typically to punish, obtain information, or instill fear.",
      "explanation_cn": "故意对他人施加严重的身体或心理痛苦，通常用于惩罚、逼供或制造恐惧。",
      "example_en": "The prisoner was subjected to torture during interrogation.",
      "example_cn": "这名囚犯在审讯期间遭受了酷刑。"
    },
    {
      "pos": "noun",
      "explanation_en": "A state of extreme mental or physical suffering, often used figuratively to describe prolonged distress or discomfort.",
      "explanation_cn": "一种极度的精神或身体痛苦状态，常用于比喻性地描述长期的折磨或不适。",
      "example_en": "Waiting for the results was a torture she could hardly bear.",
      "example_cn": "等待结果对她来说是一种难以忍受的折磨。"
    },
    {
      "pos": "verb",
      "explanation_en": "To subject someone to severe physical or psychological pain, especially as a form of punishment or coercion.",
      "explanation_cn": "对某人施加严重的身体或心理痛苦，尤指作为一种惩罚或胁迫手段。",
      "example_en": "The regime was accused of torturing political dissidents.",
      "example_cn": "该政权被指控酷刑对待政治异见者。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause persistent mental anguish or physical discomfort; to torment or distress intensely.",
      "explanation_cn": "造成持续的精神痛苦或身体不适；极度折磨或困扰。",
      "example_en": "He was tortured by guilt over his brother's death.",
      "example_cn": "他因兄弟的死而深感内疚，备受煎熬。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "punish",
      "analysis": "“Punish”（惩罚）是一个更广泛的术语，指对错误行为施加后果，可以是轻微的（如罚款）或严厉的（如监禁），但不一定涉及身体或精神上的极端痛苦。而 “torture” 特指以造成极端痛苦为目的，通常违反基本人权，具有非人道性质。"
    },
    {
      "word_to_compare": "torment",
      "analysis": "“Torment”（折磨）与 “torture” 意义接近，常用于心理层面的持续痛苦，如内疚、焦虑或情感创伤。它更常用于比喻或非物理性情境，而 “torture” 更强调系统性、有意识的施暴行为，尤其在法律和人权语境中具有更严重的含义。"
    },
    {
      "word_to_compare": "suffer",
      "analysis": "“Suffer”（遭受）是一个中性词，泛指经历痛苦、困难或不幸，可能是被动的、自然的或非人为的（如生病、自然灾害）。而 “torture” 明确指向由他人故意施加的、有目的的极端痛苦，具有强烈的道德和法律谴责色彩。"
    }
  ]
}