{
  "word": "tougher",
  "pronunciation": "tuf·er",
  "concise_definition": "adj. 更坚韧的, 更艰难的, 更强硬的",
  "forms": {
    "base_form": "tough",
    "comparative": "tougher",
    "superlative": "toughest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "More resilient, durable, or able to withstand hardship, pressure, or physical stress than before; describing something that is harder to damage, break, or defeat.",
      "explanation_cn": "比以往更具韧性、耐久性，或更能承受困难、压力或物理冲击；形容某物更难被损坏、折断或击败。",
      "example_en": "This new material is tougher than steel and can survive extreme temperatures.",
      "example_cn": "这种新材料比钢铁更坚韧，能承受极端温度。"
    },
    {
      "pos": "adjective",
      "explanation_en": "More difficult, challenging, or demanding in terms of effort, endurance, or emotional strength; describing a situation or task that has become harder to endure or complete.",
      "explanation_cn": "在努力、耐力或心理承受力方面更具难度、挑战性或苛刻性；形容某种情况或任务变得更加难以忍受或完成。",
      "example_en": "The last quarter of the game was tougher than any we've played this season.",
      "example_cn": "比赛的最后一节比我们本赛季打过的任何一节都更艰难。"
    },
    {
      "pos": "adjective",
      "explanation_en": "More strict, uncompromising, or severe in attitude, policy, or enforcement; describing a person or system that has become less lenient.",
      "explanation_cn": "在态度、政策或执行上更严格、不妥协或更严厉；形容某人或某种制度变得更加不宽容。",
      "example_en": "The government has introduced tougher immigration laws to reduce illegal entry.",
      "example_cn": "政府出台了更严格的移民法律以减少非法入境。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "harder",
      "analysis": "“Harder” (更难的) 主要强调任务、努力或物理阻力的增加，侧重于“难度”或“费力程度”，常用于体力或认知层面。而 “tougher” 不仅包含难度，还隐含了“坚韧、耐受、顽强”的意味，常用于描述人或事物在逆境中的承受能力。"
    },
    {
      "word_to_compare": "stronger",
      "analysis": "“Stronger” (更强的) 侧重于力量、能力或强度的提升，通常用于肌肉力量、逻辑论证或情感支持等场景。而 “tougher” 更强调在压力、困难或恶劣环境下的持久性和抗压性，不一定是力量更大，而是更不容易被击垮。"
    },
    {
      "word_to_compare": "sterner",
      "analysis": "“Stern” (严厉的) 专指态度、纪律或规则上的严格和不苟言笑，常用于道德或管理语境。而 “tougher” 在此语义上更宽泛，可包含严厉，但也可用于描述物理耐久性或情境困难性，适用范围更广。"
    }
  ]
}