{
  "word": "tough",
  "pronunciation": "tuf",
  "concise_definition": "adj. 坚韧的, 困难的, 粗糙的, 严厉的",
  "forms": {
    "comparative": "tougher",
    "superlative": "toughest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Physically strong and resilient; able to withstand hardship, pressure, or damage without breaking or giving way.",
      "explanation_cn": "身体上强壮且有韧性；能够承受困难、压力或损伤而不破裂或屈服。",
      "example_en": "The hikers wore tough boots to handle the rocky terrain.",
      "example_cn": "徒步者穿着坚固的靴子以应对崎岖的地形。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Difficult to deal with, understand, or accomplish; challenging or demanding.",
      "explanation_cn": "难以处理、理解或完成的；具有挑战性或要求高的。",
      "example_en": "It was a tough exam that tested everyone's knowledge and patience.",
      "example_cn": "这是一场艰难的考试，考验了每个人的学识和耐心。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Not easily cut, chewed, or digested; having a firm or fibrous texture.",
      "explanation_cn": "不易切割、咀嚼或消化的；质地坚硬或纤维多的。",
      "example_en": "The steak was so tough that I couldn't chew it properly.",
      "example_cn": "这块牛排太硬了，我根本没法好好咀嚼。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Strict, unyielding, or harsh in attitude, discipline, or treatment; not easily swayed by emotion.",
      "explanation_cn": "态度、纪律或处理方式严格、不妥协或严厉的；不易被情感左右。",
      "example_en": "The judge was known for her tough stance on crime.",
      "example_cn": "这位法官以对犯罪采取严厉立场而闻名。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used informally to describe someone who is emotionally resilient or uncomplaining in the face of adversity.",
      "explanation_cn": "非正式用法，形容在逆境中情绪坚韧、不抱怨的人。",
      "example_en": "She's a tough old bird—never lets anything get her down.",
      "example_cn": "她是个坚强的老太太，从不被任何事打倒。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hard",
      "analysis": "“Hard” (坚硬的/困难的) 更侧重于物理硬度或抽象意义上的困难，常用于描述物体的质地或任务的难度，但情感色彩较中性。而 “tough” 不仅包含困难，还隐含了持久承受压力、坚韧不拔的意味，情感上更强调耐力和韧性。"
    },
    {
      "word_to_compare": "strong",
      "analysis": "“Strong” (强壮的) 强调力量、能力或结构的稳固性，常用于描述肌肉力量、逻辑论证或经济实力。而 “tough” 更强调在恶劣条件下持续生存或运作的能力，是抗压性而非纯粹力量的体现。"
    },
    {
      "word_to_compare": "rough",
      "analysis": "“Rough” (粗糙的) 主要描述表面不平滑或情况不稳定，如粗糙的木头或动荡的局势。它侧重于感官或状态的不精细，而 “tough” 更强调承受力和坚韧性，即使表面粗糙，也可能很坚韧。"
    },
    {
      "word_to_compare": "stern",
      "analysis": "“Stern” (严厉的) 专指态度、表情或规则的严肃和不宽容，常用于形容人或制度，带有道德或权威色彩。而 “tough” 的严厉更广泛，可应用于规则、环境、身体条件等，不一定涉及道德判断。"
    }
  ]
}