{
  "word": "tournaments",
  "pronunciation": "towr·nuh·muhnts",
  "concise_definition": "n. 比赛, 锦标赛, 竞技大赛",
  "forms": {
    "singular": "tournament"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A structured competition involving multiple participants or teams, typically organized in a series of rounds or matches, where winners advance until a final champion is determined.",
      "explanation_cn": "指由多名参赛者或团队参与的有组织的竞赛，通常以多轮比赛的形式进行，胜者晋级，直至决出最终冠军。",
      "example_en": "The tennis tournament attracted top players from around the world.",
      "example_cn": "这场网球锦标赛吸引了来自世界各地的顶尖选手。"
    },
    {
      "pos": "noun",
      "explanation_en": "A series of contests or events held over a period of time, often with a prize or title at stake, especially in sports, games, or intellectual challenges.",
      "explanation_cn": "指在一段时间内举行的一系列竞赛或活动，通常伴有奖品或头衔，尤指体育、游戏或智力挑战类赛事。",
      "example_en": "She won the chess tournament and earned the title of national master.",
      "example_cn": "她赢得了国际象棋锦标赛，并获得了国家大师头衔。"
    },
    {
      "pos": "noun",
      "explanation_en": "Historically, a medieval contest of skill among knights, involving jousting and other martial exercises, often held to celebrate special occasions.",
      "explanation_cn": "历史上指中世纪骑士之间举行的技能比试，包括马上长矛比武和其他武艺表演，常为庆祝特殊场合而举办。",
      "example_en": "The king hosted a grand tournament to celebrate his coronation.",
      "example_cn": "国王举办了一场盛大的骑士锦标赛以庆祝加冕。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "competition",
      "analysis": "“Competition”（竞赛）是一个更广泛的术语，泛指任何形式的比拼，可以是个人之间的较量，也可以是非正式的比试，不一定有明确的赛制或晋级规则。而 “tournament” 特指有组织、多轮次、淘汰制或积分制的正式赛事，结构更严谨。"
    },
    {
      "word_to_compare": "championship",
      "analysis": "“Championship”（锦标赛/冠军赛）强调的是争夺冠军头衔的最终赛事或系列赛，常作为一项赛事的最高阶段或最终目标。而 “tournament” 可以指整个赛事过程，包括预选赛、小组赛和决赛，不一定以‘冠军’为唯一焦点。"
    },
    {
      "word_to_compare": "league",
      "analysis": "“League”（联赛）通常指由固定队伍在一段时间内进行循环赛的长期赛事体系，每支队伍与其他队伍多次交手，最终按积分排名。而 “tournament” 多为短期、淘汰制或单循环赛，以决出单一冠军为目的，结构更紧凑。"
    }
  ]
}