{
  "word": "tour",
  "pronunciation": "toor",
  "concise_definition": "n. 巡回, 旅行, 参观; v. 巡游, 巡回访问",
  "forms": {
    "plural": "tours",
    "third_person_singular": "tours",
    "past_tense": "toured",
    "past_participle": "toured",
    "present_participle": "touring"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A journey or trip, often planned and organized, during which a person or group visits several places, typically for leisure, education, or inspection.",
      "explanation_cn": "指有计划、有组织的旅行，通常涉及访问多个地点，目的是休闲、教育或考察。",
      "example_en": "We went on a guided tour of the ancient ruins last summer.",
      "example_cn": "去年夏天，我们参加了古代遗址的导览游。"
    },
    {
      "pos": "noun",
      "explanation_en": "A series of public performances or appearances by an artist, band, or speaker in different locations, often as part of a promotional campaign.",
      "explanation_cn": "指艺术家、乐队或演讲者在不同地点进行的一系列公开演出或亮相，通常作为宣传计划的一部分。",
      "example_en": "The band is embarking on a world tour to promote their new album.",
      "example_cn": "这支乐队即将展开世界巡演，以推广他们的新专辑。"
    },
    {
      "pos": "noun",
      "explanation_en": "An official visit or inspection of a place, especially by a person in authority, to observe conditions or gather information.",
      "explanation_cn": "指由权威人士进行的正式访问或视察，以观察情况或收集信息。",
      "example_en": "The mayor made a surprise tour of the city's public schools.",
      "example_cn": "市长对市内的公立学校进行了突击视察。"
    },
    {
      "pos": "verb",
      "explanation_en": "To travel through a place or series of places, especially for the purpose of visiting, performing, or inspecting.",
      "explanation_cn": "指为了参观、演出或视察而穿越某个地方或一系列地方。",
      "example_en": "She toured Europe for three months, visiting every major museum.",
      "example_cn": "她游历欧洲三个月，参观了每一座主要博物馆。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "trip",
      "analysis": "“Trip”（旅行）是一个更宽泛、更通用的词，泛指任何从一地到另一地的出行，可能没有明确的路线或目的。而 “tour” 强调有组织、有计划地访问多个地点，通常包含特定目的，如观光、演出或考察。"
    },
    {
      "word_to_compare": "voyage",
      "analysis": "“Voyage”（航行/远航）通常指长距离、跨区域的旅行，尤其强调海上或太空旅行，带有探索或冒险的意味。而 “tour” 更常用于陆地上的短期、多站点的行程，且多为休闲或商业目的。"
    },
    {
      "word_to_compare": "excursion",
      "analysis": "“Excursion”（短途旅行）通常指时间较短、距离较近的出游，常为一日游或教育性参观，语气更轻松随意。而 “tour” 可以是短期或长期，范围更广，且常涉及商业组织或专业安排。"
    }
  ]
}