{
  "word": "towards",
  "pronunciation": "tuh·wawrdz",
  "concise_definition": "prep. 朝, 向, 向着, 接近",
  "forms": {
    "none": "无词形变化（介词）"
  },
  "definitions": [
    {
      "pos": "preposition",
      "explanation_en": "Indicating direction or movement in the direction of a person, place, thing, or abstract goal; implies motion or orientation toward a target.",
      "explanation_cn": "表示朝向某人、某地、某物或某种抽象目标的方向或运动；暗示朝向某一目标的移动或定位。",
      "example_en": "She walked towards the door, hoping no one would notice her.",
      "example_cn": "她朝门走去，希望没人注意到她。"
    },
    {
      "pos": "preposition",
      "explanation_en": "Expressing attitude, interest, or emotional orientation toward someone or something; often used with feelings, opinions, or efforts.",
      "explanation_cn": "表达对某人或某事的态度、兴趣或情感倾向；常用于描述情感、观点或努力的方向。",
      "example_en": "He has always shown kindness towards strangers.",
      "example_cn": "他一直对陌生人表现出善意。"
    },
    {
      "pos": "preposition",
      "explanation_en": "Indicating proximity or approach to a state, condition, or point in time; suggests movement toward completion or realization.",
      "explanation_cn": "表示接近某种状态、条件或时间点；暗示向完成或实现的进展。",
      "example_en": "The project is towards completion, but we still need to finalize the budget.",
      "example_cn": "这个项目即将完成，但我们仍需最终确定预算。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "to",
      "analysis": "“To” 是一个更通用的介词或不定式标记，可表示方向、目的、接收者或时间终点。当表示方向时，两者常可互换（如 go to/towards the station），但 “to” 暗示到达终点，而 “towards” 仅表示朝向，不一定到达。例如 “He ran to the exit”（他跑到了出口），而 “He ran towards the exit”（他朝出口跑去，但可能没到）。"
    },
    {
      "word_to_compare": "in the direction of",
      "analysis": "“In the direction of” 是 “towards” 的更正式、更冗长的表达方式，语义几乎完全相同，但更强调精确的方位指引，常用于技术或导航语境。例如：The plane is flying in the direction of New York。相比之下， “towards” 更口语化、简洁，使用频率更高。"
    },
    {
      "word_to_compare": "for",
      "analysis": "“For” 表示目的、受益对象或目标，但不强调空间或动作的方向性。例如 “I bought this gift for you”（我为你买了这个礼物），强调受益者，而非移动方向。而 “towards” 强调物理或抽象的朝向，如 “She worked hard towards her goals”（她为实现目标而努力），强调努力的方向性，而非目的本身。"
    }
  ]
}