{
  "word": "towers",
  "pronunciation": "tow·erz",
  "concise_definition": "n. 塔, 高楼, 塔状物",
  "forms": {
    "singular": "tower"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A tall, narrow structure, often built for religious, defensive, observational, or communication purposes, rising prominently above its surroundings.",
      "explanation_cn": "一种高而窄的结构，通常用于宗教、防御、观察或通信目的，显著地高耸于周围环境之上。",
      "example_en": "The Eiffel Tower is one of the most iconic landmarks in Paris.",
      "example_cn": "埃菲尔铁塔是巴黎最著名的地标之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A tall building, especially one that is much taller than surrounding structures, often used for offices or residential purposes.",
      "explanation_cn": "一种高层建筑，尤其是比周围建筑高得多的楼，常用于办公或住宅用途。",
      "example_en": "She works in a glass tower downtown that overlooks the river.",
      "example_cn": "她在市中心一座俯瞰河流的玻璃高楼里上班。"
    },
    {
      "pos": "noun",
      "explanation_en": "In chess, a piece that moves horizontally or vertically any number of squares, also called a rook.",
      "explanation_cn": "在国际象棋中，一种可沿水平或垂直方向任意格数移动的棋子，也称为“车”。",
      "example_en": "The player moved his tower to the center of the board to control the open file.",
      "example_cn": "这位棋手将他的车移到棋盘中央，以控制开放线。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large, often cylindrical structure used in industrial settings, such as a smokestack or cooling tower.",
      "explanation_cn": "工业环境中使用的一种大型圆柱形结构，如烟囱或冷却塔。",
      "example_en": "The power plant's cooling towers released plumes of steam into the cold air.",
      "example_cn": "发电厂的冷却塔向寒冷的空气中喷出大量蒸汽。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "building",
      "analysis": "“Building”（建筑物）是一个泛指所有人工建造结构的词，包括住宅、商店、工厂等，不强调高度或形态。而 “tower” 特指高耸、细长的结构，具有显著的垂直性，通常在视觉上突出于周围环境。"
    },
    {
      "word_to_compare": "spire",
      "analysis": "“Spire”（尖顶）特指建筑顶部细长、尖锐的锥形结构，通常是教堂或宗教建筑的一部分，强调尖端形态而非整体高度。而 “tower” 是一个完整的、独立的垂直结构，可能包含多个楼层，功能更广泛。"
    },
    {
      "word_to_compare": "skyscraper",
      "analysis": "“Skyscraper”（摩天大楼）是现代城市中极高、多层的建筑，主要用于办公或居住，强调的是规模和密度。而 “tower” 可以是任何高度的高耸结构，不一定有多个功能楼层，例如通信塔或灯塔，其用途更广泛，形态更自由。"
    }
  ]
}