{
  "word": "tower",
  "pronunciation": "tau·er",
  "concise_definition": "n. 塔, 高楼; v. 高耸, 俯视",
  "forms": {
    "plural": "towers",
    "third_person_singular": "towers",
    "past_tense": "towered",
    "past_participle": "towered",
    "present_participle": "towering"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A tall, narrow building or structure, often standing alone or as part of a larger building, typically used for observation, defense, religious purposes, or as a landmark.",
      "explanation_cn": "一种高而窄的建筑物或结构，通常独立存在或作为更大建筑的一部分，常用于观察、防御、宗教用途或作为地标。",
      "example_en": "The Eiffel Tower is one of the most famous landmarks in Paris.",
      "example_cn": "埃菲尔铁塔是巴黎最著名的地标之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large, often cylindrical structure used to support antennas, water tanks, or other equipment, especially in industrial or communication contexts.",
      "explanation_cn": "一种大型的、通常呈圆柱形的结构，用于支撑天线、水箱或其他设备，尤其在工业或通信环境中。",
      "example_en": "Cell phone towers are scattered across the countryside to ensure network coverage.",
      "example_cn": "为了确保网络覆盖，乡村各地散布着许多手机信号塔。"
    },
    {
      "pos": "verb",
      "explanation_en": "To stand or rise high above surrounding objects, often implying dominance, intimidation, or impressive height.",
      "explanation_cn": "高耸于周围物体之上，常暗示着主导地位、威慑力或令人印象深刻的高度。",
      "example_en": "The ancient castle towered over the small village below.",
      "example_cn": "古老的城堡高高耸立在下方的小村庄之上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be positioned in a way that gives one a commanding or superior view over others, often metaphorically.",
      "explanation_cn": "以某种方式占据位置，使自己对他人拥有主导或优越的视角，常用于比喻意义。",
      "example_en": "In the debate, she towered over her opponents with her clear logic and deep knowledge.",
      "example_cn": "在辩论中，她凭借清晰的逻辑和渊博的知识压倒了对手。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "building",
      "analysis": "“Building”（建筑物）是一个泛指所有人工构造物的词，包括住宅、办公楼、工厂等，结构和用途多样，不一定高大。而 “tower” 特指高而窄的结构，强调垂直高度和视觉上的突出性，通常具有特定功能或象征意义。"
    },
    {
      "word_to_compare": "skyscraper",
      "analysis": "“Skyscraper”（摩天大楼）指现代城市中极高、多层的商业或住宅建筑，强调内部空间的利用和功能性。而 “tower” 可以是实心的、非居住的，如通信塔或钟楼，不一定有楼层结构，更侧重于形态和高度本身。"
    },
    {
      "word_to_compare": "mountain",
      "analysis": "“Mountain”（山）是自然形成的巨大陆地隆起，规模远大于人造塔，且形成过程缓慢。虽然两者都可表示“高耸”，但 “tower” 是人工建造、具有明确目的的结构，而 “mountain” 是自然地貌，无功能性意图。"
    }
  ]
}