{
  "word": "township",
  "pronunciation": "town·ship",
  "concise_definition": "n. 镇区, 乡, 市镇",
  "forms": {
    "plural": "townships"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small administrative division in some countries, especially in the United States and Canada, typically governed locally and often encompassing a rural area with a small population center.",
      "explanation_cn": "在某些国家（尤其是美国和加拿大）的一种小型行政区划，通常由本地政府管理，涵盖一个拥有小型人口中心的乡村地区。",
      "example_en": "The township held its annual meeting to discuss road repairs and school funding.",
      "example_cn": "该镇区召开了年度会议，讨论道路维修和学校经费问题。"
    },
    {
      "pos": "noun",
      "explanation_en": "A community or settlement that has developed into a distinct local entity, often with its own identity, even if not officially incorporated as a town.",
      "explanation_cn": "一个已发展成具有独特身份的社区或聚居地，即使未被正式划为城镇，也常被视为一个独立的地方单位。",
      "example_en": "Maplewood Township, though small, has its own post office and fire department.",
      "example_cn": "枫树镇区虽小，却拥有自己的邮局和消防队。"
    },
    {
      "pos": "noun",
      "explanation_en": "In South Africa, a historically segregated urban area designated for non-white populations during apartheid, often characterized by dense housing and limited infrastructure.",
      "explanation_cn": "在南非，指种族隔离时期为非白人居民划定的都市区域，通常人口密集、基础设施匮乏。",
      "example_en": "Soweto, a famous township near Johannesburg, played a central role in the anti-apartheid movement.",
      "example_cn": "位于约翰内斯堡附近的著名镇区索韦托，在反种族隔离运动中发挥了核心作用。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "town",
      "analysis": "“Town”（城镇）通常指一个具有正式行政地位、人口规模较大、基础设施较完善的定居点，常有明确的边界和政府机构。而 “township” 可以是未正式建制的乡村区域，规模更小，行政功能较弱，有时甚至只是地理或统计上的划分。"
    },
    {
      "word_to_compare": "village",
      "analysis": "“Village”（村庄）强调一个小型、传统、以农业或社区生活为主的聚居地，通常具有紧密的社会关系和文化传统。而 “township” 更侧重行政或地理划分，可能包含多个村庄或分散的居民点，且在某些国家（如美国）是政府管理单位，不必然具有村庄的乡土特征。"
    },
    {
      "word_to_compare": "district",
      "analysis": "“District”（区）是一个更广泛、更通用的行政或功能分区术语，可用于城市、教育、选举等多种语境，范围可大可小。而 “township” 是一种特定类型的基层行政区，通常用于农村或郊区，具有明确的地域性和地方治理结构，范围比一般意义上的 “district” 更具体、更地方化。"
    }
  ]
}