{
  "word": "townships",
  "pronunciation": "town·shipz",
  "concise_definition": "n. 乡镇, 镇区, 基层行政区划",
  "forms": {
    "singular": "township"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small administrative division, especially in the United States and Canada, often covering a rural area and serving as a local unit of government below the county level.",
      "explanation_cn": "一种小型行政区域，尤其在美国和加拿大，通常覆盖乡村地区，作为低于县一级的地方政府单位。",
      "example_en": "The township board met to discuss road maintenance and local zoning laws.",
      "example_cn": "镇区委员会召开会议，讨论道路维护和地方分区法规。"
    },
    {
      "pos": "noun",
      "explanation_en": "A geographic area of land, typically six miles by six miles, used in the U.S. Public Land Survey System to define property boundaries and land ownership.",
      "explanation_cn": "在美国公共土地测量系统中，用于界定地产边界和土地所有权的一块地理区域，通常为六英里乘六英里的正方形。",
      "example_en": "The farm is located in Township 12 North, Range 5 West, according to the land survey records.",
      "example_cn": "根据土地测量记录，这片农场位于北12镇区、西5范围。"
    },
    {
      "pos": "noun",
      "explanation_en": "A community or settlement that has developed around a central point, such as a post office or school, and is recognized informally as a distinct local area, even if not officially incorporated.",
      "explanation_cn": "围绕某个中心点（如邮局或学校）发展起来的社区或聚居地，即使未正式建制，也被非正式地视为一个独特的本地区域。",
      "example_en": "Although not an official town, the locals still refer to this area as Maple Township because of its historic schoolhouse.",
      "example_cn": "尽管这不是一个正式的城镇，但当地人仍称这片区域为枫树镇区，因其拥有一座历史悠久的校舍。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "town",
      "analysis": "“Town”（城镇）通常指一个具有较高人口密度、更完善基础设施和正式建制的居民点，拥有自己的市政府。而 “township” 可以是未建制的乡村区域，行政功能较弱，甚至可能没有独立政府，仅作为地理或统计单位存在。"
    },
    {
      "word_to_compare": "county",
      "analysis": "“County”（县）是比 “township” 更高一级的行政区划，通常包含多个乡镇、城镇和乡村地区，负责更广泛的公共服务（如法院、警察、公共卫生）。Township 是 county 的下属单位，职能更局部化。"
    },
    {
      "word_to_compare": "village",
      "analysis": "“Village”（村庄）强调的是一个小型聚居地，通常人口较少，具有社区认同感，但不一定具有行政职能。而 “township” 更侧重于行政或土地测量的官方划分，即使该区域没有明显的人口聚居中心。"
    }
  ]
}