{
  "word": "toy",
  "pronunciation": "toy",
  "concise_definition": "n. 玩具, 小玩意儿; v. 玩弄, 摆弄",
  "forms": {
    "plural": "toys"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An object designed for children to play with, typically intended to entertain, educate, or stimulate imagination and physical development.",
      "explanation_cn": "专为儿童设计的用于玩耍的物品，通常旨在提供娱乐、教育或刺激想象力与身体发育。",
      "example_en": "The child opened her birthday presents and found a new teddy bear and a toy train.",
      "example_cn": "孩子打开生日礼物，发现了一个新的泰迪熊和一辆玩具火车。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, often decorative or non-essential object that is used for amusement or as a collector's item, sometimes implying triviality or lack of serious purpose.",
      "explanation_cn": "一种小型、常用于装饰或非必需的物品，用于娱乐或收藏，有时暗示其琐碎或缺乏严肃用途。",
      "example_en": "He collected vintage cameras as toys, not for practical use.",
      "example_cn": "他收藏古董相机作为玩物，并非为了实际使用。"
    },
    {
      "pos": "verb",
      "explanation_en": "To handle or play with something casually or without serious intent, often implying aimless or distracted behavior.",
      "explanation_cn": "随意地摆弄或玩弄某物，通常暗示无目的或心不在焉的行为。",
      "example_en": "She was just toyed with the pen while thinking about her next move.",
      "example_cn": "她一边思考下一步行动，一边随手摆弄着钢笔。"
    },
    {
      "pos": "verb",
      "explanation_en": "To experiment with or explore an idea, option, or possibility in a casual or tentative way.",
      "explanation_cn": "以随意或试探性的方式尝试、探索某个想法、选项或可能性。",
      "example_en": "They're toyed with the idea of moving to the countryside but haven't made a decision yet.",
      "example_cn": "他们曾考虑过搬到乡下，但尚未做出决定。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "game",
      "analysis": "“Game”（游戏）通常指具有明确规则、目标和竞争性的活动，强调结构化和互动性，如棋类或电子游戏。而 “toy” 更强调开放性、自由探索和无规则的玩耍，不必然包含胜负机制。"
    },
    {
      "word_to_compare": "gadget",
      "analysis": "“Gadget”（小装置）指具有特定功能的微型技术设备，如智能手环或便携充电器，强调实用性和技术性。而 “toy” 更侧重娱乐性，即使有技术成分（如遥控车），其主要目的仍是消遣而非功能实现。"
    },
    {
      "word_to_compare": "trifle",
      "analysis": "“Trifle”（琐事）作为名词时指微不足道的事物，常带贬义，强调无价值或不重要。而 “toy” 虽有时也暗示轻浮，但本身是中性词，甚至可带有情感价值（如童年玩具）。作为动词时，“trifle” 指轻率对待，而 “toy with” 更强调试探性地思考或摆弄，语义更丰富。"
    }
  ]
}