{
  "word": "traced",
  "pronunciation": "traysd",
  "concise_definition": "v. 追溯, 追踪, 描绘, 临摹",
  "forms": {
    "base_form": "trace",
    "third_person_singular": "traces",
    "past_tense": "traced",
    "past_participle": "traced",
    "present_participle": "tracing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To find the origin or path of something by investigating its history or progression, often through evidence or clues.",
      "explanation_cn": "通过调查其历史或发展过程，寻找某事物的起源或路径，通常依赖于证据或线索。",
      "example_en": "Investigators traced the source of the leak to a former employee.",
      "example_cn": "调查人员将泄露的源头追溯到了一名前雇员。"
    },
    {
      "pos": "verb",
      "explanation_en": "To follow the movement or route of someone or something, often secretly or carefully.",
      "explanation_cn": "仔细或秘密地追踪某人或某物的移动路线或行踪。",
      "example_en": "The police traced the suspect’s car using GPS data.",
      "example_cn": "警方利用GPS数据追踪了嫌疑人的车辆。"
    },
    {
      "pos": "verb",
      "explanation_en": "To draw or outline something by following an existing line or pattern, such as copying a design or sketch.",
      "explanation_cn": "通过沿着现有的线条或图案描画，来绘制或勾勒某物，例如临摹设计或草图。",
      "example_en": "She traced the outline of the flower from the textbook.",
      "example_cn": "她从教科书中临摹了花朵的轮廓。"
    },
    {
      "pos": "verb",
      "explanation_en": "To detect or identify the presence of something by subtle signs or remnants, often in a metaphorical sense.",
      "explanation_cn": "通过细微的迹象或残留物来察觉或识别某物的存在，常用于比喻意义。",
      "example_en": "You can still trace the influence of classical music in modern jazz.",
      "example_cn": "你仍能在现代爵士乐中追溯到古典音乐的影响。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "track",
      "analysis": "“Track” (追踪) 更强调持续监控或记录某物的移动或状态，常用于实时或动态场景，如追踪包裹、运动员表现。而 “trace” 更侧重于回溯过去，寻找起点或来源，具有更强的历史性和调查性。"
    },
    {
      "word_to_compare": "follow",
      "analysis": "“Follow” (跟随) 通常指在某人或某物之后移动，强调连续性和空间上的紧随，如跟随某人走路。而 “trace” 更多用于抽象路径或因果关系的回溯，不一定涉及物理移动，且常隐含发现或还原的过程。"
    },
    {
      "word_to_compare": "derive",
      "analysis": "“Derive” (推导/源自) 强调通过逻辑、数学或语言分析得出结论或来源，常用于理论或学术语境，如“derive a formula”。而 “trace” 更偏向于通过证据、线索或历史记录进行实际的溯源，更具体、更经验性。"
    }
  ]
}