{
  "word": "track",
  "pronunciation": "trak",
  "concise_definition": "n. 轨道, 路径, 跟踪; v. 跟踪, 追踪, 记录",
  "forms": {
    "third_person_singular": "tracks",
    "past_tense": "tracked",
    "past_participle": "tracked",
    "present_participle": "tracking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A path or route along which something moves or has moved, especially a prepared surface for trains, cars, or athletes.",
      "explanation_cn": "指某物移动所经过的路径或路线，尤指为火车、汽车或运动员铺设的专用道。",
      "example_en": "The train ran smoothly along the track.",
      "example_cn": "火车沿着轨道平稳行驶。"
    },
    {
      "pos": "noun",
      "explanation_en": "A course or path of development, progress, or activity; often used metaphorically to describe a direction in life or work.",
      "explanation_cn": "指发展、进步或活动的路径或方向，常用于比喻人生或职业的轨迹。",
      "example_en": "She switched tracks from law to journalism after graduation.",
      "example_cn": "她毕业后从法律转行到了新闻业。"
    },
    {
      "pos": "noun",
      "explanation_en": "A single piece of recorded music on an album or playlist.",
      "explanation_cn": "指专辑或播放列表中的一首独立录音歌曲。",
      "example_en": "My favorite track on the album is the third one.",
      "example_cn": "这张专辑我最喜欢的是第三首歌。"
    },
    {
      "pos": "verb",
      "explanation_en": "To follow the movement, progress, or location of someone or something over time, often using records or technology.",
      "explanation_cn": "指随着时间推移，通过记录或技术手段追踪某人或某物的移动、进展或位置。",
      "example_en": "The police tracked the suspect’s phone to locate him.",
      "example_cn": "警方通过追踪嫌疑人的手机找到了他的位置。"
    },
    {
      "pos": "verb",
      "explanation_en": "To record or monitor the occurrence, progress, or performance of something systematically.",
      "explanation_cn": "指系统性地记录或监控某事物的发生、进展或表现。",
      "example_en": "The school tracks student attendance daily.",
      "example_cn": "学校每天记录学生的出勤情况。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "path",
      "analysis": "“Path” (路径) 是一个更通用的词，泛指任何从一点到另一点的路线，可以是物理的或比喻的，但不强调被追踪或记录的过程。而 “track” 更常暗示有明确的轨迹、可被追踪或记录，尤其在技术或监控语境中。"
    },
    {
      "word_to_compare": "trail",
      "analysis": "“Trail” (踪迹/小径) 通常指自然形成的路径或遗留下来的痕迹，如动物足迹或徒步小径，带有较弱的人工干预色彩。而 “track” 更常用于人工铺设的路线或主动追踪行为，语义上更正式、更系统化。"
    },
    {
      "word_to_compare": "monitor",
      "analysis": "“Monitor” (监控) 强调持续观察和检查状态，通常用于系统、数据或健康状况，不必然包含移动或位置的追踪。而 “track” 不仅包含观察，还强调对位置、变化或进展的动态记录和定位，更具方向性和连续性。"
    }
  ]
}