{
  "word": "traffic",
  "pronunciation": "traf·ik",
  "concise_definition": "n. 交通, 车流, 流动; v. 交易, 贩卖",
  "forms": {
    "plural": "traffics"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The movement of vehicles, pedestrians, or vessels along roads, highways, or waterways, often measured by volume, speed, or congestion.",
      "explanation_cn": "指车辆、行人或船只在道路、高速公路或水道上的移动，通常以流量、速度或拥堵程度来衡量。",
      "example_en": "The morning rush hour caused heavy traffic on the highway.",
      "example_cn": "早高峰时段，高速公路上车流密集。"
    },
    {
      "pos": "noun",
      "explanation_en": "The flow of data, goods, or people through a system or network, especially in digital or commercial contexts.",
      "explanation_cn": "指数据、商品或人员在系统或网络中的流动，尤其用于数字或商业语境中。",
      "example_en": "The website experienced a spike in traffic after the viral advertisement.",
      "example_cn": "该网站在广告走红后流量激增。"
    },
    {
      "pos": "noun",
      "explanation_en": "Illegal trade or commerce, especially in drugs, weapons, or human beings.",
      "explanation_cn": "指非法交易，尤指毒品、武器或人口的买卖。",
      "example_en": "Authorities have launched a campaign to combat human trafficking.",
      "example_cn": "当局已发起一项打击人口贩卖的行动。"
    },
    {
      "pos": "verb",
      "explanation_en": "To engage in the illegal trade of goods or people, especially on a commercial scale.",
      "explanation_cn": "指从事非法商品或人口的买卖，通常具有商业规模。",
      "example_en": "Criminals were arrested for trafficking drugs across the border.",
      "example_cn": "犯罪分子因跨境贩毒而被逮捕。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "congestion",
      "analysis": "“Congestion” (拥堵) 专指交通或人流因过多而造成的阻塞状态，强调的是负面的、受限制的流动。而 “traffic” 是中性词，泛指所有流动本身，无论是否拥堵。例如，交通流量大不等于拥堵，但拥堵一定是交通的一种异常状态。"
    },
    {
      "word_to_compare": "flow",
      "analysis": "“Flow” (流动) 是一个更广泛、更抽象的词，可用于液体、气体、信息、情绪等多种情境，强调连续性和方向性。而 “traffic” 更具体，通常指有组织的、有路径的、可计量的移动，尤其在交通或商业语境中。"
    },
    {
      "word_to_compare": "commerce",
      "analysis": "“Commerce” (商业) 指合法的商品和服务交换活动，强调经济交易的系统性和规范性。而 “traffic” 在作非法交易解时，特指非法、地下或犯罪性质的买卖，带有强烈的负面含义。两者在语义范围和道德色彩上截然不同。"
    }
  ]
}