{
  "word": "tragic",
  "pronunciation": "traj·ik",
  "concise_definition": "adj. 悲剧的, 悲惨的, 令人痛心的",
  "forms": {
    "comparative": "more tragic",
    "superlative": "most tragic"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to or having the qualities of a tragedy; involving great sorrow, suffering, or loss, often with a sense of inevitability or profound injustice.",
      "explanation_cn": "与悲剧相关或具有悲剧特征的；涉及巨大的悲伤、痛苦或损失，常带有不可避免或深刻不公的意味。",
      "example_en": "The tragic death of the child shocked the entire community.",
      "example_cn": "这个孩子的悲惨死亡震惊了整个社区。"
    },
    {
      "pos": "adjective",
      "explanation_en": "So unfortunate or disastrous that it evokes pity or sorrow, even if not literally part of a dramatic tragedy.",
      "explanation_cn": "如此不幸或灾难性，以至于引发同情或悲伤，即使并非严格意义上的戏剧性悲剧。",
      "example_en": "It was a tragic waste of talent when the young musician gave up his career.",
      "example_cn": "这位年轻音乐家放弃职业生涯，真是才智的悲惨浪费。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by a sense of doom or futility, often used to describe situations where human actions lead to unavoidable suffering.",
      "explanation_cn": "带有厄运或徒劳感的特征，常用于描述人类行为导致不可避免苦难的情境。",
      "example_en": "The tragic irony of the situation was that the rescue team arrived too late.",
      "example_cn": "这一情况的悲剧性讽刺在于，救援队到达时已经太迟了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sad",
      "analysis": "“Sad”（悲伤的）是最通用的词，描述一般的情绪低落或不快乐，程度较轻，可用于日常情境（如失去宠物或错过火车）。而 “tragic” 强调极端的、具有毁灭性或命运性的痛苦，通常涉及生命、重大损失或道德上的不公，情感强度远高于 “sad”。"
    },
    {
      "word_to_compare": "disastrous",
      "analysis": "“Disastrous”（灾难性的）侧重于结果的严重破坏性或失败，常用于事件、计划或系统的崩溃（如一场灾难性的商业决策）。它强调后果，而非情感冲击。而 “tragic” 更关注人类情感层面的痛苦与哀伤，即使结果未完全失败，只要伴随深切的悲痛，仍可称为 tragic。"
    },
    {
      "word_to_compare": "heartbreaking",
      "analysis": "“Heartbreaking”（令人心碎的）与 “tragic” 非常接近，都强调情感上的巨大痛苦，但 “heartbreaking” 更个人化、更情绪化，常用于亲密关系中的失去（如亲人离世）。而 “tragic” 更具公共性或结构性，可描述社会性、历史性或命运性的悲剧，带有更强烈的戏剧性和哲学意味。"
    }
  ]
}