{
  "word": "tragedies",
  "pronunciation": "truh·jeh·duh·z",
  "concise_definition": "n. 悲剧, 悲惨事件, 灾难",
  "forms": {
    "singular": "tragedy"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A serious and sorrowful event, especially one involving death or great suffering, often caused by human error, fate, or social circumstances.",
      "explanation_cn": "指一种严肃而令人悲痛的事件，尤其涉及死亡或巨大苦难，通常由人为错误、命运或社会环境造成。",
      "example_en": "The war caused countless tragedies, leaving families shattered and communities in ruins.",
      "example_cn": "这场战争造成了无数悲剧，使无数家庭支离破碎，社区满目疮痍。"
    },
    {
      "pos": "noun",
      "explanation_en": "A dramatic work in literature or theater that portrays the downfall of a noble or heroic character due to a fatal flaw or external forces.",
      "explanation_cn": "指文学或戏剧中的一种体裁，描绘一位高贵或英雄式人物因性格缺陷或外部力量而走向毁灭的过程。",
      "example_en": "Shakespeare's 'Hamlet' is considered one of the greatest tragedies in English literature.",
      "example_cn": "莎士比亚的《哈姆雷特》被认为是英语文学中最伟大的悲剧之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "An event or situation that is deeply unfortunate or distressing, often used figuratively to express strong emotional impact.",
      "explanation_cn": "指一种极其不幸或令人痛心的事件或状况，常用于比喻性表达以强调强烈的情感冲击。",
      "example_en": "It's a tragedy that so many children still lack access to clean water.",
      "example_cn": "如此多的儿童仍无法获得清洁用水，这实在是一场悲剧。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "disaster",
      "analysis": "“Disaster” (灾难) 更侧重于由自然或人为因素引发的突发性大规模破坏，强调物理层面的损失和混乱，如地震、爆炸。而 “tragedy” 更强调情感上的沉重与人性层面的悲痛，不一定伴随物理破坏，但一定引发深切哀伤。"
    },
    {
      "word_to_compare": "catastrophe",
      "analysis": "“Catastrophe” (浩劫) 与 “tragedy” 都可指重大不幸，但 “catastrophe” 更强调事件的规模和不可逆转的后果，常用于宏观层面（如环境崩溃、经济崩溃），语气更正式、更宏大；“tragedy” 则更贴近个体或群体的情感体验，更具文学性和人性色彩。"
    },
    {
      "word_to_compare": "misfortune",
      "analysis": "“Misfortune” (不幸) 指一般的倒霉或不顺，程度较轻，常用于个人生活中的小挫折，如丢失钱包或迟到。而 “tragedy” 是极端严重的不幸，带有宿命感或深刻的社会、道德意义，绝非日常琐事可比。"
    }
  ]
}