{
  "word": "trained",
  "pronunciation": "traynd",
  "concise_definition": "adj. 受过训练的, 有技能的; v. 训练（train 的过去式和过去分词）",
  "forms": {
    "base_form": "train",
    "third_person_singular": "trains",
    "past_tense": "trained",
    "past_participle": "trained",
    "present_participle": "training"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having received systematic instruction or practice in a particular skill, profession, or activity, resulting in competence or expertise.",
      "explanation_cn": "指通过系统性的指导或练习，掌握了某项技能、职业或活动，从而具备了相应的能力或专业水平。",
      "example_en": "She is a trained nurse with over ten years of experience in emergency care.",
      "example_cn": "她是一位受过专业训练的护士，拥有十年以上的急诊护理经验。"
    },
    {
      "pos": "verb",
      "explanation_en": "To teach or instruct someone systematically in a particular skill, behavior, or discipline, often through repetition and practice.",
      "explanation_cn": "指通过系统性的教学、重复和练习，教导某人掌握某项技能、行为或纪律。",
      "example_en": "The dog was trained to respond to voice commands and hand signals.",
      "example_cn": "这只狗经过训练，能够对口令和手势做出反应。"
    },
    {
      "pos": "verb",
      "explanation_en": "To prepare someone physically or mentally for a specific task or role, especially in sports, military, or professional contexts.",
      "explanation_cn": "指为特定任务或角色（尤其在体育、军事或职业环境中）对某人进行体能或心理上的准备和锻炼。",
      "example_en": "Athletes are trained for months before competing in the Olympics.",
      "example_cn": "运动员在参加奥运会前会接受数月的训练。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "educated",
      "analysis": "“Educated”（受过教育的）强调通过正规学术体系获得知识和理论理解，通常指学校教育或大学教育。而 “trained” 更侧重于实践技能、操作能力或行为规范的培养，常用于职业、技术或体能领域。一个人可以受过教育但未受过训练，反之亦然。"
    },
    {
      "word_to_compare": "skilled",
      "analysis": "“Skilled”（有技能的）是描述结果状态，指已经具备某种能力；而 “trained” 强调获得该能力的过程，即通过训练达成的状态。一个 skilled 人员可能是自学成才，而 trained 人员一定经过了有组织的指导。"
    },
    {
      "word_to_compare": "conditioned",
      "analysis": "“Conditioned”（被调教/适应的）常用于行为心理学或动物训练，强调通过反复刺激与反应建立自动行为模式，有时带有被动或机械的意味。而 “trained” 更广泛，包含主动学习、理解与应用，适用范围更广，且通常不带负面含义。"
    }
  ]
}