{
  "word": "trailing",
  "pronunciation": "tray·ling",
  "concise_definition": "adj. 落后的, 尾随的; v. 跟随, 尾随, 拖曳",
  "forms": {
    "base_form": "trail",
    "third_person_singular": "trails",
    "past_tense": "trailed",
    "past_participle": "trailed",
    "present_participle": "trailing"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Coming after in order, position, or time; lagging behind or not leading.",
      "explanation_cn": "在顺序、位置或时间上位于后面；落后的，未居领先地位的。",
      "example_en": "The team is in trailing position in the championship standings.",
      "example_cn": "这支队伍在冠军积分榜上处于落后位置。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Of or relating to something that extends or hangs behind, such as a trailing vine or trailing edge of an airplane wing.",
      "explanation_cn": "指延伸或悬垂在后面的，如藤蔓或飞机机翼的后缘。",
      "example_en": "The garden was filled with trailing ivy that climbed the stone walls.",
      "example_cn": "花园里爬满了攀附在石墙上的藤蔓。"
    },
    {
      "pos": "verb",
      "explanation_en": "To follow or move behind someone or something, often at a distance.",
      "explanation_cn": "跟随或在某人或某物之后移动，通常保持一定距离。",
      "example_en": "The detective trailed the suspect for three blocks before making an arrest.",
      "example_cn": "侦探跟踪嫌疑人三个街区后才实施逮捕。"
    },
    {
      "pos": "verb",
      "explanation_en": "To drag or let something hang loosely behind while moving.",
      "explanation_cn": "在移动时拖曳或让某物松散地垂在后面。",
      "example_en": "She walked down the hall, trailing her long silk scarf behind her.",
      "example_cn": "她沿着走廊走下，身后拖着一条长长的丝绸围巾。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "following",
      "analysis": "“Following” (跟随) 更强调主动、有意识地跟在后面，常用于描述人或车辆的追踪行为，语气中性或积极；而 “trailing” 常带有被动、缓慢或落后的意味，有时隐含效率低下或未领先的状态，如股票价格 trailing the market。"
    },
    {
      "word_to_compare": "lagging",
      "analysis": "“Lagging” (滞后) 侧重于因速度慢或效率低而落后于标准或他人，常用于比较性语境，如经济指标 lagging behind；“trailing” 也可用于此义，但更常用于空间或物理上的“尾随”，而 “lagging” 更抽象，多用于时间、进度或表现的比较。"
    },
    {
      "word_to_compare": "dragging",
      "analysis": "“Dragging” (拖拽) 强调用力拉拽某物，通常伴随阻力或费力感，如 dragging a heavy box；而 “trailing” 更轻柔，指自然垂落或松散地跟随，不强调施力，如 trailing hair or a trailing wire. 两者都可描述物体在后方移动，但 “dragging” 更具物理对抗性。"
    }
  ]
}