{
  "word": "trailed",
  "pronunciation": "trāld",
  "concise_definition": "v. 跟随, 尾随, 拖着, 留下痕迹",
  "forms": {
    "base_form": "trail",
    "third_person_singular": "trails",
    "past_tense": "trailed",
    "past_participle": "trailed",
    "present_participle": "trailing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To follow someone or something closely, often at a distance, especially in order to observe or monitor their movements.",
      "explanation_cn": "指紧随某人或某物之后，通常保持一定距离，目的是观察或监视其动向。",
      "example_en": "The detective trailed the suspect for three days before making an arrest.",
      "example_cn": "侦探跟踪嫌疑人三天后才实施逮捕。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move while dragging something along the ground or behind, leaving a visible path or mark.",
      "explanation_cn": "指拖着某物在地面移动，留下可见的痕迹或路径。",
      "example_en": "The wounded soldier trailed his leg as he limped across the field.",
      "example_cn": "受伤的士兵一瘸一拐地穿过田野，拖着一条腿。"
    },
    {
      "pos": "verb",
      "explanation_en": "To leave a visible or detectable trace behind as one moves; to extend or continue in a line behind.",
      "explanation_cn": "指在移动过程中留下可见或可察觉的痕迹，或在身后延伸成一条线。",
      "example_en": "Smoke trailed from the chimney into the clear sky.",
      "example_cn": "烟雾从烟囱中袅袅升起，飘向晴朗的天空。"
    },
    {
      "pos": "verb",
      "explanation_en": "To finish in a lower position than others in a competition or ranking.",
      "explanation_cn": "指在比赛或排名中落后于他人，位居其后。",
      "example_en": "The team trailed by ten points at halftime but made a remarkable comeback.",
      "example_cn": "球队半场时落后十分，但最终实现了惊人的逆转。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "follow",
      "analysis": "“Follow” (跟随) 是更通用的词，泛指在后方移动或遵从某人/某物，不强调隐蔽性或持续性。而 “trailed” 更常用于秘密、持续或监视性的跟随，带有更强的意图性和隐秘性。"
    },
    {
      "word_to_compare": "drag",
      "analysis": "“Drag” (拖拽) 强调用力拉动物体，通常伴随阻力或困难，侧重物理动作本身。而 “trailed” 可以指拖着某物移动，但更强调留下痕迹或路径，且常用于抽象或非强制性的语境（如烟雾、声音）。"
    },
    {
      "word_to_compare": "trace",
      "analysis": "“Trace” (追踪/追溯) 侧重于通过线索或证据回溯源头，常用于调查或分析过程，是主动寻找的过程。而 “trailed” 是指在移动过程中持续留下或跟随痕迹，是动态的、线性的行为，更强调过程而非结果。"
    }
  ]
}