{
  "word": "training",
  "pronunciation": "tray·ning",
  "concise_definition": "n. 培训, 训练, 练习",
  "forms": {
    "plural": "trainings"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process of teaching or learning specific skills, knowledge, or behaviors through systematic instruction, practice, or experience, often to improve performance in a job, sport, or activity.",
      "explanation_cn": "指通过系统的指导、练习或经验来教授或学习特定技能、知识或行为的过程，通常旨在提升在工作、运动或活动中的表现。",
      "example_en": "The new employees completed a week-long training on customer service protocols.",
      "example_cn": "新员工完成了为期一周的客户服务流程培训。"
    },
    {
      "pos": "noun",
      "explanation_en": "Physical exercise or practice designed to improve fitness, strength, endurance, or athletic ability, often following a structured program.",
      "explanation_cn": "指为提高体能、力量、耐力或运动能力而进行的有组织的体育锻炼或训练。",
      "example_en": "Her daily training routine includes running, weightlifting, and yoga.",
      "example_cn": "她的日常训练包括跑步、举重和瑜伽。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of conditioning an animal or person to respond in a particular way through repeated reinforcement or discipline.",
      "explanation_cn": "指通过反复强化或纪律约束，使动物或人形成特定反应的行为。",
      "example_en": "The dog's training involved positive reinforcement for sitting on command.",
      "example_cn": "这只狗的训练采用正向强化，命令它坐下时给予奖励。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "education",
      "analysis": "“Education” (教育) 通常指系统性的知识传授和智力发展，范围更广，强调理论、批判性思维和长期素养的培养，常用于学校或学术环境。而 “training” 更侧重于实用技能的习得和行为的标准化，目标明确、周期较短，常用于职业或技术场景。"
    },
    {
      "word_to_compare": "practice",
      "analysis": "“Practice” (练习) 指反复进行某项活动以提高熟练度，是训练的一个组成部分，但不一定包含系统性指导。而 “training” 通常包含有计划的教学、反馈和目标设定，结构更完整。例如，你可以在没有教练的情况下练习钢琴，但接受钢琴训练则意味着有专业指导。"
    },
    {
      "word_to_compare": "coaching",
      "analysis": "“Coaching” (辅导) 强调一对一或小团体的个性化指导，注重激励、反馈和潜能开发，常用于体育、领导力或个人成长领域。而 “training” 更偏向于标准化内容的传授，面向群体，强调技能的统一掌握。教练可能提供训练，但训练不一定是教练主导的。"
    }
  ]
}