{
  "word": "train",
  "pronunciation": "trayn",
  "concise_definition": "v. 训练, 培训; n. 火车, 列车",
  "forms": {
    "third_person_singular": "trains",
    "past_tense": "trained",
    "past_participle": "trained",
    "present_participle": "training"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To teach or instruct someone systematically in a particular skill, behavior, or discipline, often through repeated practice or structured programs.",
      "explanation_cn": "指通过系统性的教学、重复练习或结构化项目，对某人进行某项技能、行为或纪律的培训。",
      "example_en": "She trained for months to run the marathon.",
      "example_cn": "她为参加马拉松训练了数月。"
    },
    {
      "pos": "verb",
      "explanation_en": "To condition or habituate an animal to behave in a specific way, often through reinforcement or reward.",
      "explanation_cn": "指通过强化或奖励等方式，使动物养成某种特定行为模式。",
      "example_en": "The dog was trained to sit on command.",
      "example_cn": "这只狗被训练成听到指令就会坐下。"
    },
    {
      "pos": "verb",
      "explanation_en": "To prepare someone for a specific role or job, especially in a professional or technical context.",
      "explanation_cn": "指为某人胜任某一特定职位或工作做准备，尤其在专业或技术领域。",
      "example_en": "New employees are trained in safety procedures before starting work.",
      "example_cn": "新员工在上岗前需接受安全规程培训。"
    },
    {
      "pos": "noun",
      "explanation_en": "A series of connected railway cars pulled by a locomotive, used for transporting passengers or goods.",
      "explanation_cn": "指由机车牵引的一系列相连的铁路车厢，用于运送乘客或货物。",
      "example_en": "The train to Beijing departs at 8:30 a.m.",
      "example_cn": "开往北京的火车早上8点半发车。"
    },
    {
      "pos": "noun",
      "explanation_en": "A long, narrow strip of fabric attached to clothing, especially at the back of a wedding dress or formal gown.",
      "explanation_cn": "指附着在服装（尤其是婚纱或礼服）后部的长条状布料。",
      "example_en": "The bride walked down the aisle with a long train trailing behind her.",
      "example_cn": "新娘拖着长长的拖尾缓缓走过过道。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "teach",
      "analysis": "“Teach”（教授）强调知识或技能的传授，通常侧重于理论讲解和认知理解，适用于更广泛的教育场景；而 “train” 更强调通过反复练习和实际操作来培养行为习惯或专业能力，具有更强的实践性和目的性。"
    },
    {
      "word_to_compare": "instruct",
      "analysis": "“Instruct”（指导）语气更正式，常用于提供明确的步骤或命令，强调信息的传递；“train” 则包含持续的过程和行为塑造，通常涉及长期的训练计划和反馈机制，更注重结果的养成。"
    },
    {
      "word_to_compare": "coach",
      "analysis": "“Coach”（辅导）多用于体育、职业发展或个人成长领域，强调个性化支持、激励和策略调整；“train” 更偏向标准化、系统化的技能训练，常用于军队、工厂或大型组织的集体培训。"
    },
    {
      "word_to_compare": "railway",
      "analysis": "“Railway”（铁路）是基础设施系统，指轨道网络和相关设施；而 “train” 是运行在铁路系统上的交通工具本身。两者是系统与载体的关系，不可互换。"
    }
  ]
}