{
  "word": "tramp",
  "pronunciation": "tramp",
  "concise_definition": "n. 流浪者, 漫步者; v. 漫步, 践踏",
  "forms": {
    "third_person_singular": "tramps",
    "past_tense": "tramped",
    "past_participle": "tramped",
    "present_participle": "tramping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who travels from place to place on foot, often without a permanent home or regular employment, typically living in poverty and relying on charity or odd jobs.",
      "explanation_cn": "指徒步游荡于各地、通常无固定住所或稳定工作、生活贫困、依赖施舍或零工为生的人，常带有贬义。",
      "example_en": "The old tramp slept under the bridge, wrapped in a tattered blanket.",
      "example_cn": "那位老流浪汉裹着破旧的毯子，睡在桥下。"
    },
    {
      "pos": "noun",
      "explanation_en": "A long, strenuous walk, especially through rural or wilderness areas; also refers to the person who takes such a walk.",
      "explanation_cn": "指长时间、艰苦的徒步行走，尤指穿越乡村或荒野地区；也可指进行此类行走的人，常用于中性或积极语境。",
      "example_en": "We went on a tramp through the Scottish Highlands last summer.",
      "example_cn": "去年夏天，我们徒步穿越了苏格兰高地。"
    },
    {
      "pos": "verb",
      "explanation_en": "To walk steadily and often for a long distance, especially over rough or rural terrain.",
      "explanation_cn": "指稳健地长时间行走，尤指在崎岖或乡村地形中跋涉。",
      "example_en": "They tramped through the snow for hours, searching for the lost hiker.",
      "example_cn": "他们踏着积雪走了好几个小时，寻找那位迷路的徒步者。"
    },
    {
      "pos": "verb",
      "explanation_en": "To walk heavily or noisily, often causing damage to the ground or surface; to tread on something roughly.",
      "explanation_cn": "指沉重或嘈杂地行走，常对地面或表面造成破坏；粗暴地践踏。",
      "example_en": "The children tramped mud all over the clean floor.",
      "example_cn": "孩子们把泥巴踩得满地都是。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "vagabond",
      "analysis": "“Vagabond”（流浪汉）与 “tramp” 非常接近，都指无固定居所的游荡者，但 “vagabond” 更具文学色彩，有时带有浪漫化或自由不羁的意味，而 “tramp” 更常用于现实语境，且更易带有社会偏见或贬义。"
    },
    {
      "word_to_compare": "hiker",
      "analysis": "“Hiker”（徒步者）指为休闲或锻炼而进行长途步行的人，通常有准备、有计划，强调健康与自然体验；而 “tramp” 在作名词时可能暗示无目的、贫困或边缘化状态，语义色彩更复杂，有时含贬义。"
    },
    {
      "word_to_compare": "march",
      "analysis": "“March”（行军/行进）强调有组织、有节奏、有目的的集体行走，常用于军事或抗议场景；而 “tramp” 更强调个人、沉重、无规律的步行，常伴随疲惫或艰难的语境，缺乏组织性。"
    }
  ]
}