{
  "word": "transferred",
  "pronunciation": "trænsˈfɜːrd",
  "concise_definition": "v. 转移, 转让, 转诊, 转账 (transfer 的过去式和过去分词)",
  "forms": {
    "base_form": "transfer",
    "third_person_singular": "transfers",
    "present_participle": "transferring",
    "plural_noun": "transfers"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move or cause something to move from one place, person, or system to another, often involving a change in ownership, responsibility, or location.",
      "explanation_cn": "指将某物从一个地方、人或系统移动到另一个地方、人或系统，通常涉及所有权、责任或位置的变更。",
      "example_en": "The patient was transferred to a specialized hospital for further treatment.",
      "example_cn": "这名病人被转诊至一家专科医院接受进一步治疗。"
    },
    {
      "pos": "verb",
      "explanation_en": "To officially change the ownership or legal rights of something, such as property, money, or a title, from one party to another.",
      "explanation_cn": "指正式将某物（如财产、资金或头衔）的所有权或法律权利从一方转移至另一方。",
      "example_en": "She transferred the deed of the house to her son's name.",
      "example_cn": "她将房屋产权过户到了她儿子的名下。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move funds electronically from one bank account or financial system to another.",
      "explanation_cn": "指通过电子方式将资金从一个银行账户或金融系统转移到另一个账户或系统。",
      "example_en": "I transferred $500 from my savings account to my checking account yesterday.",
      "example_cn": "我昨天从储蓄账户转账了500美元到支票账户。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move a person from one job, position, or organization to another, often within the same company or institution.",
      "explanation_cn": "指将某人从一个职位、岗位或组织调至另一个，通常在同一公司或机构内部进行。",
      "example_en": "He was transferred to the company's headquarters in New York after five years in the regional office.",
      "example_cn": "他在地区办事处工作五年后被调往公司位于纽约的总部。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "moved",
      "analysis": "“Moved” (移动) 是一个更通用的词，泛指物理位置的改变，不涉及所有权或制度性变更。而 “transferred” 强调的是在系统、组织或法律框架内的正式转移，常带有责任、权利或控制权的变更。"
    },
    {
      "word_to_compare": "shifted",
      "analysis": "“Shifted” (转移/变动) 通常指方向、重心或焦点的轻微或临时性变化，常用于抽象概念（如注意力、趋势），不强调正式程序或所有权变更。而 “transferred” 更正式、更具体，常用于法律、金融或组织语境。"
    },
    {
      "word_to_compare": "assigned",
      "analysis": "“Assigned” (指派) 指将任务、职责或资源分配给某人，但不意味着原持有者失去控制权或所有权。而 “transferred” 意味着原持有者完全放弃，接收方获得完整控制权。例如：任务可被指派，但财产只能被转移。"
    }
  ]
}