{
  "word": "transplants",
  "pronunciation": "tranz·plænts",
  "concise_definition": "n. 移植物, 移植的器官或组织; v. 移植, 移栽",
  "forms": {
    "singular": "transplant"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A body part, tissue, or organ that has been surgically moved from one person or part of the body to another, typically to replace a damaged or missing part.",
      "explanation_cn": "指通过外科手术从一个人或身体的一个部位移至另一个人或身体另一部位的组织、器官或身体部分，通常用于替换受损或缺失的部分。",
      "example_en": "The patient received a kidney transplant after months on the waiting list.",
      "example_cn": "这位患者在等待数月后接受了肾脏移植。"
    },
    {
      "pos": "noun",
      "explanation_en": "A plant that has been dug up and replanted in a new location, often to improve its growth or survival.",
      "explanation_cn": "指被挖出并重新栽种到新地点的植物，通常是为了改善其生长或存活率。",
      "example_en": "The gardeners carefully handled the transplants to avoid damaging the roots.",
      "example_cn": "园丁们小心地处理这些移栽苗，以免损伤根系。"
    },
    {
      "pos": "verb",
      "explanation_en": "To surgically move a tissue, organ, or cell from one person or part of the body to another.",
      "explanation_cn": "指通过外科手术将组织、器官或细胞从一个人或身体的一个部位移至另一个人或身体的另一部位。",
      "example_en": "Doctors successfully transplanted a heart into the young patient.",
      "example_cn": "医生成功地将一颗心脏移植到这位年轻患者体内。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move a plant from one location to another, especially during its early growth stage.",
      "explanation_cn": "指将植物从一个地点移栽到另一个地点，尤其在植物的幼苗阶段。",
      "example_en": "We transplanted the seedlings into larger pots to give them more room to grow.",
      "example_cn": "我们把幼苗移栽到更大的花盆里，以便它们有更多空间生长。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "graft",
      "analysis": "“Graft”（嫁接）特指将植物的一部分（如枝条或芽）接到另一植物的茎或根上，使其愈合并共同生长，主要用于园艺和植物学。而 “transplant” 更广泛，指整个植物或器官的移动，不强调组织融合，且常用于医学领域。"
    },
    {
      "word_to_compare": "relocate",
      "analysis": "“Relocate”（迁移、搬迁）是一个通用词，指人、组织或物体从一个地方搬到另一个地方，不涉及生物体的生理整合或外科手术。而 “transplant” 强调生物体在新环境中的生理适应和功能整合，具有更强的生物学和医学含义。"
    },
    {
      "word_to_compare": "implant",
      "analysis": "“Implant”（植入）指将人工或生物材料（如假体、芯片、药物缓释装置）固定在体内，通常不涉及从供体获取组织，而是将非自然物体置入。而 “transplant” 必须涉及从一个活体（供体）取出并植入另一个活体（受体），强调生物组织的来源与替换。"
    }
  ]
}