{
  "word": "transmitted",
  "pronunciation": "tranz·mit·id",
  "concise_definition": "v. 传输, 传播, 传染, 发送",
  "forms": {
    "base_form": "transmit",
    "third_person_singular": "transmits",
    "past_tense": "transmitted",
    "past_participle": "transmitted",
    "present_participle": "transmitting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To send or convey information, signals, or data from one place or person to another, typically through a medium such as wires, radio waves, or networks.",
      "explanation_cn": "指通过电线、无线电波或网络等媒介，将信息、信号或数据从一个地方或人传送到另一个地方或人。",
      "example_en": "The hospital transmitted the patient's vital signs to the central monitoring system.",
      "example_cn": "医院将病人的生命体征传输到了中央监测系统。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a disease, virus, or condition to pass from one organism to another, often through direct contact, vectors, or environmental exposure.",
      "explanation_cn": "指通过直接接触、媒介生物或环境暴露，使疾病、病毒或病症从一个生物体传播到另一个生物体。",
      "example_en": "Mosquitoes can transmit malaria from one person to another.",
      "example_cn": "蚊子可以将疟疾从一个人传播给另一个人。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pass on customs, beliefs, traditions, or knowledge from one generation to the next, often through cultural or familial channels.",
      "explanation_cn": "指通过文化或家庭渠道，将习俗、信仰、传统或知识从一代传递给下一代。",
      "example_en": "Elders in the village transmit oral histories to children through storytelling.",
      "example_cn": "村里的长者通过讲故事将口述历史传递给孩子们。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sent",
      "analysis": "“Sent” (发送) 是一个通用词，泛指将某物从一处送到另一处，不强调传输的媒介或过程，可用于实物、信息或情感。而 “transmitted” 更强调通过技术或生物系统进行的有媒介的传递，常用于信号、数据或病原体等抽象或科学语境。"
    },
    {
      "word_to_compare": "spread",
      "analysis": "“Spread” (传播) 通常指以扩散、蔓延的方式从中心向外扩展，常用于疾病、谣言或影响，强调无方向性或非控制性的扩散过程。而 “transmitted” 更强调有明确的发送者和接收者，常用于有目的或机制的传递，如通信或医学传染。"
    },
    {
      "word_to_compare": "conveyed",
      "analysis": "“Conveyed” (传达) 更侧重于信息、情感或意图的表达与传递，常用于人际沟通或文学语境，强调意义的传递而非物理或技术过程。而 “transmitted” 更偏向于技术性、机械性或生物学的传递过程，如电信号或病毒的传播。"
    }
  ]
}