{
  "word": "transports",
  "pronunciation": "tranz·port",
  "concise_definition": "v. 运输, 运送; n. 极度兴奋, 狂喜",
  "forms": {
    "third_person_singular": "transports",
    "past_tense": "transported",
    "past_participle": "transported",
    "present_participle": "transporting",
    "plural": "transports"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To carry or move people or goods from one place to another, typically by vehicle, ship, or aircraft.",
      "explanation_cn": "指通过车辆、船舶或飞机等工具将人或货物从一个地方运送到另一个地方。",
      "example_en": "The company transports fresh produce from farms to urban markets daily.",
      "example_cn": "该公司每天将新鲜农产品从农场运往城市市场。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause someone to experience an intense feeling of pleasure, joy, or ecstasy, often to the point of losing self-awareness.",
      "explanation_cn": "指使人陷入极度的愉悦、喜悦或狂喜之中，甚至达到忘我的状态。",
      "example_en": "The music transported her to another world.",
      "example_cn": "音乐让她仿佛置身于另一个世界。"
    },
    {
      "pos": "noun",
      "explanation_en": "A means or system of conveying people or goods from one place to another; often used in plural form to refer to public transportation systems collectively.",
      "explanation_cn": "指用于运送人或货物的工具或系统，常以复数形式泛指公共交通系统。",
      "example_en": "The city is investing in better public transports to reduce traffic congestion.",
      "example_cn": "该市正在投资改善公共交通，以缓解交通拥堵。"
    },
    {
      "pos": "noun",
      "explanation_en": "An intense state of emotional ecstasy or rapture; often used in the phrase 'in transports of joy'.",
      "explanation_cn": "指一种强烈的情感狂喜状态，常用于短语 'in transports of joy'（欣喜若狂）。",
      "example_en": "She was in transports of delight when she heard the news.",
      "example_cn": "当她听到这个消息时，欣喜若狂。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "carry",
      "analysis": "“Carry”（携带）强调用手或身体承载某物，范围较窄，常用于近距离或小规模移动；而 “transport” 更强调系统性、长距离或大规模的运送，通常涉及交通工具或专业物流。"
    },
    {
      "word_to_compare": "convey",
      "analysis": "“Convey”（传达、运送）含义更广，既可用于物理运输，也可用于抽象概念的传递（如信息、情感）；而 “transport” 在物理意义上更强调移动过程本身，在情感意义上则专指强烈的情绪冲击，语义更强烈、更具文学色彩。"
    },
    {
      "word_to_compare": "move",
      "analysis": "“Move”（移动）是最通用的词，可指任何位置变化，包括人或物的轻微位移；而 “transport” 通常暗示更远距离、更正式或更专业的运送行为，且在情感用法中具有不可替代的强烈情绪内涵。"
    },
    {
      "word_to_compare": "excitement",
      "analysis": "“Excitement”（兴奋）是普通、中性的心理状态描述，可指任何程度的激动；而 “transport” 作为名词时特指一种近乎忘我的狂喜状态，语义强度远高于 “excitement”，多用于文学或诗意表达。"
    }
  ]
}