{
  "word": "transfer",
  "pronunciation": "træns·fɜːr",
  "concise_definition": "v. 转移, 转让, 转换; n. 转移, 转让, 换乘",
  "forms": {
    "third_person_singular": "transfers",
    "past_tense": "transferred",
    "past_participle": "transferred",
    "present_participle": "transferring"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move something or someone from one place, person, or system to another, often involving a change in ownership, location, or control.",
      "explanation_cn": "指将某物或某人从一个地方、人或系统移动到另一个地方、人或系统，通常涉及所有权、位置或控制权的变更。",
      "example_en": "She transferred her savings from the local bank to an online account.",
      "example_cn": "她把储蓄从本地银行转到了在线账户。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a feeling, quality, or condition to be passed from one person or group to another.",
      "explanation_cn": "指使某种情感、特质或状态从一个人或群体传递到另一个人或群体。",
      "example_en": "The teacher's enthusiasm transferred to the students, making the lesson more engaging.",
      "example_cn": "老师的热情感染了学生，使课堂更加生动。"
    },
    {
      "pos": "verb",
      "explanation_en": "To change from one mode of transportation to another, especially during a journey.",
      "explanation_cn": "指在旅途中从一种交通工具换乘到另一种交通工具。",
      "example_en": "We had to transfer from the subway to a bus at Central Station.",
      "example_cn": "我们在中央车站从地铁换乘到公交车。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or process of moving something or someone from one place, person, or system to another.",
      "explanation_cn": "指将某物或某人从一个地方、人或系统移动到另一个地方、人或系统的动作或过程。",
      "example_en": "The transfer of funds took three business days to complete.",
      "example_cn": "资金转账花了三个工作日才完成。"
    },
    {
      "pos": "noun",
      "explanation_en": "A document or ticket that allows someone to continue a journey on another vehicle or route.",
      "explanation_cn": "指允许某人继续乘坐另一种交通工具或路线的凭证或票证。",
      "example_en": "The train station provided a free transfer ticket to the airport shuttle.",
      "example_cn": "火车站提供了免费的机场班车换乘票。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "move",
      "analysis": "“Move” (移动) 是一个更通用的词，泛指位置上的改变，不涉及所有权或系统性变更。而 “transfer” 更强调在不同实体、系统或控制方之间的正式转移，常带有制度性或结构性含义。"
    },
    {
      "word_to_compare": "shift",
      "analysis": "“Shift” (转移/转变) 常用于指轻微、临时或方向性的变化，如注意力的转移、班次的轮换，语气较轻，不强调正式性或所有权变更。而 “transfer” 更正式，常用于法律、财务或组织层面的永久性变更。"
    },
    {
      "word_to_compare": "exchange",
      "analysis": "“Exchange” (交换) 指双方互换物品或服务，具有双向性；而 “transfer” 是单向的，从一方到另一方，不必然要求回报。例如，你转移资金给朋友，但不期待对方给你钱。"
    }
  ]
}