{
  "word": "transparency",
  "pronunciation": "tranz·pruh·ten·see",
  "concise_definition": "n. 透明, 透明度, 公开性",
  "forms": {
    "plural": "transparencies"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The quality of being transparent, especially in a literal sense, allowing light to pass through so that objects behind can be clearly seen.",
      "explanation_cn": "指在字面意义上具有透明的特性，使光线能够穿透，从而清晰看到背后的物体。",
      "example_en": "The glass window offered perfect transparency, giving a clear view of the garden outside.",
      "example_cn": "这扇玻璃窗具有极佳的透明度，让人能清晰看到外面的花园。"
    },
    {
      "pos": "noun",
      "explanation_en": "The quality of being open, honest, and accountable in actions, decisions, or processes, especially in government, business, or organizations.",
      "explanation_cn": "指在行为、决策或过程中表现出开放、诚实和可问责的特性，尤其用于政府、企业或组织的运作中。",
      "example_en": "The government's transparency in budget allocation has increased public trust.",
      "example_cn": "政府在预算分配上的公开性增强了公众的信任。"
    },
    {
      "pos": "noun",
      "explanation_en": "A thin, clear sheet of plastic or film used for projecting images, especially in educational or presentation settings.",
      "explanation_cn": "指用于投影图像的薄而透明的塑料片或胶片，常用于教学或演示场合。",
      "example_en": "The teacher used a transparency to display the diagram on the overhead projector.",
      "example_cn": "老师使用一张透明胶片在投影仪上展示图表。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "openness",
      "analysis": "“Openness”（开放性）泛指愿意分享信息、接纳意见或不隐瞒的态度，语义更宽泛，可涵盖情感、沟通或态度层面。而 “transparency” 更强调信息的可访问性与可验证性，尤其在制度或系统层面，具有更强的结构性和制度性含义。"
    },
    {
      "word_to_compare": "clarity",
      "analysis": "“Clarity”（清晰性）侧重于表达或理解上的明确无误，如语言清晰、逻辑清晰。它关注的是信息是否容易被理解，而非是否被完整披露。而 “transparency” 关注的是信息是否被主动、完整地公开，即使内容复杂，只要来源和过程公开，仍可称为 transparency。"
    },
    {
      "word_to_compare": "visibility",
      "analysis": "“Visibility”（可见性）强调某事物是否能被看见或被注意到，常用于物理空间或数字平台（如社交媒体可见性）。它不必然包含“诚实”或“问责”的道德维度。而 “transparency” 不仅要求可见，还要求信息真实、完整、无隐藏动机，具有更强的伦理内涵。"
    }
  ]
}