{
  "word": "transcend",
  "pronunciation": "tranz·send",
  "concise_definition": "v. 超越, 超出, 高于",
  "forms": {
    "third_person_singular": "transcends",
    "past_tense": "transcended",
    "past_participle": "transcended",
    "present_participle": "transcending"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To go beyond the limits of something, especially in terms of physical, mental, or spiritual boundaries; to rise above ordinary or conventional constraints.",
      "explanation_cn": "指超越某事物的界限，尤其在身体、心智或精神层面；超越普通或传统的限制。",
      "example_en": "Her art transcends cultural boundaries and speaks to universal human emotions.",
      "example_cn": "她的艺术超越了文化界限，唤起了普遍的人类情感。"
    },
    {
      "pos": "verb",
      "explanation_en": "To surpass or exceed something in quality, achievement, or significance, often in a way that is remarkable or extraordinary.",
      "explanation_cn": "指在质量、成就或重要性上超越某物，通常表现为非凡或卓越。",
      "example_en": "His performance transcended all expectations and earned him a standing ovation.",
      "example_cn": "他的表演超越了所有人的预期，赢得了全场起立鼓掌。"
    },
    {
      "pos": "verb",
      "explanation_en": "In philosophy or spirituality, to rise above material existence or earthly concerns to reach a higher state of being or consciousness.",
      "explanation_cn": "在哲学或灵性语境中，指超越物质存在或尘世关切，达到更高层次的存在或意识状态。",
      "example_en": "Meditation can help the soul transcend the distractions of the physical world.",
      "example_cn": "冥想可以帮助灵魂超越物质世界的纷扰。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "surpass",
      "analysis": "“Surpass” (超越) 强调在数量、水平或成就上超过某物，通常用于可量化的比较，如成绩、速度或收入。而 “transcend” 更强调突破本质或界限，常用于抽象领域，如情感、精神或艺术层面，带有更深刻的超越意味。"
    },
    {
      "word_to_compare": "exceed",
      "analysis": "“Exceed” (超过) 通常指在具体标准、限制或数值上超出，如速度超过限速、支出超过预算。它更中性、技术性，不带有 “transcend” 所蕴含的升华、突破或精神提升的内涵。"
    },
    {
      "word_to_compare": "rise above",
      "analysis": "“Rise above” (超脱) 与 “transcend” 在精神或道德层面意义接近，都指摆脱负面环境或情绪。但 “rise above” 更口语化，常用于个人应对困境，如 ‘rise above gossip’；而 ‘transcend’ 更正式、哲学化，常用于描述艺术、思想或存在的根本性超越。"
    }
  ]
}