{
  "word": "transformation",
  "pronunciation": "tranz·fuhr·mey·shun",
  "concise_definition": "n. 转变, 转化, 变形",
  "forms": {
    "plural": "transformations"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A thorough or dramatic change in form, appearance, or character, often resulting in a completely new state or identity.",
      "explanation_cn": "指形式、外观或本质上的彻底或显著变化，通常导致完全新的状态或身份。",
      "example_en": "The transformation of the abandoned factory into a modern art museum amazed the entire community.",
      "example_cn": "这座废弃工厂转变为现代艺术博物馆，令整个社区感到震惊。"
    },
    {
      "pos": "noun",
      "explanation_en": "A mathematical operation that changes the position, size, or shape of a figure or function, such as rotation, translation, or scaling.",
      "explanation_cn": "指数学中对图形或函数的位置、大小或形状进行改变的操作，如旋转、平移或缩放。",
      "example_en": "The transformation of the triangle by reflection produced a mirror image on the other side of the axis.",
      "example_cn": "通过对三角形进行反射变换，在轴的另一侧得到了镜像。"
    },
    {
      "pos": "noun",
      "explanation_en": "A profound personal or societal change, especially one that leads to improved understanding, behavior, or systems.",
      "explanation_cn": "指深刻的个人或社会性转变，尤其指带来更好理解、行为或制度的变革。",
      "example_en": "Her transformation from a shy student to a confident leader was inspiring to everyone around her.",
      "example_cn": "她从一个害羞的学生转变为自信的领导者，令周围所有人都深受鼓舞。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "change",
      "analysis": "“Change” (变化) 是最通用的词，泛指任何性质、状态或形式的变动，可以是微小或表面的。而 “transformation” 强调深刻、根本性的质变，通常涉及整体结构或本质的重塑，程度远强于 “change”。"
    },
    {
      "word_to_compare": "conversion",
      "analysis": "“Conversion” (转化/转变) 常用于宗教信仰、单位制式或用途的正式转变，如“convert to Christianity”或“convert inches to centimeters”。它强调从一种明确类别到另一种的切换，而 “transformation” 更广泛，可包含内在成长、形态演化等非二元性变化。"
    },
    {
      "word_to_compare": "evolution",
      "analysis": "“Evolution” (进化/演化) 强调缓慢、渐进、自然发展的过程，常用于生物学或长期社会趋势。而 “transformation” 可以是突然的、有意识的或人为推动的剧烈变化，不一定需要时间积累。例如，一只毛毛虫变成蝴蝶是 evolution，而一个人通过培训成为专家则是 transformation。"
    }
  ]
}