{
  "word": "transit",
  "pronunciation": "tranz·it",
  "concise_definition": "n. 运输, 过境, 通过; v. 运送, 通过",
  "forms": {
    "plural": "transits",
    "third_person_singular": "transits",
    "past_tense": "transited",
    "past_participle": "transited",
    "present_participle": "transiting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The movement of people or goods from one place to another, especially over a distance, using a system of transportation such as buses, trains, or ships.",
      "explanation_cn": "指人员或货物通过公共交通系统（如巴士、火车或轮船）在不同地点之间进行的运送或移动。",
      "example_en": "The city is investing heavily in public transit to reduce traffic congestion.",
      "example_cn": "该市正大力投资公共交通，以缓解交通拥堵。"
    },
    {
      "pos": "noun",
      "explanation_en": "The passage of a celestial body across the field of view from an observer's perspective, such as a planet passing in front of the sun.",
      "explanation_cn": "指天体从观察者视野中经过的现象，例如行星从太阳前方经过。",
      "example_en": "The transit of Venus across the sun is a rare astronomical event.",
      "example_cn": "金星凌日是一种罕见的天文现象。"
    },
    {
      "pos": "verb",
      "explanation_en": "To transport or move something or someone from one place to another, especially through a particular area.",
      "explanation_cn": "指将某物或某人从一个地方运送到另一个地方，尤指经过某一特定区域。",
      "example_en": "The cargo was transited through the port before reaching its final destination.",
      "example_cn": "这批货物在抵达最终目的地前，经由该港口转运。"
    },
    {
      "pos": "verb",
      "explanation_en": "To pass across or through a place or space, often briefly or without stopping.",
      "explanation_cn": "指短暂地经过或穿越某个地方或空间，通常不作停留。",
      "example_en": "The travelers transited the country in just two days.",
      "example_cn": "这些旅行者仅用两天就穿越了这个国家。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "transport",
      "analysis": "“Transport” (运输) 是一个更广泛、更通用的词，泛指任何方式的人员或货物移动，强调动作本身。而 “transit” 更侧重于“经过”或“过境”的过程，常用于公共交通系统或地理路径的语境中，隐含路径性或中转性。"
    },
    {
      "word_to_compare": "transfer",
      "analysis": "“Transfer” (转移/转交) 强调从一个地方、系统或所有者转移到另一个，通常涉及所有权或责任的变更，如转账、转学。而 “transit” 仅指物理上的通过或移动，不涉及所有权变化，常用于物流或天文语境。"
    },
    {
      "word_to_compare": "passage",
      "analysis": "“Passage” (通过/通道) 可指物理通道（如走廊）或通过的行为，更偏向静态的路径或抽象的通过过程。而 “transit” 更强调动态的运输行为或天体运行的特定事件，具有更强的行动性和系统性。"
    }
  ]
}