{
  "word": "transverse",
  "pronunciation": "trænˈvɜrs",
  "concise_definition": "adj. 横的, 横向的, 交叉的",
  "forms": {
    "comparative": "transverse",
    "superlative": "transverse"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Situated or extending across something, especially at right angles to the long axis or direction; crossing from side to side.",
      "explanation_cn": "指位于或延伸穿过某物，特别是与长轴或主要方向成直角；从一侧到另一侧横向交叉。",
      "example_en": "The surgeon made a transverse incision across the abdomen.",
      "example_cn": "外科医生在腹部做了横向切口。"
    },
    {
      "pos": "adjective",
      "explanation_en": "In anatomy or biology, referring to a plane or structure that cuts across the body or organ, perpendicular to the longitudinal axis.",
      "explanation_cn": "在解剖学或生物学中，指与身体或器官的纵轴垂直的平面或结构。",
      "example_en": "A transverse section of the brain reveals the arrangement of gray and white matter.",
      "example_cn": "大脑的横切面显示出灰质和白质的排列方式。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used in mathematics or physics to describe a direction or vector that is perpendicular to a reference direction, often the direction of motion or propagation.",
      "explanation_cn": "在数学或物理学中，指与参考方向（通常是运动或传播方向）垂直的方向或矢量。",
      "example_en": "The transverse waves on a string move up and down while the wave travels horizontally.",
      "example_cn": "绳子上的横波上下运动，而波本身水平传播。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "longitudinal",
      "analysis": "“Longitudinal”（纵向的）指沿物体或结构的长轴方向，与 “transverse”（横向的）形成直接对比。例如，纵向切口沿身体长度方向，而横向切口则垂直于该方向。两者常用于医学和工程中描述结构或运动方向。"
    },
    {
      "word_to_compare": "crosswise",
      "analysis": "“Crosswise”（交叉地）是更口语化、非技术性的词，泛指以交叉方式放置或移动，但不强调垂直性或精确的几何关系。而 “transverse” 是专业术语，特指与主轴成90度角的横向方向，常用于科学、医学和工程语境。"
    },
    {
      "word_to_compare": "oblique",
      "analysis": "“Oblique”（斜的）指以非直角、非平行的角度倾斜，而 “transverse” 明确表示垂直交叉。例如，斜切口是倾斜的，而横切口是垂直于长轴的。两者在方向性上不同：transverse 是正交，oblique 是倾斜。"
    }
  ]
}