{
  "word": "trapped",
  "pronunciation": "træpt",
  "concise_definition": "adj. 被困住的, 无法逃脱的; v. 困住, 使陷入 (trap 的过去式和过去分词)",
  "forms": {
    "base_form": "trap",
    "third_person_singular": "traps",
    "past_tense": "trapped",
    "past_participle": "trapped",
    "present_participle": "trapping"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "In a situation from which escape is difficult or impossible, often due to physical, emotional, or social constraints.",
      "explanation_cn": "处于难以或无法逃脱的境地，通常由于身体、情感或社会方面的限制。",
      "example_en": "She felt trapped in her job, with no way to advance or leave.",
      "example_cn": "她觉得自己被困在了这份工作中，既无法晋升，也无法离开。"
    },
    {
      "pos": "verb",
      "explanation_en": "To catch or confine someone or something in a place from which escape is impossible, often using physical barriers or deception.",
      "explanation_cn": "通过物理障碍或欺骗手段将某人或某物困在无法逃脱的地方。",
      "example_en": "The firefighters trapped the fire in the basement before it spread to the upper floors.",
      "example_cn": "消防员将火势困在地下室，防止其蔓延到上层。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause someone to be in a difficult or unpleasant situation from which they cannot easily escape, often emotionally or morally.",
      "explanation_cn": "使某人陷入一种难以摆脱的困难或不愉快的境地，常指情感或道德上的困境。",
      "example_en": "He was trapped by his own promises and couldn't back out of the deal.",
      "example_cn": "他被自己的承诺所束缚，无法退出这笔交易。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "caught",
      "analysis": "“Caught” (被抓住) 通常指被突然捕获或发现，强调动作的瞬间性，如被警察抓住或被逮个正着。而 “trapped” 更强调持续性的束缚状态，即使没有立即被抓住，也可能因环境或条件而无法脱身。"
    },
    {
      "word_to_compare": "confined",
      "analysis": "“Confined” (被限制) 指在空间或范围上受到限制，但不一定意味着完全无法逃脱，有时是合法或暂时性的限制（如住院隔离）。而 “trapped” 暗示更强烈的无助感和逃脱的不可能性，常带有紧急或危险的语义色彩。"
    },
    {
      "word_to_compare": "imprisoned",
      "analysis": "“Imprisoned” (被监禁) 专指因法律或权威机构而被关押在监狱中，具有明确的制度性含义。而 “trapped” 更广泛，可用于自然、情感、社会等各种非正式或非制度性的困境，语义范围更广，情感色彩更强。"
    }
  ]
}