{
  "word": "traps",
  "pronunciation": "traps",
  "concise_definition": "n. 陷阱, 圈套, 捕兽器; v. 诱捕, 使陷入, 设圈套",
  "forms": {
    "singular": "trap",
    "third_person_singular": "traps",
    "past_tense": "trapped",
    "past_participle": "trapped",
    "present_participle": "trapping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A device or scheme designed to catch or entangle animals, people, or objects, often by surprise or deception.",
      "explanation_cn": "一种设计用来捕捉或困住动物、人或物体的装置或手段，通常通过突然袭击或欺骗实现。",
      "example_en": "The hunter set a trap to catch foxes near the forest edge.",
      "example_cn": "猎人在森林边缘设下陷阱捕捉狐狸。"
    },
    {
      "pos": "noun",
      "explanation_en": "A deceptive situation or strategy intended to mislead or ensnare someone, often for personal gain or to cause harm.",
      "explanation_cn": "一种旨在误导或诱骗他人的欺骗性情境或策略，通常为了个人利益或造成伤害。",
      "example_en": "The scammer used a phishing email as a trap to steal passwords.",
      "example_cn": "骗子使用钓鱼邮件作为陷阱来窃取密码。"
    },
    {
      "pos": "verb",
      "explanation_en": "To catch or entangle someone or something in a trap, either physically or metaphorically.",
      "explanation_cn": "通过物理或隐喻的方式将某人或某物困住或捕获。",
      "example_en": "The police trapped the suspect in the abandoned warehouse.",
      "example_cn": "警察将嫌疑人困在了废弃的仓库里。"
    },
    {
      "pos": "verb",
      "explanation_en": "To inadvertently cause someone to be caught in a difficult or undesirable situation, often due to their own actions or words.",
      "explanation_cn": "无意中使某人陷入困境或不理想的情境，通常是因为他们自己的言行所致。",
      "example_en": "His careless comment trapped him into admitting guilt.",
      "example_cn": "他轻率的言辞使自己不得不承认有罪。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "snare",
      "analysis": "“Snare” (诱捕装置) 通常指一种细绳或网状的捕猎工具，多用于捕捉小型动物，强调隐蔽性和物理性捕捉。它比 “trap” 更具体，常带有诗意或文学色彩，而 “trap” 适用范围更广，可指物理陷阱或抽象圈套。"
    },
    {
      "word_to_compare": "lure",
      "analysis": "“Lure” (诱饵/引诱物) 指吸引某人或某物靠近的手段，通常是通过诱惑（如食物、利益）实现，本身不包含“困住”的动作。而 “trap” 强调最终的捕获或陷入，是结果导向的。例如：用鱼饵（lure）钓鱼，但鱼钩才是陷阱（trap）。"
    },
    {
      "word_to_compare": "pitfall",
      "analysis": "“Pitfall” (陷阱/隐患) 多用于抽象语境，指潜在的危险或错误，常因疏忽而陷入，如“职业发展的陷阱”。它强调的是未被察觉的风险，而非人为设计的圈套。而 “trap” 更强调主动设置的、有目的的诱捕行为。"
    }
  ]
}