{
  "word": "trashed",
  "pronunciation": "trash·id",
  "concise_definition": "adj. 被严重破坏的, 被丢弃的; v. (trash 的过去式和过去分词) 破坏, 丢弃, 狂乱地跳舞",
  "forms": {
    "base_form": "trash",
    "third_person_singular": "trashes",
    "present_participle": "trashing",
    "past_tense": "trashed",
    "past_participle": "trashed"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "In a state of severe damage, disorder, or decay; often used to describe something that has been ruined, neglected, or left in a messy condition.",
      "explanation_cn": "处于严重损坏、混乱或腐烂的状态；常用于描述被毁坏、被忽视或处于杂乱无章状况的事物。",
      "example_en": "The apartment was trashed after the party—couches overturned, glasses shattered, and graffiti on the walls.",
      "example_cn": "派对之后公寓被搞得一团糟：沙发翻倒，玻璃杯碎裂，墙上还涂满了涂鸦。"
    },
    {
      "pos": "verb",
      "explanation_en": "To damage or destroy something thoroughly, often intentionally or through reckless behavior.",
      "explanation_cn": "彻底地破坏或毁掉某物，通常是有意为之或因鲁莽行为所致。",
      "example_en": "The protesters trashed the storefront during the demonstration.",
      "example_cn": "示威者在游行期间砸毁了这家商店的橱窗。"
    },
    {
      "pos": "verb",
      "explanation_en": "To discard something as worthless or useless; to throw away.",
      "explanation_cn": "将某物视为无价值或无用而丢弃。",
      "example_en": "She trashed the old laptop after buying a new one.",
      "example_cn": "她买了一台新笔记本电脑后，就把旧的扔了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To dance wildly and energetically, especially in a nightclub or party setting (slang, primarily in Australian and British English).",
      "explanation_cn": "在夜总会或派对场合疯狂而充满活力地跳舞（俚语，主要见于澳大利亚和英国英语）。",
      "example_en": "We trashed the dance floor all night long at the festival.",
      "example_cn": "我们在音乐节上整晚都在舞池里疯狂跳舞。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "destroyed",
      "analysis": "“Destroyed” (摧毁) 强调彻底的物理性毁灭，通常带有不可逆的后果，语气更严肃、正式。而 “trashed” 更口语化，常用于描述混乱、脏乱或非致命性的破坏，不一定完全无法修复。"
    },
    {
      "word_to_compare": "rubbished",
      "analysis": "“Rubbished” (英式俚语，意为“丢弃”或“贬低”) 与 “trashed” 在“丢弃”义项上接近，但 “rubbished” 更常用于批评某物或某人毫无价值（如：He rubbished the proposal），而 “trashed” 更多指物理上的破坏或丢弃。"
    },
    {
      "word_to_compare": "wrecked",
      "analysis": "“Wrecked” (毁坏) 常用于描述事故或灾难造成的严重损坏（如车祸后车辆被 wrecked），带有意外或灾难性色彩。而 “trashed” 更强调人为的、混乱的、甚至带有情绪性的破坏行为，如愤怒或狂欢导致的破坏。"
    }
  ]
}