{
  "word": "tread",
  "pronunciation": "tred",
  "concise_definition": "v. 踩, 踏; n. 踏面, 踏步",
  "forms": {
    "third_person_singular": "treads",
    "past_tense": "trod",
    "past_participle": "trodden",
    "present_participle": "treading"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To step or walk on something, especially with deliberate or heavy pressure; to move by stepping.",
      "explanation_cn": "指踩在某物上，尤其是带着刻意或沉重的压力行走；通过脚步移动。",
      "example_en": "She tread carefully on the icy path to avoid slipping.",
      "example_cn": "她小心翼翼地走在结冰的小路上，以免滑倒。"
    },
    {
      "pos": "verb",
      "explanation_en": "To occupy or traverse a place, often metaphorically, as in following a path or course of action.",
      "explanation_cn": "指占据或穿越某个地方，常用于比喻意义，如遵循某种路径或行动方针。",
      "example_en": "He tread the same path as his father, entering the family business.",
      "example_cn": "他走上了父亲的老路，进入了家族企业。"
    },
    {
      "pos": "noun",
      "explanation_en": "The part of a tire or shoe sole that makes contact with the ground, designed to provide grip and traction.",
      "explanation_cn": "指轮胎或鞋底与地面接触的部分，设计用于提供抓地力和防滑性能。",
      "example_en": "The tread on his tires was worn thin, making driving dangerous in the rain.",
      "example_cn": "他的轮胎胎纹已经磨得很薄，雨天开车很危险。"
    },
    {
      "pos": "noun",
      "explanation_en": "A step or stair in a staircase; the horizontal surface of a step.",
      "explanation_cn": "指楼梯中的一个台阶；台阶的水平表面。",
      "example_en": "Be careful not to miss the last tread; it's a little higher than the others.",
      "example_cn": "小心别踩空最后一级台阶，它比其他的要高一点。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "step",
      "analysis": "“Step” (脚步/台阶) 是更通用的词，泛指任何一次抬脚落地的动作或楼梯的单级，不强调压力或接触面的结构。“Tread” 作为动词时更强调踩踏的力度或方式，作为名词时特指鞋底或轮胎的接触面或楼梯的水平面，更具技术性。"
    },
    {
      "word_to_compare": "walk",
      "analysis": "“Walk” (行走) 是一个更广泛、更抽象的动词，指移动身体的整个过程，不涉及具体接触点。“Tread” 则聚焦于脚与地面接触的瞬间动作，常用于强调谨慎、沉重或特定方式的行走，语义更具体、更具画面感。"
    },
    {
      "word_to_compare": "groove",
      "analysis": "“Groove” (凹槽) 指物体表面的纵向凹陷，常用于描述轮胎或轨道上的纹路，但本身不是接触面。“Tread” 是轮胎或鞋底上实际接触地面的凸起部分，而 “groove” 是其之间的凹陷部分，二者是互补结构，常在描述轮胎时同时出现。"
    }
  ]
}