{
  "word": "trent",
  "pronunciation": "trent",
  "concise_definition": "n. 特伦特（专有名词，地名/人名）",
  "forms": {
    "plural": "trents"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to the River Trent, a major river in central England, flowing through the Midlands and joining the River Ouse to form the Humber Estuary.",
      "explanation_cn": "专有名词，指位于英格兰中部的主要河流特伦特河，流经米德兰兹地区，最终与乌斯河汇合形成亨伯河口。",
      "example_en": "The historic city of Nottingham lies along the banks of the River Trent.",
      "example_cn": "历史悠久的诺丁汉市位于特伦特河畔。"
    },
    {
      "pos": "noun",
      "explanation_en": "A proper noun used as a surname, notably associated with individuals such as Trent Reznor, the American musician and founder of Nine Inch Nails.",
      "explanation_cn": "用作姓氏的专有名词，例如美国音乐人特伦特·雷泽诺（Trent Reznor），九寸钉乐队的创始人。",
      "example_en": "Trent Reznor's innovative sound design revolutionized industrial rock music.",
      "example_cn": "特伦特·雷泽诺创新的声音设计彻底改变了工业摇滚音乐。"
    },
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to the Council of Trent (1545–1563), a pivotal ecumenical council of the Roman Catholic Church that addressed issues of doctrine and reform in response to the Protestant Reformation.",
      "explanation_cn": "专有名词，指特伦特大公会议（1545–1563年），这是罗马天主教会为回应宗教改革而召开的关键性普世会议，旨在澄清教义并推动教会改革。",
      "example_en": "The Council of Trent established many of the doctrines still upheld by the Catholic Church today.",
      "example_cn": "特伦特大公会议确立了许多至今仍被天主教会奉行的教义。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "river",
      "analysis": "“River” 是通用名词，泛指任何自然水流通道，而 “Trent” 是特指英格兰一条具体河流的专有名词，不具备通用性。不能互换使用，但 “Trent” 是 “river” 的一个具体实例。"
    },
    {
      "word_to_compare": "council",
      "analysis": "“Council” 是泛指任何决策或管理团体，而 “Council of Trent” 是特指16世纪天主教会的一次历史性会议，属于专有名词短语。前者是类别，后者是具体事件。"
    },
    {
      "word_to_compare": "name",
      "analysis": "“Name” 是泛指任何称呼或标识，而 “Trent” 作为人名或地名，是 “name” 的一个具体用例。它本身不是通用词，而是承载特定文化、历史或地理意义的专有名称。"
    }
  ]
}