{
  "word": "triangular",
  "pronunciation": "trai·ang·gyuh·lər",
  "concise_definition": "adj. 三角形的, 三角的",
  "forms": {
    "comparative": "triangularer",
    "superlative": "triangularest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having the shape of a triangle, with three straight sides and three angles; characterized by three distinct parts or elements.",
      "explanation_cn": "具有三角形形状的，有三条直边和三个角；也指由三个不同部分或要素构成的。",
      "example_en": "The pyramid's base is a triangular structure made of stone.",
      "example_cn": "这座金字塔的底座是一个由石头制成的三角形结构。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or involving three parties, sides, or elements, especially in contexts such as relationships, politics, or mathematics.",
      "explanation_cn": "涉及三方、三方面或三个要素的，尤其用于描述关系、政治或数学情境中的三方互动。",
      "example_en": "The negotiation took a triangular form, with the government, the union, and the corporation as the three key players.",
      "example_cn": "这场谈判呈现出三方格局，政府、工会和企业是三个关键参与者。"
    },
    {
      "pos": "adjective",
      "explanation_en": "In mathematics, describing a matrix or distribution that has a triangular shape, such as a triangular matrix or triangular distribution.",
      "explanation_cn": "在数学中，指具有三角形形状的矩阵或分布，例如三角矩阵或三角分布。",
      "example_en": "The data follows a triangular probability distribution, with the peak at the median value.",
      "example_cn": "这些数据遵循三角概率分布，峰值位于中位数处。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "trilateral",
      "analysis": "“Trilateral”（三方的）专指涉及三个国家、组织或实体之间的关系，强调政治或外交语境中的三方互动，如“trilateral talks”（三方会谈）。而 “triangular” 更广泛，可指形状、结构或抽象关系中的三方性，不限于政治实体。"
    },
    {
      "word_to_compare": "three-sided",
      "analysis": "“Three-sided” 是对 “triangular” 的直译描述，仅强调几何意义上的三条边，语义更狭窄、更口语化。而 “triangular” 是标准术语，既可用于几何形状，也可用于比喻性语境（如三角关系），更具专业性和语义丰富性。"
    },
    {
      "word_to_compare": "polygonal",
      "analysis": "“Polygonal”（多边形的）泛指具有三条或以上边的平面图形，包括四边形、五边形等。而 “triangular” 是其子集，特指仅有三条边的多边形，因此语义更精确、范围更小。"
    }
  ]
}