{
  "word": "tribune",
  "pronunciation": "trahy·byoon",
  "concise_definition": "n. 发言人, 讲坛, 古罗马护民官",
  "forms": {
    "plural": "tribunes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who speaks or writes in defense of the rights or interests of ordinary people, especially in a public or political context.",
      "explanation_cn": "指在公共或政治语境中为普通民众的权利或利益发声或辩护的人，常带有强烈的社会正义色彩。",
      "example_en": "The journalist became a tribune for the working class, exposing corruption in local government.",
      "example_cn": "这位记者成为工人阶级的代言人，揭露了地方政府的腐败行为。"
    },
    {
      "pos": "noun",
      "explanation_en": "A raised platform or structure from which speeches are delivered, especially in ancient Rome or in modern public spaces.",
      "explanation_cn": "指古代罗马或现代公共场合中用于发表演讲的高台或讲坛。",
      "example_en": "The politician stood at the tribune to address the crowd gathered in the forum.",
      "example_cn": "这位政治家站在讲坛上，向聚集在广场上的人群发表讲话。"
    },
    {
      "pos": "noun",
      "explanation_en": "An official in ancient Rome elected to protect the rights of the common people (plebeians) against the patrician class; a position of significant political power.",
      "explanation_cn": "指古罗马时期由平民选举产生的官员，旨在保护平民（plebeians）免受贵族（patricians）的压迫，是具有重要政治权力的职位。",
      "example_en": "The tribune used his veto power to block the Senate's unjust law.",
      "example_cn": "这位护民官动用了否决权，阻止了元老院的不公正法律。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "spokesperson",
      "analysis": "“Spokesperson”（发言人）泛指代表某组织、团体或个人发表声明的人，强调的是代理性和官方性，不必然带有为民请命的道德色彩。而 “tribune” 更具历史和政治象征意义，常隐含对弱势群体的捍卫和抗争精神。"
    },
    {
      "word_to_compare": "platform",
      "analysis": "“Platform”（平台）在物理意义上可指讲坛，但更多用于比喻义，如政治纲领或社交媒体上的发声渠道。它是一个抽象或中性的载体，而 “tribune” 作为讲坛时，特指用于公共演说的实体结构，且常与政治权力和民众动员相关联。"
    },
    {
      "word_to_compare": "advocate",
      "analysis": "“Advocate”（倡导者）指积极支持或为某人/某事辩护的人，范围广泛，可用于法律、社会、环保等各个领域。而 “tribune” 不仅包含辩护之意，还承载着古罗马制度的历史重量，特指拥有法定权力（如否决权）的官方职位，语义更具体、更具制度性。"
    }
  ]
}