{
  "word": "trick",
  "pronunciation": "trik",
  "concise_definition": "n. 诡计, 诀窍, 恶作剧; v. 欺骗, 诱骗",
  "forms": {
    "third_person_singular": "tricks",
    "past_tense": "tricked",
    "past_participle": "tricked",
    "present_participle": "tricking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A clever or deceptive action or scheme designed to achieve a goal, often by misleading or manipulating others.",
      "explanation_cn": "一种巧妙或欺骗性的行为或计谋，旨在通过误导或操纵他人来达成目标。",
      "example_en": "He used a trick to get the password from the unsuspecting employee.",
      "example_cn": "他用了一个计谋，从毫无戒心的员工那里套出了密码。"
    },
    {
      "pos": "noun",
      "explanation_en": "A skillful technique or method, especially one that is not obvious or requires practice to master.",
      "explanation_cn": "一种巧妙的技巧或方法，尤其是那些不明显或需要练习才能掌握的技巧。",
      "example_en": "The magician's trick with the disappearing coin left the audience amazed.",
      "example_cn": "魔术师那个消失硬币的绝技让观众惊叹不已。"
    },
    {
      "pos": "noun",
      "explanation_en": "A playful or mischievous act intended to surprise or amuse, often harmless but sometimes annoying.",
      "explanation_cn": "一种旨在制造惊喜或娱乐的顽皮或淘气行为，通常无害，但有时令人烦恼。",
      "example_en": "The children played a trick on their teacher by putting a whoopee cushion on her chair.",
      "example_cn": "孩子们在老师的椅子上放了一个笑气坐垫，捉弄了她。"
    },
    {
      "pos": "verb",
      "explanation_en": "To deceive or mislead someone, often by exploiting their trust or lack of knowledge.",
      "explanation_cn": "通过利用他人的信任或无知来欺骗或误导某人。",
      "example_en": "Don't let them trick you into signing the contract without reading it.",
      "example_cn": "别让他们骗你没看合同就签字。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cheat",
      "analysis": "“Cheat”（作弊/欺诈）强调违反规则或道德准则以获取不正当利益，通常带有更强的负面道德评判，如考试作弊或赌博欺诈。而 “trick” 可以是中性甚至幽默的，不一定涉及规则破坏，比如魔术师的表演技巧。"
    },
    {
      "word_to_compare": "skill",
      "analysis": "“Skill”（技能）指通过学习和练习获得的熟练能力，是正面、正当的。而 “trick” 虽然也可以指技巧，但常隐含“非显而易见”或“带有欺骗性”的意味，有时带有贬义或调侃色彩。"
    },
    {
      "word_to_compare": "prank",
      "analysis": "“Prank”（恶作剧）是 “trick” 的一个子类，特指无害的、以娱乐为目的的捉弄行为，如在门把手涂胶水。而 “trick” 的范围更广，可包括恶意欺骗、商业欺诈或技术诀窍，不局限于玩笑。"
    }
  ]
}