{
  "word": "tries",
  "pronunciation": "trīz",
  "concise_definition": "n. 尝试, 试图; v. 试图, 尝试, 审判",
  "forms": {
    "base_form": "try",
    "third_person_singular": "tries",
    "past_tense": "tried",
    "past_participle": "tried",
    "present_participle": "trying"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An attempt or effort to accomplish something, especially when success is uncertain or has not yet been achieved.",
      "explanation_cn": "指为达成某目标而做出的努力或尝试，尤其当成功尚不确定或尚未实现时。",
      "example_en": "She made three tries to solve the puzzle before giving up.",
      "example_cn": "她在放弃之前尝试了三次来解开这个谜题。"
    },
    {
      "pos": "noun",
      "explanation_en": "In rugby or American football, a scoring play in which a player grounds the ball over the opponent's goal line.",
      "explanation_cn": "在橄榄球或美式足球中，指球员将球压在对方球门线后方以得分的进攻动作。",
      "example_en": "The team scored a try after a brilliant breakaway run.",
      "example_cn": "球队在一次精彩的突破后达阵得分。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make an effort to do something, especially when the outcome is uncertain or challenging.",
      "explanation_cn": "指努力去做某事，尤其当结果不确定或具有挑战性时。",
      "example_en": "I tried calling you yesterday, but your phone was off.",
      "example_cn": "我昨天试着给你打电话，但你的手机关机了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To subject someone or something to a legal process to determine guilt or validity.",
      "explanation_cn": "指通过法律程序来判定某人或某事是否有罪或是否有效。",
      "example_en": "The suspect was tried for theft in a federal court.",
      "example_cn": "这名嫌疑人因盗窃在联邦法院受审。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "attempt",
      "analysis": "“Attempt” (尝试) 更正式，强调有意识地发起一个行动，但不一定包含多次尝试的含义。它常用于书面语或正式语境，如“an attempt to escape”。而 “try” 更口语化，可指一次或多次尝试，语义更宽泛，也常用于日常表达。"
    },
    {
      "word_to_compare": "test",
      "analysis": "“Test” (测试) 指为检验性能、质量或能力而进行的系统性评估，通常有明确的标准和目的，如考试或实验。而 “try” 更侧重于主观努力或尝试达成目标，不一定有评估意图。"
    },
    {
      "word_to_compare": "experiment",
      "analysis": "“Experiment” (实验) 强调通过系统性操作来探索未知或验证假设，常用于科学或研究语境。它比 “try” 更结构化、更严谨。而 “try” 可以是随意的、非正式的尝试，不依赖方法论。"
    }
  ]
}