{
  "word": "trigger",
  "pronunciation": "trig·er",
  "concise_definition": "n. 触发器, 导火索; v. 触发, 引发",
  "forms": {
    "third_person_singular": "triggers",
    "past_tense": "triggered",
    "past_participle": "triggered",
    "present_participle": "triggering"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A mechanism or device that, when activated, initiates a process or action, especially in a mechanical or electronic system.",
      "explanation_cn": "指在机械或电子系统中，一旦被激活就会启动某个过程或动作的装置或部件。",
      "example_en": "The gun's trigger must be pulled with precision to avoid accidental discharge.",
      "example_cn": "必须精确地扣动枪的扳机，以避免意外走火。"
    },
    {
      "pos": "noun",
      "explanation_en": "An event, situation, or stimulus that causes a reaction, often an emotional or psychological response.",
      "explanation_cn": "指引发某种反应（尤其是情绪或心理反应）的事件、情境或刺激因素。",
      "example_en": "Loud noises can trigger anxiety in people with PTSD.",
      "example_cn": "巨大的噪音可能引发创伤后应激障碍患者的焦虑。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to happen or start, especially suddenly or unexpectedly, often a chain reaction or significant change.",
      "explanation_cn": "指导致某事发生或启动，尤其是突然或意外地引发一系列反应或重大变化。",
      "example_en": "The economic crisis triggered widespread unemployment across the region.",
      "example_cn": "经济危机引发了该地区的大规模失业。"
    },
    {
      "pos": "verb",
      "explanation_en": "To activate a mechanism or device by applying pressure or a signal, especially in firearms or automated systems.",
      "explanation_cn": "指通过施加压力或信号来激活某种装置，尤指枪械或自动化系统中的触发机制。",
      "example_en": "The sensor triggered the alarm as soon as the door was opened.",
      "example_cn": "门一打开，传感器就触发了警报。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cause",
      "analysis": "“Cause” (原因) 是一个更广泛、更抽象的术语，指导致结果发生的任何因素，强调逻辑上的因果关系。而 “trigger” 更强调直接、即时、具体的启动作用，常带有突发性或连锁反应的意味。"
    },
    {
      "word_to_compare": "initiate",
      "analysis": "“Initiate” (发起) 通常指有计划、有意识地开始一个过程，语气更正式，常用于组织、程序或仪式。而 “trigger” 更强调被动或外部因素引发的反应，不一定包含意图或规划。"
    },
    {
      "word_to_compare": "provoke",
      "analysis": "“Provoke” (激怒/挑起) 通常带有负面含义，指故意刺激某人产生愤怒、反抗或情绪反应。而 “trigger” 更中性，可用于情绪、机械、技术等多种语境，不一定涉及主观意图。"
    }
  ]
}