{
  "word": "triggered",
  "pronunciation": "trig·er·d",
  "concise_definition": "adj. 被触发的, 情绪激动的, 受刺激的",
  "forms": {
    "base_form": "trigger",
    "present_participle": "triggering",
    "past_tense": "triggered",
    "past_participle": "triggered"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "In a state of heightened emotional sensitivity or reactivity, often due to exposure to a stimulus associated with past trauma or strong emotional experience.",
      "explanation_cn": "处于情绪高度敏感或易激惹的状态，通常是因为接触到与过去创伤或强烈情感经历相关的刺激物。",
      "example_en": "The comment triggered her anxiety, reminding her of a painful childhood event.",
      "example_cn": "这句话触发了她的焦虑，让她想起了痛苦的童年经历。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used informally to describe someone who reacts strongly or defensively to a particular idea, statement, or situation, often in a way perceived as overly sensitive or exaggerated.",
      "explanation_cn": "非正式用法，形容某人对特定观点、言论或情境反应强烈或防御性过强，常被视为过度敏感或夸张。",
      "example_en": "He got triggered when someone joked about his accent, even though it was meant playfully.",
      "example_cn": "有人开他口音的玩笑，虽然本意是开玩笑，他却立刻被激怒了。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Activated or set off by a specific event, mechanism, or condition, especially in a technical or mechanical context.",
      "explanation_cn": "由特定事件、机制或条件所激活或引发，尤其用于技术或机械语境中。",
      "example_en": "The alarm system was triggered by a sudden movement in the room.",
      "example_cn": "房间里的突然移动触发了警报系统。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "provoked",
      "analysis": "“Provoked” (激怒) 强调外部行为或言语有意地引起愤怒或反应，通常带有主观挑衅的意图。而 “triggered” 更侧重于内在心理机制的自动反应，尤其与创伤或潜意识关联，不一定需要对方有意为之。"
    },
    {
      "word_to_compare": "stimulated",
      "analysis": "“Stimulated” (刺激) 是中性或积极的术语，指通过外部因素激发兴趣、活力或反应，常用于生理、认知或经济语境。而 “triggered” 常带有负面或情绪化色彩，尤其在心理语境中暗示失控或不适反应。"
    },
    {
      "word_to_compare": "activated",
      "analysis": "“Activated” (激活) 是技术性术语，指系统、机制或功能被启动，完全中性，无情绪含义。而 “triggered” 在非技术语境中常带有情感或心理层面的强烈反应，语义更丰富、更主观。"
    }
  ]
}