{
  "word": "trim",
  "pronunciation": "trim",
  "concise_definition": "v. 修剪, 削减, 整理; n. 装饰, 边饰",
  "forms": {
    "third_person_singular": "trims",
    "past_tense": "trimmed",
    "past_participle": "trimmed",
    "present_participle": "trimming"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To cut or remove excess parts from something, especially to improve its appearance, function, or efficiency.",
      "explanation_cn": "指剪去或移除某物的多余部分，以改善其外观、功能或效率。",
      "example_en": "She trimmed the hedges to make the garden look neater.",
      "example_cn": "她修剪了灌木丛，使花园看起来更整洁。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reduce the amount, size, or cost of something, especially to save money or resources.",
      "explanation_cn": "指减少某物的数量、规模或成本，通常是为了节省金钱或资源。",
      "example_en": "The company trimmed its budget by cutting unnecessary travel expenses.",
      "example_cn": "公司通过削减不必要的差旅开支来缩减预算。"
    },
    {
      "pos": "verb",
      "explanation_en": "To dress or adorn something with decorative edges or borders, often used in fashion or interior design.",
      "explanation_cn": "指用装饰性的边缘或边饰来装扮某物，常用于时尚或室内设计领域。",
      "example_en": "The dress was trimmed with lace and silk ribbons.",
      "example_cn": "这条裙子饰有蕾丝和丝带边。"
    },
    {
      "pos": "noun",
      "explanation_en": "A decorative border or edge added to clothing, furniture, or other objects for aesthetic purposes.",
      "explanation_cn": "指为衣物、家具或其他物品添加的装饰性边缘或边饰，用于美化目的。",
      "example_en": "The curtains had a gold trim along the bottom.",
      "example_cn": "窗帘底部有一条金色的边饰。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cut",
      "analysis": "“Cut” (切割) 是一个更广泛、更通用的词，指任何用工具分离或断开的行为，不带有改善或修饰的意图。而 “trim” 特指有选择性地剪去多余部分，通常是为了美观、整齐或优化，带有更精细、更审慎的含义。"
    },
    {
      "word_to_compare": "reduce",
      "analysis": "“Reduce” (减少) 是一个抽象的、通用的词，用于数量、规模、程度等的降低，不涉及物理操作。而 “trim” 在表示削减时，常带有具体、实际的行动意味，如削减开支、修剪枝叶，更强调通过去除部分来提升整体质量。"
    },
    {
      "word_to_compare": "decorate",
      "analysis": "“Decorate” (装饰) 指为某物添加装饰元素以增强美感，但不涉及移除或修剪。而 “trim” 作为名词时，特指作为装饰的边饰本身；作为动词时，它既包含添加装饰（如镶边），也包含修剪整理，具有双重含义，比 “decorate” 更具功能性。"
    }
  ]
}