{
  "word": "trimmed",
  "pronunciation": "trimd",
  "concise_definition": "v. 修剪, 削减, 整理; adj. 整洁的, 精炼的",
  "forms": {
    "base_form": "trim",
    "past_tense": "trimmed",
    "past_participle": "trimmed",
    "present_participle": "trimming",
    "third_person_singular": "trims"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To cut or remove excess parts from something, especially to improve its appearance, function, or efficiency.",
      "explanation_cn": "指剪去或移除某物的多余部分，以改善其外观、功能或效率。",
      "example_en": "She trimmed the hedges to give the garden a neat appearance.",
      "example_cn": "她修剪了灌木丛，使花园看起来更整洁。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reduce the amount, size, or cost of something, especially to save money or resources.",
      "explanation_cn": "指减少某物的数量、规模或成本，通常是为了节省金钱或资源。",
      "example_en": "The company trimmed its budget by eliminating nonessential expenses.",
      "example_cn": "公司通过削减非必要开支来缩减预算。"
    },
    {
      "pos": "verb",
      "explanation_en": "To decorate or adorn something with a border, fringe, or ornamental edge, often by adding or arranging material neatly.",
      "explanation_cn": "指用边饰、流苏或装饰性边缘来点缀某物，通常通过整齐地添加或排列材料实现。",
      "example_en": "The dress was trimmed with lace and silk ribbons.",
      "example_cn": "这条裙子用蕾丝和丝带做了装饰边。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Neatly arranged or reduced to a minimal, efficient, or elegant form; free from excess or clutter.",
      "explanation_cn": "指经过精心整理或精简，达到最小化、高效或优雅的状态，无多余或杂乱部分。",
      "example_en": "He gave a trimmed-down version of his speech for the time-limited presentation.",
      "example_cn": "他为时间有限的演讲提供了一个精简版的发言稿。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cut",
      "analysis": "“Cut” (切割) 是一个更广泛、更基础的动词，泛指任何用工具分离或断开的行为，不隐含目的性。而 “trimmed” 特指有选择性地、细致地剪除多余部分，通常是为了美观、效率或精确性，带有修饰和优化的意味。"
    },
    {
      "word_to_compare": "reduce",
      "analysis": "“Reduce” (减少) 强调数量或规模的降低，常用于抽象概念（如风险、成本、人口），不涉及物理形态的改变。而 “trimmed” 既可以用于物理对象（如修剪树枝），也可用于抽象事物（如缩减预算），但更强调通过精简来提升质量或整洁度。"
    },
    {
      "word_to_compare": "decoration",
      "analysis": "“Decoration” (装饰) 是名词，指用于美化的事物本身，而 “trimmed” 作为动词时，描述的是进行装饰的动作，作为形容词时则描述结果状态。两者语义相关，但词性和功能不同：‘trimmed’ 是动作或状态，‘decoration’ 是对象。"
    }
  ]
}