{
  "word": "trinity",
  "pronunciation": "trin·uh·tee",
  "concise_definition": "n. 三位一体, 三合一, 三重组合",
  "forms": {
    "plural": "trinities"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "In Christian theology, the doctrine that God exists as three distinct persons — the Father, the Son (Jesus Christ), and the Holy Spirit — who are coeternal, coequal, and united as one divine essence.",
      "explanation_cn": "在基督教神学中，指上帝以三个 distinct 的位格存在——圣父、圣子（耶稣基督）和圣灵——三者同永恒、同同等，且合为一体神性本质的教义。",
      "example_en": "The concept of the Holy Trinity is central to most Christian denominations.",
      "example_cn": "三位一体的概念是大多数基督教派别的核心教义。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group or combination of three closely related or interdependent people, things, or elements regarded as a unified whole.",
      "explanation_cn": "指三个密切相关或相互依存的人、事物或元素，被视为一个统一的整体。",
      "example_en": "The trinity of chef, sommelier, and maître d' ensures a perfect dining experience.",
      "example_cn": "主厨、侍酒师和餐厅经理这三位一体确保了完美的用餐体验。"
    },
    {
      "pos": "noun",
      "explanation_en": "A set of three related concepts, principles, or components that function together as a single system or unit.",
      "explanation_cn": "指三个相互关联的概念、原则或组成部分，共同构成一个单一系统或单元。",
      "example_en": "In ancient philosophy, the trinity of truth, beauty, and goodness was considered the highest ideals.",
      "example_cn": "在古代哲学中，真、善、美三位一体被视为最高的理想。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "triad",
      "analysis": "“Triad”（三元组）泛指任何由三个部分组成的群体或组合，不带有宗教或神圣含义，常用于社会学、音乐或犯罪组织（如黑手党三巨头）。而 “trinity” 通常带有神圣性、统一性或深刻哲学意义，强调三者本质合一。"
    },
    {
      "word_to_compare": "triple",
      "analysis": "“Triple”（三重的）是一个形容词或名词，仅表示数量上的三个，强调重复或倍增，如 triple threat（三重威胁）或 triple crown（三冠王）。它不隐含统一性或内在联系，而 “trinity” 强调三者融合为一个有机整体。"
    },
    {
      "word_to_compare": "triune",
      "analysis": "“Triune” 是一个形容词，直接描述“三位一体的”状态，常用于神学语境中，如 “the triune God”。它本质上是 “trinity” 的形容词形式，而 “trinity” 是名词，指代该概念本身。两者语义高度相关，但词性与用法不同。"
    }
  ]
}