{
  "word": "triumph",
  "pronunciation": "trai·umf",
  "concise_definition": "n. 胜利, 成功; v. 获得胜利, 战胜",
  "forms": {
    "third_person_singular": "triumphs",
    "past_tense": "triumphed",
    "past_participle": "triumphed",
    "present_participle": "triumphing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A great victory or achievement, especially one that is hard-won or overcomes significant obstacles; often carries a sense of celebration or pride.",
      "explanation_cn": "指一项艰难取得或克服了重大障碍的重大胜利或成就，常带有庆祝或自豪的意味。",
      "example_en": "The team's triumph in the final match was celebrated by thousands of fans.",
      "example_cn": "球队在决赛中的胜利赢得了成千上万球迷的庆祝。"
    },
    {
      "pos": "noun",
      "explanation_en": "A feeling of great satisfaction or joy resulting from success, especially after a struggle or challenge.",
      "explanation_cn": "指在经历斗争或挑战后取得成功所带来的巨大满足感或喜悦。",
      "example_en": "She felt a quiet triumph as she submitted her thesis after years of hard work.",
      "example_cn": "经过多年的努力，她在提交论文时感到一种宁静的胜利感。"
    },
    {
      "pos": "verb",
      "explanation_en": "To achieve a decisive victory over an opponent, obstacle, or difficulty; to prevail despite adversity.",
      "explanation_cn": "指战胜对手、障碍或困难，取得决定性胜利；在逆境中取得优势。",
      "example_en": "Despite the odds, she triumphed over her fears and gave a flawless performance.",
      "example_cn": "尽管困难重重，她还是战胜了恐惧，献上了一场完美的演出。"
    },
    {
      "pos": "verb",
      "explanation_en": "To experience or express great joy or satisfaction as a result of success.",
      "explanation_cn": "指因成功而感到或表现出极大的喜悦或满足。",
      "example_en": "The inventor triumphed in the knowledge that his invention would change lives.",
      "example_cn": "这位发明家因自己的发明将改变人们的生活而感到无比欣慰。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "victory",
      "analysis": "“Victory” (胜利) 是一个更中性、更通用的词，泛指在竞争、战争或比赛中获胜，侧重于结果本身。而 “triumph” 不仅表示获胜，还强调胜利的辉煌性、戏剧性或情感上的升华，常带有强烈的成就感和庆祝色彩。"
    },
    {
      "word_to_compare": "success",
      "analysis": "“Success” (成功) 是一个广泛使用的词，适用于任何目标达成的情况，从学业到事业，语义范围更广但情感浓度较低。“Triumph” 则更强调克服巨大困难后的辉煌胜利，更具情感张力和叙事性。"
    },
    {
      "word_to_compare": "conquer",
      "analysis": "“Conquer” (征服) 强调通过力量、意志或控制来彻底压倒或占有某物（如国家、恐惧、习惯），常带有支配或占有的意味。“Triumph” 更侧重于在对抗中胜出并获得荣耀，不一定包含控制或占有，而是突出精神或道义上的胜利。"
    }
  ]
}