{
  "word": "trolls",
  "pronunciation": "trōlz",
  "concise_definition": "n.  trolls（复数形式）: 网络喷子；神话中的巨魔；v.  trolling（动词现在分词/动名词）: 故意挑衅、引战",
  "forms": {
    "singular": "troll",
    "third_person_singular": "trolls",
    "past_tense": "trolled",
    "past_participle": "trolled",
    "present_participle": "trolling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who posts inflammatory, offensive, or off-topic messages online with the intent of provoking emotional responses or disrupting discussions.",
      "explanation_cn": "指在网络上发布煽动性、冒犯性或离题的内容，意图引发他人情绪反应或扰乱讨论的人，俗称‘网络喷子’。",
      "example_en": "The forum was flooded with trolls after the controversial post went viral.",
      "example_cn": "这篇有争议的帖子走红后，论坛里涌入了大量网络喷子。"
    },
    {
      "pos": "noun",
      "explanation_en": "A mythical creature from Scandinavian folklore, typically depicted as large, ugly, and living under bridges or in caves, often hostile to humans.",
      "explanation_cn": "源自斯堪的纳维亚民间传说中的神话生物，通常被描绘为体型庞大、丑陋，居住在桥下或洞穴中，常对人类怀有敌意。",
      "example_en": "In the fairy tale, the troll demanded a toll from anyone who crossed the bridge.",
      "example_cn": "在童话故事中，巨魔要求每个过桥的人都缴纳过桥费。"
    },
    {
      "pos": "verb",
      "explanation_en": "To deliberately post provocative or misleading content online to incite reactions, often for amusement or to manipulate discourse.",
      "explanation_cn": "指故意在网络上发布挑衅性或误导性内容，以引发他人反应，通常出于娱乐目的或操纵舆论。",
      "example_en": "He was trolling the comment section by pretending to support extreme views.",
      "example_cn": "他假装支持极端观点，故意在评论区引战。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cyberbully",
      "analysis": "“Cyberbully”（网络欺凌者）指以恶意、持续性的方式针对特定个体进行骚扰或羞辱，通常有明确的受害者和伤害意图。而 “troll” 的目标是制造混乱和引发情绪反应，不一定针对特定人，有时甚至享受‘无人在意’的匿名性。"
    },
    {
      "word_to_compare": "harasser",
      "analysis": "“Harasser”（骚扰者）是一个更广泛的法律术语，涵盖任何形式的持续性骚扰行为，包括言语、身体或数字形式，通常具有威胁性或侵犯性。而 “troll” 更侧重于通过言论制造冲突，其动机常是娱乐而非恐吓。"
    },
    {
      "word_to_compare": "goblin",
      "analysis": "“Goblin”（哥布林）是欧洲民间传说中的一种小型、狡猾、恶作剧的生物，常与偷窃和捣乱相关，体型较小且更狡黠。而 “troll” 更庞大、更具暴力性，常与自然环境（如桥、山）绑定，象征原始的威胁。两者虽同属神话生物，但文化形象和行为模式截然不同。"
    }
  ]
}