{
  "word": "troll",
  "pronunciation": "trohl",
  "concise_definition": "n. 传说中的巨魔；v. 恶意挑衅，钓鱼引战",
  "forms": {
    "third_person_singular": "trolls",
    "past_tense": "trolled",
    "past_participle": "trolled",
    "present_participle": "trolling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A mythical creature from Scandinavian folklore, typically depicted as large, ugly, and often living under bridges or in caves, sometimes possessing magical powers.",
      "explanation_cn": "源自斯堪的纳维亚民间传说中的神话生物，通常被描绘为体型庞大、丑陋，常居住在桥下或洞穴中，有时拥有魔法能力。",
      "example_en": "The children were frightened by the story of the troll under the bridge.",
      "example_cn": "孩子们听了桥下巨魔的故事后感到害怕。"
    },
    {
      "pos": "noun",
      "explanation_en": "An internet user who deliberately posts inflammatory, offensive, or off-topic messages to provoke emotional reactions or disrupt discussions.",
      "explanation_cn": "指在互联网上故意发布煽动性、冒犯性或离题的言论，以激起他人情绪反应或扰乱讨论的用户。",
      "example_en": "The forum was flooded with trolls after the controversial post went viral.",
      "example_cn": "这篇有争议的帖子走红后，论坛里涌入了大量恶意挑衅者。"
    },
    {
      "pos": "verb",
      "explanation_en": "To post provocative or misleading content online with the intent of inciting anger, confusion, or debate among others.",
      "explanation_cn": "指在网络上发布具有挑衅性或误导性的内容，意图激起他人的愤怒、困惑或争论。",
      "example_en": "He was trolling the comment section by pretending to support extreme views.",
      "example_cn": "他假装支持极端观点，以此在评论区进行钓鱼引战。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fish by dragging a baited line slowly through the water, typically from a moving boat.",
      "explanation_cn": "指从一艘移动的船上缓慢拖拽带饵的钓线进行钓鱼。",
      "example_en": "They spent the afternoon trolling for salmon in the lake.",
      "example_cn": "他们下午在湖里拖钓鲑鱼。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "harass",
      "analysis": "“Harass”（骚扰）指持续、恶意地干扰或压迫他人，通常带有直接的敌意或威胁，可能涉及人身攻击或恐吓。而 “troll” 更侧重于通过伪装、讽刺或离题言论引发情绪反应，其动机常是娱乐或看他人出丑，而非直接伤害。"
    },
    {
      "word_to_compare": "provocate",
      "analysis": "“Provocate” 并非标准英语单词，正确形式为 “provoke”（激起）。虽然 “troll” 和 “provoke” 都涉及引发反应，但 “provoke” 可以是中性或正面的（如 provoke thought），而 “troll” 几乎总是带有贬义，特指网络环境中蓄意制造混乱的行为。"
    },
    {
      "word_to_compare": "flame",
      "analysis": "“Flame”（辱骂/火拼）指在论坛或社交媒体上直接发表激烈、愤怒的批评性言论，通常是情绪化的对骂。而 “troll” 的核心策略是伪装立场、假装无知或极端，诱导他人主动回应并陷入争吵，是一种更隐蔽、更具策略性的挑衅方式。"
    }
  ]
}