{
  "word": "trooper",
  "pronunciation": "troo·puhr",
  "concise_definition": "n. 士兵, 顽强的人, 州警",
  "forms": {
    "plural": "troopers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A soldier, especially one serving in a cavalry unit or armored division, often used in military contexts to denote a member of a specific branch of the armed forces.",
      "explanation_cn": "指士兵，尤指隶属于骑兵部队或装甲部队的成员，常用于军事语境中表示武装部队某一兵种的成员。",
      "example_en": "The troopers rode on horseback during the historic cavalry charge.",
      "example_cn": "这些士兵在历史上著名的骑兵冲锋中骑马作战。"
    },
    {
      "pos": "noun",
      "explanation_en": "A state police officer, especially in the United States, often referring to a highway patrol officer who enforces traffic laws across state lines.",
      "explanation_cn": "指美国的州警，尤指负责在州际公路上执行交通法规的公路巡逻警官。",
      "example_en": "The trooper pulled over the speeding truck and issued a citation.",
      "example_cn": "这位州警拦下了超速的卡车并开出了罚单。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who shows great endurance, resilience, or determination in the face of difficulty or adversity, often used informally to praise someone's perseverance.",
      "explanation_cn": "指在困难或逆境中表现出极大耐力、韧性或决心的人，常用于非正式场合以赞扬某人的坚韧不拔。",
      "example_en": "She’s a real trooper—she worked through the flu and still finished the project on time.",
      "example_cn": "她真是个硬汉——即使带着流感，她还是按时完成了项目。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "soldier",
      "analysis": "“Soldier” (士兵) 是一个更通用的军事术语，泛指任何武装部队中的成员，不特指兵种或服役形式。而 “trooper” 通常特指骑兵、装甲兵或州警，带有更具体的军事或执法背景，语义范围更窄但更具象。"
    },
    {
      "word_to_compare": "officer",
      "analysis": "“Officer” (军官) 指军队或警察中拥有指挥权的人员，强调等级和职责。而 “trooper” 通常指基层士兵或普通警员，不具有指挥权，属于执行层，语义上更偏向于普通成员而非领导者。"
    },
    {
      "word_to_compare": "hardcore",
      "analysis": "“Hardcore” (铁杆的/顽强的) 是一个形容词，用于描述极端坚定或坚韧的人或事物，如 hardcore fan。而 “trooper” 作为名词，不仅描述坚韧品质，还承载职业身份（士兵/州警）的语义，兼具身份标签与性格赞美双重功能，语义更丰富。"
    }
  ]
}