{
  "word": "troubled",
  "pronunciation": "truh·bld",
  "concise_definition": "adj. 有烦恼的, 感到忧虑的, 不安的; (情况) 不稳定的, 有问题的",
  "forms": {
    "comparative": "more troubled",
    "superlative": "most troubled"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Feeling or showing worry, distress, or mental unease, often due to personal problems, moral conflict, or emotional pressure.",
      "explanation_cn": "感到或表现出忧虑、痛苦或心理不安，通常源于个人问题、道德冲突或情感压力。",
      "example_en": "She looked troubled as she stared at the letter from her estranged father.",
      "example_cn": "她凝视着来自疏远父亲的信，神情忧虑。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by difficulties, instability, or ongoing problems; describing a situation, system, or organization that is not functioning smoothly.",
      "explanation_cn": "指具有困难、不稳定或持续问题的特征；描述一个运作不顺畅的情况、系统或组织。",
      "example_en": "The company is in troubled waters after losing its major client.",
      "example_cn": "在失去主要客户后，这家公司陷入了困境。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Having a history of problems or disturbances, especially in behavior or performance; often used to describe people or institutions with recurring issues.",
      "explanation_cn": "具有问题或干扰的历史，尤其用于描述行为或表现反复出问题的人或机构。",
      "example_en": "He comes from a troubled background and has struggled with addiction since adolescence.",
      "example_cn": "他出身于一个充满问题的家庭，自青少年时期就一直与成瘾作斗争。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "worried",
      "analysis": "“Worried” (担忧的) 更侧重于对未来的不确定性或潜在威胁感到焦虑，情绪较轻，常为暂时性反应。而 “troubled” 情绪更深，常包含内心的挣扎、道德困扰或长期困扰，语义更沉重。"
    },
    {
      "word_to_compare": "upset",
      "analysis": "“Upset” (心烦意乱的) 通常指因突发事件或情绪刺激而产生的短暂情绪波动，可能表现为愤怒或悲伤。而 “troubled” 更强调持续的心理负担或深层不安，不一定伴随外显情绪。"
    },
    {
      "word_to_compare": "problematic",
      "analysis": "“Problematic” (有问题的) 是一个中性客观词，用于描述事物本身存在缺陷或争议，不涉及情感状态。而 “troubled” 不仅描述问题，还隐含了人或系统因这些问题而承受的压力或痛苦，带有主观情感色彩。"
    }
  ]
}