{
  "word": "trouble",
  "pronunciation": "truh·buhl",
  "concise_definition": "n. 麻烦, 困难, 问题; v. 麻烦, 烦扰",
  "forms": {
    "plural": "troubles",
    "third_person_singular": "troubles",
    "past_tense": "troubled",
    "past_participle": "troubled",
    "present_participle": "troubling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A state of difficulty, distress, or disorder; a problem or challenge that causes inconvenience, worry, or disruption.",
      "explanation_cn": "一种困难、痛苦或混乱的状态；指引起不便、担忧或干扰的问题或挑战。",
      "example_en": "She's been having trouble with her car lately.",
      "example_cn": "她最近车子总是出问题。"
    },
    {
      "pos": "noun",
      "explanation_en": "A source of emotional or mental distress, such as anxiety, guilt, or inner conflict.",
      "explanation_cn": "指带来情绪或心理困扰的来源，如焦虑、内疚或内心冲突。",
      "example_en": "He's been in trouble ever since his wife left him.",
      "example_cn": "自从妻子离开他后，他就一直心神不宁。"
    },
    {
      "pos": "noun",
      "explanation_en": "A situation involving legal or social consequences, especially one that leads to punishment or criticism.",
      "explanation_cn": "指可能带来法律或社会后果的情况，尤其是会导致惩罚或批评的情形。",
      "example_en": "The politician got into trouble for accepting bribes.",
      "example_cn": "这位政客因接受贿赂而惹上麻烦。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause someone annoyance, worry, or inconvenience; to burden or disturb someone.",
      "explanation_cn": "使某人感到烦恼、担忧或不便；打扰或给某人带来负担。",
      "example_en": "I didn't mean to trouble you with my problems.",
      "example_cn": "我本无意因我的问题而麻烦你。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a problem or difficulty for something, especially by interfering or disrupting its normal function.",
      "explanation_cn": "因干扰或破坏而使某事物出现问题或困难。",
      "example_en": "The software update is troubling the system's performance.",
      "example_cn": "这个软件更新正在影响系统的性能。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "problem",
      "analysis": "“Problem” (问题) 更中性、更广泛，常用于指需要解决的客观障碍或难题，如数学问题、技术问题。而 “trouble” 更强调主观感受，常带有负面情绪色彩，如烦恼、困扰或不便，更口语化。"
    },
    {
      "word_to_compare": "difficulty",
      "analysis": "“Difficulty” (困难) 侧重于完成某事的障碍或挑战，常用于描述任务或过程的复杂性，如学习一门语言的困难。而 “trouble” 更强调由此引发的麻烦、焦虑或实际干扰，范围更广，也更情绪化。"
    },
    {
      "word_to_compare": "distress",
      "analysis": "“Distress” (痛苦/悲痛) 指强烈的情感或身体上的痛苦，程度比 “trouble” 更深，常用于严重情境，如灾难、疾病或心理创伤。而 “trouble” 通常指较轻微或日常的困扰，语气更轻。"
    }
  ]
}