{
  "word": "troublesome",
  "pronunciation": "truh·bluh·suhm",
  "concise_definition": "adj. 令人烦恼的, 麻烦的, 难处理的",
  "forms": {
    "comparative": "more troublesome",
    "superlative": "most troublesome"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Causing difficulty, annoyance, or problems; requiring extra effort or attention to manage or resolve.",
      "explanation_cn": "引起困难、烦恼或问题的；需要额外努力或关注才能处理或解决的。",
      "example_en": "The troublesome child kept interrupting the lecture with unrelated questions.",
      "example_cn": "这个烦人的孩子不断用无关的问题打断讲座。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by persistent or recurring issues that are hard to control or eliminate, often referring to systems, processes, or situations.",
      "explanation_cn": "指具有持续或反复出现、难以控制或消除的问题的特征，常用于描述系统、流程或状况。",
      "example_en": "The software has a troublesome bug that crashes the system every few days.",
      "example_cn": "这款软件有一个麻烦的漏洞，每隔几天就会导致系统崩溃。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Worth avoiding or minimizing due to the inconvenience or stress it causes, often used to describe people or behaviors that are disruptive.",
      "explanation_cn": "因带来不便或压力而值得避免或尽量减少的，常用于描述具有干扰性的人或行为。",
      "example_en": "She tried to avoid the troublesome neighbor who always played loud music at night.",
      "example_cn": "她尽量避开那个总在夜里播放大声音乐的麻烦邻居。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "annoying",
      "analysis": "“Annoying”（令人恼火的）侧重于引起轻微的烦躁或不快，情绪色彩较轻，常用于日常琐事，如噪音或习惯。而 “troublesome” 更强调实际造成的困难或负担，后果更严重，涉及更多行动或资源的消耗。"
    },
    {
      "word_to_compare": "problematic",
      "analysis": "“Problematic”（有问题的）更正式，常用于分析性语境，指某事物存在潜在或结构性缺陷，需被识别和评估。它偏重于逻辑或理论层面的不确定性。而 “troublesome” 更强调实际操作中带来的麻烦和干扰，更具主观体验性。"
    },
    {
      "word_to_compare": "burdensome",
      "analysis": "“Burdensome”（沉重的、负担重的）强调责任、义务或体力上的沉重压力，常用于法律、财务或体力任务。而 “troublesome” 更广泛，可涵盖情感、行为、技术等多方面的困扰，不一定涉及沉重负担，但一定带来持续的不便。"
    }
  ]
}