{
  "word": "truck",
  "pronunciation": "truhk",
  "concise_definition": "n. 卡车, 货车; v. 运输, 用卡车运送",
  "forms": {
    "plural": "trucks"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A large motor vehicle designed for transporting goods or materials, typically with a powerful engine and a flatbed or enclosed cargo area.",
      "explanation_cn": "一种用于运输货物或材料的大型机动车辆，通常配备强劲的发动机和开放式或封闭式货厢。",
      "example_en": "The delivery was made by a large delivery truck that arrived at dawn.",
      "example_cn": "货物是由一辆大型送货卡车在黎明时分送达的。"
    },
    {
      "pos": "noun",
      "explanation_en": "A wheeled vehicle used for carrying goods, especially one pulled by animals or used in industrial settings (historical or specialized usage).",
      "explanation_cn": "一种用于载运货物的轮式车辆，尤指由动物牵引或用于工业环境中的车辆（历史或特殊用法）。",
      "example_en": "In the 19th century, farmers used wooden trucks to haul crops to market.",
      "example_cn": "在19世纪，农民使用木制手推车将农作物运到市场。"
    },
    {
      "pos": "verb",
      "explanation_en": "To transport goods or items using a truck or other vehicle, often over long distances.",
      "explanation_cn": "使用卡车或其他车辆运输货物或物品，通常指长距离运输。",
      "example_en": "The company trucks its products to warehouses across the country.",
      "example_cn": "该公司用卡车将产品运往全国各地的仓库。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or carry something by pushing or dragging it, often in a casual or informal context (especially in the phrase 'to truck around').",
      "explanation_cn": "指通过推或拖的方式移动某物，常用于非正式语境（尤其在短语 'to truck around' 中）。",
      "example_en": "We trucked the old furniture out to the curb before the trash pickup.",
      "example_cn": "我们在垃圾清运前把旧家具拖到了路边。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "lorry",
      "analysis": "“Lorry” 是英式英语中对 “truck” 的同义词，特指大型货运车辆。美式英语中几乎只用 “truck”，而英式英语中 “lorry” 更常见。两者在功能和结构上完全相同，仅属地域用词差异。"
    },
    {
      "word_to_compare": "van",
      "analysis": "“Van” (厢式货车) 通常指中型封闭式车辆，主要用于运送人员或小批量货物，车身较矮、载重能力较小。而 “truck” 更大、更重，专为大宗货物运输设计，常有开放式货厢或重型底盘。"
    },
    {
      "word_to_compare": "carrier",
      "analysis": "“Carrier” (运输工具/承运人) 是一个更广泛的术语，可指任何运输货物的工具或实体，包括飞机、轮船、火车或卡车。而 “truck” 是 “carrier” 的一种具体类型，特指公路运输的机动车辆。"
    }
  ]
}