{
  "word": "trumps",
  "pronunciation": "truhmps",
  "concise_definition": "v. 胜过, 压倒; n. (牌戏中的) 主牌, 优势",
  "forms": {
    "third_person_singular": "trumps",
    "past_tense": "trumped",
    "past_participle": "trumped",
    "present_participle": "trumping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To surpass or outdo something or someone, especially by using a superior card or advantage in a game or competition.",
      "explanation_cn": "指在游戏或竞争中，通过使用更高级的牌或优势来胜过、压倒对方。",
      "example_en": "She trumped his bid with a higher offer that no one could match.",
      "example_cn": "她以一个无人能比的更高报价压过了他的出价。"
    },
    {
      "pos": "verb",
      "explanation_en": "To overcome or neutralize something by using a more powerful or effective means.",
      "explanation_cn": "指通过更强大或更有效的方法来克服或抵消某种影响或障碍。",
      "example_en": "His charisma trumped all the criticisms leveled against him.",
      "example_cn": "他的个人魅力压倒了所有针对他的批评。"
    },
    {
      "pos": "noun",
      "explanation_en": "In card games, the suit that has been designated to have higher rank than others, allowing cards of that suit to beat cards of other suits.",
      "explanation_cn": "在纸牌游戏中，被指定为比其他花色等级更高的花色，该花色的牌可以击败其他花色的牌。",
      "example_en": "He played a heart, but the spades were trumps, so his card lost.",
      "example_cn": "他出了一张红桃，但黑桃是主牌，因此他的牌输了。"
    },
    {
      "pos": "noun",
      "explanation_en": "An advantage or resource that gives one a decisive edge over others.",
      "explanation_cn": "指能赋予某人决定性优势的资源或条件。",
      "example_en": "Her fluency in three languages is a real trump in international diplomacy.",
      "example_cn": "她精通三种语言是国际外交中的一大优势。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "outdo",
      "analysis": "“Outdo” (胜过) 强调在表现、成就或能力上超越他人，通常用于比较人的行为或成果，语气更偏向主观评价。而 “trump” 更常用于有规则体系的语境（如牌局），强调通过特定机制（如主牌）实现压制，更具策略性和结构性。"
    },
    {
      "word_to_compare": "override",
      "analysis": "“Override” (否决/凌驾) 指以权威或更高规则强行取消或压制某决定，常用于制度、法律或系统层面，带有强制性。而 “trump” 更多用于竞争或博弈中，通过合法规则内的优势实现胜利，不必然涉及权力压制。"
    },
    {
      "word_to_compare": "advantage",
      "analysis": "“Advantage” (优势) 是一个中性名词，泛指任何有利条件，不隐含“决定性”或“压制性”的结果。而 “trump” 作为名词时，特指能直接决定胜负的关键优势，具有更强的终结性和战术价值。"
    }
  ]
}