{
  "word": "trunks",
  "pronunciation": "truhngks",
  "concise_definition": "n. 短裤, 裙裤, 象鼻, 树干",
  "forms": {
    "singular": "trunk"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A type of short, loose-fitting pants worn by men, especially for swimming or as part of a uniform, typically ending above the knee.",
      "explanation_cn": "一种男性穿着的短而宽松的裤子，常用于游泳或作为制服的一部分，通常长度在膝盖以上。",
      "example_en": "He put on his swim trunks and jumped into the pool.",
      "example_cn": "他穿上泳裤，跳进了泳池。"
    },
    {
      "pos": "noun",
      "explanation_en": "The long, flexible, muscular organ extending from the face of an elephant, used for breathing, smelling, touching, grasping, and producing sound.",
      "explanation_cn": "大象面部延伸出的长而灵活的肌肉器官，用于呼吸、嗅觉、触碰、抓握和发声。",
      "example_en": "The elephant used its trunk to pick up a branch and spray water on its back.",
      "example_cn": "大象用它的象鼻捡起一根树枝，并向背上喷水。"
    },
    {
      "pos": "noun",
      "explanation_en": "The main stem or body of a tree, from which branches grow; the central, thick part of a plant or tree.",
      "explanation_cn": "树木的主干或主体，从其上长出树枝；植物或树木的中心粗大部分。",
      "example_en": "The ancient oak had a massive trunk that required three people to encircle.",
      "example_cn": "那棵古老的橡树树干粗大，需要三个人才能环抱。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large, sturdy box or container used for storing or transporting belongings, especially during travel.",
      "explanation_cn": "一种坚固的大箱子或容器，用于存放或运输物品，尤其在旅行时使用。",
      "example_en": "They packed their clothes into leather trunks before embarking on the voyage.",
      "example_cn": "他们启程前把衣服装进了皮箱里。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "shorts",
      "analysis": "“Shorts”（短裤）是更通用的术语，泛指任何长度在膝盖以上的裤子，适用于男女及各种场合（如运动、休闲）。“Trunks” 特指男性泳裤或某些制服短裤，语义更具体，常与游泳或军事/体育制服相关。"
    },
    {
      "word_to_compare": "tusk",
      "analysis": "“Tusk”（象牙）指大象、野猪等动物的长牙，是坚硬的牙齿结构，用于攻击或挖掘。而 “trunk” 指的是象鼻，是柔软的肌肉器官，功能完全不同。两者虽同属大象身体部位，但不可混淆。"
    },
    {
      "word_to_compare": "stem",
      "analysis": "“Stem”（茎）通常用于植物学，指连接根与叶、花、果实的部分，多为细长、柔韧的结构，常见于草本植物。“Trunk” 则专指树木的主干，更粗壮、木质化，是大型植物的核心支撑结构。"
    },
    {
      "word_to_compare": "chest",
      "analysis": "“Chest”（箱子/胸腔）可指存放物品的箱子，但通常指带盖的、较扁平的储物箱，常用于家庭收纳；而 “trunk” 更强调厚重、耐用、用于长途运输的大型行李箱，常与旅行、铁路或航海相关，语义更具历史和功能特征。"
    }
  ]
}