{
  "word": "trunk",
  "pronunciation": "truhngk",
  "concise_definition": "n. 树干, 行李箱, 象鼻, 大箱子",
  "forms": {
    "plural": "trunks"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The main stem or body of a tree, supporting the branches and transporting water and nutrients from the roots to the rest of the plant.",
      "explanation_cn": "指树木的主干，支撑树枝并从根部向植物其他部分输送水分和养分。",
      "example_en": "The ancient oak had a trunk so wide that three people could barely encircle it.",
      "example_cn": "那棵古老的橡树树干如此粗壮，三个人都难以环抱。"
    },
    {
      "pos": "noun",
      "explanation_en": "The rear storage compartment of a car, used for carrying luggage or other items.",
      "explanation_cn": "指汽车后部用于存放行李或其他物品的储物箱，即后备箱。",
      "example_en": "She packed the suitcases into the trunk before hitting the highway.",
      "example_cn": "上高速公路前，她把行李箱塞进了后备箱。"
    },
    {
      "pos": "noun",
      "explanation_en": "The long, flexible, muscular extension of an elephant's face, used for breathing, smelling, touching, grasping, and producing sound.",
      "explanation_cn": "指大象面部细长、灵活、肌肉发达的器官，用于呼吸、嗅闻、触碰、抓取物体和发声。",
      "example_en": "The elephant used its trunk to pluck leaves from the tall tree.",
      "example_cn": "大象用它的象鼻从高树上摘下树叶。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large, sturdy box or chest, typically made of wood or leather, used for storing or transporting belongings, especially in the past.",
      "explanation_cn": "指一种坚固的大箱子或柜子，通常由木材或皮革制成，过去常用于存放或运输物品。",
      "example_en": "The traveler carried an old leather trunk filled with clothes and letters from home.",
      "example_cn": "这位旅行者带着一个装满衣物和家书的旧皮箱。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "stem",
      "analysis": "“Stem”（茎）通常用于植物学中，指连接根与叶、花或果实的部分，多用于草本植物或较小的植物结构；而 “trunk” 专指树木粗壮的主干，强调体积和支撑功能，不用于非木本植物。"
    },
    {
      "word_to_compare": "boot",
      "analysis": "“Boot”（英式英语）与 “trunk”（美式英语）都指汽车后备箱，但 “boot” 是英式用法，而 “trunk” 是美式用法，二者为同一事物的地域差异词，语义完全相同。"
    },
    {
      "word_to_compare": "tusk",
      "analysis": "“Tusk”（象牙）是大象上下颌延伸出的长牙，主要由象牙质构成，用于防御或挖掘；而 “trunk” 是象鼻，功能多样，涉及呼吸、抓取、交流等，二者是大象身体上完全不同的器官。"
    },
    {
      "word_to_compare": "chest",
      "analysis": "“Chest”（箱子）泛指任何有盖的储物箱，可大可小，材质多样，用途广泛；而 “trunk” 特指大型、坚固、常用于长途运输的箱子，多为木质或皮质，具有历史和旅行语境的特殊含义。"
    }
  ]
}