{
  "word": "truss",
  "pronunciation": "truhss",
  "concise_definition": "n. 桁架, 支架; v. 操纵, 串通, 支撑",
  "forms": {
    "plural": "trusses",
    "third_person_singular": "trusses",
    "past_tense": "trussed",
    "past_participle": "trussed",
    "present_participle": "trussing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A rigid framework, typically made of wood or metal, designed to support a roof, bridge, or other structure by distributing weight evenly across its components.",
      "explanation_cn": "一种由木材或金属制成的刚性框架，用于支撑屋顶、桥梁或其他结构，通过其组件均匀分布重量。",
      "example_en": "The roof was supported by a complex steel truss system.",
      "example_cn": "屋顶由一套复杂的钢桁架系统支撑。"
    },
    {
      "pos": "noun",
      "explanation_en": "A bandage or supportive device used to hold an organ or body part in place, especially to treat hernias.",
      "explanation_cn": "一种用于固定器官或身体部位的绷带或支撑装置，常用于治疗疝气。",
      "example_en": "He wore a medical truss to manage his inguinal hernia.",
      "example_cn": "他佩戴了一种医用疝气带以控制腹股沟疝。"
    },
    {
      "pos": "verb",
      "explanation_en": "To support or brace something firmly, often with beams or straps, to prevent movement or collapse.",
      "explanation_cn": "用梁或带子牢固地支撑或加固某物，以防止其移动或坍塌。",
      "example_en": "Workers trussed the collapsing wall with wooden beams.",
      "example_cn": "工人用木梁加固了即将坍塌的墙壁。"
    },
    {
      "pos": "verb",
      "explanation_en": "To manipulate or fix the outcome of something, especially an election or contest, through dishonest means.",
      "explanation_cn": "通过不正当手段操纵或串通某事的结果，尤指选举或比赛。",
      "example_en": "The election was accused of being trussed by corrupt officials.",
      "example_cn": "这次选举被指控被腐败官员操纵。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "frame",
      "analysis": "“Frame”（框架）泛指任何构成结构基础的骨架，可以是临时的、非承重的，或用于抽象概念（如叙事框架）。而 “truss” 特指一种经过工程设计、用于承重的刚性三角形结构，强调力学稳定性和功能性。"
    },
    {
      "word_to_compare": "brace",
      "analysis": "“Brace”（支撑）指临时或辅助性的加固，通常用于防止瞬间的移动或变形，如用木条撑住门框。“Truss” 则是永久性、系统性的结构支撑，常作为建筑的主要承重部分，强度和设计复杂度更高。"
    },
    {
      "word_to_compare": "rig",
      "analysis": "“Rig”（操纵）与 “truss” 在表示“舞弊”时语义相近，但 “rig” 更常用于描述通过非法或欺骗手段系统性操控结果（如 rigged game），语气更负面且广泛用于政治或赌博语境；而 “truss” 作为动词表示操纵时较为罕见，多用于文学或历史语境，带有古旧或隐喻色彩。"
    }
  ]
}