{
  "word": "trusts",
  "pronunciation": "truhsts",
  "concise_definition": "n. 信任, 信赖; v. 信任, 信赖 (第三人称单数形式)",
  "forms": {
    "base_form": "trust",
    "plural": "trusts",
    "third_person_singular": "trusts",
    "past_tense": "trusted",
    "past_participle": "trusted",
    "present_participle": "trusting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A firm belief in the reliability, truth, ability, or strength of someone or something, often based on experience or emotional connection.",
      "explanation_cn": "对某人或某事物的可靠性、真实性、能力或力量的坚定信念，通常基于经验或情感联系。",
      "example_en": "Her trust in the doctor helped her feel calm during the procedure.",
      "example_cn": "她对医生的信任让她在手术过程中感到平静。"
    },
    {
      "pos": "noun",
      "explanation_en": "A legal arrangement in which one party (the trustee) holds and manages property or assets for the benefit of another (the beneficiary).",
      "explanation_cn": "一种法律安排，其中一方（受托人）为另一方（受益人）的利益持有和管理财产或资产。",
      "example_en": "The family set up a trust to manage the inheritance for their minor children.",
      "example_cn": "这个家庭设立了一个信托，以管理为未成年子女继承的财产。"
    },
    {
      "pos": "verb",
      "explanation_en": "To have confidence in the honesty, integrity, or competence of someone; to rely on someone or something as dependable.",
      "explanation_cn": "对某人的诚实、正直或能力抱有信心；依赖某人或某事物的可靠性。",
      "example_en": "I trust my best friend to keep my secrets.",
      "example_cn": "我相信我最好的朋友会为我保守秘密。"
    },
    {
      "pos": "verb",
      "explanation_en": "To believe that something is true or accurate without requiring proof or evidence.",
      "explanation_cn": "在没有要求证明或证据的情况下，相信某事是真实的或准确的。",
      "example_en": "We trust that the results will be published soon.",
      "example_cn": "我们相信结果很快就会公布。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "believe",
      "analysis": "“Believe” (相信) 更侧重于对某种陈述、观点或事实的接受，常用于认知层面，不一定涉及情感依赖或风险承担。而 “trust” 不仅包含相信，还隐含了依赖、托付和承担风险的意味，情感色彩更浓。"
    },
    {
      "word_to_compare": "confidence",
      "analysis": "“Confidence” (信心) 是一种内在的心理状态，指对自己或他人能力的肯定，但不一定涉及关系中的依赖或授权。而 “trust” 是一种关系性概念，通常发生在人与人、人与机构之间，包含责任与义务的转移。"
    },
    {
      "word_to_compare": "rely",
      "analysis": "“Rely” (依赖) 强调在行动或决策中对某人或某物的依赖性，常用于功能性或实用层面，如 ‘rely on a tool’。而 ‘trust’ 更广泛，包含情感、道德和认知层面，不仅依赖其功能，也相信其动机和品格。"
    }
  ]
}