{
  "word": "trustees",
  "pronunciation": "troos·tehz",
  "concise_definition": "n. 受托人, 管理人, 董事",
  "forms": {
    "singular": "trustee"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person or group legally appointed to manage and safeguard assets, property, or funds on behalf of another person or organization, often under a trust agreement.",
      "explanation_cn": "指根据信托协议，被法律授权代表他人或组织管理、保护资产、财产或资金的个人或团体。",
      "example_en": "The board of trustees oversees the endowment fund of the university.",
      "example_cn": "董事会受托人负责管理大学的捐赠基金。"
    },
    {
      "pos": "noun",
      "explanation_en": "A member of a governing body, especially in educational institutions or nonprofit organizations, responsible for strategic decisions and financial oversight.",
      "explanation_cn": "指教育机构或非营利组织的管理委员会成员，负责战略决策和财务监督。",
      "example_en": "The school's trustees voted to increase tuition fees for the upcoming academic year.",
      "example_cn": "该校董事会投票决定在下一学年提高学费。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person entrusted with the responsibility of upholding the interests of others, often in a fiduciary capacity, requiring honesty and accountability.",
      "explanation_cn": "指被赋予责任以维护他人利益的人，通常承担受托义务，要求具备诚信与问责性。",
      "example_en": "As a trustee of the charity, she ensured all donations were used transparently and ethically.",
      "example_cn": "作为慈善机构的受托人，她确保所有捐款都透明且合乎道德地使用。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "directors",
      "analysis": "“Directors”（董事）通常指公司董事会成员，其职责主要围绕企业运营、盈利和股东利益，受公司法约束；而 “trustees” 更多用于非营利组织、教育机构或信托基金，其核心义务是忠实地为受益人利益服务，强调受托责任（fiduciary duty），而非商业回报。"
    },
    {
      "word_to_compare": "managers",
      "analysis": "“Managers”（管理者）泛指负责日常运营和执行任务的人员，其权力来源于职位或雇佣关系；而 “trustees” 的权力来源于法律授权或信托契约，其职责更侧重于监督、保护和长期利益，而非日常管理。"
    },
    {
      "word_to_compare": "guardians",
      "analysis": "“Guardians”（监护人）通常指法律上对未成年人或无行为能力者的人身或财产负有保护责任的人，侧重于个人照顾与福祉；而 “trustees” 的对象通常是财产、资金或组织资产，其角色更偏向财务与法律管理，而非个人照护。"
    }
  ]
}