{
  "word": "trust",
  "pronunciation": "truhst",
  "concise_definition": "n. 信任, 信赖; v. 信任, 信赖, 依靠",
  "forms": {
    "third_person_singular": "trusts",
    "past_tense": "trusted",
    "past_participle": "trusted",
    "present_participle": "trusting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A firm belief in the reliability, truth, ability, or strength of someone or something, often based on experience or emotional connection.",
      "explanation_cn": "对某人或某事物的可靠性、真实性、能力或力量的坚定信念，通常基于经验或情感联系。",
      "example_en": "She has built a deep trust with her clients over twenty years of service.",
      "example_cn": "她在二十年的服务中与客户建立了深厚的信任。"
    },
    {
      "pos": "noun",
      "explanation_en": "A legal arrangement in which one party holds and manages property or assets for the benefit of another party.",
      "explanation_cn": "一种法律安排，其中一方为另一方的利益持有和管理财产或资产。",
      "example_en": "The family set up a trust to manage the inheritance for their minor children.",
      "example_cn": "这个家庭设立了一个信托，以管理为未成年子女继承的财产。"
    },
    {
      "pos": "verb",
      "explanation_en": "To have confidence in the honesty, integrity, or competence of someone, and to rely on them without doubt.",
      "explanation_cn": "对某人的诚实、正直或能力有信心，并毫无怀疑地依赖他们。",
      "example_en": "I trust my best friend to keep my secrets.",
      "example_cn": "我相信我最好的朋友会为我保守秘密。"
    },
    {
      "pos": "verb",
      "explanation_en": "To believe that something is true, accurate, or safe without requiring proof or verification.",
      "explanation_cn": "相信某事是真实的、准确的或安全的，而无需证明或核实。",
      "example_en": "You can trust that the data has been verified by experts.",
      "example_cn": "你可以相信这些数据已经由专家核实过。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "confidence",
      "analysis": "“Confidence”（信心）通常指对自己或他人能力的积极信念，更侧重于主观的确定感，不一定涉及依赖或风险。而 “trust” 更强调将自身利益或安全托付给他人，包含风险和依赖的成分。例如，你对自己演讲有信心，但你信任朋友会帮你照顾孩子。"
    },
    {
      "word_to_compare": "faith",
      "analysis": "“Faith”（信仰）常用于宗教、精神或抽象信念的语境，带有更强的情感和非理性色彩，往往超越证据。而 “trust” 更理性、基于经验或观察，适用于日常人际关系和实际事务。例如，你对上帝有信仰，但你对银行有信任。"
    },
    {
      "word_to_compare": "rely",
      "analysis": "“Rely”（依赖）强调在行动或决策中依赖某人或某物，是 “trust” 的行为表现。但 “trust” 是情感或认知基础，而 “rely” 是其外在结果。例如，你信任医生的专业能力（trust），因此你依赖他们的诊断（rely）。"
    }
  ]
}