{
  "word": "trusted",
  "pronunciation": "truh·stid",
  "concise_definition": "adj. 可信赖的, 可靠的, 受信任的",
  "forms": {
    "base_form": "trust",
    "past_tense": "trusted",
    "past_participle": "trusted",
    "present_participle": "trusting",
    "comparative": "more trusted",
    "superlative": "most trusted"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Worthy of confidence or reliance; having demonstrated honesty, integrity, or consistency over time, so that others feel safe depending on them.",
      "explanation_cn": "值得信赖的；通过长期表现出诚实、正直或一致性，使他人感到可以安全地依赖。",
      "example_en": "She is a trusted advisor who has guided the company through multiple crises.",
      "example_cn": "她是一位值得信赖的顾问，曾带领公司度过多次危机。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used to describe systems, sources, or institutions that are considered reliable and free from manipulation or fraud.",
      "explanation_cn": "用于描述被认为可靠、无操纵或欺诈的系统、信息来源或机构。",
      "example_en": "Only use trusted websites when entering personal information.",
      "example_cn": "输入个人信息时，仅使用可信赖的网站。"
    },
    {
      "pos": "adjective",
      "explanation_en": "In the context of relationships, referring to someone who has earned emotional or personal confidence through loyalty and discretion.",
      "explanation_cn": "在人际关系中，指因忠诚与谨慎而赢得他人情感或个人信任的人。",
      "example_en": "He was her most trusted friend, the only one she confided in during her darkest days.",
      "example_cn": "他是她最信任的朋友，也是她在最黑暗的日子里唯一倾诉的对象。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "reliable",
      "analysis": "“Reliable”（可靠的）强调一贯的稳定性与可预测性，常用于描述事物或系统（如机器、服务）是否能持续正常运作。而 “trusted” 更侧重于情感层面的信赖，涉及道德品质、忠诚或安全感，常用于人或关系。"
    },
    {
      "word_to_compare": "dependable",
      "analysis": "“Dependable”（可依赖的）与 “trusted” 非常接近，都表示可以依靠，但 “dependable” 更偏向于功能性或任务层面的可靠性（如按时完成工作），而 “trusted” 包含更深层的道德或情感认可，常用于秘密、价值观或重大责任的托付。"
    },
    {
      "word_to_compare": "credible",
      "analysis": "“Credible”（可信的）主要指信息、陈述或证词在逻辑或证据上具有说服力，常用于学术、法律或媒体语境。它关注的是“是否合理”，而非“是否值得托付”。而 “trusted” 关注的是“是否愿意交付信任”，带有更强的主观情感色彩。"
    }
  ]
}