{
  "word": "tube",
  "pronunciation": "tub",
  "concise_definition": "n. 管, 管道; (英) 地铁; v. 用管输送",
  "forms": {
    "plural": "tubes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A hollow cylindrical structure, typically made of metal, plastic, or glass, used to convey fluids, gases, or other materials from one place to another.",
      "explanation_cn": "一种中空的圆柱形结构，通常由金属、塑料或玻璃制成，用于将液体、气体或其他物质从一处输送到另一处。",
      "example_en": "The water flows through a copper tube to the faucet.",
      "example_cn": "水通过一根铜管流向水龙头。"
    },
    {
      "pos": "noun",
      "explanation_en": "A system of underground railways, especially in London; also used informally to refer to any subway system.",
      "explanation_cn": "一种地下铁路系统，尤指伦敦地铁；也可非正式地泛指任何地铁系统。",
      "example_en": "I took the tube to work this morning; it was packed as usual.",
      "example_cn": "今天早上我坐地铁去上班，和往常一样挤得不行。"
    },
    {
      "pos": "noun",
      "explanation_en": "A television set, especially in informal or old-fashioned usage; also refers to the screen or the medium of television broadcasting.",
      "explanation_cn": "电视（尤指非正式或旧式用法）；也可指电视屏幕或电视广播媒介。",
      "example_en": "Back in the 1950s, most families had only one tube in the living room.",
      "example_cn": "20世纪50年代，大多数家庭的客厅里只有一台电视。"
    },
    {
      "pos": "verb",
      "explanation_en": "To transport or convey something through a tube or pipeline.",
      "explanation_cn": "通过管道或管子输送某物。",
      "example_en": "The oil is tubed directly from the well to the refinery.",
      "example_cn": "石油通过管道直接从油井输送到炼油厂。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pipe",
      "analysis": "“Pipe”（管道）通常指用于输送液体或气体的刚性结构，多用于工程或建筑语境，强调功能性与承压能力；而 “tube” 更通用，可指任何管状物，包括柔软的、细小的或非工业用途的（如吸管、电视显像管），语义范围更广。"
    },
    {
      "word_to_compare": "channel",
      "analysis": "“Channel”（通道）强调的是一个路径或媒介，可以是自然的（如河道）或抽象的（如信息渠道），不一定具有物理管状结构；而 “tube” 明确指具有封闭圆柱形壁的物理结构，更具体、更实体化。"
    },
    {
      "word_to_compare": "cable",
      "analysis": "“Cable”（电缆/缆绳）通常指由多股线或纤维组成的用于传输电力、信号或提供拉力的装置，外形虽可能呈管状，但其核心功能是导电或承重，而非输送流体；而 “tube” 的核心功能是流通或容纳内容物，两者用途本质不同。"
    }
  ]
}