{
  "word": "tubes",
  "pronunciation": "t(y)o͞obz",
  "concise_definition": "n. 管子, 管状物, (英) 地铁, (美) 管状容器",
  "forms": {
    "singular": "tube"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A hollow cylindrical structure, typically made of metal, plastic, or glass, used to convey fluids, gases, or other materials from one place to another.",
      "explanation_cn": "一种中空的圆柱形结构，通常由金属、塑料或玻璃制成，用于输送液体、气体或其他物质。",
      "example_en": "The hospital uses oxygen tubes to help patients breathe.",
      "example_cn": "医院使用氧气管帮助病人呼吸。"
    },
    {
      "pos": "noun",
      "explanation_en": "A long, narrow container, often made of flexible material, used to hold and dispense substances such as toothpaste, paint, or ointment.",
      "explanation_cn": "一种细长的容器，通常由柔性材料制成，用于盛装和挤出牙膏、油漆或药膏等物质。",
      "example_en": "She squeezed a tube of toothpaste onto her brush.",
      "example_cn": "她把一支牙膏挤到牙刷上。"
    },
    {
      "pos": "noun",
      "explanation_en": "In British English, a system of underground railways, especially the London Underground.",
      "explanation_cn": "在英式英语中，指地下铁路系统，尤指伦敦地铁。",
      "example_en": "I took the tube to work this morning — it was packed as usual.",
      "example_cn": "今天早上我坐地铁去上班——和往常一样挤得不行。"
    },
    {
      "pos": "noun",
      "explanation_en": "A television set or the medium of television broadcasting, especially in older usage.",
      "explanation_cn": "（旧时用法）指电视机或电视广播媒介。",
      "example_en": "In the 1950s, families gathered around the tube to watch their favorite shows.",
      "example_cn": "20世纪50年代，家庭成员常围在电视机前观看他们喜爱的节目。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pipe",
      "analysis": "“Pipe”（管道）通常指用于输送水、气或油等流体的刚性结构，多用于工程或建筑语境，强调功能性和承压能力。而 “tube” 更通用，可指任何管状物，包括柔软、细小或非承压的结构，如吸管、电缆护套等。"
    },
    {
      "word_to_compare": "hose",
      "analysis": "“Hose”（软管）特指柔韧、可弯曲的管子，常用于连接水源或输送液体，如花园水管或消防水带。它强调可弯曲性和临时性，而 “tube” 可以是刚性或柔性，用途更广泛，包括电子元件中的真空管或医学导管。"
    },
    {
      "word_to_compare": "channel",
      "analysis": "“Channel”（通道）多指自然或抽象的输送路径，如水道、电视频道或信息通道，不一定具有物理管状结构。而 “tube” 强调物理上的圆柱形封闭结构，具有明确的边界和内腔。"
    }
  ]
}