{
  "word": "tucked",
  "pronunciation": "tuhkt",
  "concise_definition": "adj./v. (tuck 的过去式和过去分词) 收进, 插入, 折叠, 藏起",
  "forms": {
    "base_form": "tuck",
    "third_person_singular": "tucks",
    "present_participle": "tucking",
    "past_tense": "tucked",
    "past_participle": "tucked"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To push or fold something neatly into a confined space, often to make it tidy or secure.",
      "explanation_cn": "将某物整齐地推入或折叠进一个狭小的空间，通常为了使其整洁或固定。",
      "example_en": "She tucked the loose ends of her scarf into her coat.",
      "example_cn": "她把围巾松散的末端塞进了外套里。"
    },
    {
      "pos": "verb",
      "explanation_en": "To insert or place something snugly in a particular position, often to conceal or protect it.",
      "explanation_cn": "将某物紧密地插入或放置在某个位置，常用于隐藏或保护它。",
      "example_en": "He tucked the letter under his pillow before going to bed.",
      "example_cn": "他睡觉前把信塞在了枕头底下。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fold or gather fabric or clothing to create a neat edge or to shorten it, especially in sewing or tailoring.",
      "explanation_cn": "在缝纫或裁剪中，将布料折叠或收拢以形成整齐的边缘或缩短其长度。",
      "example_en": "The tailor tucked the hem of the dress to make it shorter.",
      "example_cn": "裁缝把裙子的下摆折进去，使其变短。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that is neatly folded, inserted, or hidden away, often implying tidiness or concealment.",
      "explanation_cn": "形容某物被整齐地折叠、插入或藏起，常暗示整洁或隐蔽的状态。",
      "example_en": "She wore a tucked-in blouse that looked perfectly pressed.",
      "example_cn": "她穿着一件塞进裙子里的衬衫，看起来熨烫得整整齐齐。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fold",
      "analysis": "“Fold” (折叠) 是一个更通用的词，指将物体弯曲成两层或多层，不强调是否放入狭小空间或是否整洁。而 “tuck” 更强调将折叠后的部分插入、塞入或固定在某个位置，常带有整理、隐藏或固定的目的。"
    },
    {
      "word_to_compare": "hide",
      "analysis": "“Hide” (隐藏) 侧重于使某物不被看见，动机是保密或遮掩，不一定涉及物理上的折叠或插入。而 “tuck” 是通过物理动作（如塞入、折叠）实现隐藏，动作本身更具体、更细致，常用于日常整理场景。"
    },
    {
      "word_to_compare": "tuck in",
      "analysis": "“Tuck in” 是一个短语动词，常用于指将衣物塞进裤腰或床单塞紧，与单独的 “tucked” 作为形容词或动词过去分词用法密切相关。但 “tuck in” 更强调动作的完成状态，而 “tucked” 可以单独作形容词描述状态，如 “a tucked shirt”。"
    }
  ]
}