{
  "word": "tuck",
  "pronunciation": "tuhk",
  "concise_definition": "v. 收起, 插入, 折叠; n. 折痕, 折边",
  "forms": {
    "third_person_singular": "tucks",
    "past_tense": "tucked",
    "past_participle": "tucked",
    "present_participle": "tucking"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To push or fold something neatly into a smaller space, especially clothing or fabric, to make it fit more closely or look neater.",
      "explanation_cn": "将某物（尤指衣物或布料）整齐地推入或折叠进较小的空间，使其更贴合或外观更整洁。",
      "example_en": "She tucked her shirt into her jeans to look more professional.",
      "example_cn": "她把衬衫塞进牛仔裤里，显得更专业。"
    },
    {
      "pos": "verb",
      "explanation_en": "To insert or place something snugly in a confined space, often to secure or hide it.",
      "explanation_cn": "将某物紧密地插入或放置在狭小的空间中，通常为了固定或隐藏它。",
      "example_en": "He tucked the letter under the door and walked away.",
      "example_cn": "他把信塞在门下，然后走开了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fold or gather fabric into small, even pleats, especially as a decorative or functional feature in clothing.",
      "explanation_cn": "将布料折叠或收拢成细小而均匀的褶皱，常用于服装的装饰或功能性设计。",
      "example_en": "The dress had delicate tucks along the bodice to add structure.",
      "example_cn": "这件连衣裙的上身有精致的折裥，以增加立体感。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, neat fold or pleat in fabric, especially in clothing or bedding.",
      "explanation_cn": "布料（尤指衣物或床单）上细小而整齐的褶皱或折边。",
      "example_en": "The tablecloth had elegant tucks running along the edges.",
      "example_cn": "桌布边缘有优雅的折边。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fold",
      "analysis": "“Fold”（折叠）泛指将物体对折或弯曲成两层或多层，动作更通用，不一定追求整齐或紧贴。而 “tuck” 强调将边缘或多余部分“塞入”或“收进”某个空间，带有隐藏、固定或修饰的意图，动作更精细、目的性更强。"
    },
    {
      "word_to_compare": "push",
      "analysis": "“Push”（推）是单纯的施力移动，不涉及整理或收纳的意图。而 “tuck” 虽然可能包含推的动作，但其核心是使物体变得整洁、紧凑或隐蔽，常用于衣物、床单等需要规整的场景。"
    },
    {
      "word_to_compare": "pleat",
      "analysis": "“Pleat”（褶裥）是服装术语，特指有规律、重复的折叠，通常为装饰性设计。而 “tuck” 可以是单个或少量的褶皱，功能上更偏向实用（如收腰、固定），虽然有时也用于装饰，但范围更广，不局限于重复结构。"
    }
  ]
}