{
  "word": "tudor",
  "pronunciation": "too·duhr",
  "concise_definition": "n. 都铎王朝的, 都铎风格的; adj. 都铎王朝的, 都铎时期的",
  "forms": {
    "plural": "tudors"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to the Tudor dynasty, which ruled England from 1485 to 1603, including its distinctive architecture, art, fashion, and political culture.",
      "explanation_cn": "指1485年至1603年统治英格兰的都铎王朝，涵盖其独特的建筑风格、艺术、时尚和政治文化。",
      "example_en": "The house features classic Tudor architecture with half-timbered walls and steeply pitched roofs.",
      "example_cn": "这栋房屋具有典型的都铎式建筑风格，带有木骨架墙和陡峭的屋顶。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person belonging to the Tudor dynasty, especially one of its monarchs such as Henry VIII or Elizabeth I.",
      "explanation_cn": "指属于都铎王朝的人，尤指其君主，如亨利八世或伊丽莎白一世。",
      "example_en": "Henry VII was the first Tudor to sit on the English throne.",
      "example_cn": "亨利七世是第一位登上英格兰王位的都铎君主。"
    },
    {
      "pos": "noun",
      "explanation_en": "A style of building or design characterized by ornate woodwork, steep gables, and decorative half-timbering, popular in England during the Tudor period.",
      "explanation_cn": "指在都铎时期流行的一种建筑或设计风格，以精致的木工、陡峭的山墙和装饰性的木骨架结构为特征。",
      "example_en": "Many pubs in rural England still retain their original Tudor interiors.",
      "example_cn": "英格兰乡村的许多酒馆仍保留着原始的都铎风格内部装饰。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "stuart",
      "analysis": "“Stuart”（斯图亚特）指17世纪统治英格兰、苏格兰和爱尔兰的斯图亚特王朝，继都铎王朝之后。两者均为英国历史上的重要王室，但都铎王朝以中央集权和宗教改革著称，而斯图亚特王朝则以王权与议会的冲突及内战闻名。在建筑风格上，都铎风格更粗犷、木结构突出，斯图亚特风格则更趋向文艺复兴式的对称与石材运用。"
    },
    {
      "word_to_compare": "georgian",
      "analysis": "“Georgian”（乔治亚式）指18世纪英国汉诺威王朝时期（乔治一世至四世）的建筑与艺术风格，强调古典比例、对称布局和砖石结构，与都铎风格的中世纪木构、不对称和装饰性形成鲜明对比。都铎风格更显乡土与手工感，乔治亚风格则体现启蒙时代的理性与秩序。"
    },
    {
      "word_to_compare": "victorian",
      "analysis": "“Victorian”（维多利亚式）指19世纪维多利亚女王统治时期的艺术与建筑风格，以繁复装饰、哥特复兴和工业材料为特征。相比之下，都铎风格更为古老、质朴，强调手工木工和中世纪元素，而维多利亚风格则反映了工业化时代的奢华与技术进步。"
    }
  ]
}