{
  "word": "tug",
  "pronunciation": "tuhg",
  "concise_definition": "v. 拉, 拖; n. 拖船, 拉的动作",
  "forms": {
    "third_person_singular": "tugs",
    "past_tense": "tugged",
    "past_participle": "tugged",
    "present_participle": "tugging"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To pull something with strong, steady, or sudden force, often in a direction that requires effort or resistance.",
      "explanation_cn": "指以强烈、持续或突然的力拉动某物，通常需要克服阻力或付出努力。",
      "example_en": "The children tugged at their mother's coat to get her attention.",
      "example_cn": "孩子们拽着妈妈的外套，想引起她的注意。"
    },
    {
      "pos": "verb",
      "explanation_en": "To engage in a contest of strength, especially in a game or activity where opposing sides pull against each other.",
      "explanation_cn": "指参与一种力量对抗，尤指双方相互拉扯的竞技活动，如拔河。",
      "example_en": "The two teams tugged at the rope in the annual tug-of-war competition.",
      "example_cn": "两支队伍在年度拔河比赛中奋力拉扯绳子。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small, powerful boat designed to push or pull larger vessels, especially in harbors or narrow waterways.",
      "explanation_cn": "指一种小型但动力强劲的船只，专门用于在港口或狭窄水道中推动或拖曳大型船只。",
      "example_en": "The tug helped guide the massive cargo ship into the dock.",
      "example_cn": "拖船协助将这艘巨大的货轮引导入港。"
    },
    {
      "pos": "noun",
      "explanation_en": "A strong, forceful pull, especially one that is sustained or repeated.",
      "explanation_cn": "指一种强烈、有力的拉力，尤指持续或反复发生的拉扯动作。",
      "example_en": "She gave the stubborn door a final tug and it finally opened.",
      "example_cn": "她最后用力一拉那扇顽固的门，门终于开了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pull",
      "analysis": "“Pull” (拉) 是一个更通用的词，泛指任何方向的拉力，可以是轻微或温和的，如拉抽屉、拉窗帘。而 “tug” 强调拉力的突然性、强烈性或对抗性，常带有挣扎、费力或不情愿的意味。"
    },
    {
      "word_to_compare": "drag",
      "analysis": "“Drag” (拖) 指物体在表面摩擦下被缓慢、费力地移动，常带有沉重、不顺畅的含义，如拖着行李箱。而 “tug” 更强调瞬间的拉力，不一定涉及摩擦或移动距离，如拉衣角、拔河。"
    },
    {
      "word_to_compare": "hitch",
      "analysis": "“Hitch” (系住/拖拽) 通常指通过绳索、钩子等装置将物体连接并拖动，强调连接方式和机械辅助。而 “tug” 更侧重于动作本身的力量和方向，不必然涉及工具或固定装置。"
    }
  ]
}