{
  "word": "tumble",
  "pronunciation": "tuhm·buhl",
  "concise_definition": "v. 翻滚, 倒下, 暴跌; n. 翻滚, 倒塌",
  "forms": {
    "third_person_singular": "tumbles",
    "past_tense": "tumbled",
    "past_participle": "tumbled",
    "present_participle": "tumbling"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To fall suddenly and uncontrollably, often head over heels or in a rolling motion, typically due to loss of balance or external force.",
      "explanation_cn": "指因失去平衡或受外力影响而突然、不受控制地跌倒，常呈翻滚或翻筋斗状。",
      "example_en": "The child tumbled down the stairs after tripping on the rug.",
      "example_cn": "孩子被地毯绊倒后，从楼梯上滚了下去。"
    },
    {
      "pos": "verb",
      "explanation_en": "To decline rapidly in value, price, or amount, often unexpectedly or dramatically.",
      "explanation_cn": "指（价格、价值或数量）突然且急剧地下跌，常带有意外性。",
      "example_en": "Stock prices tumbled after the company announced massive losses.",
      "example_cn": "该公司宣布巨额亏损后，股价暴跌。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move in a rolling or rotating motion, often in a casual or energetic way.",
      "explanation_cn": "指以滚动或旋转的方式运动，常带有随意或活泼的意味。",
      "example_en": "The children tumbled in the grass, laughing and rolling around.",
      "example_cn": "孩子们在草地上翻滚嬉笑。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden fall or collapse, especially one involving a rolling or spinning motion.",
      "explanation_cn": "指一次突然的跌倒或倒塌，通常伴随滚动或旋转的动作。",
      "example_en": "The acrobat performed a perfect tumble off the balance beam.",
      "example_cn": "杂技演员从平衡木上完成了一个完美的翻滚。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sharp and sudden drop in value, price, or level.",
      "explanation_cn": "指价值、价格或水平的急剧下降。",
      "example_en": "The market experienced a tumble after the economic report was released.",
      "example_cn": "经济报告发布后，市场出现暴跌。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fall",
      "analysis": "“Fall” (落下) 是最通用的词，泛指任何从高处到低处的下落，可以是垂直的、缓慢的或有控制的。而 “tumble” 强调动作的混乱、翻滚或失控，更具动态性和视觉感，常用于描述非直线的跌落。"
    },
    {
      "word_to_compare": "plummet",
      "analysis": "“Plummet” (骤降) 专指垂直方向的急剧下降，尤其用于价格、高度或速度，强调速度和方向的直线性，常用于经济或物理场景。而 “tumble” 虽也可指暴跌，但更常带有不规则、翻滚或非直线的意象，语气更口语化。"
    },
    {
      "word_to_compare": "roll",
      "analysis": "“Roll” (滚动) 是一个中性、可控的旋转运动，如球滚动或车轮转动，通常不包含跌倒或失控的含义。而 “tumble” 隐含失去控制、可能造成后果的滚动，常带有负面或意外的语义色彩。"
    }
  ]
}