{
  "word": "tumbling",
  "pronunciation": "tuhm·bling",
  "concise_definition": "adj. 翻滚的, 倒塌的; v. 翻滚, 倒塌, 急剧下降",
  "forms": {
    "base_form": "tumble",
    "third_person_singular": "tumbles",
    "past_tense": "tumbled",
    "past_participle": "tumbled",
    "present_participle": "tumbling"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To turn over and over rapidly, especially while falling or moving through the air, often in an uncontrolled or chaotic manner.",
      "explanation_cn": "指快速地前后翻滚，尤其在坠落或在空中移动时，通常呈无控制或混乱的状态。",
      "example_en": "The child tumbled down the hill, laughing all the way.",
      "example_cn": "孩子从山坡上翻滚而下，一路大笑。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fall suddenly and uncontrollably, often due to loss of support or balance; to collapse.",
      "explanation_cn": "指因失去支撑或平衡而突然、不可控制地坠落或倒塌。",
      "example_en": "The old barn tumbled down after years of neglect.",
      "example_cn": "这座旧谷仓因多年失修而倒塌了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To decline rapidly or drastically, especially in value, price, or quantity.",
      "explanation_cn": "指（价值、价格或数量）急剧下降或暴跌。",
      "example_en": "Stock prices tumbled after the company announced massive losses.",
      "example_cn": "公司宣布巨额亏损后，股价暴跌。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that involves or resembles rapid, uncontrolled rotation or falling; often used in contexts like gymnastics or natural phenomena.",
      "explanation_cn": "形容涉及或类似于快速、无控制旋转或坠落的状态，常用于体操或自然现象的语境中。",
      "example_en": "The gymnast performed a series of tumbling passes on the floor.",
      "example_cn": "体操运动员在地板上完成了一系列翻滚动作。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fall",
      "analysis": "“Fall” (落下) 是一个更通用的词，指从高处向低处移动，不一定包含旋转或剧烈动作。而 “tumble” 强调在下落过程中伴随翻滚、打滚或失控的动态，更具动作性和视觉冲击力。"
    },
    {
      "word_to_compare": "collapse",
      "analysis": "“Collapse” (坍塌) 通常指结构因内部失效而突然整体崩塌，强调的是稳定性的丧失，多用于建筑、系统或组织。而 “tumble” 可用于物体或抽象事物的突然下落，不一定涉及结构完整性，更侧重于运动形式。"
    },
    {
      "word_to_compare": "roll",
      "analysis": "“Roll” (滚动) 是一种有规律、受控的旋转运动，如车轮滚动或球体滚动。而 “tumble” 是无规律、混乱的翻滚，常带有跌倒或失控的意味，动作更剧烈且不可预测。"
    }
  ]
}