{
  "word": "tunnel",
  "pronunciation": "tuh·nuhl",
  "concise_definition": "n. 隧道, 隧洞; v. 挖隧道, 隧道通行",
  "forms": {
    "third_person_singular": "tunnels",
    "past_tense": "tunneled",
    "past_participle": "tunneled",
    "present_participle": "tunneling",
    "plural": "tunnels"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An underground or underwater passage, typically with a circular or rectangular cross-section, constructed for transportation, utilities, or mining purposes.",
      "explanation_cn": "一种用于交通、公用设施或采矿的地下或水下通道，通常呈圆形或矩形截面。",
      "example_en": "The train passed through a long tunnel beneath the mountains.",
      "example_cn": "火车穿过了一条位于山下的长隧道。"
    },
    {
      "pos": "noun",
      "explanation_en": "A narrow, enclosed passage or corridor, often metaphorically describing a limited or restricted perspective or experience.",
      "explanation_cn": "一种狭窄、封闭的通道，常用于比喻性地描述有限或受限的视角或经历。",
      "example_en": "After months of hard work, she saw light at the end of the tunnel.",
      "example_cn": "经过数月的辛勤工作，她终于看到了希望的曙光。"
    },
    {
      "pos": "verb",
      "explanation_en": "To dig or form a passage through or under something, especially earth or rock, often using machinery or explosives.",
      "explanation_cn": "通过挖掘或爆破等方式在地面或岩石中开辟一条通道，通常使用机械或炸药。",
      "example_en": "Engineers are tunneling under the river to connect the two cities.",
      "example_cn": "工程师们正在河下挖掘隧道以连接两座城市。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or travel through a tunnel, or to proceed in a focused, narrow manner, often with limited visibility or awareness of surroundings.",
      "explanation_cn": "通过隧道行进，或以专注、狭窄的方式前进，通常视野受限或对周围环境缺乏觉察。",
      "example_en": "The car tunneled through the forest, barely visible between the tall trees.",
      "example_cn": "汽车在高大的树木间穿行，几乎难以看清。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "passage",
      "analysis": "“Passage”（通道）是一个更广泛的术语，泛指任何连接两个地点的路径，可以是走廊、门道、水道等，不一定在地下。而 “tunnel” 特指地下或水下的封闭通道，具有明确的工程结构和用途。"
    },
    {
      "word_to_compare": "corridor",
      "analysis": "“Corridor”（走廊）通常指建筑物内部的狭长通道，用于连接房间或区域，是室内结构的一部分。而 “tunnel” 多为户外或地下结构，强调穿越障碍物（如山体、河流）的功能，且通常更长、更坚固。"
    },
    {
      "word_to_compare": "duct",
      "analysis": "“Duct”（管道）主要用于输送气体、液体或电线，截面较小，功能单一，如空调管道或电缆管道。而 “tunnel” 用于人员或车辆通行，空间更大，结构更复杂，强调通行功能而非输送功能。"
    }
  ]
}