{
  "word": "turbulent",
  "pronunciation": "tur·byoo·lent",
  "concise_definition": "adj. 混乱的, 骚动的, 激烈的, 湍流的",
  "forms": {
    "comparative": "more turbulent",
    "superlative": "most turbulent"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Characterized by violent, irregular, and chaotic movement, especially of fluids or air; often used to describe physical conditions such as stormy weather or rough water.",
      "explanation_cn": "形容流体或空气发生剧烈、不规则且混乱的运动；常用于描述暴风雨天气或汹涌的水流等物理状态。",
      "example_en": "The plane encountered turbulent air during the storm, causing passengers to feel uneasy.",
      "example_cn": "飞机在风暴中遭遇了湍流，导致乘客感到不安。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Marked by disorder, unrest, or intense conflict, especially in social, political, or emotional contexts; describing a state of instability or upheaval.",
      "explanation_cn": "形容社会、政治或情感环境中存在混乱、不安或激烈冲突；指一种不稳定或动荡的状态。",
      "example_en": "The country experienced a turbulent period following the revolution, with frequent protests and government changes.",
      "example_cn": "革命后，该国经历了一段动荡时期，频繁发生抗议活动和政府更迭。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Emotionally agitated or unsettled; describing a person’s inner state that is restless, anxious, or emotionally volatile.",
      "explanation_cn": "形容情绪激动或不安；指一个人内心躁动、焦虑或情绪波动剧烈的状态。",
      "example_en": "She had a turbulent childhood, marked by frequent moves and family conflicts.",
      "example_cn": "她的童年充满动荡，经历了频繁的搬迁和家庭冲突。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "chaotic",
      "analysis": "“Chaotic”（混乱的）强调完全缺乏秩序和结构，常带有负面的、无序的意味，适用于系统性崩溃的情境。而 “turbulent” 更侧重于动态的、有能量的混乱，可能包含某种内在的节奏或力量，如风暴或情绪波动，不一定完全失控。"
    },
    {
      "word_to_compare": "stormy",
      "analysis": "“Stormy”（暴风雨的）通常特指天气或情绪上的激烈，带有强烈的视觉或情感意象，如雷雨或争吵。它常用于比喻性语境（如 stormy relationship），但范围较窄；“turbulent” 更广泛，可涵盖物理、社会和心理层面的动荡，语义更抽象和全面。"
    },
    {
      "word_to_compare": "unstable",
      "analysis": "“Unstable”（不稳定的）强调缺乏持久性或可靠性，常用于描述结构、关系或状态容易崩溃。它是一个静态描述，而 “turbulent” 强调动态过程中的剧烈变化和能量释放。一个系统可以是不稳定的但不一定是动荡的，反之亦然。"
    }
  ]
}