{
  "word": "turf",
  "pronunciation": "turf",
  "concise_definition": "n. 草皮, 地盘, 领地; v. 用草皮覆盖",
  "forms": {
    "plural": "turfs"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A layer of grass and the soil beneath it, typically cut into pieces and used for lawns, sports fields, or landscaping.",
      "explanation_cn": "指带有根部土壤的草皮层，通常被切割成块，用于草坪、运动场或景观美化。",
      "example_en": "The soccer team installed new turf on the field after the rain damaged the natural grass.",
      "example_cn": "雨水损坏了天然草坪后，足球队在球场上铺设了新的草皮。"
    },
    {
      "pos": "noun",
      "explanation_en": "A territory or area over which a person, group, or organization claims control or authority, often used in contexts of power, influence, or competition.",
      "explanation_cn": "指某人、团体或组织声称拥有控制权或权威的领域或地盘，常用于权力、影响力或竞争的语境中。",
      "example_en": "The two gangs were fighting over turf in the downtown district.",
      "example_cn": "两个帮派正在为市中心的地盘而争斗。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person's area of expertise or responsibility, especially when they are protective of it.",
      "explanation_cn": "指某人负责或专长的领域，尤其当此人对此领域表现出强烈保护欲时。",
      "example_en": "Don't interfere with my turf—I handle all the marketing decisions.",
      "example_cn": "别插手我的地盘——所有市场决策都由我负责。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover an area with turf, especially grass and soil, to create a lawn or playing surface.",
      "explanation_cn": "指用草皮（带土壤的草）覆盖某区域，以形成草坪或运动场地。",
      "example_en": "The landscaper turfed the entire backyard in one day.",
      "example_cn": "园艺师一天之内就把整个后院铺上了草皮。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "territory",
      "analysis": "“Territory”（领土/领域）更正式，常用于地理、政治或法律语境，指明确划分的主权或管辖区域。而 “turf” 更口语化，常带有竞争性、排他性色彩，强调对某领域的实际控制或占有，尤其在非正式或权力斗争中使用。"
    },
    {
      "word_to_compare": "grass",
      "analysis": "“Grass”（草）泛指植物本身，不包含土壤或结构；而 “turf” 特指连带根部土壤的草皮层，是一个可被切割、搬运和铺设的实体材料。两者在自然状态和人工用途上有本质区别。"
    },
    {
      "word_to_compare": "domain",
      "analysis": "“Domain”（领域）多用于抽象概念，如知识、专业或网络空间，强调范围和权限，不具物理性或竞争性。而 “turf” 不仅可指抽象领域，还常隐含地盘争夺、利益冲突的意味，更具对抗性和情感色彩。"
    }
  ]
}