{
  "word": "turnovers",
  "pronunciation": "tɜːrn·oʊ·vɜːrz",
  "concise_definition": "n. 转让, 交出, 失误, 营业额",
  "forms": {
    "singular": "turnover"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "In sports, especially basketball or football, the loss of possession of the ball due to a mistake or violation by the offensive team.",
      "explanation_cn": "在篮球或橄榄球等运动中，进攻方因失误或犯规而失去球权。",
      "example_en": "The team's high number of turnovers in the first half cost them the game.",
      "example_cn": "球队上半场多次失误丢球，最终输掉了比赛。"
    },
    {
      "pos": "noun",
      "explanation_en": "The rate at which employees leave a company and are replaced, often expressed as a percentage over a specific period.",
      "explanation_cn": "指员工离职并被新员工替代的比率，通常以特定时间段内的百分比表示。",
      "example_en": "The company has a turnover rate of 30% per year, which is higher than the industry average.",
      "example_cn": "该公司每年的员工流动率为30%，高于行业平均水平。"
    },
    {
      "pos": "noun",
      "explanation_en": "The total amount of money a business takes in during a specific period, especially through sales.",
      "explanation_cn": "指企业在特定时期内通过销售所获得的总收入，常用于商业语境。",
      "example_en": "The restaurant's monthly turnover exceeded $200,000 last year.",
      "example_cn": "这家餐厅去年的月营业额超过了20万美元。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of transferring ownership or control of something from one party to another, especially in business or finance.",
      "explanation_cn": "指将某物的所有权或控制权从一方转移至另一方的行为，尤用于商业或金融领域。",
      "example_en": "The merger led to a major turnover of assets between the two corporations.",
      "example_cn": "这次合并导致两家公司之间资产的重大转让。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "mistake",
      "analysis": "“Mistake”（错误）泛指任何不正确的行动或判断，是通用词；而 “turnover” 在体育语境中特指因失误导致的球权丧失，具有明确的规则后果，语义更具体、场景化。"
    },
    {
      "word_to_compare": "employee turnover",
      "analysis": "“Employee turnover” 是一个固定搭配，专指员工流动率，而单独的 “turnover” 可能指营业额或资产转让，需依赖上下文区分。前者是人力资源术语，后者是财务或体育术语。"
    },
    {
      "word_to_compare": "revenue",
      "analysis": "“Revenue”（收入）是会计术语，指企业从销售商品或服务中获得的总收入，强调财务结果；而 “turnover” 在英式英语中常与 revenue 同义，但在美式英语中更常用于指员工流动或体育失误，语义范围更广、语境依赖更强。"
    }
  ]
}