{
  "word": "turning",
  "pronunciation": "turr·ning",
  "concise_definition": "n. 转动, 转折点, 转机, (复数) 转弯处",
  "forms": {
    "base_form": "turn",
    "present_participle": "turning",
    "past_tense": "turned",
    "past_participle": "turned"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The action or process of rotating or changing direction, often referring to physical movement around an axis or point.",
      "explanation_cn": "指围绕某个轴心或点进行旋转或改变方向的动作或过程，通常用于描述物理运动。",
      "example_en": "The turning of the wheel caused the machine to start.",
      "example_cn": "车轮的转动使机器开始运转。"
    },
    {
      "pos": "noun",
      "explanation_en": "A critical point or moment at which a significant change occurs, especially in a situation, trend, or life path.",
      "explanation_cn": "指某个情况、趋势或人生轨迹中发生重大变化的关键时刻或转折点。",
      "example_en": "Winning the competition was a turning point in her career.",
      "example_cn": "赢得比赛是她职业生涯的一个转折点。"
    },
    {
      "pos": "noun",
      "explanation_en": "A bend or curve in a road, path, or route; often used in plural to refer to multiple such bends.",
      "explanation_cn": "指道路、小径或路线中的弯道或拐角，常以复数形式表示多个弯道。",
      "example_en": "Be careful at the next turning; it's very sharp.",
      "example_cn": "下一个转弯处要小心，非常急。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person's opportunity to perform or speak in a sequence, especially in a performance or formal setting.",
      "explanation_cn": "指在一系列活动中某人轮到表演或发言的机会，常用于表演或正式场合。",
      "example_en": "It's your turning to present the report now.",
      "example_cn": "现在轮到你来汇报了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rotation",
      "analysis": "“Rotation” (旋转) 是一个更技术性、更精确的术语，通常用于描述物体围绕固定轴心的周期性运动，常见于物理、工程或天文学语境。而 “turning” 更通用，可指任何方向的改变，不一定是周期性的，也常用于比喻意义。"
    },
    {
      "word_to_compare": "change",
      "analysis": "“Change” (变化) 是一个广泛的概念，泛指任何状态、形式或性质的改变，不特指方向或位置的变动。而 “turning” 在作为“转折点”使用时，特指具有决定性意义的、方向性的变化，更具动态和转折的意象。"
    },
    {
      "word_to_compare": "bend",
      "analysis": "“Bend” (弯曲) 强调的是形状上的弧度或曲度，通常用于描述静态的物理形态，如一条弯曲的河流。而 “turning” 强调的是动态的转向动作或事件中的转折时刻，更侧重于过程或时机，而非静态形态。"
    }
  ]
}