{
  "word": "turnover",
  "pronunciation": "tûrn·ō·vər",
  "concise_definition": "n. 员工流动率, 营业额, 旋转, 交接",
  "forms": {
    "plural": "turnovers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The rate at which employees leave a company and are replaced by new hires, often measured annually to assess workforce stability.",
      "explanation_cn": "指员工离职并被新员工替代的比率，通常以年度为单位衡量，用以评估员工队伍的稳定性。",
      "example_en": "The company's high turnover rate is causing concerns about workplace culture.",
      "example_cn": "该公司极高的员工流动率引发了对工作场所文化的担忧。"
    },
    {
      "pos": "noun",
      "explanation_en": "The total amount of money generated by a business through sales during a specific period, often used to measure commercial activity.",
      "explanation_cn": "指企业在特定时期内通过销售所获得的总收入，常用于衡量商业活动的规模。",
      "example_en": "The restaurant's monthly turnover exceeded $200,000 last quarter.",
      "example_cn": "上个季度，这家餐厅的月营业额超过了20万美元。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of flipping or rotating something, especially a physical object like a pancake or a page in a book.",
      "explanation_cn": "指翻转或旋转某物的动作，尤指煎饼、书页等实物的翻动。",
      "example_en": "She gave the pancake a perfect turnover with a quick flick of the spatula.",
      "example_cn": "她用铲子轻轻一抖，就把煎饼完美地翻了个面。"
    },
    {
      "pos": "noun",
      "explanation_en": "The process of transferring responsibility, control, or possession from one person or group to another, often in a formal or scheduled context.",
      "explanation_cn": "指在正式或有计划的情境下，将责任、控制权或所有权从一个人或团体转移到另一个人或团体的过程。",
      "example_en": "The turnover of power after the election was peaceful and orderly.",
      "example_cn": "选举后的权力交接平稳有序。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "employee turnover",
      "analysis": "虽然 'employee turnover' 是 'turnover' 的一个子义项，但单独使用时，'turnover' 本身含义更广，可指营业额、翻转等。'Employee turnover' 专指人员流动，语义更精确，而 'turnover' 在商业语境中常默认指营业额，需根据上下文判断。"
    },
    {
      "word_to_compare": "revenue",
      "analysis": "“Revenue”（收入）是会计术语，指企业因销售商品或服务而获得的总金额，强调财务报表中的正向收益。而 “turnover” 在英式英语中常与 revenue 同义，但在美式英语中更常用于指员工流动率，语义范围更广，且在非财务语境中不可互换。"
    },
    {
      "word_to_compare": "rotation",
      "analysis": "“Rotation”（轮换）强调周期性、有规律地更换位置或角色，如轮班制或轮岗制度，常用于组织管理或机械运动。而 “turnover” 更强调一次性的翻转或人员更替的总量，不强调规律性，且常带有负面或变动的语义色彩。"
    },
    {
      "word_to_compare": "handover",
      "analysis": "“Handover”（交接）特指责任、权力或物品从一方正式移交给另一方的过程，强调程序性和交接动作本身，多用于项目、岗位或军事场景。而 “turnover” 虽可指交接，但更广泛，可包含非正式、非计划性的更替，且常用于描述结果而非过程。"
    }
  ]
}