{
  "word": "turtles",
  "pronunciation": "turr·tuhlz",
  "concise_definition": "n. 乌龟, 海龟",
  "forms": {
    "singular": "turtle"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A reptile characterized by a bony or cartilaginous shell developed from its ribs, which serves as a protective shield; most species live in water but some are terrestrial.",
      "explanation_cn": "一种爬行动物，其特征是具有由肋骨演化而成的骨质或软骨质甲壳，用作保护屏障；大多数种类生活在水中，但有些为陆生。",
      "example_en": "Sea turtles migrate thousands of miles to return to the beaches where they were born.",
      "example_cn": "海龟会迁徙数千英里，回到它们出生的海滩。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slow-moving, long-lived animal often symbolizing patience, persistence, and longevity in folklore and culture.",
      "explanation_cn": "一种行动缓慢、寿命长的动物，常在民间传说和文化中象征耐心、毅力和长寿。",
      "example_en": "In Chinese mythology, the turtle is one of the four sacred animals representing stability and endurance.",
      "example_cn": "在中国神话中，乌龟是代表稳定与耐力的四大神兽之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A slang or informal term for a slow computer or device, especially one that responds with noticeable delay.",
      "explanation_cn": "俚语或非正式用语，指反应迟缓的电脑或设备，尤指响应明显延迟的设备。",
      "example_en": "My old laptop is a turtle—it takes minutes to open a simple document.",
      "example_cn": "我的旧笔记本电脑像乌龟一样慢——打开一个简单文档都要几分钟。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tortoise",
      "analysis": "“Tortoise”（陆龟）特指完全陆生、四肢粗壮、壳高而圆的龟类，通常不擅长游泳；而 “turtle” 是更广泛的统称，包括海龟、淡水龟和陆龟。在日常英语中，人们常混用，但在生物学上，所有 tortoises 都是 turtles，但并非所有 turtles 都是 tortoises。"
    },
    {
      "word_to_compare": "terrapin",
      "analysis": "“Terrapin”（水龟）主要指生活在淡水或半咸水环境中的龟类，常见于北美东部，如红耳滑龟。它与 “turtle” 的区别在于地理和生态语境，通常用于特定种类，而 “turtle” 是通用词。在英国英语中，terrapin 常指淡水龟，而在美国英语中，该词使用较少。"
    },
    {
      "word_to_compare": "chelonian",
      "analysis": "“Chelonian”（龟鳖目动物）是生物学上的正式分类术语，涵盖所有龟、鳖及其近亲，是科学语境中的上位词。而 “turtle” 是日常语言中的通俗名称，涵盖范围较广但非学术严谨。在专业文献中使用 “chelonian”，在普通对话中使用 “turtle”。"
    }
  ]
}