{
  "word": "twisting",
  "pronunciation": "twis·ting",
  "concise_definition": "v. 扭转, 扭曲, 编绞; n. 扭转, 扭曲",
  "forms": {
    "base_form": "twist",
    "third_person_singular": "twists",
    "past_tense": "twisted",
    "past_participle": "twisted",
    "present_participle": "twisting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To turn or rotate something around its own axis, often repeatedly or forcefully, causing a spiral or helical shape.",
      "explanation_cn": "指围绕自身轴线反复或用力地转动某物，使其形成螺旋状或螺旋形结构。",
      "example_en": "She was twisting the wire into a decorative coil.",
      "example_cn": "她正把金属丝拧成一个装饰性的线圈。"
    },
    {
      "pos": "verb",
      "explanation_en": "To distort or alter the meaning, truth, or original form of something, often deliberately to mislead.",
      "explanation_cn": "指故意歪曲、篡改某事物的原意、真相或形式，以达到误导的目的。",
      "example_en": "The politician twisted the facts to support his argument.",
      "example_cn": "这位政客歪曲了事实以支持他的论点。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move the body or a part of it in a twisting motion, often to avoid, express discomfort, or demonstrate flexibility.",
      "explanation_cn": "指身体或身体某部分做出扭转动作，常用于躲避、表达不适或展示柔韧性。",
      "example_en": "He winced as he felt a sharp pain in his twisting back.",
      "example_cn": "当他背部扭转时感到一阵剧痛，不禁皱起了眉头。"
    },
    {
      "pos": "noun",
      "explanation_en": "A twisting motion or the state of being twisted; can refer to a physical deformation or a complex, winding structure.",
      "explanation_cn": "指扭转的动作或处于扭曲状态的情形；可指物理上的变形，或复杂、蜿蜒的结构。",
      "example_en": "The rope had a tight twist that made it strong and durable.",
      "example_cn": "这根绳子有紧密的绞扭，使其坚固耐用。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "turning",
      "analysis": "“Turning” (转动) 指围绕一个中心点或轴进行一般性的旋转，方向可以是单向或循环，不强调螺旋或缠绕。而 “twisting” 更强调物体自身轴线上的螺旋式旋转，常伴随形变或缠绕，动作更剧烈、更具体。"
    },
    {
      "word_to_compare": "distorting",
      "analysis": "“Distorting” (扭曲) 侧重于改变形状、声音或意义，使其失真或不真实，常用于抽象概念（如信息、图像）。而 “twisting” 在用于抽象语境时，更强调主观故意的歪曲，带有道德或意图上的负面色彩，如 ‘twisting the truth’。"
    },
    {
      "word_to_compare": "bending",
      "analysis": "“Bending” (弯曲) 指物体在外力作用下发生弧形或角度变化，但不涉及旋转或缠绕。它通常是单向的、平滑的变形。而 “twisting” 涉及围绕轴线的旋转，常导致螺旋状或拧绞状的结构，变形更复杂。"
    }
  ]
}