{
  "word": "twists",
  "pronunciation": "twist",
  "concise_definition": "n. 扭转, 转折, 奇特的变动; v. 扭转, 捏, 编织",
  "forms": {
    "singular": "twist",
    "third_person_singular": "twists",
    "past_tense": "twisted",
    "past_participle": "twisted",
    "present_participle": "twisting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sudden and unexpected change in the direction or development of a story, situation, or plan, often creating surprise or dramatic effect.",
      "explanation_cn": "指故事、情况或计划中突然且出人意料的转折，常用于制造惊喜或戏剧性效果。",
      "example_en": "The movie had a shocking twist at the end that no one saw coming.",
      "example_cn": "这部电影结尾有一个令人震惊的转折，没人料到。"
    },
    {
      "pos": "noun",
      "explanation_en": "A physical turning or winding motion, especially of something flexible like rope, hair, or metal.",
      "explanation_cn": "指某种柔韧物体（如绳子、头发或金属）的物理性扭转或缠绕动作。",
      "example_en": "She styled her hair with soft twists for a bohemian look.",
      "example_cn": "她将头发编成柔和的发辫，营造出波西米亚风格。"
    },
    {
      "pos": "noun",
      "explanation_en": "A distorted or altered interpretation of something, often to mislead or manipulate.",
      "explanation_cn": "指对某事物的歪曲或篡改，常用于误导或操纵他人。",
      "example_en": "The politician gave a twist to the facts to suit his agenda.",
      "example_cn": "这位政客歪曲了事实以迎合自己的议程。"
    },
    {
      "pos": "verb",
      "explanation_en": "To turn or rotate something sharply or repeatedly, especially around its own axis.",
      "explanation_cn": "指将某物沿其轴线急剧或反复地扭转。",
      "example_en": "He twisted the cap off the bottle with one hand.",
      "example_cn": "他单手拧开了瓶盖。"
    },
    {
      "pos": "verb",
      "explanation_en": "To weave or braid strands together, often to form a rope, braid, or decorative pattern.",
      "explanation_cn": "指将多股材料编织或绞合在一起，通常形成绳索、发辫或装饰图案。",
      "example_en": "Artisans twist wool fibers to create warm, durable yarn.",
      "example_cn": "工匠们将羊毛纤维捻成温暖而耐用的纱线。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "turn",
      "analysis": "“Turn”（转动）泛指任何方向上的改变，可以是轻微的、平缓的，如“turn left”或“turn the page”；而 “twist” 强调更剧烈、更紧密的旋转或缠绕，常带有扭曲、变形的意味，如“twist your ankle”。"
    },
    {
      "word_to_compare": "change",
      "analysis": "“Change”（改变）是最通用的词，指任何形式的变动，不强调方式或性质；而 “twist” 作为名词时特指一种出人意料、戏剧性的转折，常用于叙事语境，带有情感或情节冲击力，如“plot twist”。"
    },
    {
      "word_to_compare": "distortion",
      "analysis": "“Distortion”（扭曲）多用于指信息、图像或声音的失真，偏重客观的变形或错误呈现；而 “twist” 作为名词时更强调主观的、有意的歪曲，常含贬义，如“twist the truth”，暗示操纵意图。"
    }
  ]
}