{
  "word": "twist",
  "pronunciation": "twist",
  "concise_definition": "v. 扭转, 捏拧, 曲解; n. 扭转, 扭曲, 惊人转折",
  "forms": {
    "third_person_singular": "twists",
    "past_tense": "twisted",
    "past_participle": "twisted",
    "present_participle": "twisting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To turn or rotate something, especially by applying force to cause a spiral or helical motion.",
      "explanation_cn": "指通过施加力量使某物旋转或扭转，通常形成螺旋状或缠绕状的运动。",
      "example_en": "She twisted the cap off the bottle with ease.",
      "example_cn": "她轻松地拧开了瓶盖。"
    },
    {
      "pos": "verb",
      "explanation_en": "To distort or misrepresent the meaning of something, often intentionally, to suit a particular purpose or agenda.",
      "explanation_cn": "指有意曲解或歪曲某事物的原意，以迎合特定目的或议程。",
      "example_en": "The politician twisted his opponent's words to make them sound extreme.",
      "example_cn": "这位政客歪曲了对手的话，使其听起来极端化。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden, unexpected change in a story, plot, or situation that surprises the audience.",
      "explanation_cn": "指故事、情节或情境中出人意料的突然转折，令观众感到惊讶。",
      "example_en": "The movie had a brilliant twist at the end that no one saw coming.",
      "example_cn": "这部电影结尾有一个精彩的反转，没人料到。"
    },
    {
      "pos": "noun",
      "explanation_en": "A physical deformation or spiral shape caused by twisting, such as in rope, wire, or hair.",
      "explanation_cn": "指因扭转而产生的物理变形或螺旋形状，如绳子、电线或头发的卷曲。",
      "example_en": "The rope had a tight twist that made it strong and durable.",
      "example_cn": "这根绳子有紧密的绞扭，使其坚固耐用。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "turn",
      "analysis": "“Turn” (转动) 是一个更通用的词，指任何方向上的旋转或改变方向，不一定涉及扭曲或缠绕。而 “twist” 强调的是围绕轴心的螺旋式或拧转动作，通常带有变形或施加张力的含义。"
    },
    {
      "word_to_compare": "distort",
      "analysis": "“Distort” (扭曲) 通常用于抽象概念，如信息、事实或形象的歪曲，强调失真或不准确。而 “twist” 在表示曲解时更常带有主观意图，常用于口语或叙事语境，语气更生动、更具操纵性。"
    },
    {
      "word_to_compare": "plot twist",
      "analysis": "“Plot twist” 是一个固定搭配，特指故事中的意外转折，而 “twist” 单独使用时可泛指任何类型的扭转或变形。在文学和影视语境中，‘twist’ 已成为‘plot twist’的简略表达，但其本义仍涵盖物理和语言层面的双重含义。"
    }
  ]
}