{
  "word": "twitch",
  "pronunciation": "twich",
  "concise_definition": "v. 抽动, 颤动; n. 抽动, 颤动",
  "forms": {
    "third_person_singular": "twitches",
    "past_tense": "twitched",
    "past_participle": "twitched",
    "present_participle": "twitching"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To make a sudden, small, involuntary movement, especially of a muscle or part of the body, often due to nervousness, fatigue, or irritation.",
      "explanation_cn": "指肌肉或身体某部分因紧张、疲劳或刺激而突然、轻微、不自主地抽动。",
      "example_en": "His eye began to twitch after hours of staring at the computer screen.",
      "example_cn": "他连续数小时盯着电脑屏幕后，眼睛开始抽动。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or shake with quick, jerky motions, often describing the movement of animals or objects under tension.",
      "explanation_cn": "指以快速、断续的动作移动或抖动，常用于描述动物或处于张力下的物体。",
      "example_en": "The cat's tail twitched as it watched the bird outside the window.",
      "example_cn": "猫看到窗外的鸟时，尾巴轻轻抽动。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden, brief, involuntary movement, especially of a muscle or part of the body.",
      "explanation_cn": "指肌肉或身体某部分突然、短暂、不自主的抽动。",
      "example_en": "She noticed a twitch in her left cheek after drinking too much coffee.",
      "example_cn": "她喝太多咖啡后，注意到左脸颊出现了一阵抽动。"
    },
    {
      "pos": "noun",
      "explanation_en": "A live-streaming platform primarily used for broadcasting video game play, often with real-time audience interaction.",
      "explanation_cn": "指一个主要用于直播电子游戏并支持实时观众互动的在线直播平台。",
      "example_en": "He streams his gaming sessions on Twitch every evening.",
      "example_cn": "他每天晚上都在 Twitch 上直播自己的游戏过程。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "spasm",
      "analysis": "“Spasm”（痉挛）指肌肉剧烈、疼痛性的不自主收缩，通常更强烈、更持久，常与病理状态相关；而 “twitch” 更轻微、短暂，多为生理或情绪性反应，不伴随疼痛。"
    },
    {
      "word_to_compare": "shiver",
      "analysis": "“Shiver”（颤抖）通常由寒冷或恐惧引起，是全身性或大范围的、有节奏的抖动；而 “twitch” 是局部、快速、非节奏性的微小抽动，多限于单个肌肉或小区域。"
    },
    {
      "word_to_compare": "stream",
      "analysis": "“Stream”（直播）是泛指任何实时视频传输，而 “Twitch” 是一个专有名词，特指以游戏直播为核心的平台。虽然 “twitch” 作动词时指抽动，但作为名词时已成为一个文化符号，专指该平台，与一般意义上的 “stream” 有本质区别。"
    }
  ]
}