{
  "word": "umpire",
  "pronunciation": "um·paɪr",
  "concise_definition": "n. 裁判, 仲裁者; v. 担任裁判",
  "forms": {
    "plural": "umpires",
    "third_person_singular": "umpires",
    "past_tense": "umpired",
    "past_participle": "umpired",
    "present_participle": "umpiring"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person officially appointed to enforce the rules and make decisions during a sports game, especially in baseball, cricket, or tennis, ensuring fair play and resolving disputes.",
      "explanation_cn": "指在体育比赛中（尤其是棒球、板球或网球）被正式任命以执行规则、做出裁决、确保公平竞赛并解决争议的官员。",
      "example_en": "The umpire called the runner out at home plate after a close play.",
      "example_cn": "在一次激烈的比赛后，裁判判定跑垒员在本垒出局。"
    },
    {
      "pos": "noun",
      "explanation_en": "A neutral person who mediates or adjudicates disputes between two or more parties, especially in non-sports contexts such as business or arbitration.",
      "explanation_cn": "指在非体育语境中（如商业或仲裁）调解或裁决双方或多方争议的中立者。",
      "example_en": "The two companies agreed to bring in an independent umpire to resolve their contract dispute.",
      "example_cn": "两家公司同意聘请一位独立仲裁者来解决他们的合同纠纷。"
    },
    {
      "pos": "verb",
      "explanation_en": "To act as an official referee or arbitrator in a game or dispute, making judgments according to established rules or standards.",
      "explanation_cn": "指担任比赛或争议中的裁判或仲裁者，依据既定规则或标准作出裁决。",
      "example_en": "She umpired the championship match with calm authority.",
      "example_cn": "她以沉着的权威担任了这场冠军赛的裁判。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "referee",
      "analysis": "“Referee”（裁判）通常用于足球、篮球等团队运动，强调对比赛全过程的监督和判罚，常为场上唯一权威。而 “umpire” 更多用于棒球、板球、网球等运动，有时与“referee”并存（如网球中主裁为umpire，线审为linesman），且在非体育语境中，“umpire”更常用于指仲裁者，而“referee”较少用于此义。"
    },
    {
      "word_to_compare": "arbitrator",
      "analysis": "“Arbitrator”（仲裁员）是法律或商业语境中的正式术语，指经双方同意解决争议的第三方，其裁决通常具有法律约束力。而 “umpire” 在非体育语境中虽可作同义词使用，但语气更口语化或非正式，且不一定具有法律效力。"
    },
    {
      "word_to_compare": "judge",
      "analysis": "“Judge”（法官）是司法系统中的正式职位，拥有法律权力作出具有强制力的判决，通常在法庭中行使职能。而 “umpire” 虽然也做裁决，但其权威仅限于特定规则体系（如体育规则或合同条款），不具备国家司法权，语义范围更窄、更具体。"
    }
  ]
}