{
  "word": "underground",
  "pronunciation": "uhn·duhr·grawnd",
  "concise_definition": "n. 地铁, 地下; adj. 地下的, 非官方的; adv. 在地下",
  "forms": {
    "comparative": "undergrounder",
    "superlative": "undergroundest",
    "plural": "undergrounds"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A system of subterranean railway lines used for public transportation in cities, especially in the UK; also refers to the railway system itself.",
      "explanation_cn": "指城市中用于公共交通的地下铁路系统，尤指英国的地铁系统；也可指整个地铁系统本身。",
      "example_en": "I take the underground to work every morning.",
      "example_cn": "我每天早上坐地铁上班。"
    },
    {
      "pos": "noun",
      "explanation_en": "A secret or illegal movement, organization, or activity that operates outside official channels, often in opposition to authority.",
      "explanation_cn": "指在官方渠道之外秘密运作的运动、组织或活动，通常反对权威或主流体制。",
      "example_en": "The resistance group operated as an underground network during the war.",
      "example_cn": "战争期间，抵抗组织作为一个地下网络运作。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Located or occurring beneath the surface of the ground; not visible from above.",
      "explanation_cn": "位于地面之下或在地表以下发生的；从地表不可见的。",
      "example_en": "The underground tunnels connected the old castle to the nearby village.",
      "example_cn": "这些地下隧道连接着古堡与附近的村庄。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Existing or operating outside the mainstream, especially in culture, art, or politics; nonconformist or counter-cultural.",
      "explanation_cn": "指存在于主流之外的文化、艺术或政治领域；非正统的、反主流文化的。",
      "example_en": "She is known for her underground punk music and radical fashion.",
      "example_cn": "她以地下朋克音乐和激进的时尚风格而闻名。"
    },
    {
      "pos": "adverb",
      "explanation_en": "Beneath the surface of the ground; in or into the underground.",
      "explanation_cn": "在地表之下；进入地下。",
      "example_en": "The soldiers buried themselves underground to avoid detection.",
      "example_cn": "士兵们埋伏在地下以躲避侦察。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "subway",
      "analysis": "“Subway” (地铁) 是 “underground” 在美式英语中的同义词，专指城市地下铁路系统，语义范围更窄，仅用于交通语境。而 “underground” 除指地铁外，还可表示秘密组织或地下文化，语义更广。"
    },
    {
      "word_to_compare": "secret",
      "analysis": "“Secret” (秘密的) 强调隐藏信息或行为以避免被发现，但不一定涉及物理位置或系统性组织。而 “underground” 暗示一种有组织、持续运作的隐秘结构，常用于政治、文化或交通系统语境，比 “secret” 更具结构性和集体性。"
    },
    {
      "word_to_compare": "subterranean",
      "analysis": "“Subterranean” (地下的) 是一个更正式、学术化的词汇，专指物理意义上的地下空间，如洞穴、隧道，不用于比喻义（如地下文化或抵抗组织）。而 “underground” 既可用于物理空间，也广泛用于社会和文化隐喻，语义更灵活。"
    }
  ]
}