{
  "word": "underworld",
  "pronunciation": "uhn·duhr·wurld",
  "concise_definition": "n. 黑社会, 阴间, 地下世界",
  "forms": {
    "plural": "underworlds"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The secret and often illegal network of criminal activities and organizations, such as gangs, drug traffickers, and smugglers, operating outside the bounds of lawful society.",
      "explanation_cn": "指在合法社会之外秘密运作的犯罪活动与组织网络，如帮派、毒品贩子和走私者等。",
      "example_en": "The detective spent years infiltrating the city's underworld to bring down the crime syndicate.",
      "example_cn": "这名侦探花了数年时间渗透进这座城市的黑社会，以摧毁这个犯罪集团。"
    },
    {
      "pos": "noun",
      "explanation_en": "In mythology and religion, the realm of the dead; a hidden, subterranean world where souls go after death.",
      "explanation_cn": "在神话与宗教中，指死者灵魂所去的领域；一个隐藏在地下的亡者世界。",
      "example_en": "In Greek mythology, Hades rules the underworld, where the spirits of the departed reside.",
      "example_cn": "在希腊神话中，哈迪斯统治着阴间，亡者的灵魂在此栖息。"
    },
    {
      "pos": "noun",
      "explanation_en": "A hidden or obscure social or cultural sphere that exists beneath the surface of mainstream society, often with its own rules and values.",
      "explanation_cn": "指存在于主流社会表面之下的隐秘社会或文化领域，通常拥有自己独特的规则与价值观。",
      "example_en": "The city's underground art scene is a vibrant part of its cultural underworld.",
      "example_cn": "这座城市的地下艺术圈是其文化地下世界中充满活力的一部分。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "crime",
      "analysis": "“Crime” (犯罪) 指具体的违法行为或事件，是单个行为的名词化，如盗窃、谋杀。而 “underworld” 是一个系统性、组织性的犯罪生态体系，包含人、组织、规则和文化，是犯罪活动发生的背景与结构。"
    },
    {
      "word_to_compare": "netherworld",
      "analysis": "“Netherworld” (冥界) 与 “underworld” 在神话语境中常可互换，但 “netherworld” 更具文学性与宗教色彩，强调“下方”或“深处”的空间感，多用于诗歌或宗教文本；而 “underworld” 更常用于现代语境，既可指阴间，也可指黑社会。"
    },
    {
      "word_to_compare": "underground",
      "analysis": "“Underground” (地下) 通常指物理意义上的地下空间，或隐秘的、非官方的社会活动（如地下音乐、地下抵抗组织），但不一定涉及犯罪。而 “underworld” 特指非法、有组织的犯罪世界，具有更强的负面和危险含义。"
    }
  ]
}