{
  "word": "undermined",
  "pronunciation": "un·dər·ˈmīnd",
  "concise_definition": "v. 暗中破坏, 逐步削弱, 侵蚀",
  "forms": {
    "base_form": "undermine",
    "third_person_singular": "undermines",
    "past_tense": "undermined",
    "past_participle": "undermined",
    "present_participle": "undermining"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To weaken or damage something gradually, often in a subtle or indirect way, especially by eroding its foundation, authority, or confidence.",
      "explanation_cn": "指通过隐蔽或间接的方式逐步削弱某事物，尤其是侵蚀其基础、权威或信心。",
      "example_en": "The constant criticism from the media undermined the government's credibility.",
      "example_cn": "媒体持续的批评削弱了政府的公信力。"
    },
    {
      "pos": "verb",
      "explanation_en": "To undermine a person's position, efforts, or authority by secretly working against them or encouraging doubt.",
      "explanation_cn": "指通过暗中反对或制造怀疑来破坏某人的地位、努力或权威。",
      "example_en": "Her colleague undermined her leadership by spreading rumors about her decisions.",
      "example_cn": "她的同事通过散布关于她决策的谣言来破坏她的领导权威。"
    },
    {
      "pos": "verb",
      "explanation_en": "To erode the base or foundation of a structure, either literally (as in excavation) or metaphorically (as in trust or stability).",
      "explanation_cn": "指字面或隐喻意义上侵蚀某物的基础或根基，如挖空地基，或破坏信任与稳定。",
      "example_en": "The river's current has undermined the bridge's support pillars.",
      "example_cn": "河水的冲刷已经侵蚀了桥墩的支撑结构。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "weaken",
      "analysis": "“Weaken” (削弱) 是一个更通用的词，泛指任何程度的变弱，可以是直接或明显的，如体力下降或力量减弱。而 “undermine” 强调的是通过隐蔽、渐进、间接的方式进行破坏，通常带有蓄意或阴谋的意味，且常涉及信任、权威或结构基础的瓦解。"
    },
    {
      "word_to_compare": "erode",
      "analysis": "“Erode” (侵蚀) 与 “undermine” 在字面意义上非常接近，都可指物理上的逐渐磨损，如水流侵蚀岩石。但 “erode” 更常用于自然过程或缓慢的损耗，而 “undermine” 更常用于社会、政治或心理层面的破坏，且隐含了主动的、有目的的破坏行为。"
    },
    {
      "word_to_compare": "sabotage",
      "analysis": "“Sabotage” (蓄意破坏) 指有意识地采取破坏性行动，通常为突然、剧烈或直接的破坏行为，如炸毁设备或篡改系统。而 “undermine” 是一种更隐蔽、长期、渐进的破坏方式，不一定是直接行动，而是通过动摇信心、制造分裂或散布怀疑来实现。"
    }
  ]
}