{
  "word": "undermines",
  "pronunciation": "uhn·duhr·mīnz",
  "concise_definition": "v. 暗中破坏, 逐步削弱",
  "forms": {
    "base_form": "undermine",
    "third_person_singular": "undermines",
    "past_tense": "undermined",
    "past_participle": "undermined",
    "present_participle": "undermining"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To weaken or damage something gradually, often in a subtle or indirect way, especially by eroding its foundation, authority, or effectiveness.",
      "explanation_cn": "指通过隐蔽或间接的方式逐步削弱某事物的基础、权威或效力，使其逐渐失去力量或可信度。",
      "example_en": "Constant criticism from the media undermines public confidence in the government.",
      "example_cn": "媒体持续的批评正在削弱公众对政府的信心。"
    },
    {
      "pos": "verb",
      "explanation_en": "To undermine a person’s position, authority, or efforts by secretly or persistently acting against them, often through manipulation or doubt.",
      "explanation_cn": "指通过秘密或持续的行动，以操纵或制造怀疑等方式，破坏某人的地位、权威或努力。",
      "example_en": "His colleagues undermined her leadership by spreading rumors about her decisions.",
      "example_cn": "他的同事们通过散布关于她决策的谣言来破坏她的领导权威。"
    },
    {
      "pos": "verb",
      "explanation_en": "To erode the physical base or structure of something, such as soil or a wall, often through natural forces like water or wind.",
      "explanation_cn": "指通过自然力量（如水流或风力）侵蚀某物的物理基础或结构，如土壤或墙体。",
      "example_en": "Years of flooding have undermined the foundation of the old bridge.",
      "example_cn": "多年的洪水已侵蚀了这座旧桥的基础。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "weakens",
      "analysis": "“Weakens”（削弱）是一个更通用的词，泛指使某物变弱，可以是直接或间接的，但不强调过程的隐蔽性或结构性侵蚀。而 “undermines” 更强调通过潜移默化、逐步瓦解的方式破坏根基，具有更强的负面和策略性含义。"
    },
    {
      "word_to_compare": "destroys",
      "analysis": "“Destroys”（摧毁）意味着彻底毁灭，是立即且全面的破坏；而 “undermines” 是渐进的、非直接的破坏，目标可能尚未完全崩溃，但已处于危险边缘。前者是结果，后者是过程。"
    },
    {
      "word_to_compare": "subverts",
      "analysis": "“Subverts”（颠覆）通常指有意识地推翻制度、体系或权威，常带有政治或意识形态色彩，行动更具组织性和目的性。而 “undermines” 更侧重于通过持续的侵蚀、质疑或间接手段使目标自然衰弱，不一定有明确的颠覆意图。"
    }
  ]
}