{
  "word": "underwriting",
  "pronunciation": "uhn·duhr·rī·tihng",
  "concise_definition": "n. 承保, 承销, 担保",
  "forms": {
    "noun": "underwriting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process by which an insurance company evaluates the risk of insuring a person or asset and determines the premium and terms of coverage.",
      "explanation_cn": "保险公司评估投保人或资产的风险，并据此确定保费和保障条款的过程。",
      "example_en": "The underwriting process for health insurance can take several weeks to complete.",
      "example_cn": "健康保险的承保流程可能需要数周才能完成。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of guaranteeing the sale of securities by purchasing them from an issuer and reselling them to investors, often in the context of an initial public offering (IPO).",
      "explanation_cn": "在证券发行中，承销商承诺购买发行人所发行的证券，并转售给投资者，以确保证券成功发售的行为，常用于首次公开募股（IPO）。",
      "example_en": "The investment bank acted as the lead underwriter for the company's IPO, assuming the financial risk of unsold shares.",
      "example_cn": "这家投资银行担任该公司IPO的主承销商，承担了未售出股票的财务风险。"
    },
    {
      "pos": "noun",
      "explanation_en": "A formal commitment or guarantee, especially one that assumes financial responsibility for a potential loss or obligation.",
      "explanation_cn": "一种正式的承诺或担保，尤其指承担潜在损失或义务的财务责任。",
      "example_en": "The government provided underwriting for the infrastructure project to ensure its financial viability.",
      "example_cn": "政府为该基础设施项目提供担保，以确保其财务可行性。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "insurance",
      "analysis": "“Insurance” (保险) 是一个广义术语，指通过支付保费转移风险的机制或产品本身；而 “underwriting” 是保险流程中的核心环节，特指风险评估与条款制定的决策过程。前者是结果，后者是手段。"
    },
    {
      "word_to_compare": "sponsorship",
      "analysis": "“Sponsorship” (赞助) 通常指企业或个人为支持某项活动、项目或个人而提供资金或资源，带有宣传或品牌推广目的；而 “underwriting” 强调承担财务风险或责任，尤其在金融或保险语境中具有法律和经济约束力，不以宣传为主要目的。"
    },
    {
      "word_to_compare": "guarantee",
      "analysis": "“Guarantee” (担保) 是一种更通用的承诺，可应用于各种场景（如产品质量、债务偿还），不一定涉及风险评估或专业判断；而 “underwriting” 是专业机构基于数据分析和风险模型作出的系统性承诺，常见于金融和保险行业，具有更强的技术性和规范性。"
    }
  ]
}