{
  "word": "undone",
  "pronunciation": "un·dun",
  "concise_definition": "adj. 未完成的, 未解决的, 松开的; v. 使 undone (undo 的过去分词)",
  "forms": {
    "base_form": "undo",
    "past_tense": "undid",
    "past_participle": "undone",
    "present_participle": "undoing"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Not completed or resolved; left in a state of incompleteness or disorder, often implying a sense of unfinished business or unresolved consequences.",
      "explanation_cn": "未完成或未解决的；处于不完整或混乱的状态，常暗示存在未了结的事务或未解决的后果。",
      "example_en": "The project remains undone due to lack of funding.",
      "example_cn": "由于缺乏资金，这个项目仍未能完成。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Loosened or unfastened, especially referring to clothing or ties that have come apart or been released from their secured state.",
      "explanation_cn": "松开的，尤指衣物、领带等从固定状态中解开或散开。",
      "example_en": "She noticed her shoelaces were undone and bent down to tie them.",
      "example_cn": "她注意到自己的鞋带松开了，于是弯下腰去系好。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Reversed or nullified in effect; having had a previous action or result canceled or erased.",
      "explanation_cn": "被撤销或抵消的；先前的行为或结果已被取消或消除。",
      "example_en": "All the progress we made was undone by the new policy.",
      "example_cn": "我们取得的所有进展都被新政策抵消了。"
    },
    {
      "pos": "verb",
      "explanation_en": "The past participle of 'undo', used to describe the action of reversing, canceling, or removing the effects of a prior action.",
      "explanation_cn": "“undo”的过去分词形式，用于描述撤销、取消或消除先前行为效果的动作。",
      "example_en": "The mistake had been undone before anyone noticed.",
      "example_cn": "在任何人注意到之前，这个错误已经被纠正了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "unfinished",
      "analysis": "“Unfinished” (未完成的) 仅指某物尚未完成，强调时间或进度上的未完结，中性客观，如“unfinished painting”。而 “undone” 不仅可指未完成，还常带有负面含义，如被撤销、被打乱、陷入混乱，语义更丰富且常含情感色彩。"
    },
    {
      "word_to_compare": "reversed",
      "analysis": "“Reversed” (逆转的) 侧重于方向或顺序的翻转，如“reversed the decision”（撤销决定），强调动作的反向性。而 “undone” 更强调结果的消除或归零，不一定是方向性反转，可能是彻底抹去影响，如“his reputation was undone”。"
    },
    {
      "word_to_compare": "disheveled",
      "analysis": "“Disheveled” (凌乱的) 专指外表（如头发、衣着）不整齐，常用于描述人的仪容，如“a disheveled man”。而 “undone” 在描述衣物松开时虽有相似用法，但范围更广，可指抽象事务（如计划、成果）的瓦解，语义层次更广。"
    }
  ]
}