{
  "word": "uniform",
  "pronunciation": "yoo·nuh·form",
  "concise_definition": "n. 制服, 一致的样式; adj. 一致的, 统一的",
  "forms": {
    "plural": "uniforms",
    "comparative": "more uniform",
    "superlative": "most uniform"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A standardized set of clothing worn by members of an organization or group to indicate their affiliation, role, or rank, often enforced by rules or tradition.",
      "explanation_cn": "指由组织或团体成员穿着的标准化服装，用以表明其所属关系、职务或等级，通常由规则或传统强制要求。",
      "example_en": "The police officers wore dark blue uniforms with badges on their chests.",
      "example_cn": "警察们穿着深蓝色的制服，胸前佩戴着徽章。"
    },
    {
      "pos": "noun",
      "explanation_en": "A consistent or unchanging pattern, appearance, or condition across a group or system.",
      "explanation_cn": "指在某一群体或系统中保持一致或不变的模式、外观或状态。",
      "example_en": "There was a uniformity in the design of all the buildings in the new housing estate.",
      "example_cn": "这个新住宅区所有建筑的设计都保持了一致性。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Being the same or consistent in form, appearance, or character throughout; lacking variation.",
      "explanation_cn": "指在形式、外观或特征上始终如一、无变化的；缺乏多样性。",
      "example_en": "The teacher asked for uniform handwriting in all the students' assignments.",
      "example_cn": "老师要求所有学生的作业字迹工整一致。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Applied equally or without distinction to all members of a group or category.",
      "explanation_cn": "指对某一群体或类别中的所有成员一视同仁、无差别地适用。",
      "example_en": "The company has a uniform policy on remote work for all employees.",
      "example_cn": "该公司对所有员工实行统一的远程办公政策。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "costume",
      "analysis": "“Costume”（服装/戏服）通常指为特定场合、表演或节日设计的非日常服饰，强调戏剧性、临时性或文化象征，如万圣节服装或历史剧服饰。而 “uniform” 强调规范性、身份标识和持续性，通常与组织纪律相关。"
    },
    {
      "word_to_compare": "standard",
      "analysis": "“Standard”（标准）指衡量事物的准则或规范，可以是抽象的规则、数值或行为要求，而 “uniform” 更侧重于具体可见的一致性，如外观、形式或穿着。一个标准可以导致 uniformity，但本身不是视觉上的统一。"
    },
    {
      "word_to_compare": "homogeneous",
      "analysis": "“Homogeneous”（同质的）是更学术化的术语，强调组成成分在性质、结构或本质上的完全相同，常用于科学或数学语境（如均匀混合物）。而 “uniform” 更常用于日常语境，描述外观、形式或规则的一致性，不一定涉及内在本质的相同。"
    }
  ]
}