{
  "word": "unions",
  "pronunciation": "yoo·nyunz",
  "concise_definition": "n. 工会, 联合, 结合, 婚姻",
  "forms": {
    "singular": "union"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An organization of workers formed to protect and advance their rights and interests, especially regarding wages, working conditions, and benefits.",
      "explanation_cn": "由工人组成的组织，旨在保护和促进其在工资、工作条件和福利等方面的权利与利益。",
      "example_en": "The factory workers voted to join the national union for better pay and safety standards.",
      "example_cn": "工厂工人投票决定加入全国工会，以争取更好的薪酬和安全标准。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or state of joining two or more things together as a single unit, often for mutual benefit or functional integration.",
      "explanation_cn": "指两个或多个事物结合为一个整体的行为或状态，通常为了共同利益或功能整合。",
      "example_en": "The union of the two companies created a powerful new corporation.",
      "example_cn": "两家公司的合并催生了一家强大的新企业。"
    },
    {
      "pos": "noun",
      "explanation_en": "A legal or formal marriage, especially in contexts emphasizing the binding nature of the relationship.",
      "explanation_cn": "指法律上或正式的婚姻关系，尤其强调关系的约束性和永久性。",
      "example_en": "Their union was celebrated by family and friends in a traditional ceremony.",
      "example_cn": "他们的婚姻在一场传统仪式中得到了家人和朋友的庆祝。"
    },
    {
      "pos": "noun",
      "explanation_en": "In mathematics or logic, the set containing all elements that belong to one or more of the given sets.",
      "explanation_cn": "在数学或逻辑中，指包含所有属于一个或多个给定集合的元素的集合。",
      "example_en": "The union of set A = {1, 2} and set B = {2, 3} is {1, 2, 3}.",
      "example_cn": "集合 A = {1, 2} 与集合 B = {2, 3} 的并集是 {1, 2, 3}。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "association",
      "analysis": "“Association” (协会) 通常指成员因共同兴趣、职业或目标而组成的松散团体，不一定具有法律权力或集体谈判能力。而 “union” 特指为争取劳工权益而组织的、具有正式结构和谈判权的工人组织，更具对抗性和制度性。"
    },
    {
      "word_to_compare": "alliance",
      "analysis": "“Alliance” (联盟) 多用于国家、政党或组织之间的战略协作，强调共同目标下的合作，但不涉及成员个体的直接利益保障。而 “union” 更侧重于个体成员（如工人）的集体利益，常带有组织化、制度化和权利主张的特征。"
    },
    {
      "word_to_compare": "marriage",
      "analysis": "“Marriage” (婚姻) 是指两个人之间基于法律或宗教认可的亲密结合关系，强调情感与法律义务。而 “union” 在此语境下是更抽象、更正式的术语，可涵盖婚姻，但也用于非情感性的结合（如公司合并、集合并集），适用范围更广。"
    }
  ]
}