{
  "word": "united",
  "pronunciation": "yoo·nay·tidd",
  "concise_definition": "adj. 统一的, 联合的, 团结的",
  "forms": {
    "comparative": "more united",
    "superlative": "most united"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Joined together as a single entity or group, especially through shared purpose, agreement, or common interest, often implying harmony and solidarity.",
      "explanation_cn": "通过共同的目标、协议或利益结合成一个整体，通常暗示着和谐与团结。",
      "example_en": "The united front of the opposition parties surprised even their strongest critics.",
      "example_cn": "反对党组成的统一阵线令即使是他们最坚定的批评者也感到惊讶。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used in the name of a country or organization to indicate political or territorial union, especially when previously separate entities have merged.",
      "explanation_cn": "用于国家或组织名称中，表示先前分离的实体已合并为一个政治或领土联合体。",
      "example_en": "The United States of America was formed by the union of thirteen independent colonies.",
      "example_cn": "美利坚合众国是由十三个独立殖民地联合而成的。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by a sense of oneness or cohesion, especially in emotion, action, or opinion, often in contrast to division or conflict.",
      "explanation_cn": "表现出一种一体感或凝聚力，尤其在情感、行动或观点上，常与分裂或冲突形成对比。",
      "example_en": "Despite their differences, the family remained united in their support for the child.",
      "example_cn": "尽管存在分歧，这个家庭在支持孩子的问题上依然团结一致。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "combined",
      "analysis": "“Combined” (合并的) 强调将两个或多个独立事物物理或功能上放在一起，但不一定意味着内在的统一或和谐。例如，混合颜色或合并文件。“United” 则更强调精神、目标或意志上的整合，具有更强的凝聚力和一致性。"
    },
    {
      "word_to_compare": "joined",
      "analysis": "“Joined” (连接的) 侧重于物理或形式上的连接，如人与人握手、两块木板钉在一起。它不隐含情感或目标的一致性。而 “united” 暗示了更深层次的协作、认同和共同目的，常用于政治、社会或情感语境。"
    },
    {
      "word_to_compare": "cohesive",
      "analysis": "“Cohesive” (有凝聚力的) 描述的是一个群体内部成员之间紧密联系、协调一致的状态，常用于描述团队、组织或语言结构。它与 “united” 意义接近，但 “cohesive” 更强调内在的粘合机制，而 “united” 更强调外部行动或结构上的统一，如国家、联盟的形成。"
    }
  ]
}