{
  "word": "universes",
  "pronunciation": "yoo·nuh·vurss",
  "concise_definition": "n. 宇宙, 世界, 领域",
  "forms": {
    "singular": "universe"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The totality of all space, time, matter, energy, and laws that exist; the physical cosmos as a whole.",
      "explanation_cn": "指所有空间、时间、物质、能量及其规律的总和；作为整体的物理宇宙。",
      "example_en": "Scientists study the origins of the universe using data from the Hubble Space Telescope.",
      "example_cn": "科学家利用哈勃太空望远镜的数据研究宇宙的起源。"
    },
    {
      "pos": "noun",
      "explanation_en": "A distinct or self-contained realm of existence, often used in fiction, philosophy, or physics to describe a separate reality with its own laws and dimensions.",
      "explanation_cn": "指一个独立或自洽的存在领域，常用于小说、哲学或物理学中，描述具有自身规律和维度的平行现实。",
      "example_en": "In this multiverse theory, every decision creates a new universe where the alternative outcome occurs.",
      "example_cn": "在这个多重宇宙理论中，每一个决定都会创造一个新的宇宙，在其中替代性结果得以发生。"
    },
    {
      "pos": "noun",
      "explanation_en": "A particular world or domain of activity, interest, or experience, often used metaphorically to describe a person's personal or specialized sphere.",
      "explanation_cn": "指某一特定的世界或活动领域，常用于隐喻，描述一个人的个人或专业领域。",
      "example_en": "She lives in a universe of classical music and poetry, completely detached from modern pop culture.",
      "example_cn": "她活在古典音乐与诗歌的世界里，完全脱离了现代流行文化。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cosmos",
      "analysis": "“Cosmos”（宇宙）与 “universe” 非常接近，常可互换，但 “cosmos” 更强调宇宙的秩序、和谐与美感，带有哲学或诗意色彩，而 “universe” 更偏向科学和客观描述。"
    },
    {
      "word_to_compare": "multiverse",
      "analysis": "“Multiverse”（多重宇宙）是 “universe” 的扩展概念，指由多个独立宇宙组成的系统，每个宇宙可能拥有不同的物理定律。而 “universe” 通常指单一的整体存在，不包含其他平行现实。"
    },
    {
      "word_to_compare": "world",
      "analysis": "“World”（世界）含义更广，可指地球、人类社会、某人的生活领域，或比喻性存在，语义范围比 “universe” 更小、更具体。而 “universe” 强调包含一切的终极整体，具有更宏大的尺度和抽象性。"
    }
  ]
}