{
  "word": "unplugged",
  "pronunciation": "un·pluhgd",
  "concise_definition": "adj. 未插电的, 非电子的; v. 拔掉插头",
  "forms": {
    "base_form": "unplug",
    "third_person_singular": "unplugs",
    "past_tense": "unplugged",
    "past_participle": "unplugged",
    "present_participle": "unplugging"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Not connected to an electrical power source; referring to devices or performances that operate without electronic amplification or digital processing.",
      "explanation_cn": "未连接到电源的；指不使用电子放大或数字处理的设备或表演，尤指原声、自然的音乐表现。",
      "example_en": "The band played an unplugged set, using only acoustic guitars and hand percussion.",
      "example_cn": "乐队演奏了一组原声曲目，仅使用原声吉他和手打打击乐器。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Disconnected from digital technology or the internet; describing a lifestyle or state of being free from constant digital stimulation.",
      "explanation_cn": "脱离数字技术或互联网的；描述一种摆脱持续数字干扰的生活方式或状态。",
      "example_en": "After a week in the mountains, she felt truly unplugged and at peace.",
      "example_cn": "在山里待了一周后，她感到真正地脱离了数字世界，内心平静。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove the plug of an electrical device from a socket, thereby cutting off its power supply.",
      "explanation_cn": "将电器的插头从插座中拔出，从而切断其电源。",
      "example_en": "He unplugged the toaster before cleaning it to avoid any risk of electric shock.",
      "example_cn": "他在清洁烤面包机之前拔掉了插头，以避免触电风险。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "offline",
      "analysis": "“Offline”（离线）主要指设备或系统未连接到网络，强调的是网络连接状态，常用于数字环境（如邮件、应用）。而 “unplugged” 更强调物理断电或脱离所有电子设备，语义范围更广，也包含生活方式的隐喻意义。"
    },
    {
      "word_to_compare": "acoustic",
      "analysis": "“Acoustic”（原声的）特指声音未经电子放大，仅靠物理共鸣产生，常用于音乐语境。而 “unplugged” 是一个更宽泛的术语，虽然常与 acoustic 混用，但它还可指脱离数字生活，不仅限于声音特性。"
    },
    {
      "word_to_compare": "disconnected",
      "analysis": "“Disconnected”（断开的）是一个更通用的词，可指情感、社交或技术上的脱离，语义较抽象。而 “unplugged” 更具象，源于物理插头的拔除，常带有积极的、有意为之的断开意味，尤其在现代语境中隐含对科技依赖的反思。"
    }
  ]
}