{
  "word": "unpredictable",
  "pronunciation": "un·pri·dik·tuh·buhl",
  "concise_definition": "adj. 难以预测的, 不可预知的, 反复无常的",
  "forms": {
    "comparative": "more unpredictable",
    "superlative": "most unpredictable"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Not able to be foreseen or anticipated; characterized by sudden, irregular, or random changes that defy expectation or pattern.",
      "explanation_cn": "无法被预见或预估的；表现出突然、不规则或随机的变化，违背常规或模式。",
      "example_en": "The weather in this region is highly unpredictable, with sudden storms appearing without warning.",
      "example_cn": "这个地区的天气非常难以预测，风暴常常毫无预警地突然出现。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing a person or behavior that is erratic, inconsistent, or capricious, making it difficult to anticipate actions or reactions.",
      "explanation_cn": "形容人或行为反复无常、不一致或任性，使人难以预料其行动或反应。",
      "example_en": "Her unpredictable mood swings made it hard for her colleagues to work with her.",
      "example_cn": "她反复无常的情绪波动让同事们难以与她共事。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Referring to outcomes or events that lack a discernible cause or logic, often creating a sense of suspense or surprise.",
      "explanation_cn": "指缺乏明显原因或逻辑的结果或事件，常制造出悬念或惊喜感。",
      "example_en": "The movie's unpredictable plot twist left the audience in stunned silence.",
      "example_cn": "这部电影出人意料的情节转折让观众陷入震惊的沉默。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "unforeseeable",
      "analysis": "“Unforeseeable”（无法预见的）强调在事前完全无法通过理性判断或经验推断出来，常用于描述极端意外或灾难性事件，带有更强的宿命感或偶然性。而 “unpredictable” 更侧重于因系统复杂、变化频繁或行为不稳定而导致的难以预测，不一定完全无法想象。"
    },
    {
      "word_to_compare": "erratic",
      "analysis": "“Erratic”（不稳定的，怪异的）主要描述行为、运动或模式缺乏规律性，常带有负面评价，暗示非理性或失控。它更聚焦于行为本身的异常，而 “unpredictable” 是从观察者角度出发，强调结果的不可预知性，可能由多种原因导致，不一定是行为本身怪异。"
    },
    {
      "word_to_compare": "capricious",
      "analysis": "“Capricious”（反复无常的，任性的）特指因情绪、喜好或主观意愿突然改变而导致的不可预测，常用于形容人或权威的决定，隐含轻率或情绪化。而 “unpredictable” 是中性词，可适用于自然现象、系统行为或技术故障等非主观因素造成的不可预测性。"
    }
  ]
}