{
  "word": "up",
  "pronunciation": "uhp",
  "concise_definition": "adv. 向上, 起来, 完成, 增加; prep. 向上; adj. 向上的, 兴奋的, 上涨的",
  "forms": {
    "comparative": "up",
    "superlative": "up"
  },
  "definitions": [
    {
      "pos": "adverb",
      "explanation_en": "Moving or extending in a direction toward a higher position or level, often physically or metaphorically.",
      "explanation_cn": "指朝向更高位置或水平的方向移动或延伸，可以是物理上的，也可以是比喻性的。",
      "example_en": "She stood up when the teacher entered the room.",
      "example_cn": "老师进房间时，她站了起来。"
    },
    {
      "pos": "adverb",
      "explanation_en": "Used to indicate completion, consumption, or exhaustion of something, often with verbs of eating, drinking, or using.",
      "explanation_cn": "用于表示某物已被完成、消耗或用尽，常与表示吃、喝或使用的动词连用。",
      "example_en": "They ate up all the cookies before dinner.",
      "example_cn": "他们晚饭前把所有的饼干都吃光了。"
    },
    {
      "pos": "adverb",
      "explanation_en": "Indicating an increase in amount, intensity, or level, especially in relation to prices, volume, or emotion.",
      "explanation_cn": "表示数量、强度或水平的增加，尤其用于价格、音量或情绪方面。",
      "example_en": "The cost of living has gone up significantly this year.",
      "example_cn": "今年生活成本显著上涨了。"
    },
    {
      "pos": "preposition",
      "explanation_en": "Denoting movement or position to a higher point along a surface, line, or direction.",
      "explanation_cn": "表示沿某一表面、线条或方向移动到较高点的位置。",
      "example_en": "He walked up the hill to see the view.",
      "example_cn": "他沿着山坡走上去看风景。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing a state of being elevated, active, or in high spirits; often used informally to express excitement or energy.",
      "explanation_cn": "形容处于升高、活跃或情绪高涨的状态；常用于非正式语境中表达兴奋或活力。",
      "example_en": "The kids were up and dancing after the music started.",
      "example_cn": "音乐一响，孩子们就兴奋地跳起舞来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "on",
      "analysis": "“On”（在…上）强调接触或附着于某物表面，常用于表示状态或持续（如：on fire, on display）；而 “up” 更强调方向性或完成性，如 “stand up” 表示从坐到站的动作完成，或 “eat up” 表示彻底消耗。"
    },
    {
      "word_to_compare": "over",
      "analysis": "“Over”（越过、结束）常表示跨越某物或某事的终结（如：get over it, fly over the mountain），侧重于从一端到另一端或结束；而 “up” 更强调向上运动或彻底完成，如 “clean up” 强调彻底清理，而非仅仅越过。"
    },
    {
      "word_to_compare": "out",
      "analysis": "“Out”（出去、耗尽）常表示从内部到外部的移动或资源的耗尽（如：go out, run out）；而 “up” 在表示耗尽时（如：use up）更强调彻底性，且常与动作动词搭配，带有更强的完成语义，如 “drink up” 比 “drink out” 更自然且常用。"
    }
  ]
}