{
  "word": "uplift",
  "pronunciation": "uhp·lif",
  "concise_definition": "v. 提升, 振奋, 抬升; n. 提升, 振奋",
  "forms": {
    "third_person_singular": "uplifts",
    "past_tense": "uplifted",
    "past_participle": "uplifted",
    "present_participle": "uplifting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To raise or lift something physically to a higher position, often with effort or mechanical assistance.",
      "explanation_cn": "指通过努力或机械辅助将某物物理性地抬升到更高的位置。",
      "example_en": "The crane was used to uplift the heavy steel beams onto the rooftop.",
      "example_cn": "起重机被用来将沉重的钢梁吊升到屋顶上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To improve someone's moral, emotional, or social condition; to inspire, encourage, or empower them to feel more hopeful or dignified.",
      "explanation_cn": "指改善某人的道德、情感或社会状况；激励、鼓励或赋予他们希望感与尊严感。",
      "example_en": "The community center's programs uplift countless families by providing education and job training.",
      "example_cn": "社区中心的项目通过提供教育和职业培训，提升了无数家庭的生活质量。"
    },
    {
      "pos": "noun",
      "explanation_en": "An act or instance of raising someone's spirits, morale, or social standing; a sense of inspiration or empowerment.",
      "explanation_cn": "指提升某人精神、士气或社会地位的行为或事件；一种激励或赋能的感觉。",
      "example_en": "Her speech was a powerful uplift for the entire audience, leaving them motivated and hopeful.",
      "example_cn": "她的演讲给全体听众带来了极大的振奋，使他们充满动力与希望。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "raise",
      "analysis": "“Raise” (提高) 是一个更通用的词，可用于物理抬升、数量增加或地位提升，语义范围更广，但缺乏 “uplift” 在情感或精神层面所蕴含的积极、鼓舞的内涵。例如，raise prices（提价）不能用 uplift 替代。"
    },
    {
      "word_to_compare": "inspire",
      "analysis": "“Inspire” (激励) 强调激发灵感、创意或动力，常与艺术、思想或行动相关。而 “uplift” 更侧重于情感状态的改善和整体精神的提升，常用于社会关怀、心理支持等语境，带有更强的疗愈性和集体性。"
    },
    {
      "word_to_compare": "elevate",
      "analysis": "“Elevate” (提升) 与 “uplift” 在抽象意义上接近，都可用于提升地位、品位或精神境界，但 “elevate” 更正式、更书面化，常用于学术或权威语境（如 elevate someone to a position），而 “uplift” 更具人情味和情感温度，常用于社会运动或公益语境。"
    }
  ]
}