{
  "word": "upsets",
  "pronunciation": "uhp·sets",
  "concise_definition": "n. 震惊, 打破预期的胜利, 扰乱; v. 使不安, 打乱, 使沮丧",
  "forms": {
    "singular": "upset",
    "third_person_singular": "upsets",
    "past_tense": "upset",
    "past_participle": "upset",
    "present_participle": "upsetting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An unexpected victory by a weaker competitor, especially in sports, which defies predictions or established rankings.",
      "explanation_cn": "指在体育比赛中，实力较弱的一方出人意料地战胜了实力更强的对手，违背了普遍预期或排名。",
      "example_en": "The match ended in a major upset when the underdog team won 3-2 against the champions.",
      "example_cn": "当这支弱队以3比2击败冠军队时，比赛以一场重大冷门收场。"
    },
    {
      "pos": "noun",
      "explanation_en": "A state of emotional disturbance or physical discomfort; a disruption of normal balance or order.",
      "explanation_cn": "指情绪上的困扰或身体上的不适；对正常平衡或秩序的扰乱。",
      "example_en": "The sudden news caused an emotional upset that lasted for days.",
      "example_cn": "这个突如其来的消息引发了持续数日的情绪波动。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause someone to feel disturbed, anxious, or physically unwell, often by unexpected or unpleasant events.",
      "explanation_cn": "指因意外或不愉快的事件使某人感到不安、焦虑或身体不适。",
      "example_en": "The loud noise upset the baby and made her cry.",
      "example_cn": "巨大的噪音让婴儿感到不安，开始哭起来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To overturn or disrupt a plan, system, or established order, often unexpectedly.",
      "explanation_cn": "指意外地推翻、扰乱计划、体系或既定秩序。",
      "example_en": "The storm upset our travel plans and forced us to cancel the trip.",
      "example_cn": "这场风暴打乱了我们的旅行计划，迫使我们取消了行程。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "shock",
      "analysis": "“Shock” (震惊) 强调因极端意外或强烈刺激而产生的瞬间心理冲击，通常带有更强烈的负面情绪色彩，如恐惧或震惊。而 “upset” 更侧重于持续的情绪紊乱或秩序被打乱，程度较轻且更广泛用于日常语境。"
    },
    {
      "word_to_compare": "disturbance",
      "analysis": "“Disturbance” (干扰/骚乱) 通常指外部对平静状态的干扰，可用于物理环境（如噪音干扰）或社会秩序（如骚乱）。它更中性或客观，而 “upset” 更强调主观情绪反应或内在失衡。"
    },
    {
      "word_to_compare": "defeat",
      "analysis": "“Defeat” (击败) 是一个中性术语，仅指在竞争中输掉，不隐含意外性。而 “upset” 作为名词时特指“冷门胜利”，强调结果与预期的强烈反差，带有戏剧性和新闻价值。"
    }
  ]
}