{
  "word": "usher",
  "pronunciation": "uh·shər",
  "concise_definition": "n. 引座员, 引路人; v. 引导, 引进",
  "forms": {
    "third_person_singular": "ushers",
    "past_tense": "ushered",
    "past_participle": "ushered",
    "present_participle": "ushering"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person whose job is to show people to their seats, especially in a theater, church, or stadium.",
      "explanation_cn": "指在剧院、教堂或体育场等场所负责引导观众就座的工作人员。",
      "example_en": "The usher showed us to our front-row seats with a warm smile.",
      "example_cn": "引座员面带微笑，把我们领到了前排座位。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that introduces or marks the beginning of something new or significant.",
      "explanation_cn": "指引入或标志着某件新事物或重要事件开始的人或事物，常用于比喻意义。",
      "example_en": "The invention of the smartphone was an usher of the mobile internet era.",
      "example_cn": "智能手机的发明标志着移动互联网时代的开启。"
    },
    {
      "pos": "verb",
      "explanation_en": "To guide or lead someone into a place, especially in a formal or polite manner.",
      "explanation_cn": "以正式或礼貌的方式引导某人进入某个场所。",
      "example_en": "The butler ushered the guests into the grand ballroom.",
      "example_cn": "管家礼貌地将宾客引入宏伟的舞厅。"
    },
    {
      "pos": "verb",
      "explanation_en": "To introduce or bring about the beginning of a new period, event, or condition.",
      "explanation_cn": "指开启、带来某个新阶段、事件或状况，常用于抽象或象征性语境。",
      "example_en": "The peace agreement ushered in a new era of cooperation between the two nations.",
      "example_cn": "和平协议开启了两国合作的新时代。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "guide",
      "analysis": "“Guide” (引导) 是一个更通用的词，可用于任何类型的引导，包括方向、知识或行为上的指导，不强调正式性或仪式感。而 “usher” 更侧重于在特定场合（如剧院、典礼）中以礼节性方式引导人进入空间，具有更强的场景限定性和仪式色彩。"
    },
    {
      "word_to_compare": "introduce",
      "analysis": "“Introduce” (介绍) 主要用于将人或事物介绍给他人认识，强调建立联系或认知，如介绍朋友、产品或概念。而 “usher” 强调的是物理或象征意义上的‘带入’或‘开启’，更注重动作的起始性和空间性，而非社交互动。"
    },
    {
      "word_to_compare": "lead",
      "analysis": "“Lead” (带领) 是一个广泛使用的动词，可指带领团队、方向、潮流等，强调主导性和方向性。而 “usher” 更具仪式感和辅助性，通常不带有主导权，而是执行一种服务性或礼仪性的引导行为，常用于被动或辅助角色。"
    }
  ]
}