{
  "word": "vanderbilt",
  "pronunciation": "van·der·bilt",
  "concise_definition": "n. 范德比尔特（姓氏/地名）",
  "forms": {
    "plural": "Vanderbilts"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A surname of Dutch origin, most famously associated with the American industrialist and philanthropist Cornelius Vanderbilt (1794–1877), who built a vast fortune in shipping and railroads and founded the Vanderbilt University.",
      "explanation_cn": "一个源自荷兰的姓氏，最著名的是美国实业家兼慈善家科尼利厄斯·范德比尔特（1794–1877），他通过航运和铁路积累了巨额财富，并创办了范德比尔特大学。",
      "example_en": "The Vanderbilt family was one of the wealthiest and most influential families in 19th-century America.",
      "example_cn": "范德比尔特家族是19世纪美国最富有、最有影响力的家族之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to Vanderbilt University, a prestigious private research university located in Nashville, Tennessee, founded in 1873 with a donation from Cornelius Vanderbilt.",
      "explanation_cn": "专有名词，指位于田纳西州纳什维尔的一所著名私立研究型大学——范德比尔特大学，于1873年由科尼利厄斯·范德比尔特捐赠创办。",
      "example_en": "She earned her degree in neuroscience from Vanderbilt University.",
      "example_cn": "她在范德比尔特大学获得了神经科学学位。"
    },
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to places, buildings, or institutions named after the Vanderbilt family, such as Vanderbilt Avenue in New York City or the Vanderbilt Mansion in Hyde Park.",
      "explanation_cn": "专有名词，指以范德比尔特家族命名的地点、建筑或机构，例如纽约市的范德比尔特大道或海德公园的范德比尔特庄园。",
      "example_en": "We took a guided tour of the Vanderbilt Mansion, a Gilded Age palace of opulence.",
      "example_cn": "我们参观了范德比尔特庄园的导览，这是一座镀金时代奢华的宫殿。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "family_name",
      "analysis": "“Family name”（姓氏）是一个通用术语，泛指任何家族的姓氏，而 “Vanderbilt” 是一个具体的、具有历史和文化意义的专有姓氏，承载着美国工业革命时期财富与慈善的象征意义。它不是普通名词，不能泛指任何姓氏。"
    },
    {
      "word_to_compare": "university",
      "analysis": "“University”（大学）是一个普通名词，泛指高等教育机构，而 “Vanderbilt” 作为专有名词，特指由范德比尔特家族资助建立的那所具体大学。它本身不是大学的类别，而是某所大学的专属名称。"
    },
    {
      "word_to_compare": "estate",
      "analysis": "“Estate”（庄园/地产）是一个通用名词，指大型地产或财产，而 “Vanderbilt” 在此语境下特指范德比尔特家族拥有的那些著名庄园，如海德公园的范德比尔特庄园。它通过人名赋予了特定的历史与社会价值，区别于普通意义上的庄园。"
    }
  ]
}