{
  "word": "vanilla",
  "pronunciation": "vuh·nil·uh",
  "concise_definition": "n. 香草, 香草味; adj. 原味的, 普通的, 无特色的",
  "forms": {
    "plural": "vanillas"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A tropical orchid plant (Vanilla planifolia) whose pods are used to produce a highly aromatic flavoring, commonly used in cooking and perfumery.",
      "explanation_cn": "一种热带兰科植物（Vanilla planifolia），其豆荚被用于提取具有浓郁香气的调味品，广泛用于烹饪和香水制造。",
      "example_en": "She added a teaspoon of vanilla extract to the cake batter.",
      "example_cn": "她在蛋糕糊中加入了一茶匙香草精。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that is plain, standard, or unadorned; the most basic or conventional form of something, often implying lack of excitement or uniqueness.",
      "explanation_cn": "形容某物是朴素的、标准的、无装饰的；指某种事物最基础或最常规的形式，常暗示缺乏趣味性或独特性。",
      "example_en": "He drove a vanilla-colored sedan with no custom modifications.",
      "example_cn": "他开的是一辆原色的轿车，没有任何定制改装。"
    },
    {
      "pos": "adjective",
      "explanation_en": "In computing and slang, referring to something that is basic, unmodified, or default — often contrasted with customized or advanced versions.",
      "explanation_cn": "在计算机和俚语中，指基础的、未经修改的或默认的状态，常与定制版或高级版相对比。",
      "example_en": "I installed the vanilla version of the operating system to avoid bloatware.",
      "example_cn": "我安装了操作系统的原版，以避免预装的冗余软件。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "plain",
      "analysis": "“Plain”（朴素的）强调缺乏装饰或复杂性，常用于视觉或风格层面，如 plain dress（素色衣服）。而 “vanilla” 更侧重于默认、标准或缺乏个性，尤其在技术或文化语境中带有‘无特色’的隐含评价。"
    },
    {
      "word_to_compare": "basic",
      "analysis": "“Basic”（基础的）指最底层、最简单的形式，常用于功能或层级描述，如 basic needs（基本需求）。而 “vanilla” 更强调‘未被修改’或‘原厂配置’，常用于产品、软件或风格的语境，带有轻微的贬义或调侃意味。"
    },
    {
      "word_to_compare": "standard",
      "analysis": "“Standard”（标准的）指符合规范或普遍接受的模式，具有中性或正面含义，如 standard procedure（标准流程）。而 “vanilla” 虽然也指标准形式，但常隐含‘乏味’或‘缺乏创新’的语义色彩，尤其在流行文化中使用时。"
    }
  ]
}