{
  "word": "vault",
  "pronunciation": "vawlt",
  "concise_definition": "n. 金库, 地窖, 拱顶; v. 跳跃, 存入金库",
  "forms": {
    "plural": "vaults",
    "third_person_singular": "vaults",
    "past_tense": "vaulted",
    "past_participle": "vaulted",
    "present_participle": "vaulting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A secure room or container, typically made of thick metal or concrete, used for storing valuable items such as money, documents, or precious objects.",
      "explanation_cn": "一种由厚金属或混凝土制成的坚固房间或容器，用于存放金钱、文件或贵重物品。",
      "example_en": "The bank's vault was breached during the heist, but the alarm system prevented any theft.",
      "example_cn": "在抢劫案中，银行金库被闯入，但警报系统阻止了任何财物被盗。"
    },
    {
      "pos": "noun",
      "explanation_en": "An arched structure forming a ceiling or roof, especially in a cathedral, church, or other large building, often made of stone or concrete.",
      "explanation_cn": "一种呈拱形的结构，用作天花板或屋顶，常见于大教堂、教堂或其他大型建筑中，通常由石头或混凝土建造。",
      "example_en": "The cathedral's vaulted ceiling soared over 100 feet above the nave, creating a sense of awe.",
      "example_cn": "大教堂的拱顶高达一百英尺以上，令人肃然起敬。"
    },
    {
      "pos": "noun",
      "explanation_en": "A cellar or underground chamber, especially one used for storing wine or other goods.",
      "explanation_cn": "一种地窖或地下房间，尤指用于储存葡萄酒或其他物品的场所。",
      "example_en": "The restaurant boasts a climate-controlled wine vault with over 500 bottles.",
      "example_cn": "这家餐厅拥有一个恒温葡萄酒地窖，存放着500多瓶葡萄酒。"
    },
    {
      "pos": "verb",
      "explanation_en": "To leap or jump over something, especially using a pole or with a springing motion, as in gymnastics or athletics.",
      "explanation_cn": "借助杆子或借助弹跳动作跃过某物，常见于体操或田径运动中。",
      "example_en": "The gymnast vaulted over the horse with remarkable grace and power.",
      "example_cn": "体操运动员以惊人的优雅和力量跃过了跳马。"
    },
    {
      "pos": "verb",
      "explanation_en": "To store or place something securely, especially in a vault or safe place.",
      "explanation_cn": "将某物安全地存放起来，尤指存入金库或保险柜中。",
      "example_en": "The museum vaulted the ancient artifacts in a high-security chamber.",
      "example_cn": "博物馆将这些古代文物存放在一个高安全性的密室中。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "safe",
      "analysis": "“Safe”（保险箱）通常指一个可移动的、用于存放贵重物品的小型金属箱，强调便携性和防盗功能；而 “vault” 更常指建筑物中固定的、结构更坚固的大型存储空间，通常由银行或机构建造，安全等级更高。"
    },
    {
      "word_to_compare": "cellar",
      "analysis": "“Cellar”（地窖）泛指建筑物下方用于储存物品的地下空间，多用于食物或酒类，结构简单，无特殊安全措施；而 “vault” 作为地窖使用时，特指具有加固结构、防火防潮、高度安全的专用存储空间，常用于贵重物品。"
    },
    {
      "word_to_compare": "arch",
      "analysis": "“Arch”（拱）仅指一种建筑结构形式，即弯曲的拱形构件，是“vault”（拱顶）的组成部分；而 “vault” 是由多个拱形结构组合形成的完整天花板或屋顶系统，具有承重和空间覆盖功能。"
    },
    {
      "word_to_compare": "leap",
      "analysis": "“Leap”（跳跃）是泛指任何用力跳起的动作，强调动作本身；而 “vault” 作为动词时，特指借助工具（如跳马或撑杆）完成的、有技术要求的跳跃，常用于体育语境，动作更具专业性和规范性。"
    }
  ]
}