{
  "word": "vaults",
  "pronunciation": "vawlts",
  "concise_definition": "n. 金库, 拱顶, 跳跃; v. 跳跃, 用杆撑跳",
  "forms": {
    "singular": "vault"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A secure room or compartment, typically underground, used for storing valuable items such as money, documents, or precious objects, often with reinforced walls and advanced security systems.",
      "explanation_cn": "一种安全的房间或隔间，通常位于地下，用于存放金钱、文件或贵重物品，通常具有加固的墙壁和先进的安保系统。",
      "example_en": "The bank's vault was breached during the heist, but the alarm triggered before any cash was stolen.",
      "example_cn": "在抢劫过程中，银行金库被闯入，但警报在现金被偷走前就已触发。"
    },
    {
      "pos": "noun",
      "explanation_en": "An architectural structure consisting of a curved or arched ceiling or roof, often found in cathedrals, halls, or underground passages, designed to distribute weight and create spacious interiors.",
      "explanation_cn": "一种由弯曲或拱形天花板或屋顶构成的建筑结构，常见于大教堂、大厅或地下通道中，用于分散重量并创造宽敞的内部空间。",
      "example_en": "The cathedral's stone vaults soared overhead, casting dramatic shadows across the nave.",
      "example_cn": "大教堂上方的石制拱顶高高耸立，在中殿投下戏剧性的阴影。"
    },
    {
      "pos": "noun",
      "explanation_en": "A gymnastic or athletic movement in which a person propels themselves over an object using their hands, often seen in track and field or gymnastics competitions.",
      "explanation_cn": "一种体操或体育动作，指人用手支撑越过某个障碍物，常见于田径或体操比赛中。",
      "example_en": "The gymnast executed a perfect vault over the horse, landing with perfect balance.",
      "example_cn": "体操运动员完美地完成了马上的跳马动作，稳稳落地。"
    },
    {
      "pos": "verb",
      "explanation_en": "To leap or jump over something, especially using the hands for support, as in gymnastics or parkour.",
      "explanation_cn": "用手支撑跳跃越过某物，常见于体操或跑酷运动中。",
      "example_en": "The athlete vaulted over the barrier with ease and continued sprinting toward the finish line.",
      "example_cn": "运动员轻松跃过障碍物，继续向终点冲刺。"
    },
    {
      "pos": "verb",
      "explanation_en": "To store or place something securely in a vault, especially for protection or long-term preservation.",
      "explanation_cn": "将某物安全地存入金库中，通常是为了保护或长期保存。",
      "example_en": "The museum vaulted the ancient manuscripts in a climate-controlled chamber to prevent deterioration.",
      "example_cn": "博物馆将这些古代手稿存放在恒温恒湿的保险库中，以防损坏。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "safe",
      "analysis": "“Safe”（保险箱）通常指小型、可移动的金属容器，用于存放个人贵重物品，如现金或珠宝；而 “vault”（金库）规模更大，通常是建筑结构的一部分，用于机构级的安全存储，具有更强的物理防护和安保系统。"
    },
    {
      "word_to_compare": "arch",
      "analysis": "“Arch”（拱）是单一的弧形结构，用于支撑门洞或桥梁；而 “vault”（拱顶）是由多个拱形结构组合而成的天花板或屋顶，覆盖更大的空间，如教堂的中殿。因此，vault 是 arch 的扩展和复杂化形式。"
    },
    {
      "word_to_compare": "jump",
      "analysis": "“Jump”（跳跃）是通用词，泛指任何从地面腾空的动作；而 “vault” 作为动词特指借助手部支撑（如跳马、撑杆）完成的跳跃，强调技术性、工具辅助和特定运动语境，动作更复杂、有控制。"
    }
  ]
}