{
  "word": "veil",
  "pronunciation": "vayl",
  "concise_definition": "n. 面纱, 遮蔽物; v. 遮盖, 隐藏",
  "forms": {
    "plural": "veils",
    "third_person_singular": "veils",
    "past_tense": "veiled",
    "past_participle": "veiled",
    "present_participle": "veiling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A thin piece of fabric worn over the head, face, or shoulders, especially by women, often for religious, cultural, or ceremonial reasons.",
      "explanation_cn": "一种轻薄的布料，通常覆盖在女性的头部、面部或肩部，常用于宗教、文化或仪式场合。",
      "example_en": "The bride wore a delicate lace veil that flowed down her back.",
      "example_cn": "新娘戴着一条精致的蕾丝面纱，垂落在她的背后。"
    },
    {
      "pos": "noun",
      "explanation_en": "Something that conceals or obscures, especially metaphorically, hiding the true nature or reality of something.",
      "explanation_cn": "指某种遮蔽或掩盖事物真实本质或现实的手段，常用于比喻意义。",
      "example_en": "The government's secrecy created a veil of suspicion around the investigation.",
      "example_cn": "政府的保密行为为调查蒙上了一层猜疑的面纱。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover or conceal something, especially with a veil or something that obscures visibility or clarity.",
      "explanation_cn": "指用面纱或其他遮蔽物覆盖某物，使其难以看清或理解。",
      "example_en": "Fog veiled the mountains, making them invisible from the valley.",
      "example_cn": "雾气遮蔽了群山，使它们从山谷中无法看见。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hide or obscure the true nature, meaning, or intention of something, often deliberately.",
      "explanation_cn": "指有意隐藏某事物的真实性质、含义或意图。",
      "example_en": "His polite words veiled a deep resentment toward his colleague.",
      "example_cn": "他礼貌的言辞掩盖了对同事的深深怨恨。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "curtain",
      "analysis": "“Curtain”（窗帘/幕布）通常指用于物理分隔空间或遮挡视线的较大布料，常用于舞台或窗户，强调空间的分隔功能。而 “veil” 更轻薄、更贴近身体或表面，常用于象征性遮蔽，带有神秘或情感色彩。"
    },
    {
      "word_to_compare": "mask",
      "analysis": "“Mask”（面具）通常指覆盖面部、用于伪装或保护的硬质物体，强调身份隐藏或功能用途（如医疗、节日）。而 “veil” 更柔软、更透明，常用于文化或象征性遮蔽，不完全剥夺可见性，而是模糊或柔化真实。"
    },
    {
      "word_to_compare": "cover",
      "analysis": "“Cover”（覆盖）是最通用的词，可指任何形式的遮蔽，从物理遮盖到抽象掩饰。而 “veil” 更具文学性和隐喻性，常用于表达含蓄、优雅或神秘的遮蔽，带有情感或文化内涵，语义更细腻。"
    }
  ]
}