{
  "word": "vein",
  "pronunciation": "vayn",
  "concise_definition": "n. 静脉, 叶脉, 矿脉, 风格, 趋势",
  "forms": {
    "plural": "veins"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A blood vessel that carries blood toward the heart, typically with thinner walls and lower pressure than arteries.",
      "explanation_cn": "指将血液输送回心脏的血管，通常管壁较薄、压力低于动脉。",
      "example_en": "The doctor inserted the needle into a vein in her arm.",
      "example_cn": "医生将针头插入她手臂的一条静脉中。"
    },
    {
      "pos": "noun",
      "explanation_en": "A narrow band or line of a different mineral or color running through rock or stone, often visible in marble or granite.",
      "explanation_cn": "指岩石或石头中呈带状或线状分布的另一种矿物或颜色，常见于大理石或花岗岩中。",
      "example_en": "The countertop was made of white marble with striking gray veins.",
      "example_cn": "这个台面由白色大理石制成，带有醒目的灰色纹路。"
    },
    {
      "pos": "noun",
      "explanation_en": "A deposit of valuable minerals, especially metal ores, found in rock and mined for extraction.",
      "explanation_cn": "指岩石中蕴藏的有价值矿物（尤其是金属矿石）的矿脉，可供开采。",
      "example_en": "Miners discovered a rich vein of gold deep beneath the mountain.",
      "example_cn": "矿工们在山下深处发现了一条丰富的金矿脉。"
    },
    {
      "pos": "noun",
      "explanation_en": "A distinctive style, tone, or character that runs through a person’s work, speech, or behavior, often reflecting a consistent pattern.",
      "explanation_cn": "指贯穿于某人作品、言语或行为中的一种独特风格、语调或特征，常体现为一贯的模式。",
      "example_en": "Her novels have a vein of dark humor that runs through all of them.",
      "example_cn": "她的所有小说都贯穿着一种黑色幽默的风格。"
    },
    {
      "pos": "noun",
      "explanation_en": "A particular tendency or current of thought, feeling, or activity within a group or movement.",
      "explanation_cn": "指群体或运动中某种特定的思想、情感或活动倾向或潮流。",
      "example_en": "There is a vein of nationalism in the political discourse of this era.",
      "example_cn": "这个时代的政治话语中有一种民族主义的倾向。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "artery",
      "analysis": "“Artery”（动脉）是将血液从心脏输送到身体各部位的血管，管壁厚、压力高；而 “vein” 是将血液送回心脏的血管，管壁薄、压力低。两者在生理功能上互为对应，但结构和血流方向相反。"
    },
    {
      "word_to_compare": "stripe",
      "analysis": "“Stripe”（条纹）泛指任何颜色或图案的纵向或横向条状物，常用于描述服装、动物皮毛或装饰，不具有地质或生理结构的含义。而 “vein” 在岩石或大理石中特指天然形成的矿物纹路，具有地质成因，语义更专业、更具体。"
    },
    {
      "word_to_compare": "current",
      "analysis": "“Current”（潮流、趋势）多用于描述社会、思想或文化中的广泛流动趋势，强调动态性和普遍性；而 “vein” 在比喻义中更强调一种贯穿始终、内在一致的风格或基调，更具连续性和深度，常用于文学或艺术分析中。"
    }
  ]
}