{
  "word": "veins",
  "pronunciation": "vaynz",
  "concise_definition": "n. 静脉, 纹路, 脉络, 情绪倾向",
  "forms": {
    "singular": "vein"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A blood vessel that carries blood toward the heart, typically deoxygenated blood in the systemic circulation.",
      "explanation_cn": "指将血液输送回心脏的血管，通常在体循环中输送缺氧血。",
      "example_en": "The doctor examined the veins in her arm before inserting the IV needle.",
      "example_cn": "医生在插入静脉输液针之前检查了她手臂上的静脉。"
    },
    {
      "pos": "noun",
      "explanation_en": "A natural line or streak of a different color or texture in a material such as marble, wood, or metal, formed by mineral deposits or structural variation.",
      "explanation_cn": "指大理石、木材或金属等材料中因矿物沉积或结构差异而形成的天然纹路或条纹。",
      "example_en": "The marble countertop had beautiful white veins running through its gray surface.",
      "example_cn": "大理石台面呈现出灰色底色上优美的白色纹路。"
    },
    {
      "pos": "noun",
      "explanation_en": "A narrow passage or channel that connects or runs through a larger structure, often used metaphorically to describe routes or systems (e.g., mining veins, river veins).",
      "explanation_cn": "指贯穿或连接较大结构的狭窄通道，常用于比喻性描述路径或系统（如矿脉、河流脉络）。",
      "example_en": "Miners followed the gold vein deep into the mountain.",
      "example_cn": "矿工们沿着金矿脉深入山体。"
    },
    {
      "pos": "noun",
      "explanation_en": "A particular mood, style, or tendency, especially when expressed in speech, writing, or behavior; often used in phrases like 'in a vein of humor' or 'in a bitter vein'.",
      "explanation_cn": "指某种特定的情绪、风格或倾向，尤其用于描述言语、写作或行为中的基调，常用于短语如 'in a vein of humor'（以幽默的口吻）或 'in a bitter vein'（以怨恨的语气）。",
      "example_en": "Her latest novel is written in a dark, ironic vein.",
      "example_cn": "她最新出版的小说以一种阴暗而讽刺的笔调写成。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "arteries",
      "analysis": "“Arteries”（动脉）是将血液从心脏输送到身体各部位的血管，通常携带富氧血；而 “veins” 是将血液输送回心脏的血管，通常携带缺氧血。两者在功能和血流方向上形成互补，但结构上静脉壁更薄、弹性更小，且常有瓣膜防止血液倒流。"
    },
    {
      "word_to_compare": "lines",
      "analysis": "“Lines”（线条）是一个通用词，泛指任何细长的痕迹或边界，可用于抽象或具象语境；而 “veins” 在指材料纹路时，特指自然形成、具有物质来源（如矿物沉积）的纹路，更具生物学或地质学的内在逻辑，比 “lines” 更具体、更有机。"
    },
    {
      "word_to_compare": "tendons",
      "analysis": "“Tendons”（肌腱）是连接肌肉与骨骼的致密结缔组织，主要功能是传递力量；而 “veins” 是循环系统的一部分，负责运输血液。两者虽均为体内结构，但功能、组织类型和生理作用完全不同，不可混淆。"
    },
    {
      "word_to_compare": "currents",
      "analysis": "“Currents”（水流/气流/潮流）指流体（如水、空气）或抽象趋势（如思想潮流）的流动方向；而 “veins” 在比喻用法中虽可指脉络，但更强调其作为贯穿性通道的物理或结构存在，而非动态流动本身。例如，矿脉是固定的，而水流是持续运动的。"
    }
  ]
}