{
  "word": "veneer",
  "pronunciation": "vee·neer",
  "concise_definition": "n. 薄片, 表面覆盖层, 虚伪的外表 v. 用薄片覆盖",
  "forms": {
    "plural": "veneers",
    "third_person_singular": "veneers",
    "past_tense": "veneered",
    "past_participle": "veneered",
    "present_participle": "veneering"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A thin layer of high-quality wood, metal, or other material applied to a cheaper or less attractive surface to improve its appearance.",
      "explanation_cn": "指一层高质量的木材、金属或其他材料，贴附在较廉价或外观较差的表面上，以提升其外观。",
      "example_en": "The table had a beautiful walnut veneer over a particleboard core.",
      "example_cn": "这张桌子的基材是刨花板，表面覆盖了一层漂亮的胡桃木薄片。"
    },
    {
      "pos": "noun",
      "explanation_en": "A superficial or artificial appearance that hides the true nature of something, often implying deception or pretense.",
      "explanation_cn": "指一种表面的、虚假的外表，用以掩盖事物的真实本质，常暗示欺骗或伪装。",
      "example_en": "His charming smile was just a veneer over his deep insecurity.",
      "example_cn": "他那迷人的微笑不过是掩盖内心深深不安全感的假象。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cover a surface with a thin layer of material, especially wood, to enhance its appearance.",
      "explanation_cn": "指用一层薄材料（尤指木材）覆盖表面，以改善其外观。",
      "example_en": "The cabinet was veneered with teak to give it a luxurious look.",
      "example_cn": "这个柜子用柚木贴面，使其看起来更加奢华。"
    },
    {
      "pos": "verb",
      "explanation_en": "To mask or conceal the true character or qualities of something with a superficial or deceptive appearance.",
      "explanation_cn": "指用表面的或欺骗性的外表掩盖某事物的真实特征或本质。",
      "example_en": "She veneered her harsh criticism with polite language.",
      "example_cn": "她用礼貌的语言掩饰了自己尖锐的批评。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "coating",
      "analysis": "“Coating”（涂层）泛指任何覆盖在表面的材料层，可以是功能性（如防锈、防水）或装饰性的，不强调材料的品质或伪装意图。而 “veneer” 特指用于美化或伪装的薄层，常带有美学或欺骗性目的，尤其在木材或社会行为语境中。"
    },
    {
      "word_to_compare": "facade",
      "analysis": "“Facade”（外貌/假象）通常指建筑物的正面或抽象意义上的整体伪装，强调的是整体结构的虚假表象，常用于建筑或社会心理学语境。而 “veneer” 更强调一层薄薄的、可剥离的表面覆盖，更具物理性和细节性，也更常用于描述个人性格的伪装。"
    },
    {
      "word_to_compare": "layer",
      "analysis": "“Layer”（层）是一个中性、通用的词，指任何堆叠的物质层次，无装饰或欺骗含义。而 “veneer” 是一种特定类型的层，具有明确的美学或掩饰目的，语义更具体、更富文化内涵。"
    }
  ]
}