{
  "word": "vents",
  "pronunciation": "vɛnts",
  "concise_definition": "n. 通风口, 排气口, 发泄; v. 发泄, 通风",
  "forms": {
    "singular": "vent",
    "third_person_singular": "vents",
    "past_tense": "vented",
    "past_participle": "vented",
    "present_participle": "venting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An opening or passage designed to allow air, gas, or liquid to flow in or out of a confined space, typically for ventilation or pressure relief.",
      "explanation_cn": "指为使空气、气体或液体在封闭空间内流通或释放压力而设计的开口或通道，常用于通风或泄压。",
      "example_en": "The attic has several vents to prevent moisture buildup.",
      "example_cn": "阁楼有几个通风口，以防止湿气积聚。"
    },
    {
      "pos": "noun",
      "explanation_en": "A channel or outlet through which emotions, opinions, or energy are expressed, often intensely or uncontrollably.",
      "explanation_cn": "指情绪、观点或能量得以表达的渠道，通常带有强烈或不受控制的性质，即‘发泄’。",
      "example_en": "Writing poetry became her main vent for grief after the loss.",
      "example_cn": "在失去亲人后，写诗成了她宣泄悲伤的主要方式。"
    },
    {
      "pos": "verb",
      "explanation_en": "To release or express emotions, especially anger or frustration, often in a forceful or uncontrolled way.",
      "explanation_cn": "指强烈地释放或表达情绪，尤其是愤怒或沮丧，通常带有激烈或失控的特征。",
      "example_en": "He vented his frustration by slamming the door.",
      "example_cn": "他摔门发泄了自己的沮丧。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provide or install a vent, or to allow air or gas to escape through an opening.",
      "explanation_cn": "指安装通风口，或允许空气或气体通过开口排出。",
      "example_en": "The building was designed to vent hot air naturally through rooftop openings.",
      "example_cn": "这座建筑通过屋顶开口自然排出热空气。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "opening",
      "analysis": "“Opening”（开口）是一个通用词，泛指任何空间上的缺口或通道，不特指功能。而 “vent” 强调其功能性——用于通风、排气或泄压，具有工程或系统性目的。"
    },
    {
      "word_to_compare": "outlet",
      "analysis": "“Outlet”（出口/出口处）可指电插座、情绪出口或商品销售渠道，语义范围更广。而 “vent” 更侧重于气体或液体的物理排放，或情绪的强烈释放，语义更具体、更具生理或机械特性。"
    },
    {
      "word_to_compare": "express",
      "analysis": "“Express”（表达）是中性词，泛指任何形式的传达思想或情感，可以是温和、理性或书面的。而 “vent” 强调情绪的爆发性、非理性释放，常带有负面或失控的语义色彩，如 ‘vent anger’。"
    }
  ]
}