{
  "word": "venture",
  "pronunciation": "ven·chur",
  "concise_definition": "n. 冒险, 企业, 投资; v. 冒险, 敢于做",
  "forms": {
    "third_person_singular": "ventures",
    "past_tense": "ventured",
    "past_participle": "ventured",
    "present_participle": "venturing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A business or project undertaken with risk or uncertainty, often involving financial investment and the possibility of significant gain or loss.",
      "explanation_cn": "指一项带有风险或不确定性的商业活动或项目，通常涉及资金投入，并可能带来重大收益或损失。",
      "example_en": "The startup is a high-risk venture that could either fail or become a billion-dollar company.",
      "example_cn": "这家初创公司是一次高风险的投资，可能失败，也可能成为一家价值十亿美元的企业。"
    },
    {
      "pos": "noun",
      "explanation_en": "An adventurous or daring undertaking, often involving physical or emotional risk.",
      "explanation_cn": "指一种充满冒险精神或大胆的行动，通常涉及身体或情感上的风险。",
      "example_en": "Their journey across the Amazon was a true venture into the unknown.",
      "example_cn": "他们穿越亚马逊的旅程是一次真正踏入未知领域的冒险。"
    },
    {
      "pos": "verb",
      "explanation_en": "To dare to do something risky or uncertain, especially when the outcome is unknown or potentially dangerous.",
      "explanation_cn": "指敢于去做某件有风险或不确定的事，尤其是当结果未知或可能危险时。",
      "example_en": "She ventured a guess that the meeting would be postponed.",
      "example_cn": "她大胆猜测会议将会被推迟。"
    },
    {
      "pos": "verb",
      "explanation_en": "To proceed cautiously or hesitantly into a new or unfamiliar situation.",
      "explanation_cn": "指小心翼翼或犹豫地进入一个新环境或不熟悉的情境。",
      "example_en": "He ventured into the dark forest, unsure of what lay ahead.",
      "example_cn": "他小心翼翼地走进了漆黑的森林，不确定前方有什么。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "business",
      "analysis": "“Business” (商业/企业) 是一个中性词，泛指任何营利性活动，不必然包含风险。而 “venture” 强调的是高风险、高回报的特性，通常指初创或非传统的商业项目。"
    },
    {
      "word_to_compare": "risk",
      "analysis": "“Risk” (风险) 是一个抽象名词，指潜在的损失或危险本身，而 “venture” 是一个具体的行动或项目，其本质包含风险。可以说一个 venture 有 risk，但 risk 本身不是一项行动。"
    },
    {
      "word_to_compare": "expedition",
      "analysis": "“Expedition” (远征/考察) 通常指有明确目标的、有组织的探索性旅行，多用于科学或地理领域，强调计划性和目的性。而 “venture” 更强调主观的勇气和不确定性，不一定有严密计划，范围也更广，可涵盖商业或情感层面。"
    }
  ]
}