{
  "word": "veronica",
  "pronunciation": "vair·uh·nih·kuh",
  "concise_definition": "n. 雪莉（人名）, 雪绒花, 一种植物",
  "forms": {
    "plural": "veronicas"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A feminine given name, often used in English-speaking countries, derived from the Latin name 'Veronica', which itself may originate from 'Vera Icon' meaning 'true image'.",
      "explanation_cn": "一个女性名字，常用于英语国家，源自拉丁语 'Veronica'，可能源于 'Vera Icon'，意为 '真实的形象'。",
      "example_en": "Veronica is organizing the charity event this weekend.",
      "example_cn": "雪莉正在组织这个周末的慈善活动。"
    },
    {
      "pos": "noun",
      "explanation_en": "A genus of herbaceous flowering plants in the plantain family (Plantaginaceae), known for their small, often blue or white flowers and opposite leaves; commonly called speedwell.",
      "explanation_cn": "一种属于车前科（Plantaginaceae）的草本开花植物属，以其小型常为蓝色或白色的花朵和对生叶片而闻名；俗称‘婆婆纳’。",
      "example_en": "The garden was dotted with delicate veronicas blooming in shades of blue and purple.",
      "example_cn": "花园里点缀着盛开的婆婆纳，呈现出蓝色和紫色的柔美色调。"
    },
    {
      "pos": "noun",
      "explanation_en": "A traditional Christian relic or image believed to bear the miraculous imprint of Christ's face, associated with the legend of Saint Veronica who wiped his face on the way to Calvary.",
      "explanation_cn": "一种传统的基督教圣物或图像，据信承载着基督面容的奇迹印记，与圣雪莉的传说相关——她在前往各各他的路上用布巾为耶稣擦拭面容。",
      "example_en": "The chapel displayed a medieval painting of the Veil of Veronica.",
      "example_cn": "小教堂里展出了一幅中世纪的圣维罗尼卡面纱画。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "violet",
      "analysis": "“Violet”（紫罗兰）是一种具体的开花植物，属于堇菜科，花朵通常呈紫色，具有浓郁香气。而 “veronica”（婆婆纳）属于车前科，花小、颜色多样（蓝、白、粉），花序呈穗状，形态和科属均不同。两者虽同为观赏草本，但植物学分类和外观差异显著。"
    },
    {
      "word_to_compare": "name",
      "analysis": "“Name” 是泛指任何称呼或标识，而 “Veronica” 是一个专有名词，特指一个人名、植物属名或宗教圣物名。它具有文化、历史和语义的多重身份，远超出普通名词的范畴。"
    },
    {
      "word_to_compare": "relic",
      "analysis": "“Relic”（圣物）泛指与圣人或宗教事件相关的遗物，而 “Veronica” 在此语境下特指与耶稣受难相关的面纱圣物，是“relic”的一个具体实例。因此，“Veronica” 是一个具有特定宗教叙事的专有圣物名称，而 “relic” 是类别词。"
    }
  ]
}