{
  "word": "versailles",
  "pronunciation": "ver·sai",
  "concise_definition": "n. 凡尔赛（法国城市），凡尔赛宫",
  "forms": {
    "plural": "Versailles"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A city in north-central France, located about 20 kilometers southwest of Paris, historically significant as the seat of the French monarchy and the site of the Palace of Versailles.",
      "explanation_cn": "法国中北部的一座城市，位于巴黎西南约20公里处，历史上是法国王室的所在地，也是凡尔赛宫的所在地。",
      "example_en": "The Treaty of Versailles was signed in the Hall of Mirrors at the Palace of Versailles in 1919.",
      "example_cn": "1919年，《凡尔赛条约》在凡尔赛宫的镜厅签署。"
    },
    {
      "pos": "noun",
      "explanation_en": "The Palace of Versailles, a grand royal residence built by Louis XIV, symbolizing the absolute power of the French monarchy and renowned for its opulent architecture, gardens, and historical significance.",
      "explanation_cn": "指凡尔赛宫，由路易十四建造的宏伟王室居所，象征着法国君主的绝对权力，以其奢华的建筑、园林和历史意义而闻名。",
      "example_en": "Visitors from around the world flock to Versailles to admire its gilded halls and meticulously landscaped gardens.",
      "example_cn": "来自世界各地的游客纷纷前往凡尔赛宫，欣赏其镀金大厅和精心设计的园林。"
    },
    {
      "pos": "noun",
      "explanation_en": "The Treaty of Versailles, the peace agreement signed in 1919 that officially ended World War I and imposed heavy penalties on Germany.",
      "explanation_cn": "指1919年签署的《凡尔赛条约》，该协议正式结束了第一次世界大战，并对德国施加了严厉的惩罚。",
      "example_en": "The harsh terms of the Treaty of Versailles are often cited as a contributing factor to the rise of Nazi Germany.",
      "example_cn": "《凡尔赛条约》的严苛条款常被视为纳粹德国崛起的促成因素之一。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "palace",
      "analysis": "“Palace”（宫殿）是一个通用名词，泛指任何皇家或贵族的宏伟住所，而 “Versailles” 是一个专有名词，特指法国的凡尔赛宫，承载着具体的历史、政治和文化内涵，不能与其他宫殿互换使用。"
    },
    {
      "word_to_compare": "treaty",
      "analysis": "“Treaty”（条约）是泛指国家间签订的正式协议，而 “Versailles” 在此语境下特指《凡尔赛条约》，是历史上最具影响力的条约之一，具有唯一性和标志性，不能与其他条约（如《华盛顿条约》）混用。"
    },
    {
      "word_to_compare": "capital",
      "analysis": "“Capital”（首都）指一个国家的政治中心，如巴黎是法国的首都，而 Versailles 曾是17至18世纪法国的实际政治中心，但从未正式成为首都，它是一个象征性权力中心，而非行政意义上的首都。"
    }
  ]
}