{
  "word": "vessel",
  "pronunciation": "ves·sl",
  "concise_definition": "n. 船舶, 容器, 血管, 人体",
  "forms": {
    "plural": "vessels"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A watercraft designed for transportation on water, ranging from small boats to large ships.",
      "explanation_cn": "指用于水上运输的船只，范围从小型艇到大型船舶。",
      "example_en": "The cargo vessel sailed across the Pacific Ocean for two weeks.",
      "example_cn": "这艘货轮在太平洋上航行了两周。"
    },
    {
      "pos": "noun",
      "explanation_en": "A container, especially one used for holding liquids or gases, such as a bottle, flask, or tank.",
      "explanation_cn": "指用于盛装液体或气体的容器，如瓶子、烧瓶或储罐。",
      "example_en": "She stored the olive oil in a sealed glass vessel.",
      "example_cn": "她把橄榄油存放在一个密封的玻璃容器中。"
    },
    {
      "pos": "noun",
      "explanation_en": "A tube or duct in the body that carries blood or other fluids, such as arteries, veins, or lymphatic vessels.",
      "explanation_cn": "指人体内输送血液或其他体液的管道，如动脉、静脉或淋巴管。",
      "example_en": "The surgeon repaired the damaged blood vessel to restore circulation.",
      "example_cn": "外科医生修复了受损的血管以恢复血液循环。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person regarded as a container or medium for a spiritual force, emotion, or influence, often used in religious or poetic contexts.",
      "explanation_cn": "在宗教或诗意语境中，指被视为某种精神力量、情感或影响之载体的人。",
      "example_en": "The mystic claimed to be a vessel of divine wisdom.",
      "example_cn": "这位神秘主义者声称自己是神圣智慧的载体。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ship",
      "analysis": "“Ship” (船) 通常特指大型海上运输工具，强调规模和功能，多用于商业或军事语境。而 “vessel” 是更广泛的术语，可涵盖从独木舟到油轮的所有水上载具，甚至包括非运输用途的船只，语义范围更广。"
    },
    {
      "word_to_compare": "container",
      "analysis": "“Container” (容器) 是一个通用词，泛指任何用于盛装物品的物体，如箱子、集装箱，不特指液体或生物系统。而 “vessel” 在指容器时，通常隐含盛装液体或气体的特性，且常用于科学、医学或文学语境，更具专业性或象征性。"
    },
    {
      "word_to_compare": "tube",
      "analysis": "“Tube” (管子) 指形状细长、中空的物理结构，多用于工程或日常语境，如塑料管、吸管。而 “vessel” 在医学语境中特指体内输送体液的管道，具有生理功能和系统性，语义更精确且带有生物学含义。"
    }
  ]
}