{
  "word": "vessels",
  "pronunciation": "ves·uhlz",
  "concise_definition": "n. 船只, 容器, 血管, (宗教) 圣器",
  "forms": {
    "singular": "vessel"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A craft designed for transportation on water, ranging from small boats to large ships used for trade, military, or passenger purposes.",
      "explanation_cn": "指用于水上运输的船只，范围从小型渔船到用于贸易、军事或载客的大型船舶。",
      "example_en": "The harbor was filled with fishing vessels returning at dawn.",
      "example_cn": "黎明时分，港口挤满了归航的渔船。"
    },
    {
      "pos": "noun",
      "explanation_en": "A container designed to hold liquids or gases, often made of glass, metal, or plastic, used in laboratories, kitchens, or industrial settings.",
      "explanation_cn": "指用于盛装液体或气体的容器，通常由玻璃、金属或塑料制成，常用于实验室、厨房或工业环境中。",
      "example_en": "The chemist carefully poured the solution into a sterile vessel.",
      "example_cn": "化学家将溶液小心地倒入一个无菌容器中。"
    },
    {
      "pos": "noun",
      "explanation_en": "A tubular structure in the body that carries blood or other fluids, such as arteries, veins, and capillaries.",
      "explanation_cn": "指人体内输送血液或其他体液的管状结构，如动脉、静脉和毛细血管。",
      "example_en": "Blockage in the coronary vessels can lead to a heart attack.",
      "example_cn": "冠状血管堵塞可能导致心脏病发作。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sacred object used in religious ceremonies, especially in Christian liturgy, such as chalices, ciboria, or patens.",
      "explanation_cn": "指用于宗教仪式中的圣器，尤其在基督教礼仪中，如圣杯、圣体盘或圣盘。",
      "example_en": "The priest handled the sacred vessels with great reverence during the Mass.",
      "example_cn": "神父在弥撒中以极大的敬意处理这些圣器。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ship",
      "analysis": "“Ship” (船) 通常特指大型的、用于远洋运输的船只，强调规模和商业/军事用途。而 “vessel” 是更广泛的术语，可涵盖从独木舟到油轮的所有水上载具，也用于非水上语境（如血管、容器），语义范围更广。"
    },
    {
      "word_to_compare": "container",
      "analysis": "“Container” (容器) 是一个通用词，泛指任何用于盛装物品的物体，不限于液体或特定材质。而 “vessel” 在指容器时，通常隐含用于盛装液体或气体，且常带有专业或正式语境（如实验室、宗教），语义更具体、更正式。"
    },
    {
      "word_to_compare": "artery",
      "analysis": "“Artery” (动脉) 是血管的一种具体类型，专指将血液从心脏输送到身体各部位的血管。而 “vessel” 是血管的总称，包括动脉、静脉和毛细血管。因此，“artery” 是 “vessel” 的子类，前者更精确，后者更概括。"
    }
  ]
}