{
  "word": "vested",
  "pronunciation": "ves·tid",
  "concise_definition": "adj. 已确定的, 已获得的, 有权益的",
  "forms": {
    "comparative": "vested",
    "superlative": "vested"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having a legal right or claim to something, especially a benefit, property, or interest that cannot be taken away, often due to time served, contribution, or contractual agreement.",
      "explanation_cn": "指因服务年限、贡献或合同约定而依法拥有某项权益、利益或财产，且该权利不可被剥夺。",
      "example_en": "After five years of service, she became fully vested in the company's retirement plan.",
      "example_cn": "工作五年后，她完全获得了公司退休计划的权益。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Fixed or established in a person's interest or possession, especially in the context of financial or legal entitlements.",
      "explanation_cn": "指某种利益或权利已固定归属于某人，尤其在金融或法律权利语境中，强调其不可逆转性。",
      "example_en": "The vested interest of shareholders in the company's long-term success is undeniable.",
      "example_cn": "股东对公司长期成功的既得利益是不容否认的。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used in the phrase 'vested interest' to describe a personal or selfish stake in a particular outcome, often implying bias or conflict of interest.",
      "explanation_cn": "用于短语 'vested interest'，指个人或私利对某一结果的利害关系，常暗示存在偏见或利益冲突。",
      "example_en": "The politician's opposition to the reform was seen as a result of his vested interest in the status quo.",
      "example_cn": "这位政客反对改革，被认为是因为他与现状有着既得利益。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "entitled",
      "analysis": "“Entitled”（有资格的）强调基于规则、法律或道德而应得的权利，但不一定已实际获得或不可撤销；而 “vested” 强调权利已实际确立、不可剥夺，通常与时间或条件满足相关。例如，员工可能有资格（entitled）获得奖金，但只有工作满五年后才真正拥有（vested）该奖金。"
    },
    {
      "word_to_compare": "secured",
      "analysis": "“Secured”（已保障的）侧重于通过担保、抵押或保护措施确保某物的安全或不可剥夺，常用于金融或物理安全语境；而 “vested” 更强调法律或制度性权利的自动归属，不依赖外部保障措施。例如，抵押贷款是 secured，而退休金权益是 vested。"
    },
    {
      "word_to_compare": "established",
      "analysis": "“Established”（已确立的）泛指某事物已被认可、形成或固定下来，可用于制度、习惯、事实等广泛语境；而 “vested” 专指法律或经济权利的归属，具有更强的法律效力和个体权益属性。例如，一个传统可以是 established，但只有权利才能是 vested。"
    }
  ]
}