{
  "word": "vest",
  "pronunciation": "vest",
  "concise_definition": "n. 背心, 马甲; v. 赋予, 授予",
  "forms": {
    "plural": "vests",
    "third_person_singular": "vests",
    "past_tense": "vested",
    "past_participle": "vested",
    "present_participle": "vesting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sleeveless garment worn over a shirt, typically buttoned and worn by men as part of a suit, or by workers for practical or protective purposes.",
      "explanation_cn": "一种无袖上衣，通常穿在衬衫外面，男性常作为西装的一部分穿着，或工人穿着以用于实用或防护目的。",
      "example_en": "He wore a navy blue vest with his tailored suit.",
      "example_cn": "他穿着一件深蓝色背心搭配他的定制西装。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of protective garment worn by soldiers, police, or athletes, often containing padding or ballistic material to shield the torso.",
      "explanation_cn": "一种由士兵、警察或运动员穿着的防护性服装，通常含有衬垫或防弹材料以保护躯干。",
      "example_en": "The officer was wearing a bulletproof vest during the operation.",
      "example_cn": "这名警官在行动中穿着防弹背心。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give someone legal rights or ownership to something, especially property or benefits, often immediately or upon a condition being met.",
      "explanation_cn": "指赋予某人对某物（尤其是财产或权益）的法定权利或所有权，通常在条件满足时立即生效。",
      "example_en": "The pension plan vests after five years of service.",
      "example_cn": "该养老金计划在服务满五年后归属员工所有。"
    },
    {
      "pos": "verb",
      "explanation_en": "To invest or endow something with authority or power, often used in legal or institutional contexts.",
      "explanation_cn": "指将权力或权威赋予某人或某机构，常用于法律或制度语境中。",
      "example_en": "The constitution vests the president with executive powers.",
      "example_cn": "宪法赋予总统行政权力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "jacket",
      "analysis": "“Jacket”（夹克）通常有袖子，长度较长，覆盖上半身更多部位，常用于保暖或外穿；而 “vest” 无袖，更轻便，多用于内搭、正式着装或作为防护装备，功能更专一。"
    },
    {
      "word_to_compare": "waistcoat",
      "analysis": "“Waistcoat” 是英式英语中对男性西装背心的称呼，与 “vest” 在美式英语中含义几乎完全相同，但在英国语境中，“vest” 通常指内衣（如吊带背心），因此使用时需注意地域差异。"
    },
    {
      "word_to_compare": "grant",
      "analysis": "“Grant”（授予）强调主动给予某物，常用于资源、许可或金钱，语气更正式且常含上级对下级的施予；而 “vest” 强调权利或所有权的法律性转移或自动生效，更侧重于权利归属的完成状态，而非给予动作本身。"
    }
  ]
}