{
  "word": "vintage",
  "pronunciation": "vin·tij",
  "concise_definition": "n. 陈年葡萄酒, 旧式风格; adj. 陈年的, 古典的, 有代表性的",
  "forms": {
    "comparative": "vintager",
    "superlative": "vintages"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A year or period in which wine was produced, especially one considered to be of high quality due to favorable growing conditions; also used to refer to the wine itself from such a year.",
      "explanation_cn": "指葡萄酒生产的特定年份，尤指因气候条件优越而品质上乘的年份；也可指该年份生产的葡萄酒本身。",
      "example_en": "The 1982 Bordeaux is considered one of the greatest vintages of the 20th century.",
      "example_cn": "1982年的波尔多葡萄酒被认为是20世纪最伟大的年份酒之一。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characteristic of a particular period in the past, especially one regarded as classic, stylish, or of high quality; often used to describe clothing, furniture, or design from the 1920s to the 1980s.",
      "explanation_cn": "指与过去某一特定时期相关或具有其特征的，尤指被视为经典、时尚或高品质的；常用于描述20世纪20年代至80年代的服装、家具或设计。",
      "example_en": "She wore a vintage dress from the 1950s to the party.",
      "example_cn": "她穿了一条20世纪50年代的复古连衣裙去参加派对。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Of or relating to something old but still valuable or desirable because of its age, authenticity, or craftsmanship.",
      "explanation_cn": "指某物虽旧，但因其年代久远、真实性和工艺精湛而仍具价值或吸引力。",
      "example_en": "The garage was filled with vintage cars and motorcycles from the 1960s.",
      "example_cn": "车库里堆满了20世纪60年代的复古汽车和摩托车。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "antique",
      "analysis": "“Antique”（古董）通常指至少有100年历史的物品，强调其历史价值和收藏意义，多用于家具、装饰品等实物。而 “vintage” 的时间范围更宽泛（一般为20至100年前），更侧重于风格、时代特征和审美价值，不一定具有极高的历史价值。"
    },
    {
      "word_to_compare": "classic",
      "analysis": "“Classic”（经典的）强调经得起时间考验的品质和普遍认可的典范性，可用于任何领域（如电影、文学、设计），不必然与年代相关。而 “vintage” 更具体地指向某一历史时期的产物，带有时代烙印，有时甚至包含怀旧或过时的意味。"
    },
    {
      "word_to_compare": "retro",
      "analysis": "“Retro”（复古风格的）指现代模仿过去风格的设计，通常是刻意重现旧时代的审美，但并非真正的旧物。而 “vintage” 指的是原汁原味的旧物，具有真实的历史背景和使用痕迹，不是复制品。"
    }
  ]
}