{
  "word": "virgin",
  "pronunciation": "vur·jən",
  "concise_definition": "n. 处女, 未使用过的物品; adj. 处女的, 未使用过的, 未受污染的",
  "forms": {
    "plural": "virgins",
    "comparative": "virginer",
    "superlative": "virginest"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person, especially a woman, who has never had sexual intercourse; often used in cultural, religious, or legal contexts to denote purity or innocence.",
      "explanation_cn": "指从未发生过性行为的人，尤指女性；常用于文化、宗教或法律语境中，表示纯洁或纯真。",
      "example_en": "The novel portrays the protagonist as a virgin navigating the complexities of adult life.",
      "example_cn": "这部小说将主人公描绘为一个在成人世界复杂性中挣扎的处女。"
    },
    {
      "pos": "noun",
      "explanation_en": "Something that has never been used, touched, or altered; often referring to land, resources, or digital content.",
      "explanation_cn": "指从未被使用、触碰或改变过的事物；常用于指土地、资源或数字内容。",
      "example_en": "The hikers explored a virgin forest untouched by human activity for centuries.",
      "example_cn": "徒步者们探索了一片数百年来未受人类活动影响的原始森林。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Not having been used, occupied, or corrupted; describing something in its original, pristine state.",
      "explanation_cn": "未被使用、占用或污染的；形容某物处于原始、纯净的状态。",
      "example_en": "She downloaded a virgin copy of the software to avoid any malware.",
      "example_cn": "她下载了一份未被篡改的原始软件副本，以避免任何恶意软件。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or characteristic of a person who has never engaged in sexual activity.",
      "explanation_cn": "与从未发生过性行为的人相关或具有其特征的。",
      "example_en": "The film received criticism for its stereotypical portrayal of the virgin character.",
      "example_cn": "这部电影因对处女角色的刻板描绘而受到批评。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "maiden",
      "analysis": "“Maiden”（少女/处女）与 “virgin” 在指代未发生性行为的女性时可互换，但 “maiden” 更具文学性或古语色彩，常用于诗歌或历史语境，且可指年轻未婚女性，不一定强调性经验。而 “virgin” 更直接、现代，且可广泛用于非人类对象（如土地、软件）。"
    },
    {
      "word_to_compare": "unspoiled",
      "analysis": "“Unspoiled”（未被破坏的）强调某物未受外界负面影响，如环境、污染或腐败，常用于自然景观或食物。它侧重于“保持原貌”而非“从未使用”。而 “virgin” 更强调绝对的初始状态，包含“从未接触”的含义，适用范围更广，包括抽象概念（如数据、代码）。"
    },
    {
      "word_to_compare": "pure",
      "analysis": "“Pure”（纯净的）是一个更宽泛的道德或物理概念，可指无杂质、无罪恶或无掺假，但不必然意味着“从未使用”。例如，纯水可能来自净化系统，而非原始状态；而 “virgin” 强调的是原始、未被触及的起点，具有更强的“初始性”和“完整性”含义。"
    }
  ]
}