{
  "word": "visionary",
  "pronunciation": "viz·huh·ner·ee",
  "concise_definition": "adj. 有远见的, 富于想象力的; n. 富有远见的人, 空想家",
  "forms": {
    "comparative": "more visionary",
    "superlative": "most visionary"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Characterized by the ability to think about or plan the future with imagination or wisdom; having clear, forward-thinking ideas that anticipate long-term trends or possibilities.",
      "explanation_cn": "指具有以想象力或智慧思考或规划未来的能力；拥有清晰、具有前瞻性的想法，能够预见长期趋势或可能性。",
      "example_en": "Steve Jobs was a visionary leader who transformed the way we interact with technology.",
      "example_cn": "史蒂夫·乔布斯是一位富有远见的领导者，彻底改变了我们与科技互动的方式。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Based on or arising from imagination rather than practical experience; sometimes implying unrealistic or idealistic thinking.",
      "explanation_cn": "基于想象而非实际经验；有时暗示不切实际或理想化的思维。",
      "example_en": "His visionary proposal to colonize Mars seemed impossible at the time.",
      "example_cn": "他提出在火星上建立殖民地的构想在当时看来是不可能的。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who has clear, original, and often revolutionary ideas about the future, especially in business, politics, or technology.",
      "explanation_cn": "指对未来发展拥有清晰、原创且常常具有革命性想法的人，尤其在商业、政治或科技领域。",
      "example_en": "As a visionary in renewable energy, she inspired a generation of engineers.",
      "example_cn": "作为可再生能源领域的先驱，她激励了一代工程师。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is guided more by imagination than by practical reality; sometimes used pejoratively to describe someone whose ideas are too idealistic to be implemented.",
      "explanation_cn": "指更多受想象力而非现实约束的人；有时带有贬义，形容其想法过于理想化而难以实现。",
      "example_en": "Some called him a visionary; others dismissed him as a dreamer with no grasp of economics.",
      "example_cn": "有人称他为远见卓识者，也有人认为他是个脱离现实的空想家。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "idealistic",
      "analysis": "“Idealistic”（理想主义的）强调对完美或高尚目标的追求，常带有脱离现实的意味，但不一定包含前瞻性或创新性。而 “visionary” 更强调对未来的洞察力和创造新路径的能力，即使其想法看似不切实际，也常被赋予积极评价。"
    },
    {
      "word_to_compare": "innovator",
      "analysis": "“Innovator”（创新者）指实际推动新方法、新技术或新产品落地的人，强调执行与实现。“Visionary” 则更侧重于构想和预见，可能尚未付诸实践。一个 visionary 可能是 innovator 的灵感来源，但未必亲自实现它。"
    },
    {
      "word_to_compare": "foreseer",
      "analysis": "“Foreseer”（预见者）指能够预测未来事件的人，通常基于分析、数据或直觉，但不必然包含创造性或变革性的构想。而 “visionary” 不仅预测未来，还主动构想并倡导一种全新的未来图景，具有更强的主动性与影响力。"
    }
  ]
}