{
  "word": "visions",
  "pronunciation": "vish·uhnz",
  "concise_definition": "n. 幻象, 愿景, 远见, 视觉",
  "forms": {
    "singular": "vision"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A mental image or impression, often vivid and unusual, that is seen in the mind or during a dream, trance, or religious experience.",
      "explanation_cn": "指在脑海中、梦境、恍惚或宗教体验中出现的生动而奇特的视觉形象或印象。",
      "example_en": "She had a vision of a golden city floating in the clouds.",
      "example_cn": "她看到一座金色的城市漂浮在云层之中。"
    },
    {
      "pos": "noun",
      "explanation_en": "A powerful and inspiring idea of what the future could be, often used in leadership, business, or social contexts to guide long-term goals.",
      "explanation_cn": "指对未来可能状态的一种富有感染力的构想，常用于领导力、商业或社会语境中，用以指导长期目标。",
      "example_en": "The CEO's vision for sustainable innovation transformed the entire industry.",
      "example_cn": "这位首席执行官对可持续创新的愿景彻底改变了整个行业。"
    },
    {
      "pos": "noun",
      "explanation_en": "The ability to think about or plan the future with imagination or wisdom; foresight or insight.",
      "explanation_cn": "指以想象力或智慧思考或规划未来的能力；远见或洞察力。",
      "example_en": "His visions of urban renewal earned him widespread respect among policymakers.",
      "example_cn": "他对城市更新的远见使他在政策制定者中赢得了广泛尊重。"
    },
    {
      "pos": "noun",
      "explanation_en": "A physical impairment or abnormality in the ability to see, often referring to a specific visual disturbance or condition.",
      "explanation_cn": "指视觉能力的障碍或异常，常指某种具体的视觉干扰或病症。",
      "example_en": "The patient reported blurred visions after the head injury.",
      "example_cn": "患者在头部受伤后报告出现了视力模糊。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "dream",
      "analysis": "“Dream”（梦）通常指睡眠中无意识产生的图像或经历，带有主观、非理性或情感色彩；而 “vision” 可以是清醒状态下的强烈想象，常具有目的性、启示性或神圣性，尤其在宗教或领导语境中更显庄重。"
    },
    {
      "word_to_compare": "imagination",
      "analysis": "“Imagination”（想象力）是普遍的心理能力，泛指创造或重组思想的能力；而 “vision” 是想象力的产物，特指一种清晰、强烈且具有导向性的心理图像或未来蓝图，更具目标性和影响力。"
    },
    {
      "word_to_compare": "outlook",
      "analysis": "“Outlook”（展望）侧重于对未来的总体态度或预期，通常是理性、现实的判断；而 “vision” 更强调理想化、富有感染力的未来图景，常包含情感激励和变革性目标，比 “outlook” 更具雄心和前瞻性。"
    }
  ]
}