{
  "word": "visit",
  "pronunciation": "vih·zit",
  "concise_definition": "v. 拜访, 参观, 访问; n. 拜访, 参观",
  "forms": {
    "third_person_singular": "visits",
    "past_tense": "visited",
    "past_participle": "visited",
    "present_participle": "visiting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To go to see a person, place, or institution for a short period of time, often for social, professional, or tourist purposes.",
      "explanation_cn": "指在短时间内前往拜访某人、参观某地或访问某机构，通常出于社交、职业或旅游目的。",
      "example_en": "We visited our grandparents in the countryside last weekend.",
      "example_cn": "上周末我们去乡下拜访了祖父母。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make a formal or official call, especially in a professional or diplomatic context.",
      "explanation_cn": "指在专业或外交背景下进行正式或官方的访问。",
      "example_en": "The president will visit the war-torn region to show solidarity.",
      "example_cn": "总统将访问这个战乱地区以表示声援。"
    },
    {
      "pos": "verb",
      "explanation_en": "To occur periodically or repeatedly, often used in the context of diseases, thoughts, or emotions.",
      "explanation_cn": "指（疾病、想法或情绪）反复出现或周期性地侵袭。",
      "example_en": "Memories of her childhood often visit her in dreams.",
      "example_cn": "童年的回忆常常在梦中浮现。"
    },
    {
      "pos": "noun",
      "explanation_en": "An act of going to see someone or somewhere, typically for a limited duration.",
      "explanation_cn": "指在有限时间内前往探望某人或参观某地的行为。",
      "example_en": "She made a quick visit to the museum before her flight.",
      "example_cn": "她在登机前匆匆参观了博物馆。"
    },
    {
      "pos": "noun",
      "explanation_en": "A formal or official meeting or inspection, especially by a person in authority.",
      "explanation_cn": "指由权威人士进行的正式会面或检查。",
      "example_en": "The health inspector's visit revealed several safety violations.",
      "example_cn": "卫生检查员的视察发现了多项安全隐患。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "call",
      "analysis": "“Call” (拜访) 通常指短暂、非正式的社交访问，尤其用于拜访他人住所，语气较随意；而 “visit” 更广泛，可用于正式场合、机构或地点，涵盖范围更广，且可作名词使用。"
    },
    {
      "word_to_compare": "tour",
      "analysis": "“Tour” (游览) 强调系统性、多地点的参观，常用于旅行或观光，时间较长且有计划性；而 “visit” 通常指单次、短暂的访问，不强调路线或行程。"
    },
    {
      "word_to_compare": "attend",
      "analysis": "“Attend” (参加) 指参与某个活动、会议或仪式，强调的是参与行为本身，而非物理上的前往；而 “visit” 强调的是物理移动到某地或某人处，不一定有参与活动的含义。"
    }
  ]
}