{
  "word": "vivo",
  "pronunciation": "vee·voh",
  "concise_definition": "adj. 活的, 生动的, 实地的; n. (音乐) 活板, 活跃地",
  "forms": {
    "comparative": "vivider",
    "superlative": "vividiest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Characterized by life, energy, or vividness; showing a strong sense of reality or immediacy, often used to describe performances, colors, or expressions that are strikingly real or animated.",
      "explanation_cn": "具有生命力、活力或鲜明性的；表现出强烈的真实感或即时性，常用于形容表演、色彩或表达方式生动逼真、栩栩如生。",
      "example_en": "The artist's vivo portrayal of emotion made the audience feel as if they were living the moment.",
      "example_cn": "这位艺术家生动逼真的情感刻画，让观众仿佛身临其境。"
    },
    {
      "pos": "adjective",
      "explanation_en": "In music, indicating a performance that is lively, brisk, and full of energy, often used as a direction to the performer.",
      "explanation_cn": "在音乐中，表示演奏应活泼、轻快、充满活力，常作为对演奏者的指示。",
      "example_en": "Play this passage vivo, with a bright and spirited tone.",
      "example_cn": "以明亮而富有生气的音色活泼地演奏这一段落。"
    },
    {
      "pos": "noun",
      "explanation_en": "A musical term used as a direction meaning 'lively' or 'in a lively manner'; often appears in scores to guide tempo and expression.",
      "explanation_cn": "音乐术语，用作指示，意为‘活泼地’或‘以活泼的方式’，常出现在乐谱中以指导速度和表现力。",
      "example_en": "The conductor emphasized the 'vivo' marking to ensure the orchestra maintained its rhythmic energy.",
      "example_cn": "指挥强调了‘vivo’的标记，以确保乐团保持节奏的活力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "lively",
      "analysis": "“Lively”（活泼的）是更通用的形容词，用于描述人、气氛或活动充满活力，但不特指视觉或艺术表现的真实感。而 “vivo” 更具专业性，尤其在音乐和艺术语境中，强调一种精准的、有意识的生动性表达。"
    },
    {
      "word_to_compare": "vivid",
      "analysis": "“Vivid”（鲜明的）侧重于色彩、图像或描述的清晰度和强烈印象，常用于文学或视觉艺术。而 “vivo” 不仅包含鲜明性，更强调动态的生命力和表演中的即时能量，是动作导向的，而非静态的视觉效果。"
    },
    {
      "word_to_compare": "allegro",
      "analysis": "“Allegro”（快板）是音乐速度术语，主要指示节奏快，但不必然包含情感或表现力的生动性。而 “vivo” 是表现性术语，强调在既定速度下注入活力与激情，可能用于中速甚至慢速段落，只要求表达生动。"
    }
  ]
}