{
  "word": "voicing",
  "pronunciation": "voys·ing",
  "concise_definition": "n. 表达, 发声, 投诉; v. 表达, 发声, 投诉（动词原形：voice）",
  "forms": {
    "base_form": "voice",
    "third_person_singular": "voices",
    "past_tense": "voiced",
    "past_participle": "voiced",
    "present_participle": "voicing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of expressing opinions, feelings, or concerns openly, especially in a public or formal context.",
      "explanation_cn": "指公开表达意见、情感或关切，尤其在公共或正式场合中。",
      "example_en": "The voicing of dissent by employees led to major policy changes.",
      "example_cn": "员工表达不同意见促使了重大政策的调整。"
    },
    {
      "pos": "noun",
      "explanation_en": "The quality or character of a person's spoken voice, especially in terms of tone, pitch, or emotional expression.",
      "explanation_cn": "指一个人说话声音的特质，尤其指音调、音高或情感表达方式。",
      "example_en": "Her voicing of the character brought depth and nuance to the animated film.",
      "example_cn": "她为这个角色配音，为这部动画电影增添了深度与细腻感。"
    },
    {
      "pos": "verb",
      "explanation_en": "To express or articulate thoughts, feelings, or opinions, especially when they are controversial or previously unspoken.",
      "explanation_cn": "指表达或阐明思想、情感或观点，尤其当这些内容具有争议性或此前未被说出时。",
      "example_en": "She finally voiced her concerns about the project's timeline.",
      "example_cn": "她终于表达了对项目时间表的担忧。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provide the spoken performance for a character in a film, animation, or video game.",
      "explanation_cn": "指为电影、动画或电子游戏中的角色提供配音。",
      "example_en": "He voiced the villain in the popular cartoon series for over a decade.",
      "example_cn": "他为这部热门卡通系列中的反派角色配音长达十多年。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "expressing",
      "analysis": "“Expressing”（表达）是一个更广泛、更通用的词，涵盖任何形式的传达，包括语言、文字、肢体动作或艺术形式。而 “voicing” 特指通过语言或声音来表达，强调发声行为本身，常用于政治、情感或意见的公开陈述。"
    },
    {
      "word_to_compare": "articulating",
      "analysis": "“Articulating”（清晰表达）强调语言的条理性和精确性，常用于复杂思想或抽象概念的清晰阐述。而 “voicing” 更侧重于“说出”这一行为，不一定要求逻辑严密，有时甚至包含情绪化的宣泄。"
    },
    {
      "word_to_compare": "speaking",
      "analysis": "“Speaking”（说话）是最基础的口语行为，泛指发出语言，不带有情感或意图的特定色彩。而 “voicing” 常隐含“代表某种立场”或“赋予声音给沉默者”的含义，具有更强的社会或情感张力。"
    }
  ]
}