{
  "word": "voice",
  "pronunciation": "vois",
  "concise_definition": "n. 声音, 说话权, 意见; v. 表达, 发声",
  "forms": {
    "plural": "voices",
    "third_person_singular": "voices",
    "past_tense": "voiced",
    "past_participle": "voiced",
    "present_participle": "voicing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The sound produced by a person or animal when speaking or singing, created by the vibration of vocal cords.",
      "explanation_cn": "人或动物说话或唱歌时产生的声音，由声带振动形成。",
      "example_en": "She has a clear, melodious voice that captivates audiences.",
      "example_cn": "她有一副清晰悦耳的嗓音，能吸引听众。"
    },
    {
      "pos": "noun",
      "explanation_en": "An expression of opinion, belief, or preference, especially in a collective or democratic context.",
      "explanation_cn": "在集体或民主语境中表达观点、信念或偏好的权利或行为，常指‘发言权’或‘代表性意见’。",
      "example_en": "The voters had a voice in choosing the new mayor.",
      "example_cn": "选民们在选择新市长时拥有发言权。"
    },
    {
      "pos": "noun",
      "explanation_en": "The distinctive style or tone of expression in literature, art, or music that reflects an individual's or group's perspective.",
      "explanation_cn": "文学、艺术或音乐中体现个人或群体独特视角的表达风格或语调。",
      "example_en": "The poet's voice is raw and honest, capturing the pain of urban poverty.",
      "example_cn": "这位诗人的声音真挚而原始，捕捉到了城市贫困的痛苦。"
    },
    {
      "pos": "verb",
      "explanation_en": "To express or articulate a thought, feeling, or opinion, especially when it has been previously suppressed or unheard.",
      "explanation_cn": "表达或说出某种想法、情感或意见，尤其指那些曾被压抑或忽视的声音。",
      "example_en": "The employees voiced their concerns about the new policy.",
      "example_cn": "员工们表达了对新政策的担忧。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sound",
      "analysis": "“Sound” (声音) 是一个更广泛的物理概念，泛指任何通过介质传播的振动波，包括自然声、噪音等，不涉及主观表达。而 “voice” 特指人类或动物通过声带发出的、具有语言或情感功能的声音，具有明确的沟通意图。"
    },
    {
      "word_to_compare": "opinion",
      "analysis": "“Opinion” (意见) 是一个抽象名词，指个人对事物的看法或判断，本身不包含表达行为。而 “voice” 作为名词时，强调的是‘表达意见的行为或权利’，是意见的外化形式。例如，‘give voice to an opinion’ 意为‘表达意见’。"
    },
    {
      "word_to_compare": "tone",
      "analysis": "“Tone” (语调/语气) 指语言或艺术表达中的情感色彩或风格特征，如严肃、讽刺、温柔等，是声音或文字的修饰层面。而 “voice” 是承载这些语调的主体，是表达的源头。例如，一个人可以有‘坚定的语气’，但‘坚定的声音’才是表达的载体。"
    }
  ]
}