{
  "word": "voices",
  "pronunciation": "voys",
  "concise_definition": "n. 声音,  voices 是 voice 的复数形式，指多个声音、意见或表达",
  "forms": {
    "singular": "voice"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The sound produced by a person or animal when speaking or singing, especially when conveying emotion, identity, or intention.",
      "explanation_cn": "指人或动物在说话或唱歌时发出的声音，尤其用于传达情感、身份或意图。",
      "example_en": "I could hear her voice echoing through the empty hallway.",
      "example_cn": "我能听到她的声音在空荡荡的走廊里回荡。"
    },
    {
      "pos": "noun",
      "explanation_en": "An individual's opinion, perspective, or expression, especially in a collective context such as politics, literature, or social movements.",
      "explanation_cn": "指个人在集体语境（如政治、文学或社会运动）中的观点、立场或表达方式。",
      "example_en": "The voices of the protesters were drowned out by the noise of the crowd.",
      "example_cn": "抗议者的声音被人群的喧嚣淹没了。"
    },
    {
      "pos": "noun",
      "explanation_en": "In literature or narrative, the distinct style or tone through which a story is told, often reflecting the personality or worldview of the narrator.",
      "explanation_cn": "在文学或叙事中，指故事讲述所采用的独特风格或语调，通常反映叙述者的个性或世界观。",
      "example_en": "The novel is written in the voice of a child, giving it a poignant and innocent tone.",
      "example_cn": "这部小说以孩子的口吻写成，赋予了它一种感人而纯真的语调。"
    },
    {
      "pos": "noun",
      "explanation_en": "In music, the classification of a singer's range and quality, such as soprano, alto, tenor, or bass.",
      "explanation_cn": "在音乐中，指歌手音域和音质的分类，如女高音、女中音、男高音或男低音。",
      "example_en": "The choir has four voices: soprano, alto, tenor, and bass.",
      "example_cn": "这个合唱团有四个声部：女高音、女中音、男高音和男低音。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sound",
      "analysis": "“Sound”（声音）是一个更广泛的物理概念，泛指任何通过介质传播的振动波，包括自然声、机械声等，不一定是人类发出的。而 “voice” 特指人类或动物通过声带发出的、具有语言或情感表达功能的声音。"
    },
    {
      "word_to_compare": "opinion",
      "analysis": "“Opinion”（意见）是抽象的主观看法，通常不包含表达方式或语气。而 “voice” 在比喻义中不仅指观点本身，还强调表达该观点的方式、语气和力量，具有更强的表现力和存在感。"
    },
    {
      "word_to_compare": "tone",
      "analysis": "“Tone”（语调）指语言或文字中传达情绪或态度的方式，是 “voice” 的一个组成部分。例如，一个人的 “voice” 可能包括其词汇选择、句式结构和语调，而 “tone” 仅指其中的情绪色彩。因此，voice 更全面，tone 更局部。"
    }
  ]
}