{
  "word": "volley",
  "pronunciation": "vahl·ee",
  "concise_definition": "n. 一连串击球, 一连串快速发言; v. 一连串击球, 迅速连续回应",
  "forms": {
    "third_person_singular": "volleys",
    "past_tense": "volleyed",
    "past_participle": "volleyed",
    "present_participle": "volleying"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "In sports such as tennis or volleyball, a shot hit by a player before the ball touches the ground, typically executed with speed and precision.",
      "explanation_cn": "在网球、排球等运动中，指球员在球落地前击打的球，通常以速度和精准度完成。",
      "example_en": "She returned the serve with a powerful volley that landed just inside the baseline.",
      "example_cn": "她以一记强有力的凌空抽球回击发球，球恰好落在底线内。"
    },
    {
      "pos": "noun",
      "explanation_en": "A rapid succession of similar actions or utterances, such as questions, comments, or attacks, often delivered in quick succession.",
      "explanation_cn": "指一系列快速连续发生的类似行为或言语，如问题、评论或攻击，通常接连不断地发出。",
      "example_en": "The journalist faced a volley of questions from the press after the scandal broke.",
      "example_cn": "丑闻曝光后，这位记者面对媒体接二连三的提问。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hit a ball in sports before it bounces, especially in tennis, soccer, or volleyball.",
      "explanation_cn": "在体育运动中，在球弹地前击打它，尤指在网球、足球或排球中。",
      "example_en": "He volleyed the cross-pass into the top corner of the net.",
      "example_cn": "他凌空抽射，将传中球打入球门上角。"
    },
    {
      "pos": "verb",
      "explanation_en": "To respond rapidly and repeatedly with words or actions, often in a forceful or aggressive manner.",
      "explanation_cn": "以迅速而重复的方式回应言语或行动，通常带有强烈或攻击性。",
      "example_en": "The politician volleyed back sharp criticisms during the debate.",
      "example_cn": "这位政客在辩论中迅速回击了尖锐的批评。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "smash",
      "analysis": "“Smash”（重扣）强调以极大的力量击打，通常用于描述网球或排球中极具攻击性的下压动作，而 “volley” 仅指在球落地前击打，不必然包含力量，更强调击球时机。一个球可以是凌空抽击（volley）但不是重扣（smash），反之亦然。"
    },
    {
      "word_to_compare": "series",
      "analysis": "“Series”（系列）泛指一系列相关事件或动作，中性且无时间紧迫性；而 “volley” 特指快速、密集、连续的爆发性行为，常带有情绪张力或对抗性，如‘一连串质问’（a volley of questions）比‘一系列问题’（a series of questions）更具紧迫感和冲击力。"
    },
    {
      "word_to_compare": "rally",
      "analysis": "“Rally”（反击/连续击球）在网球中指双方来回击球的多拍对抗过程，强调互动和持续性；而 “volley” 是单次击球动作，特指在球未落地时的击打，不涉及回合的延续。一个 rally 可能包含多个 volley，但一个 volley 不构成 rally。"
    }
  ]
}