{
  "word": "voyage",
  "pronunciation": "voy·ij",
  "concise_definition": "n. 航行, 旅程, 旅行 v. 航行, 旅行",
  "forms": {
    "third_person_singular": "voyages",
    "past_tense": "voyaged",
    "past_participle": "voyaged",
    "present_participle": "voyaging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long journey, especially by sea or in space, often involving travel over a considerable distance and duration, typically with a specific purpose or destination.",
      "explanation_cn": "指一段漫长的旅程，尤指海上或太空中的旅行，通常涉及较长的距离和时间，且带有特定的目的或目的地。",
      "example_en": "The explorers embarked on a voyage across the Pacific Ocean to discover new lands.",
      "example_cn": "探险家们启程横渡太平洋，以发现新的陆地。"
    },
    {
      "pos": "noun",
      "explanation_en": "A metaphorical journey of personal growth, discovery, or transformation, often used to describe a profound life experience.",
      "explanation_cn": "比喻意义上的旅程，指个人成长、发现或转变的深刻经历。",
      "example_en": "Her year abroad was a voyage of self-discovery that changed her perspective on life.",
      "example_cn": "她在国外的一年是一段自我发现的旅程，彻底改变了她对生活的看法。"
    },
    {
      "pos": "verb",
      "explanation_en": "To travel by sea or through space, especially on a long or adventurous journey.",
      "explanation_cn": "指乘船或穿越太空进行旅行，尤指长途或充满冒险的旅程。",
      "example_en": "The ancient Vikings voyaged as far as North America centuries before Columbus.",
      "example_cn": "早在哥伦布之前几个世纪，古维京人就航行到了北美洲。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "journey",
      "analysis": "“Journey” (旅程) 是一个更通用的词，可用于任何类型的旅行，无论是陆地、空中还是象征性的，强调从起点到终点的过程。而 “voyage” 更特指海上或太空中的长途旅行，具有更强的冒险性和历史感，语义范围更窄但更具体。"
    },
    {
      "word_to_compare": "trip",
      "analysis": "“Trip” (旅行) 通常指短途、目的明确且时间较短的出行，如商务差旅或周末出游，语气轻松随意。而 “voyage” 暗示更长的时间、更大的风险和更深远的意义，常用于史诗性或探索性的语境中，语义更庄重。"
    },
    {
      "word_to_compare": "crossing",
      "analysis": "“Crossing” (横渡) 专指跨越某一地理障碍（如海洋、大陆）的行动，强调的是空间上的穿越行为本身，而非整个旅程的体验。而 “voyage” 包含了从出发到抵达的全过程，包括准备、航行、经历和收获，是一个更完整的叙事单元。"
    }
  ]
}