{
  "word": "vulcan",
  "pronunciation": "vuhl·kun",
  "concise_definition": "n. 火神, 火山, 火工, 火神星",
  "forms": {
    "plural": "vulcans"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "In Roman mythology, the god of fire, metalworking, and the forge, often depicted as a blacksmith who created weapons and tools for the gods.",
      "explanation_cn": "在罗马神话中，掌管火、金属加工和锻造的神，常被描绘为为众神打造武器与工具的铁匠。",
      "example_en": "Vulcan was believed to have his forge beneath Mount Etna, where earthquakes were caused by his hammer strikes.",
      "example_cn": "人们相信伏尔甘的锻造炉位于埃特纳火山之下，地震正是他锤击所致。"
    },
    {
      "pos": "noun",
      "explanation_en": "A term used in geology and vulcanology to refer to a volcano or volcanic activity, especially in poetic or archaic contexts.",
      "explanation_cn": "在地质学或火山学中，用于指代火山或火山活动，尤其在诗歌或古语语境中。",
      "example_en": "The ancient city was buried under ash from the vulcan's wrath.",
      "example_cn": "这座古城被火山之怒喷发的火山灰掩埋。"
    },
    {
      "pos": "noun",
      "explanation_en": "A fictional alien species from the Star Trek universe, known for their logic, emotional restraint, and advanced technology.",
      "explanation_cn": "《星际迷航》宇宙中虚构的外星种族，以逻辑思维、情感克制和先进技术著称。",
      "example_en": "Spock, the first officer of the Enterprise, is a Vulcan who struggles to balance his human emotions with his logical heritage.",
      "example_cn": "企业号的大副史波克是一名瓦肯人，他努力在人类情感与逻辑传统之间寻求平衡。"
    },
    {
      "pos": "noun",
      "explanation_en": "A hypothetical planet once believed to exist between Mercury and the Sun, proposed to explain anomalies in Mercury's orbit (now disproven).",
      "explanation_cn": "曾假想存在于水星与太阳之间的一颗行星，为解释水星轨道异常而提出（现已证伪）。",
      "example_en": "In the 19th century, astronomers searched for Vulcan to account for the precession of Mercury's perihelion.",
      "example_cn": "19世纪，天文学家曾寻找火神星，以解释水星近日点的进动现象。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "volcano",
      "analysis": "“Volcano”（火山）是地质学中的标准术语，指地球表面的喷发口或山体结构，强调其物理形态和自然现象。而 “vulcan” 作为名词使用时，常带有神话、文学或古语色彩，有时是“volcano”的诗意替代，但不用于现代科学文献。"
    },
    {
      "word_to_compare": "smith",
      "analysis": "“Smith”（铁匠）泛指从事金属加工的人，是一个职业称谓，不涉及神话或神祇含义。而 “Vulcan” 特指神话中的火神，是铁匠的神化原型，具有宗教和象征意义，远超出职业范畴。"
    },
    {
      "word_to_compare": "mercurial",
      "analysis": "“Mercurial”（水星的/善变的）源自罗马神墨丘利（Mercury），形容性格多变、敏捷或不可预测。而 “vulcan” 与之相反，常象征稳定、专注与理性（尤其在《星际迷航》中），两者在文化象征上形成鲜明对比：前者代表流动性，后者代表锻造与秩序。"
    }
  ]
}