{
  "word": "vulgar",
  "pronunciation": "vul·gur",
  "concise_definition": "adj. 粗俗的, 低下的, 庸俗的",
  "forms": {
    "comparative": "vulgarer",
    "superlative": "vulgarest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Lacking in taste, refinement, or delicacy; characterized by offensive or crude language, behavior, or content that is considered socially unacceptable.",
      "explanation_cn": "缺乏品味、优雅或细腻；以令人反感或粗俗的语言、行为或内容为特征，被视为社会不可接受的。",
      "example_en": "His vulgar jokes made everyone at the dinner table uncomfortable.",
      "example_cn": "他那些粗俗的笑话让饭桌上的每个人都感到不适。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Belonging to or characteristic of the common people, especially in a way that is considered uneducated or lacking in sophistication; sometimes used neutrally to describe popular culture.",
      "explanation_cn": "属于或体现普通大众的特征，尤其指显得缺乏教养或粗俗；有时中性地用于描述大众文化。",
      "example_en": "The novel portrays the vulgar habits of the newly rich in 19th-century America.",
      "example_cn": "这部小说描绘了19世纪美国新富阶层的庸俗习气。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Explicitly sexual or obscene in nature, often in a way that is blunt, graphic, or lacking in subtlety.",
      "explanation_cn": "具有明确的性内容或淫秽性质，通常表现得直白、露骨且缺乏含蓄。",
      "example_en": "The movie was banned for its vulgar depiction of violence and sexuality.",
      "example_cn": "这部电影因对暴力和性行为的粗俗描绘而被禁映。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "crude",
      "analysis": "“Crude”（粗鲁的/原始的）强调缺乏精致或加工，常用于描述未经修饰的物质（如原油）或行为（如粗鲁的言辞）。它比 “vulgar” 更中性，不一定带有道德评判，而 “vulgar” 更侧重于社会规范下的低俗与冒犯性。"
    },
    {
      "word_to_compare": "coarse",
      "analysis": "“Coarse”（粗俗的/粗糙的）可指质地粗糙，也可指言语或行为缺乏文雅，但更侧重于“粗粝感”而非道德堕落。它常用于描述声音、布料或举止，语气较轻；而 “vulgar” 更强调对社会礼仪的违背，带有更强的贬义。"
    },
    {
      "word_to_compare": "obscene",
      "analysis": "“Obscene”（淫秽的）特指违反法律或道德标准的性或暴力内容，具有明确的非法或极端冒犯性，常用于法律语境。而 “vulgar” 范围更广，涵盖所有低俗、庸俗的表现，不一定达到“淫秽”的程度，但同样令人反感。"
    }
  ]
}