{
  "word": "wakes",
  "pronunciation": "weyks",
  "concise_definition": "n. 守灵, 告别仪式; v. (wake 的第三人称单数) 醒来, 使醒, 保持警觉",
  "forms": {
    "base_form": "wake",
    "past_tense": "woke",
    "past_participle": "woken",
    "present_participle": "waking",
    "plural": "wakes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A vigil or ceremony held beside the body of a deceased person before burial, often involving family and friends gathering to pay respects, share memories, and offer condolences.",
      "explanation_cn": "指在逝者下葬前，家人和朋友聚集在遗体旁守夜、表达敬意、分享回忆并致哀的仪式。",
      "example_en": "The family held a quiet wake at home before the funeral service.",
      "example_cn": "葬礼前，家人在家举行了安静的守灵仪式。"
    },
    {
      "pos": "noun",
      "explanation_en": "The track or path left behind by a moving vessel, especially a boat or ship, on the surface of water.",
      "explanation_cn": "指船只或其他水上交通工具在水面航行时留下的尾迹或航迹。",
      "example_en": "The speedboat left a long wake behind it as it cut through the waves.",
      "example_cn": "快艇在波浪中穿行，身后留下一道长长的尾迹。"
    },
    {
      "pos": "verb",
      "explanation_en": "To stop sleeping and become conscious; to emerge from a state of unconsciousness or inactivity.",
      "explanation_cn": "指从睡眠中醒来，或从无意识或不活跃状态中恢复意识。",
      "example_en": "She wakes up every morning at 6 a.m. to exercise.",
      "example_cn": "她每天早上六点醒来锻炼。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause someone or something to stop sleeping or to become alert or active.",
      "explanation_cn": "指使某人或某物从睡眠或沉寂中苏醒、警觉或活跃起来。",
      "example_en": "The loud alarm woke him from a deep sleep.",
      "example_cn": "刺耳的闹钟把他从深睡中唤醒。"
    },
    {
      "pos": "verb",
      "explanation_en": "To stir up or provoke a feeling, memory, or reaction, often unexpectedly.",
      "explanation_cn": "指无意中激起某种情感、记忆或反应，常带有突然性。",
      "example_en": "The old photograph woke memories of her childhood.",
      "example_cn": "那张旧照片勾起了她对童年的回忆。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "funeral",
      "analysis": "“Funeral” (葬礼) 是指正式的安葬仪式，通常包括宗教或官方程序，重点在于告别与安葬逝者；而 “wake” 是葬礼前的守夜活动，更侧重于亲友聚集、缅怀与情感交流，形式通常更非正式、更个人化。"
    },
    {
      "word_to_compare": "trail",
      "analysis": "“Trail” (痕迹/小径) 是一个更通用的词，可指任何路径或遗留痕迹，如动物足迹、登山小径或数字足迹；而 “wake” 作为名词特指船只在水面留下的尾迹，具有强烈的水文和动态意象，语义范围更窄、更具体。"
    },
    {
      "word_to_compare": "awaken",
      "analysis": "“Awaken” (唤醒) 是 “wake” 的更正式或文学化同义词，常用于比喻意义，如唤醒意识、良知或潜能，语气更庄重；而 “wake” 更口语化，既可用于生理上的醒来，也可用于物理上的尾迹，语义更广泛、更日常。"
    }
  ]
}