{
  "word": "walks",
  "pronunciation": "wokz",
  "concise_definition": "v. 走, 散步; n. 步行, 步道",
  "forms": {
    "base_form": "walk",
    "third_person_singular": "walks",
    "past_tense": "walked",
    "past_participle": "walked",
    "present_participle": "walking"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move on foot at a regular pace, typically by alternating steps of each foot, without running.",
      "explanation_cn": "以稳定的步频用脚移动，通常通过双脚交替迈步，而非奔跑。",
      "example_en": "She walks to work every morning to stay fit.",
      "example_cn": "她每天早上步行上班以保持健康。"
    },
    {
      "pos": "verb",
      "explanation_en": "To accompany someone while moving on foot, often in a casual or social context.",
      "explanation_cn": "在非正式或社交场合中，与某人一同步行。",
      "example_en": "He walked his daughter to school and chatted about her day.",
      "example_cn": "他陪女儿步行去学校，聊了聊她的一天。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to move or be displayed in a particular direction or manner, often used with objects like dogs, horses, or exhibits.",
      "explanation_cn": "引导某物（如狗、马或展品）按特定方向或方式移动，常用于展示或控制场景。",
      "example_en": "The judge walked the contestants around the stage to show their outfits.",
      "example_cn": "评委让参赛者在舞台上走动，以展示他们的服装。"
    },
    {
      "pos": "noun",
      "explanation_en": "An act or instance of walking, especially for exercise or pleasure.",
      "explanation_cn": "一次步行行为，尤指为了锻炼或消遣而进行的散步。",
      "example_en": "I went for a long walk in the park after dinner.",
      "example_cn": "晚饭后我去公园里散了很长时间的步。"
    },
    {
      "pos": "noun",
      "explanation_en": "A path or route designated for walking, especially in natural or rural areas.",
      "explanation_cn": "专为步行设计的小路或路线，尤指自然或乡村地区中的步道。",
      "example_en": "The national park has several scenic walks through the forest.",
      "example_cn": "这个国家公园有几条穿越森林的风景步道。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "stroll",
      "analysis": "“Stroll” (悠闲漫步) 强调轻松、缓慢、无目的的步行，常带有享受氛围的意味，如散步看风景。而 “walk” 更中性，可指任何速度或目的的步行，包括匆忙赶路或锻炼。"
    },
    {
      "word_to_compare": "march",
      "analysis": "“March” (行军/齐步走) 指有节奏、有组织、通常严肃或军事化的步行，强调统一性和纪律性。与 “walk” 的随意性形成对比，后者更日常、非正式。"
    },
    {
      "word_to_compare": "hike",
      "analysis": "“Hike” (远足) 指在自然环境中进行的长时间、有挑战性的步行，通常涉及山路或野外地形，强调体力消耗和探险性质。而 “walk” 一般指较短、较平缓的城市或公园步行。"
    }
  ]
}