{
  "word": "walk",
  "pronunciation": "wok",
  "concise_definition": "v. 走, 散步; n. 步行, 步道",
  "forms": {
    "third_person_singular": "walks",
    "past_tense": "walked",
    "past_participle": "walked",
    "present_participle": "walking"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move on foot at a regular pace, placing one foot in front of the other in a rhythmic manner, typically without running.",
      "explanation_cn": "以有节奏的方式用双脚移动，一步接一步地行走，通常不涉及跑步。",
      "example_en": "She walks to work every morning to stay fit.",
      "example_cn": "她每天早上步行上班以保持健康。"
    },
    {
      "pos": "verb",
      "explanation_en": "To accompany or lead someone while moving on foot, often in a formal or ceremonial context.",
      "explanation_cn": "在正式或仪式性场合中，陪同或带领某人步行。",
      "example_en": "The father walked his daughter down the aisle at the wedding.",
      "example_cn": "父亲在婚礼上牵着女儿走过过道。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to move or function by walking or turning, especially in mechanical or technical contexts (e.g., walk a line, walk a dog).",
      "explanation_cn": "通过行走或转动使某物移动或运作，尤其用于机械或技术语境（如牵狗、走线）。",
      "example_en": "He walked the tightrope with incredible balance.",
      "example_cn": "他以惊人的平衡感走过了钢索。"
    },
    {
      "pos": "noun",
      "explanation_en": "An act of walking, especially for pleasure, exercise, or relaxation.",
      "explanation_cn": "一种行走行为，尤指为了娱乐、锻炼或放松而进行的散步。",
      "example_en": "We went for a long walk in the park after dinner.",
      "example_cn": "晚饭后我们在公园里散了很长时间的步。"
    },
    {
      "pos": "noun",
      "explanation_en": "A path or route designed for walking, especially in natural or urban settings.",
      "explanation_cn": "专为步行设计的小路或路线，常见于自然或城市环境中。",
      "example_en": "The coastal walk offers stunning views of the ocean.",
      "example_cn": "沿海步道提供了壮丽的海景。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "stroll",
      "analysis": "“Stroll” (悠闲散步) 强调轻松、缓慢、无目的的步行，常带有休闲和享受的意味。而 “walk” 是更中性、通用的词，可包含有目的的行走，如上班、赶路等。"
    },
    {
      "word_to_compare": "march",
      "analysis": "“March” (行军/齐步走) 指有节奏、有组织、通常严肃或军事化的步行，强调统一性和力量感。与 “walk” 的随意性形成对比，后者更自由、非正式。"
    },
    {
      "word_to_compare": "hike",
      "analysis": "“Hike” (远足) 通常指在自然环境中进行的长时间、有挑战性的步行，常涉及山路或野外地形。而 “walk” 更泛指日常或短途的步行，不强调体力消耗或地形难度。"
    }
  ]
}