{
  "word": "wanda",
  "pronunciation": "wan·duh",
  "concise_definition": "n. 旺达（专有名词，常用于人名或地名）",
  "forms": {
    "plural": "Wandas"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A proper noun commonly used as a given name, particularly in English-speaking and European cultures. It may also refer to fictional characters, brands, or places bearing this name.",
      "explanation_cn": "一个常用作人名的专有名词，尤其在英语国家和欧洲文化中。也可指以该名称命名的虚构角色、品牌或地点。",
      "example_en": "Wanda Maximoff, also known as the Scarlet Witch, is a powerful superheroine in the Marvel Universe.",
      "example_cn": "旺达·马克西莫夫，又称绯红女巫，是漫威宇宙中一位强大的超级英雄。"
    },
    {
      "pos": "noun",
      "explanation_en": "A brand or business name used in various industries, such as real estate, retail, or entertainment, often chosen for its distinctive and memorable sound.",
      "explanation_cn": "用于房地产、零售或娱乐等行业的品牌或企业名称，常因其独特且易记的发音而被选用。",
      "example_en": "Wanda Group is one of China's largest private conglomerates, with major investments in cinema, sports, and real estate.",
      "example_cn": "万达集团是中国最大的私营企业集团之一，主要投资于电影、体育和房地产领域。"
    },
    {
      "pos": "noun",
      "explanation_en": "A place name found in certain regions, such as Wanda, Minnesota, a small town in the United States, or Wanda, Ontario, a locality in Canada.",
      "explanation_cn": "某些地区的地名，例如美国明尼苏达州的旺达小镇，或加拿大安大略省的旺达地区。",
      "example_en": "We stopped by Wanda, Minnesota, on our road trip across the Midwest.",
      "example_cn": "我们在穿越中西部的公路旅行中，曾在明尼苏达州的旺达小镇停留。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "wander",
      "analysis": "“Wander”（漫游）是一个动词，表示无目的地行走或游荡，强调动作和状态；而 “Wanda” 是一个专有名词，仅作为名称使用，无动词含义。两者拼写相似但词性、语义和用法完全不同。"
    },
    {
      "word_to_compare": "wand",
      "analysis": "“Wand”（魔杖）是一个普通名词，指魔法故事中使用的细长工具；而 “Wanda” 是人名或品牌名，虽在奇幻语境中可能因发音相近而被联想，但二者在语义和语法功能上无直接关联。"
    },
    {
      "word_to_compare": "wanda (as in WandaVision)",
      "analysis": "在流行文化中，'Wanda' 常特指漫威影视作品《旺达幻视》中的主角旺达·马克西莫夫。这种用法是专有名词的语境化延伸，不同于一般性人名或地名，具有高度的文化符号意义。"
    }
  ]
}