{
  "word": "wards",
  "pronunciation": "wɔrdz",
  "concise_definition": "n. 病房, 监护区, 选区, 保护物",
  "forms": {
    "singular": "ward"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A division or room in a hospital where patients are cared for, typically grouped by medical condition or age.",
      "explanation_cn": "医院中按病情或年龄划分的病房或区域，用于集中收治和护理病人。",
      "example_en": "The children were admitted to the pediatric ward after the accident.",
      "example_cn": "事故发生后，孩子们被送进了儿科病房。"
    },
    {
      "pos": "noun",
      "explanation_en": "A political subdivision of a city or town, used for administrative or electoral purposes.",
      "explanation_cn": "城市或城镇的行政或选举分区，常用于地方治理和选区划分。",
      "example_en": "She ran for city council in the third ward and won by a narrow margin.",
      "example_cn": "她在第三选区竞选市议员，并以微弱优势获胜。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person under the protection or care of another, especially a minor or someone legally incapacitated.",
      "explanation_cn": "指受他人保护或监护的人，尤指未成年人或法律上无行为能力者。",
      "example_en": "The court appointed a guardian for the orphaned child, making her a legal ward of the state.",
      "example_cn": "法院为这名孤儿指定了一位监护人，使她成为国家的法定被监护人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A protective covering or barrier, especially in the context of armor or magical protection (archaic or literary usage).",
      "explanation_cn": "（古语或文学用法）指保护性覆盖物或屏障，尤指盔甲或魔法防护。",
      "example_en": "The knight stood firm, his armor his only ward against the dragon's fiery breath.",
      "example_cn": "骑士屹立不动，他的盔甲是他抵御巨龙烈焰的唯一屏障。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "department",
      "analysis": "“Department”（部门）通常指组织或机构中按职能划分的单位，如医院的放射科、财务部等，强调行政或专业分工；而 “ward” 更侧重于物理空间和患者护理的集中区域，具有更强的临床和空间属性。"
    },
    {
      "word_to_compare": "district",
      "analysis": "“District”（地区/区域）是一个更广泛、更通用的地理或行政划分术语，可用于国家、城市或乡村层面；而 “ward” 是其子集，专用于城市内部的较小选举或管理分区，范围更小、更具体。"
    },
    {
      "word_to_compare": "guardian",
      "analysis": "“Guardian”（监护人）指承担法律监护责任的个人，是主动的保护者；而 “ward” 是被动的被保护对象，二者是相对的法律角色。例如，监护人管理被监护人的事务，被监护人则接受其保护。"
    }
  ]
}