{
  "word": "warm",
  "pronunciation": "wɔːrm",
  "concise_definition": "adj. 温暖的, 热情的, 暖色的; v. 使变暖, 变暖",
  "forms": {
    "comparative": "warmer",
    "superlative": "warmest",
    "third_person_singular": "warms",
    "past_tense": "warmed",
    "past_participle": "warmed",
    "present_participle": "warming"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having a moderately high temperature, not hot but comfortably heated; often used to describe weather, objects, or environments.",
      "explanation_cn": "具有中等偏高的温度，不热但令人感到舒适；常用于描述天气、物体或环境。",
      "example_en": "The sun came out and made the air warm and pleasant.",
      "example_cn": "太阳出来了，空气变得温暖宜人。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Showing kindness, friendliness, or enthusiasm; describing a person's attitude or reception.",
      "explanation_cn": "表现出善意、友好或热情；用于描述人的态度或接待方式。",
      "example_en": "She gave us a warm welcome when we arrived at her house.",
      "example_cn": "我们到达她家时，她热情地欢迎了我们。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing colors that evoke feelings of heat or sunlight, such as red, orange, and yellow, as opposed to cool colors like blue or green.",
      "explanation_cn": "指能唤起温暖或阳光感觉的颜色，如红色、橙色和黄色，与蓝色或绿色等冷色相对。",
      "example_en": "The living room was painted in warm tones to create a cozy atmosphere.",
      "example_cn": "客厅涂成了暖色调，以营造温馨的氛围。"
    },
    {
      "pos": "verb",
      "explanation_en": "To increase the temperature of something gradually, often by exposure to heat or physical activity.",
      "explanation_cn": "通过暴露于热源或身体活动，使某物的温度逐渐升高。",
      "example_en": "He warmed his hands by the fire after coming in from the snow.",
      "example_cn": "他从雪地里进来后，靠在火边暖手。"
    },
    {
      "pos": "verb",
      "explanation_en": "To become gradually warmer in temperature or emotion; to transition from cold or indifferent to more friendly or enthusiastic.",
      "explanation_cn": "温度或情绪逐渐升高；从冷漠或疏离转变为更友好或热情。",
      "example_en": "Over time, their relationship warmed as they spent more time together.",
      "example_cn": "随着时间推移，他们相处的时间增多，关系也逐渐融洽起来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "hot",
      "analysis": "“Hot”（热的）表示温度很高，常带有不适或强烈的感觉，如“hot stove”（热炉子）；而 “warm” 表示温和、舒适的温度，不具压迫性。两者是程度上的区别，warm 是 hot 的温和形式。"
    },
    {
      "word_to_compare": "cozy",
      "analysis": "“Cozy”（舒适的）强调一种心理上的温暖与安逸感，常与环境、氛围相关，如“a cozy blanket”；而 “warm” 更侧重物理温度或情感态度的表达。一个地方可以是 warm 但不 cozy（如阳光直射的房间），也可以是 cozy 但温度不高（如盖着毛毯的沙发）。"
    },
    {
      "word_to_compare": "friendly",
      "analysis": "“Friendly”（友好的）是描述人际互动的通用词，强调礼貌与善意；而 “warm” 在描述人时，不仅包含友好，还带有情感上的热情、真挚和感染力，如 “a warm smile” 比 “a friendly smile” 更具情感深度。"
    }
  ]
}