{
  "word": "warrant",
  "pronunciation": "waw·rənt",
  "concise_definition": "n. 授权, 令状, 正当理由; v. 使正当, 需要, 保证",
  "forms": {
    "third_person_singular": "warrants",
    "past_tense": "warranted",
    "past_participle": "warranted",
    "present_participle": "warranting",
    "plural": "warrants"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An official document issued by a competent authority, such as a judge, authorizing a specific action, typically involving law enforcement (e.g., arrest, search, or seizure).",
      "explanation_cn": "指由权威机构（如法官）签发的正式文件，授权采取特定行动，通常涉及执法行为（如逮捕、搜查或扣押）。",
      "example_en": "The police obtained a search warrant to examine the suspect's home.",
      "example_cn": "警方获得了搜查令，以检查嫌疑人的住所。"
    },
    {
      "pos": "noun",
      "explanation_en": "A justifiable reason or grounds for an action, belief, or decision; something that makes an action reasonable or acceptable.",
      "explanation_cn": "指某项行动、信念或决定的正当理由或依据，使其显得合理或可接受。",
      "example_en": "There is no warrant for such extreme measures in this situation.",
      "example_cn": "在这种情况下，采取如此极端的措施是没有正当理由的。"
    },
    {
      "pos": "verb",
      "explanation_en": "To justify or provide sufficient reason for something, especially in response to a concern or criticism.",
      "explanation_cn": "指为某事提供充分的理由或正当性，尤其在回应担忧或批评时。",
      "example_en": "The severity of the crime warrants a harsh sentence.",
      "example_cn": "该罪行的严重性 warrant 严厉的判决。"
    },
    {
      "pos": "verb",
      "explanation_en": "To guarantee or assure the quality, performance, or reliability of something, often in a formal or contractual context.",
      "explanation_cn": "指在正式或合同背景下，对某物的质量、性能或可靠性作出保证。",
      "example_en": "This product is warranted for two years against manufacturing defects.",
      "example_cn": "本产品对制造缺陷提供两年保修。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "authorization",
      "analysis": "“Authorization”（授权）泛指任何形式的许可或批准，不一定是法律文件，也不一定由司法机关签发。而 “warrant” 特指具有法律效力的官方文件，常用于执法场景，具有更强的强制性和程序性。"
    },
    {
      "word_to_compare": "justification",
      "analysis": "“Justification”（正当理由）是抽象的解释或论证，用于说明某行为为何合理；而 “warrant” 作为名词时，既可以是抽象理由，也可以是具体的法律文件，语义范围更广，且在法律语境中更具权威性。"
    },
    {
      "word_to_compare": "guarantee",
      "analysis": "“Guarantee”（保证）强调对结果或质量的承诺，常用于商业或消费领域，如产品保修；而 “warrant” 作为动词时虽可表示保证，但更常用于正式或法律语境，且常隐含‘基于某种理由而必须如此’的逻辑，语义更严谨。"
    }
  ]
}