{
  "word": "washes",
  "pronunciation": "waw·shiz",
  "concise_definition": "n. 洗涤, 清洗; v. 洗, 冲洗 (第三人称单数形式)",
  "forms": {
    "base_form": "wash",
    "plural": "washes",
    "third_person_singular": "washes",
    "past_tense": "washed",
    "past_participle": "washed",
    "present_participle": "washing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act or process of cleaning something with water or another liquid, often to remove dirt, grease, or unwanted substances.",
      "explanation_cn": "用清水或其他液体清洁某物的行为或过程，通常用于去除污垢、油脂或不需要的物质。",
      "example_en": "She gave the car a thorough wash after the muddy road trip.",
      "example_cn": "在泥泞的公路旅行后，她彻底洗了一次车。"
    },
    {
      "pos": "noun",
      "explanation_en": "A flow or movement of water or other liquid, especially one that is strong or sweeping, such as ocean waves or a flood.",
      "explanation_cn": "水或其他液体的流动或涌动，尤指强劲或席卷式的，如海浪或洪水。",
      "example_en": "The beach was covered in a sudden wash of seawater during the storm.",
      "example_cn": "风暴期间，海滩被一阵突如其来的海水淹没。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of paint or color effect applied in broad, fluid strokes, often used in art to create soft transitions or gradients.",
      "explanation_cn": "一种在艺术中使用的、以宽广流畅笔触涂抹的颜料或色彩效果，常用于创造柔和的过渡或渐变。",
      "example_en": "The artist used a delicate wash of blue to suggest the distant horizon.",
      "example_cn": "艺术家用一层细腻的蓝色水彩来表现远处的地平线。"
    },
    {
      "pos": "verb",
      "explanation_en": "To clean something by applying water or another liquid and often scrubbing or rinsing it, typically to remove dirt or contaminants.",
      "explanation_cn": "通过施加水或其他液体并常常加以擦洗或冲洗来清洁某物，通常用于去除污垢或污染物。",
      "example_en": "He washes his hands before every meal.",
      "example_cn": "他每顿饭前都会洗手。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be carried away or removed by a flow of liquid, especially water, as in erosion or flooding.",
      "explanation_cn": "被液体（尤指水）的流动冲走或移除，如侵蚀或洪水造成的现象。",
      "example_en": "The floodwaters washed away the bridge completely.",
      "example_cn": "洪水完全冲走了这座桥。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "clean",
      "analysis": "“Clean” (清洁) 是一个更广泛的术语，泛指去除污垢或杂质，可以使用各种方法（如擦拭、吸尘、消毒），不一定涉及液体。而 “wash” 特指使用液体（尤其是水）进行清洁，强调物理冲刷过程。"
    },
    {
      "word_to_compare": "rinse",
      "analysis": "“Rinse” (漂洗) 指用少量水快速冲洗以去除残留物，通常是清洁过程的最后一步，动作较轻、时间短。而 “wash” 包含更全面的清洁动作，可能包括擦洗、浸泡和多次冲洗。"
    },
    {
      "word_to_compare": "flush",
      "analysis": "“Flush” (冲刷) 强调用大量液体迅速冲走某物，常用于厕所、管道或紧急清除场景，带有强烈、突然的冲击感。而 “wash” 更中性，可指日常、温和或彻底的清洁行为。"
    }
  ]
}