{
  "word": "washington",
  "pronunciation": "wosh·ing·ton",
  "concise_definition": "n. 华盛顿（美国首都/州名/人物名）",
  "forms": {
    "plural": "washingtons"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The capital city of the United States of America, located on the Potomac River, serving as the seat of the federal government and home to key institutions such as the White House, the U.S. Capitol, and the Supreme Court.",
      "explanation_cn": "美利坚合众国的首都，位于波托马克河畔，是联邦政府的所在地，拥有白宫、美国国会大厦和最高法院等重要机构。",
      "example_en": "Many international diplomats are stationed in Washington to engage with U.S. policymakers.",
      "example_cn": "许多国际外交官常驻华盛顿，以便与美国政策制定者进行沟通。"
    },
    {
      "pos": "noun",
      "explanation_en": "A state in the northwestern United States, bordered by Oregon to the south, Idaho to the east, and the Pacific Ocean to the west, known for its technology industry, agriculture, and natural landscapes.",
      "explanation_cn": "美国西北部的一个州，南接俄勒冈州，东邻爱达荷州，西濒太平洋，以科技产业、农业和自然景观著称，西雅图和微软总部均位于此。",
      "example_en": "Washington State is famous for its apples and the birthplace of Starbucks.",
      "example_cn": "华盛顿州以苹果和星巴克的发源地而闻名。"
    },
    {
      "pos": "noun",
      "explanation_en": "George Washington (1732–1799), the first President of the United States, a Founding Father, and commander-in-chief of the Continental Army during the American Revolutionary War.",
      "explanation_cn": "乔治·华盛顿（1732–1799），美国第一任总统，开国元勋之一，美国独立战争期间大陆军总司令，被尊称为‘美国国父’。",
      "example_en": "George Washington's leadership during the Revolution helped secure American independence.",
      "example_cn": "乔治·华盛顿在革命期间的领导帮助美国赢得了独立。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "capital",
      "analysis": "“Capital”（首都）是一个通用术语，指任何国家或地区政治中心的城市，如巴黎是法国的首都。而 “Washington” 是一个专有名词，特指美国的首都，具有唯一性和文化象征意义，不能与其他首都互换使用。"
    },
    {
      "word_to_compare": "state",
      "analysis": "“State”（州）是美国联邦体系中的行政单位，如加利福尼亚州、得克萨斯州。而 “Washington” 作为州名时，特指美国西北部的华盛顿州，是唯一一个以国家领导人命名的州，具有历史特殊性。"
    },
    {
      "word_to_compare": "president",
      "analysis": "“President”（总统）是职位名称，泛指国家元首。而 “Washington” 在此语境下特指乔治·华盛顿这个人，是历史上第一位美国总统，其名字已成为美国建国精神的代名词，远超一般职位称谓的含义。"
    }
  ]
}