{
  "word": "washing",
  "pronunciation": "wosh·ing",
  "concise_definition": "n. 洗涤, 洗衣, 清洗; v. 洗 (wash 的现在分词)",
  "forms": {
    "base_form": "wash",
    "third_person_singular": "washes",
    "past_tense": "washed",
    "past_participle": "washed",
    "present_participle": "washing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act or process of cleaning something, especially clothes or dishes, using water and often soap or detergent.",
      "explanation_cn": "指使用水和（通常）肥皂或洗涤剂清洁某物（尤其是衣物或餐具）的行为或过程。",
      "example_en": "She did the washing before going to work.",
      "example_cn": "她上班前把衣服洗了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A batch or load of clothes that are washed together in a washing machine.",
      "explanation_cn": "指一次在洗衣机中一起清洗的衣物批次或一 loads。",
      "example_en": "I have a large washing to do this weekend.",
      "example_cn": "这个周末我有一大堆衣服要洗。"
    },
    {
      "pos": "noun",
      "explanation_en": "A cleaning process applied to a surface or object to remove dirt, grease, or contaminants, often in industrial or medical contexts.",
      "explanation_cn": "指为去除污垢、油脂或污染物而对表面或物体进行的清洁程序，常用于工业或医疗环境。",
      "example_en": "The surgical instruments underwent a strict washing procedure before sterilization.",
      "example_cn": "手术器械在灭菌前经过严格的清洗程序。"
    },
    {
      "pos": "noun",
      "explanation_en": "A metaphorical use referring to a public exposure or scrutiny that reveals wrongdoing or corruption, often in political or media contexts.",
      "explanation_cn": "比喻性用法，指在政治或媒体语境中对不当行为或腐败行为的公开揭露或审查。",
      "example_en": "The scandal led to a full washing of the department's dirty laundry.",
      "example_cn": "这场丑闻导致该部门的丑闻被彻底曝光。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cleaning",
      "analysis": "“Cleaning”（清洁）是一个更广泛的术语，泛指任何去除污垢或杂质的行为，包括扫地、擦窗、吸尘等，不限于用水。而 “washing” 特指使用水和清洁剂的清洗方式，范围更窄、更具体。"
    },
    {
      "word_to_compare": "laundry",
      "analysis": "“Laundry”（待洗的衣物）通常指需要清洗的衣物集合，是一个名词性实体，而 “washing” 可以指清洗这个动作本身，也可以指一次洗衣任务。在英式英语中，“washing” 常作为 “laundry” 的同义词使用，但在美式英语中，“laundry” 更常用。"
    },
    {
      "word_to_compare": "rinse",
      "analysis": "“Rinse”（漂洗）是清洗过程中的一个子步骤，指用清水冲走肥皂或污垢，不包含使用清洁剂的主清洗过程。而 “washing” 包含了从使用清洁剂到最终漂洗的完整过程。"
    }
  ]
}