{
  "word": "wasted",
  "pronunciation": "wes·tid",
  "concise_definition": "adj. 浪费的, 荒废的, 醉酒的; v. 浪费 (waste 的过去式和过去分词)",
  "forms": {
    "base_form": "waste",
    "past_tense": "wasted",
    "past_participle": "wasted",
    "present_participle": "wasting",
    "third_person_singular": "wastes"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing something that has been used carelessly or inefficiently, resulting in loss or uselessness, especially resources such as time, money, or energy.",
      "explanation_cn": "形容某物被粗心或低效地使用，导致资源（如时间、金钱、精力）的浪费或无用。",
      "example_en": "It's a wasted opportunity to miss such a rare chance.",
      "example_cn": "错过如此难得的机会真是浪费。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing a person who is drunk or under the influence of drugs, often to the point of being incapacitated or unresponsive.",
      "explanation_cn": "形容一个人醉酒或吸毒后处于失去行动或反应能力的状态。",
      "example_en": "He was wasted at the party and couldn't even stand up.",
      "example_cn": "他在派对上喝得烂醉，连站都站不起来。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing land or a place that is unused, barren, or neglected, often appearing desolate or unproductive.",
      "explanation_cn": "形容土地或地方未被使用、荒芜或被忽视，常显得荒凉或无生产力。",
      "example_en": "The abandoned factory stood amid wasted fields.",
      "example_cn": "废弃的工厂矗立在一片荒芜的田野之中。"
    },
    {
      "pos": "verb",
      "explanation_en": "To use something carelessly or unnecessarily, causing it to be lost, destroyed, or rendered useless.",
      "explanation_cn": "指粗心或不必要地使用某物，导致其丧失、毁坏或变得无用。",
      "example_en": "Don't waste water by leaving the tap running.",
      "example_cn": "别让水龙头一直开着，浪费水资源。"
    },
    {
      "pos": "verb",
      "explanation_en": "To spend time idly or unproductively, often implying regret or loss of potential.",
      "explanation_cn": "指无所事事地消磨时间，常暗示对潜在价值的浪费与遗憾。",
      "example_en": "She wasted hours scrolling through social media instead of studying.",
      "example_cn": "她浪费了数小时刷社交媒体，而不是学习。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "squandered",
      "analysis": "“Squandered” (挥霍) 比 “wasted” 更强调因愚蠢或奢侈而将宝贵资源（如金钱、机会）彻底挥霍掉，带有更强的道德谴责意味。而 “wasted” 更中性，可泛指任何形式的无谓消耗。"
    },
    {
      "word_to_compare": "consumed",
      "analysis": "“Consumed” (消耗) 是中性词，仅表示使用或耗尽某物，不隐含浪费。例如：燃料被消耗、时间被消耗。而 “wasted” 暗示这种消耗是不必要的、低效的或有害的。"
    },
    {
      "word_to_compare": "drunk",
      "analysis": "“Drunk” (喝醉的) 是描述醉酒状态的直接形容词，而 “wasted” 是口语化表达，程度更深，常暗示完全失去控制、神志不清，语气更强烈、更俚语化。"
    }
  ]
}