{
  "word": "wastes",
  "pronunciation": "weysts",
  "concise_definition": "n. 浪费, 废物, 荒地; v. 浪费, 耗尽, 使衰弱",
  "forms": {
    "singular": "waste",
    "third_person_singular": "wastes",
    "past_tense": "wasted",
    "past_participle": "wasted",
    "present_participle": "wasting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Unused or discarded material, especially when considered worthless or harmful; byproducts of a process that have no economic value.",
      "explanation_cn": "指未被使用或被丢弃的物质，尤其是被视为无价值或有害的副产品；生产过程中产生的无经济价值的残留物。",
      "example_en": "The factory was fined for dumping industrial wastes into the river.",
      "example_cn": "该工厂因将工业废物倾倒入河中而被罚款。"
    },
    {
      "pos": "noun",
      "explanation_en": "A barren or uncultivated area of land, often unused or neglected.",
      "explanation_cn": "指荒芜、未开垦或被忽视的土地。",
      "example_en": "The old mining site is now a wasteland covered in rubble and weeds.",
      "example_cn": "旧矿区如今成了一片布满碎石和杂草的荒地。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or instance of using something carelessly or inefficiently, resulting in loss or destruction of resources.",
      "explanation_cn": "指因粗心或低效地使用而造成资源损失或破坏的行为或事例。",
      "example_en": "The waste of food in wealthy countries is a global ethical issue.",
      "example_cn": "富裕国家的食物浪费是一个全球性的伦理问题。"
    },
    {
      "pos": "verb",
      "explanation_en": "To use or expend something carelessly, inefficiently, or unnecessarily, especially time, energy, money, or resources.",
      "explanation_cn": "指粗心、低效或不必要地使用或消耗某物，尤指时间、精力、金钱或资源。",
      "example_en": "Don't waste your talent on trivial pursuits.",
      "example_cn": "不要把你的才华浪费在琐碎的事情上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause someone or something to become weaker, thinner, or less healthy over time, often due to illness, lack of nourishment, or emotional distress.",
      "explanation_cn": "指因疾病、营养不良或情绪困扰等原因，使某人或某物逐渐变得虚弱、消瘦或不健康。",
      "example_en": "The disease wasted away his strength over several months.",
      "example_cn": "这种疾病在数月内耗尽了他的体力。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "trash",
      "analysis": "“Trash”（垃圾）通常指日常生活中可直接丢弃的固体废弃物，如纸张、塑料袋等，语义更具体、更偏向生活化。而 “waste” 范围更广，可包括工业废料、能源浪费、时间浪费等抽象或非固体形式的浪费。"
    },
    {
      "word_to_compare": "debris",
      "analysis": "“Debris”（残骸、碎片）特指爆炸、灾难或破坏后遗留的破碎物质，如建筑废墟、车祸残片，强调物理形态的破碎性。而 “waste” 更强调“无用性”或“被丢弃”的状态，不一定是破碎的。"
    },
    {
      "word_to_compare": "squander",
      "analysis": "“Squander”（挥霍）专指奢侈、鲁莽地浪费资源（如金钱、机会），带有强烈的负面道德评判，常用于抽象资源。而 “waste” 更中性，可涵盖无意或无意图的消耗，语义范围更广。"
    }
  ]
}