{
  "word": "watch",
  "pronunciation": "wotch",
  "concise_definition": "v. 观察, 注视, 看管; n. 手表, 观察, 警戒",
  "forms": {
    "third_person_singular": "watches",
    "past_tense": "watched",
    "past_participle": "watched",
    "present_participle": "watching"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To look at or observe someone or something carefully over a period of time, often to monitor behavior, changes, or events.",
      "explanation_cn": "指在一段时间内仔细观看或观察某人或某物，通常是为了监控行为、变化或事件。",
      "example_en": "The security guard watched the entrance all night.",
      "example_cn": "保安整晚都在监视入口。"
    },
    {
      "pos": "verb",
      "explanation_en": "To take care of or be responsible for someone or something, especially in the absence of the owner or primary caretaker.",
      "explanation_cn": "指在主人或主要看护者不在时，负责照看某人或某物。",
      "example_en": "Can you watch my dog while I'm on vacation?",
      "example_cn": "我度假时你能帮我照看下我的狗吗？"
    },
    {
      "pos": "verb",
      "explanation_en": "To be attentive to or heed something, especially a warning, instruction, or upcoming event.",
      "explanation_cn": "指留心、注意某事，尤其是警告、指示或即将发生的事件。",
      "example_en": "Watch your step — the floor is slippery.",
      "example_cn": "当心脚下——地板很滑。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small timepiece worn on the wrist or carried in a pocket, used to tell time.",
      "explanation_cn": "一种戴在手腕上或放在口袋里的小型计时装置，用于显示时间。",
      "example_en": "He bought a luxury watch for his anniversary.",
      "example_cn": "他为纪念日买了一块奢侈手表。"
    },
    {
      "pos": "noun",
      "explanation_en": "A period of time during which someone is on duty to observe or guard, especially in military or maritime contexts.",
      "explanation_cn": "指在军事或航海语境中，某人负责观察或警戒的一段时间。",
      "example_en": "The sailors stood watch from midnight to four in the morning.",
      "example_cn": "水手们从午夜到凌晨四点值勤。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "observe",
      "analysis": "“Observe” (观察) 更正式，强调系统性、科学性或客观性的观察，常用于科研、法律或学术语境。而 “watch” 更日常，强调持续性的视觉关注，可能带有情感或警觉色彩。"
    },
    {
      "word_to_compare": "see",
      "analysis": "“See” (看见) 是被动的视觉感知，不强调注意力或持续性；而 “watch” 是主动的、有意识的、持续的注视。例如：I saw a bird fly by（我瞥见一只鸟飞过） vs. I watched the bird build its nest（我看着那只鸟筑巢）。"
    },
    {
      "word_to_compare": "timepiece",
      "analysis": "“Timepiece” (计时器) 是一个更广义的术语，泛指所有用于计时的装置，包括钟、表、沙漏等。而 “watch” 特指便携式、可佩戴的计时器，语义更具体。"
    }
  ]
}