{
  "word": "water",
  "pronunciation": "waw·tər",
  "concise_definition": "n. 水, 液体; v. 浇水, 淹没, 稀释",
  "forms": {
    "plural": "waters"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A clear, colorless, odorless, and tasteless liquid essential for the survival of most living organisms, composed of hydrogen and oxygen (H₂O), and found in oceans, rivers, lakes, and rain.",
      "explanation_cn": "一种清澈、无色、无味、无臭的液体，对大多数生物的生存至关重要，由氢和氧组成（H₂O），存在于海洋、河流、湖泊和雨水之中。",
      "example_en": "She drank a glass of water after her morning run.",
      "example_cn": "她晨跑后喝了一杯水。"
    },
    {
      "pos": "noun",
      "explanation_en": "A body of water such as a sea, lake, or river, often used to refer to a specific area or jurisdiction (e.g., territorial waters).",
      "explanation_cn": "指一片水域，如海洋、湖泊或河流，常用于指特定区域或管辖范围（如领海）。",
      "example_en": "The fishing boats returned from the waters off the coast.",
      "example_cn": "渔船从近海海域返航。"
    },
    {
      "pos": "verb",
      "explanation_en": "To supply water to plants or land, especially to promote growth or prevent drying out.",
      "explanation_cn": "向植物或土地供水，尤其是为了促进生长或防止干枯。",
      "example_en": "The gardener watered the flowers every evening.",
      "example_cn": "园丁每天晚上给花浇水。"
    },
    {
      "pos": "verb",
      "explanation_en": "To become filled or covered with water, often unintentionally or due to flooding.",
      "explanation_cn": "被水充满或覆盖，通常是非故意的或因洪水所致。",
      "example_en": "The basement watered during the heavy rainstorm.",
      "example_cn": "暴雨期间，地下室被淹了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To dilute or thin a substance by adding water, often to reduce strength or concentration.",
      "explanation_cn": "通过加水来稀释或减弱某种物质的浓度或强度。",
      "example_en": "He watered down the whiskey to make it last longer.",
      "example_cn": "他把威士忌兑水，以延长饮用时间。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "liquid",
      "analysis": "“Liquid”（液体）是一个更广泛的类别，指任何具有流动性、无固定形状的物质，包括油、酒精、果汁等。而 “water” 是一种特定的液体，是地球上生命存在的基础，具有独特的化学性质（H₂O）和普遍的日常用途。"
    },
    {
      "word_to_compare": "moisture",
      "analysis": "“Moisture”（湿气/水分）指微量的水，通常以气态或吸附态存在于空气、土壤或物体表面，强调的是“存在感”而非“可饮用或可测量的水体”。而 “water” 指的是可感知、可量化的液态水，如一杯水或一条河。"
    },
    {
      "word_to_compare": "aqueous",
      "analysis": "“Aqueous”（水的，含水的）是一个形容词，用于科学语境中描述以水为溶剂或主要成分的溶液（如 aqueous solution）。它不是名词，也不用于日常语境，而 “water” 是日常和科学语境中通用的名词，指物质本身。"
    }
  ]
}