{
  "word": "waterproof",
  "pronunciation": "wɔːtərˌpruːf",
  "concise_definition": "adj. 防水的, 防水材料的; v. 使防水",
  "forms": {
    "comparative": "waterproofer",
    "superlative": "waterproofest",
    "verb_third_person_singular": "waterproofs",
    "verb_past_tense": "waterproofed",
    "verb_past_participle": "waterproofed",
    "verb_present_participle": "waterproofing"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Designed or treated to prevent water from penetrating or damaging the material, ensuring complete resistance to water exposure under normal conditions.",
      "explanation_cn": "经过设计或处理以防止水渗透或损坏材料，确保在正常条件下完全抵御水的侵袭。",
      "example_en": "This jacket is waterproof, so you can wear it in heavy rain without getting wet.",
      "example_cn": "这件夹克是防水的，所以你在大雨中穿着也不会湿。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Capable of withstanding prolonged contact with water without degradation, often used to describe watches, electronics, or outdoor gear.",
      "explanation_cn": "能够长时间接触水而不受损，常用于描述手表、电子产品或户外装备。",
      "example_en": "The smartphone has a waterproof rating of IP68, meaning it can survive being submerged in water for 30 minutes.",
      "example_cn": "这款智能手机具有IP68防水等级，意味着它可以在水中浸泡30分钟而不损坏。"
    },
    {
      "pos": "verb",
      "explanation_en": "To treat or coat a material with a substance that makes it resistant to water penetration.",
      "explanation_cn": "通过涂覆某种物质使材料具有防水性能。",
      "example_en": "They waterproofed the wooden deck with a special sealant to protect it from rain and snow.",
      "example_cn": "他们用一种特殊的密封剂对木制甲板进行了防水处理，以保护其免受雨雪侵蚀。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "water-resistant",
      "analysis": "“Water-resistant”（防水的）表示材料能抵抗一定程度的水接触，但并非完全阻止水渗透，通常适用于轻度溅水或短时间暴露。而 “waterproof” 表示在正常条件下完全阻止水渗透，防护等级更高，适用于更严苛的环境，如深水浸泡或持续降雨。"
    },
    {
      "word_to_compare": "water-repellent",
      "analysis": "“Water-repellent”（疏水的）强调水在表面形成水珠并滚落，是一种表面特性，常用于织物处理，但不一定能阻止水在压力或长时间接触下渗入。而 “waterproof” 是结构性的防护，即使在水压下也能保持内部干燥，防护能力更强。"
    },
    {
      "word_to_compare": "impermeable",
      "analysis": "“Impermeable”（不透水的）是一个更广义的科学术语，指任何物质完全不允许液体或气体通过，适用于物理、化学或地质语境。而 “waterproof” 是日常用语，特指针对水的防护，语义范围更窄、更实用。"
    }
  ]
}