{
  "word": "waters",
  "pronunciation": "waw·tərz",
  "concise_definition": "n. 水域, 水体, (复数形式) 液体, (尤指) 海洋, 河流",
  "forms": {
    "singular": "water"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Plural form of 'water' used to refer to a body of water, especially when emphasizing its extent, location, or legal/territorial significance; often used in geographical, nautical, or political contexts.",
      "explanation_cn": "“water”的复数形式，用于指代一片水域，尤其强调其范围、地理位置或法律/领土意义；常用于地理、航海或政治语境中。",
      "example_en": "The ship sailed through international waters beyond any nation's jurisdiction.",
      "example_cn": "这艘船航行在任何国家管辖范围之外的公海上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A collective term for various types of liquids, especially in formal, literary, or archaic usage; can refer to bodily fluids, medicinal liquids, or metaphorical 'fluids' of life.",
      "explanation_cn": "在正式、文学或古语用法中，作为各种液体的总称；可指体液、药液，或隐喻性的生命之液。",
      "example_en": "The old healer prepared his potions from the purest waters of the mountain spring.",
      "example_cn": "这位老药师用山泉最纯净的水配制他的药剂。"
    },
    {
      "pos": "noun",
      "explanation_en": "Used in idiomatic expressions to denote a specific type of water or its characteristics, such as 'deep waters' (dangerous situations) or 'troubled waters' (unstable conditions).",
      "explanation_cn": "用于习语中，表示某种特定类型的水或其特性，如 'deep waters'（危险境地）或 'troubled waters'（不稳定状况）。",
      "example_en": "He was in deep waters after the scandal broke out.",
      "example_cn": "丑闻曝光后，他陷入了困境。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "water",
      "analysis": "“Water” 是不可数名词，泛指水这种物质，不强调具体区域或数量。而 “waters” 作为复数形式，通常指具体的水域、水体或具有地理/法律意义的水区，具有更强的语境指向性。"
    },
    {
      "word_to_compare": "liquid",
      "analysis": "“Liquid” (液体) 是一个更广泛的科学术语，涵盖所有呈液态的物质（如酒精、油、果汁），而 “waters” 通常特指水或水状液体，语义范围更窄，且常带文学或传统色彩。"
    },
    {
      "word_to_compare": "sea",
      "analysis": "“Sea” (海洋) 指特定的大型咸水体，如地中海、南海，是地理实体；而 “waters” 可以是海、河、湖甚至人工水体，范围更广，且常用于法律或政治语境中（如专属经济水域）。"
    }
  ]
}