{
  "word": "waves",
  "pronunciation": "weyvz",
  "concise_definition": "n. 波浪, 波动; v. 挥动, 波动",
  "forms": {
    "singular": "wave",
    "third_person_singular": "waves",
    "past_tense": "waved",
    "past_participle": "waved",
    "present_participle": "waving"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A moving ridge or swell on the surface of a liquid, especially the sea or an ocean, caused by wind or other disturbances.",
      "explanation_cn": "液体表面（尤其是海洋或大海）因风或其他扰动而形成的波动或隆起的水脊。",
      "example_en": "The surfers rode the large waves off the coast of Hawaii.",
      "example_cn": "冲浪者在夏威夷海岸驾驭着巨大的海浪。"
    },
    {
      "pos": "noun",
      "explanation_en": "A long, undulating movement or series of movements, often used metaphorically to describe a surge of emotion, activity, or people.",
      "explanation_cn": "一种长而起伏的运动或一系列运动，常用于比喻情绪、活动或人群的涌动。",
      "example_en": "A wave of nostalgia swept over her as she heard the old song.",
      "example_cn": "当她听到那首老歌时，一股怀旧之情涌上心头。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of electromagnetic radiation, such as radio waves, light waves, or sound waves, that transmits energy through space.",
      "explanation_cn": "一种通过空间传播能量的电磁辐射，如无线电波、光波或声波。",
      "example_en": "The radio station broadcasts its signal using microwave waves.",
      "example_cn": "该电台使用微波传输信号。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move one's hand or an object back and forth repeatedly, typically as a gesture of greeting, farewell, or attention.",
      "explanation_cn": "反复地挥动某人的手或某个物体，通常作为打招呼、告别或引起注意的手势。",
      "example_en": "She waved goodbye as the train pulled out of the station.",
      "example_cn": "火车驶离站台时，她挥手告别。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move in a wavelike pattern, often describing the motion of hair, flags, or water.",
      "explanation_cn": "以波浪状的方式移动，常用于描述头发、旗帜或水的波动。",
      "example_en": "The tall grass waved gently in the breeze.",
      "example_cn": "高高的草在微风中轻轻摇曳。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "surge",
      "analysis": "“Surge”（激增/涌动）强调一种突然、强烈且通常短暂的增加或流动，常用于描述情绪、电流或人群的爆发性运动。而 “wave” 更强调周期性、连续性和形态上的起伏，既可以是物理的（如海浪），也可以是抽象的（如一波浪潮）。"
    },
    {
      "word_to_compare": "ripple",
      "analysis": "“Ripple”（涟漪）指小而轻微的波纹，通常由小规模扰动引起，范围有限，语气柔和。而 “wave” 可以是大而有力的，具有更广泛的影响力和视觉冲击力。例如，湖面的涟漪 vs. 海洋的巨浪。"
    },
    {
      "word_to_compare": "oscillation",
      "analysis": "“Oscillation”（振荡）是物理学中的专业术语，指物体在固定点附近来回规律性运动，强调周期性和对称性。它更精确、更技术化，而 “wave” 是日常语言中更通用的词，可涵盖非规律性、非对称性的波动，如情绪波动或人群流动。"
    }
  ]
}