{
  "word": "wave",
  "pronunciation": "weyv",
  "concise_definition": "n. 波浪, 潮汐, 挥手; v. 挥动, 波动, 招手",
  "forms": {
    "third_person_singular": "waves",
    "past_tense": "waved",
    "past_participle": "waved",
    "present_participle": "waving",
    "plural": "waves"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A moving ridge or swell on the surface of water, caused by wind or other disturbances, often characterized by a regular up-and-down motion.",
      "explanation_cn": "指水面上因风或其他扰动形成的起伏波浪，通常具有规律的上下运动。",
      "example_en": "The surfers rode the large waves off the coast of Hawaii.",
      "example_cn": "冲浪者在夏威夷海岸驾驭着巨大的海浪。"
    },
    {
      "pos": "noun",
      "explanation_en": "A motion or movement that resembles a wave, such as a crowd doing the wave in a stadium or a ripple effect spreading through a group.",
      "explanation_cn": "指类似波浪的运动，例如体育场内人群做的‘人浪’，或某种影响在群体中扩散的涟漪效应。",
      "example_en": "A wave of applause swept through the theater after the performance.",
      "example_cn": "演出结束后，一阵掌声席卷了整个剧院。"
    },
    {
      "pos": "noun",
      "explanation_en": "A signal or gesture made by moving the hand back and forth, typically to greet, bid farewell, or attract attention.",
      "explanation_cn": "指通过手部前后摆动做出的示意动作，通常用于打招呼、告别或吸引注意。",
      "example_en": "She gave a friendly wave as the train pulled away.",
      "example_cn": "火车开走时，她友好地挥了挥手。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move something, especially the hand or a flag, back and forth in a regular or sweeping motion.",
      "explanation_cn": "指使某物（尤其是手或旗帜）做有规律或宽幅的前后摆动。",
      "example_en": "He waved his arms to get the driver's attention.",
      "example_cn": "他挥动双臂以引起司机的注意。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to move in waves or undulations, such as hair, fabric, or sound waves.",
      "explanation_cn": "指使某物（如头发、布料或声波）呈现波浪状或起伏的运动。",
      "example_en": "The wind made the wheat fields wave like an ocean.",
      "example_cn": "风吹得麦田如海洋般起伏荡漾。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause a signal, emotion, or trend to spread rapidly through a group or population.",
      "explanation_cn": "指使某种信号、情绪或趋势在群体或人群中迅速传播。",
      "example_en": "A wave of panic spread through the building when the alarm sounded.",
      "example_cn": "警报响起时，恐慌情绪迅速在大楼内蔓延。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ripple",
      "analysis": "“Ripple”（涟漪）指小而轻微的波纹，通常用于描述水面或情绪的微小波动，强调范围小、强度弱。而 “wave” 可以是大而有力的，涵盖从物理波浪到社会情绪的广泛含义，范围更广、强度更强。"
    },
    {
      "word_to_compare": "tide",
      "analysis": "“Tide”（潮汐）特指由月球引力引起的海水周期性涨落，具有规律性和自然力量的含义，常用于比喻不可阻挡的潮流。而 “wave” 更强调单次或局部的波动，不具周期性，也不一定与自然力相关。"
    },
    {
      "word_to_compare": "gesture",
      "analysis": "“Gesture”（手势）是更广泛的术语，泛指任何用身体动作表达意图或情感的行为，包括点头、挥手、耸肩等。而 “wave” 作为动词或名词时，特指手部的前后摆动这一具体手势，是 “gesture” 的一种子类型。"
    }
  ]
}