{
  "word": "wayward",
  "pronunciation": "way·wurd",
  "concise_definition": "adj. 任性的, 顽固的, 难以控制的",
  "forms": {
    "comparative": "waywarder",
    "superlative": "waywardest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Behaving in a stubborn, unpredictable, or uncontrolled manner, often contrary to authority, rules, or expectations; especially describing someone who refuses to conform or follow guidance.",
      "explanation_cn": "行为固执、不可预测或难以控制，常违背权威、规则或期望；尤其用于描述拒绝服从或听从指导的人。",
      "example_en": "The wayward teenager refused to follow his parents' rules and ran away from home.",
      "example_cn": "这个任性的少年拒绝遵守父母的规定，离家出走了。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Moving or turning in an unpredictable or uncontrolled direction, often deviating from a set course or path; used for objects, systems, or natural phenomena.",
      "explanation_cn": "以不可预测或失控的方式移动或转向，常偏离既定路线或方向；用于描述物体、系统或自然现象。",
      "example_en": "The wayward wind caused the sailboat to drift far off its intended course.",
      "example_cn": "突如其来的风使帆船偏离了预定航线。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by erratic or capricious behavior, often implying a lack of discipline or moral direction; can describe habits, tendencies, or systems.",
      "explanation_cn": "以反复无常或任性妄为为特征，常暗示缺乏纪律或道德方向；可用于描述习惯、倾向或系统。",
      "example_en": "Her wayward spending habits led to serious financial trouble.",
      "example_cn": "她挥霍无度的消费习惯导致了严重的财务困境。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rebellious",
      "analysis": "“Rebellious” (叛逆的) 强调有意识地反抗权威或既定秩序，通常带有政治、社会或道德上的对抗意图。而 “wayward” 更侧重于行为的不可预测和失控，未必出于反抗动机，可能只是任性或缺乏自制力。"
    },
    {
      "word_to_compare": "headstrong",
      "analysis": "“Headstrong” (固执的) 指坚持己见、不愿听从劝告，通常带有主观意志的坚定性，有时甚至带有正面的“有主见”含义。而 “wayward” 更强调偏离正轨、行为散漫，常含贬义，暗示缺乏方向感或责任感。"
    },
    {
      "word_to_compare": "erratic",
      "analysis": "“Erratic” (不稳定的) 描述行为、模式或系统缺乏规律性或一致性，侧重于可预测性的缺失，常用于科学或技术语境。而 “wayward” 不仅指不稳定，还隐含道德或行为上的偏离，带有更强的情感色彩和主观评价。"
    }
  ]
}