{
  "word": "weaving",
  "pronunciation": "wēv·iŋ",
  "concise_definition": "n. 编织, 织造; v. 编织, 编织成, 编织出",
  "forms": {
    "base_form": "weave",
    "third_person_singular": "weaves",
    "past_tense": "wove",
    "past_participle": "woven",
    "present_participle": "weaving"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The process or art of interlacing threads, yarns, or strips to form fabric or other structures, typically on a loom.",
      "explanation_cn": "指通过将纱线、线或条带相互交织以形成织物或其他结构的过程或技艺，通常在织布机上进行。",
      "example_en": "The museum showcases ancient weaving techniques from across Asia.",
      "example_cn": "博物馆展出了来自亚洲各地的古老编织技艺。"
    },
    {
      "pos": "noun",
      "explanation_en": "A pattern or structure formed by interlacing elements, often used metaphorically to describe complex arrangements in narratives, systems, or relationships.",
      "explanation_cn": "指由交错元素构成的图案或结构，常用于比喻叙事、系统或关系中的复杂交织。",
      "example_en": "The novel’s plot is a masterful weaving of mystery, romance, and historical detail.",
      "example_cn": "这部小说的情节是悬疑、爱情与历史细节的精妙交织。"
    },
    {
      "pos": "verb",
      "explanation_en": "To form fabric by interlacing threads or yarns, typically on a loom.",
      "explanation_cn": "指在织布机上通过交织纱线或线来制作织物。",
      "example_en": "She spends her evenings weaving tapestries by hand.",
      "example_cn": "她每晚都亲手编织挂毯。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or cause to move in a winding or zigzag pattern, often to avoid something or to create a fluid motion.",
      "explanation_cn": "指以蜿蜒或之字形的方式移动，或使某物如此移动，常用于躲避或营造流畅的动态。",
      "example_en": "The car weaved through the heavy traffic on the highway.",
      "example_cn": "汽车在高速公路上的车流中穿梭而行。"
    },
    {
      "pos": "verb",
      "explanation_en": "To combine or integrate various elements into a coherent whole, especially in storytelling, music, or ideas.",
      "explanation_cn": "指将多种元素融合成一个连贯的整体，尤用于叙事、音乐或思想中。",
      "example_en": "The director weaved together interviews, archival footage, and reenactments to tell the story.",
      "example_cn": "导演将采访、档案影像与重现片段交织在一起，讲述了这个故事。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "knitting",
      "analysis": "“Knitting”（针织）是通过用针将线圈相互穿套形成织物，通常使用单根或多根针，结构呈环状；而 “weaving”（编织）是通过经线与纬线在织布机上垂直交叉形成平面织物，结构更紧密、更稳定。两者虽都属纺织工艺，但方法与成品特性不同。"
    },
    {
      "word_to_compare": "braiding",
      "analysis": "“Braiding”（编辫）是将三股或更多股材料（如头发、绳索）平行交叉编成辫状结构，强调线性排列与重复交叉；而 “weaving” 是二维平面的交错，可形成大面积织物，结构更复杂多样，不限于线性形态。"
    },
    {
      "word_to_compare": "embroidering",
      "analysis": "“Embroidering”（刺绣）是在已有的织物上用线添加装饰性图案，属于附加性工艺；而 “weaving” 是在制造织物本身的过程中形成图案与结构，是基础性构造，而非后期装饰。"
    }
  ]
}