{
  "word": "wedge",
  "pronunciation": "wedj",
  "concise_definition": "n. 楔子, 楔形物; v. 楔入, 塞入",
  "forms": {
    "plural": "wedges",
    "third_person_singular": "wedges",
    "past_tense": "wedge",
    "past_participle": "wedge",
    "present_participle": "weding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A triangular or tapered object, typically made of wood, metal, or plastic, used to split, hold, or secure things in place by being driven into a space.",
      "explanation_cn": "一种三角形或锥形的物体，通常由木头、金属或塑料制成，用于通过插入缝隙来劈开、固定或支撑物品。",
      "example_en": "He used a wooden wedge to split the log.",
      "example_cn": "他用一个木楔子把原木劈开。"
    },
    {
      "pos": "noun",
      "explanation_en": "A narrow space or gap between two objects or groups, often implying separation or division.",
      "explanation_cn": "两个物体或群体之间的狭窄缝隙或间隔，常暗示分离或分裂。",
      "example_en": "There was a wedge of distrust between the two neighbors.",
      "example_cn": "两位邻居之间存在着不信任的裂痕。"
    },
    {
      "pos": "noun",
      "explanation_en": "A piece of food, especially cheese or cake, cut into a triangular shape.",
      "explanation_cn": "一种呈三角形切块的食物，尤指奶酪或蛋糕。",
      "example_en": "She served a wedge of sharp cheddar with the crackers.",
      "example_cn": "她用饼干配了一块浓郁的切达奶酪。"
    },
    {
      "pos": "verb",
      "explanation_en": "To force or press something tightly into a space, often using a wedge-shaped object or motion.",
      "explanation_cn": "用楔形物体或动作将某物强行挤入或塞入缝隙中。",
      "example_en": "She wedged the door open with a book.",
      "example_cn": "她用一本书把门顶住。"
    },
    {
      "pos": "verb",
      "explanation_en": "To insert oneself or something between two parties or elements, often to create division or gain advantage.",
      "explanation_cn": "将自己或某物插入两个群体或元素之间，常用于制造分裂或获取优势。",
      "example_en": "The mediator tried to wedge himself between the warring factions.",
      "example_cn": "调解人试图插在交战的派系之间。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "lever",
      "analysis": "“Lever”（杠杆）是一种利用支点来放大施力的工具，强调通过力学原理移动或抬起重物；而 “wedge” 是通过形状的物理插入来实现劈开或固定，不依赖支点，其作用是直接的挤压和分离。"
    },
    {
      "word_to_compare": "split",
      "analysis": "“Split”（分裂）是一个更通用的动词，指任何使整体分离的行为，可以是自然的、抽象的或物理的；而 “wedge” 作为动词特指通过插入楔形物或类似动作造成分离，强调工具和方式的物理性。"
    },
    {
      "word_to_compare": "gap",
      "analysis": "“Gap”（间隙）泛指任何两个事物之间的空隙，可以是空间、时间或抽象概念上的；而 “wedge” 作为名词特指一种狭窄、尖锐、常呈三角形的缝隙，且往往暗示是由外力插入造成的，具有更强的动态和结构性含义。"
    }
  ]
}