{
  "word": "wedges",
  "pronunciation": "wedj·iz",
  "concise_definition": "n. 楔子, 楔形物, 楔形部分",
  "forms": {
    "singular": "wedge"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A triangular or tapered object, typically made of wood, metal, or plastic, used to split, hold, or secure things in place by being driven into a space.",
      "explanation_cn": "一种三角形或锥形的物体，通常由木头、金属或塑料制成，用于通过插入缝隙中来劈开、固定或支撑物品。",
      "example_en": "He used a wooden wedge to split the log into smaller pieces.",
      "example_cn": "他用一个木楔将原木劈成更小的块。"
    },
    {
      "pos": "noun",
      "explanation_en": "A piece of food, especially cheese or cake, cut into a triangular shape.",
      "explanation_cn": "一种呈三角形切块的食物，尤指奶酪或蛋糕。",
      "example_en": "She served a slice of cheddar cheese in the shape of a wedge.",
      "example_cn": "她端上了一块切成楔形的切达奶酪。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of shoe with a thick, sloping sole that extends from the heel to the toe, providing height and stability.",
      "explanation_cn": "一种鞋底从脚跟到脚尖呈斜坡状加厚的鞋子，能增加高度并提供稳定性。",
      "example_en": "She wore stylish leather wedges to the summer party.",
      "example_cn": "她穿着时尚的皮革坡跟鞋参加了夏日派对。"
    },
    {
      "pos": "noun",
      "explanation_en": "A narrow strip or section of land, especially one that is surrounded or separated by other areas, such as a wedge of territory between two countries.",
      "explanation_cn": "一块狭窄的土地或区域，尤其是被其他区域包围或隔开的部分，例如两国之间的狭长领土。",
      "example_en": "A small wedge of land between the river and the highway was left undeveloped.",
      "example_cn": "河流与高速公路之间的一小块狭长土地未被开发。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "lever",
      "analysis": "“Lever”（杠杆）是一种利用支点来放大施加力的工具，其作用是通过旋转或移动来移动物体，而 “wedge” 是通过插入和挤压来产生分离或固定效果，两者虽都属于简单机械，但作用机制不同：杠杆是旋转力，楔子是推挤力。"
    },
    {
      "word_to_compare": "slice",
      "analysis": "“Slice”（薄片）指从整体上切下的扁平、薄层部分，通常用于食物或材料，强调厚度均匀；而 “wedge” 是三角形的切块，强调尖端和宽度变化，常用于圆形物体（如蛋糕、奶酪）的放射状切割。"
    },
    {
      "word_to_compare": "shim",
      "analysis": "“Shim”（垫片）是一种薄而扁平的材料，用于填补空隙、调整水平或固定位置，通常不具有锥形结构；而 “wedge” 是锥形的，依靠其斜面产生压力和锁定效果，功能上更侧重于主动分离或紧固，而非被动填充。"
    }
  ]
}