{
  "word": "weed",
  "pronunciation": "wēd",
  "concise_definition": "n. 杂草, 野草; v. 拔除杂草, 清除",
  "forms": {
    "third_person_singular": "weeds",
    "past_tense": "weeded",
    "past_participle": "weeded",
    "present_participle": "weeding",
    "plural": "weeds"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A plant that grows where it is not wanted, especially in gardens, farms, or lawns, often competing with cultivated plants for resources such as water, sunlight, and nutrients.",
      "explanation_cn": "指在不希望其生长的地方（如花园、农田或草坪）自然生长的植物，通常与栽培植物争夺水分、阳光和养分。",
      "example_en": "The garden was overrun with weeds after the summer rains.",
      "example_cn": "夏季降雨后，花园里长满了杂草。"
    },
    {
      "pos": "noun",
      "explanation_en": "Slang for marijuana, a psychoactive drug derived from the Cannabis plant.",
      "explanation_cn": "俚语，指大麻，一种从大麻植物中提取的精神活性药物。",
      "example_en": "He was arrested for possession of a small amount of weed.",
      "example_cn": "他因持有少量大麻而被逮捕。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove unwanted plants, especially from a garden, field, or other cultivated area, to protect desired crops or ornamental plants.",
      "explanation_cn": "指从花园、田地或其他栽培区域中清除不需要的植物，以保护农作物或观赏植物。",
      "example_en": "She spends every Saturday morning weeding the flower beds.",
      "example_cn": "她每个星期六早上都花时间给花坛除草。"
    },
    {
      "pos": "verb",
      "explanation_en": "To eliminate or remove unwanted people or things from a group, system, or organization, often in a selective or harsh manner.",
      "explanation_cn": "指从群体、系统或组织中有选择性地清除不想要的人或事物，常带有严厉或筛选的意味。",
      "example_en": "The company is weeding out underperforming employees before the merger.",
      "example_cn": "公司在合并前正在淘汰表现不佳的员工。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "grass",
      "analysis": "“Grass”（草）泛指草本植物，通常是中性或正面的词汇，如草坪草、牧草；而 “weed” 是贬义词，特指那些在人类环境中被视为干扰或有害的草本植物。并非所有草都是杂草，但所有杂草都是草。"
    },
    {
      "word_to_compare": "herb",
      "analysis": "“Herb”（香草/药草）通常指具有药用、调味或芳香价值的植物，常被人类有意种植；而 “weed” 强调的是植物的‘非意愿性’和‘侵扰性’。同一植物在不同语境下可能既是 herb 也是 weed，例如薄荷在厨房是 herb，在花园里可能成为 weed。"
    },
    {
      "word_to_compare": "remove",
      "analysis": "“Remove”（移除）是一个通用动词，指任何类型的清除行为，不涉及对象性质；而 “weed” 作为动词时，特指清除杂草或淘汰无用者，具有明确的语义焦点。在比喻义中，“weed out” 比 “remove” 更强调系统性筛选和淘汰的过程。"
    }
  ]
}