{
  "word": "wells",
  "pronunciation": "wels",
  "concise_definition": "n. 井, 泉源, 水源; v. (液体) 涌出, 涌现",
  "forms": {
    "singular": "well",
    "third_person_singular": "wells",
    "past_tense": "welled",
    "past_participle": "welled",
    "present_participle": "welling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A deep hole or shaft dug or drilled into the ground to access groundwater, often equipped with a pump or bucket for drawing water.",
      "explanation_cn": "指为获取地下水而挖掘或钻探的深孔或井筒，通常配备泵或水桶以抽取水源。",
      "example_en": "The villagers rely on a deep well for their daily water supply.",
      "example_cn": "村民们依靠一口深井获取日常用水。"
    },
    {
      "pos": "noun",
      "explanation_en": "A natural source of water or other liquid emerging from the ground, such as a spring or fountain.",
      "explanation_cn": "指从地下自然涌出的水或其他液体的源头，如泉眼或喷泉。",
      "example_en": "The ancient temple was built around a sacred well that never dried up.",
      "example_cn": "这座古庙是围绕着一口永不枯竭的圣泉建造的。"
    },
    {
      "pos": "noun",
      "explanation_en": "A source or reservoir of a particular quality or emotion, often used metaphorically (e.g., a well of patience, a well of sorrow).",
      "explanation_cn": "指某种品质或情感的源泉或储备，常用于比喻（如耐心的源泉、悲伤的海洋）。",
      "example_en": "She drew from a well of inner strength to get through the difficult times.",
      "example_cn": "她在艰难时期从内心的力量源泉中汲取勇气。"
    },
    {
      "pos": "verb",
      "explanation_en": "To flow or rise up from within, especially of a liquid or emotion, often suddenly or abundantly.",
      "explanation_cn": "指（液体或情感）从内部涌出，常突然或大量地涌现。",
      "example_en": "Tears welled up in her eyes as she listened to the heartfelt speech.",
      "example_cn": "她听着这番真挚的演讲，泪水在眼中涌起。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "spring",
      "analysis": "“Spring” (泉) 通常指自然形成的、持续涌出的水源，强调其天然性和流动性，常用于地理或诗意语境。而 “well” 更强调人为挖掘或钻探的结构，即使它涌出的是地下水。两者都可指水源，但 “well” 更具人工干预的特征。"
    },
    {
      "word_to_compare": "source",
      "analysis": "“Source” (源头) 是一个更广泛的抽象词，可指任何事物的起源，包括信息、灵感、能源等，不限于液体。而 “well” 作为名词时特指水或液体的物理来源，作为动词时强调涌出的动作，更具象、更感官化。"
    },
    {
      "word_to_compare": "gush",
      "analysis": "“Gush” (喷涌) 是一个动词，强调液体或情感猛烈、大量、快速地涌出，带有强烈的情感或物理冲击力。而 “well” 作为动词时，涌出的过程更缓慢、持续、温和，常用于描述逐渐积累后自然溢出的状态，如眼泪、情感或灵感。"
    }
  ]
}