{
  "word": "westminster",
  "pronunciation": "wes·tmin·s-tər",
  "concise_definition": "n. 威斯敏斯特（英国伦敦地名，指议会、大教堂等所在地）",
  "forms": {
    "plural": "Westminsters"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A historic district in London, England, known as the seat of the United Kingdom's government and home to the Palace of Westminster (Houses of Parliament), Westminster Abbey, and other key political and religious institutions.",
      "explanation_cn": "英国伦敦的一个历史区域，以英国政府所在地而闻名，拥有威斯敏斯特宫（议会大厦）、威斯敏斯特大教堂及其他重要的政治与宗教机构。",
      "example_en": "The Prime Minister delivered a speech outside Westminster Abbey after the state funeral.",
      "example_cn": "首相在国葬后于威斯敏斯特大教堂外发表了演讲。"
    },
    {
      "pos": "noun",
      "explanation_en": "A system or style of parliamentary democracy modeled after the British Parliament located in Westminster, often used to describe similar institutions in other countries.",
      "explanation_cn": "指以位于威斯敏斯特的英国议会为原型的议会民主制度，常用于描述其他国家类似的政治体制。",
      "example_en": "Canada's political system is often described as a Westminster-style democracy.",
      "example_cn": "加拿大的政治体制常被描述为威斯敏斯特式民主。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of clock or bell mechanism, especially the chime system used in the Elizabeth Tower (Big Ben) at the Palace of Westminster.",
      "explanation_cn": "指一种钟表或钟铃机制，尤指位于威斯敏斯特宫伊丽莎白塔（大本钟）中的报时钟声系统。",
      "example_en": "The Westminster chime is one of the most recognizable bell melodies in the world.",
      "example_cn": "威斯敏斯特钟声是世界上最广为人知的钟声旋律之一。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "parliament",
      "analysis": "“Parliament”（议会）是一个通用的政治机构名称，泛指任何国家的立法机构；而 “Westminster” 特指英国伦敦的议会所在地及其所代表的制度体系，具有明确的地理和文化指涉。前者是功能概念，后者是地点与制度的复合象征。"
    },
    {
      "word_to_compare": "abbey",
      "analysis": "“Abbey”（修道院）泛指任何基督教修道院建筑群，而 “Westminster Abbey” 是特指位于伦敦威斯敏斯特区的著名皇家修道院，具有特殊的历史、宗教和国家仪式功能。前者是类别词，后者是专有名词，承载具体文化意义。"
    },
    {
      "word_to_compare": "capital",
      "analysis": "“Capital”（首都）指一个国家的政治中心，如伦敦、巴黎；而 “Westminster” 是伦敦市内的一个具体区域，虽为英国政治核心，但并非国家行政意义上的首都。它是一个子区域，承载首都的核心功能，但不等同于首都本身。"
    }
  ]
}