{
  "word": "wheeler",
  "pronunciation": "hwee·lər",
  "concise_definition": "n. 车轮制造者, 驾车者, （姓氏）",
  "forms": {
    "plural": "wheelers"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person who makes or repairs wheels, especially for carts, wagons, or carriages; historically a skilled artisan in transportation industries.",
      "explanation_cn": "指制造或修理车轮的人，尤指为马车、货车或四轮马车制作车轮的工匠；历史上是交通运输业中的一类熟练技工。",
      "example_en": "In the 19th century, the village had a famous wheeler who crafted wooden wheels with iron rims.",
      "example_cn": "在19世纪，这个村庄有一位著名的车轮匠，专门制作带铁箍的木制车轮。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who drives a wheeled vehicle, especially in a figurative or colloquial sense, often implying motion, energy, or influence.",
      "explanation_cn": "指驾驶轮式车辆的人，常用于比喻或口语中，暗示行动力、活力或影响力。",
      "example_en": "He's a political wheeler-dealer who knows how to get things done behind the scenes.",
      "example_cn": "他是个政坛上的实干家，深谙如何在幕后推动事务进展。"
    },
    {
      "pos": "noun",
      "explanation_en": "A surname, often derived from an occupational name for someone who made or worked with wheels.",
      "explanation_cn": "作为姓氏使用，通常源于职业名称，指从事车轮制造或相关工作的人。",
      "example_en": "John Wheeler was a renowned physicist who contributed to the development of nuclear theory.",
      "example_cn": "约翰·惠勒是一位著名的物理学家，为核理论的发展做出了贡献。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cartwright",
      "analysis": "“Cartwright”（马车制造者）特指制造整个马车或货车的人，而 “wheeler” 仅专注于车轮的制作。两者在历史上常合作，但 “cartwright” 的职责范围更广，而 “wheeler” 更专精于轮子这一关键部件。"
    },
    {
      "word_to_compare": "driver",
      "analysis": "“Driver”（驾驶员）泛指任何驾驶交通工具的人，包括汽车、火车、飞机等，语义更广泛且现代；而 “wheeler” 在指代驾车者时，通常带有历史或文学色彩，特指驾驶马车或早期轮式车辆的人，语义更具体、更具时代感。"
    },
    {
      "word_to_compare": "mechanic",
      "analysis": "“Mechanic”（机械师）是更广泛的术语，涵盖所有修理和维护机械装置的人，包括发动机、传动系统等；而 “wheeler” 是一个高度专业化的子类，仅限于车轮相关工作。因此，所有 wheeler 都是 mechanic，但并非所有 mechanic 都是 wheeler。"
    }
  ]
}