{
  "word": "wheels",
  "pronunciation": "hwēlz",
  "concise_definition": "n. 轮子, 车辆, 交通, 机动性",
  "forms": {
    "singular": "wheel"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A circular object that rotates on an axle and is used to facilitate movement, typically attached to vehicles such as cars, bicycles, or carts.",
      "explanation_cn": "一种围绕轴心旋转的圆形装置，用于促进移动，通常安装在汽车、自行车或手推车等交通工具上。",
      "example_en": "The car's wheels were covered in mud after the off-road drive.",
      "example_cn": "越野驾驶后，汽车的轮子上满是泥巴。"
    },
    {
      "pos": "noun",
      "explanation_en": "A vehicle or mode of transportation, often used in the plural form to refer to automobiles collectively.",
      "explanation_cn": "指代交通工具，尤其在复数形式中泛指汽车或其他机动车辆。",
      "example_en": "He sold his house to buy new wheels.",
      "example_cn": "他卖了房子，买了辆新车。"
    },
    {
      "pos": "noun",
      "explanation_en": "The mechanism or system that enables movement, progress, or operation of an organization or process; often used metaphorically to mean 'the forces that drive things forward'.",
      "explanation_cn": "指推动组织或进程运转的机制或系统，常用于比喻意义，表示‘推动事物前进的力量’。",
      "example_en": "The wheels of justice turn slowly, but they turn nonetheless.",
      "example_cn": "正义的车轮虽然缓慢，但终将转动。"
    },
    {
      "pos": "noun",
      "explanation_en": "A circular object resembling a wheel, such as a steering wheel, a wheel of cheese, or a wheel of fortune.",
      "explanation_cn": "指形状类似轮子的物体，如方向盘、奶酪轮或幸运大转盘。",
      "example_en": "She spun the wheel of fortune and landed on 'Bankrupt'.",
      "example_cn": "她转动了幸运大转盘，结果停在了‘破产’上。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "tyre",
      "analysis": "“Tyre”（英式英语）或 “tire”（美式英语）特指包裹在轮毂外的橡胶轮胎，是车轮的组成部分，强调材质与功能（减震、抓地）。而 “wheel” 指整个旋转结构，包括轮毂、辐条和轮胎。因此，一个 wheel 可能包含一个 tyre，但 tyre 不等于 wheel。"
    },
    {
      "word_to_compare": "axle",
      "analysis": "“Axle”（车轴）是贯穿车轮中心、支撑并连接车轮的刚性杆件，是车轮旋转的支点。它属于车轮系统的组成部分，但本身不是轮子。相比之下，“wheel” 是完整的旋转单元，而 “axle” 是其内部支撑结构。"
    },
    {
      "word_to_compare": "cog",
      "analysis": "“Cog”（齿轮）是机械传动中具有齿状边缘的圆形部件，用于传递动力，虽然形状类似轮子，但功能完全不同：cog 用于啮合传动，而 wheel 用于滚动移动。两者在结构和用途上不可互换。"
    }
  ]
}