{
  "word": "wheel",
  "pronunciation": "hwēl",
  "concise_definition": "n. 轮子, 车轮; v. 转动, 推动, 运送",
  "forms": {
    "plural": "wheels",
    "third_person_singular": "wheels",
    "past_tense": "wheeled",
    "past_participle": "wheeled",
    "present_participle": "wheeling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A circular frame or disk that rotates around an axle, typically used to facilitate movement of vehicles or machinery by rolling.",
      "explanation_cn": "一种围绕轴心旋转的圆形框架或圆盘，通常用于通过滚动来促进车辆或机械的移动。",
      "example_en": "The car's front wheel was damaged in the accident.",
      "example_cn": "这辆车的前轮在事故中受损了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A device or mechanism that resembles a wheel in shape or function, such as a steering wheel, a wheel of fortune, or a potter's wheel.",
      "explanation_cn": "指形状或功能类似轮子的装置，如方向盘、幸运轮或陶轮。",
      "example_en": "She spun the potter's wheel with practiced hands.",
      "example_cn": "她熟练地转动着陶轮。"
    },
    {
      "pos": "noun",
      "explanation_en": "A group of people who are closely connected and influence each other, often in a social or political context (used in phrases like 'the inner wheel').",
      "explanation_cn": "指在社交或政治语境中紧密联系、相互影响的一群人（常用于短语如 'inner wheel' 内圈）。",
      "example_en": "He moved in the inner wheel of the city's political elite.",
      "example_cn": "他身处该市政治精英的核心圈子。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or cause something to move by turning on wheels or as if on wheels.",
      "explanation_cn": "指通过轮子转动或似有轮子般移动，或使某物如此移动。",
      "example_en": "They wheeled the hospital bed into the room.",
      "example_cn": "他们把病床推进了房间。"
    },
    {
      "pos": "verb",
      "explanation_en": "To turn or rotate rapidly, often with a sense of motion or dizziness.",
      "explanation_cn": "指快速旋转，常带有运动或眩晕的感觉。",
      "example_en": "Her head began to wheel after she stood up too quickly.",
      "example_cn": "她站起来太快，开始感到头晕目眩。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rim",
      "analysis": "“Rim”（轮辋）是车轮的外缘部分，仅指轮子的金属或塑料边缘结构，而 “wheel” 指整个旋转装置，包括轮辋、辐条和轮毂。因此，“rim” 是 “wheel” 的组成部分，而非同义词。"
    },
    {
      "word_to_compare": "cog",
      "analysis": "“Cog”（齿轮）是带有齿的机械部件，用于传递动力和旋转运动，虽然也旋转，但其功能是啮合传动，而非滚动支撑。而 “wheel” 通常用于滚动以减少摩擦，两者在结构和用途上截然不同。"
    },
    {
      "word_to_compare": "rotate",
      "analysis": "“Rotate”（旋转）是一个通用动词，指任何围绕轴心的转动动作，适用于天体、风扇、门等。而 “wheel” 作为动词时，特指通过轮子移动或使某物像轮子一样转动，常带有“推动”或“搬运”的语义，语义范围更具体。"
    }
  ]
}