{
  "word": "wheeling",
  "pronunciation": "wehl·ing",
  "concise_definition": "n. 转动, 操纵, 交易; adj. 轮式的, 与车轮有关的",
  "forms": {
    "base_form": "wheel",
    "present_participle": "wheeling",
    "past_tense": "wheeled",
    "past_participle": "wheeled"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of moving or turning something on wheels, especially in a skillful or manipulative way; often used in the context of political or business maneuvering.",
      "explanation_cn": "指以轮子为媒介进行移动或转动，尤指在政治或商业中通过巧妙、操纵性的手段达成目的的行为。",
      "example_en": "The senator was accused of wheeling and dealing behind closed doors to secure the contract.",
      "example_cn": "这位参议员被指控在幕后进行权钱交易以获取合同。"
    },
    {
      "pos": "noun",
      "explanation_en": "A maneuver or tactic involving clever or unscrupulous negotiation, often implying deception or exploitation for personal gain.",
      "explanation_cn": "指一种涉及巧妙或不道德谈判的策略，常暗示为谋取私利而进行欺骗或利用。",
      "example_en": "His wheeling in the stock market earned him a fortune but ruined his reputation.",
      "example_cn": "他在股市中的投机操作为他赚取了巨额财富，却毁掉了他的声誉。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or having wheels; describing something designed to roll or be moved on wheels.",
      "explanation_cn": "与车轮有关的；描述设计用于滚动或借助车轮移动的事物。",
      "example_en": "The wheeling cart was perfect for transporting heavy equipment across the construction site.",
      "example_cn": "这辆带轮子的推车非常适合在建筑工地上运输重型设备。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "maneuvering",
      "analysis": "“Maneuvering”（操纵/机动）泛指为达成目的而采取的策略性行动，可应用于军事、政治或社交场合，语义更广，不一定涉及不道德手段。而 “wheeling” 常与 “dealing” 连用，特指带有交易、投机甚至欺诈色彩的操纵行为，更具贬义和商业语境。"
    },
    {
      "word_to_compare": "trading",
      "analysis": "“Trading”（交易）是中性词，指商品、服务或金融资产的交换，强调合法、公开的买卖行为。而 “wheeling” 在名词用法中常暗含非正式、不透明甚至腐败的交易，语义更负面，常用于批评语境。"
    },
    {
      "word_to_compare": "rolling",
      "analysis": "“Rolling”（滚动）是物理动作的直接描述，强调物体在轮子上移动的机械过程，无引申义。而 “wheeling” 作为名词时已脱离物理含义，转为比喻性用法，指策略性操纵，二者语义层级完全不同。"
    }
  ]
}