{
  "word": "whipped",
  "pronunciation": "hwip·t",
  "concise_definition": "adj. 被抽打的, 被打成泡沫的; v. 抽打, 搅打 (whip 的过去式和过去分词)",
  "forms": {
    "base_form": "whip",
    "third_person_singular": "whips",
    "present_participle": "whipping",
    "past_tense": "whipped",
    "past_participle": "whipped"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing something that has been beaten or stirred rapidly until it becomes light and frothy, especially cream or egg whites.",
      "explanation_cn": "形容某物（尤其是奶油或蛋清）被快速搅打至轻盈蓬松、起泡的状态。",
      "example_en": "She added the whipped cream on top of the chocolate cake.",
      "example_cn": "她在巧克力蛋糕上加了打发的奶油。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing someone who is exhausted, defeated, or emotionally drained, often due to overwork or stress.",
      "explanation_cn": "形容某人因过度劳累或压力而筋疲力尽、被击垮或情绪耗尽的状态。",
      "example_en": "After working 16 hours straight, he was completely whipped.",
      "example_cn": "连续工作了16个小时后，他彻底累垮了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strike someone or something repeatedly with a whip, rod, or similar object, often as punishment or control.",
      "explanation_cn": "用鞭子、棍棒或其他类似物品反复抽打某人或某物，通常作为惩罚或控制手段。",
      "example_en": "The cruel overseer whipped the slaves for minor mistakes.",
      "example_cn": "残酷的监工因微小的错误鞭打了奴隶们。"
    },
    {
      "pos": "verb",
      "explanation_en": "To beat or stir a substance (such as cream, eggs, or butter) vigorously with a whisk or mixer to incorporate air and increase volume.",
      "explanation_cn": "用打蛋器或搅拌器快速搅打某种物质（如奶油、蛋清或黄油），以混入空气并增加体积。",
      "example_en": "Whip the egg whites until they form stiff peaks.",
      "example_cn": "将蛋清打发至形成硬性尖峰。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "beaten",
      "analysis": "“Beaten” (被打的/搅打过的) 是更通用的词，可指任何形式的击打或搅拌，不特指产生泡沫。而 “whipped” 在食物语境中专指通过快速搅打使空气进入、质地蓬松，具有明确的物理变化含义。在形容人疲惫时，“whipped” 更口语化、更强调彻底耗尽，而 “beaten” 更常用于比喻性的挫败感。"
    },
    {
      "word_to_compare": "frothed",
      "analysis": "“Frothed” (起泡沫的) 仅描述表面形成泡沫的状态，不强调动作过程。而 “whipped” 不仅描述结果，还隐含了通过快速搅打实现该状态的主动过程。例如，牛奶可以被 frothed（用蒸汽棒打出奶泡），但只有被 whipped 才意味着用打蛋器充分搅打至蓬松。"
    },
    {
      "word_to_compare": "exhausted",
      "analysis": "“Exhausted” (精疲力竭的) 是更正式、更广泛的词，用于描述任何类型的极度疲劳，包括身体、心理或情感层面。而 “whipped” 更口语化，常用于非正式语境，带有轻微的夸张色彩，强调因过度劳累而‘被打垮’的戏剧性状态，常用于美式英语口语中。"
    }
  ]
}