{
  "word": "whipping",
  "pronunciation": "hwin·ting",
  "concise_definition": "n. 抽打, 痛打; v. 抽打, 搅拌; adj. 快速的, 猛烈的",
  "forms": {
    "base_form": "whip",
    "third_person_singular": "whips",
    "past_tense": "whipped",
    "past_participle": "whipped",
    "present_participle": "whipping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A sharp blow or series of blows delivered with a whip, rod, or similar object, often as punishment or in violence.",
      "explanation_cn": "用鞭子、棍棒或其他类似物品施加的猛烈一击或连续击打，常用于惩罚或暴力行为。",
      "example_en": "The prisoner received a whipping for attempting to escape.",
      "example_cn": "这名囚犯因试图逃跑而被鞭打。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strike repeatedly with a flexible object such as a whip, cane, or belt, typically to punish or inflict pain.",
      "explanation_cn": "用鞭子、棍棒或腰带等有弹性的物体反复抽打，通常用于惩罚或造成痛苦。",
      "example_en": "The coach was accused of whipping the players too harshly during practice.",
      "example_cn": "这位教练被指控在训练中对球员过于严厉地鞭打。"
    },
    {
      "pos": "verb",
      "explanation_en": "To beat or stir something rapidly, especially cream or egg whites, to incorporate air and create volume or texture.",
      "explanation_cn": "快速搅拌某物，尤其是奶油或蛋清，以混入空气并增加体积或改变质地。",
      "example_en": "She spent ten minutes whipping the cream until it formed stiff peaks.",
      "example_cn": "她花了十分钟搅拌奶油，直到它形成坚挺的尖峰。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing something that is done quickly, forcefully, or with great speed and energy.",
      "explanation_cn": "形容某事以快速、猛烈或充满能量的方式完成。",
      "example_en": "They made a whipping run to the finish line, leaving their competitors far behind.",
      "example_cn": "他们以迅猛的冲刺冲向终点，把对手远远甩在身后。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "beating",
      "analysis": "“Beating” (殴打) 是更广泛的术语，泛指任何形式的击打，包括用手、拳、棍棒等，不一定需要工具。而 “whipping” 特指用鞭子或长而柔韧的物体进行的连续抽打，更具工具性和仪式性，常带有惩罚或虐待的语境。"
    },
    {
      "word_to_compare": "stirring",
      "analysis": "“Stirring” (搅拌) 是中性词，泛指任何混合动作，通常温和缓慢。而 “whipping” 在烹饪语境中特指快速、剧烈地搅打以引入空气，产生蓬松质地，动作强度和目的性远高于普通搅拌。"
    },
    {
      "word_to_compare": "flogging",
      "analysis": "“Flogging” (鞭笞) 与 “whipping” 几乎同义，常用于法律或历史语境中描述正式的体罚。但 “flogging” 更正式、更书面化，且多用于描述司法或军事惩罚；而 “whipping” 更口语化，也可用于非暴力语境（如搅拌奶油）。"
    }
  ]
}