{
  "word": "whip",
  "pronunciation": "hwip",
  "concise_definition": "n. 鞭子, 鞭打; v. 鞭打, 快速搅拌, 突然移动; n. (政党)党鞭",
  "forms": {
    "third_person_singular": "whips",
    "past_tense": "whipped",
    "past_participle": "whipped",
    "present_participle": "whipping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A long, flexible instrument, typically made of leather or rope, used for striking or punishing someone or something.",
      "explanation_cn": "一种通常由皮革或绳索制成的长而柔韧的工具，用于抽打或惩罚人或动物。",
      "example_en": "The coach used a whip to urge the horses forward.",
      "example_cn": "教练用鞭子催促马匹前进。"
    },
    {
      "pos": "verb",
      "explanation_en": "To strike someone or something repeatedly with a whip or similar object, often as punishment or to force movement.",
      "explanation_cn": "用鞭子或类似物品反复抽打某人或某物，通常作为惩罚或迫使移动的手段。",
      "example_en": "The cruel overseer whipped the slaves for minor mistakes.",
      "example_cn": "残酷的监工因微小的错误鞭打奴隶。"
    },
    {
      "pos": "verb",
      "explanation_en": "To beat something rapidly, especially eggs, cream, or batter, to incorporate air and make it light and fluffy.",
      "explanation_cn": "快速搅拌某物（尤其是鸡蛋、奶油或面糊），以混入空气使其变得轻盈蓬松。",
      "example_en": "She whipped the cream until it formed stiff peaks.",
      "example_cn": "她将奶油搅打至形成硬性发泡。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or swing something quickly and forcefully, often with a sharp, snapping motion.",
      "explanation_cn": "快速而有力地移动或挥动某物，常带有突然的抽打动作。",
      "example_en": "He whipped his coat off and rushed out the door.",
      "example_cn": "他猛地甩掉外套，冲出了门。"
    },
    {
      "pos": "noun",
      "explanation_en": "In politics, a party official responsible for ensuring party members vote according to party policy and maintaining discipline during legislative sessions.",
      "explanation_cn": "在政治中，指负责确保政党成员按政党政策投票、并在立法会议期间维持纪律的政党官员。",
      "example_en": "The party whip reminded all members to attend the crucial vote tomorrow.",
      "example_cn": "党鞭提醒所有成员参加明天的关键投票。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "lash",
      "analysis": "“Lash” (抽打) 与 “whip” 在表示“用鞭子抽打”时可互换，但 “lash” 更强调动作的猛烈和情感上的愤怒，常用于比喻义（如怒斥）；而 “whip” 更中性，也可用于非暴力语境（如搅拌奶油）。"
    },
    {
      "word_to_compare": "flick",
      "analysis": "“Flick” (轻弹/轻甩) 指快速但轻微、短暂的动作，通常不具伤害性（如 flicking dust off a table）；而 “whip” 暗示更强的力量和更大幅度的运动，常带有惩罚或剧烈的意图。"
    },
    {
      "word_to_compare": "stir",
      "analysis": "“Stir” (搅拌) 是通用词，指任何混合动作，通常缓慢、温和；而 “whip” 是一种特定类型的快速搅拌，目的是引入空气、增加体积，常用于烹饪语境，具有技术性含义。"
    },
    {
      "word_to_compare": "enforcer",
      "analysis": "“Enforcer” (执行者) 是一个泛指维持规则或纪律的人，而 “whip” 是政治语境中的专有名词，特指政党内部负责投票纪律的官员，具有制度性角色，不能随意替换。"
    }
  ]
}