{
  "word": "whistle",
  "pronunciation": "hwis·uhl",
  "concise_definition": "n. 哨子, 哨声; v. 吹口哨, 吹哨",
  "forms": {
    "third_person_singular": "whistles",
    "past_tense": "whistled",
    "past_participle": "whistled",
    "present_participle": "whistling",
    "plural": "whistles"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small device, typically made of metal or plastic, that produces a high-pitched sound when air is blown through it, often used for signaling or attracting attention.",
      "explanation_cn": "一种通常由金属或塑料制成的小型装置，当空气通过时会发出高音调的声音，常用于发出信号或吸引注意。",
      "example_en": "The referee blew his whistle to stop the game.",
      "example_cn": "裁判吹响了哨子，叫停了比赛。"
    },
    {
      "pos": "noun",
      "explanation_en": "The high-pitched sound produced by blowing air through the lips or through a whistle device.",
      "explanation_cn": "通过嘴唇或哨子吹气发出的尖锐声音。",
      "example_en": "A sharp whistle echoed through the forest as the hunter signaled his dog.",
      "example_cn": "猎人吹响一声尖锐的口哨，声音在森林中回荡，召唤他的狗。"
    },
    {
      "pos": "verb",
      "explanation_en": "To produce a high-pitched sound by forcing air through the lips or a whistle, often to express emotion, attract attention, or communicate.",
      "explanation_cn": "通过嘴唇或哨子用力吹气发出尖锐的声音，常用于表达情绪、吸引注意或传递信息。",
      "example_en": "She whistled a cheerful tune while walking to work.",
      "example_cn": "她一边走路去上班，一边吹着欢快的曲子。"
    },
    {
      "pos": "verb",
      "explanation_en": "To report or expose illegal or unethical behavior within an organization, especially by an insider (often used in the phrase 'to whistle while working').",
      "explanation_cn": "指内部人员举报组织内的非法或不道德行为（常用于短语 'whistleblow'，即‘举报者’）。",
      "example_en": "The employee decided to whistle on the company's environmental violations.",
      "example_cn": "这名员工决定举报该公司违反环保法规的行为。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "siren",
      "analysis": "“Siren”（警报器）通常指一种机械或电子装置发出的持续、响亮、用于紧急警示的声音，如消防车或救护车的警报。它强调功能性和强制性，而 “whistle” 更多是人为发出的、短促的、用于信号或情绪表达的声音。"
    },
    {
      "word_to_compare": "hiss",
      "analysis": "“Hiss”（嘶嘶声）是一种持续的、摩擦性的声音，通常由空气或液体泄漏产生，或由蛇、愤怒的人发出，带有负面或威胁的语义色彩。而 “whistle” 是清晰、悦耳或尖锐的音调，常用于积极或中性语境，如表达愉悦或召集。"
    },
    {
      "word_to_compare": "call",
      "analysis": "“Call”（呼喊）泛指通过声音呼唤某人，可以是人声、喇叭或任何发声方式，语义更广。而 “whistle” 特指通过嘴唇或哨子发出的特定音调声音，具有更明确的物理机制和音色特征，常用于远距离或非语言沟通。"
    }
  ]
}