{
  "word": "whispering",
  "pronunciation": "hwis·pər·iŋ",
  "concise_definition": "adj. 低语的, 耳语的; n. 低语, 耳语声",
  "forms": {
    "base_form": "whisper",
    "third_person_singular": "whispers",
    "past_tense": "whispered",
    "past_participle": "whispered",
    "present_participle": "whispering"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing speech or sound that is spoken or made in a very soft voice, often to avoid being overheard or to convey secrecy or intimacy.",
      "explanation_cn": "形容以非常轻柔的声音说话或发出的声音，通常是为了避免被他人听到，或传达秘密或亲密感。",
      "example_en": "She gave him a whispering reply that only he could hear.",
      "example_cn": "她给了他一个只有他能听见的低语回应。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used to describe environments or natural sounds that are quiet, gentle, and almost inaudible, evoking a sense of calm or mystery.",
      "explanation_cn": "用于形容环境或自然声音轻柔、几乎听不见，营造出宁静或神秘的氛围。",
      "example_en": "The whispering pines swayed in the moonlight, casting long shadows.",
      "example_cn": "月光下，低语般的松树轻轻摇曳，投下长长的影子。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of speaking in a very soft voice, typically to communicate discreetly or confidentially.",
      "explanation_cn": "以极轻柔的声音说话的行为，通常用于秘密或保密地交流。",
      "example_en": "A whispering broke the silence of the library.",
      "example_cn": "一阵低语打破了图书馆的寂静。"
    },
    {
      "pos": "noun",
      "explanation_en": "A soft, rustling sound, often produced by wind, leaves, or fabric moving gently.",
      "explanation_cn": "一种轻柔的沙沙声，通常由风、树叶或布料轻轻移动产生。",
      "example_en": "The whispering of the wind through the grass was soothing.",
      "example_cn": "风穿过草地时发出的沙沙声令人感到宁静。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "murmur",
      "analysis": "“Murmur”（低语/喃喃）通常指持续、模糊、含糊不清的轻声说话或声音，常带有不安、抱怨或群体性特征，如人群的嗡嗡声。而 “whispering” 更强调刻意的轻柔、私密性，通常是一对一的交流，声音更清晰可辨。"
    },
    {
      "word_to_compare": "hush",
      "analysis": "“Hush”（安静/嘘声）是使某人或某地安静下来的命令或状态，强调“停止发声”，是一种静默的指令或结果。而 “whispering” 是一种主动发出的、轻微的声音，是声音的形态而非声音的缺失。"
    },
    {
      "word_to_compare": "rustle",
      "analysis": "“Rustle”（沙沙声）专指物体（如纸张、树叶、布料）摩擦时发出的轻脆、短促的声响，是物理动作的产物，不涉及语言。而 “whispering” 可以是语言性的，也可以是比喻性的声音，具有情感或意图的维度。"
    }
  ]
}