{
  "word": "whispers",
  "pronunciation": "hwis·puhrz",
  "concise_definition": "n. 耳语, 低语, 轻声细语; v. 耳语, 低语",
  "forms": {
    "singular": "whisper"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A very soft, quiet voice used when speaking, often to avoid being overheard or to convey secrecy or intimacy.",
      "explanation_cn": "指说话时声音非常轻柔、低沉，通常是为了避免被他人听到，或为了传达秘密或亲密感。",
      "example_en": "The only sounds in the forest were the whispers of the wind through the trees.",
      "example_cn": "森林里唯一的声响，是风穿过树叶时的低语。"
    },
    {
      "pos": "noun",
      "explanation_en": "A rumor or piece of information passed quietly or unofficially, often without clear source or confirmation.",
      "explanation_cn": "指一种未经证实、悄悄流传的谣言或信息，通常没有明确的来源。",
      "example_en": "There were whispers that the CEO might resign before the end of the year.",
      "example_cn": "有传言说，首席执行官可能在年底前辞职。"
    },
    {
      "pos": "verb",
      "explanation_en": "To speak very softly, using the breath rather than the full voice, often to avoid detection or to express intimacy.",
      "explanation_cn": "以极轻的声音说话，主要依靠气息而非声带发声，通常是为了不被发现或表达亲密感。",
      "example_en": "She whispered her secret to her best friend in the dark.",
      "example_cn": "她在黑暗中向最好的朋友低声说出了自己的秘密。"
    },
    {
      "pos": "verb",
      "explanation_en": "To be rumored or suggested indirectly, often in hushed tones or through subtle hints.",
      "explanation_cn": "指某种信息或传闻通过含蓄的暗示或低语的方式间接流传。",
      "example_en": "Whispers of corruption began to circulate after the audit was published.",
      "example_cn": "审计报告发布后，关于腐败的流言开始悄然流传。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "murmurs",
      "analysis": "“Murmurs”（低语、喃喃声）通常指持续、模糊、不清晰的低声说话，常用于描述群体中零散的议论或不安的声响，带有轻微的混乱感。而 “whispers” 更强调个体刻意的轻声说话，目的性更强，常与秘密或亲密相关。"
    },
    {
      "word_to_compare": "rumors",
      "analysis": "“Rumors”（谣言）是未经证实的信息本身，强调内容的传播和可信度问题；而 “whispers” 作为名词时，强调的是信息传播的方式——轻声、隐秘、非正式。可以说，whispers 是 rumors 的传播渠道，而非信息内容本身。"
    },
    {
      "word_to_compare": "mutterings",
      "analysis": "“Mutterings”（嘟囔）指含糊不清、通常因不满或自言自语而发出的声音，常带有情绪色彩（如愤怒、抱怨），且不一定有意图让他人听见。而 “whispers” 是有意识地降低音量，目的是让特定对象听见，语义上更含蓄、更克制。"
    }
  ]
}