{
  "word": "whistles",
  "pronunciation": "hwis·uhlz",
  "concise_definition": "n. 哨声, 哨子; v. 吹口哨, 发出哨声",
  "forms": {
    "singular": "whistle",
    "third_person_singular": "whistles",
    "past_tense": "whistled",
    "past_participle": "whistled",
    "present_participle": "whistling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A high-pitched sound produced by forcing air through a small opening, such as a whistle or between the lips, often used to attract attention, signal, or express emotion.",
      "explanation_cn": "通过将空气从一个小开口（如哨子或双唇之间）强力吹出而发出的尖锐声音，常用于吸引注意、发出信号或表达情绪。",
      "example_en": "The referee blew a loud whistle to stop the game.",
      "example_cn": "裁判吹响了一声响亮的哨子，叫停了比赛。"
    },
    {
      "pos": "noun",
      "explanation_en": "A small device, typically made of metal or plastic, designed to produce a high-pitched sound when air is blown through it.",
      "explanation_cn": "一种通常由金属或塑料制成的小型装置，当空气通过时能发出尖锐的声音。",
      "example_en": "He kept a silver whistle around his neck as a symbol of his role as a coach.",
      "example_cn": "他把一枚银哨挂在脖子上，作为自己教练身份的象征。"
    },
    {
      "pos": "verb",
      "explanation_en": "To produce a high-pitched sound by forcing air through the lips or a whistle, often to communicate, express joy, or get someone's attention.",
      "explanation_cn": "通过将空气从嘴唇间或哨子中强力吹出以发出尖锐的声音，常用于交流、表达喜悦或引起他人注意。",
      "example_en": "The workers whistled as they walked home from the factory.",
      "example_cn": "工人们边走边吹着口哨，从工厂回家。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move quickly and silently, often with a hissing or whistling sound, as if passing through the air.",
      "explanation_cn": "以快速而安静的方式移动，常伴随呼啸或哨音，仿佛掠过空气。",
      "example_en": "The bullet whistled past his ear, missing him by inches.",
      "example_cn": "子弹呼啸着从他耳边掠过，仅差几英寸就击中了他。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "siren",
      "analysis": "“Siren”（警报器）特指一种用于紧急情况的、音调变化的高分贝机械声响，如消防车或救护车的警报声，具有强烈的警示功能。而 “whistle” 更通用，可以是人为吹出的、非机械的、音调较单一的声音，用途更广泛，包括娱乐、信号或日常提醒。"
    },
    {
      "word_to_compare": "hiss",
      "analysis": "“Hiss”（嘶嘶声）是一种持续的、摩擦性的声音，通常由空气或蒸汽泄漏产生，如蛇的叫声或开水壶的声音。它低沉、绵长，带有负面或威胁的意味；而 “whistle” 是清晰、尖锐、断续的音调，常用于积极或中性语境，如表达愉悦或召集。"
    },
    {
      "word_to_compare": "call",
      "analysis": "“Call”（呼唤）泛指通过声音（如喊叫、呼喊）来引起注意或传达信息，通常使用人声，语义更宽泛。而 “whistle” 是一种特定的、非语言的发声方式，依赖气流和物理结构，音色固定，常用于远距离或非语言沟通，如体育裁判或铁路信号员使用。"
    }
  ]
}