{
  "word": "white",
  "pronunciation": "hwīt",
  "concise_definition": "adj. 白色的, 白种人的; n. 白色, 白人; v. 使变白",
  "forms": {
    "comparative": "whiter",
    "superlative": "whitest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Having the color of fresh snow or milk; reflecting all wavelengths of visible light without absorbing any, often symbolizing purity, innocence, or neutrality.",
      "explanation_cn": "具有新鲜雪或牛奶的颜色；反射所有可见光波长而不吸收任何光，常象征纯洁、无辜或中立。",
      "example_en": "She wore a white dress to the wedding.",
      "example_cn": "她穿着一件白色连衣裙去参加婚礼。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to people of European descent, especially in the context of racial classification in the United States and other Western countries.",
      "explanation_cn": "指具有欧洲血统的人，尤其在美国及其他西方国家的种族分类语境中。",
      "example_en": "The census collects data on race, including white, Black, Asian, and other categories.",
      "example_cn": "人口普查收集包括白人、黑人、亚裔及其他类别的种族数据。"
    },
    {
      "pos": "noun",
      "explanation_en": "The color produced by the reflection of all visible light wavelengths; often used in art, design, and symbolism to represent cleanliness, simplicity, or peace.",
      "explanation_cn": "由所有可见光波长反射所产生的颜色；常用于艺术、设计和象征中，代表洁净、简约或和平。",
      "example_en": "White is a popular choice for wedding themes because of its association with purity.",
      "example_cn": "由于与纯洁的关联，白色是婚礼主题的热门选择。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is white, especially in contexts involving racial identity or social dynamics.",
      "explanation_cn": "指白人，尤其在涉及种族身份或社会动态的语境中。",
      "example_en": "The protest brought together people of all races, including many white allies.",
      "example_cn": "这次抗议活动汇集了所有种族的人群，包括许多白人盟友。"
    },
    {
      "pos": "verb",
      "explanation_en": "To make or become white in color, often by bleaching, cleaning, or exposing to light.",
      "explanation_cn": "使某物变白或变得洁白，通常通过漂白、清洁或暴露于光线下实现。",
      "example_en": "The sun whitened the old wooden fence over time.",
      "example_cn": "阳光随着时间的推移使旧木栅栏变白了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pale",
      "analysis": "“Pale”（苍白的）指颜色浅淡、缺乏饱和度，常带有健康或情绪上的负面联想（如面色苍白），而 “white” 是一种明确、纯净的色相，不必然带有虚弱或病态的含义。例如，‘pale skin’ 可能暗示生病，而 ‘white skin’ 仅描述颜色。"
    },
    {
      "word_to_compare": "fair",
      "analysis": "“Fair”（肤色白皙的）在描述人时与 “white” 有重叠，但更强调肤色的柔和、明亮，常用于文学或历史语境，有时带有社会阶层或美学的隐含意义。而 “white” 是更直接、更广泛使用的种族或颜色分类术语，语义更中性、更客观。"
    },
    {
      "word_to_compare": "blank",
      "analysis": "“Blank”（空白的）强调缺乏内容、标记或信息，常用于纸张、屏幕或思维的语境（如 blank page），而 “white” 强调的是视觉颜色本身。虽然白色纸张是空白的，但空白不一定是白色（如黑色背景上的空白区域）。"
    }
  ]
}