{
  "word": "wholesale",
  "pronunciation": "hwohl·seyl",
  "concise_definition": "adj. 批发的, 大量的; n. 批发, 批发业; v. 批发销售",
  "forms": {
    "comparative": "wholesaler",
    "superlative": "wholesaler",
    "plural_noun": "wholesales",
    "present_participle": "wholesaling"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to the sale of goods in large quantities, typically to retailers who then sell them to the public, rather than selling directly to individual consumers.",
      "explanation_cn": "指以大量方式销售商品，通常是卖给零售商，再由零售商转售给终端消费者，而非直接面向个人顾客。",
      "example_en": "The store buys its inventory at wholesale prices to maximize profit margins.",
      "example_cn": "这家商店以批发价采购库存，以最大化利润空间。"
    },
    {
      "pos": "noun",
      "explanation_en": "The practice or business of selling goods in large quantities to retailers or other businesses, as opposed to retail sales to individual customers.",
      "explanation_cn": "指以大量方式向零售商或其他企业销售商品的商业行为，区别于面向个人消费者的零售。",
      "example_en": "He started his career in wholesale before opening his own retail boutique.",
      "example_cn": "他在开设自己的精品店之前，最初从事批发业务。"
    },
    {
      "pos": "verb",
      "explanation_en": "To sell goods in large quantities, typically to retailers or distributors rather than to end consumers.",
      "explanation_cn": "指以大量方式向零售商或分销商销售商品，而非直接面向最终消费者。",
      "example_en": "The manufacturer wholesales its products to supermarkets across the country.",
      "example_cn": "这家制造商将产品批发给全国各地的超市。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "retail",
      "analysis": "“Retail”（零售）指将商品以小批量直接销售给最终消费者，强调单件交易和终端服务；而 “wholesale” 强调大批量、低单价、面向商业客户的销售模式，两者在销售规模、客户类型和定价策略上形成鲜明对比。"
    },
    {
      "word_to_compare": "bulk",
      "analysis": "“Bulk”（大批量）是一个描述数量的形容词或副词，泛指大量、非零散的状态，常用于购物语境（如 bulk buying）；而 “wholesale” 是一个商业术语，特指一种销售体系和渠道，不仅指数量大，还隐含了商业交易结构和价格机制。"
    },
    {
      "word_to_compare": "distributor",
      "analysis": "“Distributor”（分销商）是从事批发业务的实体或公司，是批发链条中的一个角色；而 “wholesale” 是描述这种销售行为或模式的术语。前者是人或机构，后者是行为或行业类型，二者属于不同语义层级。"
    }
  ]
}