{
  "word": "whooping",
  "pronunciation": "hoo·ping",
  "concise_definition": "adj. 咆哮的, 尖叫的; n. (常用于复数) 咆哮声, 尖叫声",
  "forms": {
    "comparative": "whooping",
    "superlative": "whooping"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Used to describe a loud, shrill, or prolonged cry, often associated with excitement, fear, or pain; typically used in compound expressions like 'whooping cough'.",
      "explanation_cn": "用于描述一种响亮、尖锐或持续的喊叫，常与兴奋、恐惧或疼痛相关；多用于复合词如 'whooping cough'（百日咳）。",
      "example_en": "She let out a whooping scream when she saw the snake.",
      "example_cn": "她看到蛇时发出了一声尖锐的尖叫。"
    },
    {
      "pos": "noun",
      "explanation_en": "A loud, prolonged cry or shout, especially one expressing strong emotion such as joy, fear, or surprise; often used in plural form to refer to multiple such cries.",
      "explanation_cn": "一种响亮而持久的喊叫，尤其用于表达强烈情绪如喜悦、恐惧或惊讶；常以复数形式指多次此类喊叫。",
      "example_en": "The crowd erupted in whoopings as the team scored the winning goal.",
      "example_cn": "当球队打进制胜一球时，观众席上爆发出阵阵欢呼声。"
    },
    {
      "pos": "noun",
      "explanation_en": "A common name for pertussis, a highly contagious respiratory disease characterized by severe coughing fits ending in a high-pitched 'whoop' sound during inhalation.",
      "explanation_cn": "百日咳的俗称，一种高度传染性的呼吸道疾病，特征为剧烈咳嗽，吸气时伴有高音调的‘哮鸣’声。",
      "example_en": "Children are vaccinated against whooping cough to prevent serious complications.",
      "example_cn": "儿童接种疫苗以预防百日咳带来的严重并发症。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "shouting",
      "analysis": "“Shouting”（喊叫）泛指任何大声说话的行为，语气可中性、愤怒或命令，不一定带有尖锐或持续的音调。而 “whooping” 特指那种高亢、拉长、带有强烈情绪色彩的尖叫声，更具声音特征和情感张力。"
    },
    {
      "word_to_compare": "yelling",
      "analysis": "“Yelling”（叫喊）强调音量大、情绪激烈，但通常是短促、断续的；而 “whooping” 更强调声音的持续性和独特的‘哮鸣’音质，尤其在百日咳语境中具有医学特异性。"
    },
    {
      "word_to_compare": "cheering",
      "analysis": "“Cheering”（欢呼）是积极情绪下的集体喊叫，常有节奏和语言内容（如口号）；而 “whooping” 可以是自发、无词的尖叫声，情绪范围更广，包括恐惧或痛苦，不一定是庆祝性的。"
    }
  ]
}