{
  "word": "wichita",
  "pronunciation": "wih·chih·tuh",
  "concise_definition": "n. 堪萨斯州城市名；威奇托人（美洲原住民）；威奇托语",
  "forms": {
    "plural": "wichitas"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A city in south-central Kansas, United States, known for its aviation industry and as the largest city in the state.",
      "explanation_cn": "美国堪萨斯州中南部的一座城市，以航空工业闻名，是该州最大的城市。",
      "example_en": "Wichita is often called the 'Air Capital of the World' due to its long history of aircraft manufacturing.",
      "example_cn": "由于悠久的飞机制造历史，威奇托常被称为‘世界航空之都’。"
    },
    {
      "pos": "noun",
      "explanation_en": "A member of a Native American tribe historically located in present-day Kansas and Oklahoma, known for their earth lodges and agricultural practices.",
      "explanation_cn": "历史上居住于现今堪萨斯州和俄克拉荷马州的美洲原住民部落成员，以建造地穴式房屋和农耕文化著称。",
      "example_en": "The Wichita people cultivated maize and maintained complex trade networks with neighboring tribes.",
      "example_cn": "威奇托人种植玉米，并与邻近部落建立了复杂的贸易网络。"
    },
    {
      "pos": "noun",
      "explanation_en": "The Caddoan language spoken historically by the Wichita people, now considered critically endangered.",
      "explanation_cn": "威奇托人历史上使用的卡多语系语言，目前被视为极度濒危语言。",
      "example_en": "Linguists are working with the last fluent speakers to document the Wichita language before it disappears.",
      "example_cn": "语言学家正在与最后几位流利使用者合作，在这种语言消失前记录下它。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "kansas",
      "analysis": "“Kansas” 是美国的一个州名，地理范围远大于 “Wichita”。Wichita 是 Kansas 州内的一个城市，因此 “Kansas” 是更大的行政区域，而 “Wichita” 是其组成部分。两者不可互换，但常在语境中关联使用。"
    },
    {
      "word_to_compare": "comanche",
      "analysis": "“Comanche” 是另一个美洲原住民部落的名称，与 Wichita 同属大平原地区，但语言、文化和社会结构不同。Comanche 以游牧和骑兵文化著称，而 Wichita 是定居农耕民族。两者是不同族群，不应混淆。"
    },
    {
      "word_to_compare": "caddo",
      "analysis": "“Caddo” 是与 Wichita 语言同属卡多语系的另一个原住民群体，地理上邻近，文化有相似之处，但为独立部落。Wichita 语和 Caddo 语虽有亲缘关系，但不能互通，属于不同语言变体。"
    }
  ]
}