{
  "word": "widening",
  "pronunciation": "wīd·nɪŋ",
  "concise_definition": "v. 加宽, 扩大; n. 加宽, 扩大",
  "forms": {
    "base_form": "widen",
    "third_person_singular": "widens",
    "past_tense": "widened",
    "past_participle": "widened",
    "present_participle": "widening"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To make something broader or wider in extent, especially in physical dimension, such as a road, gap, or opening.",
      "explanation_cn": "指使某物在物理尺寸上变得更宽，例如道路、缝隙或开口。",
      "example_en": "The city is widening the highway to reduce traffic congestion.",
      "example_cn": "这座城市正在加宽高速公路以缓解交通拥堵。"
    },
    {
      "pos": "verb",
      "explanation_en": "To increase the scope, range, or diversity of something abstract, such as knowledge, experience, or options.",
      "explanation_cn": "指扩大某抽象事物的范围、领域或多样性，例如知识、经验或选择。",
      "example_en": "Traveling abroad is helping to widen her understanding of different cultures.",
      "example_cn": "出国旅行正帮助她拓宽对不同文化的理解。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or process of making something wider; often used in contexts of infrastructure, social inclusion, or economic disparity.",
      "explanation_cn": "使某物变宽的行为或过程；常用于基础设施、社会包容或经济差距等语境。",
      "example_en": "The widening of the bridge was completed last month.",
      "example_cn": "这座桥的加宽工程已于上月完成。"
    },
    {
      "pos": "noun",
      "explanation_en": "An increasing gap or difference between two things, especially in social, economic, or political contexts.",
      "explanation_cn": "指两个事物之间日益扩大的差距，尤其在社会、经济或政治语境中。",
      "example_en": "The widening income gap has become a major concern for policymakers.",
      "example_cn": "日益扩大的收入差距已成为政策制定者关注的重大问题。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "expanding",
      "analysis": "“Expanding” (扩张) 强调在体积、范围或规模上的向外延伸，常用于空间、市场或影响力的增长，如公司扩张、人口膨胀。而 “widening” 更侧重于横向的宽度增加，或抽象概念中差距的拉大，具有更强的“横向”或“差异性”含义。"
    },
    {
      "word_to_compare": "broadening",
      "analysis": "“Broadening” (拓宽) 与 “widening” 在抽象意义上高度重叠，常可互换，但 “broadening” 更常用于知识、视野、兴趣等精神或认知层面的扩展，语气更温和、积极；而 “widening” 在描述差距（如贫富差距）时更具中性或负面色彩。"
    },
    {
      "word_to_compare": "enlarging",
      "analysis": "“Enlarging” (扩大) 通常指在尺寸、容量或数量上的整体增加，强调体积或规模的变大，如放大图片、扩大房间。它不强调“宽度”这一特定维度，而 “widening” 专指横向维度的增加，更精确。"
    }
  ]
}