{
  "word": "wild",
  "pronunciation": "wīld",
  "concise_definition": "adj. 野生的, 野性的, 狂野的, 荒凉的; n. 荒野, 野外",
  "forms": {
    "comparative": "wilder",
    "superlative": "wildest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Existing in or coming from a natural state, not domesticated, cultivated, or controlled by humans; referring to animals, plants, or landscapes that are untamed and free.",
      "explanation_cn": "指存在于自然状态中，未被人类驯化、栽培或控制的；用于描述动物、植物或地貌，具有未加约束、自由自在的特性。",
      "example_en": "The lions roamed wild across the African savanna.",
      "example_cn": "狮子在非洲大草原上自由驰骋。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by unrestrained, chaotic, or extreme behavior, emotion, or activity; often implying lack of control or rationality.",
      "explanation_cn": "形容行为、情绪或活动无拘无束、混乱或极端，常暗示缺乏控制或理性。",
      "example_en": "The party got wild after midnight, with people dancing on tables.",
      "example_cn": "午夜过后派对变得狂野起来，人们在桌子上跳舞。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing a place that is remote, uncultivated, and uninhabited, often with a sense of danger or mystery.",
      "explanation_cn": "形容一个偏远、未开垦、无人居住的地方，常带有危险或神秘的意味。",
      "example_en": "They hiked deep into the wild, far from any trail or civilization.",
      "example_cn": "他们徒步深入荒野，远离任何小径和文明。"
    },
    {
      "pos": "noun",
      "explanation_en": "The natural, uncultivated environment beyond human settlement; the realm of nature untouched by civilization.",
      "explanation_cn": "指人类聚居地之外的自然、未开垦的环境；未被文明触及的大自然领域。",
      "example_en": "He longed to return to the wild after years of city life.",
      "example_cn": "在城市生活多年后，他渴望重返荒野。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "feral",
      "analysis": "“Feral”（野化的）特指原本被驯养但已回归野生状态的动物，强调其从家养到野生的转变过程，带有负面或失控的意味。而 “wild” 更广泛，可指从未被驯化的天然状态，不必然带有负面含义。"
    },
    {
      "word_to_compare": "untamed",
      "analysis": "“Untamed”（未驯服的）与 “wild” 非常接近，常可互换，但 “untamed” 更强调尚未被人类控制或规范的状态，常用于形容性格、自然力量或情感，更具文学性；“wild” 更口语化，适用范围更广。"
    },
    {
      "word_to_compare": "rugged",
      "analysis": "“Rugged”（崎岖的）主要描述地形的粗糙、不平和艰难，强调物理特征，如山地或海岸。它不涉及生物的自然状态或行为的狂野，而 “wild” 可涵盖自然环境、生物行为和情绪状态的多重含义。"
    }
  ]
}