{
  "word": "wildcats",
  "pronunciation": "wīld·kæts",
  "concise_definition": "n. 野猫, 野生猫科动物; (非正式) 未经批准的罢工, 非法开采; (体育) 野猫队（球队名)",
  "forms": {
    "singular": "wildcat"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A wild or untamed member of the cat family, especially species such as the European wildcat or the African wildcat, living in natural habitats without domestication.",
      "explanation_cn": "指猫科动物中未被驯化的野生种类，如欧洲野猫或非洲野猫，生活在自然环境中，未被人类驯养。",
      "example_en": "Conservationists are working to protect the habitat of the Scottish wildcat, one of the rarest mammals in Europe.",
      "example_cn": "保护主义者正在努力保护苏格兰野猫的栖息地，这是欧洲最稀有的哺乳动物之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "An unauthorized or unofficial strike by workers, not sanctioned by a labor union, often spontaneous and illegal under labor agreements.",
      "explanation_cn": "指工人未经工会批准而自发进行的罢工，通常违反劳动合同，属于非法行为。",
      "example_en": "The factory shut down after a wildcat strike by assembly-line workers over unsafe conditions.",
      "example_cn": "由于装配线工人因工作条件不安全而发起非法罢工，工厂被迫停工。"
    },
    {
      "pos": "noun",
      "explanation_en": "An unlicensed or illegal oil well drilled in search of petroleum, especially in areas not officially zoned for drilling.",
      "explanation_cn": "指在未经许可的区域非法钻探以寻找石油的油井，通常违反土地使用法规。",
      "example_en": "In the early 20th century, wildcats rushed to Texas hoping to strike oil and become rich overnight.",
      "example_cn": "20世纪初，许多投机者涌向德克萨斯州，希望钻出石油一夜暴富。"
    },
    {
      "pos": "noun",
      "explanation_en": "A nickname for sports teams, especially in American college or professional sports, often chosen to symbolize ferocity, independence, or agility.",
      "explanation_cn": "指体育队伍的绰号，尤其在美国大学或职业体育中，常用来象征凶猛、独立或敏捷的特质。",
      "example_en": "The Arizona Wildcats defeated their rivals in a thrilling overtime game last weekend.",
      "example_cn": "上周六，亚利桑那野猫队在一场激动人心的加时赛中击败了对手。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cat",
      "analysis": "“Cat”（猫）泛指所有猫科动物，包括家猫和野生种类，是一个通用词。而 “wildcat” 特指未被驯化的野生猫科动物，强调其野性、自然状态和非家养属性，语义更具体、更具生态指向性。"
    },
    {
      "word_to_compare": "strike",
      "analysis": "“Strike”（罢工）是中性术语，泛指任何形式的集体停工行为，无论是否合法或有组织。而 “wildcat strike” 是其子类，特指未经工会授权、自发且通常违法的罢工，带有强烈的非正式性和对抗性含义。"
    },
    {
      "word_to_compare": "prospect",
      "analysis": "“Prospect”（勘探者/前景）指寻找资源（如石油）的人或可能性，是一个抽象或职业性名词。而 “wildcat” 在石油语境中特指非法钻探行为本身或钻探者，带有冒险、非法和投机的色彩，语义更具体且具贬义或俚语色彩。"
    }
  ]
}