{
  "word": "will",
  "pronunciation": "wil",
  "concise_definition": "n. 意志, 意愿; v. 将要, 意愿, 遗嘱",
  "forms": {
    "third_person_singular": "wills",
    "past_tense": "would",
    "past_participle": "willed",
    "present_participle": "willing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The mental faculty by which a person decides on and commits to a course of action; determination or resolve.",
      "explanation_cn": "指人决定并坚持某种行动方案的心理能力；即意志力或决心。",
      "example_en": "She showed great will in overcoming her injuries and returning to competition.",
      "example_cn": "她在克服伤痛并重返赛场的过程中展现了非凡的意志。"
    },
    {
      "pos": "noun",
      "explanation_en": "A legal document that specifies how a person's assets should be distributed after their death.",
      "explanation_cn": "指一种法律文件，规定一个人去世后其财产的分配方式。",
      "example_en": "He left his entire estate to charity in his will.",
      "example_cn": "他在遗嘱中将全部财产捐给了慈善机构。"
    },
    {
      "pos": "verb",
      "explanation_en": "To express a future intention or prediction, often used as an auxiliary verb to indicate what is going to happen.",
      "explanation_cn": "用作助动词，表示将来意图或预测，指某事即将发生。",
      "example_en": "I will call you as soon as I arrive.",
      "example_cn": "我一到就会给你打电话。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause or bring about something by strong desire or determination; to wish for something intensely.",
      "explanation_cn": "通过强烈的愿望或决心促使某事发生；强烈希望某事实现。",
      "example_en": "She willed herself to stay calm during the emergency.",
      "example_cn": "她竭力让自己在紧急情况下保持冷静。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "shall",
      "analysis": "“Shall” 与 “will” 都可表示将来，但 “shall” 更正式，传统上用于第一人称（I/we）表示将来，或用于第二、三人称表示命令、承诺或法律义务。现代英语中，“will” 已基本取代 “shall” 的所有用法，仅在正式文书或法律语境中保留 “shall”。"
    },
    {
      "word_to_compare": "want",
      "analysis": "“Want” (想要) 表达的是主观愿望或需求，不一定伴随行动意图；而 “will” 作为动词时，强调通过意志力主动促成结果，具有更强的主动性与决定性。例如：I want to quit（我想辞职）vs. I will quit（我决心辞职）。"
    },
    {
      "word_to_compare": "would",
      "analysis": "“Would” 是 “will” 的过去式，用于虚拟语气、礼貌请求或假设情境，表达非现实的将来或可能性。而 “will” 表示真实、确定或强烈的将来意图。例如：I will go（我会去）vs. I would go if I could（如果可能的话我会去）。"
    }
  ]
}