{
  "word": "wilmington",
  "pronunciation": "wil·ming·tun",
  "concise_definition": "n. 威明顿（美国地名）",
  "forms": {
    "plural": "Wilmingtons"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A city name in the United States, most commonly referring to Wilmington, Delaware, a historic port city on the Christina River, known for its financial services industry and colonial architecture.",
      "explanation_cn": "美国地名，通常指特拉华州的威明顿市，位于克里斯蒂娜河畔，是一座历史悠久的港口城市，以金融服务产业和殖民时期建筑闻名。",
      "example_en": "Wilmington, Delaware, is home to many corporate headquarters due to its business-friendly legal environment.",
      "example_cn": "特拉华州的威明顿市因其友好的商业法律环境，成为众多企业总部的所在地。"
    },
    {
      "pos": "noun",
      "explanation_en": "A city in North Carolina, located near the Atlantic coast, known for its historic downtown, riverfront parks, and as a filming location for numerous movies and TV shows.",
      "explanation_cn": "北卡罗来纳州的一个城市，位于大西洋沿岸附近，以其历史悠久的市中心、河滨公园以及作为众多电影和电视剧的拍摄地而闻名。",
      "example_en": "Many scenes from 'One Tree Hill' were filmed in Wilmington, North Carolina.",
      "example_cn": "电视剧《一棵树》的许多场景都在北卡罗来纳州的威明顿拍摄。"
    },
    {
      "pos": "noun",
      "explanation_en": "A smaller town or neighborhood in other U.S. states, such as Wilmington, Illinois or Wilmington, Massachusetts, often named after the original city in Delaware.",
      "explanation_cn": "美国其他州的较小城镇或社区，如伊利诺伊州或马萨诸塞州的威明顿，通常以特拉华州的原城市命名。",
      "example_en": "Wilmington, Massachusetts, is a quiet suburban town with a population of just over 10,000.",
      "example_cn": "马萨诸塞州的威明顿是一个宁静的郊区城镇，人口刚过一万。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "city",
      "analysis": "“City”（城市）是一个通用名词，泛指任何人口密集、具有行政和经济功能的都市区域。而 “Wilmington” 是一个专有名词，特指美国多个具体地点中的某一个，不具备通用性。"
    },
    {
      "word_to_compare": "town",
      "analysis": "“Town”（城镇）通常指规模小于城市的居民区，但 “Wilmington” 可以是城市（如特拉华州）也可以是城镇（如马萨诸塞州），因此它本身不决定规模，而是由其行政地位和人口决定。"
    },
    {
      "word_to_compare": "place",
      "analysis": "“Place”（地方）是最宽泛的地理术语，可指任何地点，从一个房间到一个国家。“Wilmington” 是一个具体的、命名的地点，具有明确的地理、历史和文化身份，比 “place” 更精确、更具指向性。"
    }
  ]
}