{
  "word": "wilt",
  "pronunciation": "wilt",
  "concise_definition": "v. 枯萎, 萎蔫; n. 枯萎状态",
  "forms": {
    "third_person_singular": "wilts",
    "past_tense": "wilted",
    "past_participle": "wilted",
    "present_participle": "wilting"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To lose freshness and rigidity, especially in plants, due to lack of water, heat, or stress, causing them to droop or sag.",
      "explanation_cn": "指植物因缺水、高温或压力而失去新鲜度和挺拔状态，变得下垂或软弱无力。",
      "example_en": "The flowers wilted in the hot sun after being left without water for a day.",
      "example_cn": "这些花在烈日下缺水一天后就枯萎了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To lose courage, strength, or determination, often under pressure or adversity; to become discouraged or weakened emotionally.",
      "explanation_cn": "指在压力或逆境中失去勇气、力量或决心，情绪上变得沮丧或软弱。",
      "example_en": "As the debate continued, his confidence began to wilt under the opponent's sharp questions.",
      "example_cn": "随着辩论的进行，他在对手尖锐的问题下逐渐失去了信心。"
    },
    {
      "pos": "noun",
      "explanation_en": "The state or condition of being wilted, especially in plants; a visible sign of decay or loss of vitality.",
      "explanation_cn": "指植物枯萎的状态，或生命力丧失的明显迹象。",
      "example_en": "The gardener removed the wilt from the rose bushes to encourage new growth.",
      "example_cn": "园丁清除了玫瑰丛上的枯萎部分，以促进新芽生长。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fade",
      "analysis": "“Fade” (褪色/逐渐消失) 主要指颜色、声音或存在感的逐渐减弱或消退，常用于描述视觉或听觉上的渐变过程，如布料褪色、记忆模糊。而 “wilt” 更强调因外部压力（如缺水、疲劳）导致的物理性下垂或生命力丧失，具有更强的生理或形态变化特征。"
    },
    {
      "word_to_compare": "droop",
      "analysis": "“Droop” (下垂) 描述的是物体因重力或无力而自然垂下的状态，可以是花、树枝、耳朵等，不一定由缺水或压力引起，也可能只是生理结构所致。而 “wilt” 通常隐含了因环境压力（如干旱、高温）导致的病态性下垂，带有负面的衰败含义。"
    },
    {
      "word_to_compare": "decline",
      "analysis": "“Decline” (衰退/下降) 是一个更广泛、更抽象的词，可用于描述数量、质量、健康、权力等的逐步下降，常用于社会、经济或健康语境。而 “wilt” 更具象，多用于植物或情绪的即时性衰弱，强调一种可见的、物理性的崩溃过程，而非长期趋势。"
    }
  ]
}