{
  "word": "wind",
  "pronunciation": "wīnd",
  "concise_definition": "n. 风, 气流; v. 缠绕, 盘绕, 使蜿蜒行进",
  "forms": {
    "third_person_singular": "winds",
    "past_tense": "wound",
    "past_participle": "wound",
    "present_participle": "winding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The natural movement of air, especially a strong or noticeable current, caused by differences in atmospheric pressure.",
      "explanation_cn": "指由于大气压力差异引起的自然空气流动，尤指强劲或明显的气流。",
      "example_en": "The wind howled through the trees during the storm.",
      "example_cn": "暴风雨中，风在树间呼啸而过。"
    },
    {
      "pos": "noun",
      "explanation_en": "A general term for air in motion, often used in phrases to describe direction or strength (e.g., north wind, strong wind).",
      "explanation_cn": "泛指运动中的空气，常用于表示方向或强度的短语中（如北风、强风）。",
      "example_en": "Sailing ships rely on the wind to propel them forward.",
      "example_cn": "帆船依靠风力前进。"
    },
    {
      "pos": "verb",
      "explanation_en": "To turn or twist something repeatedly around an object, often to coil or wrap it tightly.",
      "explanation_cn": "指反复围绕某物转动，通常是为了紧密缠绕或盘绕。",
      "example_en": "She wound the yarn around the spool to store it neatly.",
      "example_cn": "她把毛线绕在线轴上以便整齐存放。"
    },
    {
      "pos": "verb",
      "explanation_en": "To follow a twisting or turning path, especially when describing roads, rivers, or routes.",
      "explanation_cn": "指沿着曲折或蜿蜒的路径行进，常用于描述道路、河流或路线。",
      "example_en": "The road winds through the mountains for miles.",
      "example_cn": "这条路蜿蜒数英里穿过群山。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause something to move in a twisting or spiraling motion, often used metaphorically (e.g., wind a clock, wind up a person).",
      "explanation_cn": "指使某物以扭曲或螺旋方式运动，常用于比喻义（如上发条、激怒某人）。",
      "example_en": "He wound the antique pocket watch every morning.",
      "example_cn": "他每天早上都会给那块古董怀表上发条。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "breeze",
      "analysis": "“Breeze”（微风）特指轻柔、温和的风，通常令人愉悦，强度远低于 “wind”。而 “wind” 是一个更广泛、中性的术语，可指从轻微到猛烈的各种气流，甚至带有破坏性。"
    },
    {
      "word_to_compare": "air",
      "analysis": "“Air”（空气）是物理上存在的气体混合物，是风的载体，但本身不包含运动含义；而 “wind” 强调空气的动态流动。可以说 ‘air is everywhere’, 但 ‘wind is moving air’. "
    },
    {
      "word_to_compare": "twist",
      "analysis": "“Twist”（扭转）强调单次或局部的旋转动作，常用于物体的物理变形；而 “wind” 作为动词时，强调持续、环绕性的缠绕或蜿蜒过程，常涉及较长路径或多次循环，如 winding road 或 winding a thread。"
    }
  ]
}