{
  "word": "window",
  "pronunciation": "win·doh",
  "concise_definition": "n. 窗户, 窗口, 时机, 机会",
  "forms": {
    "plural": "windows"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An opening in a wall or roof of a building, typically fitted with glass, to allow light and air to enter and provide a view outward.",
      "explanation_cn": "建筑物墙壁或屋顶上的开口，通常装有玻璃，用于让光线和空气进入，并提供向外的视野。",
      "example_en": "She sat by the window, watching the rain fall on the street below.",
      "example_cn": "她坐在窗边，看着雨滴落在下方的街道上。"
    },
    {
      "pos": "noun",
      "explanation_en": "A period of time during which a particular activity or opportunity is possible, often limited or restricted.",
      "explanation_cn": "指某个特定活动或机会可以进行的一段有限时间，通常具有时间限制。",
      "example_en": "There's a narrow window of opportunity to submit your application before the deadline.",
      "example_cn": "在截止日期前，提交申请的机会窗口非常短暂。"
    },
    {
      "pos": "noun",
      "explanation_en": "A display area on a computer screen that shows a separate application or set of information, often resizable and movable.",
      "explanation_cn": "计算机屏幕上显示独立应用程序或信息的区域，通常可调整大小和移动。",
      "example_en": "I opened a new window in my browser to check the weather.",
      "example_cn": "我在浏览器中打开一个新窗口查看天气。"
    },
    {
      "pos": "noun",
      "explanation_en": "A display case or section in a store, often used to showcase products or advertisements to attract customers.",
      "explanation_cn": "商店中用于展示商品或广告以吸引顾客的展示柜或区域。",
      "example_en": "The boutique had an elegant window display featuring the latest summer collection.",
      "example_cn": "这家精品店有一个精美的橱窗展示，陈列着最新的夏季系列。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pane",
      "analysis": "“Pane”（窗格）特指窗户中的一块玻璃或玻璃单元，是“window”的组成部分。它强调物理结构中的单一组件，而 “window” 指的是整个开口结构及其框架系统。"
    },
    {
      "word_to_compare": "viewport",
      "analysis": "“Viewport”（视口）是网页设计或图形界面中的术语，指用户当前可见的屏幕区域，常用于技术语境。它与 “window” 在计算机界面中部分重叠，但 “viewport” 更强调内容的可见范围，而非可操作的窗口容器。"
    },
    {
      "word_to_compare": "opportunity",
      "analysis": "“Opportunity”（机会）泛指有利的时机或条件，是抽象概念；而 “window” 作为“时机”使用时，强调时间的有限性和紧迫性，如 “window of opportunity” 是一个固定搭配，带有时间窗口的隐喻色彩。"
    }
  ]
}