{
  "word": "wing",
  "pronunciation": "wɪŋ",
  "concise_definition": "n. 翅膀, 机翼, 侧翼, 附楼; v. 飞行, 用翅膀飞",
  "forms": {
    "plural": "wings",
    "third_person_singular": "wings",
    "past_tense": "winged",
    "past_participle": "winged",
    "present_participle": "winging"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The paired appendages of birds, bats, or insects used for flight, consisting of a framework of bones or veins covered with feathers or membrane.",
      "explanation_cn": "鸟类、蝙蝠或昆虫用于飞行的成对附属器官，由骨骼或脉络支撑并覆盖羽毛或膜状结构。",
      "example_en": "The eagle spread its wings and soared into the sky.",
      "example_cn": "鹰展开翅膀，翱翔于天空。"
    },
    {
      "pos": "noun",
      "explanation_en": "The part of an aircraft that generates lift and allows it to fly, typically extending horizontally from the fuselage.",
      "explanation_cn": "飞机上产生升力、使其能够飞行的部分，通常从机身水平延伸而出。",
      "example_en": "The plane's wing was damaged during the storm.",
      "example_cn": "飞机的机翼在风暴中受损。"
    },
    {
      "pos": "noun",
      "explanation_en": "A distinct section or faction within a political party, organization, or group, often representing a specific ideological stance.",
      "explanation_cn": "政党、组织或团体中具有特定意识形态立场的独立分支或派系。",
      "example_en": "The left wing of the party advocates for stronger social welfare policies.",
      "example_cn": "该党左翼主张实施更强有力的社会福利政策。"
    },
    {
      "pos": "noun",
      "explanation_en": "A lateral extension or annex of a building, such as a wing of a hospital or a mansion.",
      "explanation_cn": "建筑物的侧翼或附属部分，如医院或豪宅的侧楼。",
      "example_en": "The new pediatric wing opened last month.",
      "example_cn": "新的儿科侧楼上个月投入使用。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fly or move through the air using wings, often with a sense of speed or grace.",
      "explanation_cn": "用翅膀在空中飞行或移动，常带有速度或优雅的意味。",
      "example_en": "The bird winged its way south for the winter.",
      "example_cn": "这只鸟振翅南飞过冬。"
    },
    {
      "pos": "verb",
      "explanation_en": "To provide or equip with wings, often metaphorically, such as giving someone the means to succeed or move forward.",
      "explanation_cn": "给予（某人或某物）翅膀，常用于比喻，指赋予某人成功或前进的能力。",
      "example_en": "The scholarship winged her toward a brighter future.",
      "example_cn": "这项奖学金为她铺就了更光明的未来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "feather",
      "analysis": "“Feather”（羽毛）是翅膀的组成部分，强调的是覆盖在翅膀表面的轻质结构，用于保温、飞行或展示。而 “wing” 是包含骨骼、肌肉和羽毛的整体飞行器官。前者是部分，后者是整体。"
    },
    {
      "word_to_compare": "side",
      "analysis": "“Side”（侧面）是一个通用词，泛指任何物体的边缘或一侧，无特定结构含义。而 “wing” 作为“侧翼”时，特指建筑、组织或军队中具有功能性的延伸部分，常带有组织性或结构性的含义，比 “side” 更具体、更专业。"
    },
    {
      "word_to_compare": "flight",
      "analysis": "“Flight”（飞行）是动作或过程，指在空中移动的行为或状态，而 “wing” 是实现飞行的物理工具或结构。前者是功能，后者是载体。例如：鸟的翅膀（wing）使其能够飞行（flight）。"
    }
  ]
}