{
  "word": "wings",
  "pronunciation": "wɪŋz",
  "concise_definition": "n. 翅膀, 机翼, 侧翼, 附属部分",
  "forms": {
    "singular": "wing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The paired, thin, flat appendages on the bodies of birds, bats, or insects, used for flight.",
      "explanation_cn": "鸟类、蝙蝠或昆虫身体两侧用于飞行的成对薄而扁平的附属器官。",
      "example_en": "The eagle spread its wings and soared into the sky.",
      "example_cn": "鹰张开翅膀，翱翔于天空。"
    },
    {
      "pos": "noun",
      "explanation_en": "The extended, horizontal surfaces on an aircraft that provide lift and stability during flight.",
      "explanation_cn": "飞机上用于提供升力和飞行稳定性的水平延伸表面，即机翼。",
      "example_en": "The plane's wings were covered in ice after the storm.",
      "example_cn": "风暴过后，飞机的机翼上覆盖了一层冰。"
    },
    {
      "pos": "noun",
      "explanation_en": "A distinct section or part of a building, organization, or group that extends from a central body, often serving a specialized function.",
      "explanation_cn": "建筑物、组织或团体中从主体延伸出来的独立部分，通常承担特定职能，如图书馆的阅览室、政党的左翼或右翼。",
      "example_en": "The left wing of the party advocates for stronger social welfare policies.",
      "example_cn": "该党左翼主张实施更强有力的社会福利政策。"
    },
    {
      "pos": "noun",
      "explanation_en": "A dish of fried chicken or other meat, typically served as an appetizer or snack, especially in American cuisine.",
      "explanation_cn": "一种油炸鸡翅或其他肉类制成的菜肴，常作为开胃菜或小吃，尤其在美国饮食中常见。",
      "example_en": "We ordered a plate of buffalo wings for the game night.",
      "example_cn": "我们为游戏之夜点了一盘水牛城鸡翅。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "feathers",
      "analysis": "“Feathers”（羽毛）是鸟类翅膀表面覆盖的细小结构，主要功能是保温、防水和辅助飞行，但本身不是飞行器官。而 “wings” 是包含骨骼、肌肉和羽毛的整体飞行结构。前者是组成部分，后者是功能实体。"
    },
    {
      "word_to_compare": "appendage",
      "analysis": "“Appendage”（附属物）是一个更广泛的生物学术语，泛指身体上任何突出或附加的部分，如触角、尾巴或肢体。而 “wings” 是一种特定类型的 appendage，专指用于飞行的结构，语义更具体、功能更明确。"
    },
    {
      "word_to_compare": "side",
      "analysis": "“Side”（侧面）泛指物体或组织的某一侧，常用于空间或方位描述，如“建筑的侧面”或“立场的两面”。而 “wing” 在比喻义中特指组织或政党的一个分支，带有组织结构和意识形态的内涵，比 “side” 更具结构性和政治性。"
    }
  ]
}