{
  "word": "wingers",
  "pronunciation": "wing·gers",
  "concise_definition": "n. 边锋, 侧翼球员, 边缘支持者",
  "forms": {
    "singular": "winger"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "In team sports such as soccer, rugby, or hockey, a player who operates primarily along the sidelines or flanks of the field, responsible for attacking down the wings and creating scoring opportunities.",
      "explanation_cn": "在足球、橄榄球或冰球等团队运动中，主要在球场边线或两侧活动的球员，负责沿边路进攻并创造得分机会。",
      "example_en": "The team's left winger scored a stunning goal by cutting inside from the baseline.",
      "example_cn": "球队的左边锋从底线内切，打入了一记精彩进球。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who holds extreme views, especially in politics, and is positioned on the far left or far right of the political spectrum.",
      "explanation_cn": "指在政治上持有极端观点的人，通常位于政治光谱的极左或极右位置。",
      "example_en": "The party has been accused of being dominated by far-right wingers who oppose all immigration.",
      "example_cn": "该政党被指责被极右翼边缘分子主导，他们反对所有移民。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who supports or advocates for a cause from the periphery rather than the center, often in social or cultural movements.",
      "explanation_cn": "指在社会或文化运动中，从边缘而非核心立场支持或倡导某种主张的人。",
      "example_en": "The film festival attracted many wingers who championed avant-garde and unconventional storytelling.",
      "example_cn": "这个电影节吸引了许多边缘支持者，他们推崇前卫和非传统的叙事方式。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "flankers",
      "analysis": "“Flankers”（边锋/侧翼队员）在橄榄球中特指位置靠近边线的前锋，主要负责争球和防守，强调身体对抗和战术位置；而 “wingers” 在足球或冰球中更侧重速度与突破，是进攻型角色，不强调身体冲撞。"
    },
    {
      "word_to_compare": "extremists",
      "analysis": "“Extremists”（极端分子）是政治或意识形态上的贬义词，泛指任何持极端立场的人，语义更广泛且常含负面评价；而 “wingers” 在政治语境中是中性或描述性术语，特指政治光谱两端的群体，常用于媒体或学术分析，语气相对客观。"
    },
    {
      "word_to_compare": "supporters",
      "analysis": "“Supporters”（支持者）泛指任何支持某人、团体或理念的人，范围广泛，不强调立场的极端性或边缘性；而 “wingers” 特指那些处于主流之外、立场激进的支持者，隐含了‘非中心’或‘非主流’的语义色彩。"
    }
  ]
}