{
  "word": "wink",
  "pronunciation": "wɪŋk",
  "concise_definition": "v. 眨眼, 暗示; n. 眨眼, 暗号",
  "forms": {
    "third_person_singular": "winks",
    "past_tense": "winked",
    "past_participle": "winked",
    "present_participle": "winking"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To close and open one eye quickly, often as a nonverbal signal to convey a secret message, amusement, or flirtation.",
      "explanation_cn": "迅速闭上并睁开一只眼睛，通常作为非语言信号，传达秘密信息、幽默感或调情的意图。",
      "example_en": "She winked at him across the room, letting him know she was in on the joke.",
      "example_cn": "她隔着房间朝他眨了眨眼，暗示她知道这个笑话的内情。"
    },
    {
      "pos": "verb",
      "explanation_en": "To subtly suggest or imply something without stating it directly, often in a playful or conspiratorial manner.",
      "explanation_cn": "以含蓄、戏谑或心照不宣的方式暗示某事，而不直接明说。",
      "example_en": "The politician winked at the audience when he mentioned tax reform, signaling his support without saying it outright.",
      "example_cn": "当这位政客提到税制改革时，他朝观众眨了眨眼，暗示他支持这一政策，却未明言。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act of closing and opening one eye quickly, especially when used as a gesture or signal.",
      "explanation_cn": "迅速闭上并睁开一只眼睛的动作，尤指用作手势或信号时。",
      "example_en": "He gave her a playful wink as he handed her the gift.",
      "example_cn": "他递给她礼物时，调皮地朝她眨了眨眼。"
    },
    {
      "pos": "noun",
      "explanation_en": "A very short period of time, often used in the phrase 'in a wink'.",
      "explanation_cn": "极短的一段时间，常用于短语 'in a wink'（一眨眼间）。",
      "example_en": "The thief vanished in a wink, leaving no trace behind.",
      "example_cn": "小偷一眨眼就消失了，没留下任何痕迹。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "blink",
      "analysis": "“Blink”（眨眼）指双目自然、无意识地快速闭合与睁开，是一种生理反射，通常不带有交流意图。而 “wink” 是有意识地只闭一只眼，目的是传递某种信息或情感，具有明确的社交或象征意义。"
    },
    {
      "word_to_compare": "glance",
      "analysis": "“Glance”（瞥一眼）指快速地看某物，强调视觉动作的方向和短暂性，但不涉及眼部的闭合动作。而 “wink” 是眼部的特定动作，常用于非语言沟通，与视觉注视无关。"
    },
    {
      "word_to_compare": "nod",
      "analysis": "“Nod”（点头）是头部的上下运动，通常表示同意、理解或打招呼，是一种更正式或普遍的肢体语言。而 “wink” 是眼部动作，更具私密性、戏谑性或暗示性，常用于亲密或非正式语境中。"
    }
  ]
}