{
  "word": "wipe",
  "pronunciation": "waip",
  "concise_definition": "v. 擦, 擦去, 擦干; n. 擦拭, 擦布",
  "forms": {
    "third_person_singular": "wipes",
    "past_tense": "wiped",
    "past_participle": "wiped",
    "present_participle": "wiping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To rub a surface with a cloth, tissue, or other material in order to remove dirt, moisture, or other substances.",
      "explanation_cn": "用布、纸巾或其他材料擦拭表面，以去除污垢、湿气或其他物质。",
      "example_en": "She wiped the counter with a damp cloth to clean up the spilled juice.",
      "example_cn": "她用一块湿布擦拭台面，清理洒出的果汁。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove or eliminate something completely, often abruptly or forcefully, as if by wiping it away.",
      "explanation_cn": "彻底、突然或强力地清除某物，仿佛将其抹去一般。",
      "example_en": "The storm wiped out the entire village in just a few hours.",
      "example_cn": "这场风暴在短短几小时内将整个村庄夷为平地。"
    },
    {
      "pos": "verb",
      "explanation_en": "To erase or delete data, especially from a digital device or storage medium.",
      "explanation_cn": "删除数据，尤其是从数字设备或存储介质中清除信息。",
      "example_en": "Before selling the laptop, I wiped all personal files from the hard drive.",
      "example_cn": "在出售笔记本电脑之前，我清除了硬盘中的所有个人文件。"
    },
    {
      "pos": "noun",
      "explanation_en": "A piece of material used for cleaning or drying, such as a cloth, tissue, or paper towel.",
      "explanation_cn": "用于清洁或擦干的材料片，如布、纸巾或厨房纸。",
      "example_en": "He grabbed a wipe from the box to clean his hands after eating.",
      "example_cn": "他从盒子里抽出一张湿巾，吃完后擦了擦手。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "clean",
      "analysis": "“Clean” (清洁) 是一个更广泛的术语，泛指使某物变得干净，可能包括冲洗、吸尘、消毒等多种方式。而 “wipe” 特指通过摩擦表面来清除污物，动作更具体、更依赖物理接触。"
    },
    {
      "word_to_compare": "erase",
      "analysis": "“Erase” (擦除) 主要用于去除书写、绘画或数字信息，强调移除痕迹或内容，常用于铅笔字迹或电子数据。而 “wipe” 在数字语境中更强调彻底清除，常含数据不可恢复的意味，且可应用于物理表面。"
    },
    {
      "word_to_compare": "sweep",
      "analysis": "“Sweep” (清扫) 指用扫帚等工具横向移动以清除灰尘或碎屑，通常作用于较大面积的地面或表面，动作是扫动而非按压摩擦。而 “wipe” 是垂直或贴合表面的摩擦动作，适用于小范围、精细清洁。"
    }
  ]
}