{
  "word": "wiped",
  "pronunciation": "wīpt",
  "concise_definition": "v. 擦去, 擦净, 擦掉; (非正式) 彻底击败, 消灭",
  "forms": {
    "base_form": "wipe",
    "present_participle": "wiping",
    "past_tense": "wiped",
    "past_participle": "wiped",
    "third_person_singular": "wipes"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To remove dirt, moisture, or other substances from a surface by rubbing it with a cloth, tissue, or similar object.",
      "explanation_cn": "指用布、纸巾或其他物品擦拭表面，以去除污垢、水分或其他物质。",
      "example_en": "She wiped the counter with a damp cloth to clean up the spilled juice.",
      "example_cn": "她用一块湿布擦拭台面，清理洒出的果汁。"
    },
    {
      "pos": "verb",
      "explanation_en": "To completely remove or erase something, such as data, memories, or traces, often permanently.",
      "explanation_cn": "指彻底清除或抹去某物，如数据、记忆或痕迹，通常具有永久性。",
      "example_en": "The hacker wiped the entire database, leaving no trace of the original records.",
      "example_cn": "黑客删除了整个数据库，原始记录一丝不剩。"
    },
    {
      "pos": "verb",
      "explanation_en": "To defeat someone decisively or overwhelmingly, especially in a competition or conflict (informal usage).",
      "explanation_cn": "（非正式）指在比赛或冲突中彻底击败某人，常带有压倒性优势的含义。",
      "example_en": "Our team wiped the opponents off the field with a 10–0 victory.",
      "example_cn": "我们的球队以10比0的比分彻底击败了对手。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause someone to lose consciousness or feel extremely exhausted, often due to illness, emotion, or physical strain.",
      "explanation_cn": "指因疾病、情绪或体力透支而导致某人失去意识或感到极度疲惫。",
      "example_en": "The heat wiped him out—he had to lie down for an hour.",
      "example_cn": "高温把他累垮了——他不得不躺下休息一个小时。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "clean",
      "analysis": "“Clean” (清洁) 是一个更广泛、更中性的词，泛指使某物变得干净，不特指擦拭动作。它可以包括冲洗、吸尘、消毒等多种方式。而 “wipe” 强调通过摩擦动作去除表面污物，动作更具体、更直接。"
    },
    {
      "word_to_compare": "erase",
      "analysis": "“Erase” (擦除) 主要用于抽象或书面内容的清除，如铅笔字迹、数字数据或记忆，常带有“不可逆”的意味。而 “wipe” 在清除数据时更口语化，也可用于物理表面，适用范围更广。"
    },
    {
      "word_to_compare": "defeat",
      "analysis": "“Defeat” (击败) 是正式用语，用于描述在竞争、战争或比赛中战胜对手，强调结果。而 “wipe” 在非正式语境中表示“彻底击败”，语气更强、更具形象性，常带有一种碾压式的意味，如 ‘wiped the floor with them’。"
    }
  ]
}