{
  "word": "wiping",
  "pronunciation": "wahy-ping",
  "concise_definition": "v. 擦拭, 擦去, 擦干; n. 擦拭动作",
  "forms": {
    "base_form": "wipe",
    "third_person_singular": "wipes",
    "past_tense": "wiped",
    "past_participle": "wiped",
    "present_participle": "wiping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To clean or dry a surface by rubbing it with a cloth, tissue, or other material, often to remove dirt, moisture, or unwanted substances.",
      "explanation_cn": "用布、纸巾或其他材料擦拭表面，以清除污垢、水分或不需要的物质。",
      "example_en": "She was wiping the kitchen counter after preparing dinner.",
      "example_cn": "她做完晚饭后正在擦拭厨房台面。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove or eliminate something completely, often by force or repeatedly, as if by rubbing it away.",
      "explanation_cn": "通过反复擦拭或强力动作彻底清除某物，仿佛将其擦去一般。",
      "example_en": "The storm wiped out the entire village.",
      "example_cn": "这场风暴将整个村庄夷为平地。"
    },
    {
      "pos": "verb",
      "explanation_en": "To erase or delete digital data, especially from a storage device, to make it unrecoverable.",
      "explanation_cn": "从存储设备中彻底删除数字数据，使其无法恢复。",
      "example_en": "Before selling the laptop, he wiped all personal files from the hard drive.",
      "example_cn": "在出售笔记本电脑之前，他将硬盘中的所有个人文件彻底删除了。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or instance of wiping something; a single motion of cleaning or removing by rubbing.",
      "explanation_cn": "擦拭的动作或一次擦拭行为；通过摩擦进行清洁或清除的单次动作。",
      "example_en": "A quick wipe of the mirror removed the fog from the shower.",
      "example_cn": "轻轻一擦，镜子上的水汽就消失了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "clean",
      "analysis": "“Clean”（清洁）是一个更广泛的术语，泛指使某物变得干净，可以包括冲洗、吸尘、消毒等多种方式。而 “wiping” 特指通过物理摩擦（通常用布或纸）来清除表面污物，动作更具体、更局部。"
    },
    {
      "word_to_compare": "eradicate",
      "analysis": "“Eradicate”（根除）强调彻底消灭某种有害事物（如疾病、恶习），常用于抽象或宏观语境，带有强烈的政治或科学意味。而 “wiping” 在比喻用法中虽可表示清除，但语气更口语化、动作感更强，常用于物理或数字层面的清除。"
    },
    {
      "word_to_compare": "sweep",
      "analysis": "“Sweep”（清扫）通常指用扫帚等工具横向或大面积地清除灰尘或碎屑，动作范围广、方向性强。而 “wiping” 更侧重于垂直或局部的摩擦动作，常用于小面积、精细的清洁，如桌面、屏幕或玻璃。"
    }
  ]
}