{
  "word": "wired",
  "pronunciation": "wīrd",
  "concise_definition": "adj. 连接的, 紧张的, 精神亢奋的; n. 有线电视/网络系统",
  "forms": {
    "comparative": "wirder",
    "superlative": "wirdest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Connected to a network or system using physical cables, especially for electricity, data, or telecommunications.",
      "explanation_cn": "指通过物理电缆连接到网络、电力系统或电信系统，尤指用于数据传输或通信。",
      "example_en": "The office is fully wired for high-speed internet and phone lines.",
      "example_cn": "这个办公室已全面布线，支持高速互联网和电话线路。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Feeling nervous, tense, or overstimulated, often due to caffeine, adrenaline, or stress.",
      "explanation_cn": "形容因咖啡因、肾上腺素或压力而感到紧张、不安或精神亢奋的状态。",
      "example_en": "After three espressos, she was completely wired and couldn't sit still.",
      "example_cn": "喝了三杯浓缩咖啡后，她完全亢奋得坐立不安。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Innately intelligent, perceptive, or attuned to technology and modern trends, often used informally to describe someone who is tech-savvy.",
      "explanation_cn": "非正式用法，形容天生对科技敏感、理解力强或紧跟现代潮流的人，常指‘懂技术’的人。",
      "example_en": "The kids are so wired—they know how to use every new app before it’s even released.",
      "example_cn": "这些孩子太懂科技了，新应用还没发布他们就会用了。"
    },
    {
      "pos": "noun",
      "explanation_en": "A system of cables or wires used for transmitting electricity, data, or signals, especially in broadcasting or telecommunications.",
      "explanation_cn": "指用于传输电力、数据或信号的电缆系统，尤指广播电视或电信领域中的有线基础设施。",
      "example_en": "The city is upgrading its wired infrastructure to support 5G backhaul.",
      "example_cn": "该城市正在升级其有线基础设施以支持5G回传。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "connected",
      "analysis": "“Connected” (连接的) 是一个更通用的词，可指任何形式的联系，包括数字、社交或情感联系，不一定依赖物理线路。而 “wired” 特指通过电缆实现的物理连接，技术语境中更精确。"
    },
    {
      "word_to_compare": "nervous",
      "analysis": "“Nervous” (紧张的) 是描述焦虑或不安的通用词，适用于各种情境。而 “wired” 更强调由外部刺激（如咖啡因或兴奋剂）引起的过度兴奋和无法平静的状态，带有更强烈的生理反应色彩。"
    },
    {
      "word_to_compare": "tech-savvy",
      "analysis": "“Tech-savvy” (懂技术的) 是一个明确描述技术能力的褒义词，专指对科技产品有理解和使用能力。而 “wired” 在此语境下是口语化表达，含义更模糊，可能包含天赋、直觉或天生适应力，不完全等同于技能水平。"
    }
  ]
}