{
  "word": "wish",
  "pronunciation": "wish",
  "concise_definition": "n. 愿望, 心愿; v. 希望, 祝愿",
  "forms": {
    "third_person_singular": "wishes",
    "past_tense": "wished",
    "past_participle": "wished",
    "present_participle": "wishing"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A desire or hope for something, often something difficult to achieve or unlikely to happen, especially when expressed with a sense of longing or fantasy.",
      "explanation_cn": "指一种渴望或希望得到某物，通常指难以实现或不太可能发生的事，常带有向往或幻想的色彩。",
      "example_en": "Her only wish was to travel the world before she turned thirty.",
      "example_cn": "她唯一的愿望是在三十岁前环游世界。"
    },
    {
      "pos": "noun",
      "explanation_en": "An expression of goodwill or a polite request, often used in formal or ceremonial contexts (e.g., on holidays or at celebrations).",
      "explanation_cn": "指在正式或庆典场合中表达的良好祝愿或礼貌请求，常用于节日或庆祝活动中。",
      "example_en": "We send our best wishes for your recovery.",
      "example_cn": "我们衷心祝愿你早日康复。"
    },
    {
      "pos": "verb",
      "explanation_en": "To desire or hope for something, especially something unattainable or unlikely, often followed by a that-clause or infinitive.",
      "explanation_cn": "指渴望或希望得到某物，尤其指难以实现或不太可能实现的事，常接 that 从句或不定式。",
      "example_en": "I wish I could go back in time and change my decision.",
      "example_cn": "我真希望能回到过去改变我的决定。"
    },
    {
      "pos": "verb",
      "explanation_en": "To express a polite or formal desire for someone’s well-being, success, or happiness, especially on special occasions.",
      "explanation_cn": "指在特殊场合中，礼貌或正式地表达对他人幸福、成功或安康的祝愿。",
      "example_en": "They wished him a happy birthday at the party.",
      "example_cn": "他们在聚会上向他祝生日快乐。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "desire",
      "analysis": "“Desire” (渴望) 比 “wish” 更强烈、更主动，常用于表达深层的、持久的内在需求，多用于正式语境。而 “wish” 更偏向于轻柔、短暂或不切实际的愿望，有时带有幻想色彩。"
    },
    {
      "word_to_compare": "hope",
      "analysis": "“Hope” (希望) 通常基于现实可能性，带有乐观期待；而 “wish” 常用于表达对不可能或极不可能发生之事的渴望，常伴随虚拟语气（如 I wish I were...）。因此，hope 更务实，wish 更理想化。"
    },
    {
      "word_to_compare": "want",
      "analysis": "“Want” (想要) 是最直接、最日常的表达需求或欲望的词，语气中性且普遍；而 “wish” 更具情感色彩，常用于表达遗憾、无奈或对理想状态的向往，语气更委婉或诗意。"
    }
  ]
}