{
  "word": "witch",
  "pronunciation": "wich",
  "concise_definition": "n. 女巫, 魔女",
  "forms": {
    "plural": "witches"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A woman who is believed to have magical powers, especially those used for evil or harmful purposes, often associated with folklore, superstition, or historical persecution.",
      "explanation_cn": "指被认为拥有魔法力量的女性，尤其是那些被相信使用魔法作恶或伤害他人的人，常与民间传说、迷信或历史上的迫害相关。",
      "example_en": "In the fairy tale, the wicked witch cast a spell on the princess.",
      "example_cn": "在童话故事中，邪恶的女巫对公主施了咒语。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person (often a woman) who is unfairly accused or blamed, especially in a context of fear, prejudice, or social scapegoating.",
      "explanation_cn": "指在恐惧、偏见或社会替罪羊机制中被不公平指控或归咎的人（常为女性），引申为被污名化的目标。",
      "example_en": "During the economic crisis, immigrants were often treated as witches, blamed for all the country's problems.",
      "example_cn": "在经济危机期间，移民常被当作替罪羊，被归咎为国家所有问题的根源。"
    },
    {
      "pos": "noun",
      "explanation_en": "In modern pagan or neopagan traditions, a woman who practices witchcraft as a spiritual or religious path, often involving nature worship and ritual magic.",
      "explanation_cn": "在现代异教或新异教传统中，指将巫术作为精神或宗教实践的女性，常涉及对自然的崇拜与仪式魔法。",
      "example_en": "She identifies as a witch and celebrates the seasonal cycles through rituals and herbalism.",
      "example_cn": "她自称为女巫，并通过仪式和草药学庆祝季节更替。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "sorceress",
      "analysis": "“Sorceress”（女术士）与 “witch” 都指女性施法者，但 “sorceress” 更中性或正面，强调通过知识、咒语或神秘力量施展魔法，常出现在奇幻文学中，不必然带有邪恶含义；而 “witch” 在传统语境中常含负面或恐惧色彩，尤其在宗教迫害背景下。"
    },
    {
      "word_to_compare": "wizard",
      "analysis": "“Wizard”（男巫/术士）是 “witch” 的男性对应词，但通常不带性别歧视或污名化色彩，更多用于正面或中性的魔法使用者形象（如《哈利·波特》中的邓布利多）。而 “witch” 因历史上的性别压迫，常被赋予负面联想，即使在现代语境中也保留了这种文化负担。"
    },
    {
      "word_to_compare": "hag",
      "analysis": "“Hag”（老巫婆）是 “witch” 的贬义强化形式，强调年老、丑陋、凶恶的外貌特征，带有强烈的蔑视和刻板印象，常用于童话或恐怖故事中强化恐惧感。而 “witch” 本身虽可贬义，但现代用法中也可中性或正面，如女权主义重拾 ‘witch’ 作为反抗符号。"
    }
  ]
}