{
  "word": "withdrawing",
  "pronunciation": "with·drɔ·ɪŋ",
  "concise_definition": "v. 撤回, 提取, 退出, 退缩",
  "forms": {
    "base_form": "withdraw",
    "third_person_singular": "withdraws",
    "past_tense": "withdrew",
    "past_participle": "withdrawn",
    "present_participle": "withdrawing"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To remove or take back something that has been deposited, provided, or offered, especially money from a bank account or a statement from public circulation.",
      "explanation_cn": "指将已存入、提供或提出的某物（尤其是资金）取回或撤回，常用于银行账户取款或撤回公开声明。",
      "example_en": "She was withdrawing $500 from her savings account at the ATM.",
      "example_cn": "她正在自动取款机上从储蓄账户中提取500美元。"
    },
    {
      "pos": "verb",
      "explanation_en": "To remove oneself physically or emotionally from a situation, group, or interaction, often due to discomfort, disagreement, or a desire for privacy.",
      "explanation_cn": "指因不适、分歧或希望独处而从某种情境、群体或互动中身体上或情感上退出。",
      "example_en": "He started withdrawing from his friends after the argument, spending more time alone.",
      "example_cn": "争吵之后，他开始疏远朋友，更多地独自待着。"
    },
    {
      "pos": "verb",
      "explanation_en": "To retract or cancel a previously made offer, claim, or position, especially in a formal or public context.",
      "explanation_cn": "指在正式或公开场合撤回先前提出的提议、主张或立场。",
      "example_en": "The politician was forced to be withdrawing his controversial statement after public backlash.",
      "example_cn": "在公众强烈反对后，这位政治家被迫撤回了他有争议的言论。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "retreat",
      "analysis": "“Retreat” (撤退) 通常用于军事或战略语境，强调有组织地从危险或不利位置后撤，带有强烈的被动或防御色彩。而 “withdrawing” 更广泛，可用于资金、情感或立场的撤回，不一定涉及危险，且更常用于日常语境。"
    },
    {
      "word_to_compare": "remove",
      "analysis": "“Remove” (移除) 是一个中性词，泛指将某物从某处拿走，不隐含意图或情感色彩。例如移除家具或删除文件。而 “withdrawing” 常带有主动选择、收回或撤回的意味，尤其在涉及权利、承诺或资金时，具有更强的语义重量。"
    },
    {
      "word_to_compare": "retract",
      "analysis": "“Retract” (撤回) 专指收回言论、声明或指控，语义范围较窄，几乎仅用于语言或书面表达。而 “withdrawing” 可用于更广泛的对象，如资金、人员、参与等，语义更广，且不一定涉及错误或道歉。"
    }
  ]
}