{
  "word": "withholding",
  "pronunciation": "with·hold·ing",
  "concise_definition": "n. 扣留, 拒绝给予; v. 扣留, 隐瞒, 拒绝提供",
  "forms": {
    "base_form": "withhold",
    "third_person_singular": "withholds",
    "past_tense": "withheld",
    "past_participle": "withheld",
    "present_participle": "withholding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of deliberately refusing to give, reveal, or allow something to be used, often in a legal, financial, or emotional context.",
      "explanation_cn": "指故意拒绝给予、透露或允许使用某物，常用于法律、财务或情感语境中。",
      "example_en": "The withholding of vital information by the company led to a major scandal.",
      "example_cn": "该公司隐瞒关键信息，引发了重大丑闻。"
    },
    {
      "pos": "verb",
      "explanation_en": "To refuse to give or pay something that is due, especially money such as taxes or wages.",
      "explanation_cn": "指拒绝支付或给予本应提供的东西，尤指税款或工资等金钱。",
      "example_en": "The employer was fined for withholding employees' overtime pay.",
      "example_cn": "雇主因扣发员工加班费而被罚款。"
    },
    {
      "pos": "verb",
      "explanation_en": "To refrain from revealing or disclosing information, often to manipulate, protect, or avoid consequences.",
      "explanation_cn": "指故意不透露或披露信息，常出于操纵、保护自身或避免后果的目的。",
      "example_en": "She was accused of withholding the truth about her involvement in the incident.",
      "example_cn": "她被指控隐瞒了自己与该事件相关的真相。"
    },
    {
      "pos": "verb",
      "explanation_en": "To hold back or restrain an emotion, reaction, or action, often due to social norms or personal restraint.",
      "explanation_cn": "指因社会规范或个人克制而抑制情绪、反应或行为。",
      "example_en": "He was withholding his anger during the meeting to maintain professionalism.",
      "example_cn": "他在会议中压抑着怒火，以保持专业态度。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "concealing",
      "analysis": "“Concealing” (隐藏) 强调通过遮盖、掩饰使某物不被发现，通常指物理或视觉上的隐藏，如隐藏物品或证据。而 “withholding” 更侧重于主动拒绝提供或披露本应给予的信息或资源，具有更强的道德或法律意味。"
    },
    {
      "word_to_compare": "retaining",
      "analysis": "“Retaining” (保留) 指继续持有某物，通常不带有负面含义，如保留文件、保留职位。它强调的是持续拥有，而非拒绝给予。而 “withholding” 暗示了本应交付却故意不交付，常含批评或违规色彩。"
    },
    {
      "word_to_compare": "suppressing",
      "analysis": "“Suppressing” (压制) 指通过外力或意志强行阻止某事物的表达或发生，如压制抗议、压制情绪。它更强调主动的镇压行为，而 “withholding” 更偏向于被动的不给予或不披露，不一定涉及强力干预。"
    }
  ]
}