{
  "word": "woke",
  "pronunciation": "wohk",
  "concise_definition": "adj. 觉醒的, 意识到社会不公的; v. (wake 的过去式和过去分词) 醒来",
  "forms": {
    "base_form": "wake",
    "past_tense": "woke",
    "past_participle": "woken",
    "present_participle": "waking"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Aware of and actively attentive to important social issues, especially those related to racial, gender, and economic inequality; often used to describe a person or attitude that is socially conscious and progressive.",
      "explanation_cn": "指对重要的社会问题（尤其是涉及种族、性别和经济不平等的问题）保持警觉并积极关注；常用于描述具有社会意识和进步立场的人或态度。",
      "example_en": "She’s woke to the systemic biases in hiring practices and advocates for inclusive policies.",
      "example_cn": "她意识到招聘实践中的系统性偏见，并倡导包容性政策。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used ironically or pejoratively by some to describe someone perceived as overly politically correct, performative in their activism, or excessively focused on identity politics.",
      "explanation_cn": "被某些人用作讽刺或贬义，指那些被认为过于政治正确、在行动主义中作秀，或过度关注身份政治的人。",
      "example_en": "He rolled his eyes at the ‘woke’ corporate slogan, calling it empty virtue signaling.",
      "example_cn": "他对这句‘觉醒’的公司口号翻了个白眼，称其为空洞的道德表演。"
    },
    {
      "pos": "verb",
      "explanation_en": "Past tense of 'wake' — to stop sleeping or to cause someone to stop sleeping.",
      "explanation_cn": "动词 'wake' 的过去式——指从睡眠中醒来，或使某人醒来。",
      "example_en": "I woke at dawn when the birds started singing.",
      "example_cn": "我黎明时分听到鸟儿鸣叫就醒了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "aware",
      "analysis": "“Aware”（意识到）是一个中性词，仅表示对某事有认知，不带有价值判断或行动倾向。而 “woke” 不仅包含认知，还隐含了道德立场、批判意识和推动变革的意愿，语义更丰富且常具政治色彩。"
    },
    {
      "word_to_compare": "conscious",
      "analysis": "“Conscious”（有意识的）强调心理上的觉察，可用于各种语境（如环保意识、自我意识），但不必然涉及社会正义议题。而 “woke” 是 “conscious” 在社会政治语境中的特定延伸，专指对结构性压迫的觉察与反抗。"
    },
    {
      "word_to_compare": "alert",
      "analysis": "“Alert”（警觉的）侧重于对即时危险或变化的反应能力，多用于安全或军事语境。而 “woke” 的警觉是长期的、结构性的、文化层面的，关注的是系统性不公而非突发事件。"
    }
  ]
}