{
  "word": "wolf",
  "pronunciation": "wuhlf",
  "concise_definition": "n. 狼, 狼人; v. 狼吞虎咽",
  "forms": {
    "plural": "wolves",
    "third_person_singular": "wolves",
    "past_tense": "wolfed",
    "past_participle": "wolfed",
    "present_participle": "wolfin"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A wild carnivorous mammal of the Canis genus, known for its pack behavior, howling, and role as a top predator in many ecosystems.",
      "explanation_cn": "一种野生的食肉哺乳动物，属于犬属，以群居行为、嚎叫以及作为许多生态系统中顶级捕食者而闻名。",
      "example_en": "The wolf howled mournfully under the full moon.",
      "example_cn": "狼在满月下哀伤地嚎叫。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is predatory, ruthless, or dangerously cunning, often used metaphorically to describe someone who exploits others.",
      "explanation_cn": "比喻一个具有掠夺性、无情或危险狡诈的人，常用来形容剥削他人的人。",
      "example_en": "He's a wolf in sheep's clothing—friendly on the surface but manipulative underneath.",
      "example_cn": "他是个披着羊皮的狼——表面友善，实则善于操纵。"
    },
    {
      "pos": "noun",
      "explanation_en": "A mythical or supernatural creature that transforms from a human into a wolf, especially during a full moon, often found in folklore and horror stories.",
      "explanation_cn": "一种神话或超自然生物，能在满月时从人变为狼，常见于民间传说和恐怖故事中，即‘狼人’。",
      "example_en": "The legend of the werewolf terrified villagers for generations.",
      "example_cn": "狼人的传说让村民们世代恐惧。"
    },
    {
      "pos": "verb",
      "explanation_en": "To eat food quickly and greedily, often in an unrefined or voracious manner.",
      "explanation_cn": "指狼吞虎咽地快速进食，通常带有贪婪或粗鲁的意味。",
      "example_en": "After the long hike, they wolfed down their sandwiches in minutes.",
      "example_cn": "长途徒步后，他们几分钟内就把三明治狼吞虎咽地吃完了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "dog",
      "analysis": "“Dog”（狗）是人类驯化的家养动物，通常象征忠诚与陪伴；而 “wolf” 是野生的、独立的，常代表野性、自由与危险。两者同属犬科，但文化象征截然相反：狗是伙伴，狼是威胁。"
    },
    {
      "word_to_compare": "fox",
      "analysis": "“Fox”（狐狸）在文化中多象征狡猾与机智，常以智取胜；而 “wolf” 更强调力量、凶猛与直接的掠夺性。狐狸是策略家，狼是战士。两者虽都是掠食者，但狐狸靠诡计，狼靠本能与群体协作。"
    },
    {
      "word_to_compare": "hyena",
      "analysis": "“Hyena”（鬣狗）常被描绘为卑劣、嘲笑式的食腐动物，带有丑陋和懦弱的负面联想；而 “wolf” 尽管危险，却常被赋予高贵、孤独与坚韧的正面意象，尤其在现代文化中被浪漫化。狼象征野性之美，鬣狗象征肮脏的生存。"
    }
  ]
}