{
  "word": "wonder",
  "pronunciation": "wuhn·dər",
  "concise_definition": "n. 奇迹, 奇观, 惊叹; v. 感到惊奇, 疑问, 纳闷",
  "forms": {
    "third_person_singular": "wonders",
    "past_tense": "wondered",
    "past_participle": "wondered",
    "present_participle": "wondering"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A thing that causes great surprise, admiration, or awe due to its beauty, rarity, or extraordinary nature; often refers to natural or man-made marvels.",
      "explanation_cn": "指因美丽、稀有或非凡性质而引发极大惊奇、钦佩或敬畏的事物；常指自然或人造的奇观。",
      "example_en": "The Great Pyramid of Giza is one of the Seven Wonders of the Ancient World.",
      "example_cn": "吉萨大金字塔是古代世界七大奇观之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A feeling of amazement or curiosity about something mysterious, unexplained, or unexpected.",
      "explanation_cn": "指对某件神秘、无法解释或出乎意料的事物所产生的惊奇或好奇感。",
      "example_en": "She looked at the stars with wonder, wondering how they had formed.",
      "example_cn": "她凝视着星空，充满惊叹，思索着它们是如何形成的。"
    },
    {
      "pos": "verb",
      "explanation_en": "To feel curiosity or doubt about something, often accompanied by a desire to know or understand.",
      "explanation_cn": "指对某事感到好奇或怀疑，通常伴随着想要了解或理解的意愿。",
      "example_en": "I wonder why she didn't reply to my message.",
      "example_cn": "我不禁想知道她为什么没有回复我的消息。"
    },
    {
      "pos": "verb",
      "explanation_en": "To experience a sense of awe or admiration, especially in response to something extraordinary.",
      "explanation_cn": "指因某件非凡的事物而产生敬畏或钦佩之情。",
      "example_en": "We wondered at the speed with which the child learned to play the piano.",
      "example_cn": "我们对这个孩子学会弹钢琴的速度感到惊叹。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "miracle",
      "analysis": "“Miracle” (奇迹) 通常指违反自然规律、被认为由神力或超自然力量促成的事件，带有强烈的宗教或神秘色彩。而 “wonder” 更广泛，可指任何令人惊叹的事物，不一定涉及超自然。"
    },
    {
      "word_to_compare": "amazement",
      "analysis": "“Amazement” (惊愕) 是一种强烈的情绪反应，强调震惊和难以置信，通常是瞬间的。而 “wonder” 不仅包含惊讶，还常伴随持续的思考、好奇或沉思，情感层次更丰富。"
    },
    {
      "word_to_compare": "curiosity",
      "analysis": "“Curiosity” (好奇心) 侧重于求知欲和探索的动机，是认知驱动的。而 “wonder” 作为动词时，虽也含好奇，但更强调情感上的震撼与敬畏，常带有诗意或哲思色彩。"
    }
  ]
}