{
  "word": "woodwork",
  "pronunciation": "wood·wurk",
  "concise_definition": "n. 木工制品, 木结构, 木装饰",
  "forms": {
    "plural": "woodworks"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The collective term for wooden components or structures in a building, such as doors, windows, moldings, staircases, and trim, typically installed during construction or renovation.",
      "explanation_cn": "指建筑中所有木质构件或结构的总称，如门、窗、装饰线脚、楼梯和镶边等，通常在建造或翻新过程中安装。",
      "example_en": "The antique woodwork in the living room dates back to the 18th century.",
      "example_cn": "客厅里的古董木工制品可追溯到18世纪。"
    },
    {
      "pos": "noun",
      "explanation_en": "The craft or art of making items from wood, especially those involving intricate carving, joinery, or shaping.",
      "explanation_cn": "指制作木制品的工艺或艺术，尤其涉及精细雕刻、榫卯接合或塑形的技艺。",
      "example_en": "He spent years mastering the art of woodwork, creating furniture and sculptures by hand.",
      "example_cn": "他花了多年时间钻研木工技艺，亲手制作家具和雕塑。"
    },
    {
      "pos": "noun",
      "explanation_en": "In the phrase 'out of the woodwork,' a figurative expression meaning people or things that emerge from obscurity or hiding, often unexpectedly or when it is convenient for them.",
      "explanation_cn": "在短语 'out of the woodwork' 中，为比喻用法，指那些从隐匿状态中突然出现的人或事物，通常是在对自己有利时出现。",
      "example_en": "After the announcement of the prize, critics and competitors alike came out of the woodwork.",
      "example_cn": "在宣布奖金后，批评者和竞争者纷纷冒了出来。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "carpentry",
      "analysis": "“Carpentry”（木工）更侧重于木工的技艺、职业或施工过程，强调动手操作和结构建造，如搭建房屋框架或安装梁柱。而 “woodwork” 更广泛，既可指成品（如装饰线条），也可指整体的木制部分，不局限于施工行为。"
    },
    {
      "word_to_compare": "furniture",
      "analysis": "“Furniture”（家具）特指用于居住或办公的可移动物品，如椅子、桌子、床等。而 “woodwork” 包含固定在建筑中的木质构件，如窗框、门框、踢脚线，通常是不可移动的。两者有重叠（如木制柜子），但范围不同。"
    },
    {
      "word_to_compare": "timber",
      "analysis": "“Timber”（木材/原木）指未经加工的木材原料，是木工的原材料。而 “woodwork” 是指经过加工、设计和安装后的成品或结构，是木材的最终表现形式。前者是材料，后者是成果。"
    }
  ]
}