{
  "word": "woodward",
  "pronunciation": "woh·duhrd",
  "concise_definition": "n. 木匠, 木材管理员; adj. 与木材有关的",
  "forms": {
    "plural": "woodwards"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A person responsible for managing or overseeing woodlands, forests, or timber resources, especially in historical or estate contexts; often a steward or official appointed to protect and maintain forested areas.",
      "explanation_cn": "指在历史或庄园背景下负责管理或监督林地、森林或木材资源的人；通常是被委任以保护和维护林区的管家或官员。",
      "example_en": "The old woodward patrolled the royal forest every morning to prevent illegal logging.",
      "example_cn": "这位老木材管理员每天清晨巡视皇家森林，以防止非法砍伐。"
    },
    {
      "pos": "noun",
      "explanation_en": "A historical occupational surname derived from someone who worked with wood, such as a carpenter or forester; now commonly used as a family name.",
      "explanation_cn": "源自过去从事木材相关工作（如木匠或林务员）的人的姓氏，现多用作姓氏。",
      "example_en": "John Woodward, the renowned historian, traced his ancestry to a medieval woodward in Hampshire.",
      "example_cn": "著名历史学家约翰·伍德沃德追溯其祖先至汉普郡的一位中世纪木材管理员。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to wood or timber, especially in the context of land management or forestry; rarely used in modern English outside of proper names.",
      "explanation_cn": "与木材或林木相关的，尤其在土地管理或林业语境中；现代英语中除专有名词外极少使用。",
      "example_en": "The Woodward Estate includes 500 acres of protected woodland.",
      "example_cn": "伍德沃德庄园包括500英亩受保护的林地。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "forester",
      "analysis": "“Forester”（林务员）是现代通用术语，泛指受雇管理森林资源的专业人员，强调职业属性和生态管理职能。而 “woodward” 更具历史感和地域性，常用于英国庄园体系，职责范围可能更广，包括监督伐木、收税和维护边界，带有行政或管家性质。"
    },
    {
      "word_to_compare": "carpenter",
      "analysis": "“Carpenter”（木匠）专注于将木材加工成家具、建筑构件等成品，强调手工技艺和制造过程。而 “woodward” 不直接加工木材，而是管理其来源——森林，属于资源监管者而非生产者。两者职能互补但本质不同。"
    },
    {
      "word_to_compare": "lumberman",
      "analysis": "“Lumberman”（伐木工/木材商人）指从事砍伐、运输和销售木材的人员，侧重商业和工业活动。而 “woodward” 的角色是保护和可持续管理，常代表土地所有者或王室利益，反对过度采伐，立场上更接近环保监管者而非从业者。"
    }
  ]
}