{
  "word": "working",
  "pronunciation": "wur·king",
  "concise_definition": "adj. 工作的, 运转的; n. 工作方式, 运作机制",
  "forms": {
    "base_form": "work",
    "present_participle": "working",
    "past_tense": "worked",
    "past_participle": "worked"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Describing something that is currently functioning, operating, or performing as intended, especially machines, systems, or processes.",
      "explanation_cn": "形容某物当前正在运行、运作或按预期执行，尤指机器、系统或流程。",
      "example_en": "The new software is still working properly after three months of use.",
      "example_cn": "这款新软件在使用三个月后仍正常运行。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or engaged in employment or labor; describing a person who is employed or actively involved in a job.",
      "explanation_cn": "与就业或劳动相关；描述正在从事工作的人员。",
      "example_en": "She is a working mother who balances her career and family life.",
      "example_cn": "她是一位兼顾事业与家庭的在职母亲。"
    },
    {
      "pos": "noun",
      "explanation_en": "The manner or method by which something functions or operates, especially in technical, mechanical, or organizational contexts.",
      "explanation_cn": "指某事物运作或运行的方式，尤其用于技术、机械或组织语境中。",
      "example_en": "The working of the engine is complex but highly efficient.",
      "example_cn": "这台发动机的工作原理复杂但效率极高。"
    },
    {
      "pos": "noun",
      "explanation_en": "The activity or process of performing labor or duties; often used in plural to refer to construction, maintenance, or repair tasks.",
      "explanation_cn": "指执行劳动或职责的活动或过程；常以复数形式指代建筑、维护或维修工作。",
      "example_en": "The working on the bridge are scheduled to finish by next month.",
      "example_cn": "这座桥的施工计划下个月完成。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "functional",
      "analysis": "“Functional”（功能性的）强调某物具备其设计目的所需的基本功能，但不一定处于运行状态。例如，一把椅子是 functional 的，即使它被放在仓库里。而 “working” 强调的是当前正在运行或有效运作的状态。"
    },
    {
      "word_to_compare": "operational",
      "analysis": "“Operational”（可操作的/投入使用的）多用于正式或技术语境，指系统、设备或组织已准备就绪并可投入使用，常用于军事、航空或企业环境。它比 “working” 更正式，且隐含系统性、制度性准备，而 “working” 更口语化，侧重实际运行效果。"
    },
    {
      "word_to_compare": "employed",
      "analysis": "“Employed”（受雇的）仅指一个人拥有正式工作职位，强调雇佣关系，不涉及工作是否在进行中。而 “working” 不仅指有工作，还强调正在从事劳动或履行职责的过程。例如，一个人可能被雇用但正在休假，此时他是 employed，但不是 working。"
    }
  ]
}