{
  "word": "works",
  "pronunciation": "wurks",
  "concise_definition": "n. 工厂, 作品, 著作, 机制; v. 工作, 运转, 起作用",
  "forms": {
    "third_person_singular": "works",
    "past_tense": "worked",
    "past_participle": "worked",
    "present_participle": "working",
    "plural": "works"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A factory or industrial plant where manufacturing or production takes place, often referring to large-scale operations.",
      "explanation_cn": "指进行制造或生产的工厂或工业设施，通常指大规模的生产场所。",
      "example_en": "The steel works employs over 5,000 workers in the region.",
      "example_cn": "这家钢铁厂在该地区雇佣了超过五千名工人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A literary, artistic, or musical composition; the collective body of a creator's output.",
      "explanation_cn": "指文学、艺术或音乐作品；某位创作者全部作品的总称。",
      "example_en": "The works of Shakespeare continue to be studied worldwide.",
      "example_cn": "莎士比亚的作品至今仍在世界各地被研究。"
    },
    {
      "pos": "noun",
      "explanation_en": "The internal mechanism or functioning of a system, device, or process, often used in the plural to describe how something operates.",
      "explanation_cn": "指系统、设备或过程的内部机制或运作方式，常以复数形式出现，用于描述某物如何运作。",
      "example_en": "The works of this clock are made of brass and have been preserved for over two centuries.",
      "example_cn": "这座钟的内部机芯由黄铜制成，已保存了两个多世纪。"
    },
    {
      "pos": "verb",
      "explanation_en": "To perform a function or operate effectively, especially in the context of machines, systems, or methods.",
      "explanation_cn": "指执行功能或有效运转，尤其用于机器、系统或方法。",
      "example_en": "This new software works perfectly on my laptop.",
      "example_cn": "这个新软件在我的笔记本电脑上运行得非常完美。"
    },
    {
      "pos": "verb",
      "explanation_en": "To engage in employment or labor, typically to earn money or fulfill a duty.",
      "explanation_cn": "指从事工作或劳动，通常为了赚钱或履行职责。",
      "example_en": "She works as a nurse in a downtown hospital.",
      "example_cn": "她在市中心的一家医院当护士。"
    },
    {
      "pos": "verb",
      "explanation_en": "To produce a desired result or effect through effort or action; to be effective or successful.",
      "explanation_cn": "指通过努力或行动产生预期的结果或效果；有效或成功。",
      "example_en": "The recipe works best if you use fresh ingredients.",
      "example_cn": "如果使用新鲜食材，这个食谱的效果最好。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "factory",
      "analysis": "“Factory” (工厂) 通常指单一的生产建筑或设施，而 “works” 更强调整个生产体系，可能包含多个建筑、生产线和附属设施，语义更广泛，常用于工业语境中，如 “steel works” 或 “iron works”。"
    },
    {
      "word_to_compare": "creation",
      "analysis": "“Creation” (创作) 强调原创性和艺术性，多用于文学、艺术领域，指一个全新的产物；而 “works” 作为名词时，是创作者所有作品的集合，更侧重于成果的总称，而非单个作品的原创过程。"
    },
    {
      "word_to_compare": "function",
      "analysis": "“Function” (功能) 指系统或部件的特定作用或目的，是抽象的术语；而 “works” 在指机制时，强调的是实际运作的内部结构和过程，更具实体性和技术性。例如，我们说 “the works of the engine” 而不是 “the function of the engine”。"
    },
    {
      "word_to_compare": "labor",
      "analysis": "“Labor” (劳动) 侧重于体力或脑力付出的过程，常与工作强度、报酬或社会阶层相关；而 “works” 作为动词时，更中性，强调行为本身及其结果，如 “It works” 不等于 “It labors”。"
    }
  ]
}