{
  "word": "workout",
  "pronunciation": "wurk·out",
  "concise_definition": "n. 锻炼, 训练; v. 锻炼, 解决, 演练",
  "forms": {
    "plural": "workouts",
    "third_person_singular": "workouts",
    "past_tense": "worked out",
    "past_participle": "worked out",
    "present_participle": "working out"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A session of physical exercise designed to improve fitness, strength, or endurance, often following a structured routine.",
      "explanation_cn": "指为提高体能、力量或耐力而进行的一次有组织的体育锻炼，通常遵循特定的训练计划。",
      "example_en": "She goes for a 45-minute workout at the gym every morning.",
      "example_cn": "她每天早上在健身房进行45分钟的锻炼。"
    },
    {
      "pos": "noun",
      "explanation_en": "A problem-solving session or mental exercise, especially one that challenges reasoning or creativity.",
      "explanation_cn": "指一种解决问题的思维训练或脑力练习，尤其指那些挑战推理或创造力的活动。",
      "example_en": "The puzzle was a real workout for my brain.",
      "example_cn": "这个谜题真是对我大脑的一次严峻考验。"
    },
    {
      "pos": "verb",
      "explanation_en": "To engage in physical exercise to improve health or fitness.",
      "explanation_cn": "指通过体育锻炼来改善健康或体能。",
      "example_en": "He works out three times a week to stay in shape.",
      "example_cn": "他每周锻炼三次以保持体型。"
    },
    {
      "pos": "verb",
      "explanation_en": "To solve or figure out a problem, situation, or plan through careful thought or effort.",
      "explanation_cn": "指通过仔细思考或努力来解决一个问题、情况或计划。",
      "example_en": "We need to work out a budget before the trip.",
      "example_cn": "我们得在旅行前算出一个预算。"
    },
    {
      "pos": "verb",
      "explanation_en": "To develop or refine something through practice or testing, such as a technique, idea, or performance.",
      "explanation_cn": "指通过实践或测试来发展或完善某种技巧、想法或表现。",
      "example_en": "The team worked out a new strategy during the training camp.",
      "example_cn": "球队在训练营中演练出了一套新战术。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "exercise",
      "analysis": "“Exercise” (锻炼) 是一个更广泛、更中性的术语，泛指任何身体活动，包括散步、拉伸等轻度活动。而 “workout” 通常指强度较高、有计划、有目标的系统性训练，更具结构性和挑战性。"
    },
    {
      "word_to_compare": "training",
      "analysis": "“Training” (训练) 更强调长期、系统性的技能提升过程，常用于专业领域（如运动员训练、员工培训）。而 “workout” 多用于日常健身语境，时间较短、目标更偏向即时体能提升。"
    },
    {
      "word_to_compare": "session",
      "analysis": "“Session” (时段/会话) 是一个通用词，指任何持续一段时间的活动（如会议、课程、治疗），不特指身体或脑力活动。而 “workout” 是 “session” 的一种具体类型，专指锻炼或脑力挑战的时段。"
    }
  ]
}