{
  "word": "work",
  "pronunciation": "wurk",
  "concise_definition": "v. 工作, 运转, 起作用; n. 工作, 作品, 劳动",
  "forms": {
    "third_person_singular": "works",
    "past_tense": "worked",
    "past_participle": "worked",
    "present_participle": "working"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To perform a job or task, especially as a means of earning a living; to engage in physical or mental effort to achieve a purpose.",
      "explanation_cn": "指从事一项工作或任务，尤指作为谋生手段；也指为实现某种目的而付出体力或脑力劳动。",
      "example_en": "She works as a nurse in a local hospital.",
      "example_cn": "她在当地一家医院当护士。"
    },
    {
      "pos": "verb",
      "explanation_en": "To function or operate effectively; to produce the desired result or effect.",
      "explanation_cn": "指（机器、系统、方法等）正常运转或有效运作；产生预期的结果或效果。",
      "example_en": "This new software works perfectly on my laptop.",
      "example_cn": "这个新软件在我的笔记本电脑上运行得非常好。"
    },
    {
      "pos": "verb",
      "explanation_en": "To exert influence or effect gradually over time, especially in a subtle or indirect way.",
      "explanation_cn": "指逐渐地、微妙地或间接地产生影响或作用。",
      "example_en": "Time and patience will work wonders in healing this wound.",
      "example_cn": "时间和耐心会慢慢治愈这道伤口。"
    },
    {
      "pos": "noun",
      "explanation_en": "Activity involving mental or physical effort done in order to achieve a result, especially when done regularly for pay.",
      "explanation_cn": "指为达成某种结果而付出的脑力或体力活动，尤指有报酬的常规性劳动。",
      "example_en": "He has a lot of work to finish before the deadline.",
      "example_cn": "他在截止日期前还有很多工作要完成。"
    },
    {
      "pos": "noun",
      "explanation_en": "A product of human creativity or labor, especially in the arts or literature; a piece of art, writing, or music.",
      "explanation_cn": "指人类创造力或劳动的产物，尤指艺术、文学或音乐领域中的作品。",
      "example_en": "The museum is displaying several works by Picasso.",
      "example_cn": "博物馆正在展出几幅毕加索的作品。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "labor",
      "analysis": "“Labor” (劳动) 更强调体力付出和艰苦性，常用于正式语境，指为完成任务而进行的艰苦体力活动，有时带有社会或经济层面的含义（如“劳动力”）。而 “work” 更通用，涵盖脑力与体力，适用范围更广。"
    },
    {
      "word_to_compare": "job",
      "analysis": "“Job” (工作/职位) 通常指一份具体的职业或雇佣关系，是可数名词，强调岗位或职责。而 “work” 可以是抽象的劳动行为，不可数，也可指具体成果。例如：I have a job at a bank. / I have a lot of work to do. "
    },
    {
      "word_to_compare": "function",
      "analysis": "“Function” (运作/功能) 侧重于系统、机制或器官的正常运行状态，常用于技术或科学语境，强调“是否按设计运行”。而 “work” 更口语化，泛指任何有效运作或产生结果，不限于机械或系统。"
    }
  ]
}