{
  "word": "worked",
  "pronunciation": "wurkt",
  "concise_definition": "v. 工作, 运转, 起作用, 实现",
  "forms": {
    "base_form": "work",
    "third_person_singular": "works",
    "present_participle": "working",
    "past_tense": "worked",
    "past_participle": "worked"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To perform a job or task, especially for payment or to achieve a specific purpose; to engage in physical or mental effort to accomplish something.",
      "explanation_cn": "指为获得报酬或实现特定目标而从事工作或任务；进行体力或脑力劳动以完成某事。",
      "example_en": "She worked as a teacher for over twenty years.",
      "example_cn": "她当了二十多年的老师。"
    },
    {
      "pos": "verb",
      "explanation_en": "To function or operate effectively; to produce the desired result or outcome.",
      "explanation_cn": "指（机器、系统、方法等）正常运转或有效运作；产生预期的结果。",
      "example_en": "The new software works perfectly on my laptop.",
      "example_cn": "这个新软件在我的笔记本电脑上运行得非常好。"
    },
    {
      "pos": "verb",
      "explanation_en": "To have a particular effect or influence, especially in achieving a goal through effort or strategy.",
      "explanation_cn": "指通过努力或策略产生某种效果或影响，尤指实现目标。",
      "example_en": "His charm worked on the audience, and they voted for him.",
      "example_cn": "他的魅力打动了观众，他们投了他一票。"
    },
    {
      "pos": "verb",
      "explanation_en": "To have been engaged in labor or employment over a period of time (used in past tense to describe completed activity).",
      "explanation_cn": "指在过去一段时间内从事劳动或就业（过去时态，描述已完成的活动）。",
      "example_en": "I worked in Tokyo for three years before moving to Seoul.",
      "example_cn": "我在搬到首尔之前，在东京工作了三年。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "labor",
      "analysis": "“Labor” (劳动) 更强调体力付出和艰苦的体力活动，常用于正式或社会经济语境，如“manual labor”（体力劳动）。“Work” 更广泛，涵盖脑力与体力、有偿与无偿活动，语义范围更广。"
    },
    {
      "word_to_compare": "function",
      "analysis": "“Function” (运作) 侧重于系统、设备或机制的正常运行状态，通常不涉及主观努力，如“The machine functions well.” 而 “worked” 可以指人主动完成任务，或方法奏效，包含目的性和结果导向。"
    },
    {
      "word_to_compare": "achieve",
      "analysis": "“Achieve” (实现) 强调成功达成一个目标或成就，如 achieve a goal，侧重结果本身。“Worked” 在表示“起作用”时，强调过程的有效性，不一定有明确的最终目标，如 “The plan worked.” 可能只是说它有效，而不一定成功。"
    }
  ]
}