{
  "word": "worldly",
  "pronunciation": "wurld·lee",
  "concise_definition": "adj. 世俗的, 有经验的, 贪图享乐的",
  "forms": {
    "comparative": "worldlier",
    "superlative": "worldliest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Concerned with or experienced in the practical affairs of life, especially those involving wealth, power, or social status, rather than spiritual or religious matters.",
      "explanation_cn": "指关注或熟悉现实生活中的实际事务，尤其是涉及财富、权力或社会地位的方面，而非精神或宗教层面。",
      "example_en": "She was a worldly woman who had traveled to over thirty countries and understood the nuances of international business.",
      "example_cn": "她是一位阅历丰富的女性，曾游历三十多个国家，深谙国际商业的微妙之处。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Characterized by or devoted to material pleasures and comforts, often to the exclusion of spiritual or moral values.",
      "explanation_cn": "指以物质享受和舒适为特征，往往忽视精神或道德价值。",
      "example_en": "His worldly lifestyle included luxury cars, fine dining, and expensive vacations.",
      "example_cn": "他世俗的生活方式包括豪华汽车、精致餐饮和昂贵的假期。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Having broad knowledge or experience of the world, often implying sophistication and awareness of cultural or social complexities.",
      "explanation_cn": "指拥有广泛的世故经验，常暗示着对文化或社会复杂性的成熟认知与见识。",
      "example_en": "The diplomat was worldly and charming, able to navigate any social situation with ease.",
      "example_cn": "这位外交官见多识广、风度翩翩，能轻松应对任何社交场合。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "secular",
      "analysis": "“Secular” (世俗的) 强调与宗教或神圣事物无关，常用于描述制度、教育或法律等中立于宗教的领域。而 “worldly” 更侧重于对物质、享乐或现实利益的追求，带有价值判断，可能隐含贬义。"
    },
    {
      "word_to_compare": "sophisticated",
      "analysis": "“Sophisticated” (老练的/复杂的) 强调精明、优雅或技术上的复杂性，通常是中性或褒义的，如“sophisticated technology”。而 “worldly” 在表示“有经验”时虽近似，但更强调通过生活经历获得的洞察力，而非智力或技术层面的精妙。"
    },
    {
      "word_to_compare": "materialistic",
      "analysis": "“Materialistic” (物质主义的) 专指过分重视物质财富和物质享受，通常带有明显的负面含义。而 “worldly” 虽可包含此意，但范围更广，还可指涉社会经验、文化见识等非纯粹物质层面的内容，语义更丰富，语用更灵活。"
    }
  ]
}