{
  "word": "worlds",
  "pronunciation": "wurldz",
  "concise_definition": "n. 世界, 宇宙, 领域, 界",
  "forms": {
    "singular": "world"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The earth and all its inhabitants, together with its natural features and human societies; the totality of human existence and experience.",
      "explanation_cn": "指地球及其所有居民，连同其自然特征和人类社会；人类存在与经验的总和。",
      "example_en": "We are all part of one world, sharing the same environment and future.",
      "example_cn": "我们都是同一个世界的一部分，共享相同的环境与未来。"
    },
    {
      "pos": "noun",
      "explanation_en": "A particular sphere of activity, interest, or experience, often used metaphorically to describe a distinct realm or domain.",
      "explanation_cn": "指某一特定的活动、兴趣或经验领域，常用于隐喻，表示一个独特的领域或范围。",
      "example_en": "She has entered the world of professional ballet after years of training.",
      "example_cn": "经过多年的训练，她进入了职业芭蕾舞的世界。"
    },
    {
      "pos": "noun",
      "explanation_en": "A fictional or imagined universe, especially in literature, film, or games, with its own rules, cultures, and histories.",
      "explanation_cn": "指在文学、电影或游戏中虚构或想象出的宇宙，拥有其自身的规则、文化和历史。",
      "example_en": "The Harry Potter worlds are filled with magic, mythical creatures, and hidden societies.",
      "example_cn": "《哈利·波特》的世界充满了魔法、神话生物和隐秘社会。"
    },
    {
      "pos": "noun",
      "explanation_en": "Used in plural to emphasize diversity or multiplicity of distinct realities, perspectives, or experiences.",
      "explanation_cn": "以复数形式使用，强调多种截然不同的现实、视角或体验。",
      "example_en": "The immigrants brought with them their own worlds, languages, and traditions.",
      "example_cn": "移民们带来了他们各自的世界、语言和传统。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "universe",
      "analysis": "“Universe” (宇宙) 指物理上所有物质、能量、空间和时间的总和，是科学意义上的整体概念，范围更广、更客观。而 “world” 更常用于人类经验、文化或主观感知的层面，范围更窄、更具人文色彩。"
    },
    {
      "word_to_compare": "realm",
      "analysis": "“Realm” (领域) 通常指一个抽象的、有边界的领域，如权力、知识或精神领域，常用于文学或正式语境，带有权威或神秘色彩。而 “world” 更口语化，涵盖范围更广，可指物理空间、社会圈层或想象空间。"
    },
    {
      "word_to_compare": "sphere",
      "analysis": "“Sphere” (范围/领域) 强调一个特定的功能或影响范围，如政治领域、社交圈，常用于分析性语境。它比 “world” 更具结构性和界限感，而 “world” 更强调整体性与沉浸感。"
    }
  ]
}