{
  "word": "world",
  "pronunciation": "wurld",
  "concise_definition": "n. 世界, 世界范围, 人类社会, 领域",
  "forms": {
    "plural": "worlds"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The earth and all its inhabitants, together with its natural features and phenomena; the totality of human existence and the physical universe.",
      "explanation_cn": "指地球及其所有居民，连同其自然特征与现象；人类存在与物理宇宙的总和。",
      "example_en": "The world is facing unprecedented challenges due to climate change.",
      "example_cn": "由于气候变化，世界正面临前所未有的挑战。"
    },
    {
      "pos": "noun",
      "explanation_en": "A particular sphere of activity, interest, or experience, often used to describe a distinct domain or community (e.g., the world of art, the world of business).",
      "explanation_cn": "指某一特定的活动、兴趣或经验领域，常用于描述一个独特的领域或社群（如艺术界、商界）。",
      "example_en": "She has always been fascinated by the world of classical music.",
      "example_cn": "她一直对古典音乐的世界着迷。"
    },
    {
      "pos": "noun",
      "explanation_en": "The people and society of a particular country or region, especially when contrasted with one's own culture or perspective.",
      "explanation_cn": "指某个国家或地区的人民与社会，尤其在与自身文化或视角对比时使用。",
      "example_en": "He traveled to the Far East to experience a different world.",
      "example_cn": "他前往远东，体验一个不同的世界。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person's entire personal experience or perception of reality, often used in phrases like 'my world' or 'his world'.",
      "explanation_cn": "指一个人对现实的全部个人体验或感知，常用于如 'my world' 或 'his world' 等表达中。",
      "example_en": "Losing her dog shattered her world.",
      "example_cn": "失去她的狗，使她的世界崩塌了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "earth",
      "analysis": "“Earth” (地球) 专指我们居住的行星，是一个科学或地理意义上的具体天体，强调物质实体。而 “world” 更广泛，可指人类社会、文化、经验或抽象领域，不仅限于物理星球。"
    },
    {
      "word_to_compare": "society",
      "analysis": "“Society” (社会) 专指人类群体的组织结构、制度与互动关系，强调人际关系与文化规范。而 “world” 可包含自然环境、物质存在和主观体验，范围更广，不一定局限于人类组织。"
    },
    {
      "word_to_compare": "universe",
      "analysis": "“Universe” (宇宙) 指包含所有物质、能量、空间和时间的全部存在，是科学上最宏大的概念。而 “world” 通常指地球或人类所处的环境，范围远小于 “universe”，但在比喻意义上可与之接近（如 'his whole world'）。"
    }
  ]
}