{
  "word": "worms",
  "pronunciation": "wurms",
  "concise_definition": "n. 蚯蚓, 蛔虫, 虫子; (复数形式)",
  "forms": {
    "singular": "worm"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Small, elongated, soft-bodied invertebrate animals that live in soil or water, often playing a key role in breaking down organic matter and aerating the earth.",
      "explanation_cn": "小型、细长、柔软的无脊椎动物，生活在土壤或水中，常在分解有机物和疏松土壤中发挥关键作用。",
      "example_en": "Earthworms are essential for healthy soil because they improve its structure and nutrient content.",
      "example_cn": "蚯蚓对土壤健康至关重要，因为它们能改善土壤结构和养分含量。"
    },
    {
      "pos": "noun",
      "explanation_en": "Parasitic worms that live inside the bodies of animals or humans, often causing illness or discomfort.",
      "explanation_cn": "寄生在动物或人体内的蠕虫，常引起疾病或不适。",
      "example_en": "The child was treated for intestinal worms after complaining of stomach pain.",
      "example_cn": "这名儿童因腹痛接受治疗，确诊为肠道寄生虫感染。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is perceived as weak, sneaky, or untrustworthy, often used metaphorically or derogatorily.",
      "explanation_cn": "比喻性地指被认为软弱、狡猾或不可信的人，常带有贬义。",
      "example_en": "He’s such a worm for betraying his friend’s secret like that.",
      "example_cn": "他那样出卖朋友的秘密，真是个卑鄙小人。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of computer program or malware that replicates itself to spread across networks without requiring user interaction.",
      "explanation_cn": "一种自我复制并通过网络传播的计算机程序或恶意软件，无需用户交互即可扩散。",
      "example_en": "The network was infected by a worm that exploited a security vulnerability in the operating system.",
      "example_cn": "该网络被一种利用操作系统安全漏洞的蠕虫病毒感染。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "insects",
      "analysis": "“Insects” (昆虫) 是有六条腿、身体分头胸腹三部分的节肢动物，如蚂蚁、蝴蝶；而 “worms” (蠕虫) 无腿、身体柔软、不分节或仅轻微分节，属于不同的动物门类。两者常被非专业人士混淆，但生物学上差异显著。"
    },
    {
      "word_to_compare": "vermin",
      "analysis": "“Vermin” (害虫/害兽) 是一个泛指有害动物的集合名词，包括老鼠、蟑螂、跳蚤等，有时也包括寄生虫；而 “worms” 更具体，专指蠕虫类生物。虽然某些 worms 可被归为 vermin，但 vermin 的范围更广且更具贬义。"
    },
    {
      "word_to_compare": "microbes",
      "analysis": "“Microbes” (微生物) 指肉眼不可见的微小生物，如细菌、病毒、真菌；而 “worms” 是宏观可见的多细胞生物，即使很小也属于动物界。两者在大小、结构和分类上完全不同，不能混为一谈。"
    }
  ]
}