{
  "word": "worm",
  "pronunciation": "wurm",
  "concise_definition": "n. 蠕虫, 虫子; v. 蠕动, 巧妙地前进",
  "forms": {
    "plural": "worms"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A small, long, soft-bodied invertebrate animal that typically lives in soil and moves by contracting its body segments; often used to describe earthworms or parasitic worms.",
      "explanation_cn": "一种身体细长、柔软、无脊椎的小型动物，通常生活在土壤中，通过收缩身体节段移动；常指蚯蚓或寄生虫。",
      "example_en": "The gardener found several earthworms in the compost pile.",
      "example_cn": "园丁在堆肥堆里发现了几条蚯蚓。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is perceived as sneaky, untrustworthy, or manipulative, often used in a derogatory sense.",
      "explanation_cn": "指被认为狡猾、不可信或善于操纵的人，常带有贬义。",
      "example_en": "He’s a real worm for spreading rumors behind people’s backs.",
      "example_cn": "他在背后散布谣言，真是个卑鄙小人。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move slowly and twistingly, often in a narrow space or through obstacles, like a worm.",
      "explanation_cn": "像蠕虫一样缓慢而扭曲地移动，通常在狭窄空间或障碍物中穿行。",
      "example_en": "The snake wormed its way through the tall grass.",
      "example_cn": "蛇在高草中蜿蜒穿行。"
    },
    {
      "pos": "verb",
      "explanation_en": "To gain access to or achieve something by persistent, indirect, or cunning means.",
      "explanation_cn": "通过坚持不懈、间接或狡猾的手段获得或达成某事。",
      "example_en": "She wormed her way into the inner circle of the company.",
      "example_cn": "她设法混入了公司的核心圈子。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "insect",
      "analysis": "“Insect” (昆虫) 指具有六条腿、身体分头、胸、腹三部分的节肢动物，如蚂蚁、蝴蝶；而 “worm” 是无腿、身体柔软、不分节的无脊椎动物，两者在生物学分类和形态上完全不同。"
    },
    {
      "word_to_compare": "snake",
      "analysis": "“Snake” (蛇) 是有脊椎的爬行动物，身体虽长但有骨骼支撑，行动方式为滑行；而 “worm” 是无脊椎动物，靠肌肉收缩蠕动，体型更小、结构更简单。虽然两者都可能被形容为“蜿蜒移动”，但生物类别和生理结构差异显著。"
    },
    {
      "word_to_compare": "creep",
      "analysis": "“Creep” (爬行/悄悄移动) 强调缓慢、隐蔽地移动，常用于人或动物，带有谨慎或偷窃的意味；而 “worm” 作为动词时，更强调通过扭曲、钻入或迂回的方式前进，常用于比喻性语境，如‘worming into’某个群体，更具策略性和操纵性。"
    }
  ]
}