{
  "word": "worship",
  "pronunciation": "wur·shup",
  "concise_definition": "n. 崇拜, 敬拜; v. 崇拜, 敬仰, 痴迷",
  "forms": {
    "third_person_singular": "worships",
    "past_tense": "worshipped",
    "past_participle": "worshipped",
    "present_participle": "worshipping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of showing deep reverence, devotion, or adoration toward a deity, sacred object, or spiritual force, often through ritual, prayer, or ceremony.",
      "explanation_cn": "对神灵、圣物或精神力量表达深切敬仰、虔诚或崇拜的行为，通常通过仪式、祈祷或典礼来实现。",
      "example_en": "The temple was filled with worshippers during the morning service.",
      "example_cn": "早间礼拜时，寺庙里挤满了信徒。"
    },
    {
      "pos": "noun",
      "explanation_en": "Excessive admiration or devotion toward a person, idea, or thing, often to the point of idealization or obsession.",
      "explanation_cn": "对某人、某种理念或事物的过度钦佩或迷恋，常达到理想化甚至痴迷的程度。",
      "example_en": "There's a cult of worship around celebrity athletes in modern media.",
      "example_cn": "在现代媒体中，对名人运动员存在着一种近乎崇拜的狂热。"
    },
    {
      "pos": "verb",
      "explanation_en": "To honor or revere a deity or divine being through religious practices, rituals, or expressions of faith.",
      "explanation_cn": "通过宗教实践、仪式或信仰表达来敬奉或尊崇神灵或神圣存在。",
      "example_en": "Many people worship in churches, mosques, or temples according to their faith.",
      "example_cn": "许多人根据自己的信仰在教堂、清真寺或寺庙中敬拜。"
    },
    {
      "pos": "verb",
      "explanation_en": "To admire or love someone or something intensely, often to an excessive or uncritical degree.",
      "explanation_cn": "对某人或某物产生强烈钦佩或热爱，常达到过度或无批判的程度。",
      "example_en": "Teenagers often worship pop stars as if they were gods.",
      "example_cn": "青少年常常把流行明星当作神明一样崇拜。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "adore",
      "analysis": "“Adore” (热爱/敬爱) 强调一种充满情感的、近乎痴迷的爱慕，常用于人或事物，带有强烈的个人情感色彩，但不一定涉及宗教仪式。而 “worship” 更正式、更仪式化，常用于宗教语境，或比喻性地表达极端崇拜。"
    },
    {
      "word_to_compare": "revere",
      "analysis": "“Revere” (敬重/尊崇) 指因对方的品德、地位或成就而怀有深深的尊敬，语气庄重但不包含情感上的迷恋或献身。它更理性、更克制，而 “worship” 则带有情感投入和精神臣服的意味。"
    },
    {
      "word_to_compare": "venerate",
      "analysis": "“Venerate” (崇敬) 通常用于对圣人、祖先或传统表示尊敬，强调尊重与敬畏，多用于宗教或文化传统语境。它比 “worship” 更温和，不包含献祭或崇拜的仪式性行为，更偏向于精神上的敬仰。"
    }
  ]
}