{
  "word": "wounded",
  "pronunciation": "woo·nḍid",
  "concise_definition": "adj. 受伤的, 有伤的; v. 伤害, 使受伤（wound 的过去式和过去分词）",
  "forms": {
    "base_form": "wound",
    "past_tense": "wounded",
    "past_participle": "wounded",
    "present_participle": "wounding",
    "third_person_singular": "wounds"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Injured, especially by physical force such as a blow, bullet, or blade; referring to a person or animal that has suffered bodily harm.",
      "explanation_cn": "指因外力（如打击、子弹或刀具）而身体受伤的，常用于描述人或动物遭受的肉体伤害。",
      "example_en": "The wounded soldier was carried off the battlefield by his comrades.",
      "example_cn": "这名受伤的士兵被战友从战场上抬了下去。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Emotionally or psychologically harmed; describing deep emotional pain or trauma, often used metaphorically.",
      "explanation_cn": "指情感或心理上受到伤害的，常用于隐喻性表达，形容深刻的痛苦或创伤。",
      "example_en": "She carried wounded pride after being publicly criticized by her boss.",
      "example_cn": "她在被老板公开批评后，内心充满了受伤的自尊。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause physical injury to someone or something, typically through violence or accident.",
      "explanation_cn": "指通过暴力或意外对人或物造成身体伤害。",
      "example_en": "The hunter wounded the deer but failed to kill it.",
      "example_cn": "猎人射伤了鹿，但未能将其杀死。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause emotional or psychological harm to someone, often through betrayal, insult, or neglect.",
      "explanation_cn": "指通过背叛、侮辱或忽视等方式对他人造成情感或心理上的伤害。",
      "example_en": "His harsh words wounded her deeply, even though he didn't mean to.",
      "example_cn": "他刻薄的话语深深伤害了她，尽管他本无意如此。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "injured",
      "analysis": "“Injured”（受伤的）是更中性、更广泛的术语，适用于所有类型的伤害，包括轻微擦伤或严重创伤，常用于医疗或法律语境。而 “wounded” 更常用于暴力、战争或攻击导致的伤害，带有更强的故意性或戏剧性色彩。"
    },
    {
      "word_to_compare": "hurt",
      "analysis": "“Hurt”（疼痛/伤害）是更口语化、更通用的词，可指身体或情感上的不适，但程度较轻，不强调严重性或外伤。“Wounded” 则暗示更严重的、可见的或持久的伤害，尤其在身体层面时，常与武器或战斗相关。"
    },
    {
      "word_to_compare": "damaged",
      "analysis": "“Damaged”（受损的）通常用于物体、结构或系统，强调功能或完整性被破坏，如“damaged car”或“damaged reputation”。而 “wounded” 主要用于有生命体（人或动物）的生理或心理创伤，不适用于无生命物的物理损坏。"
    }
  ]
}