{
  "word": "wound",
  "pronunciation": "woond",
  "concise_definition": "n. 伤口, 伤痕; v. 使受伤, 使痛苦",
  "forms": {
    "third_person_singular": "wounds",
    "past_tense": "wounded",
    "past_participle": "wounded",
    "present_participle": "wounding"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An injury to the body caused by a cut, blow, or other physical trauma, often breaking the skin or damaging tissue.",
      "explanation_cn": "由切割、撞击或其他物理创伤导致的身体损伤，通常会破坏皮肤或组织。",
      "example_en": "The soldier was treated for a gunshot wound to the leg.",
      "example_cn": "这名士兵因腿部中弹而接受治疗。"
    },
    {
      "pos": "noun",
      "explanation_en": "An emotional or psychological injury, such as deep hurt, trauma, or lasting pain caused by betrayal, loss, or abuse.",
      "explanation_cn": "指情感或心理上的伤害，如因背叛、失去或虐待而造成的深刻痛苦或持久创伤。",
      "example_en": "Her childhood neglect left deep emotional wounds that took years to heal.",
      "example_cn": "她童年时的忽视留下了深刻的情感创伤，花了多年才愈合。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause physical injury to someone, especially by cutting, piercing, or striking with force.",
      "explanation_cn": "指通过切割、刺穿或强力击打使他人身体受伤。",
      "example_en": "The falling branch wounded several hikers on the trail.",
      "example_cn": "掉落的树枝使几名徒步者受伤。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause emotional pain or distress to someone, often through words or actions that hurt their feelings or self-esteem.",
      "explanation_cn": "指通过言语或行为伤害他人的情感或自尊，使其感到痛苦。",
      "example_en": "His harsh criticism wounded her pride and made her withdraw from the group.",
      "example_cn": "他尖锐的批评伤害了她的自尊，使她退出了团体。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "injury",
      "analysis": "“Injury” (伤害) 是一个更广泛、更中性的术语，泛指任何形式的身体或功能损害，包括骨折、扭伤、烧伤等，不一定涉及皮肤破裂。而 “wound” 通常特指由外部力量造成的开放性创伤，如刀伤、枪伤，强调皮肤或组织的破损。"
    },
    {
      "word_to_compare": "hurt",
      "analysis": "“Hurt” (疼痛/伤害) 既可以指身体疼痛，也可以指情感伤害，但语义更口语化、更笼统，不强调创伤的物理形态。而 “wound” 在作名词时具有更强的视觉和医学意象，在作动词时更正式，常用于描述造成深层或持久伤害的行为。"
    },
    {
      "word_to_compare": "trauma",
      "analysis": "“Trauma” (创伤) 通常指严重的、长期的心理或生理冲击，常用于临床语境，强调事件的极端性和对心理结构的破坏性影响。而 “wound” 可以是轻微或严重的，既可以是身体的也可以是心理的，但语义范围更广，也更常用于日常语言中。"
    }
  ]
}