{
  "word": "woven",
  "pronunciation": "woh·vuhn",
  "concise_definition": "adj. 编织的, 编织而成的; v. 编织（weave 的过去分词）",
  "forms": {
    "base_form": "weave",
    "past_tense": "wove",
    "past_participle": "woven",
    "present_participle": "weaving"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Made by interlacing threads, yarns, or strips of material, typically on a loom, to form fabric or a structured surface.",
      "explanation_cn": "指通过将线、纱或条状材料相互交织而成的织物或结构表面，通常使用织布机完成。",
      "example_en": "The antique rug was a beautifully woven tapestry of red and gold threads.",
      "example_cn": "这块古董地毯是一幅由红金丝线精心编织而成的挂毯。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Figuratively, describing something that is intricately integrated or blended, as if threads were woven together, often referring to ideas, stories, or systems.",
      "explanation_cn": "比喻意义上，形容事物被错综复杂地融合或交织在一起，如同丝线编织一般，常用于描述思想、故事或系统。",
      "example_en": "The novel weaves together themes of love, loss, and identity into a powerful narrative.",
      "example_cn": "这部小说将爱情、失去与身份的主题交织成一个强有力的故事。"
    },
    {
      "pos": "verb",
      "explanation_en": "The past participle of 'weave'; used in passive constructions to indicate the action of interlacing materials to form fabric or patterns.",
      "explanation_cn": "动词 'weave' 的过去分词形式，用于被动语态中，表示将材料交织成织物或图案的动作。",
      "example_en": "The silk was woven by hand in a small village in China.",
      "example_cn": "这种丝绸是在中国的一个小村庄里手工编织而成的。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "knitted",
      "analysis": "“Knitted”（针织的）指通过用针将线圈相互穿套形成的织物，结构呈环状，富有弹性；而 “woven”（编织的）是通过经线与纬线垂直交织形成的，结构更紧密、不易拉伸。两者都是纺织工艺，但方法和成品特性不同。"
    },
    {
      "word_to_compare": "braided",
      "analysis": "“Braided”（编结的）指将三股或更多股材料（如头发、绳索）交叉编成辫子状，通常沿一个方向进行；而 “woven” 强调的是二维平面或三维结构中多方向的交叉交织，结构更复杂、覆盖面积更大。"
    },
    {
      "word_to_compare": "intertwined",
      "analysis": "“Intertwined”（交织的）是抽象或比喻用法，强调两个或多个事物在概念、情感或关系上紧密缠绕，如“命运交织”；而 “woven” 既可以用于具体物理编织，也可用于比喻，但更强调“有结构地、系统性地融合”，常带有手工或工艺的意象。"
    }
  ]
}