{
  "word": "wraps",
  "pronunciation": "raps",
  "concise_definition": "n. 围巾, 包裹物, 卷饼; v. 包裹, 缠绕, 包装",
  "forms": {
    "third_person_singular": "wraps",
    "past_tense": "wrapped",
    "past_participle": "wrapped",
    "present_participle": "wrapping",
    "plural": "wraps"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A piece of fabric or material worn around the neck, shoulders, or head for warmth or decoration, often lightweight and versatile.",
      "explanation_cn": "指一块用于围在脖子、肩膀或头上以保暖或装饰的轻便织物，通常具有多功能性。",
      "example_en": "She wore a silk wrap to keep warm during the autumn evening.",
      "example_cn": "她在秋夜戴上一条丝绸围巾保暖。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of food consisting of a flatbread (like a tortilla) rolled around a filling such as vegetables, meat, or cheese.",
      "explanation_cn": "指一种用扁平面包（如玉米饼）包裹蔬菜、肉类或奶酪等馅料制成的卷状食品。",
      "example_en": "For lunch, I ordered a chicken wrap with avocado and spinach.",
      "example_cn": "午餐我点了一份配牛油果和菠菜的鸡肉卷饼。"
    },
    {
      "pos": "noun",
      "explanation_en": "A covering or layer formed by wrapping something, often used to protect or contain an object.",
      "explanation_cn": "指通过包裹形成的覆盖层或层状物，常用于保护或容纳物品。",
      "example_en": "The gift was hidden under several layers of colorful wraps.",
      "example_cn": "礼物被几层彩色包装纸包裹着。"
    },
    {
      "pos": "verb",
      "explanation_en": "To coil, fold, or enclose something completely with a material such as cloth, paper, or plastic.",
      "explanation_cn": "指用布料、纸张或塑料等材料将某物完全缠绕、折叠或包裹起来。",
      "example_en": "He wrapped the fragile vase in bubble wrap before shipping it.",
      "example_cn": "他在寄送易碎花瓶前用气泡膜把它包了起来。"
    },
    {
      "pos": "verb",
      "explanation_en": "To surround or envelop something, often metaphorically, such as emotions, sounds, or atmospheres.",
      "explanation_cn": "指（常为比喻义）包围或笼罩某物，如情绪、声音或氛围。",
      "example_en": "The forest was wrapped in a thick mist at dawn.",
      "example_cn": "黎明时分，森林被一层浓雾笼罩。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cover",
      "analysis": "“Cover”（覆盖）强调在物体表面形成一层遮蔽物，不一定完全包裹，也不一定紧密贴合，用途广泛，如遮阳、防尘。而 “wrap” 更强调用材料紧密地缠绕或包裹，常有保护、固定或隐藏的意图。"
    },
    {
      "word_to_compare": "package",
      "analysis": "“Package”（包装）通常指为运输或销售而进行的系统性封装，包含结构化材料（如纸箱、泡沫）和标准化流程。而 “wrap” 更口语化、更灵活，可指临时或手工的包裹行为，如用纸包礼物或用饼卷食物。"
    },
    {
      "word_to_compare": "scarf",
      "analysis": "“Scarf”（围巾）是 “wrap” 作为名词时的一种具体类型，专指围在颈部的织物。而 “wrap” 作为名词时范围更广，可指披肩、头巾或食物卷，不局限于颈部使用。此外，“scarf” 一般不作动词使用，而 “wrap” 是高度通用的动词。"
    }
  ]
}