{
  "word": "wrap",
  "pronunciation": "ræp",
  "concise_definition": "v. 包裹, 包装, 围绕; n. 围巾, 披肩",
  "forms": {
    "third_person_singular": "wraps",
    "past_tense": "wrapped",
    "past_participle": "wrapped",
    "present_participle": "wrapping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To cover or enclose something completely by winding material such as paper, cloth, or plastic around it.",
      "explanation_cn": "指用纸、布、塑料等材料将某物完全缠绕或包裹起来，以保护、隐藏或装饰。",
      "example_en": "She wrapped the gift in shiny red paper and tied it with a ribbon.",
      "example_cn": "她用闪亮的红纸把礼物包好，并用丝带系上。"
    },
    {
      "pos": "verb",
      "explanation_en": "To surround or envelop something or someone, often figuratively, such as with sound, smoke, or emotion.",
      "explanation_cn": "指（常为比喻义）用声音、烟雾、情绪等将某物或某人包围或笼罩。",
      "example_en": "The city was wrapped in a thick fog this morning.",
      "example_cn": "今天早上，这座城市被一层浓雾笼罩。"
    },
    {
      "pos": "verb",
      "explanation_en": "To conclude or bring something to an end, especially in a final or decisive manner (often used in media or storytelling).",
      "explanation_cn": "指（尤用于媒体或叙事中）以一种最终或决定性的方式结束某事。",
      "example_en": "The director wrapped filming after three intense months of shooting.",
      "example_cn": "导演在经历了三个月紧张的拍摄后结束了全部拍摄工作。"
    },
    {
      "pos": "noun",
      "explanation_en": "A piece of fabric worn around the shoulders or head, typically for warmth or fashion, such as a shawl or scarf.",
      "explanation_cn": "指一种披在肩部或头部的织物，通常用于保暖或时尚，如披肩或围巾。",
      "example_en": "She chose a soft wool wrap to stay warm during the autumn evening.",
      "example_cn": "她选了一条柔软的羊毛披肩，在秋夜保暖。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "pack",
      "analysis": "“Pack” (打包) 强调将物品整齐地装入容器或包裹中，以便运输或储存，常涉及组织和压缩，如打包行李。“Wrap” 更侧重于用材料层层缠绕覆盖，强调外部包裹的动作，不一定有收纳或运输目的。"
    },
    {
      "word_to_compare": "cover",
      "analysis": "“Cover” (覆盖) 是一个更宽泛的词，指任何使某物部分或全部被遮蔽的行为，可以是临时的、不紧密的，如用布盖住桌子。“Wrap” 则暗示更紧密、更完整的包裹，通常涉及环绕和固定，具有更强的包裹性和完整性。"
    },
    {
      "word_to_compare": "envelop",
      "analysis": "“Envelop” (包围) 与 “wrap” 在比喻义上相近，都表示完全包围，但 “envelop” 更正式、更具文学性，常用于抽象概念（如被寂静包围），而 “wrap” 更口语化，既可用于物理包裹，也可用于比喻，如 ‘wrapped in emotion’，使用范围更广。"
    }
  ]
}