{
  "word": "wrecks",
  "pronunciation": "rekts",
  "concise_definition": "n. 残骸, 毁灭; v. 毁坏, 破坏",
  "forms": {
    "singular": "wreck",
    "third_person_singular": "wrecks",
    "past_tense": "wrecked",
    "past_participle": "wrecked",
    "present_participle": "wrecking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The remains of something that has been severely damaged or destroyed, especially a vehicle, ship, or aircraft after an accident.",
      "explanation_cn": "指严重损坏或毁灭后的残骸，尤指交通事故后的车辆、船只或飞机残体。",
      "example_en": "The divers explored the wreck of the Titanic, which lies at the bottom of the Atlantic Ocean.",
      "example_cn": "潜水员探索了沉没在大西洋底部的泰坦尼克号残骸。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person or thing that has been ruined or broken down, often physically or emotionally; a state of severe deterioration.",
      "explanation_cn": "指身体或情感上被彻底摧毁的人或事物；一种严重衰败的状态。",
      "example_en": "After the divorce, he was a wreck—unable to sleep or eat properly.",
      "example_cn": "离婚后，他形同废人，无法正常睡眠或进食。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause severe damage or destruction to something, often suddenly or violently.",
      "explanation_cn": "指突然或猛烈地对某物造成严重破坏或毁灭。",
      "example_en": "The storm wrecked the coastal villages, leaving thousands homeless.",
      "example_cn": "风暴摧毁了沿海村庄，使数千人无家可归。"
    },
    {
      "pos": "verb",
      "explanation_en": "To ruin or destroy someone’s health, emotions, or mental state through prolonged stress or hardship.",
      "explanation_cn": "指通过长期的压力或苦难摧毁某人的健康、情绪或精神状态。",
      "example_en": "Years of overwork have wrecked her health.",
      "example_cn": "多年的过度劳累已经毁掉了她的健康。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "ruins",
      "analysis": "“Ruins” (废墟) 通常指建筑或结构因时间、战争或灾难而长期崩塌后的状态，强调静态的、遗留的残迹，常用于历史或考古语境。而 “wreck” 更强调破坏的瞬间性或剧烈性，且可指人或抽象事物的崩溃。"
    },
    {
      "word_to_compare": "destroy",
      "analysis": "“Destroy” (摧毁) 是一个更广泛、更中性的动词，指彻底消除某物的存在或功能，不强调残骸的遗留。而 “wreck” 常暗示破坏后仍留下可见的残骸，且多用于交通工具、建筑或身体/心理状态的崩溃。"
    },
    {
      "word_to_compare": "demolish",
      "analysis": "“Demolish” (拆除) 通常指有计划、有目的的拆毁，尤其用于建筑物，带有工程性或官方行为的意味。而 “wreck” 更偏向意外、暴力或非计划性的破坏，情感色彩更强，常含惋惜或震惊。"
    }
  ]
}