{
  "word": "wrecking",
  "pronunciation": "rek·ing",
  "concise_definition": "n. 破坏, 摧毁; v. 破坏 (wreck 的现在分词形式)",
  "forms": {
    "base_form": "wreck",
    "third_person_singular": "wrecks",
    "past_tense": "wrecked",
    "past_participle": "wrecked",
    "present_participle": "wrecking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act or process of destroying or damaging something severely, often resulting in complete ruin or disintegration.",
      "explanation_cn": "指严重破坏或摧毁某物的行为或过程，通常导致彻底的毁灭或解体。",
      "example_en": "The wrecking of the old factory made way for a new shopping center.",
      "example_cn": "旧工厂的拆除为新建购物中心腾出了空间。"
    },
    {
      "pos": "noun",
      "explanation_en": "The remains of something that has been destroyed, especially a ship, vehicle, or building.",
      "explanation_cn": "指被摧毁后的残骸，尤指船只、车辆或建筑物的残骸。",
      "example_en": "Divers explored the wrecking of the Titanic, now buried under layers of silt.",
      "example_cn": "潜水员探索了泰坦尼克号的残骸，如今它已被一层层淤泥覆盖。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause severe damage or destruction to something, often intentionally or through negligence.",
      "explanation_cn": "指对某物造成严重破坏或摧毁，通常是故意的或因疏忽所致。",
      "example_en": "The storm was wrecking homes along the coastline.",
      "example_cn": "风暴正在摧毁沿海地区的房屋。"
    },
    {
      "pos": "verb",
      "explanation_en": "To ruin or spoil something, especially a plan, relationship, or opportunity.",
      "explanation_cn": "指毁掉或破坏某事物，尤指计划、关系或机会。",
      "example_en": "His constant lying was wrecking their marriage.",
      "example_cn": "他不断的谎言正在毁掉他们的婚姻。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "destroy",
      "analysis": "“Destroy” (摧毁) 强调彻底消除某物的存在或功能，通常带有不可逆的含义，适用范围更广，可用于抽象或具体对象。而 “wrecking” 更常用于描述物理性破坏，尤其是大型物体（如车辆、建筑）的损毁，语气上更具画面感和动态性。"
    },
    {
      "word_to_compare": "demolish",
      "analysis": "“Demolish” (拆除/炸毁) 通常指有计划、有组织地拆除建筑物或结构，常用于建筑或城市更新语境，带有技术性和目的性。而 “wrecking” 更强调破坏的过程和结果，可能是意外、暴力或无序的，不一定是计划好的。"
    },
    {
      "word_to_compare": "ruin",
      "analysis": "“Ruin” (毁坏) 可用于抽象概念（如名誉、计划）和具体事物，语气更侧重于价值或功能的丧失，不一定伴随物理形态的破碎。而 “wrecking” 更强调物理形态的崩塌或严重损坏，常带有视觉冲击力，多用于实体对象。"
    }
  ]
}