{
  "word": "wrecked",
  "pronunciation": "rektd",
  "concise_definition": "adj. 毁坏的, 损坏严重的; v. 毁坏, 撞毁 (wreck 的过去式和过去分词)",
  "forms": {
    "base_form": "wreck",
    "past_tense": "wrecked",
    "past_participle": "wrecked",
    "present_participle": "wrecking",
    "plural": "wrecks"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "In a state of severe damage or destruction, often referring to vehicles, buildings, or structures that have been smashed or ruined beyond normal repair.",
      "explanation_cn": "处于严重损坏或毁灭的状态，通常指车辆、建筑物或其他结构被撞毁或破坏到无法正常修复的程度。",
      "example_en": "The car was a wrecked heap of metal after the crash.",
      "example_cn": "车祸后，这辆车变成了一堆毁坏的金属。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Informally, in a state of extreme physical or mental exhaustion, often used to describe someone who is utterly drained or overwhelmed.",
      "explanation_cn": "非正式用法，指身体或精神上极度疲惫的状态，常用来形容人筋疲力尽或不堪重负。",
      "example_en": "After working three shifts in a row, I was completely wrecked.",
      "example_cn": "连续上了三个班后，我彻底累垮了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To cause severe damage or destruction to something, especially a vehicle or structure, often through collision or violent force.",
      "explanation_cn": "使某物（尤指车辆或建筑）遭受严重损坏或毁灭，通常通过碰撞或强力作用造成。",
      "example_en": "The storm wrecked the coastal villages, leaving thousands homeless.",
      "example_cn": "风暴摧毁了沿海村庄，使数千人无家可归。"
    },
    {
      "pos": "verb",
      "explanation_en": "To ruin or destroy something abstract, such as health, reputation, or relationships, often through neglect, abuse, or excessive behavior.",
      "explanation_cn": "破坏或毁掉抽象事物，如健康、声誉或人际关系，通常因疏忽、滥用或过度行为所致。",
      "example_en": "Years of alcohol abuse wrecked his career and family life.",
      "example_cn": "多年的酗酒毁掉了他的事业和家庭生活。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "destroyed",
      "analysis": "“Destroyed” (摧毁) 强调彻底的、不可逆的毁灭，常用于物理或抽象实体的完全消除，语气更正式、更绝对。而 “wrecked” 虽然也表示严重损坏，但有时仍保留部分残骸或可修复的可能，语气更口语化，常用于描述事故或意外造成的破坏。"
    },
    {
      "word_to_compare": "damaged",
      "analysis": "“Damaged” (损坏) 指程度较轻的损害，通常不影响整体功能或结构，可修复。而 “wrecked” 表示的是极端严重的损坏，接近或达到完全报废的程度，语义强度远高于 “damaged”。"
    },
    {
      "word_to_compare": "exhausted",
      "analysis": "“Exhausted” (精疲力尽) 专指体力或精神上的极度疲劳，是中性或生理描述。而 “wrecked” 在非正式语境中虽可表示类似意思，但带有更强的情绪色彩和形象感，常隐含‘被彻底击垮’的意味，比 ‘exhausted’ 更生动、更夸张。"
    }
  ]
}