{
  "word": "wrestling",
  "pronunciation": "res·tlihng",
  "concise_definition": "n. 摔跤, 摔跤运动; v. 摔跤, 挣扎, 努力应对",
  "forms": {
    "noun": "wrestling",
    "verb_third_person_singular": "wrestles",
    "verb_past_tense": "wrestled",
    "verb_past_participle": "wrestled",
    "verb_present_participle": "wrestling"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A combat sport in which two individuals grapple with each other using specific techniques to gain control and pin the opponent to the ground, often governed by formal rules in competitive settings.",
      "explanation_cn": "一种格斗运动，两名选手使用特定技术相互缠斗，以控制对手并将其压倒在地，通常在正式比赛中遵循明确规则。",
      "example_en": "He has been training in wrestling since he was ten years old.",
      "example_cn": "他从十岁起就开始练习摔跤。"
    },
    {
      "pos": "verb",
      "explanation_en": "To engage in the physical sport of wrestling, using holds, throws, and leverage to overpower an opponent.",
      "explanation_cn": "参与摔跤运动，通过抓握、投掷和杠杆技巧制服对手。",
      "example_en": "The two athletes wrestled for over five minutes before one secured the pin.",
      "example_cn": "两名运动员搏斗了五分钟以上，直到一方成功将对手压倒制胜。"
    },
    {
      "pos": "verb",
      "explanation_en": "To struggle or fight against something difficult, often metaphorically, such as a problem, emotion, or decision.",
      "explanation_cn": "比喻性地与困难的事物作斗争，如问题、情绪或抉择，强调内心的挣扎或艰难努力。",
      "example_en": "She has been wrestling with guilt ever since the accident.",
      "example_cn": "自从那场事故以来，她一直为内疚所困扰。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fighting",
      "analysis": "“Fighting” (打斗) 是一个更广泛的术语，泛指任何形式的暴力冲突，包括拳击、格斗、争吵等，不特指技术性缠斗。而 “wrestling” 专指以控制、压制和摔投为核心的肢体对抗，强调技巧与规则，而非纯粹的攻击性暴力。"
    },
    {
      "word_to_compare": "struggling",
      "analysis": "“Struggling” (挣扎) 是一个抽象程度更高的词，可用于任何艰难努力，如经济困难、情感挣扎等，不涉及身体接触。而 “wrestling” 作为动词时，虽可比喻性使用，但其本义和核心意象始终与身体对抗相关，更具画面感和物理性。"
    },
    {
      "word_to_compare": "grappling",
      "analysis": "“Grappling” (缠斗) 与 “wrestling” 非常接近，常可互换，但 “grappling” 更强调“抓握”和“纠缠”的动作本身，常用于柔术、综合格斗等语境，而 “wrestling” 更偏向于竞技体育中的完整体系，包括得分规则、比赛形式和传统训练方法。"
    }
  ]
}