{
  "word": "wrestle",
  "pronunciation": "res·tl",
  "concise_definition": "v. 摔跤, 搏斗, 努力解决, 努力处理",
  "forms": {
    "third_person_singular": "wrestles",
    "past_tense": "wrestled",
    "past_participle": "wrestled",
    "present_participle": "wrestling"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To engage in the sport or physical contest of wrestling, where two opponents grapple with each other in an attempt to gain control and pin the other to the ground.",
      "explanation_cn": "指参与摔跤这项体育运动或身体对抗，两名对手相互扭打，试图控制对方并将其压倒在地。",
      "example_en": "The two athletes wrestled for over five minutes before one finally secured a pin.",
      "example_cn": "两名运动员搏斗了五分钟以上，直到其中一人最终成功将对手压倒制胜。"
    },
    {
      "pos": "verb",
      "explanation_en": "To struggle or fight physically or metaphorically against something difficult, such as a problem, emotion, or opposing force.",
      "explanation_cn": "指与困难的事物（如问题、情绪或对立力量）进行身体上或隐喻性的激烈斗争或挣扎。",
      "example_en": "She has been wrestling with guilt ever since the accident.",
      "example_cn": "自从那场事故以来，她一直为内疚所困扰。"
    },
    {
      "pos": "verb",
      "explanation_en": "To try hard to deal with or manage something complex or challenging, often with persistent effort.",
      "explanation_cn": "指付出持续努力去处理或应对复杂或具有挑战性的事物。",
      "example_en": "The government is wrestling with how to reduce inflation without causing a recession.",
      "example_cn": "政府正努力寻找在不引发经济衰退的前提下降低通货膨胀的方法。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fight",
      "analysis": "“Fight” (战斗/打架) 是一个更广泛的词，泛指任何形式的对抗，包括言语、武器或身体冲突，不一定涉及身体缠斗。而 “wrestle” 特指通过肢体扭打、抓握和控制进行的近身搏斗，强调身体接触和技巧性对抗。"
    },
    {
      "word_to_compare": "struggle",
      "analysis": "“Struggle” (挣扎/努力) 可用于身体或抽象情境，但更侧重于因阻力或困难而付出艰难努力，不一定包含直接的身体对抗。而 “wrestle” 在比喻用法中更强调一种主动、激烈、甚至带有对抗性的处理过程，常带有“与某物搏斗”的意象。"
    },
    {
      "word_to_compare": "grapple",
      "analysis": "“Grapple” (扭打/应对) 与 “wrestle” 非常接近，尤其在比喻义上常可互换，如 “grapple with a problem”。但 “grapple” 更强调“紧紧抓住并试图控制”，常用于智力或道德层面的艰难应对；而 “wrestle” 更具身体性和动态感，也更口语化。"
    }
  ]
}