{
  "word": "yard",
  "pronunciation": "yahrd",
  "concise_definition": "n. 院子, 码（长度单位）, 一堆, 场地",
  "forms": {
    "plural": "yards"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "An outdoor area adjacent to a building, typically enclosed by a fence or wall, used for gardening, recreation, or utility purposes.",
      "explanation_cn": "指紧邻建筑物的户外区域，通常由围栏或墙壁围起来，用于园艺、休闲或实用目的。",
      "example_en": "The children played in the backyard while their parents grilled dinner.",
      "example_cn": "孩子们在后院玩耍，而他们的父母正在烤晚餐。"
    },
    {
      "pos": "noun",
      "explanation_en": "A unit of length equal to three feet or 0.9144 meters, commonly used in the United States and the United Kingdom for measuring fabric, land, or distance.",
      "explanation_cn": "一种长度单位，等于三英尺或0.9144米，常用于美国和英国测量布料、土地或距离。",
      "example_en": "The fabric store sells material by the yard.",
      "example_cn": "这家布料店按码出售布料。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large open area used for a specific purpose, such as a railway yard, shipyard, or waste yard, often associated with industrial or logistical activity.",
      "explanation_cn": "指用于特定用途的大片空地，如铁路编组场、造船厂或垃圾场，通常与工业或物流活动相关。",
      "example_en": "The train was being repaired in the maintenance yard.",
      "example_cn": "这列火车正在维修场进行修理。"
    },
    {
      "pos": "noun",
      "explanation_en": "A large quantity or pile of something, often used informally to describe an abundance.",
      "explanation_cn": "指大量或一堆某物，常用于非正式语境中形容丰盛或堆积的状态。",
      "example_en": "There was a yard of paperwork to sort through after the meeting.",
      "example_cn": "会议结束后，有一大堆文件需要整理。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "garden",
      "analysis": "“Garden”（花园）特指种植花草、蔬菜或观赏植物的区域，强调园艺功能和美学设计；而 “yard” 更广泛，可包含草坪、车道、工具棚等非种植区域，功能更实用、更通用。"
    },
    {
      "word_to_compare": "meter",
      "analysis": "“Meter”（米）是国际单位制中的基本长度单位，全球通用；而 “yard” 是英制单位，主要在英美国家使用，1码约等于0.9144米，两者在数值和使用范围上存在显著差异。"
    },
    {
      "word_to_compare": "courtyard",
      "analysis": "“Courtyard”（庭院）特指被建筑物四面围合的内部开放空间，常见于公共建筑或传统住宅；而 “yard” 通常是单侧或后侧开放的，不一定是被建筑包围的，结构更自由、更日常化。"
    }
  ]
}