{
  "word": "yellow",
  "pronunciation": "yel·ou",
  "concise_definition": "adj. 黄色的, 黄的; n. 黄色; v. 变黄",
  "forms": {
    "comparative": "yellower",
    "superlative": "yellowest"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Of, relating to, or having the color of the part of the visible spectrum between green and orange, typically associated with sunshine, lemons, or gold.",
      "explanation_cn": "指可见光谱中位于绿色与橙色之间的颜色，通常与阳光、柠檬或黄金相关联。",
      "example_en": "The children painted the sun bright yellow in their artwork.",
      "example_cn": "孩子们在画中把太阳涂成了明亮的黄色。"
    },
    {
      "pos": "noun",
      "explanation_en": "The color between green and orange in the visible spectrum; also used to refer to things of this color.",
      "explanation_cn": "可见光谱中位于绿色与橙色之间的颜色；也可泛指具有这种颜色的事物。",
      "example_en": "She wore a stunning yellow dress to the party.",
      "example_cn": "她穿了一条令人惊艳的黄色连衣裙去参加派对。"
    },
    {
      "pos": "verb",
      "explanation_en": "To become yellow in color, especially due to age, decay, or exposure to the elements.",
      "explanation_cn": "指因老化、腐烂或暴露于自然环境中而变黄。",
      "example_en": "The old pages of the book had yellowed over time.",
      "example_cn": "这本书的旧书页随着时间的推移已经泛黄。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used figuratively to describe someone who is cowardly or lacking courage, especially in American slang.",
      "explanation_cn": "比喻用法，形容人胆小、缺乏勇气（尤用于美式俚语）。",
      "example_en": "He was called yellow for refusing to stand up to the bully.",
      "example_cn": "他因为不敢对抗欺凌者而被骂胆小鬼。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "amber",
      "analysis": "“Amber”（琥珀色）是一种偏红或偏橙的深黄色，常用于描述宝石、树脂或黄昏时的光线，带有温暖、浓郁的质感。而 “yellow” 是更基础、更中性的颜色名称，涵盖从浅黄到深黄的广泛色域，不带有特定色调倾向。"
    },
    {
      "word_to_compare": "gold",
      "analysis": "“Gold”（金色）通常指带有金属光泽的明亮黄色，常与财富、奢华或神圣性相关联，具有反射性和光泽感。而 “yellow” 是纯粹的颜色描述，不隐含材质或价值含义，更偏向视觉属性。"
    },
    {
      "word_to_compare": "ochre",
      "analysis": "“Ochre”（赭石色）是一种天然土黄色，偏棕或偏红，常见于自然地貌和古典绘画颜料，具有质朴、沉稳的视觉效果。相比之下，”yellow“ 更通用、更明亮，常用于现代语境，而 ochre 更具艺术和地质语境的特殊性。"
    }
  ]
}