{
  "word": "yelp",
  "pronunciation": "yelp",
  "concise_definition": "v. 尖叫, 哀鸣; n. 尖叫, 哀鸣声",
  "forms": {
    "third_person_singular": "yelps",
    "past_tense": "yelped",
    "past_participle": "yelped",
    "present_participle": "yelping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To make a short, high-pitched cry, typically due to pain, fear, or excitement, often used to describe the sound made by dogs or other animals.",
      "explanation_cn": "发出短促、高亢的叫声，通常因疼痛、恐惧或兴奋而发出，常用于描述狗或其他动物的叫声。",
      "example_en": "The dog yelped when it stepped on a thorn.",
      "example_cn": "狗踩到荆棘时发出了一声哀鸣。"
    },
    {
      "pos": "verb",
      "explanation_en": "To complain loudly or bitterly, often in a shrill or whining tone, especially when expressing dissatisfaction.",
      "explanation_cn": "大声或激烈地抱怨，常以尖锐或哀怨的语调表达不满。",
      "example_en": "She yelped about the poor service at the restaurant.",
      "example_cn": "她对餐厅糟糕的服务大加抱怨。"
    },
    {
      "pos": "noun",
      "explanation_en": "A short, high-pitched cry, especially one made by an animal in pain or distress.",
      "explanation_cn": "短促而高亢的叫声，尤指动物因疼痛或痛苦时发出的声音。",
      "example_en": "We heard a yelp from the backyard and rushed outside.",
      "example_cn": "我们听到后院传来一声哀鸣，立刻冲了出去。"
    },
    {
      "pos": "noun",
      "explanation_en": "A loud, shrill complaint or protest, often expressed in an emotional or exaggerated manner.",
      "explanation_cn": "一种尖锐、响亮的抱怨或抗议，常以情绪化或夸张的方式表达。",
      "example_en": "His yelp about the high rent got no sympathy from the landlord.",
      "example_cn": "他对房租高昂的抱怨并没有赢得房东的同情。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "howl",
      "analysis": "“Howl” (嚎叫) 指持续时间较长、音量更大、更悲怆或野性的叫声，常用于狼、狗在夜晚的长啸，带有强烈的情感色彩或仪式感。而 “yelp” 是短促、突然的尖叫，更强调瞬间的疼痛或惊吓，情感强度较低。"
    },
    {
      "word_to_compare": "shout",
      "analysis": "“Shout” (喊叫) 是人类发出的高声呼喊，通常为了引起注意、表达愤怒或命令，语境多为理性或有目的的交流。而 “yelp” 更偏向非理性、本能的反应，常用于动物或人在极度不适时的无意识发声。"
    },
    {
      "word_to_compare": "complain",
      "analysis": "“Complain” (抱怨) 是一个中性、通用的动词，指表达不满，语气可温和也可激烈，不带声音特征。而 “yelp” 作为动词时，不仅指抱怨，还隐含了尖锐、刺耳、情绪化甚至夸张的表达方式，带有强烈的听觉意象。"
    }
  ]
}