{
  "word": "yield",
  "pronunciation": "yēld",
  "concise_definition": "v. 产生, 屈服, 让步; n. 产量, 收益",
  "forms": {
    "third_person_singular": "yields",
    "past_tense": "yielded",
    "past_participle": "yielded",
    "present_participle": "yielding"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To produce or provide a result, especially a useful or measurable output such as profit, crop, or energy.",
      "explanation_cn": "指产生或提供某种结果，尤其是可衡量的有用产出，如利润、农作物或能源。",
      "example_en": "This orchard yields about 500 bushels of apples each year.",
      "example_cn": "这个果园每年产约500蒲式耳苹果。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give way under pressure, force, or persuasion; to surrender or concede, often reluctantly.",
      "explanation_cn": "指在压力、力量或劝说下让步、屈服或妥协，常带有不情愿的意味。",
      "example_en": "After hours of negotiation, the company finally yielded to the workers' demands.",
      "example_cn": "经过数小时的谈判，公司最终向工人的要求让步了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give precedence or right of way, especially in traffic or formal settings.",
      "explanation_cn": "指在交通或正式场合中让出优先权或通行权。",
      "example_en": "Drivers must yield to pedestrians at crosswalks.",
      "example_cn": "司机在斑马线前必须礼让行人。"
    },
    {
      "pos": "noun",
      "explanation_en": "The amount of product or return generated from a process, investment, or land, often expressed as a rate or quantity.",
      "explanation_cn": "指从某一过程、投资或土地中产生的产品或回报量，通常以比率或数量表示。",
      "example_en": "The bond has a high yield of 6% annually.",
      "example_cn": "这只债券的年收益率为6%。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "produce",
      "analysis": "“Produce” (生产) 强调制造或生成某物的过程，常用于工业、农业或艺术创作，语气中性。而 “yield” 更侧重于结果的产出量或回报，常用于衡量效率或收益，如土地产量、投资回报，带有量化和结果导向的意味。"
    },
    {
      "word_to_compare": "surrender",
      "analysis": "“Surrender” (投降) 指完全放弃抵抗或控制权，语气强烈且常含失败或被迫的意味。而 “yield” 在表示让步时语气较轻，可能是策略性或暂时的妥协，不一定意味着彻底失败，如交通让行或谈判让步。"
    },
    {
      "word_to_compare": "return",
      "analysis": "“Return” (回报) 通常用于金融或投资语境，指投入后获得的收益，强调收支关系。而 “yield” 作为名词时虽也用于金融，但更广泛地用于农业、工程等领域，泛指任何过程的产出，语义范围更广。"
    }
  ]
}