{
  "word": "yields",
  "pronunciation": "yēldz",
  "concise_definition": "v. 产生, 提供, 让步, 产出; n. 产量, 收益",
  "forms": {
    "third_person_singular": "yields",
    "past_tense": "yielded",
    "past_participle": "yielded",
    "present_participle": "yielding"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To produce or provide something, especially as a result of effort, natural processes, or investment (e.g., crops, profits, or information).",
      "explanation_cn": "指通过努力、自然过程或投资而产生或提供某种结果，如农作物、利润或信息。",
      "example_en": "The orchard yields over 10,000 apples each season.",
      "example_cn": "这个果园每个季节能产出超过一万颗苹果。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give way or surrender to pressure, demand, or authority, often reluctantly or under compulsion.",
      "explanation_cn": "指在压力、要求或权威面前让步或退让，通常带有不情愿或被迫的意味。",
      "example_en": "After hours of negotiation, the company finally yielded to the workers' demands.",
      "example_cn": "经过数小时的谈判，公司最终向工人的要求让步了。"
    },
    {
      "pos": "verb",
      "explanation_en": "To give up one's right, claim, or position to another, especially in a formal or legal context.",
      "explanation_cn": "指在正式或法律语境中将自身的权利、主张或职位让与他人。",
      "example_en": "He yielded his seat on the board to a more experienced director.",
      "example_cn": "他将董事会席位让给了更有经验的董事。"
    },
    {
      "pos": "noun",
      "explanation_en": "The amount of product, profit, or return generated from an investment, crop, or process over a specific period.",
      "explanation_cn": "指在特定时期内从投资、农作物或过程中所产生的产品、利润或回报数量。",
      "example_en": "The bond has a high yield of 5.2% annually.",
      "example_cn": "这只债券的年收益率高达5.2%。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "produces",
      "analysis": "“Produces” (生产) 更强调制造或生成的过程，常用于工业、农业或艺术创作中，语气中性且直接。而 “yields” 更侧重于结果或回报，常用于描述投入后的产出效益，带有更强的经济或功能性含义，如投资回报或作物收成。"
    },
    {
      "word_to_compare": "gives",
      "analysis": "“Gives” (给予) 是一个通用词，泛指任何形式的给予，可以是物质、情感或抽象事物，语义广泛但不够精确。而 “yields” 在表示“让步”或“产出”时更具语境限定性，常用于正式、技术或经济语境，强调结果的必然性或可衡量性。"
    },
    {
      "word_to_compare": "returns",
      "analysis": "“Returns” (回报) 与 “yields” 在金融语境中常可互换，但 “returns” 更强调收益的返还性质，常用于投资分析中计算净收益；而 “yields” 更侧重于周期性或持续性的产出率，如债券收益率、土地亩产，更常用于描述比率或效率。"
    }
  ]
}