{
  "word": "yoke",
  "pronunciation": "yōk",
  "concise_definition": "n. 轭, 束缚; v. 用轭连接, 使受束缚",
  "forms": {
    "plural": "yokes",
    "third_person_singular": "yokes",
    "past_tense": "yoked",
    "past_participle": "yoked",
    "present_participle": "yoking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A wooden bar or frame used to join a pair of oxen or other draft animals at the neck so they can pull together, typically used in agriculture.",
      "explanation_cn": "一种木制横杆或框架，用于将一对牛或其他挽畜的颈部连接起来，使它们能够协同拉重物，常用于农业。",
      "example_en": "The farmer adjusted the yoke to ensure the oxen pulled evenly.",
      "example_cn": "农夫调整了轭具，以确保两头牛均匀发力。"
    },
    {
      "pos": "noun",
      "explanation_en": "A symbol or means of oppression, control, or subjugation; a burdensome constraint or obligation.",
      "explanation_cn": "指压迫、控制或奴役的象征或手段；一种沉重的束缚或义务。",
      "example_en": "The people rose up to break the yoke of colonial rule.",
      "example_cn": "人民奋起反抗，挣脱了殖民统治的枷锁。"
    },
    {
      "pos": "verb",
      "explanation_en": "To join or connect two people or things, especially in a way that imposes a shared burden or responsibility.",
      "explanation_cn": "将两个人或事物连接起来，尤指以一种强加共同负担或责任的方式。",
      "example_en": "The two companies were yoked together in a joint venture.",
      "example_cn": "两家公司被联合起来开展一项合资项目。"
    },
    {
      "pos": "verb",
      "explanation_en": "To put a yoke on an animal, especially an ox, to prepare it for pulling a plow or cart.",
      "explanation_cn": "给动物（尤指牛）戴上轭具，以准备其拉犁或拉车。",
      "example_en": "The farmer yoked the bulls before dawn to begin plowing the field.",
      "example_cn": "农夫在黎明前给公牛戴上轭具，开始耕田。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "bond",
      "analysis": "“Bond”（纽带/联系）泛指人与人、物与物之间的连接，可以是情感、法律或物理的，通常中性或积极，如“情感纽带”。“Yoke”则带有强烈的压迫性、强制性含义，多用于描述不平等或沉重的束缚，语义更负面。"
    },
    {
      "word_to_compare": "chain",
      "analysis": "“Chain”（链条）是具体的物理束缚工具，常用于字面或隐喻地表示限制自由。“Yoke”虽也可指物理工具，但更强调“共同承担负担”的配对性，且常用于抽象语境（如政治压迫），比“chain”更具象征性和文化意象。"
    },
    {
      "word_to_compare": "link",
      "analysis": "“Link”（连接）是中性词，指两个事物之间的简单连接，无强制或负担含义，如“数据链接”。“Yoke”则隐含权力不对等、责任共担和强制性，语义强度远高于“link”。"
    }
  ]
}