{
  "word": "yorkshire",
  "pronunciation": "yohrk·sheer",
  "concise_definition": "n. 约克郡（英国地名）；adj. 约克郡的",
  "forms": {
    "proper_noun": true
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A historic county in northern England, known for its rolling hills, moorlands, industrial heritage, and distinctive dialect and culture; it is now administratively divided into several regions including North Yorkshire, West Yorkshire, and South Yorkshire.",
      "explanation_cn": "英国北部的一个历史悠久的郡，以其连绵的丘陵、荒原、工业遗产以及独特的方言和文化而闻名；如今在行政上划分为多个区域，包括北约克郡、西约克郡和南约克郡。",
      "example_en": "She grew up in the heart of Yorkshire, surrounded by sheep farms and ancient stone walls.",
      "example_cn": "她在约克郡腹地长大，四周是绵羊农场和古老的石墙。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or originating from Yorkshire, especially describing its people, dialect, food, or traditions.",
      "explanation_cn": "与约克郡相关或源自约克郡的，尤指其居民、方言、食物或传统。",
      "example_en": "Yorkshire pudding is a traditional British dish served with roast beef.",
      "example_cn": "约克郡布丁是一种与烤牛肉一起食用的传统英式菜肴。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person from Yorkshire; often used to describe someone with the characteristic traits associated with the region, such as directness, practicality, and dry humor.",
      "explanation_cn": "来自约克郡的人；常用来形容具有该地区典型特质的人，如直率、务实和冷幽默。",
      "example_en": "He’s a true Yorkshireman—no nonsense, hardworking, and always ready with a wry joke.",
      "example_cn": "他是个地道的约克郡人——不啰嗦、勤劳，总能冒出一句冷幽默。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "lancashire",
      "analysis": "“Lancashire”（兰开夏）是英格兰西北部另一个历史郡，与约克郡相邻，同样以工业革命遗产和地方饮食闻名（如兰开夏炖肉）。但约克郡更广为人知的是其荒原风光、约克郡布丁和方言，而兰开夏则以纺织业和更密集的城市化著称。两者虽同属英格兰北部，但文化认同和地理特征有明显差异。"
    },
    {
      "word_to_compare": "northern",
      "analysis": "“Northern”（北方的）是一个泛指英格兰北部地区的形容词，涵盖约克郡、兰开夏、达勒姆等多个区域。而 “Yorkshire” 是一个具体的地理和文化实体，具有独特的历史、语言和身份认同。使用 “northern” 时语义更宽泛，而 “Yorkshire” 则带有强烈的地方自豪感和具体文化内涵。"
    },
    {
      "word_to_compare": "geordie",
      "analysis": "“Geordie” 是指来自英格兰东北部泰恩赛德地区（如纽卡斯尔）的人或其方言，与约克郡人（Yorkshireman）在口音、词汇和文化上截然不同。虽然两者都属于英格兰北部，但约克郡人以直率务实著称，而盖尔迪人则以独特的口音和强烈的社区认同闻名，二者常被当地人视为不同的文化群体。"
    }
  ]
}