{
  "word": "zion",
  "pronunciation": "zī·ən",
  "concise_definition": "n. 锡安, 天国, 圣地",
  "forms": {
    "plural": "zions"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A hill in Jerusalem, historically significant in Judaism as the site of the ancient Temple and the city of David; later adopted in Christian and Islamic traditions as a symbol of divine presence and spiritual refuge.",
      "explanation_cn": "耶路撒冷的一座山丘，在犹太教中具有历史重要性，是古代圣殿和大卫城的所在地；后被基督教和伊斯兰教传统采纳，作为神之临在与灵性庇护所的象征。",
      "example_en": "The psalms frequently praise Zion as the dwelling place of God.",
      "example_cn": "诗篇中常赞美锡安为上帝的居所。"
    },
    {
      "pos": "noun",
      "explanation_en": "In African American religious and cultural contexts, especially within the Rastafari movement, Zion represents an idealized homeland or utopian future of freedom, justice, and spiritual fulfillment, often contrasted with 'Babylon' (oppressive systems).",
      "explanation_cn": "在非裔美国人宗教与文化语境中，尤其在拉斯塔法里运动中，锡安象征着一个理想化的故土或自由、正义与灵性圆满的乌托邦未来，常与‘巴比伦’（压迫性体系）相对立。",
      "example_en": "Rastafarians believe they will one day return to Zion, their spiritual and ancestral homeland.",
      "example_cn": "拉斯塔法里信徒相信，他们终将回归锡安——他们的灵性与祖先故土。"
    },
    {
      "pos": "noun",
      "explanation_en": "A metaphorical term for any place or state regarded as a perfect, sacred, or ideal community, often used in literature and political discourse to evoke hope or divine promise.",
      "explanation_cn": "一种隐喻性术语，指任何被视为完美、神圣或理想社群的地方或状态，常用于文学与政治话语中，以唤起希望或神圣应许。",
      "example_en": "The settlers dreamed of building a Zion in the new land, free from corruption and war.",
      "example_cn": "这些定居者梦想在新土地上建立一个没有腐败与战争的锡安。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "heaven",
      "analysis": "“Heaven”（天堂）通常指死后灵魂所去的终极神圣领域，强调超越性的永恒福乐；而 “Zion” 更具地理与历史具体性，既可以是真实地点（耶路撒冷），也可以是人间可实现的理想社会，具有更强的集体性与现实参与感。"
    },
    {
      "word_to_compare": "eden",
      "analysis": "“Eden”（伊甸园）指人类堕落前的原始完美状态，强调纯真与未被污染的自然和谐；而 “Zion” 则常指向通过信仰、抗争或重建而达成的神圣秩序，带有历史进程与救赎的意味，更具动态性和斗争性。"
    },
    {
      "word_to_compare": "utopia",
      "analysis": "“Utopia”（乌托邦）是哲学上虚构的完美社会模型，通常无宗教或历史根基；而 “Zion” 深植于宗教传统与民族记忆，其理想性源于神圣启示而非理性设计，具有更强的信仰权威与文化认同感。"
    }
  ]
}