{
  "word": "zip",
  "pronunciation": "zip",
  "concise_definition": "n. 拉链, 速度, 突然的响声; v. 拉上拉链, 快速移动, 发出嗖嗖声",
  "forms": {
    "third_person_singular": "zips",
    "past_tense": "zipped",
    "past_participle": "zipped",
    "present_participle": "zipping"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A fastener consisting of two rows of teeth or coils that interlock when pulled together by a slider, commonly used on clothing, bags, and other items.",
      "explanation_cn": "一种由两排齿状或螺旋状结构组成的紧固装置，通过滑块拉动时相互咬合，常用于衣物、包袋等物品上。",
      "example_en": "She zipped up her jacket before stepping out into the cold.",
      "example_cn": "她出门前拉上了夹克的拉链。"
    },
    {
      "pos": "noun",
      "explanation_en": "A high speed or rapid movement, often used in informal contexts to describe energetic or swift action.",
      "explanation_cn": "指快速移动或高速状态，常用于非正式语境中形容迅速、敏捷的动作。",
      "example_en": "The sports car went from 0 to 60 in zip.",
      "example_cn": "这辆跑车从0加速到60英里/小时只需一瞬间。"
    },
    {
      "pos": "noun",
      "explanation_en": "A short, sharp sound, especially the sound made by a zipper being pulled or by something moving quickly through the air.",
      "explanation_cn": "一种短促尖锐的声音，尤指拉链被拉动时或物体快速划过空气时发出的嗖嗖声。",
      "example_en": "There was a zip as the arrow flew past his ear.",
      "example_cn": "箭从他耳边飞过时发出了一声嗖响。"
    },
    {
      "pos": "verb",
      "explanation_en": "To fasten or close something with a zipper, or to move quickly while making a hissing or rushing sound.",
      "explanation_cn": "用拉链将某物拉上或关闭；或快速移动并发出嗖嗖声。",
      "example_en": "He zipped his suitcase shut and headed for the airport.",
      "example_cn": "他拉上行李箱，动身前往机场。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move or travel very quickly, often in a smooth or effortless manner.",
      "explanation_cn": "指非常迅速地移动或行进，常带有流畅、轻松的意味。",
      "example_en": "The motorcycle zipped through the traffic without slowing down.",
      "example_cn": "那辆摩托车毫不减速地穿梭在车流中。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "fasten",
      "analysis": "“Fasten”（系紧、扣上）是更广泛的动词，泛指任何将物体固定在一起的动作，如扣纽扣、系鞋带、锁门等。而 “zip” 特指使用拉链进行闭合，动作更具体、更依赖拉链结构。"
    },
    {
      "word_to_compare": "speed",
      "analysis": "“Speed”（速度）是名词或动词，泛指物体移动的快慢程度，是抽象概念。而 “zip” 作为动词时，不仅表示快速移动，还隐含了轻快、灵活甚至带声音的动态感，更具象、更口语化。"
    },
    {
      "word_to_compare": "swoosh",
      "analysis": "“Swoosh”（呼啸声）是拟声词，专指物体快速掠过空气时发出的长而柔和的呼呼声，如飞箭、滑板或飞机掠过的声音。而 “zip” 的声音更短促、尖锐，常与拉链或小型高速物体相关，音效更清脆。"
    }
  ]
}