{
  "word": "zoom",
  "pronunciation": "zum",
  "concise_definition": "v. 急速移动, 放大; n. 急速移动, 放大",
  "forms": {
    "third_person_singular": "zooms",
    "past_tense": "zoomed",
    "past_participle": "zoomed",
    "present_participle": "zooming"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To move quickly and smoothly, often with a humming or rushing sound, especially in a vehicle or by a person in motion.",
      "explanation_cn": "指快速而平稳地移动，通常伴随嗡嗡或呼啸声，尤指车辆或人在运动中疾驰。",
      "example_en": "The car zoomed past us on the highway.",
      "example_cn": "那辆车在高速公路上从我们身边疾驰而过。"
    },
    {
      "pos": "verb",
      "explanation_en": "To enlarge or magnify an image or part of an image, especially on a screen or photograph, to see details more clearly.",
      "explanation_cn": "指在屏幕或照片上放大图像或图像的某一部分，以便更清晰地查看细节。",
      "example_en": "She zoomed in on the photo to see the expression on the man's face.",
      "example_cn": "她将照片放大，以便看清那名男子脸上的表情。"
    },
    {
      "pos": "noun",
      "explanation_en": "A rapid movement or increase in speed, often used to describe a sudden forward motion.",
      "explanation_cn": "指快速的移动或速度的突然增加，常用于描述突然向前的冲势。",
      "example_en": "The bird took off with a zoom into the sky.",
      "example_cn": "那只鸟一声呼啸，直冲云霄。"
    },
    {
      "pos": "noun",
      "explanation_en": "The act or process of magnifying an image on a screen or camera, especially in digital photography or video conferencing.",
      "explanation_cn": "指在屏幕或摄像机上放大图像的行为或过程，尤指在数码摄影或视频会议中。",
      "example_en": "The presenter used a zoom to highlight the key data points.",
      "example_cn": "演讲者使用了放大功能来突出关键数据点。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "speed",
      "analysis": "“Speed” (速度) 是一个中性名词，仅指物体移动的快慢程度，不包含动作的动态感或声音意象。而 “zoom” 不仅表示快速移动，还隐含了方向性、突然性和视觉/听觉上的冲击感，更富表现力。"
    },
    {
      "word_to_compare": "magnify",
      "analysis": "“Magnify” (放大) 是一个更正式、技术性的词，专指通过光学或数字手段增大图像尺寸，强调精确性和目的性。而 “zoom” 更口语化，常用于日常语境，如手机或视频会议中快速放大，动作感更强，且可作动词和名词双向使用。"
    },
    {
      "word_to_compare": "rush",
      "analysis": "“Rush” (冲/急奔) 强调匆忙、紧迫甚至混乱的状态，常带情绪色彩（如焦虑、慌张）。而 “zoom” 更中性，甚至带有流畅、优雅的意味，常用于描述机械或自然物体的迅捷运动，如汽车、飞机或鸟类。"
    }
  ]
}